[
  {
    "course_id": 56,
    "course_code": "ECE 452",
    "course_name": "ECE452 - Software Design and Architectures (0.50)",
    "term_name": "List 3",
    "program_name": "Options: Faculty of Engineering",
    "program_id": 122,
    "major_id": 3,
    "major_name": "Computer Engineering Option",
    "topics": [
      "Software Design and Architectures Winter 2025",
      "10:00AM - 11:20AM MC 1056",
      "10:00AM - 11:20AM MC 1056",
      "10:00AM - 11:20AM MC 1056",
      "- Saarang Agarwal <saarang.agarwal@>",
      "- Bihui Jin <bihui.jin@>",
      "- Daniel Phan <daniel.phan@>",
      "- Amber Wang <jiale.wang@>",
      "ECE 452: View requirements for ECE 452",
      "Differentiate how various architectural styles and design patterns enhance and degrade a system’s functional, non-functional and human value properties;",
      "Create and implement an architecture and design, refining it into a complete system;",
      "1 Jan 06 Mon Introduction to Class",
      "Jan 15 Wed Use Cases, Human Values",
      "Jan 17 Fri **P0** Team Formation",
      "Jan 31 Fri **P2** Project Proposal",
      "Feb 12 Wed **P3** Iteration 1 Demo",
      "Feb 26 Wed Design Patterns 2 - Structural",
      "9 Mar 03 Mon Design Patterns 3 - Behavioral",
      "Mar 05 Wed **P4** Iteration 2 Demo",
      "10 Mar 10 Mon Design Patterns 4",
      "Mar 19 Wed **P5** Iteration 3 Demo",
      "Apr 02 Wed **P6** Final Presentation",
      "Apr 04 Fri **P7** Final Report",
      "Jan 17 P0: Team Formation -",
      "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.",
      "This includes those who experienced harm, those who are supporting others who experienced harm.",
      "SVPRO can be contacted at svpro@uwaterloo.ca",
      "Intellectual property includes items such as:"
    ]
  },
  {
    "course_id": 22,
    "course_code": "GEOG 420",
    "course_name": "GEOG420 - Ice Sheets and Glaciers (0.50)",
    "term_name": "Required Courses",
    "program_name": "Geography and Environmental Management",
    "program_id": 71,
    "major_id": 3,
    "major_name": "Earth Systems Science Specialization",
    "topics": [
      "Ice Sheets and Glaciers Winter 2025",
      "wesley.van.wychen@uwaterloo.ca",
      "wesley.van.wychen@uwaterloo.ca",
      "Key areas covered by the course include glacial mass change in a warming climate, ice dynamics, various spatial and temporal scales of glaciation, and geomorphological features caused by glaciation.",
      "The world's glaciers and ice sheets are changing as a result of human-driven climate change.",
      "Describe the core concepts of glacier mass balance",
      "Explain why glaciers flow and how this varies in time and space",
      "Critically analyze the implications of regional glacier loss in a warming climate",
      "Demonstrate critical thinking and knowledge synthesis through the preparation and presentation of a formal research project",
      "Jan 9 Global distribution of Glaciers",
      "Glacier Dynamics",
      "371-386; 436-440)",
      "Requests for Extensions: Requests of extension of the due dates for the submission of assignments is at the discretion of the instructor and will only be considered in situations that are deemed necessary.",
      "Intellectual property includes items such as:",
      "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics",
      "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.",
      "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.",
      "CEE provides an interview conflict procedure to manage these situations.",
      "Instructors maintain agency over considerations granted for missed course components.",
      "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.",
      "You are limited to one of these per term, and can only use it during the formal lecture period.",
      "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.",
      "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."
    ]
  },
  {
    "course_id": 53,
    "course_code": "CS 482",
    "course_name": "CS482 - Computational Techniques in Biological Sequence Analysis (0.50)",
    "term_name": "List 3",
    "program_name": "Computational Mathematics",
    "program_id": 38,
    "major_id": 1,
    "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)",
    "topics": [
      "Computational Techniques in Biological Sequence Analysis Winter 2025",
      "P. Millan Arias",
      "Dr. Pablo Millan Arias",
      "Email: pmillana[at]uwaterloo[dot]ca",
      "Email: mmwrana@uwaterloo.ca",
      "Email: j364zhu@uwaterloo.ca",
      "Computer science principles and algorithms in biological sequence analysis.",
      "Topics include algorithms for sequence comparison, for large-scale database search in biological databases, for sequence assembly, for evolutionary tree reconstruction, for identifying important features in DNA and RNA sequences, and underlying computational techniques for understanding strings and trees and for making probabilistic inferences.",
      "Topics include algotithms for sequence comparison, for large-scale database search in biological databases, for sequence assembly, for evolutionary tree reconstruction, for identifying important featrues in DNA and RNA sequences, and underlying computational techniques for understanding strings and trees and for making probabilistic inferences.",
      "Due to the large volume of data generated by genome sequencing and cellular measurements of gene expression changes, computer science and mathematics have profoundly changed the science of modern biology.",
      "Computational methods are now critical to developing experimental and analytical tools in biological sciences.",
      "Prerequisites: Students are not required to have any prior knowledge of molecular biology, but some understanding of basic biological concepts is beneficial.",
      "Get a first approximation to modern technologies being used as a substitute for classical algorithms to gain more insight into various biological mechanisms.",
      "Gain practical experience in obtaining data from online resources and analyzing the data within an appropriate biological context.",
      "L02 Jan 8 A primer in Computational Biology",
      "L05 Jan 20 Sequence Database search / Multiple Sequence Alignment",
      "L07 Jan 27 Genome assembly and mapping",
      "L10 Feb 5 Alignment free methods Deep Learning in Genomics",
      "L14 Mar 3 RNA-Sequencing & Gene Expression",
      "L18 Mar 17 RNA & protein structure prediction",
      "L20 Mar 24 Single-cell genomics",
      "L22 Mar 31 Foundations in Deep Learning: Transformer Models",
      "Nature Computational Biology compendium which collected a series of tutorials about classic computational biology-related topics, is available at: link",
      "Bioinformatics Algorithms: An Active Learning Approach (3rd Edition) (2018) by Phillip Compeau and Pavel Pevzner",
      "For each assignment, the source code and the assignment report will be reviewed and graded by the TA.",
      "The source code should be readable, runnable, and pass the tests.",
      "The project report should be detailed enough for the TA to run the code and expected to have the following sections: introduction, implementation details, results, and discussion.",
      "No justification is required for a late submission.",
      "Make-up exams require permission in advance with a doctor’s excuse in the case of illness."
    ]
  },
  {
    "course_id": 19,
    "course_code": "SYDE 212",
    "course_name": "SYDE212 - Probability and Statistics (0.50)",
    "term_name": "2B Term",
    "program_name": "Systems Design Engineering",
    "program_id": 158,
    "major_id": 5,
    "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)",
    "topics": [
      "Probability and Statistics Fall 2024",
      "11:30AM - 12:20PM E7 4433",
      "09:30AM - 11:20AM RCH 211",
      "11:30AM - 12:20PM E7 4433",
      "Mengqi Xu",
      "Analysis of experimental measurements.",
      "\"This course deals with the understanding and application of probability and statistical principles so that we may further our knowledge of any given area of interest through the appropriate collection and analysis of data in the presence of uncertainty and random variation.",
      "Focus will be more on the concepts and logic of statistics and the statistical method than on rote application of learned algorithms and ‘formulas’ (e.g. more on the ‘what’ and ‘why’ than on the ‘how’ of our calculations).",
      "(a) summarize and identify important characteristics of a dataset using graphical and numerical methods (1)",
      "(c) explain the concept and logic of statistical inference in terms of a parameter, a statistic, a population, a sample, and a probability distribution of a random variable (1)",
      "(d) explain the concept of and conduct/create a hypothesis test and confidence interval for a parameter of interest, and interpret the results in the context of the study (1, 2)",
      "(f) devise and implement a statistical study to answer questions about a population of interest (2, 3)",
      "The numbers that appear in parentheses at the end of each learning outcome refer to the so-called \"graduate attributes\" set by the Canadian Engineering Accreditation Board (CEAB); see https://uwaterloo.ca/engineering/graduate-attributes.",
      "*",
      "6 Midterm week: one close-book midterm examination to be scheduled.",
      "10 Applications: two-sample comparison and basics of experimental design; analysis of categorical data.",
      "*",
      "Electronic versions of both the text itself and the exercise manual will be available for download free of charge within learn.uwaterloo.ca.",
      "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.",
      "This includes those who experienced harm, those who are supporting others who experienced harm.",
      "SVPRO can be contacted at svpro@uwaterloo.ca",
      "Intellectual property includes items such as:"
    ]
  },
  {
    "course_id": 38,
    "course_code": "BME 461",
    "course_name": "BME461 - Biomedical Engineering Design Workshop 2 (0.50)",
    "term_name": "4A Term",
    "program_name": "Biomedical Engineering",
    "program_id": 16,
    "major_id": 2,
    "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)",
    "topics": [
      "Biomedical Engineering Design Workshop 2 Fall 2024",
      "10:30AM - 12:20PM E5 6127",
      "08:30AM - 10:20AM E5 6127",
      "The first half of a two-term engineering design project continuing the biomedical design workshop sequence.",
      "A prototype and interim progress report are presented at the end of the first term.",
      "• 0.25-2 hours for in-person course activities and meetings as scheduled.",
      "All accredited engineering programs in Canada culminate in a significant open-ended engineering design experience, which should involve teamwork and project management, and be conducted under the professional responsibility of faculty licensed to teach and/or practice engineering in Canada.",
      "The main goal of BME461 and BME462 is to have 4th year BME students demonstrate appropriate competencies by applying engineering design knowledge and skills gained throughout their BME undergraduate program to a substantial biomedical engineering project.",
      "The graduate attributes are assessed primarily through reports and presentations.",
      "Work within a team to advance a design project",
      "Investigate a need in biomedical engineering (this includes determining investigation approaches that are feasible and effective given the timeframe and the particular need and context)",
      "Develop and screen design concepts that are consistent with requirements and constraints",
      "Develop well justified engineering specifications for a design concept",
      "Analyze and iterate a design concept through analysis, modelling, and/or prototyping",
      "Recognize and document safety, ethical, and regulatory considerations relevant to a design concept",
      "Identify and address gaps in their competence to carry out a design project",
      "1 Sept 6 Course introduction & facilities tour",
      "2 Sept 13 Peer feedback: Needs Finding & Requirements",
      "3 Sept 20 Oral presentations: Needs Finding & Requirements",
      "4 Sept 27 Team meetings (engineering economics) & modules",
      "7 Oct 25 Team meetings (design concepts) & modules",
      "8 Nov 1 Peer feedback: Concepts Screening & modules",
      "12 Nov 29 Team meetings (ethics & safety) & modules",
      "Needs Finding & Requirements Team Presentation (Due: Sept 20) 5%",
      "Design Analysis Report (Due: Dec 3) 30%",
      "It is the responsibility of all team members’ to ensure the accuracy and quality of all aspects of submitted team-based deliverables.",
      "General Terms of Assessment:",
      "Your competence in execution of the engineering design process and in application of engineering knowledge, skills and tools.",
      "Your ability to communicate in writing and orally at an appropriate level",
      "Your attention to ethics, safety and risk management in terms of both your project work and the larger scale ethics and safety of your design",
      "Your ability to make good decisions and apply sound engineering judgement",
      "All design projects are expected to be substantial and to demonstrate a suitable level of technical expertise and engineering competence for 4th year biomedical engineering students.",
      "To assist with completion of a sufficiently substantive and complex project, projects should be completed in teams of 4-5 students.",
      "For the purpose of BME capstone projects, \"biomedical engineering\" is defined as follows (adapted from Enderle & Bronzino, Introduction to Biomedical Engineering):",
      "This field combines the design and problem solving skills of engineering with medical and biological sciences to advance health and health care treatment, including diagnosis, monitoring, and therapy.",
      "Students should be able to present an appropriate budget and plan for the project, discuss safety, health, ethical and equity issues around their solution, as well as identify potential economic, societal and environmental impacts that may need mitigation through design.",
      "Sanctioned Collaboration vs. Individual Work",
      "Instructions will clearly identify individual and team components.",
      "Accurate and Honest Reporting",
      "The same applies if fraudulent reporting is uncovered as part of the questioning during any of the Panel Exams and Design Reviews.",
      "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.",
      "Compassionate Accommodation",
      "They will review your case and coordinate a reasonable and fair plan in consultation with the appropriate parties.",
      "This course includes the independent development and practice of specific skills, such as research and communication skills.",
      "Library for research-based assignments"
    ]
  },
  {
    "course_id": 64,
    "course_code": "CHEM 254",
    "course_name": "CHEM254 - Introductory Chemical Thermodynamics (0.50)",
    "term_name": "Natural Science List",
    "program_name": "Electrical Engineering",
    "program_id": 53,
    "major_id": 2,
    "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)",
    "topics": [
      "08:30AM - 09:20AM",
      "RCH 306",
      "B. Power",
      "Instructor: Bill Power",
      "An introduction to the first, second, and third laws of thermodynamics and the application of these laws to ideal systems, mixtures, and chemical reactions.",
      "Thermodynamic principles are used to study changes in state, including phase changes, and to establish the link between the equilibrium constant and the properties of the substances involved in a chemical reaction.",
      "This course is a basic introduction to thermodynamics with emphasis on applications in chemistry.",
      "The course provides the necessary background to study changes in state of many physical and chemical systems.",
      "Define and apply the four laws of thermodynamics",
      "Identify, describe and ultimately design a variety of physical and chemical systems through their internal changes and/or interactions with their surroundings",
      "Quantify internal energy U, heat q, work w, enthalpy H, entropy S and Gibbs energy G in that same variety of physical and chemical systems",
      "Predict spontaneous change in systems of varying complexity",
      "Explain and quantify transformations involving both pure substances and mixtures using thermodynamic concepts",
      "There will be online and in-class assignments, on a rotating interval of about two weeks.",
      "It will occur in a 2.5 hour time slot sometime between April 9 and April 25 (I have no control over this scheduling).",
      "I will have a copy on reserve in the library (https://www.reserves.uwaterloo.ca/ares/ares.dll?Action=10&Form=50&Value=222108) and the price listed here is for a one-year electronic subscription.",
      "In addition, I have prepared a number of narrated powerpoint lectures, which I hope you will find useful in learning the material.",
      "Each lecture also has notes that provide written transcripts of what I am speaking, in case that helps you to learn some of the terms.",
      "One will be tutorial assignments which you will complete the first half of the problem individually, then work on an extension of the problem in groups of 4.",
      "CHEM 254 - Winter 2025 | General | Microsoft Teams",
      "I will provide any materials there as well as on LEARN, just in case one or the other has access issues.",
      "Four of the assignments, involving both individual and group work in a team-based learning (TBL) format, should help you to be able to assess different thermodynamic systems and learn to use the appropriate thermodynamic tools.",
      "The other four assignments, to be completed individually and much broader in scope and effort required, will help you to apply those skills to more complex and realistic physical and chemical systems.",
      "These may cover several chapters at a time.",
      "This course includes the independent development and practice of specific skills, such as problem solving in a chemical and scientific context.",
      "Library for research-based assignments"
    ]
  },
  {
    "course_id": 1,
    "course_code": "ECE 150",
    "course_name": "ECE150 - Fundamentals of Programming (0.50)",
    "term_name": "1A Term",
    "program_name": "Computer Engineering",
    "program_id": 39,
    "major_id": 2,
    "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)",
    "topics": [
      "Notice of Recording",
      "ECE 150",
      "04:30PM - 05:20PM",
      "10:30AM - 11:20AM E7 5353",
      "08:30AM - 10:20AM",
      "Monday, Friday -",
      "11:30AM - 12:20PM E7 5353",
      "08:30AM - 10:20AM",
      "03:30PM - 04:20PM E7 5343",
      "02:30PM - 03:20PM",
      "08:30AM - 09:20AM",
      "08:30AM - 10:20AM",
      "Software design process in a high-level programming environment.",
      "Programming fundamentals, language syntax, simple data types, control constructs, functions, parameter passing, recursion, classes, arrays and lists, list traversals, introduction to searching and sorting algorithms, basic object-oriented design, polymorphism and inheritance, simple testing and debugging strategies, pointers and references, basic memory management.",
      "View requirements for ECE 150",
      "Instruct computers to carry out operational tasks using the C++ language.",
      "Demonstrate the ability to perform both procedural programming and object-oriented programming.",
      "Demonstrate the ability to test and debug programs.",
      "Also, the Department of Electrical and Computer Engineering cancels classes during mid-term week and, instead, offers make-up lectures.",
      "Libraries and function calls; writing functions; assertions; code-development strategies; writing tests and comments; and logging.",
      "Debugging; binary and hexadecimal numbers; integer data types; bitwise and bit-shift operators; floating-point data types; constant variables; and the default value of parameters.",
      "Addresses and pointers; dynamic memory allocation including that of arrays; lifetime of dynamically allocated memory; problems with pointers; and protecting pointers with const.",
      "Searching of arrays; sorted arrays; binary search; selection and insertion sort; and introduction to recursive algorithms and recursive mathematical functions.",
      "Solving problems recursively; the class data structure; namespaces; and functions on objects.",
      "Operator overloading; issues with member variables; using member functions; throwing and catching exceptions; classes; encapsulation; and constructors.",
      "Copies of objects; assignment of objects; the destructor; dynamic memory allocation in classes; weaknesses with arrays; linked lists; and a linked list with dynamic memory allocation.",
      "Adding a size list member variable and a tail pointer member variable; concatenating two linked lists; inheritance; a base linked list class; a window class for graphical user interfaces; exception classes and polymorphism; and a widget class for graphical user interfaces.",
      "Source code for Projects be submitted through the Marmoset.",
      "MOSS is used to verify that all source code in projects is not plagiarized from peers either from this offering or previous offerings of this course.",
      "Notice of Recording",
      "Generative artificial intelligence: This course includes the independent development and practice of specific skills, such as software design and development.",
      "Library for research-based assignments",
      "This includes those who experienced harm, those who are supporting others who experienced harm.",
      "SVPRO can be contacted at svpro@uwaterloo.ca",
      "Intellectual property includes items such as:"
    ]
  }
]
