[
    {
        "course_id": 241,
        "course_code": "AFM321",
        "course_name": "Personal Financial Planning and Taxation",
        "topics": [
            "Personal Financial Planning and Taxation Winter 2025",
            "AFM 321",
            "AFM 321 001",
            "Email: kaishu.wu@uwaterloo.ca",
            "AFM 321:",
            "This course integrates financial planning and taxes for individuals.",
            "It connects elements of planning, saving, spending, and reporting to budgeting and tax implications, as they evolve over an individual's lifetime.",
            "View requirements for AFM 321",
            "AFM 321 helps students develop a do-it-yourself (DIY) individual financial planning and tax mindset.",
            "Students will learn how to prepare and assess a basic financial plan for themselves, centered around the budget, across various life stages.",
            "Within each area of planning, saving, spending, and reporting, students will develop appreciation of important financial and tax considerations that will set them up for financial success.",
            "Prepare a financial plan and budget for various life stages using fore core elements (planning, saving, spending, and reporting)",
            "2. Analyze and recommend a financial plan/budget for various life stages",
            "3. Integrate tax implications and analysis within your plan/budget and each life stage",
            "4. Use data and analytical techniques to evaluate comparable investments",
            "3 individual budget and financial planning assignments 37%",
            "TopHat knowledge and reflection questions & Module practice problems 13%",
            "Individually or in groups, students will complete mini-cases requiring them to prepare a budget and all related documentation, including tax implications, related to planning, saving, spending, and reporting.",
            "Students will write a comprehensive final exam that builds on the previous budget and financial planning assignments and will require them to prepare or analyze a budget/financial plan, related schedules, and consider tax calculations and implications.",
            "The assignment will require a written report detailing the comparison and conclusions reached, as well as collection and analysis of data and a visualization of certain findings.",
            "To be awarded a grade for these components, you must enroll in TopHat using your UW username-specific email (no alias UW email address, or non-UW email address).",
            "GenAI use is not permitted for these problems.",
            "The instructor is a facilitator of the knowledge and discussion.",
            "9-10 if you attended classes throughout the term, and participated meaningfully in the discussion several times each week consistently throughout the term.",
            "Although rare, we will always make corrections for clear inconsistencies in your grade (i.e., specific feedback says you achieved one ranking, but assessment was checked for a lower ranking).",
            "Submission Times",
            "Due to the highly structured nature of the study plans and the fact that many SAF courses are offered on a limited basis, students should be aware that a penalty imposed as a result of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.",
            "School of Accounting and Finance Academic Integrity Expectations",
            "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.",
            "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.",
            "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.",
            "Specific considerations for SAF students:",
            "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.",
            "Submission Times",
            "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.",
            "No in-person course activity is permitted during the period of a self-declared COVID absence.",
            "Students can self-declare one short-term absence per term on Quest for any reason.",
            "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.",
            "Intellectual property includes items such as:",
            "Pronouns and chosen or preferred first name",
            "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."
        ]
    },
    {
        "course_id": 1324,
        "course_code": "CHEM360",
        "course_name": "Organic Chemistry 3",
        "topics": [
            "08:30AM - 09:50AM MC 2034",
            "Email: graham.murphy@uwaterloo.ca",
            "FMO theory, organometallics, and transition metal-catalyzed C-C bond formation.",
            "Chemistry 360 builds on the concepts and chemistry taught in CHEM 264 and CHEM 265.",
            "If you want to do well in CHEM 360, you should re-familiarize yourself with some of the material in your introductory organic chemistry courses.",
            "More specifically, CHEM 360 will familiarize students with some of the modern synthetic methods for the formation of carbon-carbon sigma bonds in organic compounds.",
            "An array of anionic, cationic, pericyclic, and organometallic methods will be introduced as part of three general sections, and the factors governing the mechanistic, stereochemical and regiochemical course of these processes will be presented and discussed as appropriate.",
            "Section 1 will cover enols and enolates, condensations and a-substitutions of carbonyl compounds (acid- and base-catalyzed), and conjugate addition to a,b-unsaturated carbonyl compounds (acid- and base-catalyzed).",
            "Section 2  will cover pericyclic reactions (cycloadditions under thermal and photochemical conditions), with an emphasis on how an appreciation of frontier molecular orbitals allows for prediction of the reactivity of the systems (thermal and photochemical conditions), as well as relative reaction rates, regiochemistry and stereochemistry.",
            "Section 3  will present transition-metal catalysis and organometallic reactions, with a particular emphasis on Pd-catalyzed cross-coupling reactions.",
            "1) To learn to use curve arrow formalism to “push” pairs of electrons in writing resonance forms and in sketching electron flow in chemical reactions.",
            "To be able to use the understanding of reactions mechanisms to predict the outcome of these chemical reactions (mechanistic reasoning to interpret pattern of reactivity).",
            "4) To be able to identify intermediates versus transition states in an energy diagram for all fundamental condensation reactions and be able to determine the difference between kinetically and thermodynamically controlled reactions, identify equilibrium and reaction rates, and relate to the energy of the transitions state, starting material, and final products.",
            "7) To be able to identify neutral cyclic transitions states, involving bond-forming and bond-breaking events, in cycloaddition reactions, under thermal and photochemical conditions.",
            "To be able to use frontier molecular orbitals (FMO’s) to predict the reactivity of cycloadditions under thermal and photochemical conditions, as well as relative reaction rates, regiochemistry and stereochemistry (Endo rule).",
            "11) To be able to generate catalytic cycles for common cross-coupling reactions, namely Suzuki, Stille, Heck, Sonogashira, and Buchwald-Hartwig (Buchwald-Hartwig amination), as well as variations involving carbon monoxide.",
            "No Free Online Access",
            "No e-textbook can be sourced from the publisher, starting from $49.49 USD",
            "The exams are in-person, and any conflicts with the timing of these exams should be brought to my attention ASAP for possible alternate exam scheduling.",
            "This will be 75 minutes in length and will be worth 25% of your course grade.",
            "This will be 75 minutes in length and will be worth 25% of your course grade.",
            "This course includes the independent development and practice of specific skills.",
            "Library for research-based assignments"
        ]
    },
    {
        "course_id": 1326,
        "course_code": "CHEM363",
        "course_name": "Organic Process Chemistry",
        "topics": [
            "09:30AM - 10:20AM B2 350",
            "Determine what in-process assays and controls are necessary to regulate runaway reactions and minimizing impurities",
            "Introduction to process chemistry",
            "Safety",
            "Safety",
            "Safety",
            "Route selection",
            "Route selection",
            "Route selection",
            "Effects of Water",
            "In process controls",
            "Practical considerations for scale",
            "Continuous operations",
            "I have used the textbook as a guideline on what topics to teach and have used some of the examples given in the textbook.",
            "I'll form these groups and post them on LEARN after the first week of class.",
            "After researching multiple production processes, you'll write a paper that provides an overview of these methods and critically assesses their pros and cons based on the criteria and concepts covered in this course.",
            "Then, as a group, you'll compare and contrast these methods, ultimately recommending the most suitable option for scaled-up production."
        ]
    },
    {
        "course_id": 1327,
        "course_code": "CHEM370",
        "course_name": "Introduction to Polymer Science",
        "topics": [
            "Introduction to Polymer Science Fall 2024",
            "10:00AM - 11:20AM EIT 2053",
            "Basic definitions and polymer nomenclature, molecular weight distributions and averages, molecular weight measurements, step-growth and free radical chain-growth polymerization reactions, chain conformations, glass transition, crystallization, and mechanical properties of polymers.",
            "Understand the models and measurement of polymer chain dimensions.",
            "Know the general techniques to characterize polymer molecular weight and understand their principles.",
            "Remember the nature of step-growth polymerization and analyze the kinetics",
            "Differentiate chain-growth and step-growth polymerization and their kinetics",
            "Understand the key feature of controlled radical polymerization",
            "Know basic characterization methods and terms for polymer mechanical properties",
            "The whole course includes seven chapters, and each chapter will have a correlating assignment after it is completed.",
            "Introduction to Polymers (Third Edition) Robert J. Young and Peter A. Lovell No"
        ]
    },
    {
        "course_id": 1328,
        "course_code": "CHEM381",
        "course_name": "Bioorganic Chemistry",
        "topics": [
            "09:30AM - 10:20AM DWE 3517",
            "Learn methods for the racemic and enantioselective syntheses of amino acids,",
            "Learn peptide synthesis",
            "Learn about the basic reactions of monosaccharides",
            "Learn how to make the glycosidic bond",
            "Learn about the basic of the synthesis of oligosaccharides",
            "learn how nucleotides and nucleic acids are used as drugs,",
            "two midterms each worth 15% for a total of 30%"
        ]
    },
    {
        "course_id": 1329,
        "course_code": "CHEM382L",
        "course_name": "Advanced Organic Synthesis Laboratory",
        "topics": [
            "A laboratory course intended for students in the Medicinal Chemistry Specialization of the Honours Chemistry plan.",
            "The purpose of this course is to introduce students to advanced laboratory techniques used in synthetic organic chemistry.",
            "Familiarize themselves with advanced organic synthesis and laboratory techniques used in synthetic organic chemistry.",
            "Implement procedural design and execution using guidelines",
            "Prepare and execute an oral presentation on a total synthesis",
            "The reactions in this unit will review techniques learned in previous organic chemistry lab courses and introduce new techniques.",
            "Unit 4: Synthesis Design"
        ]
    },
    {
        "course_id": 1718,
        "course_code": "CO471",
        "course_name": "Semidefinite Optimization",
        "topics": [
            "Semidefinite Optimization Spring 2023",
            "04:00PM - 05:20PM",
            "Optimization over convex sets described as the intersection of the set of symmetric, positive semidefinite matrices with affine spaces.",
            "Theoretical and practical consequences of these formulations.",
            "Duality theory and algorithms.",
            "Optimization over convex sets described as the intersections of the set of symmetric, positive semidefinite matrices with affine spaces.",
            "Formulations of problems from combinatorial optimization, graph theory, number theory, probability and statistics, engineering design and control theory.",
            "Theoretical and practical consequences of these formulations.",
            "Duality theory and algorithms.",
            "Topics Include: Optimization over convex sets described as the intersection of the set of symmetric, positive semideﬁnite matrices with aﬃne spaces: Semideﬁnite optimization vastly generalizes linear programming where variable vectors may be replaced with matrix variables and, in addition to linear equations and inequalities, one may utilize constraints requiring some of the matrix variables to be symmetric and positive semideﬁnite.",
            "duality theory for semideﬁnite optimization,",
            "algorithms for semideﬁnite optimization: ellipsoid method, ﬁrst‐order methods and primal‐dual interior‐point methods for semideﬁnite optimization, and approximation algorithms based on semideﬁnite optimization,",
            "formulations of problems from combinatorial optimization, graph theory, number theory, probability and statistics, complexity analysis of algorithms, engineering design and control theory, theoretical and practical consequences of these formulations,",
            "Polyhedral and Semidefinite Programming Methods in Combinatorial Optimization"
        ]
    },
    {
        "course_id": 1719,
        "course_code": "CO485",
        "course_name": "The Mathematics of Public-Key Cryptography",
        "topics": [
            "The Mathematics of Public-Key Cryptography Fall 2024",
            "08:30AM - 09:50AM DWE 3517",
            "An in-depth study of public-key cryptography.",
            "Public-key encryption, digital signatures, key establishment, elliptic curve cryptography, post-quantum cryptography.",
            "An in-depth study of public-key cryptography, including: number-theoretic problems - prime generation, integer factorization, discrete logarithms; public-key encryption; digital signatures; key establishment; elliptic curve cryptography; post-quantum cryptography; and security proofs.",
            "An in-depth study of public-key cryptography and number-theoretic problems related to the efficient and secure use of public-key cryptographic schemes.",
            "Algorithmic number theory: Primality testing, integer factorization problem, discrete logarithm problem, elliptic curve discrete logarithm problem.",
            "Additional topics: Pairing-based cryptography, post-quantum cryptography.",
            "An Introduction to Mathematical Cryptography (2nd ed.), Hoffstein, Pipher, and Silverman.",
            "The quizzes are intended to reinforce basic concepts that are, in some sense, \"too easy\" to put in an assignment (e.g., definitions, simple calculations).",
            "Assignments: Right now I expect a total of 6 assignments in the course.",
            "Late assignments will be given a grade of 0 and I reserve the right not to grade them.",
            "Exception: Any student who self-declares a short-term absence overlapping with an assignment due date receives a 48-hour extension on the assignment without penalty, and assignments submitted within this extension period will be graded."
        ]
    },
    {
        "course_id": 1720,
        "course_code": "CO487",
        "course_name": "Applied Cryptography",
        "topics": [
            "Instructor: Samuel Jaques",
            "Email: sejaques@uwaterloo.ca",
            "Timothy Miller",
            "Nicolas Swanson",
            "A broad introduction to modern cryptography, highlighting the tools and techniques used to secure internet and messaging applications.",
            "It is one of the core technologies for securing the emerging information infrastructure.",
            "This course is a comprehensive introduction to modern cryptography that is aimed primarily at those interested in applications.",
            "In the area of public-key cryptography, topics will include an overview of specific systems (Diffie–Hellman, RSA, DSA, etc.) and a few advanced protocols.",
            "The security of these schemes and the use of public-key techniques for generating digital signatures will be described.",
            "Linear and differential cryptanalysis of ciphers.",
            "Define the main information security goals of confidentiality, integrity, authentication, and availability",
            "Explain the intended security properties of each cryptographic primitive and analyze relationships between security properties",
            "Explain mathematical techniques underlying standardized cryptographic algorithms",
            "Identify flaws in uses of cryptographic algorithms",
            "Determine which cryptographic algorithms can be used and combined to build systems with desired functionality and security",
            "Understand and contextualize the cryptography and security around them in daily life",
            "0 1 (Jan 6-8) Introduction",
            "Symmetric Encryption",
            "3.6 9 Elliptic Curve Cryptography 4 Yes",
            "4   Applications",
            "Understanding Cryptography: From Established Symmetric and Asymmetric Ciphers to Post-Quantum Algorithms, 2nd edition, Springer, 2024 Primary reference.",
            "A1: January 23",
            "A4: March 20",
            "This will be clearly indicated for each such question.",
            "In that case you are required to work independently.",
            "These questions will test your ability to identify the important concepts introduced in lectures, and your understanding of them.",
            "In particular:",
            "Please inform us of these at the start of the course.",
            "Library for research-based assignments"
        ]
    },
    {
        "course_id": 3563,
        "course_code": "LS101",
        "course_name": "Introduction to Legal Studies",
        "topics": [
            "Introduction to Legal Studies Winter 2025",
            "Your instructor checks email and the Ask the Instructor discussion topic frequently and will make every effort to reply to your questions within 24–48 hours, Monday to Friday.",
            "An introduction to the study of law, its structure, and legal institutions from a cross-cultural and historical perspective.",
            "This interdisciplinary course examines the origins of legal systems and their impact on society.",
            "Included is an analysis of the diverse historical, political, economic, and cultural conditions under which law arises and functions within society.",
            "This interdisciplinary course examines the origins of modern legal systems and legal thinking, to consider the impact of law on society, and society on law.",
            "We will do this by exploring the historical, political, economic, and cultural context under which law arises and functions within modern Western society, and its effect on people, institutions, diversity and life.",
            "Demonstrate familiarity with key terms, debates, and theoretical approaches in the field of legal studies.",
            "Identify and analyse popular and scholarly conceptions of law, and the roles law plays in society.",
            "Constitution of Canada & the Charter of Rights and Freedoms",
            "0c. Canada’s Truth and Reconciliation Commission",
            "Introduce Yourself",
            "Colonialism and Sovereignties of Law – Part 1",
            "This course includes the independent development and practice of specific skills, such as legal writing and research, analytical reasoning, critical things, and case analysis.",
            "Library for research-based assignments",
            "In the case of compassionate grounds, you must provide documentation.",
            "Privacy and Permissions",
            "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.",
            "No in-person course activity is permitted during the period of a self-declared COVID absence.",
            "Students can self-declare one short-term absence per term on Quest for any reason.",
            "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."
        ]
    },
    {
        "course_id": 3565,
        "course_code": "AMATH231",
        "course_name": "Calculus 4",
        "topics": [
            "Notice of Recording",
            "02:30PM - 03:20PM",
            "Vector integral calculus-line integrals, surface integrals and vector fields, Green's theorem, the Divergence theorem, and Stokes' theorem.",
            "Applications include conservation laws, fluid flow and electromagnetic fields.",
            "An introduction to Fourier analysis.",
            "Frequency analysis of signals.",
            "Notice of Recording"
        ]
    },
    {
        "course_id": 3566,
        "course_code": "AMATH250",
        "course_name": "Introduction to Differential Equations",
        "topics": [
            "Introduction to Differential Equations Winter 2025",
            "Solving linear differential equations: first- and second-order scalar equations and first-order vector equations.",
            "The main purpose of the course is to explore how first and second order differential equations (DEs) are used to model physical systems and predict their behaviour.",
            "first order linear DE models of compartment problems, atomic decay, and bodies in motion;",
            "first order separable DE models of population growth;",
            "a first order exact DE model of the electric dipole;",
            "second order linear DE models for oscillatory systems such as mass-spring-damper systems and electrical circuits;",
            "second order nonlinear DE models for suspended cables and rocket motion;",
            "linear vector DE models of multiple compartment problems and species interactions.",
            "Both analytical solution techniques and qualitative methods (direction field analysis, dimensional analysis, and phase portraits) will be presented as ways to gain information about system behaviour.",
            "We will investigate conditions for existence, uniqueness, and continuity of solutions of both first and second order initial value problems, and for systems in the plane.",
            "Maple will be used to generate numerical and graphical solutions, to illustrate concepts graphically, and to explore model behaviour.",
            "increase your comprehension of some of the many ways that differential equations can help us understand the real world;",
            "develop your ability to understand a mathematical model for a specific situation;",
            "explore analytical and qualitative solution methods for first and second order differential equations, and the use of Maple; and",
            "Please choose only one of the two options below.",
            "Submission Instructions",
            "Copyright Notice",
            "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.",
            "This course includes the independent development and practice of specific skills, such as solving differential equations.",
            "Library for research-based assignments"
        ]
    },
    {
        "course_id": 3568,
        "course_code": "AMATH353",
        "course_name": "Partial Differential Equations 1",
        "topics": [
            "Partial Differential Equations 1 Winter 2025",
            "08:30AM - 09:20AM",
            "08:30AM - 09:50AM MC 4063",
            "Second order linear partial differential equations - the diffusion equation, wave equation, and Laplace's equation.",
            "Methods of solution - separation of variables and eigenfunction expansions, the Fourier transform.",
            "Physical interpretation of solutions in terms of diffusion, waves, and steady states.",
            "First order non-linear partial differential equations and the method of characteristics.",
            "Develop a mathematical model to explain a scientific principle in the language of Partial Differential Equations (PDEs)",
            "Determine what analytical method is appropriate to solve a given PDE",
            "Apply analytical methods to solve PDEs",
            "Physically interpret solutions of PDEs",
            "Feb 17-21 Family Day and reading week",
            "Applied Partial Differential Equations: with Fourier Series and Boundary Value Problems by R Haberman On reserve in DC No $158",
            "Here are some general instructions for using Crowdmark:",
            "This course includes the independent development and practice of specific skills, such as solving PDEs.",
            "Library for research-based assignments"
        ]
    },
    {
        "course_id": 3569,
        "course_code": "CS114",
        "course_name": "Principles of Computing for Science",
        "topics": [
            "Principles of Computing for Science Winter 2025",
            "08:30AM - 09:50AM MC 4059",
            "Monday -",
            "Monday",
            "07:00PM - 08:50PM",
            "10:30AM - 11:20AM MC 4063",
            "Coordinator",
            "Student who make use of office hours usually get better grades; use them!",
            "Introduction to basic imperative programming principles; programming concepts including functions, flow control, lists, arrays; numerical accuracy and efficiency; data analysis and general-purpose algorithms.",
            "Introduction to object-oriented programming concepts.",
            "Describe the basic memory model for mutation of basic types, lists, and objects in Python.",
            "Identify situations where recursion is an appropriate tool, and use it.",
            "6 Feb 6-11 M4: Strings and Lists",
            "7 Feb 13-25 M5: Sorting and Dictionaries",
            "If both exams are held in person",
            "If in-person exams cannot be held then they will be held online (if possible).",
            "Students have the option of self-declaring a short-term absence, as described here: https://uwaterloo.ca/registrar/current-students/undergraduate-student-short-term-absences",
            "Students should check their basic tests email to ensure that the code meets the specification exactly.",
            "If ill, please complete a complete a Verification of Illness Form and contact the course coordinator to discuss alternate arrangements.",
            "Generative AI: This course includes the independent development and practice of specific skills, such as writing and reading code, tracing, and algorithm design.",
            "Library for research-based assignments"
        ]
    }
]