[
    {
        "course_id": 0,
        "course_code": "CS 330",
        "course_name": "CS330 - Management Information Systems (0.50)",
        "term_name": "Required Courses",
        "program_name": "Actuarial Science",
        "program_id": 2,
        "major_id": 5,
        "major_name": "Predictive Analytics Specialization",
        "topics": [
            "Management Information Systems Winter 2025",
            "Email: kevin.lanctot@uwaterloo.ca",
            "An introduction to information systems and their strategic role in business.",
            "Topics include types of information systems, organizational requirements, systems development strategies, decision support systems, data and information management, and information systems management, control, and implementation.",
            "This course is aimed at students who are not CS majors but are interested in continuing their study of computer science beyond first year.",
            "Make informed decisions about using technology in a business environment.",
            "Define and explain the characteristics of a variety of business information systems.",
            "Describe strategic roles and management usage for information systems in business.",
            "Understand the relationships among various information systems.",
            "A1",
            "Feb 25, 27 Topic 4 - Introduction to IS (Ch 1 in text)",
            "A2",
            "A4",
            "A copy of the 7th edition will be placed on 3-hour reserve in the Davis Library.",
            "Evaluation",
            "If you miss the final assessment, you will be given an INC if there is a strong reason for missing it (generally a serious medical issue verified by a VIF).",
            "This course includes the independent development and practice of specific skills, such as designing information systems.",
            "Library for research-based assignments",
            "Physical and Mental Health",
            "See https://uwaterloo.ca/campus-wellness/ for a list of on-campus supports and workshops.",
            "In particular:",
            "Intellectual property includes items such as:"
        ]
    },
    {
        "course_id": 1,
        "course_code": "STAT 341",
        "course_name": "STAT341 - Computational Statistics and Data Analysis (0.50)",
        "term_name": "Required Courses",
        "program_name": "Actuarial Science",
        "program_id": 2,
        "major_id": 5,
        "major_name": "Predictive Analytics Specialization",
        "topics": [
            "Computational Statistics and Data Analysis Winter 2025",
            "04:00PM - 05:20PM",
            "10:00AM - 11:20AM EIT 1015",
            "04:30PM - 05:20PM",
            "Megan French",
            "Daniel Zhang",
            "While personal matters can be communicated via email, Piazza should be the primary platform for Q&A outside of class.",
            "A computationally focused approach to statistical reasoning in the context of real data.",
            "Functional programming in R and algorithms will be used to define interesting attributes of finite populations and their sampling characteristics.",
            "Understand the fundamentals of population-based statistical analyses, as well as implicitly/explicitly defined population attributes",
            "Understand the basics of sampling and the underlying ideas/mechanisms of probability sampling and related issues",
            "Understand the basics of inductive inference including target and study populations, measurements, comparing subpopulations, random intervals and coverage probabilities, and resampling methods such as bootstrap",
            "Generate high-quality visualization and inferential statistics R output for the topics above",
            "Prepare reports that communicate your statistical analyses using LaTeX and R Markdown.",
            "Jan. 6 Introduction to the course",
            "location and scale invariance/equivariance",
            "Power transformations and linear relationships",
            "Implicitly defined Attributes",
            "Solving system of equations Assignment #1",
            "Iteratively re-weighted least-squares",
            "Sampling mechanisms and inclusion probabilities",
            "Sampling design",
            "9. Mar. 3 Anatomy of tests of significance",
            "A t-like discrepancy measure  Assignment #2",
            "Mar. 10 Multiple testing",
            "Student-t-based intervals",
            "Mar. 17  Introduction to resampling methods",
            "Bootstrap in regression",
            "Multiple samples and prediction",
            "Decomposition of APSE, bias-variance trade-off",
            "Training and Test sets",
            "K-fold cross validation Assignment #3",
            "Each folder will contain five files, e.g. for section 2.1-",
            "There will be a 2.5-hour, closed book, cumulative final exam during the Final Examination Period: April 9 – April 25.",
            "An INC grade is rarely granted and will be considered on a case-by-case basis, with decisions based largely on your performance throughout the semester.",
            "Self-Declared COVID-19 Related Absences: You may self-declare one absence per term during the formal lecture period for influenza-like illnesses.",
            "Course Software: R is a language and a free statistical computing and graphics software that we will use extensively throughout the course.",
            "The only time you may run into trouble is if you call a function from a package to handle a task you have been asked to code out explicitly.",
            "For example, if you are asked to code a function that calculates the mean of a vector in R, and your solution is to just call the function mean(), then you will not receive any marks.",
            "Communication: When you email your instructor, make sure you include the following information in your email:",
            "Including non-English characters in your email (sometimes imposed by installing a non-English operating system) prompts UW servers to spam your emails for the instructor.",
            "These characters most often appear in (not exclusively) the subject line, From, To, and Date/Time portions of previous communications if you reply to an email.",
            "You must use the web-based email platform if you suspect that you have non-English characters in your emails imposed by your computer, phone, tablet, etc.",
            "This course includes the independent development and practice of specific skills related to computational statistics and data analysis.",
            "Phone: 519-884-0000 extension 213"
        ]
    },
    {
        "course_id": 2,
        "course_code": "STAT 431",
        "course_name": "STAT431 - Generalized Linear Models and their Applications (0.50)",
        "term_name": "Required Courses",
        "program_name": "Actuarial Science",
        "program_id": 2,
        "major_id": 5,
        "major_name": "Predictive Analytics Specialization",
        "topics": [
            "Generalized Linear Models and their Applications Winter 2025",
            "Review of the normal linear model and maximum likelihood estimation; regression models for binomial, Poisson and multinomial data; generalized linear models; and other topics in regression modelling.",
            "The primary objective of this course is to introduce students to generalized linear models.",
            "Attention will be mainly directed towards theory and applications involving binary, categorical, and count data, although the generalized linear model will be presented in its full generality for responses from the exponential family.",
            "This course introduces several useful regression techniques for the analysis of data arising in many different settings (ie， medicine, industry, psychology etc.).",
            "The intended audience consists of students interested in advanced regression modeling.",
            "The objectives are to help students develop an understanding of the statistical theory and to equip them with the ability to fit regression models for a wide range of problems.",
            "run generalized linear regression for binary, categorical and count data and have a deep understanding of the underlying theories.",
            "Week 7 Dose-Response Models Lecture 11",
            "An Introduction to Generalized Linear Models by Dobson, AJ and Barnett, AG, fourth edition No 92",
            "Software: Students are encouraged to use R for coding problems in assignments, but feel free to use any computing software you feel comfortable with.",
            "An introduction to R: https://cran.r-project.org/doc/manuals/r-release/R-intro.pdf.",
            "Arrangements for students with official conflicts will be handled on a case by case basis."
        ]
    },
    {
        "course_id": 3,
        "course_code": "STAT 441",
        "course_name": "STAT441 - Statistical Learning - Classification (0.50)",
        "term_name": "Required Courses",
        "program_name": "Actuarial Science",
        "program_id": 2,
        "major_id": 5,
        "major_name": "Predictive Analytics Specialization",
        "topics": [
            "10:00AM - 11:20AM B1 271",
            "Email: mlysy@uwaterloo.ca",
            "STAT 841: View requirements for STAT 841",
            "Describe the basic principles and methods of statistical classification.",
            "Know when to use each of these methods on a given dataset.",
            "Evaluate and compare the output of various classifiers.",
            "An Introduction to Statistical Learning with Applications in R, by James, Witten, Hastie & Tibshirani https://www.statlearning.com",
            "There will be two closed-book midterms worth 15% each on the following dates:",
            "There are no make-up midterms in this course.",
            "Discussion Board",
            "Please self-enroll at https://piazza.com/uwaterloo.ca/winter2025/stat441841cm763.",
            "You can generally expect a response from TAs within two business days.",
            "Software",
            "Material and assignments will require the use of R and Python programming languages, as well as the technical document writing programs for these languages: R Markdown and Quarto.",
            "Regrades",
            "Email",
            "Emails which do not adhere to this standard will generally be ignored.",
            "Intellectual property includes items such as:",
            "In particular:",
            "Please inform us of these at the start of the course."
        ]
    },
    {
        "course_id": 4,
        "course_code": "STAT 443",
        "course_name": "STAT443 - Forecasting (0.50)",
        "term_name": "Required Courses",
        "program_name": "Actuarial Science",
        "program_id": 2,
        "major_id": 5,
        "major_name": "Predictive Analytics Specialization",
        "topics": [
            "Forecasting Spring 2024",
            "04:00PM - 05:20PM",
            "Email: jeremy.vanderdoes@uwaterloo.ca",
            "This course is an introduction to statistical forecasting.",
            "This includes considerations of forecasts and uncertainty.",
            "Speciﬁc topics include:",
            "Linear time series models: AR, MA, ARMA, ARIMA, SARIMA",
            "Forecasting: Principles and Practice, 3rd edition free online at https://otexts.com/fpp3/",
            "Time Series Analysis and Its Applications, 4th edition free online in library or at https://www.stat.pitt.edu/stoffer/tsa4/ Yes",
            "Introduction to Time Series and Forecasting free online in library Yes"
        ]
    },
    {
        "course_id": 5,
        "course_code": "ACTSC 454",
        "course_name": "ACTSC454 - Longevity and Mortality Using Predictive Analytics (0.50)",
        "term_name": "Required Courses",
        "program_name": "Actuarial Science",
        "program_id": 2,
        "major_id": 5,
        "major_name": "Predictive Analytics Specialization",
        "topics": [
            "10:00AM - 11:20AM M3 3103",
            "E. Kozlowski",
            "My name is Emily and I use she/her pronouns.",
            "I'm very excited to be your instructor this term - I love actuarial science and I love teaching!",
            "I hope to get to know many of you on a personal level and to facilitate as best a learning experience for all students as possible.",
            "Get help with the course material in general, even if you don't know what specific questions you may have",
            "Discussion Board and Email",
            "Kaplan-Meier and Nelson-Aalen estimators for survival functions.",
            "Estimators for Markov multiple state transition intensities.",
            "Longevity models, including deterministic and stochastic models such as Lee-Carter and Cairns-Blake-Dowd.",
            "The objective of this course is to introduce statistical models for survival data.",
            "Building upon the concepts of ACTSC 232 and 331, we discuss estimation with both empirical and parametric models.",
            "Construct empirical estimates (using Kaplan-Meier, Nelson-Aalen, kernel density models) for survival data, including censored and truncated data",
            "Apply the Cox Proportional Hazards model to survival data",
            "Estimate mortality with Binomial and Poisson models for mortality",
            "Construct and validate mortality tables using different methods of graduation",
            "Discuss longevity risk and model mortality improvement with both determinstic and stochastic models",
            "Week 1 Review of Survival Models and Statistics",
            "Weeks 2 - 4 Empirical Estimation: censoring and truncation, Nelson-Aalen, Kaplan-Meier, confidence intervals, kernel density models",
            "Weeks 6 - 8 Binomial and Poisson Models of Mortality, Graduation, Tests of Fit",
            "Week 9 MLE for Markov Multiple State Models",
            "Loss Models: From Data to Decisions 5th Edition by Klugman, S., Panjer, H., and Willmot, G. No available for free from UW library",
            "Loss Models: From Data to Decisions 5th Edition Student Solutions Manual by Klugman, S., Panjer, H., and Willmot, G. No available for free from UW library",
            "Chapters 10, 11, and 14 in Loss Models provide reference for the empirical estimation portion of the course.",
            "Details can be found here: https://uwaterloo.ca/math/absence-declarations",
            "This course includes the independent development and practice of specific skills.",
            "Phone: 519-884-0000 extension 213",
            "Diversity and Inclusion",
            "In particular:",
            "Please inform me of these at the start of the course."
        ]
    },
    {
        "course_id": 6,
        "course_code": "STAT 437",
        "course_name": "STAT437 - Statistical Methods for Life History Analysis (0.50)",
        "term_name": "Required Courses",
        "program_name": "Actuarial Science",
        "program_id": 2,
        "major_id": 5,
        "major_name": "Predictive Analytics Specialization",
        "topics": [
            "Notice of Recording",
            "Statistical Methods for Life History Analysis Winter 2025",
            "Email: liqun.diao@uwaterloo.ca",
            "Email: y679zhao@uwaterloo.ca",
            "Statistical methods for the analysis of longitudinal data; hierarchical models, marginal models, and transitional models.",
            "Parametric and semiparametric methods for the analysis of survival data under censoring and truncation.",
            "This course covers a wide range of topics pertaining to the statistical analysis of data from prospective studies.",
            "For longitudinal data, likelihood-based methods will be covered based on hierarchical mixed effect models and transitional models.",
            "The material on event history analysis will primarily involve an introduction to the analysis of survival data with some introduction to the modeling of censoring, truncation and more complex sampling processes.",
            "Course Information Webpage",
            "Please do not send these questions via email.",
            "I expect everyone to be respectful to each other, any posts that do not meet the principles in Policy 33: Ethical Behaviour will be removed.",
            "Response time: You can expect a response within approximately 24-48 hours during the week.",
            "Email",
            "Continuity Plans",
            "Describe, interpret, and communicate results from the various estimation techniques for longitudinal models, contrasting interpretations across models.",
            "Know the features of time to event data, particularly with respect to censoring and truncation mechanisms.",
            "Understand parametric estimation for both discrete and continuous time to event models.",
            "Monday",
            "Friday",
            "Classes Begin",
            "Welcome, Introduction to Longitudinal Data",
            "A Review of Linear Regression, Linear Marginal Model",
            "A1 Released",
            "Linear Marginal Model",
            "Linear Marginal Model,",
            "A1 Due",
            "Mixed Effect Model",
            "Mixed Effect Model",
            "Mixed Effect Model",
            "Introduction to Survival Data",
            "A4 Released",
            "A4 Due",
            "Nonparametric and Semiparametric Methods",
            "Presentation Slides and Final",
            "Analysis of longitudinal data.",
            "Singer & Willett.",
            "Klein & Moeschberger.",
            "R Statistical Software",
            "The second column gives the weight of each component.",
            "Your overall grade will be computed as a weighted summation over your grades on all assessments.",
            "Notice of Recording",
            "Short-term absence",
            "COVID-19-related absence",
            "No limits on number of submissions per term and only available during the formal lecture period",
            "In particular:",
            "Please inform us of these at the start of the course.",
            "Generative AI: This course includes the independent development and practice of specific skills, such as the fitting, interpretation, and assessment of models in real applications, reviewing research papers, and writing reports.",
            "Library for research-based assignments"
        ]
    },
    {
        "course_id": 7,
        "course_code": "STAT 440",
        "course_name": "STAT440 - Computational Inference (0.50)",
        "term_name": "Required Courses",
        "program_name": "Actuarial Science",
        "program_id": 2,
        "major_id": 5,
        "major_name": "Predictive Analytics Specialization",
        "topics": [
            "Computational Inference Winter 2025",
            "PHY 313",
            "Introduction to and application of computational methods in statistical inference.",
            "Monte Carlo evaluation of statistical procedures, exploration of the likelihood function through graphical and optimization techniques.",
            "Topics include expectation-maximization, Bootstrapping, Markov Chain Monte Carlo, and other computationally intensive methods.",
            "A1 Feb 4th",
            "A4 Apr 3rd"
        ]
    },
    {
        "course_id": 8,
        "course_code": "STAT 442",
        "course_name": "STAT442 - Data Visualization (0.50)",
        "term_name": "Required Courses",
        "program_name": "Actuarial Science",
        "program_id": 2,
        "major_id": 5,
        "major_name": "Predictive Analytics Specialization",
        "topics": [
            "Notice of Recording",
            "Data Visualization Winter 2025",
            "11:30AM - 12:20PM B1 271",
            "Discussion Board",
            "Email",
            "Response time",
            "Both human perception and statistical properties inform the methods used to display and visually explore categorical, continuous, time-ordered, map, and high dimensional data.",
            "Statistical concepts visually presented include variability, densities, quantiles, conditioning, and hypothesis testing.",
            "Interactive graphics include linking, brushing, motion, and the navigation of high dimensional spaces guided via projection indices.",
            "Interpret and critique the most commonly used kinds of visualizations today.",
            "Create a variety of univariate, bivariate, and multivariate graphs using base R and the tidyverse.",
            "Look up the necessary code to complete additional graphs not covered here.",
            "Book - Data Science - A First Introduction.",
            "Book - The Chicago Guide to Multivariate Analysis, Jane E. Miller",
            "Book - Cool Infographics - Effective Communication with Data Visualization and Design, Randy Krum.",
            "Industry Paper - Making Data Meaningful, United Nations Economic Commission for Europe.",
            "Notice of Recording",
            "No waiving of this penalty will occur for technical issues.",
            "Details can be found here: https://uwaterloo.ca/math/accommodations",
            "Phone: 519-884-0000 extension 213",
            "Lots of people look like they have it together in public and online when they're a mess inside too.",
            "They got you into university, so they've already done most of the work, but at this point, the most they can really do for you decide if you can get into graduate school before doing industry experience.",
            "Don't let that be your reason for thinking this is as good as it gets.",
            "In particular:",
            "Please inform me of these at the start of the course."
        ]
    },
    {
        "course_id": 0,
        "course_code": "CS 136L",
        "course_name": "CS136L - Tools and Techniques for Software Development (0.25)",
        "term_name": "Required Courses",
        "program_name": "Computer Science",
        "program_id": 40,
        "major_id": 8,
        "major_name": "Computer Science (Bachelor of Mathematics - Honours)",
        "topics": [
            "Tools and Techniques for Software Development Winter 2025",
            "08:30AM - 10:20AM MC 3003",
            "10:30AM - 12:20PM MC 3003",
            "E. Ciklabakkal",
            "E. Ciklabakkal",
            "08:30AM - 10:20AM MC 4042",
            "E. Ciklabakkal",
            "10:30AM - 12:20PM MC 4042",
            "08:30AM - 10:20AM MC 3003",
            "10:30AM - 12:20PM MC 4060",
            "02:30PM - 04:20PM MC 4060",
            "E. Ciklabakkal",
            "10:30AM - 12:20PM MC 3003",
            "This course introduces students to tools and techniques useful in the software development lifecycle.",
            "Students learn to navigate and leverage commands and utilities in the Linux Command Line Shell.",
            "Students gain experience in version control software, writing scripts to automate tasks, and creating effective test cases to identify bugs.",
            "Students also gain experience in using built-in support for version control, testing, debugging, build automation, etc. in integrated development environments (IDEs).",
            "Interact with the Linux Operating System using a command line shell and gain familiarity with commands, utilities and tools.",
            "Create scripts to automate tasks and increase productivity while working on a software project.",
            "Design test cases and automate the testing process to check a program for functional correctness and incorrect memory usage.",
            "Use version control systems to share, contribute, manage and track code.",
            "Separately compile code modules and leverage build automation tools to do so efficiently.",
            "Module 0: Linux Shell, a first look",
            "Module 2: Testing and Debugging",
            "Module 9: Debugging",
            "Each lab consists of a number of lab problems.",
            "Each lab problem has two associated values, a lower one called the pass threshold and a higher one called the completion threshold.",
            "Special note on test cases: if a lab question asks you to submit test cases, you must create these tests yourself.",
            "Do not directly copy code from GenAI.",
            "Do not ask GenAI for a step-by-step breakdown of how to solve a lab problem.",
            "In particular:",
            "Please inform of us these at the start of the course."
        ]
    },
    {
        "course_id": 1,
        "course_code": "CS 330",
        "course_name": "CS330 - Management Information Systems (0.50)",
        "term_name": "Required Courses",
        "program_name": "Computer Science",
        "program_id": 40,
        "major_id": 8,
        "major_name": "Computer Science (Bachelor of Mathematics - Honours)",
        "topics": [
            "Management Information Systems Winter 2025",
            "Email: kevin.lanctot@uwaterloo.ca",
            "An introduction to information systems and their strategic role in business.",
            "Topics include types of information systems, organizational requirements, systems development strategies, decision support systems, data and information management, and information systems management, control, and implementation.",
            "This course is aimed at students who are not CS majors but are interested in continuing their study of computer science beyond first year.",
            "Make informed decisions about using technology in a business environment.",
            "Define and explain the characteristics of a variety of business information systems.",
            "Describe strategic roles and management usage for information systems in business.",
            "Understand the relationships among various information systems.",
            "A1",
            "Feb 25, 27 Topic 4 - Introduction to IS (Ch 1 in text)",
            "A2",
            "A4",
            "A copy of the 7th edition will be placed on 3-hour reserve in the Davis Library.",
            "Evaluation",
            "If you miss the final assessment, you will be given an INC if there is a strong reason for missing it (generally a serious medical issue verified by a VIF).",
            "This course includes the independent development and practice of specific skills, such as designing information systems.",
            "Library for research-based assignments",
            "Physical and Mental Health",
            "See https://uwaterloo.ca/campus-wellness/ for a list of on-campus supports and workshops.",
            "In particular:",
            "Intellectual property includes items such as:"
        ]
    },
    {
        "course_id": 2,
        "course_code": "CS 341",
        "course_name": "CS341 - Algorithms (0.50)",
        "term_name": "Required Courses",
        "program_name": "Computer Science",
        "program_id": 40,
        "major_id": 8,
        "major_name": "Computer Science (Bachelor of Mathematics - Honours)",
        "topics": [
            "Algorithms Winter 2025",
            "10:00AM - 11:20AM MC 4061",
            "08:30AM - 09:50AM MC 1056",
            "The study of efficient algorithms and effective algorithm design techniques.",
            "Topics include divide and conquer algorithms, recurrences, greedy algorithms, dynamic programming, graph search and backtrack, problems without algorithms, NP-completeness and its implications.",
            "DPV",
            "Introduction to Algorithms, by Cormen, Leiserson, Rivest and Stein, MIT Press.",
            "describe the main idea first,",
            "Extensions and Other Accommodations on Assignments",
            "Students can currently self-declare two kinds of absences on Quest: short-term absence and pandemic-related absence.",
            "Since a short-term absence lasts 2 days, this means the only accommodation we offer for a short-term absence is a 48 hour extension.",
            "If you request accommodations through AccessAbility Services (AAS) by filling out a Missed Course Component form, the accommodation is determined on a case-by-case basis through consultation with AAS, but will generally be one of the above options unless your situation is unusual.",
            "If you collaborate with others, you must clearly indicate the collaboration for each problem.",
            "This is not a software engineering course; we will not test your code against inputs that do not match our specifications.",
            "Continuity Plan",
            "In particular:",
            "Please inform of us these at the start of the course."
        ]
    },
    {
        "course_id": 3,
        "course_code": "CS 246E",
        "course_name": "CS246E - Object-Oriented Software Development (Enriched) (0.50)",
        "term_name": "Required Courses",
        "program_name": "Computer Science",
        "program_id": 40,
        "major_id": 8,
        "major_name": "Computer Science (Bachelor of Mathematics - Honours)",
        "topics": [
            "Object-Oriented Software Development (Enriched)",
            "Tuesday -",
            "CS246 description: Introduction to object-oriented programming and to tools and techniques for software development.",
            "Designing, coding, debugging, testing, and documenting medium-sized programs: reading specifications and designing software to implement them; selecting appropriate data structures and control structures; writing reusable code; reusing existing code; basic performance issues; debuggers; test suites.)",
            "functions and classes as the basic building blocks for abstractions",
            "function and class templates; exception safety",
            "object-oriented design principles; design patterns",
            "language features in combination",
            "Software library development for general client use.",
            "Principles of object-oriented software design.",
            "A selection of software design patterns.",
            "A1     10%",
            "Office hours: the list of office hours can be found at https://student.cs.uwaterloo.ca/~cs246e/F24/officehours.shtml",
            "Note: Marmoset is not a compiler!",
            "Please do not submit C++ code to Marmoset without first attempting to compile it yourself.",
            "The release test for a problem gives you the result of running your program on one basic test case (usually a case that appears in the assignment specification).",
            "So be sure to test your code thoroughly, so that you pass as many of our secret tests as possible.",
            "Testing",
            "Hand-Marking",
            "Note that correctly-working code is only one component of an assignment mark.",
            "Intellectual property includes items such as:",
            "CAN I POST MY CODE ONLINE?",
            "The second complicating factor concerns the question of who actually owns assignment solutions.",
            "The instructor supplies the question, a framework for the solution (including rules, guidelines, and possibly some starter code or libraries) and has in mind the general structure of what a correct solution ought to look like.",
            "the instructor(s) may permit posting of only those portions of assignments that were not provided as starter code;",
            "The instructors' policy for a given offering of a course will be stated in the course outline.",
            "If you wish to share your code with potential employers, and your instructor does not permit you to publicly post your solutions, you may host your code in a private repository, and provide a password to potential employers (for example, on your resume).",
            "This course includes the independent development and practice of specific skills.",
            "Library for research-based assignments",
            "Phone: 519-884-0000 extension 213",
            "In particular:",
            "Please inform of us these at the start of the course."
        ]
    },
    {
        "course_id": 4,
        "course_code": "CS 251",
        "course_name": "CS251 - Computer Organization and Design (0.50)",
        "term_name": "Required Courses",
        "program_name": "Computer Science",
        "program_id": 40,
        "major_id": 8,
        "major_name": "Computer Science (Bachelor of Mathematics - Honours)",
        "topics": [
            "Notice of Recording",
            "Computer Organization and Design Winter 2025",
            "11:30AM -",
            "RCH 307",
            "10:30AM - 11:20AM EV3 1408",
            "Silvia Zhang cs251@uwaterloo.ca",
            "Basics of digital logic design.",
            "Data representation and manipulation.",
            "Basics of processor design.",
            "This course enables students to develop an accurate mental model of the architecture and organization of physical computers and it introduces them to theoretical and practical concepts relevant to the structure and design of modern digital computers.",
            "Design simple combinational and sequential hardware at the logic gate level in order to implement simple algorithms and computations, such as addition, multiplication, and data-path control for processors.",
            "Describe number systems used by computer hardware, including IEEE floating point and two's complement.",
            "Analyze how machine language is executed by hardware, and describe a simple pipelined processor architecture for executing a RISC machine language.",
            "Explain basic cache and virtual-memory architectures, and how they can impact performance.",
            "Introduction and ARM (~3 hours)",
            "Combinational logic and basic components.",
            "Basic Processor Design (~9 hours)",
            "Processor design using single-cycle control.",
            "Multi-cycle control.",
            "Virtual memory.",
            "Multi-processor systems and core processors.",
            "Patterson and Hennessy: \"Computer Organization and Design\".",
            "Students registering their clicker for other sections will receive a grade of zero on clicker questions.",
            "else",
            "Notice of Recording",
            "In general, assignments submitted late and without an approved extension by the course ISC will not be accepted and will be given a grade of zero.",
            "If a student makes a short-term 48-hour declaration, they may contact the course ISC to obtain a 48-hour extension.",
            "Note that penalties are significantly higher for exams and for repeat offenders.",
            "Discussion of assignments is allowed, but each student must hand in their own copy of the assignment and word-for-word copying is not allowed.",
            "In-Class Discipline",
            "A student who is found to be disruptive during lectures will be given only one verbal warning for the term.",
            "Students should attend the section they're enrolled in and only the section they're enrolled in",
            "Further, a weekly quiz will be given and used in place of clickers in the marking scheme.",
            "Dropping lowest clickers marks, lowest quiz score",
            "Online Exams",
            "Phone: 519-884-0000 extension 213",
            "In particular:",
            "Please inform of us these at the start of the course.",
            "Intellectual property includes items such as:"
        ]
    },
    {
        "course_id": 6,
        "course_code": "MATH 239",
        "course_name": "MATH239 - Introduction to Combinatorics (0.50)",
        "term_name": "Required Courses",
        "program_name": "Computer Science",
        "program_id": 40,
        "major_id": 8,
        "major_name": "Computer Science (Bachelor of Mathematics - Honours)",
        "topics": [
            "Introduction to Combinatorics Winter 2025",
            "11:30AM - 12:20PM MC 4059",
            "09:30AM - 10:20AM MC 4021",
            "P. Nelson",
            "08:30AM - 09:20AM QNC 1502",
            "S. Pfannerer-Mittas",
            "10:30AM - 11:20AM MC 4058",
            "11:30AM - 12:20PM MC 4058",
            "09:30AM - 10:20AM MC 4042",
            "02:30PM - 03:20PM",
            "10:30AM - 11:20AM PHY 150",
            "04:30PM - 05:20PM",
            "You should have no reason to contact them directly, but you can find their email addresses through Learn.",
            "First name Last name",
            "Guilherme Zeus Dantas E Moura",
            "Theodore Morrison",
            "Matthew Kroeker",
            "Introduction to graph theory: colourings, matchings, connectivity, planarity.",
            "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.",
            "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.",
            "extract coefficients from rational generating series",
            "find maximum matchings in bipartite graphs",
            "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory",
            "be comfortable writing proofs for results on discrete objects",
            "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3",
            "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7",
            "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14",
            "Grading scheme A",
            "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.",
            "Please inform of us these at the start of the course.",
            "Library for research-based assignments"
        ]
    },
    {
        "course_id": 7,
        "course_code": "MATH 249",
        "course_name": "MATH249 - Introduction to Combinatorics (Advanced Level) (0.50)",
        "term_name": "Required Courses",
        "program_name": "Computer Science",
        "program_id": 40,
        "major_id": 8,
        "major_name": "Computer Science (Bachelor of Mathematics - Honours)",
        "topics": [
            "Introduction to Combinatorics (Advanced Level)",
            "09:30AM - 10:20AM MC 2017",
            "For graph theory, while we will focus on the same topics covered in MATH 239 (planarity and bipartite matching), our coverage of those topics will differ substantially in depth and in the techniques that we employ; in particular, we will see striking applications of algebra.",
            "extract coefficients from rational generating series",
            "find maximum matchings in bipartite graphs",
            "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory",
            "be comfortable writing proofs for results on discrete objects",
            "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3",
            "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7",
            "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14",
            "Grading scheme A",
            "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.",
            "Please inform of us these at the start of the course.",
            "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].",
            "Library for research-based assignments"
        ]
    },
    {
        "course_id": 0,
        "course_code": "CS 330",
        "course_name": "CS330 - Management Information Systems (0.50)",
        "term_name": "Required Courses",
        "program_name": "Computer Science",
        "program_id": 40,
        "major_id": 10,
        "major_name": "Computer Science Minor",
        "topics": [
            "Management Information Systems Winter 2025",
            "Email: kevin.lanctot@uwaterloo.ca",
            "An introduction to information systems and their strategic role in business.",
            "Topics include types of information systems, organizational requirements, systems development strategies, decision support systems, data and information management, and information systems management, control, and implementation.",
            "This course is aimed at students who are not CS majors but are interested in continuing their study of computer science beyond first year.",
            "Make informed decisions about using technology in a business environment.",
            "Define and explain the characteristics of a variety of business information systems.",
            "Describe strategic roles and management usage for information systems in business.",
            "Understand the relationships among various information systems.",
            "A1",
            "Feb 25, 27 Topic 4 - Introduction to IS (Ch 1 in text)",
            "A2",
            "A4",
            "A copy of the 7th edition will be placed on 3-hour reserve in the Davis Library.",
            "Evaluation",
            "If you miss the final assessment, you will be given an INC if there is a strong reason for missing it (generally a serious medical issue verified by a VIF).",
            "This course includes the independent development and practice of specific skills, such as designing information systems.",
            "Library for research-based assignments",
            "Physical and Mental Health",
            "See https://uwaterloo.ca/campus-wellness/ for a list of on-campus supports and workshops.",
            "In particular:",
            "Intellectual property includes items such as:"
        ]
    },
    {
        "course_id": 0,
        "course_code": "ECE 313",
        "course_name": "ECE313 - Digital Signal Processing (0.50)",
        "term_name": "Required Courses",
        "program_name": "Computer Engineering",
        "program_id": 39,
        "major_id": 1,
        "major_name": "Communications and Signal Processing Specialization",
        "topics": [
            "Digital Signal Processing Fall 2024",
            "ECE 313",
            "ECE 313 001",
            "Monday, Friday -",
            "11:30AM -",
            "04:00PM - 05:20PM E7 4053",
            "ECE 313:",
            "Fourier representations in discrete and continuous time.",
            "Discrete Fourier transform and fast Fourier transform algorithms.",
            "Transform analysis of linear time-invariant systems.",
            "Introduction to filter banks and discrete wavelet transform.",
            "View requirements for ECE 313",
            "understand the fundamental concepts, theories and methodologies of discrete-time signals, systems, and transforms, digital filter design, and digital processing of analog signals.",
            "Introduction",
            "Discrete Signals and Systems",
            "Z-Transform",
            "Digital Processing of Analog Signals",
            "Digital Filter Design",
            "Digital Signal Processing and Machine Learning"
        ]
    },
    {
        "course_id": 1,
        "course_code": "ECE 318",
        "course_name": "ECE318 - Communication Systems (0.50)",
        "term_name": "Required Courses",
        "program_name": "Computer Engineering",
        "program_id": 39,
        "major_id": 1,
        "major_name": "Communications and Signal Processing Specialization",
        "topics": [
            "Communication Systems Winter 2025",
            "ECE 318",
            "08:30AM - 09:50AM E7 4053",
            "08:30AM - 09:50AM E7 4053",
            "Introduction to random processes, power spectral density.",
            "Thermal noise and the white noise model.",
            "View requirements for ECE 318",
            "This is an introductory course on the principles of analog and digital communication systems.",
            "thermal noise and the additive white Gaussian noise model, effects of noise on communication systems, amplitude and angle modulation, generation and",
            "detection schemes, frequency division multiplexing using analog modulations,  digital signals processing including sampling and",
            "reconstruction, quantization, pulse code modulation and time-division multiplexing, error probability analysis of digital modulations in the presence of additive white Gaussian noise.",
            "We will also cover signal design for bandlimited, intersymbol interference (ISI) channels and orthogonal frequency division multiplexing (OFDM).",
            "The midterm and final examinations are closed-book: Only non-programmable hand calculators are allowed.",
            "The midterm and final examinations are closed-book: Only non-programmable hand calculators are allowed."
        ]
    },
    {
        "course_id": 2,
        "course_code": "ECE 358",
        "course_name": "ECE358 - Computer Networks (0.50)",
        "term_name": "Required Courses",
        "program_name": "Computer Engineering",
        "program_id": 39,
        "major_id": 1,
        "major_name": "Communications and Signal Processing Specialization",
        "topics": [
            "ECE 358",
            "10:00AM - 11:20AM E7 4417",
            "Email",
            "Prof. Catherine Rosenberg",
            "Mike Cooper-Stachowsky",
            "Substitute Instructor",
            "Dr. Abdalla Mohamed Hussein",
            "Maryam Amini",
            "maryam.amini@uwaterloo.ca",
            "yuan.quan@uwaterloo.ca",
            "Mohammad Abuyaghi",
            "This course is a comprehensive introduction to computer networks.",
            "View requirements for ECE 358",
            "Revised Description: This course is a comprehensive introduction to computer networks.",
            "The lower-level outcomes are:",
            "Have a good understanding of protocols and networking design concepts.",
            "Have a working knowledge of socket programming.",
            "Have a working knowledge of transport protocols with a special emphasis on TCP and retransmission protocols.",
            "Example of LAN technologies: Ethernet and switches.",
            "Synthesis: a day in the life of a web request",
            "LAB1: Development of a simulator of a single transmission system.",
            "Examination",
            "If you miss the midterm without a valid reason, that midterm earns a score of zero.",
            "Lab marking and reports submissions",
            "Instructions for how to package your files and submit are in the lab manuals."
        ]
    },
    {
        "course_id": 3,
        "course_code": "ECE 414",
        "course_name": "ECE414 - Wireless Communications (0.50)",
        "term_name": "Required Courses",
        "program_name": "Computer Engineering",
        "program_id": 39,
        "major_id": 1,
        "major_name": "Communications and Signal Processing Specialization",
        "topics": [
            "ECE 414",
            "ECE 414 001",
            "Transmission and reception techniques for wireless channels.",
            "Fundamentals of cellular communications and multiple-access schemes.",
            "understand the basic characteristics of wireless channels.",
            "appreciate the fundamental role of diversity in wireless communications.",
            "have a deep understanding of different transmission and reception techniques.",
            "have a basic understanding of cellular systems.",
            "analyze and compare the performance of different coding schemes."
        ]
    },
    {
        "course_id": 4,
        "course_code": "ECE 416",
        "course_name": "ECE416 - Advanced Topics in Networking (0.50)",
        "term_name": "Required Courses",
        "program_name": "Computer Engineering",
        "program_id": 39,
        "major_id": 1,
        "major_name": "Communications and Signal Processing Specialization",
        "topics": [
            "Advanced Topics in Networking Winter 2025",
            "TBA",
            "TBA",
            "TBA",
            "Access code to sign up (if not already enrolled): ece416-w25",
            "View requirements for ECE 416",
            "Understand the structure, addressing, and operational aspects of IPv6, and evaluate its advantages over IPv4 in addressing scalability and security challenges",
            "Understand the principles of Quality of Service (QoS) in networking, including techniques and protocols used to manage bandwidth, reduce latency, prioritize traffic, and ensure reliable data transmission for diverse applications.",
            "Examine the concepts of mobility in 4G and 5G networks, including tunnel routing mechanisms, and assess their impact on network performance and application delivery.",
            "Investigate IoT architectures, protocols, and security challenges, and understand their applications in smart environments and industrial systems.",
            "Conduct research-driven projects on advanced networking topics, present findings through technical papers and presentations, and engage in constructive peer discussions",
            "Introduction and review of ECE 358",
            "Introduction to Security in Computer Networks",
            "Software defined networks",
            "Security in Computer Networks (Will be split across different layers)",
            "Month",
            "F",
            "Deliverables",
            "Multiple dropboxes has been created for your submissions as follows:",
            "Partial/full solutions for these problem sets will be posted on the course website.",
            "This course includes the independent development and practice of specific skills, such as writing a white paper.",
            "Library for research-based assignments"
        ]
    },
    {
        "course_id": 5,
        "course_code": "ECE 417",
        "course_name": "ECE417 - Image Processing (0.50)",
        "term_name": "Required Courses",
        "program_name": "Computer Engineering",
        "program_id": 39,
        "major_id": 1,
        "major_name": "Communications and Signal Processing Specialization",
        "topics": [
            "Image Processing Winter 2025",
            "Monday, Friday -",
            "Topics include intensity transformations for image enhancement, two-dimensional discrete Fourier transform, spatial and frequency domain linear image filtering, nonlinear image filtering, binary image processing, edge detection, image segmentation, and digital video processing basics.",
            "View requirements for ECE 417",
            "This course also includes advanced topics including statistical and perceptual image modeling and processing; and compression, streaming, robustness, and scalability issues in visual communications.",
            "Understand basic theories and methodologies of digital image processing",
            "Digital image and video processing: Intensity transformations for image enhancement; spatial domain linear filtering; frequency domain linear filtering; nonlinear image filtering; image sampling and interpolation; motion and digital video processing.",
            "Image analysis and understanding: Edge detection; image segmentation; energy preserving and energy compaction; principle component analysis and independent component analysis; sparse representations; wavelet and multiresolution image analysis; non-linear image analysis.",
            "Statistical and perceptual image modeling and processing: Spatial domain image statistics; Fourier domain statistical image models; wavelet domain statistical image models; Markov random field models; computational models of the human visual system; perceptual image quality assessment and processing; data-driven and learning-based image processing algorithms.",
            "Visual communications: compression, quality, streaming, robustness and scalability: Video compression and standards; quality-of-service and quality-of-experience; adaptive video streaming; error resilient visual coding and communications; scalable image and video coding and communications.",
            "Electronic copies of lectures and study materials will be provided at course web site.",
            "Additional references include research papers published in journals, conferences and open-source archives that can be found online.",
            "Homework assignments are not graded but will be helpful for students to understand basic image processing concepts and algorithms, and will also be helpful for the preparation of the final exam.",
            "A research project that attempts some new investigations in a specific direction.",
            "The project presentation slides and reports should be submitted via Dropboxes at LEARN."
        ]
    },
    {
        "course_id": 6,
        "course_code": "ECE 474",
        "course_name": "ECE474 - Radio and Wireless Systems (0.50)",
        "term_name": "Required Courses",
        "program_name": "Computer Engineering",
        "program_id": 39,
        "major_id": 1,
        "major_name": "Communications and Signal Processing Specialization",
        "topics": [
            "Radio and Wireless Systems Winter 2025",
            "S. Boumaiza",
            "slim.boumaiza@uwaterloo.ca",
            "04:00PM - 05:20PM",
            "Modern transmitter and receiver architectures, Noise and linearity in radio and wireless systems, Design considerations of RF/microwave subsystems, radio and wireless system designs, CAD tools for radio and wireless systems, Antennas, Radio wave propagation models, Indoor radio, Satellite communication, Personal communication systems (PCSs).",
            "View requirements for ECE 474",
            "View requirements for ECE 770",
            "Designers of building blocks often ignore the motivation behind the various specifications they are given and their connections with the overall system performance once integrated into a radio communication system.",
            "As radio and wireless systems pose increasingly stringent specifications, integration of component-level building blocks to system-level design process is essential and circuit design and radio system engineering will merge.",
            "This course covers a wide range of radio and wireless systems aspects including communication signals and the underlying modulation and multiple access techniques, tradeoffs among different transceiver (transmitter/receiver) architectures (conventional and modern), antennas and radio waves propagation, and design considerations of RF/microwave building blocks, radio and wireless systems.",
            "In particular, it links circuit design specifications and system requirements defined in wireless standards.",
            "This course will equip students with the basics in modern radio and wireless systems design by",
            "- Learning the overall picture of conventional and modern radio and wireless systems",
            "- understanding the tradeoffs between different transceiver architectures in relation to a given communication standard",
            "- evaluating the impact of different impairments in radio and wireless systems on performance, including interference, different noise sources and nonlinearity",
            "- learning how to use computer aide design tools to assess the system level performance of radio transceivers and links",
            "- distinguishing and analyzing the propagation issues on several radio and wireless systems",
            "Introduction to Modulation and Multiple Access Techniques (2 Weeks)",
            "System level Key Characteristics and Parameters in Radio and Wireless Systems (3 Weeks)",
            "Noise/Linearity Budget for Radio & Wireless Systems",
            "Low Noise Amplifiers,",
            "Mixers & Modulators (IQ)",
            "Power Amplifiers",
            "Receivers Architectures",
            "Basic Antenna Operation",
            "Antenna Types and Specifications",
            "Special Topics on Radio & Wireless Systems (1 Week)",
            "Design Project/Lab: To let students have a chance to practice and understand the subjects learned in the course, several design and simulation cases of wireless link aspects using the SystemVue CAD tool from Keysight Technologies are assigned as the course project.",
            "The students will have also a chance to experience the theory covered in the course and to validate the project simulations in a laboratory where they will have access to state-of-the-art equipment.",
            "Michael Steer, Microwave and RF Design – A System Approach, SciTech, 2010.",
            "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.",
            "This includes those who experienced harm, those who are supporting others who experienced harm.",
            "SVPRO can be contacted at svpro@uwaterloo.ca",
            "Intellectual property includes items such as:"
        ]
    },
    {
        "course_id": 0,
        "course_code": "ECE 105",
        "course_name": "ECE105 - Classical Mechanics (0.50)",
        "term_name": "1A Term",
        "program_name": "Computer Engineering",
        "program_id": 39,
        "major_id": 2,
        "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)",
        "topics": [
            "Notice of Recording",
            "Classical Mechanics Fall 2024",
            "ECE 105",
            "ECE 105 001",
            "Forces in nature and Newton's laws, dynamics and circular motion, work, energy, and conservation of energy.",
            "Linear momentum and linear impulse, rotational dynamics.",
            "View requirements for ECE 105",
            "identify the underlying physical principles relevant to a given physics problem",
            "develop a strategy how to solve the probelm",
            "employ the appropriate mathematical knowledge to do so",
            "Kinematics in 1D",
            "Free Fall, Kinematics in 2D and",
            "Relative motion",
            "Forces:",
            "Normal force and Tension",
            "Conservation of energy",
            "Linear momentum, Impulse",
            "Conservation of Linear momentum",
            "(1D, 2D & Relative Motion, Forces, Work, Energy conservation)",
            "Rot. kinetic energy, Moment of inertia, Torque",
            "Angular momentum conservation",
            "Rolling motion",
            "Static equilibrium",
            "SMH, Mass – spring systems",
            "SMH Energy",
            "December",
            "“Physics for Scientists and Engineers”, 2nd edition by Hawkes et.al.",
            "Mastering Physics online tool Yes",
            "The purpose of the assignments is for you to practice the fundamental techniques in a low-pressure environment.",
            "The total duration of each quiz is 60 min (50 min for writing the solutions and 10 min grace period for uploading pictures of the hand-written solutions).",
            "Make sure that where you write has a stable internet connection.",
            "Inability to submit because of your internet connection will require evidence of completion by the deadline.",
            "In case you cannot attend the FE due to illness of family emergency, contact the 1st",
            "Notice of Recording",
            "No parts of this course will be recorded"
        ]
    },
    {
        "course_id": 1,
        "course_code": "ECE 150",
        "course_name": "ECE150 - Fundamentals of Programming (0.50)",
        "term_name": "1A Term",
        "program_name": "Computer Engineering",
        "program_id": 39,
        "major_id": 2,
        "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)",
        "topics": [
            "Notice of Recording",
            "ECE 150",
            "04:30PM - 05:20PM",
            "10:30AM - 11:20AM E7 5353",
            "08:30AM - 10:20AM",
            "Monday, Friday -",
            "11:30AM - 12:20PM E7 5353",
            "08:30AM - 10:20AM",
            "03:30PM - 04:20PM E7 5343",
            "02:30PM - 03:20PM",
            "08:30AM - 09:20AM",
            "08:30AM - 10:20AM",
            "Software design process in a high-level programming environment.",
            "Programming fundamentals, language syntax, simple data types, control constructs, functions, parameter passing, recursion, classes, arrays and lists, list traversals, introduction to searching and sorting algorithms, basic object-oriented design, polymorphism and inheritance, simple testing and debugging strategies, pointers and references, basic memory management.",
            "View requirements for ECE 150",
            "Instruct computers to carry out operational tasks using the C++ language.",
            "Demonstrate the ability to perform both procedural programming and object-oriented programming.",
            "Demonstrate the ability to test and debug programs.",
            "Also, the Department of Electrical and Computer Engineering cancels classes during mid-term week and, instead, offers make-up lectures.",
            "Libraries and function calls; writing functions; assertions; code-development strategies; writing tests and comments; and logging.",
            "Debugging; binary and hexadecimal numbers; integer data types; bitwise and bit-shift operators; floating-point data types; constant variables; and the default value of parameters.",
            "Addresses and pointers; dynamic memory allocation including that of arrays; lifetime of dynamically allocated memory; problems with pointers; and protecting pointers with const.",
            "Searching of arrays; sorted arrays; binary search; selection and insertion sort; and introduction to recursive algorithms and recursive mathematical functions.",
            "Solving problems recursively; the class data structure; namespaces; and functions on objects.",
            "Operator overloading; issues with member variables; using member functions; throwing and catching exceptions; classes; encapsulation; and constructors.",
            "Copies of objects; assignment of objects; the destructor; dynamic memory allocation in classes; weaknesses with arrays; linked lists; and a linked list with dynamic memory allocation.",
            "Adding a size list member variable and a tail pointer member variable; concatenating two linked lists; inheritance; a base linked list class; a window class for graphical user interfaces; exception classes and polymorphism; and a widget class for graphical user interfaces.",
            "Source code for Projects be submitted through the Marmoset.",
            "MOSS is used to verify that all source code in projects is not plagiarized from peers either from this offering or previous offerings of this course.",
            "Notice of Recording",
            "Generative artificial intelligence: This course includes the independent development and practice of specific skills, such as software design and development.",
            "Library for research-based assignments",
            "This includes those who experienced harm, those who are supporting others who experienced harm.",
            "SVPRO can be contacted at svpro@uwaterloo.ca",
            "Intellectual property includes items such as:"
        ]
    },
    {
        "course_id": 2,
        "course_code": "ECE 190",
        "course_name": "ECE190 - Engineering Profession and Practice (0.25)",
        "term_name": "1A Term",
        "program_name": "Computer Engineering",
        "program_id": 39,
        "major_id": 2,
        "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)",
        "topics": [
            "Engineering Profession and Practice Fall 2024",
            "08:30AM - 09:20AM E7 5353",
            "D. Davison",
            "11:30AM - 12:20PM E7 5353",
            "02:30PM - 03:20PM",
            "D. Davison",
            "04:30PM - 05:20PM",
            "03:30PM - 04:20PM E7 5343",
            "D. Davison",
            "Instructor Dan Davison",
            "o  Tuesdays 10:30am - 12:30pm in EIT 3114 and",
            "First-Year Engineering Tutors Noah Witzke",
            "TBD",
            "tbd@uwaterloo.ca Provide support during in-person activities",
            "Also see the contact information in the CFE Information folder on LEARN.",
            "Introduction to electrical and computer engineering with an emphasis on the profession of engineering, and engineering design.",
            "Additional topics include co-op fundamentals for engineering students, professional development, and diversity training with a goal of understanding the roles and responsibilities of the professional engineer in society.",
            "View requirements for ECE 190",
            "(4) Describe the steps of the engineering design process and apply them to a small design project",
            "(5) Define sustainable development and describe ways in which environmental sustainability and engineering are related",
            "(6) Explain the central ethical duties in engineering, and make justifiable decisions to solve simple ethical problems",
            "(7) Analyze and control risks in simple engineering and workplace settings",
            "(8) Explain the three design-team traps of ignorance, staleness, and social loafing and identify techniques to help avoid them",
            "(9) Define professional development and explain the role of professional development in engineering",
            "(11) Describe the three components of project management, construct a PERT chart, and identify a project's critical path",
            "\"Knowledge base for engineering\"",
            "\"Investigation\"",
            "\"Design\"",
            "6a",
            "\"Impact of engineering on society and the environment\" [",
            "\"Economics and project management\" [",
            "- Introduction to ECE190",
            "- Introduction to CFE and co-op Spare",
            "- Engineering profession",
            "- Working in teams  Spare Groups 1-40 attend in person",
            "- ECE190 groups meet and sign the Group Agreement Form",
            "- Engineering design process Groups 1-20 attend in person",
            "- Design activity Part 1 Groups 21-40 attend in person (group activity)",
            "- Design activity Part 1",
            "- Sustainability Groups 1-20 attend in person",
            "- Design activity Part 2 Groups 21-40 attend in person (group activity)",
            "- Design activity Part 2",
            "- Design-team traps Spare Spare",
            "- Professional development",
            "- Entrepreneurship Spare Spare",
            "- Measurement and",
            "Course materials on LEARN Must have a reliable internet connection.",
            "Textbook: \"Engineering Design:",
            "Textbook: \"Designing Engineers: An Introductory Text\", by Susan McCahan, Philip Anderson, Mark Kortschot, Peter E. Weiss, and Kimberly A. Woodhouse, 2015.",
            "Summary of marked components",
            "To increase lecture engagement, you should write down key points in your own words – I provide lecture summary sheets on LEARN that can be used for this purpose.",
            "The midterm test and final exam are closed-book, written individually, and consist of randomized multiple-choice questions based on the slide decks covered in the course lectures.",
            "Question format:  43 randomized multiple-choice questions",
            "Any reason for missing the midterm, other than those listed above, results in a score of zero on the midterm.",
            "Question format:  68 randomized multiple-choice questions",
            "Students who miss the final exam for one of these reasons will be eligible to write a deferred exam.",
            "Students who miss any final exam should contact the First-Year Engineering Office as soon as possible."
        ]
    },
    {
        "course_id": 3,
        "course_code": "ECE 198",
        "course_name": "ECE198 - Project Studio (0.25)",
        "term_name": "1A Term",
        "program_name": "Computer Engineering",
        "program_id": 39,
        "major_id": 2,
        "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)",
        "topics": [
            "ECE 198",
            "ECE 198 001",
            "08:30AM - 10:20AM E2 1792",
            "08:30AM - 09:20AM E7 5353",
            "10:30AM - 12:20PM E2 1792",
            "08:30AM - 10:20AM E2 1792",
            "08:30AM - 09:20AM",
            "The Course Instructor is responsible for overseeing the instructional design and coordinating the delivery of the course, including managing the Teaching Assistants.",
            "Amirhossein Akbarian",
            "Mohammadamin Hosseini",
            "Eric Yu",
            "sa7hosse@uwaterloo.ca",
            "View requirements for ECE 198",
            "The intention of this course is to provide students with an opportunity to apply engineering concepts in a small multidisciplinary design project to solve a specific problem.",
            "Apply critical thinking skills to specify, design, and verify an engineering solution.",
            "Quantify a series of specifications to define the project stakeholder’s design and performance requirements.",
            "Apply mathematical and scientific principles within quantitative technical analysis in order to design a solution that meets the specifications.",
            "Specify and demonstrate test methods to evaluate the design’s performance.",
            "Implement a prototype to test and verify the design.",
            "Develop and deploy basic software on a microcontroller, with the use of an Integrated Development Environment.",
            "Both partners must attend each meeting.",
            "It is highly recommended that students prepare to submit in advance of the deadline with enough time in advance just in case of unexpected submission difficulties.",
            "In addition, students may choose to make a submission that they know does not have a possibility of earning a perfect grade.",
            "It may be preferable to make a submission for partial grade than to incur a late penalty.",
            "It specifies key quantified requirements that the system is intended to fulfil.",
            "Design Document",
            "Implementation Demo",
            "The Implementation Demo is a live presentation and demonstration of the implementation of the system or a prototype of the system, designed by the project group.",
            "STM32 Nucleo development board https://wstore.uwaterloo.ca/ece-198-kit.html Yes",
            "STM32 Nucleo development board",
            "While for capital-intensive equipment such as lab instrumentation it makes sense to amortize the cost of the equipment across many students, in cases where materials are considered \"consumable\" or more individual in nature, it makes more sense for students to each own their own materials.",
            "In addition, this same development board will be used in the ECE 298 course in second year.",
            "At the end of term, be sure to retain your Nucleo-F401RE development board for future courses.",
            "Initial technical information about the Nucleo-F401RE board can be found here:",
            "The UW Engineering Society provides an electronics and components shop called RidgidWare in E7:",
            "4-core processor",
            "USB-A port",
            "If a project partner proceeds to make submission despite raised concerns, a complaint can be submitted to the Teaching Assistant, who will investigate.",
            "Style for References and Citations",
            "As a research tool it can be helpful in generating leads or avenues of research to investigate.",
            "As an editing tool, it can be helpful in exploring alternate ways to communicate that may be more effective.",
            "However, it can be easy to over-use this technology.",
            "There are some key risks to over-using AI.",
            "Second, you will not come to an understanding of the key purposes and functions of an engineering design process.",
            "These records must include details of the AI system used and details of the inputs submitted to the system.",
            "Some AI systems may have been trained on data sets without appropriate permission from the owners of the data.",
            "Verification"
        ]
    },
    {
        "course_id": 0,
        "course_code": "ECE 105",
        "course_name": "ECE105 - Classical Mechanics (0.50)",
        "term_name": "1A Term",
        "program_name": "Computer Engineering",
        "program_id": 39,
        "major_id": 2,
        "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)",
        "topics": [
            "Notice of Recording",
            "Classical Mechanics Fall 2024",
            "ECE 105",
            "ECE 105 001",
            "Forces in nature and Newton's laws, dynamics and circular motion, work, energy, and conservation of energy.",
            "Linear momentum and linear impulse, rotational dynamics.",
            "View requirements for ECE 105",
            "identify the underlying physical principles relevant to a given physics problem",
            "develop a strategy how to solve the probelm",
            "employ the appropriate mathematical knowledge to do so",
            "Kinematics in 1D",
            "Free Fall, Kinematics in 2D and",
            "Relative motion",
            "Forces:",
            "Normal force and Tension",
            "Conservation of energy",
            "Linear momentum, Impulse",
            "Conservation of Linear momentum",
            "(1D, 2D & Relative Motion, Forces, Work, Energy conservation)",
            "Rot. kinetic energy, Moment of inertia, Torque",
            "Angular momentum conservation",
            "Rolling motion",
            "Static equilibrium",
            "SMH, Mass – spring systems",
            "SMH Energy",
            "December",
            "“Physics for Scientists and Engineers”, 2nd edition by Hawkes et.al.",
            "Mastering Physics online tool Yes",
            "The purpose of the assignments is for you to practice the fundamental techniques in a low-pressure environment.",
            "The total duration of each quiz is 60 min (50 min for writing the solutions and 10 min grace period for uploading pictures of the hand-written solutions).",
            "Make sure that where you write has a stable internet connection.",
            "Inability to submit because of your internet connection will require evidence of completion by the deadline.",
            "In case you cannot attend the FE due to illness of family emergency, contact the 1st",
            "Notice of Recording",
            "No parts of this course will be recorded"
        ]
    },
    {
        "course_id": 1,
        "course_code": "ECE 150",
        "course_name": "ECE150 - Fundamentals of Programming (0.50)",
        "term_name": "1A Term",
        "program_name": "Computer Engineering",
        "program_id": 39,
        "major_id": 2,
        "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)",
        "topics": [
            "Notice of Recording",
            "ECE 150",
            "04:30PM - 05:20PM",
            "10:30AM - 11:20AM E7 5353",
            "08:30AM - 10:20AM",
            "Monday, Friday -",
            "11:30AM - 12:20PM E7 5353",
            "08:30AM - 10:20AM",
            "03:30PM - 04:20PM E7 5343",
            "02:30PM - 03:20PM",
            "08:30AM - 09:20AM",
            "08:30AM - 10:20AM",
            "Software design process in a high-level programming environment.",
            "Programming fundamentals, language syntax, simple data types, control constructs, functions, parameter passing, recursion, classes, arrays and lists, list traversals, introduction to searching and sorting algorithms, basic object-oriented design, polymorphism and inheritance, simple testing and debugging strategies, pointers and references, basic memory management.",
            "View requirements for ECE 150",
            "Instruct computers to carry out operational tasks using the C++ language.",
            "Demonstrate the ability to perform both procedural programming and object-oriented programming.",
            "Demonstrate the ability to test and debug programs.",
            "Also, the Department of Electrical and Computer Engineering cancels classes during mid-term week and, instead, offers make-up lectures.",
            "Libraries and function calls; writing functions; assertions; code-development strategies; writing tests and comments; and logging.",
            "Debugging; binary and hexadecimal numbers; integer data types; bitwise and bit-shift operators; floating-point data types; constant variables; and the default value of parameters.",
            "Addresses and pointers; dynamic memory allocation including that of arrays; lifetime of dynamically allocated memory; problems with pointers; and protecting pointers with const.",
            "Searching of arrays; sorted arrays; binary search; selection and insertion sort; and introduction to recursive algorithms and recursive mathematical functions.",
            "Solving problems recursively; the class data structure; namespaces; and functions on objects.",
            "Operator overloading; issues with member variables; using member functions; throwing and catching exceptions; classes; encapsulation; and constructors.",
            "Copies of objects; assignment of objects; the destructor; dynamic memory allocation in classes; weaknesses with arrays; linked lists; and a linked list with dynamic memory allocation.",
            "Adding a size list member variable and a tail pointer member variable; concatenating two linked lists; inheritance; a base linked list class; a window class for graphical user interfaces; exception classes and polymorphism; and a widget class for graphical user interfaces.",
            "Source code for Projects be submitted through the Marmoset.",
            "MOSS is used to verify that all source code in projects is not plagiarized from peers either from this offering or previous offerings of this course.",
            "Notice of Recording",
            "Generative artificial intelligence: This course includes the independent development and practice of specific skills, such as software design and development.",
            "Library for research-based assignments",
            "This includes those who experienced harm, those who are supporting others who experienced harm.",
            "SVPRO can be contacted at svpro@uwaterloo.ca",
            "Intellectual property includes items such as:"
        ]
    },
    {
        "course_id": 2,
        "course_code": "ECE 190",
        "course_name": "ECE190 - Engineering Profession and Practice (0.25)",
        "term_name": "1A Term",
        "program_name": "Computer Engineering",
        "program_id": 39,
        "major_id": 2,
        "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)",
        "topics": [
            "Engineering Profession and Practice Fall 2024",
            "08:30AM - 09:20AM E7 5353",
            "D. Davison",
            "11:30AM - 12:20PM E7 5353",
            "02:30PM - 03:20PM",
            "D. Davison",
            "04:30PM - 05:20PM",
            "03:30PM - 04:20PM E7 5343",
            "D. Davison",
            "Instructor Dan Davison",
            "o  Tuesdays 10:30am - 12:30pm in EIT 3114 and",
            "First-Year Engineering Tutors Noah Witzke",
            "TBD",
            "tbd@uwaterloo.ca Provide support during in-person activities",
            "Also see the contact information in the CFE Information folder on LEARN.",
            "Introduction to electrical and computer engineering with an emphasis on the profession of engineering, and engineering design.",
            "Additional topics include co-op fundamentals for engineering students, professional development, and diversity training with a goal of understanding the roles and responsibilities of the professional engineer in society.",
            "View requirements for ECE 190",
            "(4) Describe the steps of the engineering design process and apply them to a small design project",
            "(5) Define sustainable development and describe ways in which environmental sustainability and engineering are related",
            "(6) Explain the central ethical duties in engineering, and make justifiable decisions to solve simple ethical problems",
            "(7) Analyze and control risks in simple engineering and workplace settings",
            "(8) Explain the three design-team traps of ignorance, staleness, and social loafing and identify techniques to help avoid them",
            "(9) Define professional development and explain the role of professional development in engineering",
            "(11) Describe the three components of project management, construct a PERT chart, and identify a project's critical path",
            "\"Knowledge base for engineering\"",
            "\"Investigation\"",
            "\"Design\"",
            "6a",
            "\"Impact of engineering on society and the environment\" [",
            "\"Economics and project management\" [",
            "- Introduction to ECE190",
            "- Introduction to CFE and co-op Spare",
            "- Engineering profession",
            "- Working in teams  Spare Groups 1-40 attend in person",
            "- ECE190 groups meet and sign the Group Agreement Form",
            "- Engineering design process Groups 1-20 attend in person",
            "- Design activity Part 1 Groups 21-40 attend in person (group activity)",
            "- Design activity Part 1",
            "- Sustainability Groups 1-20 attend in person",
            "- Design activity Part 2 Groups 21-40 attend in person (group activity)",
            "- Design activity Part 2",
            "- Design-team traps Spare Spare",
            "- Professional development",
            "- Entrepreneurship Spare Spare",
            "- Measurement and",
            "Course materials on LEARN Must have a reliable internet connection.",
            "Textbook: \"Engineering Design:",
            "Textbook: \"Designing Engineers: An Introductory Text\", by Susan McCahan, Philip Anderson, Mark Kortschot, Peter E. Weiss, and Kimberly A. Woodhouse, 2015.",
            "Summary of marked components",
            "To increase lecture engagement, you should write down key points in your own words – I provide lecture summary sheets on LEARN that can be used for this purpose.",
            "The midterm test and final exam are closed-book, written individually, and consist of randomized multiple-choice questions based on the slide decks covered in the course lectures.",
            "Question format:  43 randomized multiple-choice questions",
            "Any reason for missing the midterm, other than those listed above, results in a score of zero on the midterm.",
            "Question format:  68 randomized multiple-choice questions",
            "Students who miss the final exam for one of these reasons will be eligible to write a deferred exam.",
            "Students who miss any final exam should contact the First-Year Engineering Office as soon as possible."
        ]
    },
    {
        "course_id": 3,
        "course_code": "ECE 198",
        "course_name": "ECE198 - Project Studio (0.25)",
        "term_name": "1A Term",
        "program_name": "Computer Engineering",
        "program_id": 39,
        "major_id": 2,
        "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)",
        "topics": [
            "ECE 198",
            "ECE 198 001",
            "08:30AM - 10:20AM E2 1792",
            "08:30AM - 09:20AM E7 5353",
            "10:30AM - 12:20PM E2 1792",
            "08:30AM - 10:20AM E2 1792",
            "08:30AM - 09:20AM",
            "The Course Instructor is responsible for overseeing the instructional design and coordinating the delivery of the course, including managing the Teaching Assistants.",
            "Amirhossein Akbarian",
            "Mohammadamin Hosseini",
            "Eric Yu",
            "sa7hosse@uwaterloo.ca",
            "View requirements for ECE 198",
            "The intention of this course is to provide students with an opportunity to apply engineering concepts in a small multidisciplinary design project to solve a specific problem.",
            "Apply critical thinking skills to specify, design, and verify an engineering solution.",
            "Quantify a series of specifications to define the project stakeholder’s design and performance requirements.",
            "Apply mathematical and scientific principles within quantitative technical analysis in order to design a solution that meets the specifications.",
            "Specify and demonstrate test methods to evaluate the design’s performance.",
            "Implement a prototype to test and verify the design.",
            "Develop and deploy basic software on a microcontroller, with the use of an Integrated Development Environment.",
            "Both partners must attend each meeting.",
            "It is highly recommended that students prepare to submit in advance of the deadline with enough time in advance just in case of unexpected submission difficulties.",
            "In addition, students may choose to make a submission that they know does not have a possibility of earning a perfect grade.",
            "It may be preferable to make a submission for partial grade than to incur a late penalty.",
            "It specifies key quantified requirements that the system is intended to fulfil.",
            "Design Document",
            "Implementation Demo",
            "The Implementation Demo is a live presentation and demonstration of the implementation of the system or a prototype of the system, designed by the project group.",
            "STM32 Nucleo development board https://wstore.uwaterloo.ca/ece-198-kit.html Yes",
            "STM32 Nucleo development board",
            "While for capital-intensive equipment such as lab instrumentation it makes sense to amortize the cost of the equipment across many students, in cases where materials are considered \"consumable\" or more individual in nature, it makes more sense for students to each own their own materials.",
            "In addition, this same development board will be used in the ECE 298 course in second year.",
            "At the end of term, be sure to retain your Nucleo-F401RE development board for future courses.",
            "Initial technical information about the Nucleo-F401RE board can be found here:",
            "The UW Engineering Society provides an electronics and components shop called RidgidWare in E7:",
            "4-core processor",
            "USB-A port",
            "If a project partner proceeds to make submission despite raised concerns, a complaint can be submitted to the Teaching Assistant, who will investigate.",
            "Style for References and Citations",
            "As a research tool it can be helpful in generating leads or avenues of research to investigate.",
            "As an editing tool, it can be helpful in exploring alternate ways to communicate that may be more effective.",
            "However, it can be easy to over-use this technology.",
            "There are some key risks to over-using AI.",
            "Second, you will not come to an understanding of the key purposes and functions of an engineering design process.",
            "These records must include details of the AI system used and details of the inputs submitted to the system.",
            "Some AI systems may have been trained on data sets without appropriate permission from the owners of the data.",
            "Verification"
        ]
    }
]