[{"course_id": 352, "course_code": "PLAN 349", "course_name": "PLAN349 - Urban Form and Spatial Structure (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["An examination of the major factors giving rise to distinctive styles of urban spatial organization.", "The best planning practices from developing countries are being used in some western industrialized countries, and vice versa.", "Based on current globalization and learning from best planning practices worldwide, this course will offer comparative analysis of urban spatial structure and urban form, as well as administrative and regulatory implications of urbanization around world.", "Be aware of the evolution of the urban systems in each world region", "Understand the common urban problems and their possible solutions in many cities", "Become familiar with urban form and internal urban structure and how they may be demonstrated in different world cities", "Appreciate a comprehensive set of tools for understanding the changing urban forms", "Become familiar with critical thinking in urban problems and internal structure", "They can expect to learn the elements of clear thinking and to be nurtured in their development to be careful, critical, and innovative thinkers.", "Global knowledge of urban issues and overseas experience: Students should be able to demonstrate an awareness of the environmental, economic, social diversities and interdependences that exist among nations and regions.", "Advanced writing skills: Students should be able to communicate ideas clearly and cogently.", "General Introduction – World Urban Development; Concepts and Definitions", "Introduction to Cities.", "Introduction to Cities.", "WEEK 3. Cities of Middle America; Cities and Systems", "World cities under conditions of financialized globalization: Towards an augmented world city hypothesis.", "Introduction to Cities.", "Chapter 3: Social Theories of Urban Space and Place: Perspectives in the Post-World War II era.", "Introduction to Cities.", "Recommended readings: Introduction to Cities.", "Inequality and Diversity in the Post-World War II Metropolis.", "Introduction to Cities.", "Cities of Sub-Saharan Africa; Integrated transportation and land use planning", "Introduction to Cities.", "Cities of Southeast Asia; Peri-urbanism and Metropolitan Regions", "The real estate turn in policy and planning: Land monetization and the political economy of peri-urbanization in Asia.", "Introduction to Cities.", "Urbanization and Cities in Developing-country Cities.", "Cities of East Asia; Urban heritage and conservation planning", "Heritage conservation and the politics of difference.", "Heritage conservation through planning: A comparison of policies and principles in England and China.", "Cities of Australia and the Pacific Islands; Urban Poverty Alleviation", "Financial development and poverty reduction nexus: A cointegration and causality analysis in Bangladesh.", "The track of this global expedition weaves through nine major regions of the world, exploring significant urban patterns, processes, and internal spatial structure.", "Students are asked to relate the principles of sustainable urban forms to the reflections, since these principles provide a powerful framework for constructing ideas and discussions.", "The concept of urban form and principles of sustainable urban forms should be discussed in the assignment.", "A strong reflection will summarize key course concepts and principles and apply them to personal experience and perceptions.", "Discuss how these experiences have shaped your awareness of the impact of certain urban forms on people’s experience with cities in the countries that we cover in Week 2 to Week 4, your personal values, and your approach to planning/geography.", "Formatting:", "Problem-solving mentalities and skills are crucial for planners and geographers.", "These five categories of tools include 1) planning and building regulation (e.g. intensification); 2) fiscal and non-fiscal incentivization (e.g. special economic zone); 3) direct provision by public and/or voluntary sectors (e.g. public sector involvement); 4) education and awareness-raising (e.g. planning-related open houses); and 5) promotion of behavioral change (e.g. pedestrian friendly public space and TOD design).", "Please note that students must focus on one planning tool for an in-depth evaluation, even if multiple tools are involved in the chosen case.", "A strong report will comprehensively evaluate the chosen planning tool (including its functions, implementations, strengths and weaknesses, and socioeconomic consequences).", "Introduction (2 marks)", "A brief and general reflection on the comprehension and implementations of planning tools (3 marks)", "At least five references regarding the chosen planning tool should be cited.", "Formatting:", "Web searches may be helpful in identifying up-to-date factual material and empirical illustrations, but do not qualify towards an item count of reference materials].", "The essay should at least consist of an introduction, a middle portion presenting major findings, and a summary or conclusion.", "The purpose of the analysis is to present a synthesis and critical analysis of the readings and/or your own reference resources.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 353, "course_code": "PLAN 414", "course_name": "PLAN414 - Heritage Conservation Planning (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["SEM", "Online - Asynchronous", "Email: mletourneau@uwaterloo.ca", "Join Zoom Meeting https://us06web.zoom.us/j/88003457775?pwd=vBsdDRY3PpBoUUdLcvZ4mVc8j5m4Ap.1", "Email: s2hai@uwaterloo.ca", "The role of cultural heritage in the community context is examined.", "Varying forms of heritage preservation, its function and organization are covered.", "This course may include a field component.", "The role of cultural heritage in the community context is examined.", "Varying forms of heritage preservation, its function and organization are covered.", "This course may include a field component.", "(If a field trip occurs, the cost will not exceed $25.)", "Graduate Students: Special session to be booked", "INTRODUCTION", "This is a course that explores the question, “What is the role of cultural heritage resources in urban and regional planning?”", "Through class projects, students will learn about, and work with, the basic tools for inventorying and evaluating cultural heritage resources as well as some of the key legislative and policy tools available to them.", "Demonstrate how heritage planning is an integral part of sustainable, healthy, and resilient communities as well as urban and regional planning", "Challenge students to consider some of the practical, legislative, and ethical issues of practice", "Explore the diversity of heritage conservation planning activities, challenging preconceptions, and illustrating opportunities", "Lectures will build upon the text, and will provide specific case studies, more detailed information, and in some cases, alternative viewpoints.", "Begins", "Course Introduction and overview", "The importance of nomenclature", "The Value of Heritage and the Heritage of Value", "Your solution, their problem-Their solution, your problem: The Gordian knot of cultural heritage planning and management at the local government level in Australia.", "The evolution of the heritage conservation context", "The Concept of Cultural Heritage - Its History and its Challenges", "Aleida Assmann \"The Concept of Cultural Heritage\"", "Human Remains and Heritage Planning", "101-155 & 217-255.", "Activity – Understanding Heritage By-laws", "The Importance of Understanding and Research", "Sites of Conscience", "Sites of Conscience", "18th Century - www.youtube.com/watch?v=nx8CvzaPlgw", "19th Century - www.youtube.com/watch?v=1oxIQARyL-U", "In Well-preserved: The Ontario Heritage Foundation’s manual of principles and practice for architectural conservation.", "Truth and Reconciliation Commission of Canada.", "Understanding the Economics", "Research Design", "Support to policy development in the field of intangible cultural heritage www.youtube.com/watch?v=qSPrqUYc0OA", "Insurance and Heritage Properties - National Trust for Canada", "Heritage designation and property values: Is there an effect?", "Urban Design and Heritage", "Sustainability and Heritage in a World of Change", "Sustainability and Heritage in a World of Change", "Mining threats UNESCO World Heritage Sites in Canada Mining threats UNESCO World Heritage Sites in Canada", "during times of Populism - Laurajane Smith[Video] Political uses of Heritage during times of Populism - Laurajane Smith", "Understanding values of cultural heritage within the framework of social identity conflicts.", "Sustainable heritage-in-practice: Relationships, goals, localization and models.", "Archaeology and Heritage Planning", "Ontario Archaeology 101 – The Ontario Historical Society", "Managing Change", "The Museum", "The shift towards values in UK heritage practice.", "Planning for the Worst", "Risk Assessment for Cultural Heritage", "Protecting Cultural Heritage from Disasters", "Introduction: Cultural heritage as a futuristic field.", "For these assignments, students will choose one of the following topics and write a critical academic paper on it.", "Studentsare expected to undertake a short literature review; identify any relevant legislation, charters, statements, or texts (as necessary); and provide a short case study for illustrative purposes.", "Note the papers must be planning focused!", "Planning for Cultural Landscapes", "Planning for Sustainability and Heritage", "Planning for Intangible Heritage", "Graphics and illustrations should be included where appropriate.", "The paper should be 2000-2500 words in length.", "The summary report can be written in the first person but should still be a critical academic discussion.", "The professor will be responsible for the evaluation of all graduate papers and proposals.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 354, "course_code": "PLAN 415", "course_name": "PLAN415 - Urban Planning and Development in Transitional China (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Urban Planning and Development in Transitional China Winter 2024", "10:00AM - 11:20AM RCH 208", "This course offers a critical understanding of China's urban planning and development in the context of the country's economic reform and globalization.", "To understand China’s fundamental and gradualist approach toward economic reform and the dichotomy of the political-economic legacy from the planned economy era and the so-called socialist market-oriented economy", "To gain a critical understanding of the central underpinnings of China’s post-reform urban planning and development in a global context", "To become familiar with current debates and recent empirical cases in the field of urban China studies", "To develop the ability to identify, narrate and frame research questions in the Chinese context, and develop a critical perspective for understanding the most current issues in China and its impact global-wise", "General Introduction; China’s geographical setting and traditional cities", "Pre-socialist urbanization; Uneven regional development", "The design dimension of China's planning system: urban design for development control.", "Migration and population mobility; Migration and labor market", "Migration and development in China: Trends, geography and current issues.", "Urban economy; space and architecture in globalization", "Urban infrastructure; Transnational network and new economic space", "Building new towns in China–A case study of Zhengdong New District.", "Land markets and management; Urban housing", "The privatization of urban housing in China and its contribution to financial system development.", "Environmental quality and sustainability; Urban expansion and suburbanization", "Stochastic environmental research and risk assessment, 28(4), 757-765.", "Lifestyle and social change; Class and inequality from social and political perspective", "Social stratification in transitional economies: property rights and the structure of markets.", "There are three one-hour in-class closed-book tests for this course.", "Each test covers the required readings for the weeks before the tests.", "Web searches may be helpful in identifying up-to-date factual material and empirical illustrations, but do not qualify towards an item count of reference materials].", "The essay should at least consist of an introduction, a middle portion presenting major findings, and a summary or conclusion.", "The purpose of the analysis is to present a synthesis and critical analysis of the readings and/or your own reference resources.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 355, "course_code": "PLAN 431", "course_name": "PLAN431 - Issues in Housing (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["View requirements for PLAN 431", "An examination of social planning and policy issues associated with Canada's housing system, considering the roles of various levels of government and the private sector in developing socially sustainable, affordable housing.", "We use case study methods to examine the redevelopment of social housing.", "This course normally includes a fee component.", "A central emphasis will on the political-economic factors that shape how housing is distributed and experienced in the contemporary city, and how the provision and development of housing relates to social justice in the city.", "Week 1 (Jan. 8) - Introduction: The Value of Housing", "Film Week", "Students can purchase a physical copy from the Wstore for $33.95 via this link: https://lb.ca/cgi-bin/cgiwrap/additem.bbx?/Z109991/I9781804294949", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 356, "course_code": "PLAN 432", "course_name": "PLAN432 - Health and the Built Environment (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["08:30AM - 09:50AM EV2 2002", "Dr. Adrian Buttazzoni", "Students will learn the history and evolution of both public health and urban planning professions and academic disciplines and gain an appreciation of the theories and methods used in each.", "Introduction", "This course will trace the history and evolution of both professions, academic disciplines, and will compare both theory and methods used.", "Compare planning and public health perspectives on: history and the evolution of the disciplines; theory; methods; power and jurisdiction", "Identify and analyze interactions between natural and built environment characteristics and human health and disease", "Demonstrate interdisciplinary collaboration skills and articulate the benefits of interdisciplinary group work", "Articulate equity considerations of planning decisions and explain the extent to which equity may or may not be important in planning", "Gather and synthesize evidence and develop data-driven predictions of future urban trends.", "Online lecture material covers conceptual and empirical examples/case studies of environment and health relationships.", "Students are responsible for completing the required readings each week, and for keeping informed about course information through LEARN.", "Readings have been selected to provide a balance of breadth and depth into important course concepts.", "Jan 8 Module 1: Introduction to the Course, Equity", "Module 2: History and Evolution of Planning and Public Health", "Introduction to the Future Cities Institute", "Module 3: Theory in Planning and Public Health", "Feb 10, 12 Module 6: Cardiovascular, Muscular, and Skeletal Systems and the Built Environment", "Feb 24, 26 Module 7: Digestive System and the Built Environment", "Mar 17, 19 Module 10: Climate Change and Physiological Systems", "The role of behavioral science theory in development and implementation of public health interventions.", "Commentary: alternative cultures in planning research—from extending scientific frontiers to exploring enduring questions.", "Should planners create hierarchies of evidence?", "The value of Twitter data for determining the emotional responses of people to urban green spaces: A case study and critical evaluation.", "Supervised injection facilities in Canada: past, present, and future.", "Rather than reading on your own, we will be using Perusall – a software designed for collaborative reading where you will be annotating, questioning, and commenting on the assigned readings in groups of students.", "The completion of readings and your level and quality of engagement establish your grade.", "Remember you are communicating a complex topic to a general audience, so you will want to find a balance between the depth and accessibility of information presented.", "Be creative!", "The purpose of this exercise is to familiarize students with having to analyze and communicate complex environment and health topics to general (i.e., non-expert) audiences that in contemporary society often do not read policy reports but rather engage fact sheets, infographics, executive summaries, and other forms of high-level communications.", "Examples of fact sheets/infographics can be found on the CDC website (Spotlight Infographic section) or via these links to infographics about heart disease, adolescent health, and health status and determinants.", "You will be presenting the findings of your final reports to a guest panel of Future Cities Representatives.", "*Detailed assignment instructions can be found on LEARN", "Fact Sheet and Issue Summary", "Short-term absence declarations will be dealt with in the following ways:", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Reading the syllabus: Professors spend a LOT of time and energy creating syllabi that we think are clear, and let students know what to expect and how to prepare.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 358, "course_code": "PLAN 471", "course_name": "PLAN471 - Planning and Municipal Law (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["08:30AM - 11:20AM RCH 112", "08:30AM - 11:20AM RCH 112", "TBA", "Planning issues dealt with by the Ontario Municipal Board are used to illustrate the power to regulate the use of land, the law relating to citizen participation, problems of non-conforming uses, and the maintenance of environmental quality in neighbourhoods and communities.", "Introduction", "This upper-level course is designed to enhance students’ understanding of the laws and policies that guide land-use planning in Ontario and in the broader Canadian context.", "Evaluate key planning legislation, plans and guidelines that regulate land-use planning in the Province of Ontario", "Differentiate between the regulatory powers of various levels of government in relation to planning", "Apply their knowledge of planning law to the analysis of planning case studies", "Meetings outside of this time can be scheduled by e-mail.", "Core knowledge will be assessed through a mid-term test and cumulative exam.", "Introduction", "The legal basis of planning", "Jan. 24 Municipal power & authority", "Constitution Acts", "Des Rosiers & Anescu, 2024", "Mosonyi & Baker, 2016", "Feb. 7 Charter of Rights and Freedoms", "Charter of Rights & Freedoms", "Mar. 14 Official Plans", "Mar. 20 Zoning by-laws", "Student success in the course will be evaluated through individual and group assignments as well as a mid-term test and final evaluation.", "The School of Planning has adopted a single standard referencing system for all papers and assignments submitted in Planning courses.", "On the web you can find some other quick references for formatting and writing at the following URLs:", "APA Frequently asked Questions - http://www.apastyle.org/learn/faqs/", "University of Wisconsin-Madison Writing Centre: http://www.writing.wisc.edu", "In the case of a missed test or examination, students will be offered a make-up at an alternate time.", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 359, "course_code": "REC 100", "course_name": "REC100 - Introduction to the Study of Recreation and Leisure (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to the Study of Recreation and Leisure Winter 2025", "An overview of the broad field of recreation and leisure emphasizing the understanding of various leisure phenomena.", "place leisure and recreation within a social and historical context,", "discuss the impact of inclusion and exclusion upon leisure access and experience, and", "reflect on your understandings and experiences of leisure", "Please review these guidelines and be prepared to follow them should it become necessary for you to do so this term.", "COVID-19-Related Absence", "You will see a confirmation message upon submission of your absence, as well as receive a confirmation email to your uWaterloo email account.", "Documentation Requirements", "More information can be found under Submitting a Verification of Illness Form (VIF) and/or other supporting documentation.", "Intellectual property includes items such as:", "Our ability to be working and living here now—in Waterloo Region, in Ontario, in Canada—is a direct benefit of policies of expulsion and assimilation of Indigenous peoples during the time of settlement and Confederation, and since.", "Get to know the Office of Indigenous Relations", "This course includes the independent development and practice of specific skills, such as self-reflection.", "Library for research-based assignments"]}, {"course_id": 360, "course_code": "REC 101", "course_name": "REC101 - Introduction to Recreation and Leisure Services (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Recreation and Leisure Services Fall 2024", "10:30AM - 11:20AM OPT 347", "Email:                         lrpotwar@uwaterloo.ca", "b) Distinguish and discuss key attributes of the commercial, nonprofit, and public sectors", "c) Apply management concepts and theories to case studies and real-life examples", "d) Examine a current issue in sport, recreation, event and/or leisure services and be able to formulate and justify your position on the issue", "e) Generate excitement and uncover passion for organizational studies and the role of organizations in societal change", "Profile of the commercial leisure sector in Canada", "Corporate identity and branding", "Customer relationships and loyalty", "Profile of the not-for-profit sector", "Leadership and governance in NP organizations", "Not-for-profit fundraising, grants, and opportunities", "Social enterprise & social entrepreneurship", "Profile of the public leisure sector in Canada: Structure and Functions", "Public Administration and Finance", "Positioning recreation for public value", "Public sector marketing and positioning", "Blurring of the sectors"]}, {"course_id": 361, "course_code": "REC 200", "course_name": "REC200 - Play, Creativity and Child Development (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Play, Creativity and Child Development Spring 2024", "02:30PM - 05:20PM", "Email: luc.cousineau@uwaterloo.ca", "Email: sariai@uwaterloo.ca", "A critical analysis of definitions, concepts and assumptions of classical, recent and modern theories of play with implications for programming, planning and evaluating children's play.", "Understand and describe the nature of play and creative expression and their relationship to child development.", "Evaluate public and private leisure and other human service agencies provision of child and youth development programming, and identify the benefits of high quality programs.", "Apply acquired knowledge about play, creativity, and child/youth development to the development and application of programs/services for human services and recreation programs.", "Dietze & Kashin (2019) – Chapter 1: Exploring the", "Child Development", "Adolescent Development", "Community Places and Play (asynchronous lecture so the same time can be used to visit & evaluate a playground)", "Playground Evaluation", "Principles of Playground Design https://playgroundideas .org/10-principles-ofplayground-design/", "Are our school playgrounds being wrapped in cotton wool?", "A Genealogy of Summer Camp.", "In Becoming and Being a Camp Counsellor:", "Free-Range Parenting Debate", "Is Free-Range Parenting a Good Idea?", "2s", "The role of the coach in facilitating positive youth development: Moving from theory to practice.", "Play Spaces and Materials", "Development", "Play and Schools", "Appendix 3.7 Steps to Help Children and Schools Thrive", "Applying Universal Design for Inclusion in Play", "Yong (2017) – 6-year-old girls already have gendered beliefs about intelligence, The Atlantic https://www.theatlantic.com/science/archive/  2017/01/six-year-old-girls-already-havegendered-beliefs-about-intelligence/514340/", "-", "https://www.theatlantic.com/education/archiv  e/2017/09/whats-lost-when-only-rich-kidsplay-sports/541317/", "Students will conclude by making recommendations for practictioners based on their analysis.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 362, "course_code": "REC 201", "course_name": "REC201 - Introduction to Leisure, Equity, Diversity, and Inclusion for Just Communities (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Leisure, Equity, Diversity, and Inclusion for Just Communities Fall 2024", "Topics for critique and resistance may include, but are not limited to gentrification, capitalism, settler colonialisms, environmental injustice, and other systemic barriers at play within our leisure lives and communities.", "The purpose of this course is to enhance students' understanding of leisure in contemporary society by examining the beliefs, values, and social structures of their own leisure and comparing and contrasting them with the individual and social considerations of diversity, multiculturalism and social justice.", "Describe how the spaces and places of leisure reflect and reproduce cultural values, social role expectations, stereotypes, and hegemony", "Compare and contrast non-normative leisure across cultures and sub-cultures to explain how leisure reflects and reproduces cultural values, social role expectations, stereotypes, and hegemony", "Discuss how dominant cultural values influence leisure, including decisions about which populations are served in public, private, and commercial recreation", "Explain the relationship between leisure, equality/equity in relation to race/ethnicity, sex/gender, economic status, ability, sexuality, religion, and other cultural influences", "Create and support suggestions for individual and societal action related to leisure, the individual, and the \"common good,\" specifically as it addresses marginalized/oppressed communities", "Please be sure to read the lecture notes and do the readings, engage with materials, and reflect each week.", "Expectations", "No late assignments will be accepted for this class unless arranged with the instructor on a case by case basis PRIOR to due date.", "There are some basic competencies that I expect you will have in order to perform well in this class.", "Ability to cite references APA style when possible while making general and/or specific statements that are not entirely your own"]}, {"course_id": 363, "course_code": "REC 202", "course_name": "REC202 - History of Western Sport (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["History of Western Sport Spring 2024", "amanda.hooper@uwaterloo.ca", "This course considers the historical impact of sport in the western part of the world, especially Europe and North America.", "The connections between sport and social and cultural divisions in western history will be examined not only through consideration of how gender, class, ethnicity, religion, and region have sometimes divided views and attitudes toward sport, but also how the experience of sports by players or spectators have brought different groups to associate together.", "Sports can send messages regarding fundamental beliefs and values (one example being that Black and white baseball players in the age of segregation rarely played against one another), and the historical revelations that these messages contain will serve as our focal point throughout much of this course.", "Identify various roles sport has played in the historical development of a number of nations in the West;", "Distinguish different ways in which sport has influenced society and culture in the West;", "Engage in historical analysis to examine how sport has illustrated the changes experienced by various societies in the West.", "This will be rigidly adhered to and extensions will be granted only for bona fide medical problems that shall be verified by submission of a completed and signed University of Waterloo Verification of Illness form.", "Cross-listed courses", "Students with strong and valid reasons for requesting exemption from essay screening must inform the instructor by the last day of the first month of the term whereupon the exact nature of the extra essay requirements will be determined by email between the student and the instructor.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:"]}, {"course_id": 364, "course_code": "REC 203", "course_name": "REC203 - Sociology of Sport (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Sociology of Sport Winter 2025", "E-mail: apappas@uwaterloo.ca", "Contemporary issues, including racial and gender inequality and controversies over violence and drugs are also considered.", "This course examines sport in modern societies and the distinctive features of North American sport.", "Contemporary issues, including racial and gender inequality and controversies over violence and drugs are also considered.", "Most importantly, learners should be able to synthesize the major concepts, theories, and practical experiences covered here to devise and communicate how the organization of sport can be changed for the better.", "Discuss a range of social issues that affect sport and create conditions that require critical analysis to understand their continued impact on sport and sport systems;", "Describe and explain the key concepts and theories that related to sport within a society;", "Readings", "Why study the sociology of sport?", "Producing Knowledge About Sports and Society", "Evolution of Modern Sport", "Sports & Socialization: Who plays and why", "Sport and Indigenous Communities", "Sport and Activism", "Chapters 8 & 15", "Gender and Sport", "Deviance & Violence", "Sport & Social Class", "Sport and the Economy", "Sport and Politics", "Sport and Media", "Course Wrap up and Evaluation", "Sports in Society: Issues and Controversies (13th Ed).", "Issue Analysis Paper", "Total", "This course includes the independent development and practice of specific skills, such as communication, analytical, knowledge and reflection.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 368, "course_code": "REC 280", "course_name": "REC280 - Introduction to Tourism (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Tourism Winter 2025", "PhD Candidate, Department of Recreation and Leisure Studies Pronouns: she /her /hers", "Shenshen He (LAST NAMES L - Z)", "share a common experience: we’ve all been tourists.", "This course establishes a foundation for further study in leisure, recreation, and tourism while fostering a critical understanding of the key components that shape tourism.", "Through a critical lens, students will explore the systems and phenomena that organize tourism, with particular attention to leisure practices, travel motivations, and the dynamics of destination communities.", "tourism concepts with students’ existing knowledge, personal experiences, and diverse backgrounds, enhancing their capacity for advanced study, career development, and informed travel decisions.", "Additionally, students will examine the unique characteristics of Canada’s tourism sector, including emerging trends and future opportunities within the industry.", "Demonstrate a clear understanding of key concepts and terminology within the tourism sector.", "Apply theoretical frameworks to analyze, evaluate, and critique the social, environmental, cultural, and economic impacts of tourism.", "Readings", "The Birth of Tourism", "Introduction to the Course", "Introduction to Tourism and Hospitality in BC–2nd Edition", "Tourism and Travel Services", "Introduction to Tourism and Hospitality in BC–2nd Edition", "Mapping stakeholders’ roles in governing sustainable tourism destinations.", "Tourism Activities and Destinations", "Tourism and Destination Development", "Destination design: New perspectives for tourism destination development.", "Class Participations & Conduct 15%", "Evaluation", "Number of Evaluation", "Explanation", "In-person & Class", "Submit to Dropbox", "Submit to Dropbox", "Submit to Dropbox", "Submit to Dropbox", "Submit to Dropbox", "TBD", "In-person", "Class Participations & Conduct", "In-person & Class"]}, {"course_id": 370, "course_code": "REC 319", "course_name": "REC319 - Event Planning and Design (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Event Planning and Design Winter 2025", "RCH 101", "BMH 2208", "This course focuses on the core areas of event planning and design including logistics, risk management, human resources, sponsorship and financial management, marketing and assessments.", "View requirements for REC 319", "Introduction", "Event Analysis #1", "Event Analysis #1", "Lecture: Operations and Logistics", "Event Analysis #2", "Event Analysis #2", "March 24", "Event Analysis #3", "Event Analysis #3", "Event Analysis:"]}, {"course_id": 371, "course_code": "REC 356", "course_name": "REC356 - Leisure and Community (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["08:30AM - 09:50AM MC 1056", "Email:                         briggin@uwaterloo.ca", "Email:                         jcholman@uwaterloo.ca                    tdowla@uwaterloo.ca", "This course covers concepts, theories, models, and issues relevant to understanding relationships between leisure and community.", "Investigate concepts, theories and techniques of community organizing in the context of recreation and leisure.", "Confront and think critically about concepts such as power, marginalization, and poverty, as well as the role of the government in service provision.", "Introduction to the course", "&", "Frontiers in Psychology, 14, 1067569.", "& Sept 18", "A short guide to community development.", "Sept 24", "The housing crisis", "&", "Housing crisis", "continued: Habitat for Humanity Guest speakers and", "Discussion", "Discussion", "belonging", "The role of sport in community capacity building: An examination of sport for development research and practice.", "and power", "Tourism and community development versus tourism for community development: Conceptualizing planning as power, knowledge and control.", "Tourism and community", "Growing a garden can also bloom eco-resilient, cross-", "resilient-cross-cultural-food-sovereign-communities-121543", "&", "How can music build community?", "LEVERAGING CHALLENGE IMPACT STATEMENTS DUE TODAY", "Wasted: towards a critical research agenda for disposability in leisure.", "The ideas we cover at the outset of the course are both foundational and fundamental to", "building a critical understanding of the relationship between leisure and community.", "The purpose of this assignment is to encourage you to read and prepare for our class meetings and to facilitate class discussions.", "These postings must be well organized and prepared and pay attention to issues of citation and attribution."]}, {"course_id": 372, "course_code": "REC 361", "course_name": "REC361 - Aging and Leisure (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Sarah Brady", "Email: s2brady@uwaterloo.ca", "Email: shernesn@uwaterloo.ca", "It focuses both on the theoretical aspects of aging and their implications for leisure and on the practical aspects of recreation and leisure program development, delivery, and facilitation for all older adults.", "critically reflect on understandings of old age, ageing, and stereotypes of ageing, how these understandings shape interactions with older adults in recreation contexts, and how leisure and recreation shape these understandings and perpetuate ageism in our society", "examine characteristics of global ageing and the Canadian older adult population as well as current issues and research in the field of ageing and their implications for recreation, leisure and lifestyle", "facilitate and participate in discussion with older adults and student peers about key social trends and issues related to leisure in later life", "critique notions of successful ageing and explored the connections between leisure, ageing well, and age-inclusive communities", "explore and compare the variety of leisure opportunities, programs and services available for, and utilized by, diverse older adults in the community and in long-term care settings", "identify gaps in leisure practice targeted at older adults, especially marginalized older adults, and envisioned and proposed new innovative possibilities for recreation and leisure activities, programs, services, and products that support life enrichment and flourishing in later life", "Introduction to Ageing and Leisure", "Leisure solutions for combatting ageism – How might we use leisure to combat ageism in our society post-pandemic?", "Leisure and risk in later life – Do older adults need protecting?", "Age segregation versus age integration – Is there a need for age specific communities, centres and programs?", "Robotic pets and friends/assistants – Is this really the answer to addressing isolation and staff shortages in later life?", "This is the last chance to complete one of the four Preparatory Reflection Exercises required", "Group Innovation and Ageing Project 25%"]}, {"course_id": 373, "course_code": "REC 362", "course_name": "REC362 - Sociology of Aging (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Email: eneiterman@uwaterloo.ca", "Email: smakarim@uwaterloo.ca", "Email: s5leslie@uwaterloo.ca", "Elizabeth Wang", "Email: e69wang@uwaterloo.ca", "Email:  t4joshi@uwaterloo.ca", "KIN 352: View requirements for KIN 352", "REC 362: View requirements for REC 362", "In the first part of the course, we will learn to understand aging as a socially constructed phenomenon.", "In the final part of the course, we will critically assess the social and financial supports available to older adults in our society.", "Explain why aging can be considered a socially constructed phenomenon", "Explain why Canadian population is aging and what contributes to this trend", "Identify and summarize some of the theories in social gerontology", "Describe major sources of social inequalities that impact individuals in old age", "Describe how major social institutions shape the aging process", "Define and explain healthy and successful aging", "Explain the role of family and social support in the lives of older adults", "Identify major challenges in the end-of-life issues experienced by older adults", "Enhance research, writing, and critical appraisal skills", "Introduction to Course Course Outline", "Sociological Perspectives and Aging Theories", "Immigration and Aging", "Physical and social activity in later life", "Older Persons and their Family Roles", "I can ask you questions that test your understanding of the readings, lectures, and class discussions, and assess your level of comprehension in relation to that of your peers.", "The goal of this assignment is to explore how the aging process is shaped by social and individual factors and to try yourself as a researcher in the field of social gerontology.", "Letter of Information and Consent Form", "Interview guide", "We will practice the technique of semi-structured qualitative interviewing during the workshop in class.", "If this is the case, students must clearly identify each interviewer, as each student will receive an individual grade for the assignment", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 374, "course_code": "REC 383", "course_name": "REC383 - Tourism Impacts - International Perspectives (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Tourism Impacts - International Perspectives Winter 2025", "08:30AM - 09:50AM EV3 1408", "sanjay.nepal@uwaterloo.ca", "The course examines the nature, significance, and costs and benefits of tourism in the context of tourism destinations in developed and developing countries.", "It employs an international perspective to assess the economic, environmental, social, and cultural impacts of tourism in diverse settings.", "View requirements for REC 383", "Understand broader social-science concepts relevant to the study of tourism", "Understand key concepts used in assessing and measuring the impacts of tourism", "Determine the costs and benefits of global tourism on the economy, environment, society and institutions", "Evaluate global tourism impacts at a specific destination (i.e., country) in the context of COVID-19", "Assignment – Case studies in tourism impacts", "The nature and significance of tourism", "Scope of tourism and its relationships with other sectors; changing patterns of international tourism", "21/23   Jan       Tourism Impacts - Concepts and Frameworks", "Elements of tourism; spatial and temporal concerns; frameworks for understanding the impacts of tourism", "Post-Pandemic Travel and Destinations", "Tourism Settings", "Internal and External considerations", "Tourism and Resilience", "Alternative Tourism Concepts", "Gig economy in current economic realities", "Feb 13 – Student case studies of economic impacts", "27 Feb             Environmental Impacts: Tourism-environment relationship, environmental impacts, climate change and resilience", "11/13 Mar      Environmental Impacts – Transportation and Aviation", "Mar 20 – Student case studies of environmental impacts", "Ethical and social dilemmas in tourism", "3 April          Student case studies of social/cultural impacts", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics"]}, {"course_id": 375, "course_code": "REC 408", "course_name": "REC408 - Gender and Leisure (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["04:00PM - 05:20PM", "E-mail: dcparry@uwaterloo.ca", "Gendered aspects of leisure will be explored in a variety of social and cultural contexts, including families, informal and social settings, organized leisure, and the media.", "Emphasis will be placed on understanding the ways in which gender relations and", "Identify and discuss current issues and controversies in the analysis of leisure and gender.", "Explore issues and topics related to gender and/or the family and leisure.", "Attending and contributing to class is a critical component to the course evaluation.", "This course includes the independent development and practice of specific skills, such as  critical thinking, writing, data analysis and data representation.", "Library for research-based assignments"]}, {"course_id": 376, "course_code": "REC 422", "course_name": "REC422 - Urban Recreation (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Urban Recreation Fall 2024", "04:00PM - 05:20PM", "Teaching Assistant: Sina Kuzuoglu - skuzuoglu@uwaterloo.ca", "To explore the processes of placemaking and how leisure fits with animating urban space and facilitating urban life;", "To encourage critical thinking about current urban issues—and creative solutions to them—as they relate to recreation, sport, and tourism in a city; and", "Sep. 9 & Sep. 11", "Sep. 16 & Sep. 18", "A stealthy reimagining of urban public space | Elizabeth Diller. https://www.youtube.com/watch?v=qZjr2CIEflc", "Sep. 23 & Sep. 25", "How do we make our public spaces vibrant?", "Sep. 30 & Oct. 2", "Oct. 9 & Oct. 11", "How do we engage urban inhabitants in placemaking?", "Oct. 21 & Oct. 23", "Oct. 28 & Oct.  30", "Hostile urban architecture: A critical discussion of the seemingly offensive art of keeping people away.", "DIY-Urbanist Project Presentations", "How can we reimagine our streets for people?", "In the Zone: Performing fandom and branding in Toronto’s Jurassic Park.", "How do we rethink nature in our cities?", "DIY Urbanist Project Presentation 25%", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 377, "course_code": "REC 425", "course_name": "REC425 - Heritage Conservation Planning (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["SEM", "Online - Asynchronous", "Email: mletourneau@uwaterloo.ca", "Join Zoom Meeting https://us06web.zoom.us/j/88003457775?pwd=vBsdDRY3PpBoUUdLcvZ4mVc8j5m4Ap.1", "Email: s2hai@uwaterloo.ca", "The role of cultural heritage in the community context is examined.", "Varying forms of heritage preservation, its function and organization are covered.", "This course may include a field component.", "The role of cultural heritage in the community context is examined.", "Varying forms of heritage preservation, its function and organization are covered.", "This course may include a field component.", "(If a field trip occurs, the cost will not exceed $25.)", "Graduate Students: Special session to be booked", "INTRODUCTION", "This is a course that explores the question, “What is the role of cultural heritage resources in urban and regional planning?”", "Through class projects, students will learn about, and work with, the basic tools for inventorying and evaluating cultural heritage resources as well as some of the key legislative and policy tools available to them.", "Demonstrate how heritage planning is an integral part of sustainable, healthy, and resilient communities as well as urban and regional planning", "Challenge students to consider some of the practical, legislative, and ethical issues of practice", "Explore the diversity of heritage conservation planning activities, challenging preconceptions, and illustrating opportunities", "Lectures will build upon the text, and will provide specific case studies, more detailed information, and in some cases, alternative viewpoints.", "Begins", "Course Introduction and overview", "The importance of nomenclature", "The Value of Heritage and the Heritage of Value", "Your solution, their problem-Their solution, your problem: The Gordian knot of cultural heritage planning and management at the local government level in Australia.", "The evolution of the heritage conservation context", "The Concept of Cultural Heritage - Its History and its Challenges", "Aleida Assmann \"The Concept of Cultural Heritage\"", "Human Remains and Heritage Planning", "101-155 & 217-255.", "Activity – Understanding Heritage By-laws", "The Importance of Understanding and Research", "Sites of Conscience", "Sites of Conscience", "18th Century - www.youtube.com/watch?v=nx8CvzaPlgw", "19th Century - www.youtube.com/watch?v=1oxIQARyL-U", "In Well-preserved: The Ontario Heritage Foundation’s manual of principles and practice for architectural conservation.", "Truth and Reconciliation Commission of Canada.", "Understanding the Economics", "Research Design", "Support to policy development in the field of intangible cultural heritage www.youtube.com/watch?v=qSPrqUYc0OA", "Insurance and Heritage Properties - National Trust for Canada", "Heritage designation and property values: Is there an effect?", "Urban Design and Heritage", "Sustainability and Heritage in a World of Change", "Sustainability and Heritage in a World of Change", "Mining threats UNESCO World Heritage Sites in Canada Mining threats UNESCO World Heritage Sites in Canada", "during times of Populism - Laurajane Smith[Video] Political uses of Heritage during times of Populism - Laurajane Smith", "Understanding values of cultural heritage within the framework of social identity conflicts.", "Sustainable heritage-in-practice: Relationships, goals, localization and models.", "Archaeology and Heritage Planning", "Ontario Archaeology 101 – The Ontario Historical Society", "Managing Change", "The Museum", "The shift towards values in UK heritage practice.", "Planning for the Worst", "Risk Assessment for Cultural Heritage", "Protecting Cultural Heritage from Disasters", "Introduction: Cultural heritage as a futuristic field.", "For these assignments, students will choose one of the following topics and write a critical academic paper on it.", "Studentsare expected to undertake a short literature review; identify any relevant legislation, charters, statements, or texts (as necessary); and provide a short case study for illustrative purposes.", "Note the papers must be planning focused!", "Planning for Cultural Landscapes", "Planning for Sustainability and Heritage", "Planning for Intangible Heritage", "Graphics and illustrations should be included where appropriate.", "The paper should be 2000-2500 words in length.", "The summary report can be written in the first person but should still be a critical academic discussion.", "The professor will be responsible for the evaluation of all graduate papers and proposals.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 378, "course_code": "SI 231R", "course_name": "SI231R - Calligraphy to Conceptual Art: Text as an Image in Islamic and East Asian Visual Arts (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Calligraphy to Conceptual Art: Text as an Image in Islamic and East Asian Visual Arts Winter 2025", "02:30PM - 05:20PM", "S. Sheikh", "02:30PM - 05:20PM", "S. Sheikh", "Email: s26sheik@uwaterloo.ca", "Exploring the history of Islamic and East Asian calligraphic arts and the study of Eastern and Western artists, this course examines multiple ways in which writing and other forms of visible language are incorporated into visual arts.", "SI 231R: View requirements for SI 231R", "EASIA 231R: View requirements for EASIA 231R", "FINE 275: View requirements for FINE 275", "Open to Fine Arts graduate students only.", "View requirements for FINE 695", "Lectures, readings and discussions provide an introduction to history of Islamic and East Asian calligraphic arts as well as an overview of text-based art in Western art.", "The course provides an opportunity for creating calligraphy-based projects using traditional Asian and Islamic calligraphy techniques.", "A broad understanding of historical and contemporary issues relevant to calligraphic and text-based art, including an interdisciplinary perspective enabling the student to see how these disciplines may be combined in their work.", "Demonstrate perceptual, visual, and conceptual skills through artmaking and as a critical viewer.", "Feb 12 – 16 Introduction to East Asian Scripts Ascending the Heron Tower (YouTube).", "“The Asian Dimensions of Postwar Abstract Art: Calligraphy and Metaphysics.”", "Cross-listed courses", "Intellectual property includes items such as:", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 380, "course_code": "SCI 267", "course_name": "SCI267 - Introduction to the Philosophy of Science (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to the Philosophy of Science Winter 2025", "Prof. Doreen Fraser", "This course considers fundamental questions concerning the nature of science.", "Topics will include scientific methodology, the roles of values and social factors in scientific knowledge production, scientific revolutions, scientific explanation, and the scientific realism debate.", "In class activities and assessments will develop students’ reading comprehension and oral and written communication skills.", "A current version of the Schedule of Topics and Readings is available on LEARN.", "The book chapters and the electronic readings listed in the schedule of readings and topics posted on LEARN are required.", "Analysis of an Example Assignment 20%", "Analysis of an Example", "This course includes the independent development and practice of specific skills, such as formulating and evaluating arguments.", "Library for research-based assignments", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Cross-listed courses", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 392, "course_code": "SYDE 261", "course_name": "SYDE261 - Design, Systems, and Society (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Design, Systems, and Society Winter 2025", "11:00AM - 11:50AM E5 6006", "Sormeh Mehri - s2mehri@uwaterloo.ca", "This impact course focuses on identifying, understanding, and analyzing the interactions and impacts among technology, society and the environment for current and emerging technologies using theoretical and evidence-based analyses.", "Connections among systems of systems engineering, impact analyses, evidence-based analyses, needs assessment, the design process, advocacy, and professional engineering will be discussed and applied.", "research and analyze a complex systems problem for social, environmental, and economic considerations.", "4a) Identify needs, design requirements, constraints and specifications for complex, open-ended engineering problems (I)", "7a) Generate appropriate documentation to communicate within the profession and to society at large (D)", "10b) Identify how an engineer is accountable to multiple stakeholders in engineering practice (D)", "Thinking in Systems - Donella Meadows Optional No $32.95", "Climate Impact Analysis - due 8pm, March 14th, 2025 on LEARN 20% Individual", "• No extensions will be given after a submission date.", "Extensions will only be given for very serious issues and the formal VIF/Quest system should be used to document and file for these.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as design, systems analysis and written communication.", "Library for research-based assignments"]}, {"course_id": 406, "course_code": "THPERF 386", "course_name": "THPERF386 - Shakespeare 1 (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["The aim of this offering of this course is to examine the development of Shakespeare during the first part of his career as a playwright.", "This course aims to help students to develop their critical thinking skills through the analysis of the dynamics of early modern language and theatrical techniques, to broaden their knowledge of relevant research resources, and to improve their ability to articulate their ideas in forms of academic writing.", "History Then: Shakespeare's engagement of his own times — the social, political, economic, and ideological conditions and issues of Elizabethan England.", "Performance: Shakespeare's use of the features and conventions of early modern playhouses and our adaptation of the plays for stage and screen.", "1 Module I: Introduction Introduce Yourself", "2 Module II: The Comedy of Errors First Read-through Activity", "Essay Rehearsal Exercise", "3 Module III: Titus Andronicus First Read-through Activity", "Essay Rehearsal Exercise", "6 Module V: The Taming of the Shrew First Read-through Activity", "7 Essay Rehearsal Exercise", "8 Module VI: A Midsummer Night's Dream First Read-through Activity", "9 Essay Rehearsal Exercise", "10  Module VII: Romeo and Juliet First Read-through Activity", "Essay Rehearsal Exercise", "First Read-through Activity", "Essay Rehearsal Exercise", "Folger Digital Texts versions of the William Shakespeare readings are available for free in PDF form from http://www.folgerdigitaltexts.org/ under a CC BY-NC 3.0 Unported license.", "A PDF file of each reading can be found in the Course Information section in LEARN.", "Penalty for Late Submission", "Intellectual property includes items such as:", "Cross-listed courses", "Cross-listed courses", "Cross-listed courses", "Cross-listed courses", "Cross-listed courses", "Cross-listed courses", "Cross-listed courses", "Cross-listed courses"]}, {"course_id": 408, "course_code": "VCULT 100", "course_name": "VCULT100 - World Cinema and Visual Culture (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Prof. James Skidmore", "Introduction to film analysis via national cinemas and their worldwide reception, taking into account the role of new technologies.", "identify formal and stylistic elements of film", "interpret film with greater nuance and precision", "develop an appreciation for the cultural and contextual factors that influence film", "Identify formal and stylistic elements of film Lectures; Lecture Review Activities; Analysis Activities", "Develop an appreciation for the cultural and contextual factors that influence film All of the above", "Textbook and Online Software", "An Introduction to Moving Pictures Available online, free of charge.", "An Introduction to Moving Pictures - is available online, free of charge.", "Analysis Activities 25%", "simplified grading scheme emphasizes good faith over accuracy", "grade based on average of best seven", "done in class and uploaded to Crowdmark", "Analysis Activity", "Doing these activities prepares you for the Interpretation Activity and the Film Commentary Activity.", "Interpretation Activity", "In addition to the nine films being studied in class, you will watch a tenth film and prepare a five-minute video commentary on the film.", "if you wish, you can make a joint submission with one other person from the course (the submission must demonstrate that you’re both equally involved in the submission)", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses"]}, {"course_id": 409, "course_code": "VCULT 101", "course_name": "VCULT101 - Art History and Visual Culture (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["This course takes a case study approach to examining the role of the art object as a means of communication within the history of visual culture.", "We might think of the themes as case studies.", "We will also focus with equal intensity on the properties of visuality, i.e. how do images and objects communicate effectively?", "The primary goals of the course are to recognize the significant role visual culture plays in human history and human societies AND to develop the analytical skills and vocabulary to discuss images and objects within that context.", "Be introduced to, and develop basic research skills, for the study of visual images and objects by: using a range of resources and recognizing the parameters and properties of each (websites, newspapers, academic texts, interviews, films, etc.), and learning to access resources through the UW Library and other providers and platforms", "Become aware of, and actively engage with modes of decolonization by: becoming aware of power dynamics of forms of visual culture, recognizing the function/role of various forms of visual culture within various cultures, recognizing and understanding that there are multiple ways of knowing, and recognizing and understanding that multiple ways of knowing are communicated in various modes of visual culture and by various forms of analysis", "Late Work and Notes for Submissions of Assignments", "Many things can happen to students over the course of the semester, especially in these unusual times.", "This course includes the independent development and practice of specific skills, as described in the ‘Course Description’ and ‘Learning Outcomes’ above and in each of the Assessment descriptions, instructions, and rubrics.", "Please note: I am a member of UW’s Copyright Advisory Committee and am thus well-versed in copyright issues.", "Library for research-based assignments", "Fine Arts and Plagiarism and Copyright", "For example, making a drawing in pencil based on a photograph that you find in a magazine may constitute plagiarism and be an infringement of copyright.", "A note on copyright-free and Creative Commons:", "In this case, the authors decide how you can use their images."]}, {"course_id": 413, "course_code": "AFM 231", "course_name": "AFM231 - Business Law (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["07:00PM - 09:50PM", "Students can contact the course instructor via email at rhussein@uwaterloo.ca.", "Particular attention is given to the law relating to contracts and business organizations.", "AFM 231: View requirements for AFM 231", "While the course introduces you to basic concepts in law, it is designed for, and particularly emphasizes topics that will be of specific relevance to you as future business managers, owners, or even practicing professionals.", "This includes understanding the basics of legal risk so you can make more effective business decisions.", "Business managers/owners often must engage in risk management exercises.", "Appreciate the complexity of integrating multiple private law concepts into the analysis of a business situation.", "Utilize a basic framework for legal risk management assessments and generate an inventory of possible legal risk management tools.", "Describe the common as well as contrasting relationship between legal compliance and ethical conduct.", "March 24-28", "Wrap-up", "Accordingly, if students do opt to use an older edition it would be advisable to use an edition that is as close to the 8th edition as possible and consider cross-referencing it to the current edition and noting any differences.", "Completion", "The response demonstrates a clear understanding of the relevant course concepts and effectively applies these concepts to the hypothetical scenario.", "Application to Real-World Example", "The response includes an appropriate real-world example that relates to the course material, illustrating how the concept can be applied outside the context of the hypothetical.", "Students may also include a revised answer based on a similar but different set of hypothetical facts.", "For example, a student may propose one solution based on the given facts but suggest a different solution if the facts were altered.", "Students are expected to demonstrate critical thinking and clearly articulate their reasoning.", "Each quiz covers content that relates to the current course content (the current chapters and occasionally a prior chapter as well if it has not yet been part of a quiz).", "Submission Times", "Reevaluation Request", "Requests for re-evaluation of submitted material can be done via email.", "Also, students should detail what their concern as specifically as possible.", "Artificial Intelligence Tools", "Also, some evaluation elements are structured such that it may be even quicker to do it yourself than to utilize an AI tool and then further edit/revise before submission.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 414, "course_code": "ANTH 204", "course_name": "ANTH204 - Biological Anthropology (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Biological Anthropology Winter 2023", "ANTH 204 102", "Instructor: Dr. Alexis Dolphin", "Email: adolphin@uwaterloo.ca", "We begin with an overview of the scientific method, the history of evolutionary thought and the genetic basis of short-term and long-term evolutionary change.", "The third segment will address issues surrounding the fossil record of human evolution and human origins.", "Finally, we will explore modern human adaptation and variation in their environmental context.", "C. Critically evaluate anthropological literature in terms of methodology and validity of resulting conclusions", "D. Demonstrate appropriate and ethical laboratory practices while applying quantitative and qualitative method to the analysis of hominin and primate casts, human remains, and artifacts", "Readings", "Introduction to Anthropology", "& Evolutionary Thought", "Natural Selection,", "Bio Basics & Inheritance", "Natural Selection", "Evolution", "Skeletal Anatomy", "Primates &", "Their Evolution", "Primate Behaviour", "Humans & Primate Evolution", "Chapters 9 &", "Chapters 10 &", "Bioarchaeology", "Human Osteology", "“A Human Voyage: Exploring Biological Anthropology” by Anne Keenleyside and Richard Lazenby.", "The format of the test may include multiple choice, fill-in-the-blank, true-false, matching and/or short answer questions.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page."]}, {"course_id": 416, "course_code": "ANTH 305", "course_name": "ANTH305 - Paleopathology of Health and Disease (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "02:30PM - 05:20PM", "This course introduces students to the identification and interpretation of skeletal evidence for disease, ancient and modern concepts of health and disease, and current clinical interpretations of skeletal pathologies.", "Topics include pathology in archaeological remains and the process of developing a differential diagnosis of skeletal lesions.", "discuss the types of pathologies experienced by human populations in the past and into today along with the roles of environment, health, and socio-cultural realities as mitigating factors in disease experiences and treatments", "identify and differentially assess pathological alterations in human skeletal remains and what those alterations can say about the types of pathological conditions experienced by an individual", "Introduction to the course; what is palaeopathology;", "bone formation processes", "-", "-", "-", "Spinal Pathology and Metabolic Diseases", "Infectious Diseases", "-", "12-February", "19-February", "-", "-", "26-February", "Neoplastic Conditions", "-", "05-March", "Disorders of growth and development; special pathology", "-", "12-March", "Dental disease", "19-March", "Molecular assessments of pathogens; palaeoparasitology", "-", "26-March", "02-April", "Palaeoradiology and palaeopathology in the archives", "-", "Tilley L, Cameron T. Introducing the Index of Care: A web-based application supporting archaeological research into health-related care.", "Index of Care", "This is a website that was developed to aid in bioarchaeological assessments of ‘care’ in the past http://indexofcare.org/", "Midterms", "An annotated bibliography is meant to be a concise summary of what a cited resource covers.", "You should provide the reader with a ‘why should I read this and what is it all about’ summary of each source that can be used to see what topics are covered in a particular source.", "You can choose any citation style you like but only use one and make sure all details for readers to find the source are provided.", "In Word you can insert an en-dash via Insert > Advanced Symbol> Special Characters > En Dash.", "If you are uncertain about how many words are in a text and are using Microsoft Word, you can click Tools>Word Count and refer to the value given for the ‘Words’ category.", "Participation in class will be of a great benefit for becoming familiar with the topics of this course.", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as research writing syntheses.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "A held-with course will also only count towards program and breadth requirements of the subject code under which it is taken, unless it is cross-listed with the subject code of its’ held-with course.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "This is a research lab as well as a teaching lab, and there are materials from a number of archaeological collections stored here.", "No food of any type should be brought into the lab.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 418, "course_code": "ANTH 355", "course_name": "ANTH355 - Human Osteology (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Human Osteology Fall 2024", "A laboratory course in the anatomy and function of the human skeleton with an emphasis on recovering and identifying skeletal remains from archaeological and forensic contexts.", "Gain a practical ability to identify complete and fragmentary human adult and non-adult skeletal remains.", "Develop a broader sense of the practical and ethical implications of recovery, analysis, and curation of human skeletal remains in diverse contexts.", "04-September", "Introduction to the course;", "anatomical terms; and bone formation processes", "-", "11-September", "-", "18-September", "-", "25-September", "Skull: Face Bones & Mandible", "-", "02-October", "Dentition", "-", "No Readings", "16-October", "-", "-", "23-October", "-", "30-October", "Upper Limbs & Hand", "-", "No Readings", "Lower Limb and Foot", "-", "27-November", "No Readings", "The compact volume includes all the key information needed for identification purposes, including hundreds of photographs designed to show a maximum amount of anatomical information.", "This is a research lab as well as a teaching lab, and there are materials from a number of archaeological collections stored here.", "No food of any type should be brought into the lab.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Cross-listed courses", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "Intellectual property includes items such as:"]}, {"course_id": 422, "course_code": "ANTH 377", "course_name": "ANTH377 - Dental Anthropology (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Dental Anthropology Fall 2024", "Instructor: Dr. Alexis Dolphin", "Email: adolphin@uwaterloo.ca", "- Identify whole, fragmentary, developing, and worn permanent and deciduous human teeth", "- Understand the growth and development of dental tissues and their microstructures", "- Apply their knowledge of dental variation to the reconstruction of human experience in past and present populations", "- Engage critically with scientific literature during class discussion and in written work", "Readings", "Introduction", "& Dental Basics", "-", "Dental Anatomy:", "Incisors & Canines", "Incisors & Canines Continued", "-", "Dental Anatomy:", "Premolars & Molars", "Premolars & Molars Continued", "-", "-", "-", "Dental Development", "Wedel & Wescott 2016", "Dental Tissues", "& Modification", "Dental Disease", "Identifying  & Scoring Pathology", "Dental Variation:", "Non-metrics & Defects", "FitzGerald & Saunders 2005", "Tooth Chemistry", "2005", "Dolphin and Goodman 2009", "-", "-", "-", "-", "DUE", "Optional Resources:  model tooth set with removable teeth – see link on LEARN for an example", "Tests will follow a bell-ringer format.", "Students will hand-in a short proposal outlining the potential research question that they would like to pursue as they prepare for completion of their Poster Presentations and Grant Proposals.", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 427, "course_code": "ANTH 489", "course_name": "ANTH489 - Special Topics in Anthropology (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["S. Dagtas", "S. Dagtas", "Instructor: Secil Dagtas", "Email: sdagtas@uwaterloo.ca", "Students will improve their critical thinking, writing, and oral communication skills to engage academic and public debates about Islam.", "SI 312: View requirements for SI 312", "Analysis of a special topic in anthropology, as announced by the department.", "These include religious and cultural rituals, social worlds, and political lives of Muslims in a variety of geographical areas from Asia to North America.", "This means that we are not interested as much in the different juridical interpretations of Islam as a religion, but in the diversity of the ways in which Muslims construct their religious, political, and cultural identities in practice.", "Selected case studies raise issues concerning Islam in modern times such as ritual, language, gender, authority, representation, stereotypes, race, and secularism.", "Identify and analyze different anthropological perspectives on Islam and Muslims", "Improve critical thinking, writing, and oral communication skills to engage academic and public debates about Islam", "Better understand how Islam shapes and is shaped by global communities and forces of modernity", "Studying Islam", "Islam as a Discursive Tradition", "Sites of Prayers", "The Idea of an Anthropology of Islam", "Daily Prayers", "https://balsillieschool.ca/event/book-talk-my-brother-my-land-a-story-from-palestine-sami-hermez-with-sireen-sawalha/#rsvp-now", "Fasting during the month of Ramadan", "Recommended: Anne-Marie Brisbane—The Sacrifice of ‘Id al-kabir", "Almsgiving", "Emanuel Schaeublin—Islam in Face-to-Face Interaction", "Muhammad Arafat—Transculturality and the Hajj: Diasporas as Mediators of Cross-Cultural Encounters", "Divination", "Al-Khidr: A Multifaceted and Ambiguous Figure in the Mediterranean", "Anand Vivek Taneja—Jinnealogy, Chapter 2 Saintly Visions", "Representing Islam", "Visit to UW Anthropology and BSIA by Emrah Yildiz for a book talk", "Abu-Lughod - Do Muslim Women Need Saving?", "Muslims in Europe", "Recommended:  Usman Boron–“And I Believe in Signs”: Soviet Secularity and Islamic Tradition in Kyrgyzstan", "A New Anthropology of Islam John Bowen No 39.95", "They might also include statements of where you are confused or questions about the meaning of core concepts; questions about what the author is trying to communicate.", "At some point during each lecture, expect to be asked to write down your response to a content-related question in relation to the assigned reading for that lecture.", "The question may be in the fill-in-the blank or multiple-choice format and will most likely be a general question the theme or topic of the assigned chapter/article.", "Your overall performance in these exercises will count towards your participation mark.", "They do not need to be longer than a couple of paragraphs and ideally should engage all the readings assigned for that week.", "Even though these online responses won’t count the same as in-class participation, I will consider them while marking your overall participation.", "I recommend that those of you who may not feel as comfortable as others to speak in public make use of this option.", "that are required for them] in their posts!", "Write a short paper on a public controversy about Islam in a context of your own choice.", "They must be carefully written reflections and not first drafts or simple stream of consciousness essays.", "Best papers are those with a clear argument.", "The review is meant to develop your skills of applying the conceptual tools you learned in this class to a more in-depth case-study.", "Please note that you are not required to submit a response paper each week, in fact you need to submit one only for one week.", "Cross-listed courses", "A held-with course will also only count towards program and breadth requirements of the subject code under which it is taken, unless it is cross-listed with the subject code of its’ held-with course.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 441, "course_code": "ECON 100", "course_name": "ECON100 - Principles of Economics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Principles of Economics Winter 2025", "Instructor: Alain-Désiré Nimubona", "E-mail Address: animubona@uwaterloo.ca", "This course provides an introduction to the basic concepts and tools of micro and macro economic analysis of individuals, businesses, and government in the global world.", "View requirements for ECON 100", "Microeconomics is the study of economic behaviour of individual consumers and firms, and the distribution of total production and income among them.", "It involves the determination of prices through the optimizing behaviour of economic agents, with consumers maximizing their wellbeing and firms maximizing their profits.", "Macroeconomics takes a wider view of the economy; it studies the overall performance of an economy including growth in incomes, changes in the overall level of prices and the employment and unemployment rates.", "This course offers an introduction to the basic theories in microeconomics and macroeconomics.", "Understand consumers and producers' decision-making processes", "Analyse consumers’ wellbeing and firms’ performance in different market structures", "Understand the rationale as well as the consequences of government intervention in the market system", "Learn the relationships among major macroeconomic variables in simple models", "Comprehend the main tradeoffs involved in macroeconomic policy making", "Apply economic models to explain real world problems.", "Week 1: Introduction to the Course / The Economic Problem", "Week 2: Demand and Supply", "Monopoly and Imperfect Competition", "Week 9: Economic Welfare, the Environment and Income Distribution", "Students who opt to use earlier versions of the required textbook are responsible to make sure that they read the appropriate chapters.", "Notice of Recording", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "Economics Department Deferred Final Exam Policy", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 442, "course_code": "ECON 211", "course_name": "ECON211 - Introduction to Mathematical Economics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Mathematical Economics Winter 2025", "Email: r22georg@uwaterloo.ca", "An introduction to mathematical techniques of particular use in economics.", "Topics include matrix algebra, differentation, partial derivatives, optimization techniques including constrained optimization - all developed within the context of economic problems.", "View requirements for ECON 211", "use mathematics more proficiently in the context of economic analysis", "1.Sets, Functions and Graphs", "2.Limits and Continuity", "Osbourne 1.4 ‘continuous functions’", "Osbourne 1.5", "Osbourne 1.5-1.6", "Osbourne 2.1-2.5", "Multivariate Calculus topics", "6.Determinant and Definiteness of Matrices", "Osbourne 4.1-4.3", "7.Curvature of Functions of Several Variables", "Osbourne 5.1-5.3", "Optimization", "Constrained Optimization", "Constrained Optimization", "Akihito Asano, An Introduction to Mathematics for Economics Full text download available through course reserves Yes 0", "K. Sydsaeter and P.J. Hammond, Mathematics for Economic Analysis, Prentice-Hall, 1995.", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Economics Department Deferred Final Exam Policy"]}, {"course_id": 443, "course_code": "ECON 221", "course_name": "ECON221 - Statistics for Economists (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Statistics for Economists Winter 2025", "ECON 221", "ECON 221 001", "08:30AM - 09:50AM HH 334", "Email: pchausse@uwaterloo.ca", "Clinic: There is a clinic to help students with ECON 211 and ECON 221 every Tuesday and Wednesday from 3:00PM to 4:30PM in HH 235.", "ECON 221:", "This course introduces students to describing economic data and drawing inferences from features of economic data.", "Starting from fundamental axioms of probability, students will learn about the calculation of probabilities of basic events and the features of random variables, the most important tool for representing the outcomes of complex economic phenomena.", "Students will describe discrete and continuous random variables via their probability distributions and summary statistics such as means and standard deviations, as well as the relationships between two random variables in terms of covariance, correlation, and simple regression models.", "The concepts of hypothesis testing and confidence intervals, and the fundamentals of statistical inference are discussed for basic features of random variables and for comparing the features of more than one random variable.", "View requirements for ECON 221", "evaluate and conduct elementary data analysis", "use probability theory to model uncertain outcomes", "conduct basic statistical inference", "Introduction (First lecture)", "Estimators and Inference on the mean: Chapter 8 of K", "Inference on the variance and the chi-square distribution: Chapter 11 of HID", "Students will submit two files: plain-English data analysis in one text file and the associated computer code used to conduct the analysis in another text file.", "Exercises will be given and reviewed.", "Economics Department Deferred Final Exam Policy", "Applications for Accommodation", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 444, "course_code": "ECON 290", "course_name": "ECON290 - Models of Choice in Competitive Markets (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Models of Choice in Competitive Markets Winter 2025", "ECON 290", "It explains the notion and use of utility functions and budgets, and shows how their interaction allows economists to make predictions about behaviour.", "View requirements for ECON 290", "1 The fundamental model of economic choice", "1.1 Alternatives and budgets", "1.2 Preferences and utility", "2 Consumer theory", "2.2 Demand", "Intertemporal choice", "3.1 Intertemporal utility maximization", "3.2 Application: consumption smoothing and savings", "Producer theory", "4.2 Profit maximization", "4.3 Cost minimization", "I will post an e-book on LEARN and assign you the relevant chapters to read.", "- To record in-class participation, you will be randomly asked to sign a name list without prior notice.", "Students who do not have a relevant medical certificate or other documentation will receive a mark of zero.", "It covers the material after the midterm exam.", "This course includes the independent development and practice of specific skills, such as economic modeling, analysis, and interpretation.", "Library for research-based assignments", "Economics Department Deferred Final Exam Policy", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 446, "course_code": "ECON 322", "course_name": "ECON322 - Econometric Analysis 1 (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["ECON 322", "04:00PM - 05:20PM", "PHY 313", "Email: pchausse@uwaterloo.ca", "This course covers the core topics needed to estimate linear models using ordinary least squares and to interpret estimates for cross-sectional data.", "Students will learn to interpret the coefficients of linear models for continuous and discrete regressors, to conduct reliable inference for different specifications of the error term, and to determine which model is the most suitable among the class of linear models.", "Students will be introduced to a statistical software package and will be required to complete regular computer-based assignments throughout the course using economic data.", "View requirements for ECON 322", "Students will be introduced to a statistical software package and will be required to complete regular computer-based assignments throughout the course that either: (i)  simulate the statistical distribution of the least squares estimator under an assumed model; or (ii) estimate the parameters of an assumed model using a sample of data from the real world.", "Estimate linear models with R", "Interpret the coefficients of a linear regression", "Identify the limitations of regression models", "Introduction: Overview of important concepts in statistics", "Multiple regression models: Issues regarding data and model selection.", "Inference and Large Sample Properties: Tests of single and multiple linear restrictions with and without the normality assumption.", "Functional forms and forecasting: Discussion on how to choose the functional form, and the forecasting of the dependent variable.", "Wooldridge, Jeffrey M., Introductory Econometrics: A Modern Approach Sixth Edition, Cengage Learning 2016 Previous editions can also be used No", "The second textbook is a good reference for using R. The best way to learn a software like R is to practice, and this textbook shows you how to reproduce everything you'll see in the Wooldridge textbook.", "Practice questions are available for each topics and they come from past exams.", "We will explain what we mean by \"well formatted\" in class and tutorial sessions", "Applications for Accommodation", "Economics Department Deferred Final Exam Policy", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as coding and interpreting results.", "Library for research-based assignments"]}, {"course_id": 447, "course_code": "ECON 323", "course_name": "ECON323 - Econometric Analysis 2 (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["ECON 323", "08:30AM - 09:50AM DWE 2527", "This course covers the most important methods used in applied economics research beyond the least-squares estimator.", "It extends the methods covered in ECON322 to the case in which the data are observed over time.", "Students will learn how to estimate and interpret dynamic models and how these models affect our ability to do inference.", "The course also covers methods for data in which the response variable is either qualitative, with or without multiple levels, or count data.", "View requirements for ECON 323", "Recognize cross-sectional, time series and panel data and apply appropriate regression analysis techniques to them.", "State the assumptions underlying econometric techniques and test for violations of those assumptions.", "Apply econometric techniques using appropriate statistical software.", "Policies concerning missed midterms", "You must hand in your own hand-written (except for the computer code and output) copy of the assignment either in person in class or on Crowdmark.", "Electronic Device Policy", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "Applications for Accommodation", "Economics Department Deferred Final Exam Policy", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 448, "course_code": "ECON 361", "course_name": "ECON361 - Cost-Benefit Analysis and Project Evaluation (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Cost-Benefit Analysis and Project Evaluation Fall 2024", "Methods for evaluating private and public projects; decision rules, efficiency conditions, and methods of conducting cost-benefit analysis.", "View requirements for ECON 361", "This course introduces the method of Cost-Benefit Analysis, which is instrumental in providing policy makers with specialized tools and information for determining the economic merits of various projects.", "Relying on basic principles of microeconomics, the course will develop a sound understanding of the main advantages and limitations of the Cost Benefit Analysis method, along with a proficiency in both assessing and conducting such analyses in practice.", "New topics include updated discussions – based on the latest research – on experimental and behavioural evidence associated with non-pecuniary effects of employment, the social discount rate in the context of climate change mitigation and adaptation, cost-effectiveness and cost-utility analysis.", "Understand the basic components of CBA, including: estimation of impacts, monetization, market and non-market valuation methods, estimation and prediction under uncertainty", "“Cost-Benefit Analysis: Concepts and Practice”, 5th Edition, Cambridge University Press, 2018.", "refers to the 5th edition!", "The assigned textbook chapters are indicated for each learning module and are mandatory reading.", "World Bank – Impact Evaluation in Practice, 2nd edition", "Cost-Benefit Analysis in World Bank’s Projects", "Library for research-based assignments", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page."]}, {"course_id": 450, "course_code": "ECON 371", "course_name": "ECON371 - Business Finance 1 (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["ECON 371", "ECON 371 001", "Office hours will be both in person and through MS Teams on a first-come-first-serve basis.", "Email: prajsic@uwaterloo.ca", "“ECON 371” must appear in the subject line and the message must include your full name and student ID number.", "The course develops both the conceptual framework and the tools required for these decisions.", "View requirements for ECON 371", "It describes major players and types of financial instruments in financial markets, and it offers the general framework of financial landscape.", "This course will describe the basics of how firms and individuals make investment decisions and how they finance their investments.", "The goal is to understand financial markets and investment strategies.", "The understanding of the most important financial problems leads to strategic planning and analytical understanding of possible solutions.", "Today’s financial decisions are critical for the successes of the businesses in the future.", "This course will help students develop skills applicable to financial decision-making processes within businesses as well as in their personal lives.", "understand the need for firms and individuals to make financial decisions and together work towards overcoming the universal problem of scarcity;", "appreciate the relevance of finance in a changing world;", "Explain why maximizing market value is the logical financial goal of the corporation", "Calculate and interpret some key measures of firm performance", "Interpret price-earnings ratios", "Calculate present and future values of streams of cash payments", "Define and understand the fundamental features and elements of stocks and bonds", "Use financial models to evaluate stocks and bonds", "Interpret the relationships between financial markets and information", "Perform interest rate conversions from APR to effective rates and vice versa", "Develop loan amortization schedules using loan terms", "Explain what a yield curve is and why short-term interest rates affect its shape", "Identify the cash flows properly attributable to a proposed new project", "Use sensitivity, scenario, and break-even analysis to evaluate the financial impact of forecasting errors", "Introduction to Business Finance:", "Corporate Finance and the Financial Manager", "Corporate Finance and the Financial Manager", "Introduction to Business Finance:", "Financial Statement Analysis", "Introduction to Business Finance:", "Financial Statement Analysis", "The Valuation Principle: The Foundation of Financial decision Making", "The Valuation Principle: The Foundation of Financial decision Making", "Bonds", "Bonds", "Fundamentals of Capital Budgeting", "Fundamentals of Capital Budgeting", "In that case, the quiz will be a mix of questions from all the chapters we covered so far.", "I will set constant weights for each student of 25% for the first midterm and 30% for the second midterm in Learn, but I will be adjusting those weights individually in my Excel sheet when calculating final grades at the end of the semester.", "The purpose of the review quizzes is to help students identify and understand key concepts covered in the lectures and in the textbook.", "Under the Training & Support tab, you will find helpful information including technical support.", "Midterms and Final Exam", "The format for midterms and the final exam will be a mix of multiple-choice questions, numerical calculation questions, and written problems.", "Missing a Midterm Due to Self-Isolation", "Please carefully read the Economics Department policy on deferred final exams for instructions.", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "Economics Department Deferred Final Exam Policy", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 451, "course_code": "ECON 372", "course_name": "ECON372 - Business Finance 2 (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Business Finance 2 Fall 2024", "ECON 372", "10:00AM - 11:20AM DWE 3517", "For your convenience, office hours will be both in person and through MS Teams on a first-come-first-serve basis.", "Email: prajsic@uwaterloo.ca", "“ECON 372” must appear in the subject line and the message must include your full name and student ID number.", "This course examines a number of topics relevant to financial practitioners.", "View requirements for ECON 372", "The purpose of this course is to provide students with advanced topics in corporate finance and their applications.", "The key concepts and topics to be covered include security valuation, risk and return, risk diversification, capital asset pricing model (CAPM), investment performance measurement, financial derivatives, and forecasting.", "Students will learn how to apply these concepts to real world problems using various examples and case studies.", "The course deepens the general framework of financial landscape offered in ECON 371 by discussing the role of financial instruments and institutions in the economy.", "The goal is to develop a deeper understanding of financial markets and investment strategies.", "understand the need for firms and individuals to make financial decisions and together work towards overcoming the universal problem of scarcity;", "appreciate the relevance of finance in a changing world;", "explain why maximizing market value is the logical financial goal of the corporation", "calculate and interpret some key measures of firm performance", "understand and apply the Capital Asset Pricing Model", "describe how options markets can be used to manage risk", "identify different types of debt financing available to a firm", "understand why investment decisions, rather than financing decisions, fundamentally determine the value and cost of capital of the firm", "create pro forma income statements and balance sheets.", "Introduction to Advanced Business Finance:", "Review of Key Concepts in Finance", "Review of Key Concepts in Finance", "Capital Markets and the Pricing of Risk", "Capital Markets and the Pricing of Risk", "Determining the Cost of Capital", "Determining the Cost of Capital", "Risk and the Pricing of Options", "Financial Planning and Forecasting:", "Financial Modeling and Pro Forma Analysis", "The purpose of the review quizzes is to help students identify and understand key concepts covered in the lectures and in the textbook.", "The persuasive essay assignment is supposed to incorporate theoretical aspects of the course that are communicated to a general audience with some basic background and interest in financial issues.", "Under the Training & Support tab, you will find helpful information including technical support.", "Midterms and Final Exam", "The format for midterms and the final exam will be a mix of multiple-choice questions, numerical calculation questions, and written problems.", "Missing a Midterm Due to Self-Isolation", "Please carefully read the Economics Department policy on deferred final exams for instructions.", "Intellectual property includes items such as:", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "Economics Department Deferred Final Exam Policy"]}, {"course_id": 454, "course_code": "ECON 391", "course_name": "ECON391 - Equilibrium in Market Economies (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Equilibrium in Market Economies Winter 2025", "ECON 391", "10:00AM - 11:20AM UTD 105", "Email: k2teeple@uwaterloo.ca", "The properties of such equilibria are explored, both in terms of model logic (existence, uniqueness) as well as in terms of the desirability of the equilibrium outcomes (efficiency, welfare).", "Partial equilibrium (in a single market) as well as general equilibrium (in all markets at once) are covered for models with endowments, production, uncertainty, and time.", "View requirements for ECON 391", "Given prices, consumers maximize utility subject to budget constraints (we call these demand functions) and firms maximize profits (we call these supply functions).", "Articulate what kinds of markets \"work\" (in the sense of Pareto efficiency) and what kinds don't", "There will be a lot of problem solving, as these are theoretical/mathematical models.", "Consumer theory and Pareto efficiency (5.1, 5.3, 5 Appendix, 6.3, 1.9)", "Production in general equilibrium and public goods (32.9, 32.11)", "Applications and Imperfect Competition", "Participation in in-class poll questions (every lecture) 15", "Intellectual property includes items such as:", "Applications for Accommodation", "Economics Department Deferred Final Exam Policy", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 455, "course_code": "ECON 392", "course_name": "ECON392 - Strategic Situations and Welfare Economics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Strategic Situations and Welfare Economics Winter 2025", "ECON 392", "ECON 392 001", "Many economic decisions are made in circumstances where there are no competitive markets.", "It covers how to model such settings as \"games\" in both the extensive and strategic form, and introduces the key equilibrium concepts associated with these models.", "An introduction to considerations in group decision making via co-operative game theory and welfare economics is provided in the last part of the course.", "View requirements for ECON 392", "1.1 Elements of games with perfect information", "1.2 Best response & strategic dominance", "1.3 Nash equilibrium", "1.4 Mixed strategies", "1.5 Applications", "2.2 Sub-game perfect equilibrium", "2.3 Applications", "This course will develop the mathematical foundations of game theory and welfare economics.", "I will post an e-book of Osborne's text on LEARN and assign you the relevant chapters to read.", "- To record in-class participation, you will be randomly asked to sign a name list without prior notice.", "If you only meet the first criterion (signing the list), you can expect a score of 70%.", "Since the class has a moderate size, I can easily track everyone’s participation and progress.", "Students who do not have a relevant medical certificate or other documentation will receive a mark of zero.", "It covers the material after the midterm exam.", "This course includes the independent development and practice of specific skills, such as economic modeling, analysis, and interpretation.", "Library for research-based assignments", "Economics Department Deferred Final Exam Policy", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 456, "course_code": "ECON 412", "course_name": "ECON412 - Topics in Game Theory (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Topics in Game Theory Winter 2025", "04:00PM - 05:20PM", "Email: anqi.li@uwaterloo.ca", "This course provides an in-depth exploration of strategic decision-making with uncertainty and its applications in economics, computer science, and beyond.", "The journey begins with games of incomplete information, introducing solution concepts such as Bayes-Nash equilibrium.", "The course then transitions to mechanism design and market design, emphasizing their mathematical underpinnings and practical applications.", "For multi-agent environments, we explore dominant strategy and Bayesian implementation, applying these concepts to real-world settings like auction design, matching markets, and school choice problems.", "This advanced treatment blends theoretical rigor with practical insights, equipping students with tools to analyze and design strategic interactions in complex settings.", "Design mechanisms that align individual incentives with desired outcomes in single- and multi-agent settings", "Apply theoretical tools to real-world problems like auction design and matching market design", "Weeks 9-12: Multi-agent models: mathematical tools; applications to revenue equivalence, efficient auction design, and revenue-maximizing auction design", "Week 13: Additional topics such as matching markets and school choice problems", "For students interested in further exploration, the following optional readings can be useful:", "For a graduate-level treatment, consider Fudenberg and Levine's ``Game Theory'' (1993, MIT Press)", "It covers core concepts like revenue equivalence, optimal auction design, and applications across various market environments.", "Matching: Alvin E. Roth and Marilda A. Oliveira Sotomayor’s ``Two-Sided Matching: A Study in Game-Theoretic Modeling and Analysis'' (1992, Cambridge University Press) offers an in-depth examination of matching markets, including the stability of matchings, mechanisms like the Gale-Shapley algorithm, and applications to real-world problems such as school choice.", "These texts are optional and intended for students with a strong interest in these specialized topics.", "If you only meet the first criterion (signing the list), you can expect a score of 70%.", "There will be no make-up test.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Economics Department Deferred Final Exam Policy", "Applications for Accommodation", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 458, "course_code": "ECON 456", "course_name": "ECON456 - Topics in Health Economics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["This course explores the theories and models developed to study the health and health-care sectors from an economic viewpoint.", "Identify the different stakeholders in the health care system, their objectives and the constraints they face, using economic models", "Write concise reports that examine a health economics problem and formulate arguments based on economic theory to contribute to the scientific debate in the field", "3 Jan 23-29 Demand & Production of Health Ch 5", "8 Mar 6-12 Health Care Finance & Funding Ch 11  & 12", "Readings", "Intellectual property includes items such as:", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Economics Department Deferred Final Exam Policy", "Policy in case of illness and VIFs"]}, {"course_id": 459, "course_code": "EMLS 129R", "course_name": "EMLS129R - Written Academic English (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Designed specifically for students for whom English is not the first language, this writing skills course provides instruction in grammar, sentence and paragraph structure, elements of composition, and academic essay writing, including a focus on theme, development of central ideas, exposition, and argumentation.", "The course provides instruction in grammatical accuracy, written fluency, and conventional essay patterns.", "This writing course is for students whose first language is not English.", "recognize and write conventional patterns of essay organization such as definition, compare-contrast and argument,", "use appropriate grammar structures to achieve accuracy in writing,", "draft and edit to achieve fluency in writing,", "Library for research-based assignments"]}, {"course_id": 460, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 468, "course_code": "GSJ 271", "course_name": "GSJ271 - Special Topics in Gender and Social Justice (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["EV2 2069", "katie.plaisance@uwaterloo.ca", "INTEG 221 001", "EV2 2069", "katie.plaisance@uwaterloo.ca", "Email: kplaisan@uwaterloo.ca", "Office hours: Tues & Thurs, 4:00-4:45pm", "INTEG 221:", "This course examines social aspects of knowledge, including ways that characteristics of individual knowers and their communities affect the acquisition, interpretation, production, and transfer of knowledge.", "The course features significant input from researchers in the humanities and social sciences in the form of guest lectures.", "View requirements for INTEG 221", "Explain objections to traditional epistemology", "Describe feminist and social epistemology, and some of their key concepts", "Apply the concept of situated knowledge to yourself", "Connect a concept or theory you learned in class to a real-world context", "Practice and refine your communication and critical thinking skills", "Week 1: Introduction & Course Overview (Jan 6-10)", "Read handouts on doing philosophy & reading charitably", "Read Code, “Is the Sex of the Knower Epistemologically Significant?”", "Read Dotson", "Week 9: Epistemic Bubbles & Echo-Chambers (Mar 10-14)", "No reading due – time in class for design charrette", "We will be using Perusall, a free online tool for social reading, for all assigned readings.", "Who am I as a knower? 15%", "Respectful Behavior", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 471, "course_code": "GSJ 402", "course_name": "GSJ402 - Studies in Feminist Philosophy/Philosophy of Sex (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["You will be put in a waiting room when you join the meeting.", "If I am with another student, you may be in the waiting room for a few minutes.", "I usually respond to emails within 48 hours, Monday-Friday.", "Graduate level courses covering specialized topics in the department's fields of research concentration.", "Graduate level courses covering specialized topics in the department's field of research concentration.", "These courses are often held in conjunction with PHIL 674, Graduate Course in Philosophy; the course requirements in PHIL 676 will involve application of philosophical methods and theories to practical problems.", "It sustains us and our communities, and is as a central dimension of solidarity.", "This course provides an introduction to feminist care ethics.", "We will study the foundation of “care” as a distinct ethical approach in philosophy, as well as its political and economic significance.", "Each week I will post a reading guide introducing the week's readings and emphasizing material I think is especially important.", "I like to think about this thread as a mechanism for building a caring class community.", "Be aware that some topics may bring up painful experiences for some members of class (and we cannot always predict what these topics may be).", "Supports", "There is also has an intake form where members of the campus community can disclose harms and/or request support from the Office of Equity, Diversity, Inclusion & Anti-racism (EDI-R).", "Assess the strengths and weaknesses in philosophical arguments about care or in applications of care to practical issues.", "Develop an appreciation about the moral and political importance of care.", "September 24-26 Care and Neoliberalism", "October 29-31 Care and Mothering", "Care and Solidarity", "Trust yourself and challenge yourself to enhance the experience of the class as a whole.", "I have been influenced by many people to challenge colonial structures of assessment.", "These reflections will serve as the basis for class discussions.", "Copy down two quotes that you find to be significant for understanding the reading and provide a brief explanation (i.e., a couple sentences) for why you found these quotes striking/important.", "I will collect and post a given week's questions under the Reading Guides and Discussion Questions module.", "Presence", "An important component of presence will be introducing your 3-2-1 discussion question each week.", "Expand one of your 3-2-1 discussion questions, or develop a thread of discussion that was begun in class discussion.", "Conduct a case study of a particular event using a care theoretical approach.", "You may use a definition of care and a theoretical approach from a particular reading, or draw from several readings.", "The research project presents your unique philosophical stance on a question related to care ethics.", "It should demonstrate your understanding and critical engagement with course content.", "This will be down in two stages, one theoretical and one practical.", "Other ideas might include a discussion between yourself and others exploring a particular question, a podcast episode, a zine or comic book, short fiction, poetry, or a play.", "ORG", "] Does the author have a clear thesis statement?", "] Is the author’s position clear and is the paper clearly written overall?", "Do the claims made in different parts of the paper follow from one another?", "UND] How well does the author understand and make appropriate use of the material relevant to the paper?", "Self-Assessment", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 475, "course_code": "GSJ 472", "course_name": "GSJ472 - Special Topics in Intersectional Feminist Theory (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["I am originally American but lived for 24 years in the UK, where I became a citizen.", "I recently published a book on racist and conspiracist speech.", "Advanced study in special topics that emphasize theory, as announced by the department.", "Graduate level courses covering specialized topics in the department's fields of research concentration.", "Graduate level courses covering specialized topics in the department's field of research concentration.", "These courses are often held in conjunction with PHIL 674, Graduate Course in Philosophy; the course requirements in PHIL 676 will involve application of philosophical methods and theories to practical problems.", "But also bear in mind that many of us don't have much practice discussing these things, and we are all likely to make mistakes.", "Read professional-level work in feminist philosophy of language", "Have fruitful discussions with peers about feminist philosophy of language", "Present their thoughts in oral and written form", "Write a substantial original piece of work in feminist philosophy of language", "You are welcome to choose one as your main focus, to really read closely and wrestle with.", "Romdenh-Romluc, “Hermeneutical Injustice: Blood Sports and the English Defence League” (She/her)", "English-speaking feminist scholars and activists of the 1970s and 1980s were very concerned about the use of masculine terms like 'he' and 'man' as supposedly gender-neutral.", "Topic 3: Speech Acts and Power", "In 1995, Rae Langton published one of the very first papers to connect feminism with philosophy of language.", "Langton's paper was enormously influential, both in showing that one could use philosophy of language for feminist purposes, and in sparking anti-oppressive philosophers' interest in speech act theory.", "The Kitzinger paper below is a linguist's response to the idea that sexual assaults often result from women being insufficiently direct in their refusals.", "The Use of Conversation Analysis in Developing a Feminist Framework on Refusal” (I don't know)", "Perusall is a tool that we'll use together for close reading.", "Draw a connection with something else-- maybe in the same paper, maybe a different one, maybe something not in philosophy.", "Suggest a response to a point the author makes.", "Essay", "Length", "For undergraduates: 2500-4000 words", "For graduate students: 5000-6000 words", "Your essay must discuss a real-life example in light of one or more of the philosophical readings on this course.", "Good independent thought about how the theory/concept applies to the case", "This course includes the independent development and practice of specific skills, such as clear expression of independent thought.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 476, "course_code": "GSJ 473", "course_name": "GSJ473 - Special Topics in Feminist and Social Justice Praxis (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Special Topics in Feminist and Social Justice Praxis Fall 2023", "10:00AM - 11:20AM DWE 1502", "Email: adam.lewis@uwaterloo.ca", "Advanced study in special topics that emphasize practice, as announced by the department.", "This course examines different possibilities for community organizing, exploring the limits and possibilities for each within the Canadian legislative and regulatory environment.", "It seeks to give students both theoretical and practical knowledge that can be applied to a variety of organizing settings and issues.", "It uses case studies, theoretical analysis/reflection and movement literatures to discuss a range of organizing activities, problems and practicalities across an array of movements and issues.", "Each reading brings forth a new set of considerations and/or tools to aid in the expansion understandings of social movement politics and the possibilities for social change in the real world.", "This includes the ethics and values that can be used to analyze and action with regard to a number of issues that are active and ongoing in our world.", "develop a nuanced and critical intersectional understanding of social movements and social movement practices", "identify key issues of social movement concern and make connections to other movements", "analyze social movements and their contributions and impacts", "Sept 6       Introduction to the course", "Another Politics - Introduction and Ch. 1 – Fighting Against Amnesia", "Sept 11 + 13        Framing the Current Context of Social Movements", "Joyful Militancy – Introduction and Ch. 1: Empire, Militancy, Joy", "‘Introduction’ and ‘The Political Logic of The Non-Profit Industrial Complex’ in The revolution will not be funded?", "Another Politics -  Ch 7 Leadership From Below and Ch 8 - Creating Organizations", "24-49", "Tammy Kovich “Anti-Fascism Against Machismo: Gender, Politics, and the Struggle Against Fascism” - https://theanarchistlibrary.org/library/petronella-lee-anti-fascism-against-machismo", "Joyful Militancy by carla bergman and Nick Montgomery via e-reserves Yes", "Among these are:", "Upping the Anti – Toronto-based Radical Social Movement Journal - http://uppingtheanti.org/", "Decolonization Journal - http://decolonization.org", "Socialist Studies: Journal of the Society of Socialist Studies - http://www.socialiststudies.com", "Unsettling America: Decolonization Theory and Practice -", "AK Press – A radical publisher covering many social movement issues – akpress.org", "Fernwood Publishing – Critical Books for Critical Thinkers - https://fernwoodpublishing.ca/", "Talking Radical Radio - http://talkingradical.ca/", "Briarpatch Magazine – independent publication covering a wide range of social movement concerns and issues – www.briarpatchmagazine.com", "Attendance and active engagement with class discussions is a core requirement of this course.", "Special attention should be paid to what the readings add in terms of developing a broader social movement/organizing tool kit, as well as key questions for discussion.", "This is a short intervention designed to further stoke discussion and showcase each students own take on the readings for the given week.", "Select one week of readings for each response paper.", "You should avoid summarizing the reading content and rather strive for a critical discussion of a specific element that has resonated with your or piqued your interest.", "How does this particular reading contribute to our understanding of social change and social action?", "Students must have a section of their paper that directly orients and situates themselves in relation to the topic in a self-reflexive way.", "The paper should be 12-15 pages in length plus a properly formatted reference list in APA in-text format.", "Library for research-based assignments"]}, {"course_id": 480, "course_code": "HLTH 401", "course_name": "HLTH401 - Global Health (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["We are becoming a global community; increasingly, health concerns are international in nature and impact.", "We are becoming a global community; increasingly, health concerns are international in nature and impact.", "Evaluate and critique the role of ‘interventions’, ‘innovations’, and ‘solutions’ within global health", "Thursday September 5th", "Colonization and Global Health", "Governance of community health worker programs in a decentralized health system: a qualitative study in the Philippines.", "Measures to strengthen primary health-care systems in low- and middle-income countries.", "Fragile and Vulnerable Settings", "Quality of care in fragile, conflict-affected and vulnerable settings: taking action.", "Read: Chapter 1: Introduction and Background (pp1-8)", "Vulnerability in the context of migration: A critical overview and a new conceptual model.", "The challenges of the health care providers in refugee settings: a systematic review.", "Promoting Family Well-Being and Resilience of Refugee Newcomers in the Waterloo Region: The Sanctuary Refugee Health Centre.", "Climate Change – Global Warming and Extreme Weather Events", "Climate change and poverty: vulnerability, impacts, and alleviation strategies.", "Non-Communicable Diseases and Food Insecurity", "Antimicrobial Resistance", "Barriers and facilitators of implementing interventions to improve appropriate antibiotic use in low-and middle-income countries: a systematic review based on the Consolidated Framework for Implementation Research.", "Antimicrobial resistance in low-and middle-income countries: current status and future directions.", "Antimicrobial Resistance Case Study", "Factors influencing diagnosis and treatment initiation for multidrug-resistant/rifampicin-resistant tuberculosis in six sub-Saharan African countries: a mixed-methods systematic review.", "High Threat Pathogens and Neglected Vector Borne Diseases", "Ebola case study", "Ebola in the context of conflict affected states and health systems: case studies of Northern Uganda and Sierra Leone.", "HIV Epidemiology and Prevention Approaches", "The global impact of HIV/AIDS.", "Quality of Antenatal care services in eastern Uganda: implications for interventions.", "Introduction of male circumcision for HIV prevention in Uganda: analysis of the policy process.", "From response to transformation: how countries can strengthen national pandemic preparedness and response systems.", "Health system preparedness for emerging infectious diseases: a synthesis of the literature.", "\"Health and TB systems resilience and pandemic preparedness: Insights from a cross-country analysis of data from policymakers in India, Indonesia, and Nigeria.\"", "Careers in Global Health", "Beyond medical “missions” to impact-driven short-term experiences in global health (STEGHs): ethical principles to optimize community benefit and learner experience.", "Global Health Careers: How Can I Make a Difference?", "Q and A Session for Funding Proposal", "Global Health Innovation and Advocacy"]}, {"course_id": 486, "course_code": "LS 221", "course_name": "LS221 - Research Methods (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Research Methods Spring 2023", "Email: adam.mursal@uwaterloo.ca", "An introductory survey of the research techniques commonly employed by sociologists, criminologists, and legal studies researchers.", "The formulation of research designs appropriate to various kinds of intellectual problems in social science is stressed.", "Comprehend fundamental research concepts and methodology (e.g., quantitative and qualitative research methods).", "Readings and Videos", "Introduction + General Research Orientations", "Research Designs", "Quantitative Analysis", "Structured Observation and Content Analysis", "Social Research Methods 6th Edition (Canadian Edition): 2022 Authors: Edward Bell; Alan Bryman; Steven Kleinknecht Yes", "*An older Canadian edition of the textbook can be used, however, students are responsible for ensuring the appropriateness of course context and matching the related chapters to assigned weekly readings.", "Assignment prompts: Must be 700-800 words in length, and are responses to a specific question provided as part of the lecture series.", "Prompt 1 Question: What are factors that may influence what a person decides to research in the social sciences?", "What are factors that might influence what you will propose to research in this course?", "In your response, please provide a clear argument and discussion either for or against the use of covert research methods in the social sciences.", "Students will create a study on a sociological/legal topic of their choosing that is both viable and realistic given the course context.", "Cross-listed courses", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website"]}, {"course_id": 487, "course_code": "LS 229", "course_name": "LS229 - Selected Topics in Criminology (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Selected Topics in Criminology Spring 2024", "F. Desroches", "Instructor: Fred Desroches", "Email and Posting Etiquette", "Please be considerate and polite in your postings and emails to the instructor.", "The vast majority of students are considerate in their communications but there are always a few who are impatient and impolite.", "Motivation, modus operandi, and the social characteristics of offenders will be examined in relation to such specific crimes as drug and sexual offenses, theft, robbery, murder, organized crime, and/or other criminal activities.", "A sociological analysis of research and theory on selected criminal activities.", "The course examines the motivation, modus operandi, and social characteristics of offences and offenders in relation to such crimes as robbery, prison riots, murder and hostage taking in prison, impersonal sex in public places, drug trafficking, and organized crime.", "Robbery and bank robbery,", "define and explain the nature of inmate “undesirables”,", "explain the reluctance of most inmates to participate in prison riots,", "critically discuss why prison guards are seldom injured in prison riots, and", "describe and explain the various patterns in prison riots,", "explain why guards are protected and seldom injured in prison riots,", "explain why inmates despise sex offenders/child molesters,", "compare and contrast the treatment of guards versus undesirables,", "critically analyze the powder keg theory of prison riots,", "describe the sample and research methodology used in Force and Fear,", "discuss variables that relate to a victim's decision to report a robbery offence,", "explain why robbery offenders agreed to be interviewed for this study.", "critically discuss laws related to robbery,", "explain why robbery is viewed as a serious offence, and", "differentiate between the three types of robberies,", "discuss the characteristics of robbery,", "discuss and explain characteristics of robbery offenders,", "discuss the causal effects of drug usage, gambling, and socioeconomic status,", "differentiate between initial motivation and the motivation to continue,", "explain and critically discuss the various motivational components in robbery,", "critically analyze the role of the media in the motivation to robbery,", "discuss the lifestyle and spending habits of robbery offenders, and", "describe and analyze the three types of bank robbery based on M.O.,", "explain key choices that bank robbers make related to weapons, getaway, and partners, and", "explain the location of tearooms and how they are discovered, and", "discuss and analyze the rules of the game and the function these rules serve,", "explain the various roles of the participants in tearoom sexual encounters,", "critically analyze the insertee and insertor roles and the aging crisis,", "outline how tearoom participants communicate through non-verbal gestures,", "explain how these gestures work and their function in protecting participants, and", "outline the characteristics of \"trade\" and \"closet queens,\"", "analyze these types in relation to the insertee/insertor roles.", "compare Humphreys' and Desroches' findings dealing with the breastplate of righteousness,", "critique Humphreys' protection hypothesis,", "explain and analyze the reaction formation hypothesis,", "explain and analyze the self-validation hypothesis, and", "compare and contrast the two research methodologies discussed,", "compare participants in both studies in relation to age and occupational status,", "compare participants in both studies in relation to marital status, and", "explain why bisexuals and closet queens frequent tearooms,", "explain why relatively few gay men participate in tearoom sex,", "explain the nature of drug trafficking and supply chains,", "critically discuss the effect of drug prohibitions,", "compare and contrast retail versus higher-level drug trafficking,", "explain how economic models can shed light on organized crime and drug trafficking,", "compare and contrast legitimate business versus illegitimate business,", "compare and contrast “businessman” versus “criminal” drug traffickers,", "critically analyze and explain the morality and egos of higher level dealers,", "discuss the lifestyle and spending of higher level dealers,", "critically discuss the reasons why dealers fail to get out of crime.", "critically analyze the various techniques dealers use for security purposes.", "define fronts and why drug traffickers use them,", "discuss risks and other problems related to drug debts,", "critically explain the use and non-use of violence in relation to drug debts and biker gangs, and", "Module 09: Modus Operandi and Robbery", "Module 12: A Typology of Tearoom Participants", "TRAFFICKING AND", "Module 19: Modus Operandi – Marketing and Security", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 488, "course_code": "LS 280", "course_name": "LS280 - Social Statistics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Statistics for Arts Students Fall 2024", "Email: ogallupe@uwaterloo.ca", "Division of email duties", "A-Bh Dhanju", "Bo-Ki Eatock", "Ko-Ry Karimi", "Sa-Z Legault-Leclaire", "Email: jdhanju@uwaterloo.ca", "Email: keatock@uwaterloo.ca", "TA: Nima Karimi", "Email: n4karimi@uwaterloo.ca", "Email: j4legaul@uwaterloo.ca", "Covers a range of statistical techniques including t-tests, one-way ANOVA, Chi square, and bivariate correlation/regression.", "A basic course in statistics used in social science research including sampling, central tendency, probability, and covariance, as illustrated in specifically sociological and criminological data.", "Students will be expected to learn how to recognise and match the correct test to a given research question.", "Assumptions of statistical tests and correct interpretation will be stressed in this course.", "The course will start with a basic overview of important statistical concepts and progress through descriptive and bivariate statistics and end with multivariate analysis.", "Students should do the readings in advance of each lecture.", "Continuity of Education Plan", "6 Statistical models 38-48", "10 Comparing two means 326-356", "11 Nov 18– 22 14 Linear regression 276-323 (just give a quick skim of 315-319)", "https://uwaterloo.atlassian.net/wiki/spaces/ACOHD/pages/819858617/Remote+access+to+software  Alternatively, if you want a copy of SPSS on your own computer, you can get a six month rental for $69.58 (IBM SPSS Statistics Standard GradPack 29).", "Students can choose to submit via email if they do not want their work scanned by Turnitin, but they must notify the instructor by the end of the first week of the term if they are choosing this option.", "Intellectual property includes items such as:", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "This course includes the independent development and practice of specific skills, such as statistical analyses.", "Library for research-based assignments"]}, {"course_id": 489, "course_code": "LS 283", "course_name": "LS283 - Business Law (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["07:00PM - 09:50PM", "Students can contact the course instructor via email at rhussein@uwaterloo.ca.", "Particular attention is given to the law relating to contracts and business organizations.", "AFM 231: View requirements for AFM 231", "While the course introduces you to basic concepts in law, it is designed for, and particularly emphasizes topics that will be of specific relevance to you as future business managers, owners, or even practicing professionals.", "This includes understanding the basics of legal risk so you can make more effective business decisions.", "Business managers/owners often must engage in risk management exercises.", "Appreciate the complexity of integrating multiple private law concepts into the analysis of a business situation.", "Utilize a basic framework for legal risk management assessments and generate an inventory of possible legal risk management tools.", "Describe the common as well as contrasting relationship between legal compliance and ethical conduct.", "March 24-28", "Wrap-up", "Accordingly, if students do opt to use an older edition it would be advisable to use an edition that is as close to the 8th edition as possible and consider cross-referencing it to the current edition and noting any differences.", "Completion", "The response demonstrates a clear understanding of the relevant course concepts and effectively applies these concepts to the hypothetical scenario.", "Application to Real-World Example", "The response includes an appropriate real-world example that relates to the course material, illustrating how the concept can be applied outside the context of the hypothetical.", "Students may also include a revised answer based on a similar but different set of hypothetical facts.", "For example, a student may propose one solution based on the given facts but suggest a different solution if the facts were altered.", "Students are expected to demonstrate critical thinking and clearly articulate their reasoning.", "Each quiz covers content that relates to the current course content (the current chapters and occasionally a prior chapter as well if it has not yet been part of a quiz).", "Submission Times", "Reevaluation Request", "Requests for re-evaluation of submitted material can be done via email.", "Also, students should detail what their concern as specifically as possible.", "Artificial Intelligence Tools", "Also, some evaluation elements are structured such that it may be even quicker to do it yourself than to utilize an AI tool and then further edit/revise before submission.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 490, "course_code": "LS 322", "course_name": "LS322 - Field Research Methods (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Field Research Methods Winter 2024", "08:30AM - 09:50AM AL 105", "Email: kkpadda@uwaterloo.ca", "** Please note that I won't be answering any questions regarding course material (for example - definitions of concepts, differences between theoretical perspectives, etc.) over email.", "I believe that these types of questions are best discussed in person.", "Office Hours: By appointment & via Zoom", "This course provides a critical evaluation of research techniques in sociology, criminology, and legal studies with an emphasis on learning and applying qualitative fieldwork approaches.", "Antireq: SDS 351R", "Explain the nature and purpose of qualitative research in the field of Sociology and Criminology", "Formulate research questions and draw connections to theoretical constructs that emerge from the data.", "Recognize and critically evaluate ethical issues and considerations in qualitative interdisciplinary research and the implications of ethical decisions on participants, researchers, and communities.", "Demonstrate understanding of theoretical, practical, and critical aspects of qualitative research.", "By experimenting with different qualitative research methods, you'll develop an invaluable toolkit of knowledge and experiences that will be useful in the future - whether you're heading to graduate school, working in research settings, or designing projects in the workplace.", "Readings", "Introduction to the course", "Introduction to Qualitative Research Methods + Asking Questions and Identifying Goals", "Chapter 1: Introduction", "Strategies for Designing Research", "Chapter 3: Strategies for Designing Research", "Ethical Issues in Research", "23-Jan", "Ensuring Quality in Qualitative Research", "Sample sizes for saturation in qualitative research: A systematic review of empirical tests.", "On science and the logic of case selection in field-based research.", "Interview partners + contracts", "Indigenous and Decolonizing Research Methodologies I", "Social Identity Map: A Reflexivity Tool for Practicing Explicit Positionality in Critical Qualitative Research.", "Field Methods 34(2): 181–88. 1525822X221093824.", "Interview I", "Chapter 6: In-Depth Interviewing", "Interview III", "Interpreting Qualitative Data I", "A Pragmatic Introduction to Doing GT Research.", "Sociological Methods & Research.", "Interpreting Qualitative Data II", "NVivo Analysis + mid-semester check-in", "Interpreting Qualitative Data III", "Visualizing qualitative data in evaluation research.", "On-line serial], 2(3).https://doi.org/10.46743/2160-3715/1995.2061", "Unobtrusive Methods/ Digital Ethnography I", "Digital Ethnography II", "Ethnography and Observation I", "A Decolonizing Method of Inquiry: using institutional ethnography to facilitate community-based research and knowledge translation.", "doi:10.1177/1466138113513526", "Ethnography and Observation II", "No Magic!", "Ethnoscripts 23: 92–115.", "Ethnography and Observation III", "Ethnography and Observation IV", "Unlock the power of qualitative research and potential challenges", "*Qualitative Research Findings leading Machine Learning and other big-data research", "Drop-in office hours", "Drop-in office hours", "----", "Students will complete the Tri-Council Policy Statement CORE-2022 course, which provides them with an institutionally recognized certificate of completion.", "You will be conducting a preliminary analysis, including identifying themes and making connections to your existing disciplinary knowledge.", "The research question should be something that can be observed, and you need to take detailed descriptive and analytic notes during the observation.", "You will be formulating a research question that can be explored through online non-participant observation.", "You will be revisiting your initial proposal submission and will be incorporating the feedback you received and the knowledge you have gained since the original submission.", "As a final component of the course, you will be asked to submit a comprehensive reflection, which is open-ended and allows you to discuss your learning, challenges faced during the course, future goals, skills developed, and how you can communicate these skills to different audiences, be it academic or non-academic.", "This course includes the independent development and practice of specific skills, such as critical thinking; synthesizing and analyzing information; developing and practicing writing skills.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 492, "course_code": "LS 403", "course_name": "LS403 - Crime and Public Policy (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["02:30PM - 05:20PM", "Email: masadek@uwaterloo.ca", "Email: eejones@uwaterloo.ca", "Public policy responses to crime includes patterns in police decision making about what constitutes a crime, expert and lay theories on the causes of crime, political pronouncements on what to do about criminal offenders, and beliefs about the purposes of incarceration, amongst other formal and informal facets of the criminal justice system.", "Focusing on the experience of marginalized groups such as youth, women, and racialized persons, this course will help students develop a critical understanding of the ways in which public policy responses to crime can reproduce wider patterns of discrimination in society, especially those pertaining to race and Indigeneity.", "Formal social control operates at the macro level in the form of laws and criminal justice policy.", "To this end, aspects of the nexus between law and society are examined to explore the efficacy of the criminal justice system to respond to complex social problems, marginalized populations, and dangerous offenders.", "b. Develop an awareness of the policy-making process and the dynamic interplay with the criminal justice system.", "Understand the role of the criminal justice system when addressing complex social problems.", "Enhance communication skills and practice tailoring information for diverse audiences.", "1 Jan. 6 Introduction and syllabus", "Snapshot of crime in Canada", "Perspectives", "Judicial decision-making", "*Debate assignment #1 due Sunday at 11:59 pm*", "· Roberts & Reid  (2017)", "· Sprott & Manson (2017)", "Dangerous Offenders", "· Mussell & Orisini (2021)", "Problem-solving courts", "***TERM PAPER DUE***", "Dangerous kids: A case illustrating critical issues with applying a dangerous offender designation to youth.", "The limits of the sovereign state: Strategies of crime control in contemporary society.", "Trends in the imprisonment of women in Canada.", "“Gender symmetry” in domestic violence: A substantive and methodological research review.", "Drug treatment courts—A viable option for Canada?", "To serve and protect whom?", "Police decision-making in the grey zone: The dynamics of police-citizen encounters with mentally ill persons.", "Post-Antic trends in bail outcomes.", "I will post the specific topics and further instructions in the folders under the content section on LEARN.", "The test is closed book and will consist of a combination of short and long answers.", "You should be taking a clear position in the term paper and using the empirical evidence you find in your research to support your position.", "Make-up and Late Policy", "This course includes the independent development and practice of specific skills, such as policy analysis and critical thinking.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 495, "course_code": "LS 413", "course_name": "LS413 - Surveillance and Society (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Surveillance and Society Fall 2024", "SEM", "I am an Associate Professor in the Department of Sociology & Legal Studies and at the Stratford School of Interaction Design and Business.", "I am in the second year of my master’s program in Sociology and Legal Studies.", "Questions of a personal nature", "Reviews of draft writing before submission", "Every student is encouraged to introduce themselves to me before October 29 by attending a drop-in session and saying hello, or booking a one-on-one appointment.", "An examination of the way monitoring technologies alter and shape social life in terms of security, fear, control, and vulnerability.", "Some of the topics covered in the course include differential access and exclusion mechanisms enabled by online surveillance, predictive marketing using big data algorithms, racialized classification schemes and a host of monitoring technologies in online spaces, workplaces, and the home.", "Readings will be drawn from the social sciences and popular media to facilitate critical inquiry into the shaping of popular perceptions about the surveillance and social control.", "Communicate, describe, and debate topics related to how surveillance operates in social contexts, particularly how it comes to influence everyday life.", "Analyse both academic and popular writing and reporting on surveillance and privacy, and synthesize core themes in written reflective summaries.", "Week 1 Module 0: Introduction to the Course", "All readings and media and links to discussion forums are posted in these content modules.", "Late Policies and Extension Requests", "VIF self-declarations cannot be “stacked” to extend beyond these 5 days.", "You do NOT need to make a formal extension request.", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "Notice of Recording", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Do you want professors and interviewers to call you by a different first name?", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Plagiarism & Copyright Policy", "In this case, the authors decide how you can use their content.", "This course includes the independent development and practice of specific skills, such as critical reading skills, assessing the structure and quality of written arguments, making connections between different authors, and participating in unscripted seminar discussions and debates online.", "Library for research-based assignments", "Intellectual property includes items such as:"]}, {"course_id": 498, "course_code": "LS 423", "course_name": "LS423 - Peers and Crime (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Peers and Crime Fall 2024", "SEM", "Email: ogallupe@uwaterloo.ca", "Time slots can be selected at this link.", "Email: jdhanju@uwaterloo.ca", "Continuity of Education Plan", "The main theoretical perspectives (including criticisms) and measurement approaches will be examined and applied to a number of specific areas.", "The last half of the course will be devoted to a major group work assignment revolving around applying the theoretical knowledge gained in the first half of the course to design an intervention.", "Social learning and social structure: A general theory of crime and deviance.", "Response post: Sunday Sept 15", "Control theories and cultural deviance theories.", "Response post: Sunday Sept 22", "Response post: Sunday Sept 29", "Peers and offender decision-making.", "-short policy essay related to Boman & Mowen.", "Discussion Contributions", "*", "When a discussion period ends it is locked and posts are readable but can’t be changed or added to.", "Furthermore, ‘cluster posting’ (doing a number of posts in a short period of time) is not a good idea if it’s the only way you are participating.", "It provides very useful guidance for online discussions.", "A grade for each week (weeks 1 through 6) will be given as a percentage.", "Posting is more than simple factual information straight from the readings but level of analysis and degree of interaction does not quite reach the level of marks that fall in the 80%+ range.", "Example of a strong original post (via a ridiculous example):", "The fact that it shows Gillette to play a disinhibiting role in generating minor property crimes validates the earlier Deodorant Theory of Crime (DTC - Pippen, 2002).", "Example of a strong response:", "This is a theory course and I expect you to engage with the theory in your posts.", "Many students in the past have brought in their personal experiences to the discussions.", "There is no expectation that these will last more than a couple of minutes but can last substantially longer as needed.", "Descriptive outline", "Since the other members of your group are in the best position to evaluate your contributions, the average of their evaluations of your performance will constitute your grade.", "Intellectual property includes items such as:", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "This course includes the independent development and practice of specific skills, such as writing research papers.", "Library for research-based assignments"]}, {"course_id": 499, "course_code": "LS 425", "course_name": "LS425 - Crossing Borders: Law and Global Deviance (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Email: vferreri@uwaterloo.ca", "This seminar covers anthropological perspectives on the relationship between state borders and socio-cultural boundaries (across race, gender, class, language, and religion).", "Anthropology has always been a discipline crossing different types of borders and boundaries in its quest to study and understand other cultures, modes of being, and forms of knowledge.", "Through this lens, the course examines the role of social and cultural boundaries and state borders in relation to the law and legal (and political) regimes to reflect on the mechanism of inclusion and exclusion, and the production of taxonomies characterising border-crossers and borderland communities.", "The course begins with retracing the rise of an anthropology of borders and its relationship to classical conceptualizations of boundaries in early anthropological work.", "We will examine how war, displacement, settler colonialism and late capitalism shape borderlands, border-dwellers and crossers to unpack key concepts in the studies of borders such as affect, sovereignty, humanitarianism, hospitality, waiting and migration regimes.", "By reading ethnographies of border-crossers, we will interrogate the relationship between (il-)legality and the social world of border-crossers and dwellers in which life and death become engrained in mundane objects, documents, bureaucracy, different forms of violence and solidarity.", "Through these different themes, the course is also an exploration of the ethics and politics of doing ethnographic research, writing and representing such zones of contact and separation and the people inhabiting them.", "Identify and understand key anthropological debates about borders and boundaries and their relationship to law and legal regimes", "Demonstrate an understanding of how anthropology can contribute methodologically and theoretically to the interdisciplinary field of border and migration studies", "Develop ethnograpically-oriented reading, research, and thinking skills on the topic of borders and boundaries", "Critically engage with global news media on matters of migration, refugees, and border politics", "Better understand the ethical connections between our own lives and those of others separated through communal, temporal, symbolic, territorial, and racial boundaries.", "Each week, we will examine an aspect or a multiplicity of aspects tied to borders and boundaries.", "Introduction to the syllabus and course's learning outcomes.", "Introduction to \"Reading and Writing in Social Anthropology\".", "From Boundaries to Borders", "Chapters: Introduction and Chapters 2 and 3.", "Fassin, D. \"Policing Borders, Producing Boundaries: The Governmentality of Immigration in Dark Times\"", "Borders and Legal-Political Regimes", "Simpson, A. Mohawk Interruptus: Political Life Across the Borders of Settler States.", "Ben-Yehoyada, N. \"Follow me, and I will make you fishers of men’: the moral and political scales of migration in the central Mediterranean\"", "(Il-)legal Economies of Human Circulation across Borders", "Andersson, R. \"Time and the Migrant Other: European Border Controls and the Temporal Economics of Illegality\"", "- No Class! -", "Borders in War and Postwar Times", "Ticktin, M. \"Thinking Beyond Humanitarian Borders\"", "Framing the Border of Settler Colonial States", "\"Between Imaginary Lines\"", "Invisible Borders, Home and Exile", "Violence and Border-Crossing", "Introduction and Chapters 1, 2 and 3.", "Ramifications of Crossing and Researching the Border", "Borders and Political Imagination", "A Story of Political Imagination”", "Framing Borders: Principle and Practicality in the Akwesasne Mohawk Territory.", "Time and the Migrant Other: European Border Controls and the Temporal Economics of Illegality.", "2015 \"'Follow me, and I will make you fishers of men': the Moral and Political Scales of Migration in the Central Mediterranean\".", "Policing Borders, Producing Boundaries: The Governmentality of Immigration in Dark Times.", "The Invisible Hard Work of Retrieving Papers: Syrians and the Paradoxes of Integration in Germany.", "“Frontiers of Exodus: Activists, Border Regimes and Euro-Mediterranean Encounters After the Arab Spring” in EuroAfrican Borders and Migration Management: Political Cultures, Contested Spaces and Ordinary Lives.", "2012 “A Sense of Border: the Story so Far” in A Companion to Border Studies.", "Shifting to Geo- and Body-Politics of Knowledge” in European Journal of Social Theory 9(2): 205-221.", "In American Ethnologist 46(4).", "196-217 No", "Mohawk Interruptus: Political Life Across The Borders of Settler States.", "Evaluation of participation will be based on the frequency as well as the quality of what you contribute.", "They might also include statements of where you are confused or questions about the meaning of core concepts; questions about what the author is trying to communicate.", "This is to ensure that all students benefit from the thoughts of others and the instructor can assess whether students have done the readings even if they choose to be quiet during discussions for different reasons.", "They do not need to be longer than a short paragraph and can be as short as a few sentences, or a couple of thoughtful questions (so long as these sentences or the question demonstrate a clear and specific engagement with the reading and make an original point).", "I will try to go over at least some of these questions in class time, but feel free to respond to others’ comments online.", "Even though these online replies to the threads won’t count the same as in-class participation, I will consider them while marking your overall participation.", "I recommend that those of you who may not feel as comfortable as others to speak in public make use of this option.", "If you choose to do so, you are also allowed to submit 5 response papers in which case I will count the four highest towards your final grade.", "But if you see a conceptual connection between a movie or other material we’ve seen and discussed in earlier weeks and the readings you are assigned for the week of your response paper, feel free to include that connection in your analysis.", "In the case of a group collaboration, students can coordinate with each other to individually present one or two key themes and present one question each for the class.", "You should also organize your presentation in a manner to stimulate conversation and discussion.", "What questions arise from these confusions for the rest of the class?", "The final paper can be in the form of:", "a research paper on a specific case or theme related to the topic of borders and/or boundaries that you chose with my permission during the term.", "a conceptual analysis of a specific case or theme related to the topic of borders and/or boundaries that you chose with my permission during the term.", "They must be carefully written reflections and not first drafts or simple stream of consciousness essays.", "Best papers are those with a clear argument.", "If you have a reason to not meet the official deacline, please ask for extension before the assignment is due; I will only entertain post-dated requests if there was a some pressing reason why you could not ask prior, such as some personal or medical emergency.", "Electronic Device Policy", "This course includes the independent development and practice of specific skills, such as critical thinking and engagement with texts and other types of materials.", "Library for research-based assignments"]}, {"course_id": 514, "course_code": "PACS 301", "course_name": "PACS301 - Special Topics in Peace and Conflict Studies 1 (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Associate Professor of Peace and Conflict Studies", "Territorial Acknowledgement: As we will discuss in this course, the Western criminal legal system and its institutions and mechanisms of incarceration, control and confinement are rooted in settler colonialism and chattel slavery as well as white supremacist values and ethics.", "It is critical for us to grapple with the persistence of settler colonialism and the afterlives of slavery.", "we must understand the imperative nature of", "We must face the fact that much of our current system", "for responding to deadly local and international conflict", "is incapable of overcoming cycles of violent patterns", "precisely because our imagination has been corralled and shackled", "by the very parameters and sources that create and perpetuate violence.\"", "- John Paul Lederach, Anabaptist peace scholar in", "How have religion and religious values contributed to policing and incarceration in Canada and the U.S., and their especially deadly impacts on Black and Indigenous lives?", "How can anti-racist, decolonial and feminist approaches to moral imagination enable the potential abolition of policing and prisons, and the creation of a new society in which safety is not premised on violence?", "Students actively engaged in reading and class will benefit most from this course.", "Explain the role of religious, settler colonial and white supremacist imaginations in the creation and expansion of policing and prisons in Canada and the U.S.", "Describe how and why* activists, scholars, and social movements envision the abolition of carceral systems and institutions as critical to peace and justice.", "Assess moral values, principles and practices shared by abolitionist movements in relation to their potential to generate safety, healing and accountability.", "We will give greater attention to the substance of abolitionist dreaming and the moral compass that guides these visions.", "Religion, Justice, and the Abolition of Prisons /Joshua Dubler and Vincent Lloyd.", "Imagined Futures Project 25%", "C: Critique of ideas in the text(s): What do you want to affirm as well as challenge?", "In addition to offering focused contributions, demonstrate reflective listening and be mindful of nonverbal communication.", "Per the analysis of Joshua Dubler and Vincent Lloyd among other activist-scholars, incarceration is not only positioned as a political and economic solution to societal challenges but also a moral and ethical solution.", "Depict a future in which carceral systems and institutions no longer exist and there are solutions and strategies guided by emancipatory morals and values that address societal challenges of direct and structural violence.", "Your project should clearly depict the solution(s) including specific strategies and practices and the values that they reflect.", "The non-carceral future you depict must also be directly informed by solutions, strategies, practices and values within contemporary abolitionist movements, particularly those rooted in Black radical feminisms.", "Annotations should be 75 - 150 words each.", "However, some formats such as speculative fiction are better suited for novices than those that require advanced technical skills.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "This course includes the independent development and practice of specific skills, such as critical reading and analysis, synthesis, and visualization.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Intellectual property includes items such as:"]}, {"course_id": 515, "course_code": "PACS 302", "course_name": "PACS302 - Special Topics in Peace and Conflict Studies 2 (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "09:00AM - 10:50AM CGR 1300", "Email: judith.koeller@uwaterloo.ca", "Note: a motivated first year student can take and succeed in this course.", "Math For Good and Evil is built on the conviction that the kinds of problems mathematicians and computer scientists seek to address, and the ways they address them, should matter for anyone interested in advancing peace in the world.", "The peace implications of math and computer science are explored in connection to topics such as wealth, democracy, policing, oppression, environment, and health.", "Math and computer science are tools of enormous and increasing power that impact our daily lives in thousands of ways that we seldom recognize.", "Many of the ways that these disciplines have affected us are very beneficial and have transformed the lives of millions of people for the better.", "Without peace studies understanding how math can be appropriately harnessed for good, peace theory will be inadequate to prepare students for the twenty-first century.", "Assigned readings and videos", "Videos and on-line discussions by course instructor and some guest presenters", "Articulate the potential of collaborations between peace studies and mathematics to benefit society.", "Describe how math and computer science can be leveraged to better serve the interests of society.", "Evaluate the peace implications of specific mathematical work.", "Course Introduction", "Democracy and Politics", "March 24", "By the last class, write a first draft of your Media Report (see detailed instructions).", "Explore its stakeholders and peace implications.", "Your contribution to Perusall must be sufficiently different from other contributions by your peers, and your ideas must be clear and well-supported.", "Notice of Recording", "Please consider how taking this course and having its materials on your computer might impact your safety.", "Formatting guidelines", "Accommodation for Illness", "Important announcements such as the cancellation of class will also be posted there, so please check the site before each class, just in case.", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website"]}, {"course_id": 524, "course_code": "PHIL 216", "course_name": "PHIL216 - Probability and Decision Making (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Probability and Decision Making Winter 2024", "04:00PM - 05:20PM", "This course covers a set of related topics in probability, inductive reasoning, game theory, and decision theory which are of both theoretical and practical interest, having application to the philosophy of science, epistemology, political philosophy, ethics, political science, and economics.", "discuss the strengths and limitations of the standard economic view of rationality.", "apply concepts and techniques to games with sequential or simultaneous moves, and discrete or mixed strategies.", "devise strategies to gather and assess the relevance and quality of information for making rational decisions.", "1 Jan 9, Jan 11 Introduction", "2 Jan 16, Jan 18 Barriers to Decision-making", "Exam Period", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page."]}, {"course_id": 525, "course_code": "PHIL 240", "course_name": "PHIL240 - Introduction to Formal Logic (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Formal Logic Winter 2025", "This everyday use of the word takes being illogical to be the same thing as engaging in bad thinking.", "Innovations and discoveries in formal logic lie at the heart of important developments in many disciplines, including cognitive science and artificial intelligence, theoretical computer science, linguistics, the foundations of mathematics, and others.", "Moreover, it is virtually impossible to read and understand large parts of the philosophical literature of the past 100 years without a good grasp of at least the basics of formal logic; this is most obvious in philosophy of science, philosophy of language, and epistemology, but is also true in areas like metaphysics, including meta-ethics and aesthetics.", "You can regard it as a tool that helps you do a better job evaluating the reasoning of others and for improving your own.", "What idealizations are we making in supposing them to apply?", "If we produce a justification for belief in the correctness of the system, how do we know that the reasoning we use in our justification is correct if the inferences in the justification are part of the system?", "We shall also devote some attention to such theoretical and philosophical issues along the way.", "We will begin with a short introduction to the basic concepts of logic, such as consistency, validity, and logical truth.", "If an ideal logical system would capture all (and only) the correct patterns of inference, each of these systems can be regarded as an approximation to this ideal which captures some but not all valid patterns of inference.", "For each system we will study: the relationship between the language of the system and ordinary languages like English; the relationship between validity in the system and logical validity; and various methods for showing validity (such as proof procedures) and invalidity (including semantic methods for producing counter-examples) of patterns of inference.", "We will conclude with a brief introduction to some of the metalogical concepts, such as soundness and completeness, that are the core of many more advanced studies in logic.", "translate sentences of English into symbolic logic;", "explain the core concepts of logic;", "articulate the relationships between core logical concepts and their formal counterparts in both sentential logic and predicate logic;", "identify key simplifying assumptions of sentential logic and predicate logic;", "explain the philosophical significance of the key simplifying assumptions of sentential and predicate logic;", "describe various desirable metalogical properties a system of logic might have, and their relationship to the strength of the system; and", "- Electronic Version", "A reliable internet connection and regular checking of the course site (at least twice a week) is therefore mandatory.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 526, "course_code": "PHIL 252", "course_name": "PHIL252 - Quantum Mechanics for Everyone (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Quantum Mechanics for Everyone Fall 2024", "This course offers an introduction to the basic concepts of quantum mechanics from a historical and philosophical perspective.", "SCI 252: View requirements for SCI 252", "Explain how quantum physics differs from classical physics", "Identify and summarize scientific results described in advanced popular science accounts presented in a variety of media (e.g., print, videos)", "Formulate appropriate critical questions in response to philosophical and historical texts and multimedia materials", "A current version of the Schedule of Topics and Readings is available on LEARN.", "This course includes the independent development and practice of specific skills, such as formulating and evaluating arguments.", "Library for research-based assignments", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Cross-listed courses"]}, {"course_id": 527, "course_code": "PHIL 271", "course_name": "PHIL271 - Special Topics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Scientists have conducted research on these questions!", "Through reading and discussing philosophical, scientific, and policy work, as well as engaging popular media, students will develop their understanding of research ethics, scientific practice, and the interactions between science and social values while learning about the relationships between humans and our canine companions.", "Skills", "Appreciate the biology of canine behavior and learning.", "Recognize the role of values in scientific research.", "Attitudes", "Demonstrate intellectual rigor when assessing values and scientific knowledge.", "Demonstrate compassion for both dogs and people.", "Module 1: Introduction", "Module 3: Values in science / canine olfaction and consciousness", "Students do not have additional costs for course readings and materials because the University Library bears the costs of providing these materials.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "This course includes the independent development and practice of specific skills, including critical thinking, and developing and expressing ethical and analytic judgments.", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 531, "course_code": "PHIL 358", "course_name": "PHIL358 - Topics in Philosophy of Science (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Scientific Realism & Anti-Realism Winter 2024", "Describe and evaluate a range of positions in the scientific realism--anti-realism debate", "Use effective research strategies to select a topic for a philosophy paper", "A current version of the Schedule of Topics and Readings is available on LEARN.", "These readings can be accessed through the LEARN course web site.", "Copies of these readings must be brought to class.", "Short Papers", "This course includes the independent development and practice of specific skills, such as formulating and evaluating arguments.", "Library for research-based assignments", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:"]}, {"course_id": 533, "course_code": "PHIL 452", "course_name": "PHIL452 - Studies in Epistemology (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["I am originally American but lived for 24 years in the UK.", "Graduate level courses covering specialized topics in philosophy.", "These courses are often held in conjunction with 400 level philosophy courses, though of course the work requirements for graduate students are more stringent.", "Graduate level courses covering specialized topics in Applied Philosophy.", "These courses are often held in conjunction with PHIL 673, Graduate Courses in Philosophy; the course requirements in PHIL 675 will involve application of philosophical methods and theories to practical problems.", "These courses are often held in conjunction with 400 level philosophy courses, through of course the work requirements for graduate students are more stringent.", "But I also ask students to bear in mind that these are difficult issues to discuss and navigate, and that we're all learning how to do it well.", "Compare strengths and weaknesses of various definitions of 'conspiracy theory'", "Discuss whether those who believe in conspiracy theories can/should be criticized epistemically, morally, or politically", "Consider individual, structural, and other explanations for belief in conspiracy theories", "Apply concepts from the philosophical literature to real-life cases of conspiracy theorizing in an illuminating way", "Present their thinking about conspiracy theories in written and oral form", "Give helpful feedback to classmates on the development and expression of their ideas", "\"Echo chambers and epistemic bubbles.\"", "Perusall is a tool that we'll use together for close reading.", "Draw a connection with something else-- maybe in the same paper, maybe a different one, maybe something not in philosophy.", "Suggest a response to a point the author makes.", "I can also print handouts for you, if you send them by 9AM on 15 January.", "Do you discuss origins of theory (or at least whether these are known)?", "Do you explain the theory's main claims?", "Are you clear?", "Do you present engagingly?", "Both members of each team will get the same mark.", "Essay", "For graduate students: 3000-4000 words", "Case study: Discuss a real-life conspiracy theory in light of one or more of the philosophical readings on this course.", "Is it right to be generally suspicious of conspiracy theories/those who believe in conspiracy theories?", "Independence", "I may use software to detect the use of Generative AI in writing essays.", "Extensions", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 535, "course_code": "PHIL 458", "course_name": "PHIL458 - Studies in the Philosophy of Science (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Philosophy of Applied Mathematics Fall 2023", "Prof. Doreen Fraser", "t]he miracle of the appropriateness of the language of mathematics for the formulation of the laws of physics is a wonderful gift which we neither understand nor deserve.”", "What is the reasonable explanation for our success in applying mathematics?", "What does this explanation tell us about the nature of logical, mathematical and scientific knowledge?", "Explain some of the conceptual problems raised by the applicability of mathematics and different strategies for resolving these problems.", "Appreciate ways in which philosophical questions are relevant to current research in science and applied mathematics.", "A current version of the Schedule of Topics and Readings is available on LEARN.", "These readings can be accessed through the LEARN course web site.", "Copies of these readings must be brought to class.", "Short papers", "You may submit a maximum of one short paper per week.", "This course includes the independent development and practice of specific skills, such as drafting and revising papers.", "Library for research-based assignments", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Do you want professors and interviewers to call you by a different first name?", "Intellectual property includes items such as:"]}, {"course_id": 536, "course_code": "PHIL 459", "course_name": "PHIL459 - Studies in the Philosophy of Physics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Philosophy of Quantum Theory Fall 2022", "10:00AM - 11:20AM HH 259", "Prof. Doreen Fraser", "Quantum theory is the branch of physics that describes entities and processes at sub-microscopic distance scales.", "Quantum mechanics has notoriously resisted our best efforts at interpretation.", "This course is suitable for students with a background in either philosophy, physics, or mathematics; knowledge of quantum theory will not be presupposed.", "Please contact the instructor if you require permission to enroll in the course.", "Explain some of the conceptual problems raised by quantum theory and different strategies for resolving these problems.", "Appreciate ways in which philosophers can productively engage with physicists about quantum theory.", "A current version of the Schedule of Topics and Assigned Materials is available on LEARN.", "Copies of these readings must be brought to class.", "Short papers", "You may submit a maximum of one short paper per week.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Do you want professors and interviewers to call you by a different first name?", "Intellectual property includes items such as:"]}, {"course_id": 548, "course_code": "PSYCH 207", "course_name": "PSYCH207 - Cognitive Processes (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["An examination and evaluation of selected topics dealing with human information processing such as attention, memory, pattern recognition, consciousness, language, dyslexia, decision making, and problem solving.", "how we call on our mental information and resources to make important decisions; and,", "Describe how context shapes and constrains cognition, which involves"]}, {"course_id": 549, "course_code": "PSYCH 261", "course_name": "PSYCH261 - Physiological Psychology (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to brain, basic physiological processes, and their roles in behaviour.", "Both experimental and clinical data are considered.", "Familiarise you with the theoretical and philosophical underpinnings of physiological psychology;", "Teach you about the physiological mechanisms underlying human sensory and perceptual systems; and", "Provide you with insights into the basic physiological and mechanisms involved in behaviour, cognition, emotion and consciousness.", "Week 1: Introduction and History", "Sona Participation and Research Experience Marks", "Students may complete any combination of these options to earn research experience grades.", "Credits for online courses can be earned through any combination of studies as noted above.", "Participation enables students to learn first-hand about psychology research and related concepts.", "Educational focus of participation in research", "To maximize the educational benefits of participating in research, students will receive feedback information following their participation in each study detailing the following elements:", "Provisions to ensure confidentiality of data", "**", "Identify the psychological concepts in the article and indicate the pages in the textbook that are applicable.", "Clearly evaluate the application or treatment of those concepts in the article.", "If such a conflict arises, the Associate Chair for Undergraduate Affairs is available for consultation and to mediate a resolution between the student and instructor."]}, {"course_id": 551, "course_code": "PSYCH 291", "course_name": "PSYCH291 - Basic Research Methods (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Basic Research Methods Winter 2025", "People are naturally curious about one another's behaviour patterns and their underlying causes.", "Psychological questions are a popular topic both in everyday conversations and in popular media.", "How can we evaluate whether a new type of therapy is effective for treating psychological disorders?", "Why do people make decisions that they later regret even though the harmful consequences were foreseeable?", "What determines whether a romantic couple will stay together or break up?", "Research methods encompass the principles and strategies that guide how psychologists collect and interpret information to answer these sorts of questions in order to build an accurate understanding of the mind and behaviour.", "We will review the rationale for using particular methods and the principles for evaluating the quality of these methods.", "prepare you to conduct well-designed psychological investigations of your own,", "become a more informed and critical consumer of research, and", "This course begins with important ethical considerations that first must be considered when conducting research.", "It touches on methods for generating hypotheses, developing one's skill in generating insightful hypotheses, and assessing the validity of hypotheses.", "Specifically, this course will provide students with the opportunity to explore important topics and skills in psychological research including how to", "design scales that elicit meaningful responses,", "assess the relative strengths and limitations of different methodologies including self-report surveys, lab experiments, and field studies.", "Think and Respond Self-Assessment and Workbook Questions", "These self-assessment questions are a core aspect of this course.", "Skipping these questions and not checking the feedback will result in missing some core content and knowledge that will be tested in various different graded assessments in this course (i.e., assignments, quizzes, and final examination).", "Discussions", "Discussions will be graded, with the expectation that each student make a meaningful contribution to the discussion and respond to other group member's posts.", "Assignments are designed to assess your understanding of key concepts from the course modules through structured exercises.", "These assignments will challenge you to apply your understanding of key concepts to complete practical tasks and to evaluate the quality of specific research designs.", "The completion of these assignments will allow you to put your knowledge into practice and demonstrate your learning of research principles in a variety of ways.", "critically evaluate research as it is presented in popular media and academic articles,", "discuss and evaluate techniques that researchers use to test the reliability and validity of measures,", "recognize the value of experimental methods for testing hypotheses about psychological causes, and", "strategically search a library database to identify relevant research articles on a topic of interest.", "Informal resolution of conflict", "If such a conflict arises, the Department Chair (Dr. Heather Henderson) is available for consultation and to mediate a resolution between the student and instructor: Email: hhenderson@uwaterloo.ca.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "This course includes the independent development and practice of specific skills, such as critical thinking skills and the ability to apply knowledge generated in the course to new scenarios.", "Library for research-based assignments", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 552, "course_code": "PSYCH 292", "course_name": "PSYCH292 - Basic Data Analysis (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Basic Data Analysis Spring 2024", "E. Meyers", "Your instructor checks email and the Ask the Instructor discussion topic frequently and will make every effort to reply to your questions within 24–48 hours, Monday to Friday.", "Instructor: Ethan Meyers", "An introduction to the logic and methods of descriptive and inferential statistics with emphasis on application in Psychology.", "Topics covered include measures of central tendency and variability, distributions, the normal distribution, z-scores, hypothesis testing, probability, chi-square tests, t-tests, power, and correlation and regression.", "In this course, you will learn the basics of using descriptive and inferential statistics in the analysis of psychological data.", "This course emphasizes an understanding of fundamental statistical principles rather than \"cookbook\" application of statistical formulas.", "The principles provided in this course will serve as a foundation for more advanced statistical techniques that you may study in later courses.", "An appreciation of basic statistical principles, furthermore, can help you to be a more critical \"consumer\" of reported research findings.", "Examine and describe distributions", "Estimate measures of of central tendency and spread", "Test statistical hypotheses for independent samples and matched pairs", "Understand and apply the basic principles of chi-square, t-tests, ANOVA and Regression", "Develop a basic intuition for, and be able to describe, power analysis and effect size", "Strategies for Success", "Do the practice exercises in the online textbook and the practice questions that appear under each week’s lessons.", "Statistical computation needs to be internalized through continuous training and it will not work as effectively if you try to cram everything in the night before assessments.", "Week 1: Introduction to Statistics, Measures of Spread, and Relationships", "Week 5: Introduction to Inference and Estimation", "Week 6: Hypothesis Testing - One Sample Tests", "Week 8:  Inference for Relationships Between Multiple Variables: t-tests", "Week 9: Inference for Relationships Between Multiple Variables: ANOVA and Chi-Square", "Week 11 & 12: Inference for Relationships Between Multiple Variables: Regression", "Course Name: Spring 2024- Basic Data Analysis - PSYCH 292", "Choosing Software in the OLI", "The online textbook provides instructions for each activity.", "Retrieved from https://oli.cmu.edu/jcourse/workbook/activity/page?context=f4869b790a0001dc25036e45235cf53e and licensed under CC BY-NC-SA 3.0", "You should treat these aids like answer keys: struggle with the material as much as you can prior to checking the answer.", "For instance, I recommend including formulas, conceptual answers, a flow chart for deciding which statistical test to use, and maybe a few example problems.", "The sheet can be no larger than a standard sheet of paper (8.5\" x 11\") and must be submitted as part of the final exam.", "Calculators", "Avoiding Academic Offences"]}, {"course_id": 558, "course_code": "PSYCH 389", "course_name": "PSYCH389 - Social Science Advanced Research Methods Topics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Social Science Advanced Research Methods Topics: Developmental Psychology Fall 2024", "02:30PM - 05:20PM", "02:30PM - 05:20PM QNC 1507", "Many of these skills are also useful in non-academic contexts.", "Gain experience presenting findings and your ideas.", "Please double-check your file uploaded correctly!", "Late Assignments & Attending Class", "Sep12 Assign Methods & Results presentations; discuss article; assign Short Proposal", "Sep19 Methods & Results presentations, Round 1", "Oct3 Methods & Results presentations, Round 2", "Nov14 Extract data & plot it", "This course includes the independent development and practice of specific skills, such as skills involved in synthesizing ideas and proposing novel experiments.", "Library for research-based assignments"]}]