[{"course_id": 8, "course_code": "INTEG 441", "course_name": "INTEG441 - Hard Decisions and Wicked Problems (0.50)", "term_name": "Required Courses", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Notice of Recording", "Hard Decisions and Wicked Problems Winter 2023", "This course introduces decision analytic tools for systematically structuring messy problems to identify trade-offs among different decisions and to explore them intelligibly.", "This course introduces decision analytic tools for systematically structuring messy problems to identify trade-offs among different decisions and to explore them intelligibly.", "1) Apply at least one technique for the purpose of systems analysis", "2) Apply a variety of decision-analytic techniques for the purposes of problem definition and decision analysis", "3) Construct and analyze simple models for decision problems, where you are able to", "- Perform an appropriate sensitivity analysis of your results;", "- Discuss the limitations of your simple model and important considerations (e.g. caveats, sensitive issues, unresolved issues) for a decision or for future research.", "4) Apply skills in visual and written communication for technical and general audiences (i.e., appropriate for a blog)", "Lecture: Overview of decision analysis, wicked problems, and systems analysis", "Lecture: Approaches for structuring decisions and understanding decision contexts", "Decision contexts of wicked problems: The ‘iceberg’ model", "Lecture: Approaches for structuring decisions and making choices", "Decision trees", "Guest speaker: Cross-impact balances analysis", "(Ajar Sharma, PhD Candidate in Systems Design Engineering)", "Lecture and tutorial: Succession and intervention analysis in ScenarioWizard to investigate systemic effects, leverage points", "Class discussion of “inner work” and systems change", "PC compatible Yes", "Truth Decay by J. Kavanagh & M.D. Rich Yes", "- Visual systems map (33%)", "5-6 Participation in seminars", "1, 4 Visual systems map", "Marks for these components will be based on a specifications grading scheme, where activity is graded pass/fail or along a scale of check-plus/check/check-minus.", "In general, a check-minus rating would be for physical presence but minimal engagement, while a check-plus rating would be for exemplary engagement that keeps class or small-group discussion lively.", "Achieving this will involve coordination, cooperation, and checking each other’s work – and may involve diplomatically encouraging some group members to step up and others to step back.", "Some suggestions:", "To receive correction credit:", "Such penalties are in place because reformatting files slows marking down for the entire class, and nobody wants that!", "Due to strict copyright restrictions from the textbook publisher, a downloadable file of the slides cannot be provided.", "These grace days are in addition to the 2-day short-term absence that students can self-declare in Quest.", "Notice of Recording", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement and Ethical Behaviour: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Expectations for what constitutes ethical behaviour can be found in Policy 33.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 9, "course_code": "INTEG 475", "course_name": "INTEG475 - Special Topics in Knowledge Integration (0.50)", "term_name": "Required Courses", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["10:00AM - 11:20AM EV2 2069", "10:00AM - 11:20AM EV2 2069", "10:00AM - 11:20AM EV2 2069", "10:00AM - 11:20AM EV2 2069", "This course will introduce students to what proposed climate interventions are, why more members of the scientific community acknowledge that climate interventions should be studied, and the social, economic and governance dimensions of researching and deploying climate interventions.", "Students will learn the scientific and technical dimensions of proposals to intervene on the climate system, the associated risks, and the governance challenges that climate interventions pose.", "Summarize scientific and public discourses regarding climate interventions.", "3. Consider and critically assess scientific and public discourses regarding climate interventions", "4. Respectfully discuss and debate climate change and climate intervention issues with others", "Climate economics", "(Seminar 3) Mitigation as a blend of technological and lifestyle change", "(Lecture) Impacts of climate change and adaptation as a response", "(Seminar 4) Adaptation as a blend of technological and lifestyle change", "Lecture/Seminar: Why more scientists talk about climate intervention as a response to climate change", "Assigned chapters from", "What if we became geo-engineers instead?", "Nature-based solutions (i.e., plants and rock weathering)", "Preview of global governance of CDR in the context of UNFCCC", "Exploratory Seminar Monday", "Climate interventions as part of a climate policy portfolio and ethical concerns (e.g., potential mitigation deterrence)", "Exploratory Seminar Monday", "Contemporary developments in SRM: research and field tests", "Apr 3 recap seminar and student course perceptions: What are some core ethical issues associated with climate interventions?", "Geo-engineering ethics bowl", "In-exam: Live debate and decision", "Graduate readings (required for graduate students)", "The student grasps key concepts but has made significant errors, or ideas should be further developed to better demonstrate what the student understands.", "It appears that most key concepts are not understood.", "Most key concepts are not understood.", "No key concepts are sufficiently understood.", "Group vs. individual work for graduate readings in submitted Reading Notes.", "Students may be interested in multiple publications on the Graduate Reading Lists but may have differing capacities for reading more than 1 publication in the time to complete the Reading Note assignment.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and/or in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 13, "course_code": "ARTS 490", "course_name": "ARTS490 - Fourth-Year Topics in Arts Disciplines (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Interdisciplinary Design Project 2 Winter 2025", "At the end of this course students will be able to re-formulate and re-communicate an engineering problem or opportunity (as appropriate); revise and communicate a feasible design project plan; revise solutions that address the formulated problem (as appropriate); implement and verify design solutions by analysis, test or prototype; communicate design solutions using accepted data formats, working documents and oral presentations; address safety, regulatory, sustainability and professional ethics requirements, as appropriate; effectively manage and communicate design project plans, technical and non-technical risks, using project management tools and techniques; work effectively as an interdisciplinary team member and/or team leader.", "View requirements for SCI 300", "On the heels of launching the Future Cities Institute, UW is offering a new special course: an interdisciplinary capstone course involving students and professors from multiple faculties working together to explore the complex challenges of Future Cities.", "In the first half of the course (Fall 2024), you will develop a deep understanding of the focal problem through months of thoughtful research, building the foundation for your project (e.g. problem definition, situation analysis, conducting a literature review, solutions identification and evaluation, and managing your team and your project and developing your communication skills).", "Where i-capstone differs is that you get to engage with other motivated learners from across faculties to leverage your unique perspectives, knowledge and skills, to contribute to solution-oriented projects that demonstrate mastery of problem-solving, critical thinking, and communication on a selected topic under the theme of Future Cities.", "Didactic vs Dialectic Instruction", "This is a solitary experience.", "Parts for Physical Prototypes", "Clearly define the interdisciplinary problem to be solved", "Identify multiple solutions that can address the focal problem", "Apply critical thinking, data collection and analysis skills to determine the optimal solution", "Understand a wide range of techniques, tools, skills, concepts, frameworks and professional practices from various disciplines", "Select and apply appropriate techniques, tools, skills, concepts, frameworks and professional practices for a particular project", "Available in the library No", "Divide & conquer often does not work well for capstone projects: the work needs to be integrated.", "Team friction/conflicts are a normal part of working life, and finding collaborative ways to resolve them is an important professional skill.", "-", "-", "Abstracts & team photo LEARN Feb 10", "3:30-7:30pm", "Final self & team member evaluation Peer Scholar via LEARN Apr 9", "End-of-Term Individual reflection & advice for younger cohorts PebblePad via LEARN Apr 9", "Disclaimer", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 14, "course_code": "ENGL 108D", "course_name": "ENGL108D - Digital Lives (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Email: c23marti@uwaterloo.ca", "An examination of how digital communication technologies create and promote online identities and social spaces, as well as interpersonal and communal interactions.", "View requirements for ENGL 108D", "How do the technical affordances of online spaces shape the way we use them?", "Analyze the socio-cultural, technological and ideological systems that shape the digital world, and shape us in turn.", "Apply core concepts of new media theory to your own digital life, improve your informational awareness and engage critically with digital culture.", "The Emergence of the Digital World Pt 2 Curtis, Hypernormalization", "Shrinking Frontiers: Digital Platforms and Corporate Consolidation", "Dijck, Platform Society", "Values at Play", "Week 7 AI Slop, Grifter Gurus and Memecoin scams: Digital Life in the Post-truth era   TBD Digital Artifact Analysis Due", "Critical Digital Media Analysis 15%", "This course includes the independent development and practice of specific skills, notably those involved with written communication, critical thinking and analysis, independent research and oral presentation.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 16, "course_code": "ENVS 210", "course_name": "ENVS210 - Future Studies (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["02:30PM - 05:20PM", "02:30PM - 05:20PM ONLN - Online", "in person sessions", "The course is structured into two parts: the first concentrates on representations of the future ranging from utopian to dystopian visions including their influence on collective perceptions and policy-making; the second centres on methods relied upon to anticipate the future.", "In this introduction to Futures Thinking, students will learn to apply robust methods for understanding emerging shifts impacting our volatile world and explore possible alternative outcomes of those changes.", "• Demonstrate skill in gathering information from diverse sources and developing patterns of emerging social, environmental, technical and economic trends relevant to the topic area", "• Deploy methods for creation and comparison of alternative future explorations that are possible, plausible and provocative", "Finding patterns – making sense of the information you gather", "Assignment 2 launched (Scenario development – group project)", "How to structure scenarios to ensure plausibility – systems and coherence", "Seeing the future across multiple horizons", "In class exercise - delivered online", "Evaluating scenarios for strategic impact, risks and opportunities", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 17, "course_code": "ENVS 310", "course_name": "ENVS310 - Future Cities: Integrating Future Thinking into Urban Decisions (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Future Cities: Integrating Future Thinking into Urban Decisions Fall 2024", "B2 350", "View requirements for ENVS 310", "Concepts like eco-cities—centers of sustainability that prioritize green spaces, renewable energy, and eco-friendly architecture such as green roofs and vertical farms—offer hopeful visions of a sustainable tomorrow.", "Meanwhile, smart cities promise a future where interconnected sensors and advanced data analytics streamline everything from traffic flow to energy consumption, turning urban living into an optimized, efficient ecosystem.", "In this module, we will critically examine how these ideas are shaped by specific political, cultural, and economic interests, reflecting particular values and worldviews.", "Understanding the forces behind these visions will empower you to engage with them more critically and think more deeply about the kind of future you want to help shape.", "2. Analyze the reciprocal relationship between future visions and city development processes, and how each shapes the other;", "3. Examine the inequalities present in the creation and representation of urban imaginaries;", "Apply tools and methods to actively participate in the co-creation of equitable and sustainable future cities", "Expectations", "Approaches to futures and foresight", "History of futures", "The Namesake: Futures; futures studies; futurology; futuristic; foresight—What's in a name?", "Introduction to urban imaginaries", "Introduction: Urban imaginaries in theory and practice.", "373-386).", "Modelling and forecasting", "Limits to modelling approaches", "Smart cities", "Scenario planning tools", "Socio-technical imaginaries", "Scenario types and techniques: towards a user's guide.", "Using feminist utopias in creating a more inclusive vision of the future city.", "“Sultana's Dream” By Rokeya Sakhawat Hossain", "Spiral to the stars: Mvskoke tools of futurity.", "“Métis in Space” by Molly Swain & Chelsea Vowel is a podcast offering critical analysis of science fiction from a feminist, Métis perspective.", "Imagination and transformations to sustainable and just futures.", "Frontiers in Ecology and the Environment, 14(8), 441-448.", "Analysis of city vision (pairs) 20", "Deliverable: A well-structured 2,000-word essay that critically examines the dominant imaginaries within the city’s vision.", "Your analysis should explore the reasons these particular imaginaries prevail, considering broader political, historical, and environmental contexts.", "It can be simple, or complicated, it can be based on a pre-existing game, or it can be brand new.", "Before launching into the games, each group will deliver a short presentation explaining the rationale of their game and how it moves us to think about the future.", "Be sure to reference the readings where relevant and connect them to the broader course themes.", "I hope we can foster a safe and engaging space for thinking critically, and I will be relying on all of you to help create that space.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 19, "course_code": "ERS 316", "course_name": "ERS316 - Urban Water and Wastewater Systems: Integrated Planning and Management (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Notice of Recording", "Urban Water and Wastewater Systems: Integrated Planning and Management Fall 2024", "ERS 316", "Dr. Felicitas Egunyu", "Emily Rorison          Email: erorison@uwaterloo.ca", "Development and maintenance of urban water and wastewater systems, along with demand and supply management planning, efficiency mechanisms, development and equity concerns, will be examined.", "View requirements for ERS 316", "This course is designed for senior students interested in urban environmental issues, with a focus on water services.", "This course extends concepts learned in ERS 265 (Water History), complements ERS 365 (Water Governance), and is a useful foundation for a senior thesis (ERS 411) or interdisciplinary graduate studies on water issues.", "For those students who have a strong interest in the topic, but do not have the background knowledge, this course will offer a comprehensive understanding of urban water and wastewater systems.", "Lectures, participating in tutorials, and groups provide an overview of key concepts and highlight important ideas from the readings.", "Describe frameworks for understanding and explaining urban water use.", "3. Identify and describe municipal water and wastewater systems and their subcomponents.", "The Aqueducts and Water Supply of Ancient Rome", "Yudelson", "Yudelson", "Yudelson", "Yudelson Chapters 7 – 8", "Yudelson Chapters 11 – 13", "Exposing the myths of household water insecurity in the global north: A critical review", "Yudelson", "Notice of Recording", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 20, "course_code": "ERS 361", "course_name": "ERS361 - Food Systems and Sustainability (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Food Systems and Sustainability Spring 2024", "S. Scott", "sdscott@uwaterloo.ca", "Instructor: Steffanie Scott", "sdscott@uwaterloo.ca", "Specific themes covered in the course include technological and genetic change in food production, resource depletion and wider environmental impacts of the industrial food system, and policy, market-oriented, and civil society initiatives to bring about change in the food system, including organic production and localizing food systems.", "No other human activity has a greater ecological impact than our food system.", "Socio-cultural, economic, and political dimensions also shape the sustainability and resilience of our food system.", "Understanding many sides of an issue places you in a stronger position to determine and defend your own ideas.", "Food system change is a topic fraught with debate, particularly in relation to balancing socio-economic and ecological considerations.", "Explain the historical development of the contemporary food system, and associated main concepts and models (e.g., community-based/regional versus globalized/industrial food systems), and", "Specifications grading scheme & grade pathway requirements", "You can always move to a lower-level grade pathway.", "Grade A Pathway Grade B Pathway Grade C Pathway Grade D Pathway Re-submissions allowed?", "*only one of the Assignment 3 options can be used", "Re-submissions", "Extensions and Late Submissions", "We will follow these instructions and automatically assess your late penalty upon grading.", "Please anticipate technical problems and leave yourself at least a 1-2 hour buffer before the deadline in case something happens when you try to submit your work.", "Save multiple versions of your work as you write in case you accidentally overwrite your file.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "This course includes the independent development and practice of specific skills, such as food systems analysis.", "Library for research-based assignments", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 21, "course_code": "ERS 372", "course_name": "ERS372 - First Nations and the Environment (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["First Nations and the Environment Winter 2024", "ERS 372", "02:30PM - 05:20PM", "EV2 2006", "First Nation environmental issues are often complex and require a holistic approach where the lines between different disciplines (e.g. natural, physical, health, and social sciences) are often obscured.", "This unique course, co-taught with Traditional Knowledge Holder/Anishinaabe Elder Peter Schuler from the Mississauga’s of the New Credit First Nation, will provide upper-year undergraduate and graduate students, in the Faculty of Environment and across the university, an introduction to First Nations issues in Canada and to Anishinaabe Traditional Knowledge and Practice.", "2) Through weekly readings and online discussions: (i) Introduce students to some relevant academic literature on First Nations issues in Canada and appropriate/respectful research approaches such as critical Indigenous methodologies and decolonizing methodologies, and; (ii) Discuss these in a small group setting with insights from Peter and Dan", "Sand Talk, The Porcupine, the Paleo-mind and the Grand Design, The Albino Boy and Lemonade for Headaches", "Other Readings TBD", "Decolonization: Indigeneity, Education & Society, 1(1): 86-101.", "#1c - Reflecting on the material discussed in class (Peter's teachings, weekly readings and discussions, weekly critical reflections), and, based on existing evidence and relevant literature, envision a quasi-realistic future in which we are appropriately addressing complex issues such as climate change, social and environmental injustice, armed conflict, biodiversity loss etc.", "Explore what can be learned from this type of reflection and what are the first steps that can be taken towards that potential future?", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 22, "course_code": "ERS 404", "course_name": "ERS404 - Global Environmental Governance (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["02:30PM - 05:20PM", "Email Address: andrea.collins@uwaterloo.ca", "The history of international environmental politics will be reviewed, specific organizations and other actors involved in global environmental governance will be examined and the management of particular global environmental challenges investigated.", "ERS 404: View requirements for ERS 404", "Though efforts are made at all levels of society to address environmental issues, many of the challenges we face require transboundary coordination and governance.", "Students will learn about conventional sites of state-based governance, international organizations and agencies as well as emerging forms of governance, including private governance and the role of non-state actors.", "Students will develop a sense of the various political interests that influence global environmental governance and the challenges to enacting effective governance.", "Define and apply key concepts in contemporary global governance", "Describe the different kinds of global governance actors and their roles", "Understand global environmental issues and the presence or absence of appropriate governance mechanisms", "Analyze different forms of global environmental governance and assess their effectiveness", "Communicate key political challenges through both writing and public presentation", "+ A Short History of Grappling with Global Environmental Problems", "This week will introduce students to the overarching theme of the course – specifically that ‘governance’ is a flexible and contested term – and introduce some core ideas about global governance.", "“Responsibilities in Transition: Emerging Powers in the Climate Change Negotiations.”", "China as a ‘Partial’ Environmental Great Power.", "“Big Brand Sustainability: Governance Prospects and Environmental Limits.”", "Week 5 – Feb. 5 – Non-Governmental Organizations, Social Movements, Experts, and Civil Society & Modes of Non-state Governance", "“Is the Power of Brand-Focused Activism Rising?", "The Convention on International Trade in Endangered Species of Wild Fauna and Flora (CITES)", "Thematic Focus: North-South relations in global environmental governance", "Week 9 – March 12 – Ecosystems & Change: Deforestation and Land Degradation", "Thematic Focus: Role of non-state actors in global environmental governance.", "“Agency Shifts in Agricultural Land Governance and Their Implications for Land Degradation Neutrality.”", "muse.jhu.edu/article/168279", "Thematic Focus: Environmental justice and/or North-South relations", "Thematic Focus: fragmentation of environmental governance", "Morin, Jean-Frédéric & Orsini, Amandine.", "It contains short descriptions of key concepts that you may refer to in your reading for further clarification.", "Mid-term Test - Held in-person 25%", "Write a short 300-word original reflection of your thoughts about ideas/concepts in the weekly readings and emailing it to me before the next week begins (i.e. by Monday morning at 9 a.m.).", "Peer- Evaluation and Self-Assessment:", "I will provide resources to help you and your research partner(s) to communicate and collaborate, but you are ultimately responsible for resolving issues and solving problems.", "In addition, this document must also include a 100–150 word peer-evaluation of each research partner(s)’s performance and the nature of your collaboration this term.", "A clear description of your research topic: the issue and/or global agreements you have been assigned.", "Be well-organized and memorable with a clear learning outcome (i.e. what is the one thing you want the class to remember from your lesson).", "Each lesson should be 30 - 40 minutes in length.", "Additional time will be allotted for follow-up questions from the class and the instructor, so your entire time in front of the class may be up to 75 minutes.", "Instead, your analysis will demonstrate your understanding of the various actors and dynamics in global environmental governance.", "Please include a separate references page.", "Your references pages do not count towards the overall word count.", "Be sure that your research encompasses the study of global politics and governance and not just the scientific literature about your research area.", "The whole team will also need to attend an in-person meeting with me to discuss your research findings and contributions to the paper in the week before the end of the term.", "The exam will be held in-person during the exam period.", "Please be sure to refer to these when you are preparing your Team's lectures and when participating in class discussions.", "Engage in healthy debate:", "Don't interrupt when someone is speaking", "An engaged facilitator", "Prompts for discussion", "Opportunity to write ideas first", "Space for people to explore/explain ideas using their own experience and knowledge", "Organized slides", "clear headings", "summaries", "Late take-home exams will not be accepted after the grace period ends and will earn a grade of zero.", "Life happens and often interrupts our best laid plans for the term.", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Cross-listed courses", "This course includes the independent development and practice of specific skills, such as reading and analysis.", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 25, "course_code": "ERS 454", "course_name": "ERS454 - Parks and Protected Areas: Issues and Trends (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["ERS 454", "ERS 454 001", "02:30PM - 05:20PM", "EV2 2006", "ERS 454:", "View requirements for ERS 454", "This course explores the critical roles parks and protected areas play in the sustainability of human societies and the natural world.", "Parks and protected areas, both nationally and internationally, are set aside to achieve a range of public policy outcomes including the conservation of biodiversity, ecological integrity, sustainable ecosystems, social well being and economic benefits.", "The International Union for the Conservation of Nature (IUCN) classification system and conservation guidelines will be used as the basis for comparative analysis and the identification of policy objectives related to protected lands and waters.", "The relationship of parks and protected areas to environmental trends such as climate change, water and food security, economic development and biological diversity will be examined in the Canadian and international contexts.", "In addition, the role of parks and protected areas as an element of Canadian identity will be considered based on shifting public priorities related to environmental protection and socio-economic well being.", "Government decisions to set aside lands and waters for conservation are policy choices to conserve rather than develop or degrade ecological and natural resources.", "These decisions create socio-ecological systems and are often controversial, calling into question societal values and valuation related to the natural world.", "The course considers the societal values associated with conservation and will use case studies to examine how and why natural resources are protected through establishment processes.", "The question of whether there is a fundamentally irreconcilable tension between policies of protection and use of parks and protected areas will be considered, as well as the influence that political priorities and preferences play in the policy emphasis affecting management of conservation lands and waters.", "The role of shifting demographics related to government decisions to establish parks and protected areas, and the types of programs, services and opportunities for conservation and public use will be considered in the context of past, current and emerging trends and public policy choices.", "•Understand and evaluate the diverse and complex public policy dynamics related to the establishment of parks and protected areas, and the management of parks and protected areas systems in Canada, and internationally.", "•Explore key issues and trends related to parks and protected areas to, and be able to assess the effectiveness of legislation, public policy and strategies to address the long-term sustainability of systems protected lands and waters.", "•Understand and apply knowledge of the roles and benefits of parks and protected areas in the broader context of environmental sustainability at the national and international scales and understand the role of parks and protected areas in achieving a range of public policy outcomes.", "ERS 454 - Undergraduate", "Preparation for in-class activities and completion of readings,", "Participation in discussions and seminar breakouts", "To achieve success for this aspect of the overall student assessment, students will provide answers to the questions that demonstrate comprehension of the course content, evidence of completion of assigned readings, the capacity to apply and integrate concepts and principles when addressing an issue related to parks and protected areas.", "Validity of information and concepts:              10", "To achieve success for this aspect of the overall student assessment, students will demonstrate comprehension of the course content, evidence of completion of assigned readings, completion of research related to the topic, the capacity to apply and integrate concepts and principles when addressing an issue related to parks and protected areas.", "Evidence and strength of research:                                  20", "Internal logic and validity of argument                            25", "ERS 654 - Graduate", "Preparation for in-class activities and completion of readings,", "To achieve success for this aspect of the overall student assessment, students will provide answers to the questions that demonstrate comprehension of the course content, evidence of completion of assigned readings, the capacity to apply and integrate concepts and principles when addressing an issue related to parks and protected areas.", "Validity of information and concepts:              10", "Research Project and Paper and in-class Presentation", "To achieve success for this aspect of the overall student assessment, students will demonstrate comprehension of the course content, evidence of completion of assigned readings, completion of research related to the topic, the capacity to apply and integrate concepts and principles when addressing an issue related to parks and protected areas.", "In preparation, readings for the class can be identified in advance to facilitate seminar discussion.", "Internal logic and validity of arguments                          20", "This course includes the independent development and practice of specific skills, such as research, analysis, information integration and thinking.", "If the development of your research proposal consists of research that involves humans as participants, please contact the course instructor for guidance and www.research.uwaterloo.ca/ethics/human/.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 26, "course_code": "ERS 462", "course_name": "ERS462 - Global Food and Agricultural Politics (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["04:00PM - 05:20PM", "Email: cmmcglad@uwaterloo.ca", "Demonstrate a working knowledge of the history of the industrialization of food and agriculture.", "Demonstrate knowledge of the main features of the issues and actors in global food politics from production to consumption.", "Identify the main features and scales of food security and food sovereignty and explain how they are changing with reference to global politics and governance processes.", "Assess the significance of global actors, and their impacts within specific issue-areas", "Facing the Food Systems Summit - Panel Recording; found here: https://www.youtube.com/watch?v=9uE_AdSB5qk", "“Sustainably Sourced Junk Food?", "Agriculture and Human Values 33 (3): 537-48.", "“The Dynamics of the Contemporary Governance of the World’s Food Supply and the Challenges of Policy Redirection.", "Global Environmental Politics", "Toward Indigenous visions of nature-based solutions: an exploration into Canadian federal climate policy.", "identified the key elements of the review; and", "A class reflection of food systems transformation and global food politics.", "No Assigned Readings", "Assigned readings should be read before the relevant classes.", "CFS and Issue Analysis Report 25", "A weekly summary involves outlining the following components for each article or chapter assigned for that week’s readings.", "A list of key concepts and terms with definitions (five to seven in total).", "A summary of the author’s main argument(s) (four sentences maximum) stated in your own words (for each reading that week).", "Critical analysis of the readings will follow in class during discussions.", "Summaries should be roughly 500 words in total, with a maximum of 750 words.", "This may involve describing unique aspects of the papers, simplifying any technical elements of the papers and asking questions to spark discussion.", "As the discussion unfolds, the discussants will be responsible for synthesizing points made by their peers and steering the discussion in a fruitful manner.", "The report should be between 2000 – 2500 words and should include works cited in APA format.", "This assignment should be approximately 2500-3000 words in length (excluding references).", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments consider students' well-being to be extremely important.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 27, "course_code": "GEOG 203", "course_name": "GEOG203 - Environment and Development in a Global Perspective (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Environment and Development in a Global Perspective Fall 2024", "08:30AM - 09:50AM HH 1101", "Farah El-shayeb (felshaye@uwaterloo.ca)", "Examines the interface between human development and the environment in a global context.", "In this course, we will examine some of the most pressing environmental and development issues facing our world today, as well as international development efforts to address these.", "These efforts include interventions to help individuals and communities adapt to change through climate resilient agriculture, biodiversity, and clean energy transition.", "Several international development practitioners working in these areas will visit our class as guest speakers to share insights about some of the challenges and opportunities they face in implementing their work.", "Understand the historical evolution of international development and its linkages to globalization and economic growth.", "Translate international development ideas into practical strategies via a grant writing exercise.", "Enhance your professional development and communication skills through interactions with international development practitioners.", "Global trade and development", "Guest speakers: Tiffanie Rainville and Kerry Max, Global Affairs Canada", "Adaptation and development", "FAO 2017", "This course includes the independent development and practice of specific skills.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 28, "course_code": "GEOG 207", "course_name": "GEOG207 - Climate Change Fundamentals (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Climate Change Fundamentals Winter 2025", "Climate change is one of the most profound environmental and social issues affecting communities, nations and individuals.", "Climate change is a pervasive and challenging phenomenon that can be viewed through a multitude of lenses.", "A scientific lens, for instance, reveals altered ecosystems and climatic tipping points while the lens of ethics raises the question of the right to develop and influence the well-being of others while doing so.", "By carefully laying the scientific foundations, we will explore creative, positive, nuanced visions of the future that are rooted in scientific understanding of earth systems but also capture (or at least begins a conversation about) core human values, such as equity, compassion, innovation, and connection.", "Demonstrate understanding of key elements of the climate system, and how these elements are being altered by the human emission of greenhouse gases.", "Carefully consider the impacts of climate change on both human and natural systems.", "Articulate the difference between climate change adaptation and mitigation, and understand a portfolio of actions that communities can take to respond to climate change.", "Understand the key issues at play in international climate change negotiations, as well as recent Canadian policy proposals.", "Investigate futures that are fundamentally sustainable, low-carbon, and resilient to climate change impacts.", "Week 2: Introduction to the climate system, discussion activity, quiz", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Understanding Climate Change - Digital Version", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 29, "course_code": "GEOG 306", "course_name": "GEOG306 - Human Dimensions of Natural Hazards (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Human Dimensions of Natural Hazards - GEOG 306 Winter 2025", "08:30AM - 09:50AM B1 271", "E. Mohammadi", "E-mail:            elham.mohammadi@uwaterloo.ca", "The physical nature of a wide range of geophysical and biophysical hazards will be explored, paying particular attention to the ways in which hazards become dangerous to humans, and the pathways by which humans can either increase or decrease their vulnerability in the face of natural hazards.", "Natural hazards and associated disasters are, in part, a product of inappropriate human modifications or management of the natural landscape.", "Throughout the course, case studies and examples drawn from countries and regions around the world will be used to clarify conceptual and methodological issues.", "Appreciate the physical processes associated with various natural hazards, with a focus on geophysical, meteorological, and hydrological hazards.", "Appreciate the key components of preparing for disasters.", "Apply knowledge to compare hazards theory with real-world case studies.", "Theme 1: Introduction", "Introduction to Course, Natural Hazards, and Disasters", "Defining and Measuring Disasters", "Theme 3: Prevention and Mitigation of Disasters", "Theme 3: Prevention and Mitigation of Disasters", "Theme 3: Prevention and Mitigation of Disasters", "Disasters in the Media and Risk Perception", "Disasters in the Media and Risk Perception Cont'd + Hazard focus: Wildfires", "Key Considerations in BBB", "Livelihoods & Psychological Recovery", "Comparative Analysis of Responses to Specific Disasters 20%", "Please note that these activities are designed to reinforce key concepts and promote collaboration.", "Description: Engage with the concept of vulnerability by crafting a compelling narrative that could be used in a media piece (e.g., news).", "Select and compare two disaster response efforts for similar events across different regions.", "The exam will take the form of multiple choice and short/medium-length written answer questions.", "Short-Term Absence Declarations", "This essentially removes the need for a short-term absence declaration, since a longer, three-day grace period has already been applied.", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 30, "course_code": "GEOG 307", "course_name": "GEOG307 - Societal Adaptation to Climate Change (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Societal Adaptation to Climate Change Winter 2025", "Recognizing that dangerous climate change cannot be avoided through greenhouse gas emissions reductions alone, adaptation to climate change has emerged as a central component of global climate policy.", "An in depth understanding of the diverse impacts of climate change on communities, economic sectors and society will provide a foundation for examining adaptation strategies to build resilience to accelerated climate change.", "Examples will draw from multiple sectors in both developed and developing world contexts, with an emphasis on solutions and the limits to adaptation.", "Understand the types of response options human societies have in light of present and future climate change", "Be aware of the differential impacts and vulnerabilities introduced by climate change, and how these interact with development outcomes.", "Critically examine the ways in which we communicate climate change", "Articulate the way climate change-related impacts, adaptation and vulnerability affect various sectors and locations", "Adaptation in the energy sector", "Guest speaker: Dr. Kitinya Kirina", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 32, "course_code": "GEOG 361", "course_name": "GEOG361 - Food Systems and Sustainability (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Food Systems and Sustainability Spring 2024", "S. Scott", "sdscott@uwaterloo.ca", "Instructor: Steffanie Scott", "sdscott@uwaterloo.ca", "Specific themes covered in the course include technological and genetic change in food production, resource depletion and wider environmental impacts of the industrial food system, and policy, market-oriented, and civil society initiatives to bring about change in the food system, including organic production and localizing food systems.", "No other human activity has a greater ecological impact than our food system.", "Socio-cultural, economic, and political dimensions also shape the sustainability and resilience of our food system.", "Understanding many sides of an issue places you in a stronger position to determine and defend your own ideas.", "Food system change is a topic fraught with debate, particularly in relation to balancing socio-economic and ecological considerations.", "Explain the historical development of the contemporary food system, and associated main concepts and models (e.g., community-based/regional versus globalized/industrial food systems), and", "Specifications grading scheme & grade pathway requirements", "You can always move to a lower-level grade pathway.", "Grade A Pathway Grade B Pathway Grade C Pathway Grade D Pathway Re-submissions allowed?", "*only one of the Assignment 3 options can be used", "Re-submissions", "Extensions and Late Submissions", "We will follow these instructions and automatically assess your late penalty upon grading.", "Please anticipate technical problems and leave yourself at least a 1-2 hour buffer before the deadline in case something happens when you try to submit your work.", "Save multiple versions of your work as you write in case you accidentally overwrite your file.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "This course includes the independent development and practice of specific skills, such as food systems analysis.", "Library for research-based assignments", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 33, "course_code": "GEOG 426", "course_name": "GEOG426 - Geographies of Development (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Geographies of Development Spring 2024", "S. Scott", "sdscott@uwaterloo.ca", "Selected case studies illustrate divergent outcomes of development and the contested process that development represents.", "This seminar course introduces students to a range of geographical and transdisciplinary perspectives on issues and explanations of global and uneven development, inequalities, livelihoods, and sustainable development.", "By examining the roles of key actors—the state, market, and civil society—and associated development strategies, the course provides students with a critical understanding of how social, economic, political, and environmental processes operating at various scales shape opportunities and constraints.", "To explore in-depth one challenge relating to geographies of development, and consider how it can be re-imagined through various lenses", "To understand the traumas and erasures of ongoing colonialism and ‘geographies of development’ and paths to collectively mend our relationships, including through ‘re-storying landscapes’", "To explore in-depth one challenge relating to geographies of development, and consider how it can be re-imagined through various lenses", "To understand the traumas and erasures of ongoing colonialism and ‘geographies of development’ and paths to collectively mend our relationships, including through ‘re-storying landscapes’", "In the specifications grading model, you are given a grade according to the number of learning outcomes for which you demonstrate competency.", "Earning a high mark in this course means that you demonstrated competency across multiple learning outcomes and objectives.", "A", "Term project: written & oral presentations", "Re-submissions", "Term project: If your project submissions do not receive a \"credit/pass\" the first time, you will be given one chance (for each portion of the term project) to resubmit without penalty.", "Bonus points can be earned over and above the number grades listed above based on the following:", "This course includes the independent development and practice of specific skills, such as systems thinking and transdisciplinary analysis.", "Library for research-based assignments", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 34, "course_code": "GEOG 432", "course_name": "GEOG432 - Health and the Built Environment (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["08:30AM - 09:50AM EV2 2002", "Dr. Adrian Buttazzoni", "Students will learn the history and evolution of both public health and urban planning professions and academic disciplines and gain an appreciation of the theories and methods used in each.", "Introduction", "This course will trace the history and evolution of both professions, academic disciplines, and will compare both theory and methods used.", "Compare planning and public health perspectives on: history and the evolution of the disciplines; theory; methods; power and jurisdiction", "Identify and analyze interactions between natural and built environment characteristics and human health and disease", "Demonstrate interdisciplinary collaboration skills and articulate the benefits of interdisciplinary group work", "Articulate equity considerations of planning decisions and explain the extent to which equity may or may not be important in planning", "Gather and synthesize evidence and develop data-driven predictions of future urban trends.", "Online lecture material covers conceptual and empirical examples/case studies of environment and health relationships.", "Students are responsible for completing the required readings each week, and for keeping informed about course information through LEARN.", "Readings have been selected to provide a balance of breadth and depth into important course concepts.", "Jan 8 Module 1: Introduction to the Course, Equity", "Module 2: History and Evolution of Planning and Public Health", "Introduction to the Future Cities Institute", "Module 3: Theory in Planning and Public Health", "Feb 10, 12 Module 6: Cardiovascular, Muscular, and Skeletal Systems and the Built Environment", "Feb 24, 26 Module 7: Digestive System and the Built Environment", "Mar 17, 19 Module 10: Climate Change and Physiological Systems", "The role of behavioral science theory in development and implementation of public health interventions.", "Commentary: alternative cultures in planning research—from extending scientific frontiers to exploring enduring questions.", "Should planners create hierarchies of evidence?", "The value of Twitter data for determining the emotional responses of people to urban green spaces: A case study and critical evaluation.", "Supervised injection facilities in Canada: past, present, and future.", "Rather than reading on your own, we will be using Perusall – a software designed for collaborative reading where you will be annotating, questioning, and commenting on the assigned readings in groups of students.", "The completion of readings and your level and quality of engagement establish your grade.", "Remember you are communicating a complex topic to a general audience, so you will want to find a balance between the depth and accessibility of information presented.", "Be creative!", "The purpose of this exercise is to familiarize students with having to analyze and communicate complex environment and health topics to general (i.e., non-expert) audiences that in contemporary society often do not read policy reports but rather engage fact sheets, infographics, executive summaries, and other forms of high-level communications.", "Examples of fact sheets/infographics can be found on the CDC website (Spotlight Infographic section) or via these links to infographics about heart disease, adolescent health, and health status and determinants.", "You will be presenting the findings of your final reports to a guest panel of Future Cities Representatives.", "*Detailed assignment instructions can be found on LEARN", "Fact Sheet and Issue Summary", "Short-term absence declarations will be dealt with in the following ways:", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Reading the syllabus: Professors spend a LOT of time and energy creating syllabi that we think are clear, and let students know what to expect and how to prepare.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 35, "course_code": "GEOG 462", "course_name": "GEOG462 - Global Food and Agricultural Politics (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["04:00PM - 05:20PM", "Email: cmmcglad@uwaterloo.ca", "Demonstrate a working knowledge of the history of the industrialization of food and agriculture.", "Demonstrate knowledge of the main features of the issues and actors in global food politics from production to consumption.", "Identify the main features and scales of food security and food sovereignty and explain how they are changing with reference to global politics and governance processes.", "Assess the significance of global actors, and their impacts within specific issue-areas", "Facing the Food Systems Summit - Panel Recording; found here: https://www.youtube.com/watch?v=9uE_AdSB5qk", "“Sustainably Sourced Junk Food?", "Agriculture and Human Values 33 (3): 537-48.", "“The Dynamics of the Contemporary Governance of the World’s Food Supply and the Challenges of Policy Redirection.", "Global Environmental Politics", "Toward Indigenous visions of nature-based solutions: an exploration into Canadian federal climate policy.", "identified the key elements of the review; and", "A class reflection of food systems transformation and global food politics.", "No Assigned Readings", "Assigned readings should be read before the relevant classes.", "CFS and Issue Analysis Report 25", "A weekly summary involves outlining the following components for each article or chapter assigned for that week’s readings.", "A list of key concepts and terms with definitions (five to seven in total).", "A summary of the author’s main argument(s) (four sentences maximum) stated in your own words (for each reading that week).", "Critical analysis of the readings will follow in class during discussions.", "Summaries should be roughly 500 words in total, with a maximum of 750 words.", "This may involve describing unique aspects of the papers, simplifying any technical elements of the papers and asking questions to spark discussion.", "As the discussion unfolds, the discussants will be responsible for synthesizing points made by their peers and steering the discussion in a fruitful manner.", "The report should be between 2000 – 2500 words and should include works cited in APA format.", "This assignment should be approximately 2500-3000 words in length (excluding references).", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments consider students' well-being to be extremely important."]}, {"course_id": 36, "course_code": "HIST 212", "course_name": "HIST212 - The Computing Society (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["The Computing Society Fall 2024", "S. Campbell", "If that’s not a good time for you, just get in touch and let me know when you’re free and I’ll do my best to find time.", "It explores the impact and consequences of computing from a societal perspective, but also considers various nontechnical factors and values that have shaped computing technology and practice.", "Material artifacts will form a core element of the course.", "STV 210: View requirements for STV 210", "It’s a combination of STV-like concepts and historical concepts.", "The goal for this course is to appreciate how the history of computing can be used to better understand the interaction between technology and society today and in the future.", "*", "*", "*", "*", "*", "*", "*", "*", "You don’t need to buy it!", "An electronic version is available though the library, and we’re only reading some of the chapters.", "The activities allow you to practice with concepts and prepare you for assignments.", "Each group submits a summary of their discussion before leaving for the night, and each student in the group will share the grade.", "Self-Assessments", "There’s no shame!", "I know it can feel embarrassing to ask for help, but I seriously don’t mind helping everyone.", "Extensions", "Gender-inclusive language", "Gender-inclusive and fair language should be used in the interests of precision and politeness.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 37, "course_code": "HIST 216", "course_name": "HIST216 - From Gutenberg to Zuckerberg: A (Long) History of the Internet (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["This course contextualizes the information age around us: it examines both the technological story of the rise of the Internet, and the longer human story about the evolving concept of information, communication over time and space, and the ubiquity and complexity of the systems at the heart of our globalized world.", "the invention and impact of the printing press,", "define the basic concepts of historical thinking,", "explain the factors that led to the historical development of the Internet,", "analyze contemporary policy debates through an understanding of historical context by producing critical readings of news coverage and opinion pieces,", "develop and apply your communication skills through critical readings and synthesis of secondary sources and archived documents.", "A good reference for citation formatting can be found at The Chicago Manual of Style Online.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 38, "course_code": "HLTH 420", "course_name": "HLTH420 - Health and the Built Environment (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["08:30AM - 09:50AM EV2 2002", "Dr. Adrian Buttazzoni", "Students will learn the history and evolution of both public health and urban planning professions and academic disciplines and gain an appreciation of the theories and methods used in each.", "Introduction", "This course will trace the history and evolution of both professions, academic disciplines, and will compare both theory and methods used.", "Compare planning and public health perspectives on: history and the evolution of the disciplines; theory; methods; power and jurisdiction", "Identify and analyze interactions between natural and built environment characteristics and human health and disease", "Demonstrate interdisciplinary collaboration skills and articulate the benefits of interdisciplinary group work", "Articulate equity considerations of planning decisions and explain the extent to which equity may or may not be important in planning", "Gather and synthesize evidence and develop data-driven predictions of future urban trends.", "Online lecture material covers conceptual and empirical examples/case studies of environment and health relationships.", "Students are responsible for completing the required readings each week, and for keeping informed about course information through LEARN.", "Readings have been selected to provide a balance of breadth and depth into important course concepts.", "Jan 8 Module 1: Introduction to the Course, Equity", "Module 2: History and Evolution of Planning and Public Health", "Introduction to the Future Cities Institute", "Module 3: Theory in Planning and Public Health", "Feb 10, 12 Module 6: Cardiovascular, Muscular, and Skeletal Systems and the Built Environment", "Feb 24, 26 Module 7: Digestive System and the Built Environment", "Mar 17, 19 Module 10: Climate Change and Physiological Systems", "The role of behavioral science theory in development and implementation of public health interventions.", "Commentary: alternative cultures in planning research—from extending scientific frontiers to exploring enduring questions.", "Should planners create hierarchies of evidence?", "The value of Twitter data for determining the emotional responses of people to urban green spaces: A case study and critical evaluation.", "Supervised injection facilities in Canada: past, present, and future.", "Rather than reading on your own, we will be using Perusall – a software designed for collaborative reading where you will be annotating, questioning, and commenting on the assigned readings in groups of students.", "The completion of readings and your level and quality of engagement establish your grade.", "Remember you are communicating a complex topic to a general audience, so you will want to find a balance between the depth and accessibility of information presented.", "Be creative!", "The purpose of this exercise is to familiarize students with having to analyze and communicate complex environment and health topics to general (i.e., non-expert) audiences that in contemporary society often do not read policy reports but rather engage fact sheets, infographics, executive summaries, and other forms of high-level communications.", "Examples of fact sheets/infographics can be found on the CDC website (Spotlight Infographic section) or via these links to infographics about heart disease, adolescent health, and health status and determinants.", "You will be presenting the findings of your final reports to a guest panel of Future Cities Representatives.", "*Detailed assignment instructions can be found on LEARN", "Fact Sheet and Issue Summary", "Short-term absence declarations will be dealt with in the following ways:", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Reading the syllabus: Professors spend a LOT of time and energy creating syllabi that we think are clear, and let students know what to expect and how to prepare.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 39, "course_code": "INDEV 262", "course_name": "INDEV262 - Introduction to Global Emerging Cities (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Notice of Recording", "Introduction to Global Emerging Cities Fall 2024", "08:30AM - 09:20AM", "UTD 201A", "09:30AM - 10:20AM UTD 201A", "10:30AM - 11:20AM UTD 201A", "08:30AM - 09:20AM", "UTD 201A", "09:30AM - 10:20AM UTD 201A", "10:30AM - 11:20AM UTD 201A", "Articulate the causes, as well as the opportunities and consequences, of urban development globally", "Explain the differing global contexts in which urban policy and planning are contextualized and the differing ways in which planning and policy have been employed", "Identify how the physical characteristics that make up a city can produce patterns of inequality", "Recognize how marginalized groups engage with processes of social inclusion and exclusion", "Demonstrate the connection between urban infrastructure and urban livability", "2 The forces that shape cities", "3 The role of the state in development", "5 Alternative paths to economic growth", "6 Smart cities: The role of technology in urban planning and governance", "8 Seeing the city through the eyes of women and youth", "10 ‘Green’ infrastructure in emerging cities", "11 Physical infrastructure in emerging cities", "Urbanization in a Global Context.", "Read relevant textbook chapters before lectures.", "Notice of Recording", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 40, "course_code": "LS 413", "course_name": "LS413 - Surveillance and Society (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Notice of Recording", "Surveillance and Society Fall 2024", "SEM", "I am an Associate Professor in the Department of Sociology & Legal Studies and at the Stratford School of Interaction Design and Business.", "I am in the second year of my master’s program in Sociology and Legal Studies.", "Questions of a personal nature", "Reviews of draft writing before submission", "Every student is encouraged to introduce themselves to me before October 29 by attending a drop-in session and saying hello, or booking a one-on-one appointment.", "An examination of the way monitoring technologies alter and shape social life in terms of security, fear, control, and vulnerability.", "Some of the topics covered in the course include differential access and exclusion mechanisms enabled by online surveillance, predictive marketing using big data algorithms, racialized classification schemes and a host of monitoring technologies in online spaces, workplaces, and the home.", "Readings will be drawn from the social sciences and popular media to facilitate critical inquiry into the shaping of popular perceptions about the surveillance and social control.", "Communicate, describe, and debate topics related to how surveillance operates in social contexts, particularly how it comes to influence everyday life.", "Analyse both academic and popular writing and reporting on surveillance and privacy, and synthesize core themes in written reflective summaries.", "Week 1 Module 0: Introduction to the Course", "All readings and media and links to discussion forums are posted in these content modules.", "Late Policies and Extension Requests", "VIF self-declarations cannot be “stacked” to extend beyond these 5 days.", "You do NOT need to make a formal extension request.", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "Notice of Recording", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Do you want professors and interviewers to call you by a different first name?", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Plagiarism & Copyright Policy", "In this case, the authors decide how you can use their content.", "This course includes the independent development and practice of specific skills, such as critical reading skills, assessing the structure and quality of written arguments, making connections between different authors, and participating in unscripted seminar discussions and debates online.", "Library for research-based assignments", "Intellectual property includes items such as:"]}, {"course_id": 41, "course_code": "PACS 301", "course_name": "PACS301 - Special Topics in Peace and Conflict Studies 1 (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Associate Professor of Peace and Conflict Studies", "Territorial Acknowledgement: As we will discuss in this course, the Western criminal legal system and its institutions and mechanisms of incarceration, control and confinement are rooted in settler colonialism and chattel slavery as well as white supremacist values and ethics.", "It is critical for us to grapple with the persistence of settler colonialism and the afterlives of slavery.", "we must understand the imperative nature of", "We must face the fact that much of our current system", "for responding to deadly local and international conflict", "is incapable of overcoming cycles of violent patterns", "precisely because our imagination has been corralled and shackled", "by the very parameters and sources that create and perpetuate violence.\"", "- John Paul Lederach, Anabaptist peace scholar in", "How have religion and religious values contributed to policing and incarceration in Canada and the U.S., and their especially deadly impacts on Black and Indigenous lives?", "How can anti-racist, decolonial and feminist approaches to moral imagination enable the potential abolition of policing and prisons, and the creation of a new society in which safety is not premised on violence?", "Students actively engaged in reading and class will benefit most from this course.", "Explain the role of religious, settler colonial and white supremacist imaginations in the creation and expansion of policing and prisons in Canada and the U.S.", "Describe how and why* activists, scholars, and social movements envision the abolition of carceral systems and institutions as critical to peace and justice.", "Assess moral values, principles and practices shared by abolitionist movements in relation to their potential to generate safety, healing and accountability.", "We will give greater attention to the substance of abolitionist dreaming and the moral compass that guides these visions.", "Religion, Justice, and the Abolition of Prisons /Joshua Dubler and Vincent Lloyd.", "Imagined Futures Project 25%", "C: Critique of ideas in the text(s): What do you want to affirm as well as challenge?", "In addition to offering focused contributions, demonstrate reflective listening and be mindful of nonverbal communication.", "Per the analysis of Joshua Dubler and Vincent Lloyd among other activist-scholars, incarceration is not only positioned as a political and economic solution to societal challenges but also a moral and ethical solution.", "Depict a future in which carceral systems and institutions no longer exist and there are solutions and strategies guided by emancipatory morals and values that address societal challenges of direct and structural violence.", "Your project should clearly depict the solution(s) including specific strategies and practices and the values that they reflect.", "The non-carceral future you depict must also be directly informed by solutions, strategies, practices and values within contemporary abolitionist movements, particularly those rooted in Black radical feminisms.", "Annotations should be 75 - 150 words each.", "However, some formats such as speculative fiction are better suited for novices than those that require advanced technical skills.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "This course includes the independent development and practice of specific skills, such as critical reading and analysis, synthesis, and visualization.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Intellectual property includes items such as:"]}, {"course_id": 42, "course_code": "PACS 302", "course_name": "PACS302 - Special Topics in Peace and Conflict Studies 2 (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Notice of Recording", "09:00AM - 10:50AM CGR 1300", "Email: judith.koeller@uwaterloo.ca", "Note: a motivated first year student can take and succeed in this course.", "Math For Good and Evil is built on the conviction that the kinds of problems mathematicians and computer scientists seek to address, and the ways they address them, should matter for anyone interested in advancing peace in the world.", "The peace implications of math and computer science are explored in connection to topics such as wealth, democracy, policing, oppression, environment, and health.", "Math and computer science are tools of enormous and increasing power that impact our daily lives in thousands of ways that we seldom recognize.", "Many of the ways that these disciplines have affected us are very beneficial and have transformed the lives of millions of people for the better.", "Without peace studies understanding how math can be appropriately harnessed for good, peace theory will be inadequate to prepare students for the twenty-first century.", "Assigned readings and videos", "Videos and on-line discussions by course instructor and some guest presenters", "Articulate the potential of collaborations between peace studies and mathematics to benefit society.", "Describe how math and computer science can be leveraged to better serve the interests of society.", "Evaluate the peace implications of specific mathematical work.", "Course Introduction", "Democracy and Politics", "March 24", "By the last class, write a first draft of your Media Report (see detailed instructions).", "Explore its stakeholders and peace implications.", "Your contribution to Perusall must be sufficiently different from other contributions by your peers, and your ideas must be clear and well-supported.", "Notice of Recording", "Please consider how taking this course and having its materials on your computer might impact your safety.", "Formatting guidelines", "Accommodation for Illness", "Important announcements such as the cancellation of class will also be posted there, so please check the site before each class, just in case.", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website"]}, {"course_id": 43, "course_code": "PHIL 208", "course_name": "PHIL208 - Philosophy Through Science Fiction (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["11:30AM -", "Prof. Katy Fulfer", "I have in-person drop-in student meeting time in Hagey Hall 324 on Mondays from 4-4:30 p.m.", "You will be put in a waiting room when you join the Zoom call.", "I usually respond to emails within 48 hours, Monday-Friday.", "As a settler scholar and a relatively new Canadian, it is important for me to acknowledge forces of colonization, both historical and ongoing.", "Science fiction depicts alternate and weird possibilities.", "We will explore philosophical themes and learn how to evaluate philosophical arguments as they appear in science fiction media, especially in short stories, film, and television.", "Practice patience and compassion (towards yourself and others)", "Be aware that some topics may bring up painful experiences for some members of class (and we cannot always predict what these topics may be).", "Supports", "Solarpunk and Care Ethics, with MA student Kyra Woodend!", "\"A Solarpunk Manifesto\" (804 words)", "The Star Trek franchise streams in Canada through Paramount+.", "Binti", "Attendance and labour in class Opportunities in and out of class for meaningful labour", "Complete five SFCs", "Regularly make substantive contributions to class", "Trust yourself and challenge yourself to enhance the experience of the class as a whole.", "I have been influenced by many people to challenge colonial structures of assessment, and I am grateful to my colleague Kevin Carey, from whom I adapted the language used above.", "Scenes for Consideration", "Each SFC will correspond to a particular reading assigned for the course.", "Because there are multiple opportunities to submit SFCs, these assignments will not be accepted late.", "Your description of the scene should be concise yet thorough enough to motivate the connection with the issue you summarized.", "These are just examples of what kinds of questions you might pose.", "If I select your question for discussion in class, you should consider that to be a meaningful contribution!", "Write a critical review of a piece of science fiction media (600-750 words), highlighting it's philosophical dimensions and evaluating how well that issue is tackled in the piece of media.", "There will be a no-penalty grace period for submission until Tuesday, February 18 at 10 a.m.", "Write a book or film club guide for a piece of science fiction.", "Your guide should include a critical introduction to the philosophical issues, discussion questions, and suggestions for other reading and viewing.", "There will be a no-penalty grace period for submission until Monday, April 7, 10 a.m.", "Self-Assessment", "There will be a no-penalty grace period for submission until Monday, April 21, 10 a.m.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 45, "course_code": "PHIL 226", "course_name": "PHIL226 - Biomedical Ethics (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Biomedical Ethics Winter 2024", "I will have in-person drop-in office hours on Mondays and Wednesdays 1:15-2:15 in Hagey Hall 322A. You can also request an appointment by emailing me and letting me know your availability as well as whether you prefer virtual or in-person.", "If you are in a debate club, your goal is to defeat your opponent.", "Philosophy is not a debate club.", "First, I will describe the overall structure of the course.", "There will be a multiple choice Learn quiz on Unit 1.", "Third, we spend three classes learning about some general ethical concepts relevant to bioethics: utilitarianism, care ethics, and relational autonomy.", "One is a multiple choice Learn quiz on the readings from the first four classes of Unit 2.", "Just like in Unit 2, there will be a multiple choice Learn quiz on the readings from the first four classes, an in-class test that guides you into writing a first rough draft of your essay, and an essay assignment.", "Unit 1: Some Examples of Ethical Reasoning and Argumentation", "In-Class Test that will have questions that guide you into writing a first rough draft of Essay 1", "I will bring a small number of printed copies for borrowing.", "In A Companion to Bioethics, 2nd edition, edited by Helga Kuhse and Peter Singer, 85-90.", "In The Feminist Health Care Ethics Research Network, Susan Sherwin Coordinator, The Politics of Women’s Health: Exploring Agency and Autonomy, 19-47.", "“Conscientious Objection in Medicine: Accommodation versus Professionalism and the Public Good.”", "“The Best Interests Standard as a Logic of Empire: Unpacking the Political Dimensions of Parental Refusal.”", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Monday March 25", "It is a multiple choice quiz that should not take too long to complete.", "Instructions for the In-Class Tests", "An In-Class Test will have questions that guide you into writing a first rough draft of your essay", "You should study one reading from the first six classes of the relevant Unit", "I will bring a small number of printed copies for borrowing.", "A test that is assessed as Pass receives a grade of 50.", "A test that is assessed as Fail receives a grade of 0.", "Instructions for the Essays", "Introduction (about 75-125 words)", "You are not allowed to use GenAI during the In-Class Tests that guide you into writing a first rough draft of your essay, but you are allowed to use GenAI during the process of getting from your first draft to your final version of your Essay.", "Every philosopher I have met says this.", "Talking - Yes", "Getting Suggestions - No", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:"]}, {"course_id": 46, "course_code": "PHIL 252", "course_name": "PHIL252 - Quantum Mechanics for Everyone (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Quantum Mechanics for Everyone Fall 2024", "This course offers an introduction to the basic concepts of quantum mechanics from a historical and philosophical perspective.", "SCI 252: View requirements for SCI 252", "Explain how quantum physics differs from classical physics", "Identify and summarize scientific results described in advanced popular science accounts presented in a variety of media (e.g., print, videos)", "Formulate appropriate critical questions in response to philosophical and historical texts and multimedia materials", "A current version of the Schedule of Topics and Readings is available on LEARN.", "This course includes the independent development and practice of specific skills, such as formulating and evaluating arguments.", "Library for research-based assignments", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Cross-listed courses"]}, {"course_id": 47, "course_code": "PHIL 256", "course_name": "PHIL256 - Introduction to Cognitive Science (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Introduction to Cognitive Science Winter 2025", "samuel.johnson@uwaterloo.ca", "Explain key theories and models concerning mind and intelligence", "These include computation (mental representations and processes), the substrates that perform those computations (brains and silicon), the processes that led to those computations (evolution and development), and the broader environment in which those processes are embedded.", "Ingredients III", "Perceptual Intelligence II", "Linguistic Intelligence III", "Conceptual Intelligence I  How we we use processes such as categorization and reasoning to make sense of the world and guide our decisions.", "Conceptual Intelligence III", "Social Intelligence I  Aspects of human intelligence, such as cooperation and culture, that reside in our doing things in groups.", "Social Intelligence II", "Social Intelligence III", "Submission method", "Cross-listed courses", "Intellectual property includes items such as:", "Sona Participation and Research Experience Marks", "Students may complete any combination of these options to earn research experience grades Credits will be permitted to be earned with a maximum of half from online, and the other half (2.0) from In-lab or Remote Access studies (In Lab studies can however go over the limit up to the total of 4.0)", "Participation enables students to learn first-hand about psychology research and related concepts.", "• You can schedule your In-Person studies through SONA as well but please note the time and location", "Educational focus of participation in research", "To maximize the educational benefits of participating in research, students will receive feedback information following their participation in each study detailing the following elements:", "• Provisions to ensure confidentiality of data", "**", "• Identify the psychological concepts in the article and indicate the pages in the textbook that are applicable.", "• Clearly evaluate the application or treatment of those concepts in the article.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 49, "course_code": "PHIL 271", "course_name": "PHIL271 - Special Topics (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Scientists have conducted research on these questions!", "Through reading and discussing philosophical, scientific, and policy work, as well as engaging popular media, students will develop their understanding of research ethics, scientific practice, and the interactions between science and social values while learning about the relationships between humans and our canine companions.", "Skills", "Appreciate the biology of canine behavior and learning.", "Recognize the role of values in scientific research.", "Attitudes", "Demonstrate intellectual rigor when assessing values and scientific knowledge.", "Demonstrate compassion for both dogs and people.", "Module 1: Introduction", "Module 3: Values in science / canine olfaction and consciousness", "Students do not have additional costs for course readings and materials because the University Library bears the costs of providing these materials.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "This course includes the independent development and practice of specific skills, including critical thinking, and developing and expressing ethical and analytic judgments.", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 50, "course_code": "PHIL 358", "course_name": "PHIL358 - Topics in Philosophy of Science (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Scientific Realism & Anti-Realism Winter 2024", "Describe and evaluate a range of positions in the scientific realism--anti-realism debate", "Use effective research strategies to select a topic for a philosophy paper", "A current version of the Schedule of Topics and Readings is available on LEARN.", "These readings can be accessed through the LEARN course web site.", "Copies of these readings must be brought to class.", "Short Papers", "This course includes the independent development and practice of specific skills, such as formulating and evaluating arguments.", "Library for research-based assignments", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:"]}, {"course_id": 54, "course_code": "PLAN 262", "course_name": "PLAN262 - Introduction to Global Emerging Cities (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Notice of Recording", "Introduction to Global Emerging Cities Fall 2024", "08:30AM - 09:20AM", "UTD 201A", "09:30AM - 10:20AM UTD 201A", "10:30AM - 11:20AM UTD 201A", "08:30AM - 09:20AM", "UTD 201A", "09:30AM - 10:20AM UTD 201A", "10:30AM - 11:20AM UTD 201A", "Articulate the causes, as well as the opportunities and consequences, of urban development globally", "Explain the differing global contexts in which urban policy and planning are contextualized and the differing ways in which planning and policy have been employed", "Identify how the physical characteristics that make up a city can produce patterns of inequality", "Recognize how marginalized groups engage with processes of social inclusion and exclusion", "Demonstrate the connection between urban infrastructure and urban livability", "2 The forces that shape cities", "3 The role of the state in development", "5 Alternative paths to economic growth", "6 Smart cities: The role of technology in urban planning and governance", "8 Seeing the city through the eyes of women and youth", "10 ‘Green’ infrastructure in emerging cities", "11 Physical infrastructure in emerging cities", "Urbanization in a Global Context.", "Read relevant textbook chapters before lectures.", "Notice of Recording", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 55, "course_code": "PLAN 333", "course_name": "PLAN333 - Neighbourhood and Community Planning (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["02:30PM - 05:20PM", "B. Doucet", "02:30PM - 05:20PM", "B. Doucet", "Brian Doucet", "Dr. Doucet is a frequent commentator in the media and has experience and expertise speaking with a wide range of audiences about many important urban topics.", "This course examines concepts and issues related to social planning for neighbourhood and community environments.", "It considers planning for particular target populations in the contexts of gentrification, suburbanization and core area revitalization.", "This course normally includes a field component.", "Introduction", "As citizens of the city, we bear witness to these changes; in our own neighbourhoods, subtle and not-so-subtle changes can be seen by observing the world around us.", "Understanding the drivers of neighbourhood change and how these processes manifest themselves in different places are the core issues in this course.", "Cities and neighbourhoods are constantly changing and there are no shortages of plans and ideas to shape those change.", "We will also ask ourselves what role planners play in shaping trajectories of neighbourhood change.", "Rather than being a nuts and bolts planning course, we will instead use a variety of case studies and empirical examples to better understand the theoretical and social contexts in which neighbourhood and community planning operate.", "Understand key concepts and theories of neighbourhood change", "Understand the influence of neighbourhoods on a variety of factors such as economic opportunities, segregation, mobility choices and voting behaviour", "To develop research skills through the analysis of census data, planning reports, observations and literature", "To place specific case studies and places within wider theoretical and empirical contexts", "To develop observational skills to be able to link our own observations and experiences about neighbourhood change to key theoretical and conceptual issues", "Learning Modes and Expectations", "This course will be taught in-person, using a combination of lectures, student-led walking tours, field trips and guest contributions.", "This will be done in groups and the assignment will consist of a walking tour and a report.", "Sequence of Course Topics & Readings", "Readings", "14 December", "Midtown walking tour & Kitchener City Hall visit (guest contribution by Justin Readman, General Manager, development services, City of Kitchener)", "The ‘hidden’sides of transit-induced gentrification and displacement along Waterloo Region’s LRT corridor.", "Enduring features of the North American suburb: Built form, automobile orientation, suburban culture and political mobilization.", "Gentrification, suburban decline, and the financialization of multi-family rental housing: The case of Toronto.", "Upzoning Chicago: Impacts of a zoning reform on property values and housing construction.", "TBA", "Lecture: neighbourhoods and transportation", "Transit-oriented development and suburban gentrification: A “natural reality” of refugee displacement in Metro Vancouver.", "Waterloo and Hamilton case studies (guest lectures by Rebecca Mayers and Emma McDougall)", "Op-ed writing", "Guest contribution by Pamela Smyth, University of Waterloo media relations manager", "Student-led walking tours I & II", "Student-led walking tours III & IV", "Student-led walking tours V & VI", "Writing informed and well-researched articles in the media is an effective way to do this.", "To help, we will have a guest presentation from a member of the University’s Media Relations department.", "Students are encouraged to read scholarly book reviews to get a sense of the tone and scope of such a review.", "Information for these tours should come from a variety of sources, including census data, planning/advocacy reports, scholarly research, and media articles.", "Assessment will also be based on a clear demonstration of knowledge of key course literature and how it relates to their area.", "This essay should be focused and would normally consist of a theoretical/literature component and a case study, drawn either from the class, or from the student's own interest.", "The complete style outline can be found in the Publication Manual of the American Psychological Association, located in the reference section in Dana Porter Library, or on sale in the Book Store.", "APA Frequently Asked Questions - http://www.apastyle.org/learn/faqs/", "University of Wisconsin-Madison Writing Centre: http://www.writing.wisc.edu", "Students do not need to ask the instructor in advance to use these grace days.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 56, "course_code": "PLAN 431", "course_name": "PLAN431 - Issues in Housing (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["View requirements for PLAN 431", "An examination of social planning and policy issues associated with Canada's housing system, considering the roles of various levels of government and the private sector in developing socially sustainable, affordable housing.", "We use case study methods to examine the redevelopment of social housing.", "This course normally includes a fee component.", "A central emphasis will on the political-economic factors that shape how housing is distributed and experienced in the contemporary city, and how the provision and development of housing relates to social justice in the city.", "Week 1 (Jan. 8) - Introduction: The Value of Housing", "Film Week", "Students can purchase a physical copy from the Wstore for $33.95 via this link: https://lb.ca/cgi-bin/cgiwrap/additem.bbx?/Z109991/I9781804294949", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 57, "course_code": "PLAN 432", "course_name": "PLAN432 - Health and the Built Environment (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["08:30AM - 09:50AM EV2 2002", "Dr. Adrian Buttazzoni", "Students will learn the history and evolution of both public health and urban planning professions and academic disciplines and gain an appreciation of the theories and methods used in each.", "Introduction", "This course will trace the history and evolution of both professions, academic disciplines, and will compare both theory and methods used.", "Compare planning and public health perspectives on: history and the evolution of the disciplines; theory; methods; power and jurisdiction", "Identify and analyze interactions between natural and built environment characteristics and human health and disease", "Demonstrate interdisciplinary collaboration skills and articulate the benefits of interdisciplinary group work", "Articulate equity considerations of planning decisions and explain the extent to which equity may or may not be important in planning", "Gather and synthesize evidence and develop data-driven predictions of future urban trends.", "Online lecture material covers conceptual and empirical examples/case studies of environment and health relationships.", "Students are responsible for completing the required readings each week, and for keeping informed about course information through LEARN.", "Readings have been selected to provide a balance of breadth and depth into important course concepts.", "Jan 8 Module 1: Introduction to the Course, Equity", "Module 2: History and Evolution of Planning and Public Health", "Introduction to the Future Cities Institute", "Module 3: Theory in Planning and Public Health", "Feb 10, 12 Module 6: Cardiovascular, Muscular, and Skeletal Systems and the Built Environment", "Feb 24, 26 Module 7: Digestive System and the Built Environment", "Mar 17, 19 Module 10: Climate Change and Physiological Systems", "The role of behavioral science theory in development and implementation of public health interventions.", "Commentary: alternative cultures in planning research—from extending scientific frontiers to exploring enduring questions.", "Should planners create hierarchies of evidence?", "The value of Twitter data for determining the emotional responses of people to urban green spaces: A case study and critical evaluation.", "Supervised injection facilities in Canada: past, present, and future.", "Rather than reading on your own, we will be using Perusall – a software designed for collaborative reading where you will be annotating, questioning, and commenting on the assigned readings in groups of students.", "The completion of readings and your level and quality of engagement establish your grade.", "Remember you are communicating a complex topic to a general audience, so you will want to find a balance between the depth and accessibility of information presented.", "Be creative!", "The purpose of this exercise is to familiarize students with having to analyze and communicate complex environment and health topics to general (i.e., non-expert) audiences that in contemporary society often do not read policy reports but rather engage fact sheets, infographics, executive summaries, and other forms of high-level communications.", "Examples of fact sheets/infographics can be found on the CDC website (Spotlight Infographic section) or via these links to infographics about heart disease, adolescent health, and health status and determinants.", "You will be presenting the findings of your final reports to a guest panel of Future Cities Representatives.", "*Detailed assignment instructions can be found on LEARN", "Fact Sheet and Issue Summary", "Short-term absence declarations will be dealt with in the following ways:", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Reading the syllabus: Professors spend a LOT of time and energy creating syllabi that we think are clear, and let students know what to expect and how to prepare.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 59, "course_code": "PLAN 440", "course_name": "PLAN440 - Urban Services (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["This course will explore the interconnections and cascading effects of urban infrastructure services (waste and water systems, power grids, transport networks, digital circuits) and the politics of planning for urban services in global and globalizing cities across the globe.", "Students will examine, in particular, the impact of climate change, and our collective responses to it, on the delivery of urban services and the role of progressive planning and policy in mediating infrastructure disruptions and disasters.", "Understand the interconnected nature of urban infrastructures within and across cities;", "Connect current infrastructure issues/debates to planning and related urban theories;", "Apply key concepts to real world practice in various locales; and,", "Hone oral communication skills through peer-facilitated discussion of case material", "Neoliberalism", "Infrastructures of liberal life: From modernity and progress to resilience and ruins.", "Differential social impacts", "Water insecurity in Ontario first nations: An exploratory study on past interventions and the need for indigenous water governance.", "Hazards", "Disasters", "Place-making", "Urban political ecology", "Planning theory & practice, 21(3), 343-348.", "Infrastructure Futures: Centering decolonization and equity", "Informal infrastructure", "The collision of faith and economic development in Toronto’s inner suburban industrial districts.", "Social & Cultural Geography, 17(5), 667-693.", "Adaptation pathways", "Sustainable future scenarios", "A critique of resilience and climate-resilient development.", "Nature based solutions", "Hurricane Sandy and adaptation pathways in New York: Lessons from a first-responder city.", "Urban transformative potential in a changing climate.", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 60, "course_code": "PSCI 432", "course_name": "PSCI432 - Global Environmental Governance (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["02:30PM - 05:20PM", "Email Address: andrea.collins@uwaterloo.ca", "The history of international environmental politics will be reviewed, specific organizations and other actors involved in global environmental governance will be examined and the management of particular global environmental challenges investigated.", "ERS 404: View requirements for ERS 404", "Though efforts are made at all levels of society to address environmental issues, many of the challenges we face require transboundary coordination and governance.", "Students will learn about conventional sites of state-based governance, international organizations and agencies as well as emerging forms of governance, including private governance and the role of non-state actors.", "Students will develop a sense of the various political interests that influence global environmental governance and the challenges to enacting effective governance.", "Define and apply key concepts in contemporary global governance", "Describe the different kinds of global governance actors and their roles", "Understand global environmental issues and the presence or absence of appropriate governance mechanisms", "Analyze different forms of global environmental governance and assess their effectiveness", "Communicate key political challenges through both writing and public presentation", "+ A Short History of Grappling with Global Environmental Problems", "This week will introduce students to the overarching theme of the course – specifically that ‘governance’ is a flexible and contested term – and introduce some core ideas about global governance.", "“Responsibilities in Transition: Emerging Powers in the Climate Change Negotiations.”", "China as a ‘Partial’ Environmental Great Power.", "“Big Brand Sustainability: Governance Prospects and Environmental Limits.”", "Week 5 – Feb. 5 – Non-Governmental Organizations, Social Movements, Experts, and Civil Society & Modes of Non-state Governance", "“Is the Power of Brand-Focused Activism Rising?", "The Convention on International Trade in Endangered Species of Wild Fauna and Flora (CITES)", "Thematic Focus: North-South relations in global environmental governance", "Week 9 – March 12 – Ecosystems & Change: Deforestation and Land Degradation", "Thematic Focus: Role of non-state actors in global environmental governance.", "“Agency Shifts in Agricultural Land Governance and Their Implications for Land Degradation Neutrality.”", "muse.jhu.edu/article/168279", "Thematic Focus: Environmental justice and/or North-South relations", "Thematic Focus: fragmentation of environmental governance", "Morin, Jean-Frédéric & Orsini, Amandine.", "It contains short descriptions of key concepts that you may refer to in your reading for further clarification.", "Mid-term Test - Held in-person 25%", "Write a short 300-word original reflection of your thoughts about ideas/concepts in the weekly readings and emailing it to me before the next week begins (i.e. by Monday morning at 9 a.m.).", "Peer- Evaluation and Self-Assessment:", "I will provide resources to help you and your research partner(s) to communicate and collaborate, but you are ultimately responsible for resolving issues and solving problems.", "In addition, this document must also include a 100–150 word peer-evaluation of each research partner(s)’s performance and the nature of your collaboration this term.", "A clear description of your research topic: the issue and/or global agreements you have been assigned.", "Be well-organized and memorable with a clear learning outcome (i.e. what is the one thing you want the class to remember from your lesson).", "Each lesson should be 30 - 40 minutes in length.", "Additional time will be allotted for follow-up questions from the class and the instructor, so your entire time in front of the class may be up to 75 minutes.", "Instead, your analysis will demonstrate your understanding of the various actors and dynamics in global environmental governance.", "Please include a separate references page.", "Your references pages do not count towards the overall word count.", "Be sure that your research encompasses the study of global politics and governance and not just the scientific literature about your research area.", "The whole team will also need to attend an in-person meeting with me to discuss your research findings and contributions to the paper in the week before the end of the term.", "The exam will be held in-person during the exam period.", "Please be sure to refer to these when you are preparing your Team's lectures and when participating in class discussions.", "Engage in healthy debate:", "Don't interrupt when someone is speaking", "An engaged facilitator", "Prompts for discussion", "Opportunity to write ideas first", "Space for people to explore/explain ideas using their own experience and knowledge", "Organized slides", "clear headings", "summaries", "Late take-home exams will not be accepted after the grace period ends and will earn a grade of zero.", "Life happens and often interrupts our best laid plans for the term.", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Cross-listed courses", "This course includes the independent development and practice of specific skills, such as reading and analysis.", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 62, "course_code": "PSYCH 256", "course_name": "PSYCH256 - Introduction to Cognitive Science (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Introduction to Cognitive Science Winter 2025", "samuel.johnson@uwaterloo.ca", "Explain key theories and models concerning mind and intelligence", "These include computation (mental representations and processes), the substrates that perform those computations (brains and silicon), the processes that led to those computations (evolution and development), and the broader environment in which those processes are embedded.", "Ingredients III", "Perceptual Intelligence II", "Linguistic Intelligence III", "Conceptual Intelligence I  How we we use processes such as categorization and reasoning to make sense of the world and guide our decisions.", "Conceptual Intelligence III", "Social Intelligence I  Aspects of human intelligence, such as cooperation and culture, that reside in our doing things in groups.", "Social Intelligence II", "Social Intelligence III", "Submission method", "Cross-listed courses", "Intellectual property includes items such as:", "Sona Participation and Research Experience Marks", "Students may complete any combination of these options to earn research experience grades Credits will be permitted to be earned with a maximum of half from online, and the other half (2.0) from In-lab or Remote Access studies (In Lab studies can however go over the limit up to the total of 4.0)", "Participation enables students to learn first-hand about psychology research and related concepts.", "• You can schedule your In-Person studies through SONA as well but please note the time and location", "Educational focus of participation in research", "To maximize the educational benefits of participating in research, students will receive feedback information following their participation in each study detailing the following elements:", "• Provisions to ensure confidentiality of data", "**", "• Identify the psychological concepts in the article and indicate the pages in the textbook that are applicable.", "• Clearly evaluate the application or treatment of those concepts in the article.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 65, "course_code": "SCI 252", "course_name": "SCI252 - Quantum Mechanics for Everyone (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Quantum Mechanics for Everyone Fall 2024", "This course offers an introduction to the basic concepts of quantum mechanics from a historical and philosophical perspective.", "SCI 252: View requirements for SCI 252", "Explain how quantum physics differs from classical physics", "Identify and summarize scientific results described in advanced popular science accounts presented in a variety of media (e.g., print, videos)", "Formulate appropriate critical questions in response to philosophical and historical texts and multimedia materials", "A current version of the Schedule of Topics and Readings is available on LEARN.", "This course includes the independent development and practice of specific skills, such as formulating and evaluating arguments.", "Library for research-based assignments", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Cross-listed courses"]}, {"course_id": 67, "course_code": "SOC 232", "course_name": "SOC232 - Technology and Social Change (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Notice of Recording", "SOC 232", "I am an Associate Professor in the Department of Sociology & Legal Studies and at the Stratford School of Interaction Design and Business.", "Apply sociological theories and concepts to understand, examine, and critically evaluate how technology shapes, and is shaped by, social phenomena.", "Identify how digital technologies shape our interpersonal relationships and communities, in both positive and negative ways.", "Assigned readings and playlists may change through the term.", "Sept 12  Introduction to the Course No readings this week", "Sept 19 “Do guns kill people?", "In The Design of Everyday Things: Revised and Expanded Edition, Revised, Expanded ed. edition, 1–36.", "Do Artifacts Have Politics?", "Techno-social Designing.", "The Adoption and Diffusion of Technological Innovations", "Tragic Design: The Impact of Bad Product Design and How to Fix It (1st edition).", "Community in the Network Society", "Computer Love: Replicating Social Order Through Early Computer Dating Systems.", "Deviance in the Dark psychology experiment [", "Assigned readings and playlists may change through the term.", "85%+", "Summary of relevant material is minimal in favor of cross-cutting synthesis of ideas.", "Deep and critical engagement with course content.", "Submission shows overall unity but may meander.", "Satisfactory", "Response is a good effort but falls short of a comprehensive answer.", "Problems in logic and content are identifiable, and writing is weak or tend towards summary rather than critical analysis.", "Please use APA formatting and citation style.", "Late Policies and Extension Requests", "Self-declarations cannot be “stacked” to extend beyond these 5 days.", "Notice of Recording", "However, if Health & Safety protocols demand a shift away from in-person teaching and towards online teaching, some activities for this course may involve recording, in partial fulfillment of the course learning outcomes.", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Do you want professors and interviewers to call you by a different first name?"]}, {"course_id": 69, "course_code": "SOC 312", "course_name": "SOC312 - Sociology of Science (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["The Nature of Scientific Knowledge Fall 2024", "EV2 2069", "Email: Mathieu.feagan@uwaterloo.ca", "An examination of the social character of the development of science and the production of scientific knowledge.", "View requirements for SOC 312", "We will also talk with scientific experts about how they practice science and how those practices relate to the philosophical issues we’ve discussed.", "Explain different views of the nature of scientific knowledge", "2. Describe and discuss key issues regarding science and society", "3. Critically analyze a relevant epistemological issue", "Apply a course concept, theory, or idea to a real-world context", "Week 1: Introduction & Course Overview", "Earth systems science and the ozone crisis (Angus chapter 4 and 5)", "Week 6: Science & Values", "Week 12+: Course Reflection & Wrap-up", "Other activities are welcome!"]}, {"course_id": 70, "course_code": "SOC 413", "course_name": "SOC413 - Surveillance and Society (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Notice of Recording", "Surveillance and Society Fall 2024", "SEM", "I am an Associate Professor in the Department of Sociology & Legal Studies and at the Stratford School of Interaction Design and Business.", "I am in the second year of my master’s program in Sociology and Legal Studies.", "Questions of a personal nature", "Reviews of draft writing before submission", "Every student is encouraged to introduce themselves to me before October 29 by attending a drop-in session and saying hello, or booking a one-on-one appointment.", "An examination of the way monitoring technologies alter and shape social life in terms of security, fear, control, and vulnerability.", "Some of the topics covered in the course include differential access and exclusion mechanisms enabled by online surveillance, predictive marketing using big data algorithms, racialized classification schemes and a host of monitoring technologies in online spaces, workplaces, and the home.", "Readings will be drawn from the social sciences and popular media to facilitate critical inquiry into the shaping of popular perceptions about the surveillance and social control.", "Communicate, describe, and debate topics related to how surveillance operates in social contexts, particularly how it comes to influence everyday life.", "Analyse both academic and popular writing and reporting on surveillance and privacy, and synthesize core themes in written reflective summaries.", "Week 1 Module 0: Introduction to the Course", "All readings and media and links to discussion forums are posted in these content modules.", "Late Policies and Extension Requests", "VIF self-declarations cannot be “stacked” to extend beyond these 5 days.", "You do NOT need to make a formal extension request.", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "Notice of Recording", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Do you want professors and interviewers to call you by a different first name?", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Plagiarism & Copyright Policy", "In this case, the authors decide how you can use their content.", "This course includes the independent development and practice of specific skills, such as critical reading skills, assessing the structure and quality of written arguments, making connections between different authors, and participating in unscripted seminar discussions and debates online.", "Library for research-based assignments", "Intellectual property includes items such as:"]}, {"course_id": 72, "course_code": "STV 100", "course_name": "STV100 - Society, Technology and Values: Introduction (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Society, Technology and Values: Introduction Winter 2025", "STV 100", "S. Campbell", "TBA", "If that’s not a good time for you, just get in touch and let me know when you’re free to chat and I’ll do my best to find a mutual time to meet.", "This course examines the interaction of the technologies developed by a culture with the values and social organization of that culture.", "These views are then applied to a number of spheres of influence, including patterns of employment and the role of work; medicine and health; polity and economy; sustainable development and the environment.", "View requirements for STV 100", "Identify concepts and perspectives related to the interaction between technology and society, and classify examples.", "Identify embedded technological values and surrounding contexts.", "Assess their own technological perspectives and values within the context of their academic discipline and personal experience.", "*", "*", "*", "*", "*", "*", "*", "Supplies and laptop recommendations", "A new laptop should:", "Have a battery life that will last a long time.", "Several brands have a 10 to 12-hour battery life now.", "Pre-Knowledge Surveys", "The activities allow you to practice with concepts and prepare you for assignments.", "Each group submits a summary of their discussion before leaving for the night, and each student in the group will share the grade.", "Self-Assessments", "There’s no shame!", "I know it can feel embarrassing to ask for help, but I seriously don’t mind helping everyone.", "Extensions", "Gender-inclusive language", "Gender-inclusive and fair language should be used in the interests of precision and politeness.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 73, "course_code": "STV 201", "course_name": "STV201 - Society, Technology and Values: Special Topics (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["E5 6111", "Study of the interaction of society, technology and values in a particular topic area under tutorial guidance by visiting or adjunct faculty.", "The course does not require advanced technical knowledge and encourages students of all faculties to enroll.", "understand and apply a pluriversal perspective to technological and social considerations in their field of study.", "describe the social and environmental consequences of the current economic models of the Global North in the 21st century.", "facilitate meaningful conversations/encounters that allow for multiple ways of knowing and seeing the world to be expressed and valued.", "Translation and the power of language in structuring worlds/ontologies.", "Colonialism and Amazonia.", "Small groups will facilitate a workshop on a topic of their choosing from a selected set of themes/resources.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 74, "course_code": "STV 202", "course_name": "STV202 - Design and Society (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Design and Society Winter 2025", "Email: cshelley@uwaterloo.ca", "Email: js2kim@uwaterloo.ca", "View requirements for STV 202", "Topics include the nature of design, the social and cultural implications of design, the roles of designers in relation to the social contract, and design assessment in light of social values such as risk, fairness, progress, and sustainability.", "The course material provides a mixture of theoretical concepts and practical cases of their application.", "Describe concepts and perspectives relating to social and ethical aspects of good design.", "Analyze and evaluate designs in light of those concepts and perspectives.", "Compare concepts and perspectives and consider overlaps and differences among them.", "Reflect on the significance of social and ethical issues in their understanding of good design.", "The numbers in parentheses next to learning outcomes above refer to applicable Canadian Engineering Accreditation Board Engineering Graduate Attributes defined here: https://uwaterloo.ca/engineering/graduate-attributes", "Rational design & Social psychology.", "Social contracts & Agendas.", "Design and society: Social issues in technological design, Berlin: Springer.", "A 10-question, multiple-choice quiz is to be completed by each student on the course Learn site for each non-midterm module starting at the outset of week 2.", "Quiz questions each week relate to the textbook chapter(s) assigned for that week.", "Design discussions", "Discussions will take place each non-workshop week after week 1.", "Design presentations", "5 minutes) and may be chosen for viewing in subsequent classes.", "Midterms", "Midterm 1 covers chapters Good design through Culture, Midterm 2 covers chapters Social contract through Activism, and Midterm 3 covers chapters Risk through Sustainability.", "Grade exemptions", "To allow for situations not covered under the Late submissions policy (see below), each student’s lowest quiz, discussion,  presentation, and workshop grade will be dropped from the calculation of their overall grade in each of those categories.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 75, "course_code": "STV 205", "course_name": "STV205 - Cybernetics and Society (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Cybernetics and Society Spring 2024", "This course will present an overview of cybernetics from automation and robotics to prosthetics and wearable computing.", "The roles of men and women in a post-human era will be discussed along with related themes dealing with gender, cyberspace, politics, and popular culture.", "Apply analogical thinking to examine technologies from a functional as well as a social and cultural perspective.", "Assess the kinds of problems addressed by different kinds of technologies and reflect upon your own problem-solving experiences.", "Understand the basic concepts of cybernetics from a historical perspective and discuss issues concerning the development of technologies with someone from an academic discipline different from your own.", "On Thursday at 9:00pm ET, a multiple-choice quiz will be published that you must complete by Friday at 11:59pm ET.", "The study materials are a mix of book chapters and articles as well as video and audio clips.", "Each week, except the first week, in STV 205 will follow this pattern:", "Module 1.1 First-Order Cybernetics: Norbert Wiener, Margaret Mead, Feedback, Information and Analogy - May 9", "Module 2.1 Second-Order Cybernetics: Heinz von Foerster, the Observer and the Observed, Determinism versus Constructivism, and the Attention Economy - June 6", "Module 2.3: Big Data Algorithms, Surveillance Capitalism, and the Smart City - June 20", "Module 3.2: Utopia, Dystopia and Anti-Utopia? - July 11", "Systems Thinkers by Magnus Ramage/Karen Shipp Yes", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 76, "course_code": "STV 208", "course_name": "STV208 - Artificial Intelligence and Society: Impact, Ethics, and Equity (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Artificial Intelligence and Society: Impact, Ethics, and Equity Winter 2025", "The objective of this course is to introduce students to ethical and social concerns relating to Artificial Intelligence (AI).", "By understanding the basic principles of AI and its evolution, to engaging with complex issues like algorithmic bias and privacy concerns, this course offers a comprehensive look at both the promise and challenges AI brings to society.", "Through real-world case studies, students will analyze how AI systems influence industries, economies, and governance while learning to apply ethical frameworks that ensure fairness and accountability in AI deployment.", "The course is designed to not only equip students with the tools to evaluate the societal impacts of AI critically but also to empower them to actively engage in discussions about the future of technology and society.", "By the end of the course, students will be prepared to make informed contributions to the ongoing debates about the role of AI in shaping the future.", "Identify and explain key concepts related to the societal impacts of AI technologies, including ethical considerations, biases, and privacy concerns, and classify real-world examples where these issues arise.", "Compare different ethical frameworks and governance models for AI, and critically test their effectiveness in addressing issues such as fairness, accountability, transparency, and human rights.", "Evaluate the broader implications of AI on democracy, human rights, and socioeconomic systems, and assess how AI-driven innovations can either support or challenge social equity, ethical standards, and global governance structures.", "8 Socioeconomic Impacts of AI and Automation Mar 5 Mar 11", "12 The Future of AI: Ethical Design and Responsible Innovation Apr 2", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 77, "course_code": "STV 210", "course_name": "STV210 - The Computing Society (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["The Computing Society Fall 2024", "S. Campbell", "If that’s not a good time for you, just get in touch and let me know when you’re free and I’ll do my best to find time.", "It explores the impact and consequences of computing from a societal perspective, but also considers various nontechnical factors and values that have shaped computing technology and practice.", "Material artifacts will form a core element of the course.", "STV 210: View requirements for STV 210", "It’s a combination of STV-like concepts and historical concepts.", "The goal for this course is to appreciate how the history of computing can be used to better understand the interaction between technology and society today and in the future.", "*", "*", "*", "*", "*", "*", "*", "*", "You don’t need to buy it!", "An electronic version is available though the library, and we’re only reading some of the chapters.", "The activities allow you to practice with concepts and prepare you for assignments.", "Each group submits a summary of their discussion before leaving for the night, and each student in the group will share the grade.", "Self-Assessments", "There’s no shame!", "I know it can feel embarrassing to ask for help, but I seriously don’t mind helping everyone.", "Extensions", "Gender-inclusive language", "Gender-inclusive and fair language should be used in the interests of precision and politeness.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 78, "course_code": "STV 302", "course_name": "STV302 - Information Technology and Society (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Information Technology and Society Spring 2024", "S. Campbell", "But is this just a misplaced perception?", "Ultimately, what sort of technological values underpin the actions of IT creators and users?", "Identify, classify and analyze concepts and perspectives related to the interaction between information technology and society.", "Identify and analyze technological values of creators and users, and those embedded within information technology.", "Develop independent research questions, and communicate findings in written and verbal formats.", "Also, for any engineering undergraduates, the course provides instruction in fulfilment of CEAB graduate attributes 10, b, and c", "May 29 1.3 Is everything online?", "June 12 2.1 Disinformation Yes", "June 26 2.3 IT & Fairness Yes", "Further instructions for each self-assessment and a rubric will be provided on LEARN in the Module 1.4, 2.4, and 3.4 folders.", "I know it can feel embarrassing to ask for help, but I seriously don’t mind helping everyone.", "That’s when I can best help, not a month later.", "Gender-inclusive language", "Gender-inclusive and fair language should be used in the interests of precision and politeness.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 80, "course_code": "STV 305", "course_name": "STV305 - Technology, Society and the Modern City (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Email: cshelley@uwaterloo.ca.", "Cities may be humanity's most significant invention, where we shape our vision of the civilized life.", "At the same time, the demands of cities shape our lives in fundamental ways.", "The purpose of this course is to examine the technology of civilized life, with the city itself as both a technological system and a scene of technological living.", "View requirements for STV 305", "Describe concepts and perspectives relating to cities as socio-technical systems.", "Analyze and evaluate developments in cities in light of those concepts and perspectives.", "Reflect and communicate analyses of social and ethical aspects of technology and cities.", "Week 11 November 21 Smart cities", "Discussions", "Each student is expected to participate in in-class discussion each week.", "Summaries", "Summaries may be shared with the class to kick-start in-class discussion.", "Self-assessments", "Grade exemptions", "Each student’s lowest discussion mark and exercise mark will be dropped from the calculation of their overall mark in those categories.", "Students are welcome to request regrading of assignments.", "Test conflicts"]}, {"course_id": 0, "course_code": "CHEM 121", "course_name": "CHEM121 - Physical and Chemical Properties of Matter (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Physical and Chemical Properties of Matter Fall 2024", "B. Power", "A first-year chemistry course for students in chemistry-based programs.", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "describe the energy levels of the H atom in terms of atomic orbitals and quantum numbers", "describe the electronic structure of atoms and justify the organization of the periodic table", "predict trends in the properties of the elements", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and understand molecular shape and stability in terms of electron count", "describe the behaviour and interactions of molecules in gases", "predict the effects of intermolecular interactions on the properties of gases and liquids", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "You must submit the University of Waterloo Verification of Illness (VIF) form  by emailing a clear scanned copy to bothyour instructor and science.advisor@uwaterloo.ca", "This course includes the independent development and practice of specific skills, such as problem solving in a chemical and scientific context.", "Library for research-based assignments"]}, {"course_id": 1, "course_code": "CHEM 121L", "course_name": "CHEM121L - Chemical Reaction Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Contact:  Drop in questions are welcome during the hours stated above.", "Questions sent in the wee hours of the morning, the day your report is due, may not receive a response in time!", "Record their name and contact information in your lab manual.", "The CHEM 121L course is an in-depth introduction to the chemistry laboratory environment and provides an opportunity to develop basic lab skills, as well as introducing some basic aspects of experimental design.", "Skillfully perform procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Determine appropriate tools for required accuracy of a given analysis", "Evaluate and follow scientific protocols, and modify them as required to complete an analysis, design and test experimental protocols", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Section", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "- studying cis and trans isomers", "Qualitative and Quantitative Analysis", "Introduction to Chromatography", "- quantify a cation using ion exchange", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 2, "course_code": "CHEM 125", "course_name": "CHEM125 - Chemical Reactions, Equilibria and Kinetics (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["CHEM 125 is a first-year Chemistry course for students in Chemistry-based programs.", "A first-year chemistry course for students in chemistry-based programs.", "Introduction to chemical equilibria.", "Describe the energy and entropy changes that accompany physical and chemical changes.", "Calculate the equilibrium constant for a reaction using the standard thermodynamic properties of reactants and products.", "Predict the direction of spontaneous change for a given set of initial conditions for a variety of chemical systems.", "Apply equilibrium principles to a variety of chemical reaction types including gas-phase reactions, acid-base reactions, precipitation reactions, complexation reactions and redox reactions.", "Analyze oxidation-reduction reactions and identify species being oxidized and reduced.", "Explain the basic construction of, uses of, and the differences between galvanic and electrolytic cells.", "CHEM 121 and CHEM 125 comprise a full-year course in introductory chemistry.", "Course Structure and Continuity Plans", "Chemistry Study Hall:  Starting the 2nd week of classes, there will be a first-year study hall on Tuesdays and Thursdays from 5:30 pm - 6:50 pm in STC 1012.", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 3, "course_code": "CHEM 125L", "course_name": "CHEM125L - Chemical Reaction Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and to modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Section", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- analysing real world samples and", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 4, "course_code": "CHEM 140", "course_name": "CHEM140 - Introduction to Scientific Calculations (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Introduction to Scientific Calculations Winter 2025", "jake.fisher@uwaterloo.ca", "The application of numeric computing software to perform basic calculations, data analysis, regression analysis, plotting of scientific graphs, data manipulation, and equation solving will be covered in this course, with an emphasis placed upon chemical and biochemical concepts and applications.", "These exercises draw on examples from chemistry, biochemistry, and other scientific disciplines, showcasing the many ways Excel can be used as a problem-solving and analytical tool for scientific investigations and tasks.", "Key Scientific and Analytical Concepts Covered:", "Overviews of the basic use and application of Excel", "Scientific plotting and graphs", "Advanced spreadsheet topics", "Statistical analysis in science", "Regression analysis in science", "Solving equations", "Basic calculus and algebraic operations", "Data exchange and manipulation", "Engage students in scientific exercises that enhance their understanding of concepts discussed in other courses.", "5 Session 04 Linear Regression Analysis Pre‐Lab Exercise 04 Friday, Jan 31, 2025 at 5:30 PM ET Friday, Feb 7, 2025 at 5:30 PM ET", "Excel Skills Test", "All In-Class Exercises can be found in the CHEM140 Course Notes and Exercises Manual", "Adobe Acrobat Reader", "Spreadsheet Skills Test 20%", "Please refer to the Introduction section of the CHEM 140 Course Notes and Exercises manual for details.", "Please refer to Electronic Submissions section of the CHEM 140 Course Notes and Exercises manual for details.", "Supporting documentation will be considered on a case by case basis.", "The pre-lab exercises will be accessible for a period of one week.", "Students are given one week to complete the pre-lab exercise and in-class exercises for a given Chem 140 session.", "A student must provide credible evidence that their in-class exercise was completed BEFORE the specified deadline.", "If a resolution between the student and teaching assistant cannot be found, the instructor will re-grade the entire in-class exercise, upon request of the student.", "There are no make-up Skills Test."]}, {"course_id": 5, "course_code": "CHEM 209", "course_name": "CHEM209 - Introductory Spectroscopy and Structure (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Introductory Spectroscopy and Structure Fall 2024", "11:30AM - 12:20PM RCH 309", "Email: afkennywilby@uwaterloo.ca", "The nature of electromagnetic radiation and an elementary outline of quantum mechanics in one dimension.", "For each of microwave, infrared, Raman, electronic, photoelectron, and nuclear magnetic resonance spectroscopy, the nature of the molecular energy levels involved and the type of molecular information that can be obtained using it are examined.", "Understand the electromagnetic spectrum and the energies, frequencies and wavelengths that characterize it; understand and apply the wave-particle duality of light and the concept of photons", "Recognize the various types of quantized energy in atomic and molecular systems and know their origins", "Understand basic molecular orbital theory for simple molecules, and the descriptions of symmetry applied to them", "Understand and apply the concepts of spectroscopy as an interaction between light and matter, including the Bohr resonance condition; Interpret atomic spectra in terms of the underlying structure of atoms in modern quantum theory", "Assign, interpret and predict the spectra arising from molecules interacting with electromagnetic radiation ranging from microwaves for molecular rotations, infrared for molecular vibrations, visible-ultraviolet for electronic transitions, to X-rays for photoelectronic transitions from molecular core orbitals", "Introduction to Spectroscopy (4 weeks): The electromagnetic spectrum, photon theory of light, interaction of light and molecules.", "Review of molecular orbital theory and electronic structure.", "Spectroscopy involving those levels.", "Combination of rotation and vibration in diatomics.", "Ionization of core electrons.", "7. Nuclear magnetic resonance (NMR) spectroscopy (1 week): Basic theory and practical applications of NMR for simple molecules.", "An Introduction to Spectroscopy and Quantum Structure, by W. Scott Hopkins (Cambridge Scholars Publishing, 2023) Recommended reading material No", "Physical Chemistry: A Molecular Approach by Donald A. McQuarrie and John D. Simon", "They are mostly meant to keep you follow the material and understand fundamental concepts.", "Homework assignments are a longer and more involving set of problems and will be given after we finish a given course unit (or midway through for longer units).", "If missed, a weighted final exam grade will be used for a mid-term grade."]}, {"course_id": 6, "course_code": "CHEM 250L", "course_name": "CHEM250L - Physical Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM C2 168", "jake.fisher@uwaterloo.ca", "02:30PM - 05:20PM C2 168", "jake.fisher@uwaterloo.ca", "08:30AM - 11:20AM C2 168", "jake.fisher@uwaterloo.ca", "02:30PM - 05:20PM C2 168", "jake.fisher@uwaterloo.ca", "E-mail:   jake.fisher@uwaterloo.ca", "Students will be introduced to techniques and instruments used in modern chemical research.", "Selected experiments include topics such as the examination of binary-liquid systems, the spectrophotometric determination of the pKa, determination of dissociation constants via conductivity, oxygen bomb calorimetry, and an experimental examination of quantum mechanics.", "To provide the fundamental knowledge and practical experience in the area of physical chemistry.", "To gain an appreciation and understanding of the more complex problems", "A", "B", "C", "D", "E", "F", "I", "Sept 24 Sept 26", "I", "A", "B", "C", "D", "E", "F", "I", "A", "B", "C", "D", "E", "F", "Oct 22 Oct 24 G H I J A B C D E F", "I", "A", "B", "C", "D", "C", "D", "E", "F", "I", "A", "B", "Please refer to the Introduction section of the CHEM 250L Laboratory Manual for details.", "Email a scanned copy of the VIF to the laboratory instructor.", "Supporting documentation will be considered on a case by case basis.", "Equations should be created using the Equation Editor found in MS-Word or a comparable equation editor.", "Re-grading Reports:  If there a concern related as to how a lab report was graded, the student should first consult the teaching assistant responsible for marking the report.", "If a resolution between the student and teaching assistant cannot be found, the laboratory instructor will re-grade the entire report."]}, {"course_id": 7, "course_code": "CHEM 254", "course_name": "CHEM254 - Introductory Chemical Thermodynamics (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["08:30AM - 09:20AM", "RCH 306", "B. Power", "Instructor: Bill Power", "An introduction to the first, second, and third laws of thermodynamics and the application of these laws to ideal systems, mixtures, and chemical reactions.", "Thermodynamic principles are used to study changes in state, including phase changes, and to establish the link between the equilibrium constant and the properties of the substances involved in a chemical reaction.", "This course is a basic introduction to thermodynamics with emphasis on applications in chemistry.", "The course provides the necessary background to study changes in state of many physical and chemical systems.", "Define and apply the four laws of thermodynamics", "Identify, describe and ultimately design a variety of physical and chemical systems through their internal changes and/or interactions with their surroundings", "Quantify internal energy U, heat q, work w, enthalpy H, entropy S and Gibbs energy G in that same variety of physical and chemical systems", "Predict spontaneous change in systems of varying complexity", "Explain and quantify transformations involving both pure substances and mixtures using thermodynamic concepts", "There will be online and in-class assignments, on a rotating interval of about two weeks.", "It will occur in a 2.5 hour time slot sometime between April 9 and April 25 (I have no control over this scheduling).", "I will have a copy on reserve in the library (https://www.reserves.uwaterloo.ca/ares/ares.dll?Action=10&Form=50&Value=222108) and the price listed here is for a one-year electronic subscription.", "In addition, I have prepared a number of narrated powerpoint lectures, which I hope you will find useful in learning the material.", "Each lecture also has notes that provide written transcripts of what I am speaking, in case that helps you to learn some of the terms.", "One will be tutorial assignments which you will complete the first half of the problem individually, then work on an extension of the problem in groups of 4.", "CHEM 254 - Winter 2025 | General | Microsoft Teams", "I will provide any materials there as well as on LEARN, just in case one or the other has access issues.", "Four of the assignments, involving both individual and group work in a team-based learning (TBL) format, should help you to be able to assess different thermodynamic systems and learn to use the appropriate thermodynamic tools.", "The other four assignments, to be completed individually and much broader in scope and effort required, will help you to apply those skills to more complex and realistic physical and chemical systems.", "These may cover several chapters at a time.", "This course includes the independent development and practice of specific skills, such as problem solving in a chemical and scientific context.", "Library for research-based assignments"]}, {"course_id": 8, "course_code": "CHEM 266L", "course_name": "CHEM266L - Organic Chemistry Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["CHEM 266L", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "CHEM 266L 006", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Answers can be expected within 24 hours.", "Piazza is available for clarification questions but I will only provide quick answers as I prefer having longer conversations in person.", "View requirements for CHEM 266L", "Topics include acid-base chemistry, substitution reactions, Grignard reactions, liquid-liquid extraction, product isolation and purification.", "Be proficient with basic organic laboratory techniques including selecting proper glassware, measuring small and large quantities of solids and liquids, designing the setup required for simple synthetic reactions, filtration, and basic characterization.", "Understand and be able to design and execute a liquid-liquid extraction processes for the separation of ionizable acidic, ionizable basic, and non-ionizable (neutral) substances.", "Demonstrate independent thinking by answering questions in your own words, showing critical reflection beyond the initial description of observations and facts.", "Laboratory performance marks will be given by the Teaching Assistants and Lab Instructor and averaged for each in-person lab period.", "This is not directly the case; we do expect students to need a lot of clarifications when working in the lab for the first time.", "Laboratory Worksheets and Reports", "Questions similar to the pre-laboratory quizzes and reports will be used, but may be modified to be multiple choice.", "Human rights must be centered in our pedagogical practice to ensure students feel safe and respected into our instructional spaces.", "We also acknowledge that speaking of underrepresented groups in Science is a misnomer and we should speak of historically excluded persons as Black, Indigenous, Queer and Persons of Colour have contributed to chemical research since the inception of the field.", "Scheduling issues", "General Policies", "Aside from LEARN, we will use various software to facilitate the delivery of the laboratory.", "Important note: Since the manual is printed months before delivery of the lab, we may need to make corrections during the term.", "Expectation of Academic Integrity", "Be especially careful with sharing diagrams and mechanisms, as we often detect excessive collaboration when students share images.", "None-the-less all violations of academic misconduct will be dealt with be taken seriously and dealt with according to the consequences outlines in Policy 71."]}, {"course_id": 9, "course_code": "CS 114", "course_name": "CS114 - Principles of Computing for Science (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Principles of Computing for Science Winter 2025", "08:30AM - 09:50AM MC 4059", "Monday -", "Monday", "07:00PM - 08:50PM", "10:30AM - 11:20AM MC 4063", "Coordinator", "Student who make use of office hours usually get better grades; use them!", "Introduction to basic imperative programming principles; programming concepts including functions, flow control, lists, arrays; numerical accuracy and efficiency; data analysis and general-purpose algorithms.", "Introduction to object-oriented programming concepts.", "Describe the basic memory model for mutation of basic types, lists, and objects in Python.", "Identify situations where recursion is an appropriate tool, and use it.", "6 Feb 6-11 M4: Strings and Lists", "7 Feb 13-25 M5: Sorting and Dictionaries", "If both exams are held in person", "If in-person exams cannot be held then they will be held online (if possible).", "Students have the option of self-declaring a short-term absence, as described here: https://uwaterloo.ca/registrar/current-students/undergraduate-student-short-term-absences", "Students should check their basic tests email to ensure that the code meets the specification exactly.", "If ill, please complete a complete a Verification of Illness Form and contact the course coordinator to discuss alternate arrangements.", "Generative AI: This course includes the independent development and practice of specific skills, such as writing and reading code, tracing, and algorithm design.", "Library for research-based assignments"]}, {"course_id": 10, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 11, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 12, "course_code": "MATH 227", "course_name": "MATH227 - Calculus 3 for Honours Physics (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Email: pmcgrath@uwaterloo.ca", "Directional derivative and the chain rule for multivariable functions.", "Double and triple integrals on simple domains; transformations and Jacobians; change of variable in multiple integrals.", "Vector fields, divergence and curl.", "Vector integral calculus: Line and surface integrals, Green's Theorem, Stokes' Theorem, Gauss' Theorem, conservative vector fields.", "Work in and convert between Cartesian and polar coordinates in two-dimensions or Cartesian, cylindrical, and spherical coordinates in three-dimensions.", "Plot and describe the behaviour of a vector field.", "Determine using a variety of tests if a vector field is conservative.", "Understand the fundamental differences between conservative and non-conservative vector fields.", "Determine the extreme values of a function of multiple variables.", "This course covers a selection of topics from multivariable vector calculus.", "In particular, we will aim to cover one item per week from the following list:", "Arc length and line integrals.", "Quadric surfaces and coordinate systems.", "Extrema of multivariable functions and Lagrange multipliers.", "A previous course in linear algebra is strongly recommended.", "I will also share short videos each week in which I work through examples and/or discuss particularly important concepts.", "I will also post problem sets with full solutions each week so that you have plenty of practice problems to work through.", "Discussion", "You can join our Piazza forum at", "To be clear - such websites are not allowed to be used for the completion of any assessment in MATH 227."]}, {"course_id": 13, "course_code": "MATH 228", "course_name": "MATH228 - Differential Equations for Physics and Chemistry (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Differential Equations for Physics and Chemistry Winter 2025", "First-order equations, second-order linear equations with constant coefficients, series solutions and special functions, the Laplace transform method.", "Applications in physics and chemistry are emphasized.", "Differential equations capture how some variable of interest, such as the position of a planet, changes as a function of some independent variable, such as time.", "Differential equations are very widely used in the sciences because of the broad range of real-world phenomena they can describe in a mathematical framework.", "In this course, students will be introduced to the universe of differential equations, including first-order equations, second-order linear equations, series solutions, the Laplace transform method, and both exact and numerical methods for solving differential equations.", "Applications in physics and chemistry will be emphasized.", "understand how differential equations can be used to model physical systems,", "know how to classify differential equations,", "know how to solve various classes of differential equations using numerical methods and exact methods, and", "Unit 2 - First-Order Differential Equations (Weeks 2 - 3)", "Unit 3 - Second-Order Linear Equations (Weeks 4 - 5)", "Unit 4 - Mechanical and Electrical Vibrations (Week 6)", "Unit 5 - Series Solutions of Second-Order Linear Equations (Weeks 7 - 8)", "Unit 8 - Systems of Differential Equations (Weeks 11 - 12)", "In particular, it includes lots of helpful practice problems.", "To be clear - such websites are not allowed to be used for the completion of any assessment in MATH 228.", "Email a scanned copy of the Verification of Illness Form to your instructor."]}, {"course_id": 14, "course_code": "MNS 101", "course_name": "MNS101 - Materials and Nanosciences in the Modern World (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Materials and Nanosciences in the Modern World Winter 2025", "Overview of materials, including physical and chemical classification of materials, and structure-property relationships; survey of emerging fields in materials and nanoscience research such as nanotechnology, quantum materials and devices, bionic research; societal impacts of materials and nanoscience research.", "View requirements for MNS 101", "classify and categorize materials based on both their microstructures and functionalities", "describe atomic electronic structure; periodic trends in properties of atoms; covalent, metallic and ionic bonding between atoms; and intermolecular interactions", "describe, visualize and determine physical properties of three-dimensional crystal structures of solid-state materials", "describe and visualize imperfections in crystal structures and rationalize their implications on the mechanical properties of materials", "describe and determine mechanical properties for various materials", "classify ceramics and describe their syntheses, properties and applications", "classify polymers and describe their syntheses, properties and applications", "describe and determine electronic properties of solid materials", "identify and appreciate the diversity of modern research in materials and nanoscience", "1 Introduction to Materials Science", "2 Atomic and Electronic Structure", "8 Electronic Properties", "The tests are non-cumulative, and each test will cover specific sections and modules from the course lecture notes.", "Emails can be received 24 hours per day.", "This official verification is necessary before any action can be taken.", "Students should carefully consider the wisdom of missing a test or an exam."]}, {"course_id": 15, "course_code": "MNS 102", "course_name": "MNS102 - Techniques for Materials and Nanosciences (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Techniques for Materials and Nanosciences Winter 2025", "MNS 102", "Overview of materials synthesis, including both wet chemical and dry physical based methodologies; basic metrology and materials characterization of surface and bulk properties; introduction to the design, fabrication, and evaluation of simple devices; survey of emerging new techniques in materials and nanosciences.", "View requirements for MNS 102", "Overview of Materials and Nanosciences - Review of notable nanoscale phenomena | Structure-property relations | Basic physics and chemistry background | Lab tours", "Wet chemistry methods: Beaker chemistry, Sol-Sel, Hydrothermal, Electrochemistry | Templates, seed-layers and catalysts ||", "Dry chemistry methods: Solid-state synthesis, Chemical Vapour Deposition, Physical Vapour Deposition (including magnetron sputtering, e-beam evaporation, pulsed laser deposition), Molecular Beam Epitaxy | General materials growth mechanisms", "Module 2: Basic Metrology and Materials Characterization - Structure determination techniques | X-ray Diffraction: Basic introduction in group theory, basic physics, diffraction of powders and thin films) | Light Microscopy: Key concepts including magnification, working distance, depth of focus, spatial resolution vs field of view | Transmission Electron Microscopy and electron diffraction| Scanning Electron Microscopy (and Energy-Dispersive X-ray analysis) | Scanning Tunnelling Microscopy | Atomic Force Microscopy ||", "Composition determination techniques | Optical spectroscopies: Absorption vs transmission, IR, Raman, UV, photoluminescence || X-ray photoelectron spectroscopy: Photoelectric effect and Einstein's equation, electronic and band structures | Secondary ion mass spectrometry: Static vs Dynamic SIMS ||", "Characterization of electrical, physical and magnetic properties | Resistivity and conductivity | Heat capacity | Magnetic properties", "Module 3: Device Design and Fabrication - Top-down vs bottom-up approaches | Optical Lithography | Electron Beam Lithography | Nano-imprinting | Nano-machining and nano-manipulation", "Module 4: Emerging Techniques - Super-resolution Microscopy | Helium Ion Microscopy | Ion Beam Lithography | Other tools", "To learn the fundamental structure-properties relations of nanoscale materials.", "To learn the basic principles of common synthesis and materials characterization techniques."]}, {"course_id": 16, "course_code": "MNS 201L", "course_name": "MNS201L - Materials and Nanosciences Laboratory (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["MNS 201L", "MNS 201L 001", "Email: kcvrkalj@uwaterloo.ca", "Email: jgard@uwaterloo.ca", "MNS 201L:", "The laboratory course is aimed at students enrolled in the MNS program and is composed of experiments involving the syntheses of materials and nano-particles; in addition to their characterization and application using modern instrumentation techniques.", "View requirements for MNS 201L", "The laboratory course is for students enrolled in the MNS program and is composed of several experiments involving the syntheses of materials and nanoparticles, in addition to the characterization and application of materials and nanoparticles using modern instrumentation techniques.", "Experiments include: synthesis of silver nanoparticles with characterization by dynamic light scattering (DLS) and ultraviolet-visible (UV-Vis) spectrophotometry; preparation of a eutectic tin-lead alloy with characterization by differential scanning calorimetry (DSC); synthesis of cadmium selenide quantum dots with characterization by fluorescence emission spectrophotometry; electrochemical template synthesis of nickel nanowires with characterization by optical microscopy; synthesis of gold nanoparticles with application as a biosensor in UV-Vis spectrophotometry; atomic force microscopy (AFM) of a compact disk; resistivity and Hall-effect voltage in doped and undoped Ge semiconductors; single crystal orientation of NaCl and Cu crystals by X-ray Laue back-reflection; vacuum evaporation of dielectric interference filters; and tensile testing of metals and polymers.", "Explore a variety of techniques in material and nanoparticle syntheses.", "Exposure to many modern instrument-based characterization techniques including: dynamic light scattering (DLS), ultraviolet-visible (UV-Vis) spectrophotometry; differential scanning calorimetry (DSC); photoluminescence spectrophotometry; reflective optical microscopy; atomic force microscopy (AFM); X-ray diffraction (XRD) using Laue crystal orientation; basic electrical transport measurements; and tensile testing of materials.", "Lab Manual Available online and can be printed Yes", "This includes copying old reports, students copying from each other in the lab and plagiarism, to name a few of the possible offences.", "Students who miss a laboratory session without a valid excuse will not be permitted to complete the experiment and will be assigned a grade of zero for that report.", "This penalty is in place since many parts of the lab are done individually, and a failure to hear the instructions could pose confusion and safety concerns in the lab.", "Be organized and neat", "Disobeying safety practices (e.g. not wearing safety glasses)", "If you have concerns over a grade, discuss it with the TA first.", "This course includes the independent development and practice of specific skills, such as the analysis of lab data and subsequent independent writing of lab reports.", "Library for research-based assignments"]}, {"course_id": 17, "course_code": "MNS 211", "course_name": "MNS211 - Chemistry and the Solid State (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Chemistry and the Solid State Fall 2024", "MNS 211", "10:30AM - 11:20AM RCH 204", "Crystal structures and bonding in solids; introduction to diffraction, solid state synthesis, and thermal analysis techniques employed in the study of materials; defects, non-stoichiometry, and solid solutions; phase diagrams for solid systems.", "View requirements for MNS 211", "interpret and utilize unary phase diagrams", "describe, visualize and characterize basic crystal structures", "interpret, visualize and assign molecular and crystallographic point groups and space groups", "identify, understand and theoretically apply some common synthetic methods that yield solid-state materials", "identify and understand the applications of some common solid-state characterization techniques", "1 Introduction to Solids", "2 Structural Order", "4 Synthesis Methods", "The tests are non-cumulative, and each test will cover specific sections and modules from the course lecture notes.", "Emails can be received 24 hours per day.", "This official verification is necessary before any action can be taken.", "Students should carefully consider the wisdom of missing a test or an exam.", "Every student in MNS 221 is expected to treat their peers and their instructor with kindness, fairness, tolerance, and respect.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 18, "course_code": "MNS 221", "course_name": "MNS221 - Physics and the Solid State (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Physics and the Solid State Winter 2025", "MNS 221", "MNS 221 001", "DWE 2527", "MNS 221:", "Physical properties of crystalline and amorphous solids; introduction to electric, magnetic and optical properties of solids.", "View requirements for MNS 221", "Describe edge and screw dislocation motions at the atomic level and how strengthening relates to dislocations.", "Construct and interpret unary, isomorphous and eutectic phase diagrams to determine material properties.", "Describe and calculate kinetic and thermodynamic properties associated with phase transformations.", "Describe and calculate electronic properties in solid materials including: band structure; excitation events in metals, semiconductors and insulators; the Hall effect; capacitance; ferroelectricity and piezoelectricity.", "Describe and calculate magnetic properties in solid materials including: different forms of magnetism (e.g. diamagnetism and paramagnetism; ferromagnetism; etc.) and superconductivity.", "Describe and calculate optical properties related to the interaction of light with solid materials.", "4 Phase Transformations", "5 Electrical Properties", "6 Magnetic Properties", "7 Optical Properties", "The tests are non-cumulative, and each test will cover specific sections and modules from the course lecture notes.", "Important Policies for MNS 221", "Emails can be received 24 hours per day.", "This official verification is necessary before any action can be taken.", "Students should carefully consider the wisdom of missing a test or an exam.", "Expectation of Academic Integrity", "Every student in MNS 221 is expected to treat their peers and their instructor with kindness, fairness, tolerance, and respect.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 19, "course_code": "MNS 321", "course_name": "MNS321 - Electrical and Optical Properties of Materials (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Electrical and Optical Properties of Materials Fall 2024", "MNS 321", "MNS 321 001", "MNS 321:", "Optical properties of and electrical transport in materials; topics may include insulators, semiconductors, metals, superconductors and their applications in photovoltaics, thermoelectrics, and nanocomposites.", "View requirements for MNS 321", "Thermodynamic properties of solids, such as electron contributions to heat capacity", "Classical and semiclassical models for electrical and thermal transport", "Electrons in crystalline lattices: tight-binding models", "Semiconductor devices: pn junction diodes, transistors, MOSFETs, and CMOS", "Nanoscale devices: quantum dots and quantum wells", "Light propagation in materials and refractive index", "Optical conductivity in metals and the AC Drude model", "Develop a solid understanding of fundamental principles that influence the electrical and optical properties of materials, such as density of states, electronic bands, band gaps, electrical transport, and the behavior of electron and hole states with effective mass.", "Perform calculations to determine material properties, including electronic band structure, density of states, heat capacity, and electrical and thermal transport coefficients.", "Analyze how a material’s structure and composition dictate whether it functions as a metal, insulator, or semiconductor.", "Gain insight into the physics and operational principles of semiconductor devices, including pn junction diodes, MOSFET transistors, and CMOS, used in electronic and optical applications.", "Examine the key factors responsible for the absorption and reflection of light in metals, insulators, and semiconductors.", "Calculate important optical properties, such as optical conductivity, reflectance, and refractive index, for various materials.", "4 Sept. 24-26 Semiclassical transport: Boltzmann equation", "5 Oct.  1-3 Lattice vibrations: Dispersion of a 1D lattice, phonons and normal modes Simon 9/10 A1: Drude model", "A2: electronic heat capacity", "6 Oct. 22-24 Diatomic lattice  Simon 10", "8 Nov. 5-7 Electrons and holes, effective mass, electrical transport revisited, scattering of electrons Simon 17 A4: Tight binding model", "Semiconductor physics: intrinsic carrier concentration, mobility, doped semi-conductors Simon 17", "9 Nov. 12-14 Semiconductor devices: pn junction diodes Simon 18", "11 Nov. 26-28 Optical properties of materials: basic properties, materials Fox 1", "Optical conductivity of free electrons: Drude model, skin depth, plasma frequency Fox 3", "The Oxford Solid State Basics by Steven H. Simon Yes", "Introduction to Solid State Physics by Charles Kittel No", "Solid State Physics by Ashcroft and Mermin No", "Solid State Electronic Devices by Streetman and Banerjee No", "Tracking and managing late submissions can be time-consuming for both the instructor and TA.", "The VIF can be found at: Verification of Illness Forms.", "The current Chair of the Department of Physics and Astronomy"]}, {"course_id": 20, "course_code": "MNS 322", "course_name": "MNS322 - Polymer Materials (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["MNS 322", "11:30AM -", "Basic definitions and polymer nomenclature, molecular weight distributions and averages, molecular weight measurements, step-growth and radical chain polymerization reactions, chain conformations, glass transition, crystallization, mechanical properties of polymers, phase behaviour and morphologies, and self-assembly.", "View requirements for MNS 322", "Understand the models and measurement of polymer chain dimensions.", "Know the general techniques to characterize polymer molecular weight and understand their principles.", "Remember the nature of step-growth polymerization and analyze the kinetics", "Differentiate chain-growth and step-growth polymerization and their kinetics", "Understand the key feature of controlled radical polymerization", "Know basic characterization methods and terms for polymer mechanical properties", "The whole course includes seven chapters, and each chapter will have a correlating assignment after it is completed.", "Introduction to Polymers (Third Edition) Robert J. Young and Peter A. Lovell No"]}, {"course_id": 21, "course_code": "MNS 331", "course_name": "MNS331 - Biomaterials (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "MNS 331", "08:30AM - 09:20AM MC 1056", "Office Address:   ESC 227", "E-mail  tdieckma@uwaterloo.ca", "Please contact me via E-mail", "Mechanical, chemical and biological properties of biomaterials; relationships between biomaterials and their properties, functions, manufacture, and applications; applications of biomaterials in technologies, such as tissue engineering, prosthesis manufacture, drug delivery systems, bioreactors.", "View requirements for MNS 331", "understand their applications and practical aspects of their use", "The Chapters* refers to chapters in the highly recommended text: An Introduction to Biomaterials by Jeffrey O. Hollinger 2nd Ed. (2012) CRC Press ISBN 9781439812563 - CAT# K10637", "Sections", "Introduction and review", "Protein, nucleic acid, membrane and cell biochemistry", "Chapters* 2,3 – Cutaneous wound pathobiology and osseous would healing", "Biology of skin", "Biology of Bone", "Cellular and tissue mechanobiology", "Sections", "Chapters* 5-7 Materials-Host interactions", "Cell-material interactions", "Bioreactor systems", "Sections", "Chapters* 8, 9 – Standardized Materials Testing", "In vitro and in vivo standardized testing of biomaterials", "Chapters* 11.12 – Testing and regulations", "Sections", "Chapters* 13,14, 17, 21, 24 – Amino acid and proteins based biomaterials", "Fibrin and collagen constructs in tissue engineering", "Silk-based biomaterials", "Chapters* 19, 20– polysaccharide based biomaterials", "Complex polysaccharides", "Calcium based Bioceramics", "Sections", "Chapters* 28, 29 – Orthopedic implants, bone and biomaterials", "Bone and biomaterials", "Chapters* 26, 31, 33 Tissue engineering and biomaterials", "Tissue engineering of skin", "Biomaterials and the nervous system", "Cardiovascular Tissue engineering and decellularized scaffolds, organs on a chip", "Notice of Recording"]}, {"course_id": 22, "course_code": "MNS 410", "course_name": "MNS410 - Special Topics in Solid-State Materials (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Special Topics in Solid-State Materials Winter 2025", "08:30AM - 09:50AM EV3 4412", "After a review of the essential concepts in solid-state materials, in-depth discussion includes two or three of the following topics: transistors, semiconducting materials and devices, superconducting materials and superconductivity-based devices (such as Josephson junctions, SQUIDS), effects of low dimensionality and interfaces, quantum dots, magnetoresistance, spintronics, multiferroics, topological phases, and, nanofabrication of new materials.", "View requirements for MNS 410", "Enrolled in H-Materials & Nanosciences", "Understand foundational concepts in solid state physics, including phonons and electronic structure", "Develop an understanding of phenomenological and microscopic models of superconductivity and magnetism", "Develop a qualitative understanding of topics at the frontier of solid state matter physics", "chapters", "Kittel", "chapters", "11 Mar 17-21 Mean field Theory, Hubbard model ch 22, 23", "Introduction to Solid State Physics by Charles Kittel optional No", "Solid State Physics by Neil Ashcroft and David Mermin optional No", "one", "one", "This official verification is necessary before any action can be taken."]}, {"course_id": 23, "course_code": "MNS 431", "course_name": "MNS431 - Special Topics in Nano-Biomaterials (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Special Topics in Nano-Biomaterials Winter 2025", "MNS 431", "10:30AM - 11:20AM RCH 112", "Email: liujw@uwaterloo.ca", "After a review of the essential concepts in nano-biomaterials, in-depth discussion includes two or three of the following topics: biomaterials on atomic and nanometre scales in which DNA, RNA, and/or polypeptides are incorporated as components; physical, chemical, and biological processes; nanoscale forces, adhesion, indentation; applications in nanomotors, nano-biomimetic materials, nanocomposite materials, and nano-biosensors.", "View requirements for MNS 431", "The focus of this course is on DNA-based biosensors and nanomaterials.", "After going over the fundamentals about DNA chemistry, we will cover the design principle of various functional DNA-based biological sensors and materials.", "Topic 1: DNA/RNA properties and chemical synthesis", "Topic 2: Combinatorial selection of functional DNA", "Topic 3: Examples of DNA-based biosensors", "read and understand related scientific papers and technical reports.", "Furthermore, students will be able to perform related engineering calculations to design practical sensors and materials.", "DNA will be the central topic of the class, and other biopolymers and polymers will also be covered.", "Students are also required to perform literature search and study the current state-of-the-art sensor and biomaterials.", "Furthermore, students will be able to perform related engineering calculations to design practical sensors and materials.", "Notice of Recording", "Notice of recording during the recorded sessions will follow this guidance:", "This will be handled on a case-by-case basis by the instructor."]}, {"course_id": 24, "course_code": "PHYS 121", "course_name": "PHYS121 - Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["An introductory course in physics for students intending to concentrate their future studies in the physical sciences, optometry, or mathematics; includes vectors (dot and cross products), particle kinematics and dynamics, forces in nature, work and energy, conservation of energy and linear momentum, rotational kinematics and dynamics, and conservation of angular momentum.", "Doing Physics - quantities, dimensions, units", "Point Dynamics - force, motion, Newton's laws", "Conservation of Energy - work and energy, conservative systems", "Conservation of linear Momentum - momentum and systems of particles", "Understand the following concepts:", "- Linear kinematics: the relationship between distance, velocity and acceleration.", "- Linear dynamics: a consequence of forces and momentum, and how they interrelate.", "- Kinetic energy, potential energy, work, and their interrelationships.", "We will also re-examine these concepts in a rotating coordinate frame using angular kinematic variables along with torque and angular momentum.", "6 Module 06:  Kinetic and Potential Energy", "7 Module 06:  Kinetic and Potential Energy", "8 Module 07:  Linear Momentum", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- eText + Student Access Code", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- Print Format + Student Access Code"]}]