[{"course_id": 91, "course_code": "PSYCH 207", "course_name": "PSYCH207 - Cognitive Processes (0.50)", "term_name": "Natural Science List", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["An examination and evaluation of selected topics dealing with human information processing such as attention, memory, pattern recognition, consciousness, language, dyslexia, decision making, and problem solving.", "how we call on our mental information and resources to make important decisions; and,", "Describe how context shapes and constrains cognition, which involves"]}, {"course_id": 92, "course_code": "PSYCH 261", "course_name": "PSYCH261 - Physiological Psychology (0.50)", "term_name": "Natural Science List", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to brain, basic physiological processes, and their roles in behaviour.", "Both experimental and clinical data are considered.", "Familiarise you with the theoretical and philosophical underpinnings of physiological psychology;", "Teach you about the physiological mechanisms underlying human sensory and perceptual systems; and", "Provide you with insights into the basic physiological and mechanisms involved in behaviour, cognition, emotion and consciousness.", "Week 1: Introduction and History", "Sona Participation and Research Experience Marks", "Students may complete any combination of these options to earn research experience grades.", "Credits for online courses can be earned through any combination of studies as noted above.", "Participation enables students to learn first-hand about psychology research and related concepts.", "Educational focus of participation in research", "To maximize the educational benefits of participating in research, students will receive feedback information following their participation in each study detailing the following elements:", "Provisions to ensure confidentiality of data", "**", "Identify the psychological concepts in the article and indicate the pages in the textbook that are applicable.", "Clearly evaluate the application or treatment of those concepts in the article.", "If such a conflict arises, the Associate Chair for Undergraduate Affairs is available for consultation and to mediate a resolution between the student and instructor."]}, {"course_id": 94, "course_code": "SCI 238", "course_name": "SCI238 - Introductory Astronomy (0.50)", "term_name": "Natural Science List", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["SCI 238", "SCI 238 001", "Discussions:", "Lecture slides can be found here.", "SCI 238:", "View requirements for SCI 238", "All are welcome!", "5 Tuesday, Jan 21st Light and Matter Chapter 5     Spectral tubes and spectrometers", "Science of \"Interstellar\"", "Order Mastering Astronomy", "No exceptions to these requirements will generally be made in cases where students miss classes or do not complete assignments.", "Library for research-based assignments"]}, {"course_id": 95, "course_code": "SCI 250", "course_name": "SCI250 - Environmental Geology (0.50)", "term_name": "Natural Science List", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Environmental Geology Winter 2024", "Include Earth 221 in the subject line and your full name and student ID# in the text.", "An introduction to geological concepts; the influence of geological factors on the natural environment; Earth processes and natural hazards; Earth resources, including water, energy and mineral resources; waste disposal and pollution; global climatic and environmental change.", "Environmental Geology refers to how geologic processes interact with and influence human activities and vice versa.", "The goal is to introduce you to basic geologic concepts in order to better understand your natural physical surroundings, such as earthquakes, volcanoes, surface water and glacial processes.", "You will also learn about resource availability such as groundwater and fossil fuels and how we impact the environment via waste disposal and other forms of pollution.", "As the population of the Earth grows, there is increased demand for limited supplies of natural resources, a growing release of pollutants, and increased development in geologically unstable parts of the world.", "These issues result in a variety of hazards and potential problems that societies need to understand and deal with in ways that are beneficial for the Earth and local populations.", "Explain the geologic/earth science connections to certain environmental issues", "Use geologic terminology and concepts when describing environmental issues", "Critique the use of scientific information in the public domain (e.g., media) regarding geologically-related environmental issues", "6 13-Feb Ice & Glaciers; Wind & Deserts Ch 9    15-Feb Climate Ch 10   Q5 (Ch 9,10)", "Older print versions could also be used but there may be some slight differences with the newest version, particularly for case studies or specific events.", "Exams will be a mix of multiple choice, fill in the blank, and written questions.", "Start checking for posted exam dates in the middle of February", "Extensions and other accommodations", "Extensions and other accommodations will only be considered on a case-by-case basis."]}, {"course_id": 96, "course_code": "ECE 320", "course_name": "ECE320 - Computer Architecture (0.50)", "term_name": "List 1", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 320", "Monday, Friday -", "10:00AM - 11:20AM E7 4417", "04:00PM - 05:20PM E7 4053", "* different hours will be announced for reading week, midterm week and the exam period", "Artem Klashtorny <aklashto@uwaterloo.ca>", "Office hours: Thursdays @ 4-5pm in E5-5131 starting in Week 9", "Office hours: Fridays @ 4-5pm in E5-4011 starting in Week 9", "Organization and performance of uniprocessors, pipelined processors, dynamically scheduled processors, parallel processors and multiprocessors; memory and cache structures; multiprocessor algorithms and synchronization techniques; special-purpose architectures.", "View requirements for ECE 320", "Out-of-Order Pipelines", "Dynamic scheduling, register renaming, speculative execution", "Data-Level Parallelism", "GPGPU programming, Many-Core processors", "Domain-Specific Computing", "Design and implement a pipelined scalar processor", "Explain the memory system including concepts of virtual memory, cache coherency and memory consisteny", "Understand trends and in computer architecture and quantitative-based design", "3 Sept 16-20 PD0** Make-up lec", "7 Oct 21-25 Midterm week***", "The lab project is to develop a pipelined RISC-V processor in Verilog and implement it on an FPGA.", "PD1-PD6 are done in groups of two.", "Communication and Q&A: piazza.com/uwaterloo.ca/fall2024/ece320"]}, {"course_id": 97, "course_code": "ECE 351", "course_name": "ECE351 - Compilers (0.50)", "term_name": "List 1", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 351", "ECE 351 001", "10:00AM - 11:20AM E7 4417", "08:30AM - 09:50AM E7 4417", "View requirements for ECE 351", "Write a circuit synthesizer and a circuit simulator for circuits described in a subset of VHDL.", "Learn the theoretical aspects of compilers and language design.", "Build a practical rudimentary compiler.", "Understand how language design can be seen as a general form of problem solving.", "-", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 98, "course_code": "ECE 356", "course_name": "ECE356 - Database Systems (0.50)", "term_name": "List 1", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Database Systems Fall 2024", "ECE 356", "ECE 356 001", "11:30AM -", "08:30AM - 09:50AM E7 4417", "Data models, file systems, database system architectures, query languages, integrity and security, database design.", "View requirements for ECE 356", "Relational databases empower the vast majority of dynamic websites as well as a variety of information management systems in private and public sector organizations.", "ECE356 explores the concepts and techniques that make such databases convenient, efficient, and reliable.", "The course additionally includes an introduction to data mining and NoSQL.", "model data using entity-relationship (ER) diagrams", "understand the relational model and design a relational schema for a data set", "execute SQL commands against a remote database using Java Database Connectivity (JDBC)", "identify integrity constraints and functional dependencies in data", "apply the theory of database normalization to optimize the design of a relational schema", "understand the basics of transaction execution, concurrency control, and recovery in databases", "understand SQL injection attacks, as well as password hashing and salting", "perform simple data mining and analytics operations on real data sets", "design a denormalized schema for a NoSQL database", "September 4-10 intro, relational model SSH, mysql command line tool     first week of classes", "September 11-17 relational algebra, SQL relational algebra", "October 2-8 normalization normal forms and normalization", "Exams", "A make-up final exam, if offered by the instructor, may be scheduled in a future academic term.", "The instructor will not offer a make-up midterm, and will instead consider shifting the weight of a missed midterm towards the final exam.", "Members of the teaching team may also evaluate students' proficiency in the use of software in connection with lab work.", "If a student's solution differs substantially from the solution recognized by the teaching team, the student may be asked to provide sample inputs and outputs to evaluate the correctness of their solution.", "Collaboration", "Exams may cover both theory and practice, including your ability to read and write SQL code.", "Notice of Recording"]}, {"course_id": 99, "course_code": "ECE 358", "course_name": "ECE358 - Computer Networks (0.50)", "term_name": "List 1", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 358", "10:00AM - 11:20AM E7 4417", "Email", "Prof. Catherine Rosenberg", "Mike Cooper-Stachowsky", "Substitute Instructor", "Dr. Abdalla Mohamed Hussein", "Maryam Amini", "maryam.amini@uwaterloo.ca", "yuan.quan@uwaterloo.ca", "Mohammad Abuyaghi", "This course is a comprehensive introduction to computer networks.", "View requirements for ECE 358", "Revised Description: This course is a comprehensive introduction to computer networks.", "The lower-level outcomes are:", "Have a good understanding of protocols and networking design concepts.", "Have a working knowledge of socket programming.", "Have a working knowledge of transport protocols with a special emphasis on TCP and retransmission protocols.", "Example of LAN technologies: Ethernet and switches.", "Synthesis: a day in the life of a web request", "LAB1: Development of a simulator of a single transmission system.", "Examination", "If you miss the midterm without a valid reason, that midterm earns a score of zero.", "Lab marking and reports submissions", "Instructions for how to package your files and submit are in the lab manuals."]}, {"course_id": 100, "course_code": "ECE 313", "course_name": "ECE313 - Digital Signal Processing (0.50)", "term_name": "List 2", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Digital Signal Processing Fall 2024", "ECE 313", "ECE 313 001", "Monday, Friday -", "11:30AM -", "04:00PM - 05:20PM E7 4053", "ECE 313:", "Fourier representations in discrete and continuous time.", "Discrete Fourier transform and fast Fourier transform algorithms.", "Transform analysis of linear time-invariant systems.", "Introduction to filter banks and discrete wavelet transform.", "View requirements for ECE 313", "understand the fundamental concepts, theories and methodologies of discrete-time signals, systems, and transforms, digital filter design, and digital processing of analog signals.", "Introduction", "Discrete Signals and Systems", "Z-Transform", "Digital Processing of Analog Signals", "Digital Filter Design", "Digital Signal Processing and Machine Learning"]}, {"course_id": 101, "course_code": "ECE 331", "course_name": "ECE331 - Electronic Devices (0.50)", "term_name": "List 2", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electronic Devices Fall 2024", "ECE 331", "ECE 331 001", "william.wong@uwaterloo.ca", "William S. Wong, Department of Electrical and Computer Engineering", "Email: wswong@uwaterloo.ca", "Email: b2sadeghimakki@uwaterloo.ca", "Sathursan Kokilathasan", "Email: skokilat@uwaterloo.ca", "ECE 331:", "Device theory and modelling of p-n junction diode and derivation of dc and ac characteristics, charge storage effects.", "Principles, device theory, and modelling of metal-oxide semiconductor field-effect transistors (MOSFETs), and the derivation of threshold voltage, dc current characteristics, small signal ac models.", "Principles of bipolar transistor and derivation of dc and ac terminal characteristics, equivalent circuits.", "View requirements for ECE 331", "Non-equilibrium Semiconductors and Excess carriers [", "pn junction and their I-V characteristics [", "Schottky Barrier contact and ohmic contacts [", "MOS Capacitor and MOSFET [", "Crystal growth", "Photolithography", "Thermal oxidation", "Diffusion and Implantation", "Thin films", "Non-uniformly doped pn junctions", "pn junction charge storage", "Metal-oxide-semiconductor field effect transistors (MOSFETs)", "Derivation of I-V Characteristics (mathematical)", "Frequency Limitations", "Non-ideal MOSFET Effects", "MOSFET Scaling", "Introduction to Microelectronic Fabrication, 2nd Ed.", "You will be provided a formula sheet for relevant equations."]}, {"course_id": 102, "course_code": "ECE 360", "course_name": "ECE360 - Power Systems and Smart Grids (0.50)", "term_name": "List 2", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Power Systems and Smart Grids Fall 2024", "ECE 360", "ECE 360 001", "Office: E3-4111, Ext: 37063", "Email: GBommali@uwaterloo.ca", "Email: aomar@uwaterloo.ca", "Fundamentals of power systems, analysis techniques including power flow and symmetrical fault analyses, and the basics of distribution systems and smart grids.", "View requirements for ECE 360", "This course provides a comprehensive overview of power systems and smart grids, exploring their fundamental concepts, components, and operations.", "Students will gain insights into the generation, transmission, distribution, and utilization of electrical energy, as well as the emerging technologies and trends shaping the future of the power industry.", "Analyzing power systems is vital for their operation, utilizing techniques like Power Flow Analysis to monitor voltage and power flow and identify potential issues such as bottlenecks.", "Symmetrical Fault Analysis assesses system resilience against faults.", "Distribution systems, the final delivery point, incorporate smart grids that enhance functionality through technologies like smart meters, renewable energy integration, advanced communication networks, and energy storage solutions to improve efficiency, reliability, and sustainability of power distribution.", "Develop the capability to identify and analyze power systems encompassing generation, transmission, and distribution.", "Acquire the ability to integrate renewable energy sources into power systems and leverage smart grid technologies to enhance grid efficiency and modernization.", "Navigate the regulatory and economic aspects of power systems, adapting to changes in deregulation and energy economics.", "Develop strong problem-solving and innovative thinking skills to address the evolving needs of the energy sector.", "Acquire a solid foundation in the theoretical and practical aspects of power systems and smart grids, preparing for a successful career in electrical engineering.", "Power Systems: Power system structure: generation, transmission and distribution system, load profiles and characteristics; Deregulation; Smart grids.", "Per Unit System: importance of per unit system,  concept of base quantities, process of converting actual quantities to per unit values, per unit system for analyzing power systems.", "Fault Analysis and Protection: Three-phase symmetrical faults; Basic concepts of protection, elements of protection systems.", "Protection zones, Primary and backup protection, Protection system requirements, Protective relays, Application of protection systems.", "Distribution Systems: Distribution system configurations; Voltage drop and loss calculations; Shunt capacitors in distribution systems; Distribution automation", "Smart Grids: Philosophy and concept of smart grids, Smart homes and smart meters; requirements; concept of smart loads and customer engagement; self healing and restoration paths.", "Power Systems Analysis and Design, Glover , Sarma and Overbye, SI version, 5th Edition, Cengage Learning, 2012 No", "Come to the lab with a clear understanding of what you are meant to accomplish, or with clear questions, so that the teaching team can help you.", "Lab Study – 0: Lab Safety & Equipment Introduction", "Lab Study – 4: Power Systems Load Flow Studies", "Lab Study – 5: Short Circuit Analysis and Protection Simulations"]}, {"course_id": 103, "course_code": "ECE 373", "course_name": "ECE373 - Radio Frequency and Microwave Circuits (0.50)", "term_name": "List 2", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Radio Frequency and Microwave Circuits Fall 2024", "ECE 373", "ECE 373 001", "Email", "ECE 373:", "Review of transmission line and scattering matrix representation of radiofrequency (RF) circuits, multiport RF networks, modern RF and microwave planar technology, lumped and distributed microstrip circuits, microwave couplers, Hybrids, resonators, filters, Low-noise amplifiers (LNAs), RF oscillators and mixers, computer-aided design (CAD) tools for RF circuits, hybrid and monolithic RF circuits.", "View requirements for ECE 373", "Design and analyse RF passive circuits such as couplers, power dividers, and filters.", "Design and analyse of RF active circuits such as low noise amplifiers, oscillators and mixers.", "Get familiar with the usage of Advanced Design Tools for simulating RF circuits.", "Transmission line theories and generalized matrix representation of RF circuits", "Analysis of multiport RF networks", "Introduction to modern microwave planar technologies", "Lumped and distributed microstrip circuits", "Analysis of microstrip circuits", "Microstrip couplers, hybrids and impedance matching networks", "Microwave resonators and filters", "Design of RF low noise amplifiers (LNA’s)", "Design of RF oscillators and mixers", "Use of existing commercial CAD design tools for RF circuits", "Computer-Aided Design of Microwave Circuits [", "] K. C. Gupta, Computer-Aided Design of Microwave Circuits, Dedham, Mass.: Artech, No", "Microwave Transistor Amplifier: Analysis and Design [", "By the end of the labs, students will be able to use Keysight’s Advanced Design System (ADS) circuit and Electromagnetic (EM) simulator to simulate and design RF circuits.", "The list of circuits includes couplers, filters, and low noise amplifiers.", "Lab 1: Introduction to Keysight’s Advanced Design System (ADS) tool", "Lab 2: Passive Circuit Design", "Lab 3: Passive/Active Circuit Design", "Lab 4: S-parameter Measurements using Vector Network Analyser", "· No open-toed shoes or bare feet in the lab, and no running in the lab.", "Phone numbers for", "Ambulance and UW police are 911 & x22222, respectively.", "· See the poster near the door for first Aid/emergency procedures."]}, {"course_id": 104, "course_code": "CS 445", "course_name": "CS445 - Software Requirements Specification and Analysis (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Software Requirements Specification and Analysis Winter 2025", "10:00AM - 11:20AM MC 2035", "Email:x784chen@uwaterloo.ca", "Email: ar2elsha@uwaterloo.ca", "Email: d3pang@uwaterloo.ca", "Models, notations, and processes for software requirements identification, representation, analysis, and validation.", "ECE 451: View requirements for ECE 451", "The week of", "Deliverables", "1 Introduction", "3 RE Reference Model", "Jan 13 4 Domain Model 4 Domain Model D0 – Group members & Project idea", "Jan 27 7 Functional Modelling 8 OCL D1 – Domain Model & Stakeholders", "Feb 10 10 Quality Requirements 10 Quality Requirements D2 -  Use case Diagram & Description", "Feb 24 11 Requirements Conflict management 12 Prioritizing Requirements D3 – Functional Model & OCL", "Mar 3 13 Cost Estimation 14 Risk Analysis D4 – State Diagram", "Mar 17 15 Temporal Logic 16 Validation and Verification D5 – Cost Estimation & Risk Analysis", "Mar 31 17 Software Project Management 18 Requirement Engineering for AI Systems D6 - Quality Attributes and Temporal Logic", "Ability to separate requirements from specifications from domain assumptions and argue that a specification + domain assumptions satisfy requirements", "Ability to model requirements in a variety of modelling paradigms", "Ability to elicit and document non-functional requirements such that the to-be-developed software can be objectively tested for their satisfaction", "Ability to use tools to manage a Software Development Team.", "Why is requirements analysis complex?", "Functions as a modelling notation.  Pre- and post-conditions.", "Use-case diagrams.", "Functions over a class diagram.", "Modelling dynamic behaviour of a software system.", "UML State Machines.", "Specification patterns.", "7: Model Integration (1 hour)", "The expected contents and organization of a Software Requirements Specification (SRS).", "AI vs non-AI Systems based on what we covered in this course.", "Braek and Haugen, Engineering real-time systems: an object-oriented methodology using SDL, Prentice-Hall, 1993.", "Larman, Applying UML and Patterns, Prentice Hall, 2004.", "Maciaszek, Requirements Analysis and System Design, Addison Wesley, 2001.", "Bray, An Introduction to Requirements Engineering, Addison-Wesley, 2002.", "Nuseibeh and Zave, Software Requirements and Design:", "van Lamsweerde, Requirements Engineering: From System Goals to UML Models to Software Specifications, Wiley, 2009.", "Brooks, The Design of Design, Addison Wesley, 2010.", "Alan Davis, Just Enough Requirements Management: Where Software Development Meets Marketing, Dorset House Publishing, 2005.", "The project can be related to requirements engineering or a more general software engineering topic.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 105, "course_code": "CS 446", "course_name": "CS446 - Software Design and Architectures (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Software Design and Architectures Winter 2025", "10:00AM - 11:20AM MC 1056", "10:00AM - 11:20AM MC 1056", "10:00AM - 11:20AM MC 1056", "- Saarang Agarwal <saarang.agarwal@>", "- Bihui Jin <bihui.jin@>", "- Daniel Phan <daniel.phan@>", "- Amber Wang <jiale.wang@>", "ECE 452: View requirements for ECE 452", "Differentiate how various architectural styles and design patterns enhance and degrade a system’s functional, non-functional and human value properties;", "Create and implement an architecture and design, refining it into a complete system;", "1 Jan 06 Mon Introduction to Class", "Jan 15 Wed Use Cases, Human Values", "Jan 17 Fri **P0** Team Formation", "Jan 31 Fri **P2** Project Proposal", "Feb 12 Wed **P3** Iteration 1 Demo", "Feb 26 Wed Design Patterns 2 - Structural", "9 Mar 03 Mon Design Patterns 3 - Behavioral", "Mar 05 Wed **P4** Iteration 2 Demo", "10 Mar 10 Mon Design Patterns 4", "Mar 19 Wed **P5** Iteration 3 Demo", "Apr 02 Wed **P6** Final Presentation", "Apr 04 Fri **P7** Final Report", "Jan 17 P0: Team Formation -", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 106, "course_code": "CS 447", "course_name": "CS447 - Software Testing, Quality Assurance, and Maintenance (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "04:00PM - 05:20PM", "Weiyi Shang <wshang@uwaterloo.ca>", "Introduces students to systematic testing of software systems.", "ECE 453: View requirements for ECE 453", "Organized testing can help identify problems in software systems, enabling developers to fix these problems.", "And easier-to-test software is better software.", "• You will be able to create and evaluate test suites for reasonably-sized software systems.", "• You will learn how to effectively test during the software engineering process.", "Creating tests", "Test minimization", "Week 12 March 27th Field testing", "Late policy: every person can have a late (max 24 hours) deliverable once", "Notice of Recording"]}, {"course_id": 107, "course_code": "ECE 406", "course_name": "ECE406 - Algorithm Design and Analysis (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Algorithm Design and Analysis Winter 2025", "ECE 406", "ECE 406 001", "11:30AM -", "E. Creager", "04:00PM - 05:20PM", "E. Creager", "04:00PM - 05:20PM", "• Rushabh Solanki", "ECE 406:", "Design and analysis of efficient, correct algorithms.", "Advanced data structures, divide-and-conquer algorithms, recurrences, greedy algorithms, dynamic programming, graph algorithms, search and backtrack, inherently hard and unsolvable problems, approximation and randomized algorithms, and amortized analysis.", "View requirements for ECE 406", "How to design efficient algorithms using divide and conquer, greedy algorithms, and dynamic programming.", "The kinds of problems that can be solved with linear programming, and why they can be solved efficiently.", "What it means to reduce one problem to another, and how it used in complexity analysis", "Introduction to algorithms Chapter 0 0.5 hours", "Divide and conquer algorithms Chapter 2 5 hours", "Graphs, decompositions and depth-first search Chapter 3 3 hours", "Linear Programming: Simplex algorithm, duality theorem Chapter 7 4 hours", "No lectures during ECE midterms week (Feb 24--28)", "LEC001] Tue 2:30--3:30pm in E7-5353", "Assignments Information and Guidelines: Assignments are given roughly every other week, and their primary goal is to give you practice in designing and analyzing algorithms.", "You must list these collaborators at the top of the first page of your assignment (there is no penalty for listing collaborators, but it ensures we do not falsely identify plagiarism).", "In submitting an assignment, you are “signing off on your work” as described in the academic integrity form at https://uwaterloo.ca/academic-integrity/. The penalty for a first plagiarism offence is -100% for the assignment.", "* Each student must turn in a signed academic integrity form to confirm their understanding of the above policies.", "Notice of Recording"]}, {"course_id": 108, "course_code": "ECE 409", "course_name": "ECE409 - Cryptography and System Security (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Cryptography and System Security Winter 2025", "04:00PM - 05:20PM", "08:30AM - 09:50AM E7 5353", "Introduction to cryptology and computer security, theory of secure communications, points of attack, conventional cryptographic systems, public key cryptographic systems, standards, firewalls, wireless system security, applications.", "View requirements for ECE 409", "This course will provide introduction to  cryptography and system security.", "It covers  basic concepts in cryptography and system security,   types of attacks, trust and threat models,  pseudorandomness, computational security,  symmetric-key  cryptography,  public-key cryptography,   attacks on cryptographic operations,   network security protocols,   wireless system security and privacy,  applications in IoT systems,   special topics on  privacy preserving  AI,   quantum key  distribution and post-quantum cryptography.", "Explain the principles of cryptography and system security.", "Explain how practical schemes of symmetric-key cryptography and public-key cryptography are designed and implemented.", "Analyze the security and privacy protections in wireless systems and their applications in IoT.", "Apply security principles to solve problems in concrete applications.", "Introduction  to Cryptography  and System Security", "Cryptography and cryptanalysis", "Basic protections: encryption and authentication", "Classification of cryptosystems", "Basic  concepts of secure systems.", "Types of attacks,  trust and threat model", "Computational security and one-way functions", "Chapter 3. Symmetric-key Cryptographic Systems", "Arithmetics of binary finite fields", "Secure hash functions: SHA1, SHA2 and SHA3", "MAC and forgery attack", "Time-memory trade-off attacks and attacks by AI", "Public-key Cryptographic Systems", "Arithmetic operations", "Security of public-key cryptography (factorization, DL, LWE)", "Practical public-key systems (DH, RSA, DSA, ECC)", "Fault side-channel attacks", "Network Security Protocols", "Implementing secure systems:  PKI  and  X.509 certificates", "Hop-by-hop versus end-to-end protections and VPN", "Chapter 6. Wireless System Security", "5G security architecture for IoT security and privacy", "Privacy preserving machine learning: secret sharing; securing federate learning", "Basic concepts for quantum cryptography", "Quantum key distribution", "Post-quantum cryptography", "Communication System Security L.L. Chen and G. Gong", "R. Anderson, Security Engineering A Guide to Building Dependable Distributed Systems, Wiley, 2014 (Anderson14).", "Schneier on Security, http://www.schneier.com/blog/. A blog covering current computer security and privacy issues.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 109, "course_code": "ECE 414", "course_name": "ECE414 - Wireless Communications (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 414", "ECE 414 001", "Transmission and reception techniques for wireless channels.", "Fundamentals of cellular communications and multiple-access schemes.", "understand the basic characteristics of wireless channels.", "appreciate the fundamental role of diversity in wireless communications.", "have a deep understanding of different transmission and reception techniques.", "have a basic understanding of cellular systems.", "analyze and compare the performance of different coding schemes."]}, {"course_id": 110, "course_code": "ECE 416", "course_name": "ECE416 - Advanced Topics in Networking (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Advanced Topics in Networking Winter 2025", "TBA", "TBA", "TBA", "Access code to sign up (if not already enrolled): ece416-w25", "View requirements for ECE 416", "Understand the structure, addressing, and operational aspects of IPv6, and evaluate its advantages over IPv4 in addressing scalability and security challenges", "Understand the principles of Quality of Service (QoS) in networking, including techniques and protocols used to manage bandwidth, reduce latency, prioritize traffic, and ensure reliable data transmission for diverse applications.", "Examine the concepts of mobility in 4G and 5G networks, including tunnel routing mechanisms, and assess their impact on network performance and application delivery.", "Investigate IoT architectures, protocols, and security challenges, and understand their applications in smart environments and industrial systems.", "Conduct research-driven projects on advanced networking topics, present findings through technical papers and presentations, and engage in constructive peer discussions", "Introduction and review of ECE 358", "Introduction to Security in Computer Networks", "Software defined networks", "Security in Computer Networks (Will be split across different layers)", "Month", "F", "Deliverables", "Multiple dropboxes has been created for your submissions as follows:", "Partial/full solutions for these problem sets will be posted on the course website.", "This course includes the independent development and practice of specific skills, such as writing a white paper.", "Library for research-based assignments"]}, {"course_id": 111, "course_code": "ECE 417", "course_name": "ECE417 - Image Processing (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Image Processing Winter 2025", "Monday, Friday -", "Topics include intensity transformations for image enhancement, two-dimensional discrete Fourier transform, spatial and frequency domain linear image filtering, nonlinear image filtering, binary image processing, edge detection, image segmentation, and digital video processing basics.", "View requirements for ECE 417", "This course also includes advanced topics including statistical and perceptual image modeling and processing; and compression, streaming, robustness, and scalability issues in visual communications.", "Understand basic theories and methodologies of digital image processing", "Digital image and video processing: Intensity transformations for image enhancement; spatial domain linear filtering; frequency domain linear filtering; nonlinear image filtering; image sampling and interpolation; motion and digital video processing.", "Image analysis and understanding: Edge detection; image segmentation; energy preserving and energy compaction; principle component analysis and independent component analysis; sparse representations; wavelet and multiresolution image analysis; non-linear image analysis.", "Statistical and perceptual image modeling and processing: Spatial domain image statistics; Fourier domain statistical image models; wavelet domain statistical image models; Markov random field models; computational models of the human visual system; perceptual image quality assessment and processing; data-driven and learning-based image processing algorithms.", "Visual communications: compression, quality, streaming, robustness and scalability: Video compression and standards; quality-of-service and quality-of-experience; adaptive video streaming; error resilient visual coding and communications; scalable image and video coding and communications.", "Electronic copies of lectures and study materials will be provided at course web site.", "Additional references include research papers published in journals, conferences and open-source archives that can be found online.", "Homework assignments are not graded but will be helpful for students to understand basic image processing concepts and algorithms, and will also be helpful for the preparation of the final exam.", "A research project that attempts some new investigations in a specific direction.", "The project presentation slides and reports should be submitted via Dropboxes at LEARN."]}, {"course_id": 112, "course_code": "ECE 423", "course_name": "ECE423 - Embedded Computer Systems (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Embedded Computer Systems Winter 2025", "04:00PM - 05:20PM", "Emon Sarkar esarkar@uwaterloo.ca", "Specification and design of embedded systems, specification languages, hardware/software co-design, performance estimation, co-simulation, verification, validation, embedded architectures, processor architectures and software synthesis, system-on-a-chip paradigm, retargetable code generation and optimization, verification and validation, environmental issues and considerations.", "View requirements for ECE 423", "Part I: Introduction", "Part II: Embedded Systems and SoC Design", "4.5", "Part VII: Embedded Architecture: System Architecture", "4.5", "Part X: System Software for Embedded Multicores", "The deliverables for each assignment consist of a demo and a report.", "Help sessions will be scheduled in the lab room E2 2356A every week, starting on the second week of classes and excluding reading week, on the following day and time: Wednesday 2:00PM-5:00PM.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 113, "course_code": "ECE 432", "course_name": "ECE432 - Radio Frequency Integrated Devices and Circuits (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Radio Frequency Integrated Devices and Circuits Spring 2024", "08:30AM - 09:50AM E7 4433", "S. Su", "04:00PM - 05:20PM", "An introduction to the theory and practice of Radio Frequency (RF) Integrated Circuit design.", "Physics and modelling of RF integrated components such as resistor, inductor, capacitor (RLC) passives, diodes, metal oxide semiconductor field-effect transistors (MOSFETs), high electron mobility transistors, hetero-junction bipolar transistors.", "An introduction to radio frequency and high-speed integrated circuit design.", "Topics include physics and modelling of passive components (diode, R, L, C, transformer, and transmission line) and transistors (MOSFETs and BJTs) on a silicon chip; design of transistor-level circuit building blocks, including wideband/tuned amplifiers, frequency synthesizers (e.g., oscillators, phase-locked loops), mixers and multipliers, power amplifiers, filters; signal processing and conditioning techniques and analysis of modern communication and computing systems.", "Innovative and complete designs may be good candidates for peer-reviewed publications in IEEE CASS and SSCS.", "Students will use industry-standard design tools and flows, with potential for top designs to be ported to advanced CMOS technologies, fabricated, and measured at UWaterloo.", "Analyze and design the main circuit blocks of a modern transceiver", "Specify components, circuits and sub-systems for use in high-speed/RF circuits", "Describe the behavior of RF and high-speed systems in terms of sensitivity, dynamic range, etc.", "Device Physics and Modeling (Diode, MOS and BJT)", "Amplifiers (Basic Topologies and Biasing) Homework 1", "Impedance Matching and Filters Homework 2", "Tuned Amplifiers (Narrowband LNAs) Lab 3", "Communication and Computing Systems Lab 4", "Signal Processing and Modulation Techniques Homework 4", "Mixers and Multipliers Lab 5", "Power Amplifiers, Nonlinearity and Distortion Homework 5", "A. S. Sedra & K. C. Smith, Microelectronic Circuits 8th edition Yes", "laptop/desktop used for simulations Yes", "If you miss both exams, it will be handled on a case-by-case basis."]}, {"course_id": 114, "course_code": "ECE 433", "course_name": "ECE433 - Fabrication Technologies for Micro and Nano Devices (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Fabrication Technologies for Micro and Nano Devices Spring 2024", "ECE 433", "ECE 433 001", "04:00PM - 05:20PM", "ECE 433:", "Plasma-assisted and wet-chemical etch processes.", "Fabrication processes for transistors, complementary metal-oxide semiconductor (CMOS), and thin film devices.", "Micro-electro-mechanical systems (MEMS) technology.", "Process techniques for nanoelectronic devices.", "Explain how plasma discharges and how to create them.", "Determine junction formation processes for microelectronic device needs.", "Explain nanopatterning principles and limits of optical lithography.", "Section 6: Optical Lithography and its limits", "Section 10: Transistor and CMOS Fabrication", "Fabrication lab visits Mandatory"]}, {"course_id": 115, "course_code": "ECE 444", "course_name": "ECE444 - Integrated Analog Electronics (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Integrated Analog Electronics Winter 2025", "11:30AM -", "04:00PM - 05:20PM", "08:30AM - 09:50AM E7 4433", "Email", "Analog electronics exploits the physical behaviour of electronic devices to create electronic systems.", "The performance of single and multiple transistor amplifying stages are studied.", "Followed by a study of biasing, current mirror, and output stages, which are then combined in the study of operational amplifier circuits.", "Frequency response and feedback are then reviewed leading to a detailed study of stability and compensation for multistage and operational amplifiers.", "View requirements for ECE 444", "Analog integrated circuits (ICs) exploit the physical behaviour of electronic devices to create electronic systems.", "We will study the performance of single- and multiple-transistor amplifying stages.", "This is followed by a study of biasing, current mirrors, and output stages, which are then combined in the study of operational amplifiers.", "We then review frequency response and feedback, leading to a detailed study of stability and compensation for multistage and operational amplifiers.", "We will mostly study complementary metal-oxide-semiconductor (CMOS) circuits, but will use bipolar junction transistors (BJTs) for certain applications.", "The course finishes with a look at switched-capacitor circuits and data converters, including analog-to-digital converters (ADCs) and digital-to-analog converters (DACs).", "The knowledge and skills you will learn in this course will prepare you to:", "Pursue graduate studies in IC design (this is usually necessary to work as an IC designer in industry).", "Analyze and design some common analog IC components.", "Model and simulate analog IC components at different levels of abstraction.", "MOSFETs: regions of operation, small-signal models, body effect, weak inversion, intrinsic gain, and transition frequency", "Cascode operational transconductance amplifiers (OTAs) and Gm-C filters", "Current and voltage references", "CMOS two-stage OTA and frequency compensation", "Power amplifiers and output stages", "Data converters", "**NOTE:", "Closed book and closed notes", "Non-programmable, non-graphing scientific calculator is allowed", "A formula sheet will be provided", "The labs involve using LTspice from Analog Devices to design and simulate various circuit blocks using a commercially-available CMOS IC technology.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as circuit simulation.", "Library for research-based assignments"]}, {"course_id": 116, "course_code": "ECE 445", "course_name": "ECE445 - Integrated Digital Electronics (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Integrated Digital Electronics Spring 2024", "Monday, Friday -", "04:00PM - 05:20PM E7 4043", "Complementary Metal-Oxide Semiconductor (CMOS) inverter; combinational CMOS circuit design - logic styles for low power, high performance circuits; sequential CMOS circuit design - flip-flops, pipelines, Schmitt trigger; CMOS arithmetic circuits; interconnect parasitic; clocking and timing considerations in digital Very Large Scale Integration (VLSIs).", "Design digital MOS integrated circuit logic circuits", "MOS Transistor"]}, {"course_id": 117, "course_code": "ECE 451", "course_name": "ECE451 - Software Requirements Specification and Analysis (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Software Requirements Specification and Analysis Winter 2025", "10:00AM - 11:20AM MC 2035", "Email:x784chen@uwaterloo.ca", "Email: ar2elsha@uwaterloo.ca", "Email: d3pang@uwaterloo.ca", "Models, notations, and processes for software requirements identification, representation, analysis, and validation.", "ECE 451: View requirements for ECE 451", "The week of", "Deliverables", "1 Introduction", "3 RE Reference Model", "Jan 13 4 Domain Model 4 Domain Model D0 – Group members & Project idea", "Jan 27 7 Functional Modelling 8 OCL D1 – Domain Model & Stakeholders", "Feb 10 10 Quality Requirements 10 Quality Requirements D2 -  Use case Diagram & Description", "Feb 24 11 Requirements Conflict management 12 Prioritizing Requirements D3 – Functional Model & OCL", "Mar 3 13 Cost Estimation 14 Risk Analysis D4 – State Diagram", "Mar 17 15 Temporal Logic 16 Validation and Verification D5 – Cost Estimation & Risk Analysis", "Mar 31 17 Software Project Management 18 Requirement Engineering for AI Systems D6 - Quality Attributes and Temporal Logic", "Ability to separate requirements from specifications from domain assumptions and argue that a specification + domain assumptions satisfy requirements", "Ability to model requirements in a variety of modelling paradigms", "Ability to elicit and document non-functional requirements such that the to-be-developed software can be objectively tested for their satisfaction", "Ability to use tools to manage a Software Development Team.", "Why is requirements analysis complex?", "Functions as a modelling notation.  Pre- and post-conditions.", "Use-case diagrams.", "Functions over a class diagram.", "Modelling dynamic behaviour of a software system.", "UML State Machines.", "Specification patterns.", "7: Model Integration (1 hour)", "The expected contents and organization of a Software Requirements Specification (SRS).", "AI vs non-AI Systems based on what we covered in this course.", "Braek and Haugen, Engineering real-time systems: an object-oriented methodology using SDL, Prentice-Hall, 1993.", "Larman, Applying UML and Patterns, Prentice Hall, 2004.", "Maciaszek, Requirements Analysis and System Design, Addison Wesley, 2001.", "Bray, An Introduction to Requirements Engineering, Addison-Wesley, 2002.", "Nuseibeh and Zave, Software Requirements and Design:", "van Lamsweerde, Requirements Engineering: From System Goals to UML Models to Software Specifications, Wiley, 2009.", "Brooks, The Design of Design, Addison Wesley, 2010.", "Alan Davis, Just Enough Requirements Management: Where Software Development Meets Marketing, Dorset House Publishing, 2005.", "The project can be related to requirements engineering or a more general software engineering topic.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 118, "course_code": "ECE 452", "course_name": "ECE452 - Software Design and Architectures (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Software Design and Architectures Winter 2025", "10:00AM - 11:20AM MC 1056", "10:00AM - 11:20AM MC 1056", "10:00AM - 11:20AM MC 1056", "- Saarang Agarwal <saarang.agarwal@>", "- Bihui Jin <bihui.jin@>", "- Daniel Phan <daniel.phan@>", "- Amber Wang <jiale.wang@>", "ECE 452: View requirements for ECE 452", "Differentiate how various architectural styles and design patterns enhance and degrade a system’s functional, non-functional and human value properties;", "Create and implement an architecture and design, refining it into a complete system;", "1 Jan 06 Mon Introduction to Class", "Jan 15 Wed Use Cases, Human Values", "Jan 17 Fri **P0** Team Formation", "Jan 31 Fri **P2** Project Proposal", "Feb 12 Wed **P3** Iteration 1 Demo", "Feb 26 Wed Design Patterns 2 - Structural", "9 Mar 03 Mon Design Patterns 3 - Behavioral", "Mar 05 Wed **P4** Iteration 2 Demo", "10 Mar 10 Mon Design Patterns 4", "Mar 19 Wed **P5** Iteration 3 Demo", "Apr 02 Wed **P6** Final Presentation", "Apr 04 Fri **P7** Final Report", "Jan 17 P0: Team Formation -", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 119, "course_code": "ECE 453", "course_name": "ECE453 - Software Testing, Quality Assurance, and Maintenance (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "04:00PM - 05:20PM", "Weiyi Shang <wshang@uwaterloo.ca>", "Introduces students to systematic testing of software systems.", "ECE 453: View requirements for ECE 453", "Organized testing can help identify problems in software systems, enabling developers to fix these problems.", "And easier-to-test software is better software.", "• You will be able to create and evaluate test suites for reasonably-sized software systems.", "• You will learn how to effectively test during the software engineering process.", "Creating tests", "Test minimization", "Week 12 March 27th Field testing", "Late policy: every person can have a late (max 24 hours) deliverable once", "Notice of Recording"]}, {"course_id": 120, "course_code": "ECE 454", "course_name": "ECE454 - Distributed Computing (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Distributed Computing Spring 2024", "ECE 454", "ECE 454 001", "10:00AM - 11:20AM E7 4043", "08:30AM - 09:50AM E7 4043", "04:00PM - 05:20PM E7 4043", "ECE 454 101", "07:00PM - 07:50PM E7 4043", "Teaching Team Member Role Office Email", "Dr. Tahsin Reza Instructor DC-2536 tahsin.reza@uwaterloo.ca", "ECE 454:", "Principles of distributed computing; architectures and middleware; servers, processes, and virtualization; upper-layer network protocols, interprocess communication and remote procedure calling; concurrency, synchronization and distributed algorithms, dependable distributed systems and fault tolerance.", "Antirequisite: Must not have taken or concurrently enrolled in CS 454/654 - Distributed Systems.", "Understand the architectures, protocols and algorithms underlying modern distributed systems.", "Understand fundamental techniques for making distributed systems scalable and dependable, and reason about design trade-offs.", "Use a scalable data processing framework to solve fundamental analytics problems.", "Use a fault-tolerant coordination service for configuration management, synchronization, and failure detection in a distributed software system.", "Use a stream processing engine to perform real-time analytics.", "Discuss the relative merits of distributed versus centralized systems.", "Distributed Systems 4th", "Unauthorized collaboration and copying of material constitute academic offences under Policy 71.", "If a student’s solution differs substantially from the solution(s) accepted by the teaching team the student may be asked to provide sample inputs and outputs to evaluate the correctness of their solution.", "Alternatively, the teaching team may accept a modified solution for regrading and apply a penalty.", "Unauthorized collaboration and copying of material constitute academic offences under Policy 71.", "Intellectual Property: Learning materials used in this course contain the intellectual property of current and past members of the teaching team.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 121, "course_code": "ECE 455", "course_name": "ECE455 - Embedded Software (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Embedded Software Spring 2024", "ECE 455", "Monday, Friday -", "11:30AM -", "04:00PM - 05:20PM E7 4043", "- Name: Sebastian Fischmeister", "- Email: sfischme@uwaterloo.ca", "- Name: Murray Dunne", "- Email: mdunne@uwaterloo.ca", "- Office hours: on demand in Microsoft Teams", "- Email: mdpintur@uwaterloo.ca", "- Office hours: on demand in Microsoft Teams", "ECE 455:", "This course covers computing elements, structures in embedded software, resource access protocols, uniprocessor scheduling, programming-language support, languages for MDD (model-driven development), worst-case execution time analysis, and overview of embedded distributed systems.", "Explain real-time systems and associated terms and vocabulary", "Perform schedulability checks for task on single-processor systems", "Perform worst-case execution time analysis", "Understand qualification and certification and the application of ISO 26262 in the automotive space", "Understand clock-driven scheduling", "Define and program temporal controls in programs", "Design fault tolerant systems", "M3: Embedded Systems Debugging", "M5: Worst-case Execution Time Analysis", "M6: Clock-driven Scheduling", "M7: Priority-driven Scheduling", "M9b: Failure Mode and Effects Analysis", "M10: Safety-critical Systems Standards", "M12: Embedded System Security", "Computers as Components: Principles of Embedded Computing System Design.", "Introduction to Embedded Systems: A Cyber-physical Systems Approach.", "Dependability: Basic concepts and terminology.", "Dependability: Basic Concepts and Terminology.", "In Handbook of Real-time and Embedded Systems.", "Notice of Recording"]}, {"course_id": 122, "course_code": "ECE 457A", "course_name": "ECE457A - Co-operative and Adaptive Algorithms (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Co-operative and Adaptive Algorithms Fall 2024", "ECE 457A", "E7 3343", "• Huda Diab Abdulgalil: Email hdiababd@uwaterloo.ca", "The course starts by addressing the ill-structured problems and need for computational intelligence methods.", "It introduces the concepts of heuristics and their use in conjunction with search methods, solving problems using heuristics and metaheuristics, constraints satisfaction.", "The course also introduces the concepts of co-operation and adaptations and how they are influencing new methods for solving complex problems.", "The course starts by illustrating how the concepts of co-operation and adaptation are manifested in nature and how such models are inspiring new types of solutions methods.", "Topics to be covered include search algorithms, game playing, constraints satisfaction, meta-heuristics, evolutionary computing methods, swarm intelligence, ant-colony algorithms, particle swarm methods, adaptive and learning algorithms and the use of these algorithms in solving continuous and discrete problems that arise in engineering applications.", "View requirements for ECE 457A", "Motivate the need for algorithms that exhibit a degree of intelligence: logical, computational, and biologically inspired.", "Introduce the concepts of cooperation and adaptations and how they are influencing new methods for solving complex problems.", "Illustrate the use of these algorithms in solving continuous and discrete, and machine learning problems", "Introduction: About this course, AI, Adaptation, Cooperation, goals and definitions of artificial intelligence;", "ill-structured problems and need for approximate algorithms, cooperation and adaptation in nature.", "Search: state space problem formulation and representation;", "use of heuristic search methods and meta-heuristic algorithms", "Trajectory Methods: Tabu search", "Engineering use cases", "Engineering use cases", "Mathematical Models of Genetic Algorithms", "Introduction to Swarm Intelligence: cooperation and adaptation methods inspired by nature.", "Engineering use cases", "Engineering use cases", "Evolutionary Programming: Continuous and Discrete EP", "Finite State Machine Optimization", "Evolutionary Strategies", "Self-Adaptive Evolution Strategies", "Introduction to evolutionary computing Introduction to evolutionary computing, by Eiben and A, Smith, J.E, Springer, Berlin, 2003.", "Search and Optimization by Metaheuristics Techniques and Algorithms Inspired by Nature Search and Optimization by Metaheuristics Techniques and Algorithms Inspired by Nature Ke-Lin Du, M. N. S. Swamy No", "Search Algorithms Types: Breadth and Depth First Search Algorithm Search Algorithms Types: Breadth and Depth First Search Algorithm Merium Hazem Anwar Labib Bishara, Merihan Hazem Anwar Labib Bishara No", "**The lecture notes are copy-right protected material.", "Such behaviour includes:", "Adhering to the principles of academic integrity when conducting and reporting research.”"]}, {"course_id": 123, "course_code": "ECE 457B", "course_name": "ECE457B - Fundamentals of Computational Intelligence (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Fundamentals of Computational Intelligence Winter 2025", "ECE 457B", "Monday, Friday -", "10:00AM - 11:20AM E7 5353", "04:00PM - 05:20PM", "Da Saem Lee : ds3lee@uwaterloo.ca", "Communication and Discussion", "If you really have a critical time issue, or you don't want the TA's to see the message (for any reason at all), then you should send Prof. Crowley a direct message on Teams chat in addition to email.", "Model-based prediction and classification.", "Multiple examples and case studies such as autonomous driving, intelligent manufacturing, natural language understanding, speech recognition, computer vision, stock market prediction, disease early detection and diagnosis.", "View requirements for ECE 457B", "It encompasses a broad spectrum of supervised learning topics, including nonparametric and parametric models, linear and nonlinear approaches, deep learning paradigms, and probabilistic models.", "Theoretical knowledge is translated into practice through tutorials on industry-standard tools such as PyTorch and Keras.", "Interactive classroom discussions will pivot around both the practical trade- offs inherent in real-world applications and the theoretical underpinnings that provide an intuitive grasp of the field.", "These topics are an outline, and each year some subset of non-core topics will be skipped due to time constraints and in order to benefit students through deeper focus.", "Classification I", "Distance based - k-Nearest Neighbours (kNN)", "Fundamentals of Parameter Estimation and Learning", "MAP Implementation as Classification: Naive Bayes Algorithm", "Dimensionality Reduction and Manifold Learning", "Vector Embeddings : TF-IDF, Word2Vec, BERT", "Kernel Methods and Latent Models", "k-Means Algorithm, DBScan Algorithm", "Anomaly Detection: Classification, Outlier, Density, and Isolation based", "Classification III : Data, Image and Time-series classification using Deep Learning", "Representation Learning II: Auto-encoders and Variational Auto-Encoders", "Attention and Transformer Networks", "Some additional information and links might be here for older courses.", "A visual grading tool for pdfs submissions of tests and assignments, allows limited online test with mark-down text entry and multiple choice questions.", "Some assignments and tests might be made available online for submission using this tool as well.", "Arxiv Tutorials - pdfs will be posted to hypothes.is and others links will be provided to a number of detailed tutorials on some course topics.", "The first half covers many of basics of this course, while the second half focusses on Deep Learning only.", "Exams", "Completing the assignments will require multiple skills:", "familiarity with statistical, probabilistic analysis of data and results", "logical design and clear description of a expeirmental methodology", "programming various algorithms for processing, training and analysis of data to achieve given tasks (programming will be in Python using libraries such as sci-kit learn and tensorflow, pytorch, pandas)", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 124, "course_code": "ECE 457C", "course_name": "ECE457C - Reinforcement Learning (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["04:00PM - 05:20PM E7 4043", "Introduction to reinforcement learning (RL) theory and algorithms for learning decision-making policies in situations with uncertainty and limited information.", "Suggested Background", "The course will use some concepts from ECE 203 and ECE 307 on Bayesian Probability and Statistics, these will be reviewed but familiarity will help significantly.", "All other concepts needed for the course will be introduced directly.", "Identify and Explain the component theoretical concepts of Reinforcement Learning systems.", "Evaluate the performance of a particular RL system on a given domain through proper experimental design, statistical analysis and visualization", "Assess and critique the applicability of general RL concepts and specific RL algorithms to various problem tasks in Data Science, Artificial Intelligence, Planning, Control, and Machine Learning.", "Motivation and Context", "Importance of reasoning and decision making about uncertainty.", "Decision making under uncertainty:", "Theory, Bellman equations", "Value Iteration, Policy Iteration", "Other variants of these", "Value Function Approximation", "supervised training, back-propagation", "Experience replay buffers, mini-batch training and other methods of training and architecture", "Actor-Critic methods", "Decision Transformers", "Other Uses of RL Concepts", "Human Preference Elicitation - especially for Foundation Models and Large Language Models", "Moral Psychology - theories on human moral reasoning rely heavily on RL concept", "Wrap-up and Review", "Dimitrakakis2019", "Once you get through the first half of our course, many of the concepts on this site will be familiar to you.", "Family Tree of Algorithms - Here, a list of algorithms at the cuttingedge of RL as of 1 year ago to so, so it'sa good place to find out more.", "But in a fast growing field, it may be a bit out of date about the latest now. https://spinningup.openai.com/en/latest/spinningup/rl_intro2.html", "Piazza : ECE457C Discussions - TBD", "A visual grading tool for pdfs submissions of tests and assignments, allows limited online test with mark-down text entry and multiple choice questions.", "Some assignments and tests might be made available online for submission using this tool as well.", "Assignment will involve a mixture of short answers, mathematical solutions, programming in python and reporting of results of performance and outcomes of trained RL policies on provided simulated environments.", "Recipe for success:", "University can be a challenging environment and it is normal to need support from time-to-time.", "see these slides on university policy for COVID-19 safety once in-person classes begin again.", "If the student has a medical reason why they cannot wear a mask they should contact the professor electronically and provide proof of this.", "Whena student asks or answersa question it may be difficult for them to be heard while wearing a mask.", "Students can find the Illness Self-declaration form in the  Personal Information section of Quest.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 125, "course_code": "ECE 458", "course_name": "ECE458 - Computer Security (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Monday, Friday -", "10:00AM - 11:20AM E7 4043", "04:00PM - 05:20PM E7 4043", "07:00PM - 07:50PM E7 4043", "ECE 750 001", "Monday, Friday -", "10:00AM - 11:20AM E7 4043", "04:00PM - 05:20PM E7 4043", "Dr Kami Vaniea", "Cameron Hadfield <cmlhadfield@uwaterloo.ca>", "Introduction to computer security.", "Models of security.", "Software security, vulnerabilities, threats, defenses and secure-software development processes.", "Secure design principles, techniques and security evaluation.", "ECE 750:", "If these are used, the instructor will make a best effort to record the lecture.", "Conflicts with these time slots are fine and should not prevent a student from doing well in the course.", "Recognise common security threats against computer systems and know the basic mechanisms to address them", "Think critically about security threats using the STRIDE model and break down the concept of \"security\" into its component parts", "Know the most common programming flaws and how they can manifest in code", "Explain what the lock icon near the URL bar means (or the \"connection is secure\" in Chrome)", "Read a URL correctly and learn why doing so in all cases is nearly impossible for humans", "Explain what a cookie is and why it gives people more control than advertising codes used by mobile phones", "Basics of Security - Thinking about security in a structured way (CH1)", "Trust and threat model", "Running example of HTTPS", "Introduction to Usable Security and Privacy", "Access control concepts", "Password based authentication", "Multi-factor authentication and passwordless authentication", "Kerberos and open-authorization", "Introduction to phishing (scam) attacks", "Cryptography Basics (CH2.3)", "Pseudorandom generation", "Symmetric-key vs Asymmetric cryptography", "Public-key cryptography and digital signature", "Malicious code - Malware", "Memory security", "Basics of network securityThis is", "Firewalls and VPN", "Security of IEEE 802.11 and 4G-LTE/5G", "Attacks on clients and servers", "Email security", "Applications", "Schneier on Security http://www.schneier.com/blog/ A blog covering current computer security and privacy issues.", "The lab contains many hand-on experiments and some crafted attacks can be launched under their speciﬁc environment for better understanding them.", "The instructor and/or TAs may use custom internally developed scripts to check for high overlap between coursework submissions.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 126, "course_code": "ECE 459", "course_name": "ECE459 - Programming for Performance (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 459", "Monday, Friday -", "08:30AM - 09:50AM E7 5353", "04:00PM - 05:20PM", "Monday, Friday -", "04:00PM - 05:20PM", "11:30AM -", "07:00PM - 07:50PM E7 5353", "07:00PM - 07:50PM E7 5353", "About Prof. Zarnett", "Then I got the AIF in the mail and decided I didn't want to study Computer Engineering after all.", "I'm an Associate Professor of Electrical and Computer Engineering.", "Some of you will know me as the previous Director of Software Engineering from back when you were in 1A. I studied math/CS yet convinced PEO to license me as a P.Eng.", "My research interests focus on using compiler and static analysis techniques to ensure program correctness.", "The LI is responsible for technical matters related to the assignments: git.uwaterloo.ca, git in general, administering the systems where you need to run your labs.", "And I enjoy engaging in discussions about these fields.", "Thanushon Sivakaran <tsivakar@uwaterloo.ca>", "Profiling computer systems; bottlenecks, Amdahl's law.", "View requirements for ECE 459", "Many modern software systems must process large amounts of data, either in the form of huge data sets or vast numbers of (concurrent) transactions.", "This course introduces students to techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs.", "These techniques will enable you to design and build critical software infrastructure, especially in an age of Big Data.", "While you may have seen some of these ideas in the context of operating systems (ECE350/SE350/CS350/MTE241) and concurrency (ECE252/CS343), this course gives you tools to make code run faster.", "Design and apply techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs.", "We intend to use these slots until we reach the end of the course material.", "The notes cite a number of sources, some of which are useful books.", "Rust familiarization and use of nonblocking I/O;", "Auto‐grading and auto‐feedback systems, including marmoset, may be used for the evaluation of some of your assignments.", "Acceptable collaboration includes discussing ideas and structures with others, as well as helping others debug their code.", "If your code is too close in structure to someone else's code, you are going to have a problem.", "Or, let's sum this up in two short instructions:", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, ChatGPT) and how such tools can be used to write and test code.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be diﬃcult to interpret on a discussion forum.", "The human visual system has evolved to perceive saber‐toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text‐mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 127, "course_code": "ECE 462", "course_name": "ECE462 - Electrical Distribution Systems (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electrical Distribution Systems Spring 2024", "ECE 462", "10:00AM - 11:20AM E7 4433", "04:00PM - 05:20PM", "This course provides the students an understanding of the operation, analysis, and design of electric power distribution systems, starting with estimation of the loads on the network to the detail design of the distribution system networks.", "The primary objective of the course is to provide students with the skills to understand the analytical and design methods and modern tools for solution of problems associated with electric distribution system engineering.", "This course teaches electric distribution system engineering planning and operation principles.", "Important concepts and various tools of distribution system engineering are discussed in this course.", "The topics covered in this course include the structure of the distribution systems in Ontario, smart grids, load characteristics & load metrics, distribution system feeder modelling, voltage drop and power loss calculations, distribution system reliability, voltage regulation and application of capacitor to distribution system.", "Understand distribution systems main components", "Realize the main elements of smart grids", "Perform the basic calculations related to distribution systems operation", "Recognize the modern tools to control the operation of distribution system", "Apply artificial intelligence tools to distribution systems applications", "Number of Weeks", "Distribution System and Smart Grid Overview", "Ontario Distribution Systems", "Sub-transmission systems", "Distribution Substation", "Primary Distribution", "Secondary distribution", "Smart Grids", "Load Characteristics and Metrics", "Distribution System Feeder Modelling", "Underground cables modelling", "Voltage Drop and Power Loss Calculations", "Voltage Drop Calculations Using Allocated Loads", "Voltage Drop Calculations Using the Approximate Method", "Voltage Drop Calculations Using the K Factors", "Voltage Drop Calculations Using the Exact Lumped Load Model", "Voltage Drop Calculations Using Lumping the Loads in Geometric Configurations", "Power Loss Calculations", "Distribution Systems Load Flow Analysis", "Distribution System Reliability", "Distribution Reliability", "Standard Reliability Metrics", "Methods to Improve Reliability", "Application of Voltage Regulators", "Quality of Service and Voltage Standards", "Voltage Regulation", "Step-Voltage Regulators", "Voltage Regulators Data and Ratings calculations", "Three-phase Voltage Regulators", "Application of Capacitors", "Power Factor Correction", "Fixed Shunt Capacitors", "Approach for Sizing Fixed Capacitance", "Capacitor Banks Switching Control", "Distribution System Modeling and Analysis, by Kerstin, W. H., CRC Press 2018, ISBN 9781498772136 Textboob No", "Distribution System Engineering: Salama Lecture Notes No", "Distribution System Modeling and Analysis, by Kerstin, W. H., CRC Press 2018, ISBN 9781498772136", "Electric Power Distribution Handbook’ Short, Thomas Allen Short, 2014, CRC Press, ISBN 1466598654", "Electric distribution systems Sallam, A. A. (Abdelhay A.) Hoboken, N.J. : Wiley-IEEE Press 2018, Online ISBN:9781119509332 Reference Book No", "Electric power engineering handbook 2nd ed.", "Electrical transmission and distribution reference book Fifth Edition, 1997 Electric Systems Technology Institute ABB Power T&D Company Reference Book No", "The transmission and distribution of electrical energy, 3d ed.", "Students do not need to submit their solutions of the assignments and these solutions carry no weight in the final course marks.", "The course project is a survey on one of the applications of artificial intelligence tools to distribution systems.", "The midterm exam is a multiple-choice test.", "The link for these live sessions will be posted for each lecture on LEARN Calendar", "Students are expected to attend all online live lectures for learning and skill development", "In this case, the above marking scheme may be adjusted.", "Students will be notified of any changes to the marking scheme well in advance before the end of the term.", "In case of whole term online lectures, and exams will be held online"]}, {"course_id": 128, "course_code": "ECE 463", "course_name": "ECE463 - Design and Applications of Power Electronic Converters (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Design and Applications of Power Electronic Converters Spring 2024", "11:30AM -", "04:00PM - 05:20PM", "Switching characteristics of power semiconductor devices.", "Computer simulation of power electronic circuits.", "Analysis, design, and applications of power converters.", "Introduction to power electronics.", "Input and output filter design.", "Analysis, design, average modeling, control, and applications of power electronic converters.", "Design input/output second-order low-pass L-C filters for power electronic converters.", "Describe switching characteristics of power semiconductor devices.", "Quantify switching and conduction losses, and efficiency, in power electronic converters.", "Analyze, Design, model and control DC/DC and DC/AC switch-mode converters.", "Explain the role of power electronics in industrial applications.", "An extra lab session is used to introduce computer simulation of power electronic converters in PSIM environment.", "Power Electronic Circuit Simulation using PSIM", "Lab 3. DC Motor Speed Control using DC-to-DC converters", "The members in each lab/project group are expected to make equal contributions in all aspects.", "The project will focus on design and simulation of a power electronic system.", "Power Electronic Circuits Simulation using PSIM", "Using a recorded video, students will be introduced to PSIM and how to use the software to simulate power electronic circuits, with examples on DC/DC converters.", "Sections", "201 & 202", "201 & 202", "201 & 202", "Design and Simulation of a Power Electronics System", "Notice of Recording", "Email Correspondences:"]}, {"course_id": 129, "course_code": "ECE 464", "course_name": "ECE464 - High Voltage Engineering and Power System Protection (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["High Voltage Engineering and Power System Protection Winter 2025", "ECE 464", "11:30AM -", "11:30AM -", "04:00PM - 05:20PM", "ECE 464 101", "08:00PM -", "E-mails", "The course provides the fundamentals concepts of generation and measurements of high voltage ac, dc, and impulses.", "Briefly introduces the students to basic conduction and breakdown mechanisms of insulating materials.", "The scope of this course also includes understanding the basic protection system, studying the principles for protecting different elements and studying different technologies used in designing protective relays.", "Exposure to several state-of-art high voltage testing techniques of power system components will ensure that students have knowledge of the industrial solutions to the management of the problems associated with overvoltage and the protection mechanisms used.", "View requirements for ECE 464", "Lab 5: Electrostatic Analysis using COMSOL – An Introduction to Simulation Studies", "Part A: Generation and Measurement of High Voltages and Testing", "Sub-Topics", "Introduction", "Power and Energy Systems", "Importance of HV in power systems", "HV transmission system - growth", "HVAC and HVDC systems", "Components of high voltage power system", "Introduction to various insulation systems", "Introduction to power system protection devices", "HV Generation for Testing", "Origin of high voltage stresses", "HV testing requirements", "Test facilities", "Destructive and non-destructive tests", "AC power frequency sources", "Special test transformers", "Single and cascade transformers", "AC resonant circuits", "Generation of DC Voltages", "Rectifier circuits", "Voltage doubler", "Voltage multiplier circuits", "Electrostatic generators", "Basic impulse insulation levels", "Impulse voltage generation and analysis", "Use of standard test data and correction factors", "Resistive dividers", "Capacitive dividers", "Mixed dividers", "Low voltage arm connections and measuring instruments", "Part B: Basics of Conduction and Breakdown Mechanisms in Dielectrics", "Sub-Topics", "Source of charge carriers · High field conduction", "Collision mechanisms and ionization · Primary and secondary processes", "Statistical and formative time lags", "Impulse time-volt characteristics", "Visible corona; Corona inception and extinction", "Dielectric strength · Intrinsic breakdown", "Electromechanical breakdown", "Thermal equilibrium and breakdown", "PD Detection methods", "Discharge in cavities", "Breakdown and Conduction Mechanisms in Liquids", "Source of charge carriers – role of impurities", "Cavitation/bubble theory", "Applications – transformers, cables, etc.", "Part C: Insulation Coordination and Power System Protection", "Sub-Topics", "Overvoltages and Insulation coordination", "External and internal insulations", "Characteristics of overvoltages · Electric stress and electric strength", "Clearances and withstand levels", "Practices in insulation coordination", "Pollution and environmental influence", "Overvoltage protection", "Surge propagation and surge impedance", "Gapped silicon carbide arresters", "Gapless metal oxide arresters", "Time-voltage coordination", "Introduction to Overcurrent Protection", "Basic definitions", "Protection coordination", "Aspects of power system protection", "Faults in power systems", "Types of faults · Protection coordination", "Instrumentation Transformers", "Current transformers (CTs)", "CT_ saturation and accuracy", "System Protection Components", "Reclosers", "Overcurrent Protection Coordination", "Building blocks of protection system", "Principle of over current protection", "Art and Science of Protection · Zones of protection", "Primary and Backup · Protective devices and characteristics", "Protection requirements · Coordinating over current devices · Time-dial setting · Time-current characteristic (TCC) curves", "Coordination time intervals · Desirable Protection Attributes"]}, {"course_id": 130, "course_code": "ECE 467", "course_name": "ECE467 - Power Systems Analysis, Operations, and Markets (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Power Systems Analysis, Operations, and Markets Winter 2025", "10:00AM - 11:20AM E7 4433", "04:00PM - 05:20PM", "Professor Kankar Bhattacharya", "This course provides a basic understanding of the main issues relevant to the operation, analysis, and management of power grids, and gives an introduction to the functioning of electricity markets.", "The course covers the following main technical and economic issues relevant to system operators, utilities and analysts: power system economic operations; short-term operation of power systems; power flow; introduction to optimal power flows; overview of electricity markets; fault calculations; and basic concepts in power system stability and control.", "View requirements for ECE 467", "Understand the fundamentals of power system operation in a traditional vis-a-vis a competitive environment.", "Understand the technical issues arising in power system operations in conjunction with the economic aspects.", "Able to develop mathematical models and simulation tools to analyze the operational and control problems in power systems and electricity markets.", "Number of Lectures", "Sub-Topics", "Power System Economic Operations", "Short-term Operation of Power Systems", "Unit Commitment problem formulation and solution", "Hydro-thermal coordination and solution", "Power Flow Analysis", "Electricity Markets", "Fault Analysis", "Unsymmetrical faults.", "Power system stability and control", "It will require developing a power grid simulation model and carrying out specific case studies."]}, {"course_id": 131, "course_code": "ECE 474", "course_name": "ECE474 - Radio and Wireless Systems (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Radio and Wireless Systems Winter 2025", "S. Boumaiza", "slim.boumaiza@uwaterloo.ca", "04:00PM - 05:20PM", "Modern transmitter and receiver architectures, Noise and linearity in radio and wireless systems, Design considerations of RF/microwave subsystems, radio and wireless system designs, CAD tools for radio and wireless systems, Antennas, Radio wave propagation models, Indoor radio, Satellite communication, Personal communication systems (PCSs).", "View requirements for ECE 474", "View requirements for ECE 770", "Designers of building blocks often ignore the motivation behind the various specifications they are given and their connections with the overall system performance once integrated into a radio communication system.", "As radio and wireless systems pose increasingly stringent specifications, integration of component-level building blocks to system-level design process is essential and circuit design and radio system engineering will merge.", "This course covers a wide range of radio and wireless systems aspects including communication signals and the underlying modulation and multiple access techniques, tradeoffs among different transceiver (transmitter/receiver) architectures (conventional and modern), antennas and radio waves propagation, and design considerations of RF/microwave building blocks, radio and wireless systems.", "In particular, it links circuit design specifications and system requirements defined in wireless standards.", "This course will equip students with the basics in modern radio and wireless systems design by", "- Learning the overall picture of conventional and modern radio and wireless systems", "- understanding the tradeoffs between different transceiver architectures in relation to a given communication standard", "- evaluating the impact of different impairments in radio and wireless systems on performance, including interference, different noise sources and nonlinearity", "- learning how to use computer aide design tools to assess the system level performance of radio transceivers and links", "- distinguishing and analyzing the propagation issues on several radio and wireless systems", "Introduction to Modulation and Multiple Access Techniques (2 Weeks)", "System level Key Characteristics and Parameters in Radio and Wireless Systems (3 Weeks)", "Noise/Linearity Budget for Radio & Wireless Systems", "Low Noise Amplifiers,", "Mixers & Modulators (IQ)", "Power Amplifiers", "Receivers Architectures", "Basic Antenna Operation", "Antenna Types and Specifications", "Special Topics on Radio & Wireless Systems (1 Week)", "Design Project/Lab: To let students have a chance to practice and understand the subjects learned in the course, several design and simulation cases of wireless link aspects using the SystemVue CAD tool from Keysight Technologies are assigned as the course project.", "The students will have also a chance to experience the theory covered in the course and to validate the project simulations in a laboratory where they will have access to state-of-the-art equipment.", "Michael Steer, Microwave and RF Design – A System Approach, SciTech, 2010.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 134, "course_code": "ECE 481", "course_name": "ECE481 - Digital Control Systems (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Digital Control Systems Spring 2024", "yash.pant@uwaterloo.ca", "11:30AM -", "Dynamic system modelling and basic system identification.", "Sampled data systems.", "Digital control system design: emulation methods, z-domain, frequency domain, pole placement.", "Implementation of digital controllers.", "Design controllers to deal with basic nonlinear effects.", "Explain how sampling rates affect the performance of a digital control system and how to account for the sampling rate when you design feedback controllers.", "Discretize a plant in order to do control design directly in the discrete-time domain and discretize a continuous control law to implement it in a computer program.", "Test stability of discrete-time systems and quantify dynamic performance of these systems.", "Design digital control laws by emulation, in both the z-domain and the frequency domain.", "Design techniques include deadbeat control and pole placement.", "Motivating examples, introduction to discrete-time control systems and sampled-data control systems.", "Bounded-input bounded-output stability, feedback stability, time-domain specifications, steady-state performance, frequency domain analysis.", "Pole placement controller design for continuous-time systems in the s-domain, incorporating tracking specifications.", "State-space models, linearization, inverting static non-linearities, static friction.", "Linear discrete-time systems (4 lectures)", "Discretize the plant and design the controller in the discrete-time domain, stability tests, design in the frequency domain, design in the time-domain.", "Optimization-based control of constrained systems (1 lecture)", "Introduction to optimal control, effect of constraints, Model Predictive Control.", "The optional suggested textbook is: Digital Control System Analysis and Design, 4th edition, C.L.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as linear algebra for control system analysis and design, implementation in Matlab/Simulink .", "Library for research-based assignments"]}, {"course_id": 135, "course_code": "ECE 486", "course_name": "ECE486 - Robot Dynamics and Control (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Robot Dynamics and Control Spring 2024", "ECE 486 / ECE 780", "ECE 486 001", "ECE 486 101", "08:00PM -", "ECE 486 201", "ECE 780 001", "ECE 486:", "Introduction to the study of robotics focusing on the mechanics and control of serial manipulators.", "Topics include rigid body motion, forward and inverse kinematics, differential kinematics, forward and inverse dynamics, trajectory generation, motion planning, and feedback control.", "This course will introduce students to dynamic modeling and control techniques for robotic systems, and expose them to some cutting-edge research.", "Dynamics of manipulators", "Optimization-based robot control", "May 7 Introduction to robot dynamics and control", "May 23 Dynamic model of manipulators 6 [", "CONTROL OF MANIPULATORS", "Jun 27 Control of driftless systems 14", "Jul 4 Control of differentially flat systems 14", "OPTIMIZATION-BASED ROBOT CONTROL", "Jul 18 Invariance and control barrier functions 4 [", "The lecturing deliverable will consist in a 15-minute presentation of a topic not covered in class and independently studied.", "Magnus Egerstedt, Robot Ecology: Constraint-Based Design for Long-Duration Autonomy, Princeton University Press, 2021 No", "ECE 486", "The project will consist of a mobile manipulation task using the DJI RoboMaster EP programmed in", "The code developed to complete the project", "The reports must be formatted using", "The project will consist of the solution to a problem in the student’s research area using the techniques", "– Section II: Novelty and/or impact", "– Section III: How robot dynamics and control techniques play a key role", "– Section V: Metric for success", "– Section I: Introduction", "– Section III: Materials and methods", "The code developed to complete the project"]}, {"course_id": 136, "course_code": "ECE 488", "course_name": "ECE488 - Multivariable Control Systems (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Multivariable Control Systems Winter 2025", "ECE 488", "Monday, Friday -", "D. Davison", "04:00PM - 05:20PM", "ECE 488 101", "08:00PM -", "D. Davison", "Instructor Dan Davison", "EIT-3114", "Review of feedback control design fundamentals; SISO controller parameterizations; the fundamental effect of MIMO interaction; introduction to state-space models in continuous and discrete time; SISO techniques for MIMO design; optimal control; model-predictive control design; state estimation; decoupling, MIMO PID control design; applications in areas such as aerospace systems.", "View requirements for ECE 488", "Course pre-requisites:", "This course builds on classical control theory from a first control course (ECE380, MTE360, BME356, SYDE352, or equivalent).", "I assume you have good working knowledge of Laplace transforms, transfer functions, Bode plots, block diagrams, and basic control tools (Routh-Hurwitz stability test, root locus plots, Nyquist plots, design of PID/lead/lag controllers).", "To develop tools that allow us to analyze and design control systems that have multiple inputs and/or multiple outputs.", "(7) Proficiently interpret and analyze MIMO systems (Chapter 4)", "(9) Proficiently manipulate and analyze MIMO state-space systems (Chapter 5)", "(11) Explain the advantages and disadvantages of state-space and transfer-function techniques for MIMO control (Chapter 5)", "Tests and final exam", "Tests and final exam", "Tests and final exam", "Tests and final exam", "Tests and final exam", "\"Impact of engineering on society and the environment\"", "\"Economics and project management\"", "Mon Feb 10 Lecture Ch 3 pp.157-164 and P3 & P4", "These slots will compensate for lectures that are cancelled during the ECE Midterm Week.", "You can send a print request online at https://wstore.uwaterloo.ca/pages/w-print-student.", "Chapter 4:  \"Control System Design\", by Goodwin, Graebe, and Salgado, 2001", "Summary of marked components", "Tests and final exam", "Any reason for missing a test, other than those listed above, results in a score of zero on that test.", "The purpose of the Project Exercises is to increase your understanding of the techniques and ideas presented in the lectures by applying them to a quasi-realistic system.", "In-person students who faithfully attend the in-person lectures can get bonus marks.", "I will occasionally distribute slips to each person present in the lecture room.", "Correctly answer a simple question on the slip, and put the slip in the box at the front of the room.", "Most of the 36 lecture videos explain how a random subset of viewers can get a 0.5% bonus mark.", "Mixed learning modes:  Students who switch between in-person and online learning may collect a mixture of in-person and online bonus marks."]}, {"course_id": 137, "course_code": "ECE 493", "course_name": "ECE493 - Special Topics in Electrical and Computer Engineering (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Social Robotics - Foundations, Technology and Applications of Human-Centered Robotics Winter 2025", "ECE 750 / ECE 493", "ECE 750 / ECE 493 001", "10:00AM - 11:20AM E7 5353", "kerstin.dautenhahn@uwaterloo.ca", "04:00PM - 05:20PM", "08:00PM -", "Prof. Kerstin Dautenhahn:", "E5-5027", "kerstin.dautenhahn@uwaterloo.ca", "ECE 750:", "View requirements for ECE 750", "View requirements for ECE 493", "The course will provide an introduction to the research field of social robotics, with a particular human-centered perspective.", "Robots that can interact socially in an effective and acceptable manner with people have become increasingly important for applications ranging from robot-assisted therapy for people with special needs, robotic assistants for older people and care home residents, robots as tools in education or robotic co-workers for a new generation of  industrial robot that emphasize human-machine collaboration and communication.", "Students will gain an understanding of the concepts and theories underlying social robotics, as well as research methodologies and techniques to realize socially intelligent robots and design, plan and evaluate human-robot interaction experiments.", "Understand concepts and theories underlying social robotics", "Apply research methodologies and techniques to realize socially intelligent robots", "Design, plan, and evaluate human-robot interaction experiments", "Demonstrate scientific writing and presentation skills", "Explain how psychology and social sciences can inform the engineering of social robots", "Understand basic principles of sensors, actuators and multi-model interaction and communication for social robots", "Explain examples of robot computational architectures used in human-robot interaction", "Definitions of social robots and requirements of robots’ social skill and their relevance to robotics and Artificial Intelligence in real-world applications", "The role of affective expressions of social robots and modelling emotions to facilitate human-robot engagement", "Evaluating usability, user experience and acceptance of social robots", "Guidelines of how to write up social robotics research for a scientific publication", "Overview of cognitive architectures for socially intelligent robots", "Featuring interdisciplinary research in social robotics based on research from other fields, e.g. from (developmental) psychology, ethology or primatology", "Roles of social robots in human society and their potential impact on society and wellbeing", "Selected examples of applications of social robots e.g. in care, therapy, education, rehabilitation and co-worker scenarios will be discussed throughout the course", "Ethical, safety and privacy issues as relevant to social robotics will be discussed throughout the course", "Course Grading for Graduate Students:", "20% Individual discussion paper: Students will reflect on work in Science Fiction involving the concepts of social and intelligent robots, and reflect on the relevance to today’s robotics technology in robotics and Artificial Intelligence.", "Students can choose the work and discuss the selection with the instructor.", "Students are required to write a report that motivates, describes and discusses those behaviours in light of the state of the art literature, and describe an experimental design for a human-robot interaction experiment where those behaviours could be tested and analyzed.", "Specifically, students’ reports will be evaluated based on a) the literature review demonstrating the level of knowledge in this domain, b) the relevance of the identified research questions and hypotheses, c) the depth of the proposed research program, d) the range, complexity and quality of the implemented and documented robot behaviours, e) the detailed description of the methodology used to carry out and analyze this program of work, f) the user study conducted and how results are presented and analysed, and finally, g) a critical evaluation of possible limitations of the expected outcomes and backup plans in order to address  possible delays and technical difficulties encountered during the implementation of the work.", "Note, those skills can also be applied to related fields of Human-Computer Interaction (HCI), Human Factors etc.", "20% Individual discussion paper: Students will reflect on work in Science Fiction involving the concepts of social and intelligent robots, and reflect on the relevance to today’s robotics technology in robotics and Artificial Intelligence.", "Students can choose the work and discuss the selection with the instructor.", "Students are required to write a report that motivates, describes and discusses those behaviours in light of the state of the art literature, and describe a possible experimental design for a human-robot interaction experiment where those implemented behaviours could be tested and analyzed.", "Specifically, students’ reports will be evaluated based on a) the literature review demonstrating the level of knowledge in this domain, b) the relevance of the identified research questions and hypotheses, c) the depth of the proposed research program, d) the range, complexity and quality of the implemented and documented robot behaviours, e) the detailed description of the methodology used to carry out and analyze this program of work, f) a critical evaluation of possible limitations of the expected outcomes and backup plans in order to address  possible delays and technical difficulties encountered during the implementation of the work.", "Note, those skills can also be applied to related fields of Human-Computer Interaction (HCI), Human Factors etc.", "Notice of Recording"]}, {"course_id": 138, "course_code": "ECE 495", "course_name": "ECE495 - Autonomous Vehicles (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 495", "ECE 495 001", "Monday, Friday -", "11:30AM -", "04:00PM - 05:20PM", "Mahdi Naseri mahdi.naseri@uwaterloo.ca", "Autonomous driving system overview; computer vision basics, deep learning for perception, motion modelling and state estimation, localization and mapping, object tracking, behavioral planning and reinforcement learning, path planning and vehicle control, safety and verification and validation, adoption and impact.", "View requirements for ECE 495", "Linear algebra", "Basic mechanics", "Feedback control", "Basic programming skills in Python and C++", "Design and implement perception functions using classical and deep learning computer vision techniques", "Formulate and implement Extended Kalman Filter for dynamic state estimation", "Understand and implement basic vehicle control and trajectory methods", "Understand the limitations and risks of current methods and be aware of future research and industry trends", "Functional Architecture", "WISE ADS", "Image representation", "Image filtering", "Lane detection using classical computer vision", "Image features", "Linear regression", "Neural network training", "Implementing vanilla neural network from scratch", "U2 Semantic segmentation", "Training a deep network for semantic segmentation", "Deep network for object detection", "U1 Dynamic system modeling", "Probabilistic models", "Bayes filtering", "U2 Occupancy grid mapping", "Vehicle modeling – Part 1", "U1 Lateral vehicle control", "Longitudinal vehicle control", "Vehicle controller", "Motion planning problem", "Motion planning methods", "The in-person lecture slots will be used for covering selected topics from the course material, answering and discussing the sample practice questions, and guest lectures on emerging research topics.", "Additional material covered in guest lectures may be included in exams as bonus questions.", "However, some students may prefer to read text explaining these concepts.", "A recent book discusses the major functions of autonomous vehicles, touching on many of the topics covered in the course and beyond", "Creating Autonomous Vehicle Systems, Second Edition, Morgan and Claypool Publishers, 2020", "Section 4.2: Edge Detection", "Section 3.2: Linear Filtering", "Sections 3.1 and 3.2: Linear Regression", "Neural networks", "Section 7.3: Semantic Segmentation", "Section 7.2: Object detection", "Vehicle modeling", "Motion planning", "Computer Vision: Algorithms and Applications.", "An Introduction to Statistical Learning with Applications in R. Springer, 2017 (available online through UW library)", "Kalman and Bayesian Filters in Python.", "Automatic Steering Methods for Autonomous Automobile Path Tracking.", "A Survey of Motion Planning and Control Techniques for Self-driving Urban Vehicles.", "Design Space of Behaviour Planning for Autonomous Driving.", "Online courses", "Coursera has a Self-Driving Cars Specialization, which you can access at", "The specialization has four courses:", "Introduction to Self-Driving Cars", "State Estimation and Localization for Self-Driving Cars", "Visual Perception for Self-Driving Cars", "Motion Planning for Self-Driving Cars", "Object detection can be a tricky concept to grasp.", "Finally, the Stanford course on Convolutional Neural Networks for Visual Recognition (cs231n) gives a great introduction to neural networks in general and convolutional neural networks in particular.", "Advanced reading", "The following two papers cover the trajectory planning concepts discussed in the course (these algorithms are used in the WISE ADS stack that operates UW Moose):", "I am including the following books here in case you want to deepen your knowledge on some of the topics covered in the course.", "State Estimation for Robotics.", "7 Implementing a simple trajectory planner Fri, Apr 4 12", "Collaboration & Plagiarism: Plagiarism, taking credit for work that others did, is not permitted, and this applies to source code as well as exams.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 139, "course_code": "ECE 499", "course_name": "ECE499 - Engineering Project (0.50)", "term_name": "List 3", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Email: mcrowley@uwaterloo.ca", "View requirements for ECE 499", "In doing so, they are expected to demonstrate initiative and ability to define a problem and develop a solution logically and accurately, so that they can appreciate, discriminate, and draw conclusions from observations and ideas.", "They also need to demonstrate they can make recommendations and communicate effectively by means of a written report on their work.", "This allows sufficient time for the readers to evaluate the report and provide a grade.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 140, "course_code": "ECE 260", "course_name": "ECE260 - Electromechanical Energy Conversion (0.50)", "term_name": "List 4", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electromechanical Energy Conversion Fall 2024", "Monday, Friday -", "08:30AM - 09:50AM E7 4433", "E7 4043", "Role Name Room Email", "Power systems and their fundamental components and models.", "Introduction to the principles of electromechanical energy conversion, including transformers and rotating machines, in particular (direct current) dc, induction and synchronous machines.", "View requirements for ECE 260", "Understand the basic operating principles of transformers, DC and AC electric machines.", "Develop steady state models using their respective equivalent circuits for motors, transformers and generators.", "Understand how to evaluate the performance of motors in terms of their torque-speed characteristics, speed regulation, power losses, and efficiency.", "Select a suitable electric machine for a given application.", "Understand how to evaluate the performance of transformers and generators in terms of voltage regulation, power losses, and efficiency.", "Basics of Electric Circuits", "3. Three-phase AC circuits: General introduction, why and where three-phase AC is required, Circuit connections, Wye and Delta configurations, Phasor diagrams, Line/phase voltages and currents, Power in three-phase circuits", "4. Electromagnetism: Magnetic field concepts; Magnetic circuits; Laws of electromagnetism ⎯ Faraday’s Law and Lorentz Law, Hysteresis and Eddy currents.", "Fundamentals of Electricity and Magnetism", "4. Electromagnetism: Magnetic field concepts; Magnetic circuits; Laws of electromagnetism ⎯ Faraday’s Law and Lorentz Law,", "Energy Conversion and Transformers", "Speed - torque characteristics, motor starters, speed control and power flow diagrams.", "Transformers: Ideal transformers; Induced voltages and currents, practical transformers; open and short circuit tests; equivalent circuits, voltage regulation; efficiency; concepts of three-phase transformers.", "Induction Motors:", "Three-phase Induction Motors: Rotating magnetic field, slip and rotor speed, equivalent circuits and phasor diagrams, starting of induction motors, selection and application of three-phase induction motors, speed control and speed regulation.", "Single-phase and special motors: Revolving magnetic field theory of single-phase induction motors, staring of single-phase motors, their applications."]}, {"course_id": 141, "course_code": "ECE 340", "course_name": "ECE340 - Electronic Circuits 2 (0.50)", "term_name": "List 4", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electronic Circuits 2 Winter 2025", "ECE 340", "ECE 340 001", "11:30AM -", "Email", "ECE 340:", "Electronic circuits and their limitations including, metal-oxide-semiconductor (MOS) and bipolar junction transistor (BJT) differential pairs, biasing, the cascode configuration and active loads.", "Differential and multistage amplifiers.", "View requirements for ECE 340", "ECE 340 is the third core course in a three-course sequence (after ECE 140 and ECE 240) on electronic circuits.", "ECE 340 focusses on the analysis and design of transistor amplifiers using integrated circuit (IC) technology, where transistors and other electronic components are built together on a semiconductor chip.", "We study amplifiers, and their supporting circuits, because these are essential building blocks for many analog application-specific ICs (ASICs), including sensor interfaces, baseband-communication systems, power-delivery circuits, and data converters.", "We will study transistor amplifiers built using metal-oxide-semiconductor field-effect transistors (MOSFETs) and bipolar junction transistors (BJTs).", "Perform dc operating point and small-signal ac analyses of MOSFET and BJT circuits.", "Analyze and design single-stage and multi-stage MOSFET and BJT amplifiers with passive and active loads, including cascodes.", "Analyze the frequency response of transistor amplifiers.", "Operate appropriate lab equipment to build, debug, and characterize basic electronic circuits.", "Review of single-MOSFET amplifiers", "Integrated circuit (IC) building blocks: current mirrors and biasing, active loads, and cascode amplifiers", "BJT circuits and single-BJT amplifiers", "Differential-pair amplifiers", "Frequency response of amplifiers", "Multi-stage amplifiers and op amps at the transistor level", "Feedback in circuits", "**NOTE:", "Review of basic electronic measurements and op amp circuits", "Single-transistor amplifiers and cascodes", "Current mirrors", "Frequency response of amplifiers", "**NOTE:", "Closed book and closed notes", "Non-programmable, non-graphing scientific calculator is allowed", "A formula sheet will be provided", "All labs contain an \"in-lab\" section which involves building and measuring various circuits and reporting results.", "Numerical solutions not included in the textbook will normally be provided upon release of the problem set.", "Intellectual property includes items such as:"]}, {"course_id": 142, "course_code": "ECE 375", "course_name": "ECE375 - Electromagnetic Fields and Waves (0.50)", "term_name": "List 4", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electromagnetic Fields and Waves Winter 2025", "ECE 375", "Monday, Friday -", "Maxwell's equations; plane waves; time-harmonic fields; waves at planar boundaries; boundary conditions; reflection and transmission; transmission lines; electric fields in matter; magnetic fields in matter.", "View requirements for ECE 375", "You should discuss your problems regarding concepts with the instructor and the tutorial TA.", "Slides", "Time-Varying Electromagnetics", "Maxwell’s Equations", "8-2,8-3", "Snell’s law, Fiber optics", "2-Ramo, Whinnery, VanDuzer, “Fields & waves in Communication Electronics”, 3rd ed., John Wiley, 1994."]}, {"course_id": 0, "course_code": "ECE 305", "course_name": "ECE305 - Introduction to Quantum Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Computer Engineering", "program_id": 39, "major_id": 3, "major_name": "Quantum Engineering Specialization", "topics": ["Notice of Recording", "Introduction to Quantum Mechanics Fall 2024", "ECE 305", "11:30AM -", "04:00PM - 05:20PM", "Introduction to quantization, wave-particle duality, and the uncertainty principle.", "Introduction to approximation methods including time-independent perturbation theory.", "View requirements for ECE 305", "Learn basic mathematics for quantum mechanics", "Understand the fundamental concepts of quantum mechanics: quantization, wave-particle duality, the uncertainty principles", "Learn how to solve Schrödinger equations for exemplary problems: particle-in-a-box, finite-height potential, a harmonic oscillator", "Learn modern applications of quantum mechanics", "Make-Up-F", "Tutorial-Th", "Introduction", "Stern-Gerlach", "Math/Matrix Notation", "Quantum State Vectors", "Linear Algebra", "Ch. 2.3-2.4", "Expectation Values", "Calculating expectation values", "Expectation values", "Schrödinger Equation", "Schrödinger Equation", "Spin Precession", "Energy Eigenvalue Equation", "Schrödinger Equation", "Wavefunction", "Wavefunction", "Wavefunction", "Nov.11-15", "Nov.18-22", "Finite Squarewell", "Nov.25-29", "Quantum Cryptography", "Quantum Mechanics: A Paradigms Approach by David H. McIntyre Yes", "Linear Algebra Lecture Material: https://ece.uwaterloo.ca/~ne112/Lecture_materials/.", "Notice of Recording"]}, {"course_id": 1, "course_code": "ECE 405A", "course_name": "ECE405A - Quantum Information Processing Devices (0.50)", "term_name": "Required Courses", "program_name": "Computer Engineering", "program_id": 39, "major_id": 3, "major_name": "Quantum Engineering Specialization", "topics": ["Quantum Information Processing Devices Fall 2024", "This course introduces physical implementations of quantum computers with an emphasis on common and connecting themes.", "The course topics include the review of quantum mechanics, criteria to build quantum computers, quantum circuit models, and four quantum hardware platforms (nuclear magnetic resonance, optical photons, trapped ions, and superconducting systems) in terms of qubit definition, universal gate sets, initialization, measurement strategies, and decoherence processes.", "View requirements for ECE 405A", "Introduction to quantum computing", "Topics: History of quantum computing, DiVincenzo criteria, quantum circuits, computational complexity, quantum error correction", "Special Topic: Repetition code", "Review of quantum mechanics", "Spins", "Special Topic: Silicon-based spins", "Optics", "Topics: Electromagnetic field quantization, single-photon sources/detectors, Knill-Laflamme-Milburn protocol, dual-rail encoding, linear optical elements, probabilistic gates, measurement-based and continuous variable quantum computing", "Topics: Ion traps, trapped ion motion, electronic states, Lamb-Dicke regime, ion-laser interactions, Cirac-Zoller and Molmer-Sorensen gates", "Superconducting circuits", "Identify the advantages of quantum computing over classical computing.", "Use quantum mechanics to model each of the studied implementations of quantum computing.", "Map quantum operations onto various hardware platforms.", "Assess how different implementations of quantum computing satisfy the DiVincenzo criteria.", "Compare and contrast different methods of quantum computing.", "Evaluate historical and modern quantum computing literature.", "Week Dates Theme Monday Wednesday Book Sections Deliverables", "5 Sep 30, Oct 2 Spins Initialization & Noise Silicon-Based Spins 3.6, 3.7, 3.8 Project Topic", "6 Oct 7, 9 Optics EM Field Quantization Sources & Detectors 4.1, 4.2, 4.3 Assignment 2", "8 Oct 21, 23 Optics Gates & BB84 QKD Measurement & CV Based QC 4.4, 4.5, 4.6, 4.7, 4.8, 4.9 Abstract", "11 Nov 11, 13 SC Circuits Superconducting Circuits Circuit QED & Control 6.1, 6.2, 6.3, 6.4, 6.5, 6.6 Assignment 4", "12 Nov 18, 20 SC Circuits Measurement & Noise Bosonic Qubits 6.7, 6.8, 6.9", "Building Quantum Computers: A Practical Introduction by Shayan Majidy, Christopher Wilson, and Raymond Laflamme Virtual copies of the textbook chapters will be provided in the event hard copies are unavailable.", "Priority given on a \"first-come, first-served\" basis", "Presentation slots will be assigned on a \"first-come, first-served\" basis", "Penalty-free extensions will be considered for extenuating circumstances at the discretion of the instructor.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 3, "course_code": "ECE 405C", "course_name": "ECE405C - Programming of Quantum Computing Algorithms (0.50)", "term_name": "Required Courses", "program_name": "Computer Engineering", "program_id": 39, "major_id": 3, "major_name": "Quantum Engineering Specialization", "topics": ["Programming of Quantum Computing Algorithms Winter 2025", "ECE 405C / ECE 730", "Monday, Friday -", "04:00PM - 05:20PM", "ECE 730 002", "Monday, Friday -", "04:00PM - 05:20PM", "Email: nayoung.kim(at)uwaterloo.ca", "The course will teach basic elements to create quantum circuits in quantum computers: qubits, single-qubit gates, two-qubit gates, quantum operators, and measurements.", "View requirements for ECE 405C", "ECE 730:", "View requirements for ECE 730", "Learn the basic elements of quantum circuits", "Learn the fundamentals of representative quantum algorithms", "Learn how to program quantum circuits and quantum algorithms via quantum computers or quantum cloud services", "Introduction to Quantum Computing - Qubits", "Quantum Circuits and Queries", "Quantum Algorithms", "Quantum Programming", "Study Break", "Phase Estimation Algorithm", "Quantum Simulation", "Quantum Error Correction", "Qiskit tutorials for quantum machine learning: https://qiskit.org/learn/course/machine-learning-course/"]}, {"course_id": 4, "course_code": "ECE 405D", "course_name": "ECE405D - Superconducting Quantum Circuits (0.50)", "term_name": "Required Courses", "program_name": "Computer Engineering", "program_id": 39, "major_id": 3, "major_name": "Quantum Engineering Specialization", "topics": ["Superconducting Quantum Circuits Winter 2025", "Monday, Friday -", "11:30AM -", "04:00PM - 05:20PM", "This course offers applications of superconductivity in quantum information devices and circuits at microwave frequencies.", "Introducing the basic physics of superconductivity, superconducting transmission lines and cavity resonators are presented as the elementary passive components in quantum circuits.", "Josephson junctions as an active element in superconducting electronics is introduced and it is shown how a qubit can be constructed based on various two-level system manipulated in Josephson junctions.", "Single qubit operation and qubit coupling in the form of circuit cavity electrodynamics and their associated qubit readout are discussed.", "Some existing quantum computers such as IBM Q System One and Google Sycamore are briefly introduced.", "View requirements for ECE 405D", "Week 1/2: Basics of superconductivity (BCS theory, two fluid model, microwave propagation in superconductors)", "Week 11/12: Quantum systems (introduction to IBM Q system, Google Sycamore)", "Principles of Superconducting Quantum Computers by Daniel D. Stancil, Gregory T. Byrd Yes free", "Building Quantum Computers, A Practical Introduction by SHAYAN MAJIDY, CHRISTOPHER WILSON, AND RAYMOND LAFLAMME No"]}, {"course_id": 0, "course_code": "CS 136L", "course_name": "CS136L - Tools and Techniques for Software Development (0.25)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["Tools and Techniques for Software Development Winter 2025", "08:30AM - 10:20AM MC 3003", "10:30AM - 12:20PM MC 3003", "E. Ciklabakkal", "E. Ciklabakkal", "08:30AM - 10:20AM MC 4042", "E. Ciklabakkal", "10:30AM - 12:20PM MC 4042", "08:30AM - 10:20AM MC 3003", "10:30AM - 12:20PM MC 4060", "02:30PM - 04:20PM MC 4060", "E. Ciklabakkal", "10:30AM - 12:20PM MC 3003", "This course introduces students to tools and techniques useful in the software development lifecycle.", "Students learn to navigate and leverage commands and utilities in the Linux Command Line Shell.", "Students gain experience in version control software, writing scripts to automate tasks, and creating effective test cases to identify bugs.", "Students also gain experience in using built-in support for version control, testing, debugging, build automation, etc. in integrated development environments (IDEs).", "Interact with the Linux Operating System using a command line shell and gain familiarity with commands, utilities and tools.", "Create scripts to automate tasks and increase productivity while working on a software project.", "Design test cases and automate the testing process to check a program for functional correctness and incorrect memory usage.", "Use version control systems to share, contribute, manage and track code.", "Separately compile code modules and leverage build automation tools to do so efficiently.", "Module 0: Linux Shell, a first look", "Module 2: Testing and Debugging", "Module 9: Debugging", "Each lab consists of a number of lab problems.", "Each lab problem has two associated values, a lower one called the pass threshold and a higher one called the completion threshold.", "Special note on test cases: if a lab question asks you to submit test cases, you must create these tests yourself.", "Do not directly copy code from GenAI.", "Do not ask GenAI for a step-by-step breakdown of how to solve a lab problem.", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 1, "course_code": "CS 341", "course_name": "CS341 - Algorithms (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["Algorithms Winter 2025", "10:00AM - 11:20AM MC 4061", "08:30AM - 09:50AM MC 1056", "The study of efficient algorithms and effective algorithm design techniques.", "Topics include divide and conquer algorithms, recurrences, greedy algorithms, dynamic programming, graph search and backtrack, problems without algorithms, NP-completeness and its implications.", "DPV", "Introduction to Algorithms, by Cormen, Leiserson, Rivest and Stein, MIT Press.", "describe the main idea first,", "Extensions and Other Accommodations on Assignments", "Students can currently self-declare two kinds of absences on Quest: short-term absence and pandemic-related absence.", "Since a short-term absence lasts 2 days, this means the only accommodation we offer for a short-term absence is a 48 hour extension.", "If you request accommodations through AccessAbility Services (AAS) by filling out a Missed Course Component form, the accommodation is determined on a case-by-case basis through consultation with AAS, but will generally be one of the above options unless your situation is unusual.", "If you collaborate with others, you must clearly indicate the collaboration for each problem.", "This is not a software engineering course; we will not test your code against inputs that do not match our specifications.", "Continuity Plan", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 2, "course_code": "CS 350", "course_name": "CS350 - Operating Systems (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["Operating Systems Winter 2025", "07:00PM - 08:50PM", "Bernard Wong bernard AT uwaterloo DOT ca", "Hong Zhang honzhang AT uwaterloo DOT ca", "Karen Anderson kaanders@uwaterloo.ca", "An introduction to the fundamentals of operating system function, design, and implementation.", "Topics include concurrency, synchronization, processes, threads, scheduling, memory management, file systems, device management, and security.", "An introduction to the fundamentals of operating system function, design, and implementation.", "Topics include concurrency, synchronization, processes, threads, scheduling, memory management, file systems, device management, and security.", "Operating System Introduction (2 hours)", "Historical overview of operating system development.", "Simple memory management techniques: partitioning, dynamic loading, simple segmentation.", "File Systems (6 hours)", "Bonus content on a current topic in computing", "In a general way, understand operating systems: what they do, how they are used, and how they are implemented.", "Introduction Chapters 1-2 Intro  Slides", "Process API    Slides", "Fibers", "Synchronization", "System Calls and Exceptions   Context Switch & Sys Calls  Slides", "Virtual Memory Chapters 8,9 Address Spaces   Memory API", "Smaller Page Tables", "Devices and I/O Chapters 12 and 13 I/O Devices  Hard Disk Drives  Slides Disk", "File Systems Chapters 10 and 11 (excluding 11.8, 11.9) Files and Directories", "File System Implementation", "FSCK & Journaling  Slides Part 1", "Bonus: Debugging     Slides", "A Collection of Tutorials and Useful Information", "An Introduction to Programming with Threads, by Andrew Birrell", "Assignment 3: File Systems", "Operating System Concepts, 8th edition Silberschatz, Galvin and Gagne (John Wiley and Sons) No available free on-line", "We will be using a system for class-related discussions and announcements called Piazza.", "Piazza can generate a large volume of e-mails, and these settings may be modified to reduce the frequency of received notifications (as well as what types of notifications are received).", "Debugging: GDB Online Documentation", "An Introduction to Programming with Threads, by Andrew Birrell", "System V ABI", "COS Source Code and Documentation:", "Source Code Documentation", "OpenGrok Source Code Search", "OpenGrok Source Code Navigation", "Exams", "You are welcome to use these tools to help you understand the course material, but you must not:", "cut-and-paste your assignment code into them for debugging assistance.", "Also, these tools will not be available when you write the exam, so you need to understand how to solve these problems yourself in order to pass the course.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 4, "course_code": "CS 492", "course_name": "CS492 - The Social Implications of Computing (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["The Social Implications of Computing Winter 2025", "08:30AM - 11:20AM AL 124", "Students learn how to make informed judgements about the social and ethical consequences of deploying computer technologies and how to foster critical thought and professional responsibility.", "Identify important social implications of computerization;", "Combine their opinions with information from existing research in both written and oral formats;", "Identify where their knowledge of computer science provides a valuable contribution to the overall dialogue about the social and ethical implications of computing.", "Proactively identify potential ethical issues related to data and new technologies and applications;", "Evaluate the potential risks and benefits of different courses of action that could be taken with respect to data and new technologies and applications;", "Succinctly and confidently articulate and justify your views on ethical issues related to data and new technologies and applications;", "for CS 492 Section 003 in particular", "That said, please do not attend class if you are sick and should be in self-isolation; just let your instructor and TAs know you are ill and unable to attend class.", "A link to join the Slack channel may be found here: https://join.slack.com/t/cs492section003w25/shared_invite/zt-2wl26b5p3-pxMv5Z6mRjbOoNybeKXSwA.", "Evaluation in this course will be comprised of the following three components:", "A note on the use of large language models (“LLMs”) and generative AI systems: While it is my strong preference that students not use these systems and prepare their journal entries entirely on their own, students are permitted to use such systems to improve the technical quality of their writing, but they may not use them to do their writing for them.", "If you do use one of these systems, you must inform us that you have done so and how you used it.", "Unlike the weekly commentaries or position papers, students are encouraged to experiment with LLMs and generative AI systems and to incorporate them as part of their small-group projects!", "A five-minute video tour of the project and its findings.", "This should be rare since overall grades can easily be improved by submitting an additional written assignment.", "EMPOWER ME in China", "In particular:", "IP includes items such as:", "In particular, in this Ethics Workshop, we will discuss bias and discrimination in data and algorithms, and how new technologies and applications can contribute to and ameliorate these problems."]}, {"course_id": 5, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 6, "course_code": "CO 255", "course_name": "CO255 - Introduction to Optimization (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["Notice of Recording", "Introduction to Optimization (Advanced Level)", "08:30AM - 09:50AM MC 4040", "Linear optimization: feasibility theorems, duality, the simplex algorithm.", "Know a variety of optimization algorithms, including the Simplex method, cutting plane methods, and descent methods.", "Know and apply the definition and properties of convex sets and functions.", "Write the dual of a linear programming problem and understand the properties relating the primal and dual.", "Apply optimization methods to common continuous and discrete problems including game theory, flow, scheduling, and data science.", "Linear programming, Fourier-Motzkin elimination, and Farkas's lemma.", "Duality in linear programming.", "Convex optimization and the KKT conditions.", "Discrete optimization and total unimodularity.", "Applications of total unimodularity to matching and flow problems", "Application of nonlinear optimization to data science", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course.", "If you have questions or concerns about these matters, please email mathadvisor@uwaterloo.ca."]}, {"course_id": 7, "course_code": "CS 115", "course_name": "CS115 - Introduction to Computer Science 1 (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["Introduction to Computer Science 1 Winter 2025", "Diren Swayze", "An introduction to the fundamentals of computer science through the application of elementary programming patterns in the functional style of programming.", "As we are aware of the varied ways in which this material might be of use in the future, we have included concepts that are beautiful and universal.", "Because of the fundamental nature of the concepts taught in CS 115, the course can serve both students whose primary interest in computers is in their use in their chosen areas of study and students intending to minor in CS.", "Module 01: Introduction Monday January 6", "Module 03: Strings and Symbols Monday January 13", "Module 06: Structural Recursion Monday February 3", "Module 08: Local Evaluation Monday February 24", "Module 09: Higher-Order Functions Monday March 3", "Exams", "You can submit each of those files as many times as you like before the deadline.", "Every time you submit a file, we'll run some basic checks on it to make sure it looks valid, and send you preliminary feedback via email.", "Re-marking", "The forms will be in a Survey on Learn for each assignment for two weeks."]}, {"course_id": 8, "course_code": "CS 135", "course_name": "CS135 - Designing Functional Programs (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["Designing Functional Programs Winter 2025", "Monday -", "Monday", "07:00PM - 08:50PM", "08:30AM - 09:20AM", "10:30AM - 11:20AM MC 2034", "Charlie Clarke", "Email: claclark@uwaterloo.ca", "Karen Anderson", "Email: kaanders@uwaterloo.ca", "Email: dbwolff@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "Sara Nayar", "Email: cs135@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "CS135 Problem-solving FAQ", "Assignment Marking Error: Submit a re-mark request, due within one week of release of marks.", "Read Me First", "We hope to guide you through a carefully designed curriculum that introduces you to core concepts in computer science.", "In a typical week, you will move through the following activities:", "You should get a feel for what information is where so you can find it quickly in the future.", "An introduction to the fundamentals of computer science through the application of elementary programming patterns in the functional style of programming.", "Syntax and semantics of a functional programming language.", "Linear and nonlinear data structures.", "Abstraction and encapsulation.", "CS 135 Designing Functional Programs", "CS 135 is for students who would prefer a more conceptual treatment of introductory computer science in a simple language that is educationally effective but not commercially relevant.", "Hardware and Software", "Student labs are equipped with the DrRacket integrated development environment running on networked personal computers.", "References", "How To Design Programs by Felleisen, Findler, Flatt, and Krishnamurthi, MIT Press, 2003.", "Definition of lists, designing functions to process and produce lists, recursive definition of natural numbers, recursive data definitions.", "Non-Linear Structures (6 hours)", "Multi-clausal recursive data definitions, trees, mutually referential data definitions, design methods for complex data, iterative refinement, multiplexing.", "Early development of electronic computers and programming languages.", "History of concepts covered in this course.", "have understanding and experience with the topics in the course outline above", "Drop deadline 25", "Reading Week Starts", "Slides Description", "L01 Values and expressions Prefix notation, exact numbers, Boolean expressions, constants", "L04 Lists List values and expressions, composite data, data definitions", "iClicker pilot", "2024-08-26: CS135 is participating in a pilot comparison of iClicker and Vevox.", "The iClicker subscription should be free.", "iClicker Account", "Racket and DrRacket", "It is also simple and clean enough that we cover computer science content many CS students do not see until later in their CS careers.", "If you submit code written under some other system and it does not work in our currently-supported version of DrRacket, then we consider that code incorrect even if it works for you at home.", "Your work in CS135 will be assessed in a variety of ways.", "Coverage", "Using such off-limits material generally results in a significant loss of marks.", "In general, the basic tests will try to warn you if inappropriate functions and special forms are used.", "Submitting a partially completed solution is a good idea, just in case you don’t get back to it before the due date and to serve as a backup in case your computer breaks or is stolen.", "Email Karen Anderson .", "Email the ISAs and ask them to “mark it for feedback”.", "Testing", "We do several kinds of testing on your submissions:", "Basic tests", "Each time you submit before the due date, we run a set of “basic tests” on your submission.", "It’s amazing how many fatal errors can appear during last-minute tidying up!", "Do not make your last submission immediately before the deadline – it gives you no time to check the Basic Test results and respond, if needed.", "The numeric mark appearing on the basic test marksheet is only for guidance.", "After the submission deadline we run a second set of tests to assess your code, including:", "These post-deadline tests and hand-marking form your mark for the assignment.", "If you procrastinate long enough, this rule can easily cause you to fail the course.", "We won’t rehash the above policies, but we do want to make them concrete for CS135.", "A specific assignment may give exceptions to the above.", "You are welcome to use these tools to help you understand the course material, but you should not:", "cut-and-paste your assignment code into them for debugging assistance.", "Also, these tools will not be available when you write the exam, so you need to understand how to solve these problems yourself in order to pass the course.", "attempting to run malicious code during the submission or marking process."]}, {"course_id": 9, "course_code": "CS 145", "course_name": "CS145 - Designing Functional Programs (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["Designing Functional Programs (Advanced Level)", "10:00AM - 11:20AM MC 2017", "Monday -", "Monday", "07:00PM - 08:50PM", "Email: troy.vasiga@uwaterloo.ca", "Office Hours: Tues and Thur 1:00-2:00pm in MC 6212,", "Email: kaanders@uwaterloo.ca", "Email: cs145@uwaterloo.ca", "Fri 2:30-3:30pm in MC 4065,", "Email: cs145@uwaterloo.ca", "This course introduces students to key concepts in the field of Computer Science, prepares students to complete the CS portion of their Math core requirements and, if desired, continue on to second-year core courses in CS, provides top students with appropriate challenges and enrichment, and explores topics in greater depth than is possible in CS 135.", "Audience", "Demonstrate above-average communication skills (listening, reading, writing) due to the lack of textbook support for much of the enrichment material", "Given a clear and concise statement of a problem or task, write a program from scratch of up to a hundred lines of properly-formatted and documented code in a functional programming language to solve the problem or complete the task", "Use elementary data structures, such as lists and trees, in programs", "Use higher-order functions to improve readability and efficiency of programs", "Analyze the worst-case running time of programs and describe examples of data that demonstrate that the analysis cannot be improved", "Demonstrate their understanding of the implementation of functional programming language features by coding small interpreters for Scheme-like languages", "An introduction to functional programming", "Function application and definition", "Substitution model", "Types in Scheme", "Structures", "Recursion on lists and integers", "Unary representation of integers", "Proving properties of programs", "Algorithm analysis", "Functions as values", "Anonymous functions", "Higher-order functions", "Local definitions", "Simplifying the language", "Binary representation of integers", "Immutable abstract data types", "Association lists", "Leaf-labelled and node-labelled trees", "S-expressions", "Interpreters", "Limits to computation", "Efficiency", "Purely-functional data structures", "Priority Queue ADT and Braun heaps", "Efficient maps: treaps, red-black trees, AA trees", "They will not be due each week on the same day, as is common in the other first-year CS courses and the first-year Math courses.", "Assignment questions are the main way to reinforce and deepen your understanding of the concepts and skills discussed in lecture.", "You will submit program files electronically to the Marmoset system, which runs tests on your code and informs you of the results fairly rapidly.", "You can still get a great mark in the course.", "Questions and concerns can be sent to instructor or ISA emails.", "When asking questions, first check in case the question has already been answered using the search bar above the feed/list of posts.", "Walk-in consulting hours may still be available if course staff are able to book a sufficiently-large room to follow distancing guidelines."]}, {"course_id": 10, "course_code": "CS 136", "course_name": "CS136 - Elementary Algorithm Design and Data Abstraction (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["Elementary Algorithm Design and Data Abstraction Winter 2025", "08:30AM - 09:50AM MC 2017", "10:00AM - 11:20AM MC 2038", "10:00AM - 11:20AM MC 4059", "11:30AM -", "Monday -", "Monday", "07:00PM - 08:50PM", "This course builds on the techniques and patterns learned in CS135 while making the transition to use an imperative language.", "Topics discussed include iterative and recursive sorting algorithms; lists, stacks, queues, trees, and their application; abstract data types and their implementations.", "produce well-designed, properly formatted, documented and tested programs of a moderate size (200 lines) that can use basic I/O", "explain and demonstrate the use of the C memory model, including the explicit allocation and deallocation of memory", "explain and demonstrate the principles of modularization and abstraction", "implement, use and compare elementary data structures (structures, arrays, lists and trees) and abstract data type collections (stacks, queues, sequences, sets, dictionaries)", "If both exams are held in person", "If both exams must be held online", "If in-person exams cannot be held then they will be held online (if possible).", "You may also ask on the discussion forums in a private message.", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 11, "course_code": "CS 146", "course_name": "CS146 - Elementary Algorithm Design and Data Abstraction (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["Elementary Algorithm Design and Data Abstraction (Advanced Level)", "Monday -", "Monday", "07:00PM - 08:50PM", "02:30PM - 03:20PM", "Brad In-person MC 6427", "On-line Consulting Hours: Microsoft Teams", "CS 146: Elementary Algorithm Design and Data Abstraction (advanced version)", "To familiarize students with key concepts in introductory computer science from an imperative perspective and to contrast this with the functional perspective taken in CS 145;", "To allow students to complete the CS portion of their Math core requirements and, if desired, to continue on to second-year core courses in CS;", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "Introduction to C and elementary mutation in Scheme", "The memory model.", "Variable declaration, assignment and infix expressions in C. Basic I/O in C. Compilation.", "Algorithm analysis in C. File I/O in C and Scheme.", "Program organization and testing methods.", "Space analysis in C and Scheme.", "Mutable lists, queues, deques, and trees in C. Time-space tradeoffs among mutable and immutable ADT implementations.", "Low-level abstractions", "Pointer arithmetic in C. Arrays in C and vectors in Scheme.", "Strings in C. Elementary hashing.", "Libraries in C and Scheme.", "Implementing high-level abstractions", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "The provided slides are not a substitute for attendance in any first-year CS course, but in CS 146, there are no slides, and the lecture summaries made available after lecture are an even worse substitute for attendance.", "Lectures will involve the development of ideas summarized very tersely in the handouts, as well as on-the-fly development of code, analyses, and proofs.", "CS145 and CS146 were originally designed as a year-long unit of curriculum, but eventually the individual courses drifted in their own directions.", "1.1 A note on logistics", "1.2 Review of forms of recursion and associated proof techniques", "1.3 In preparation for side effects", "1.4 Output", "1.5 Input", "1.6 First Introduction to C", "1.8 Memoization", "1.9 Mutation in C", "1.11 Boxes in C", "1.12 Advanced mutation", "1.13 Aliasing in C", "1.14 Memory and vectors", "1.15 Vectors in Racket", "1.16 Arrays in C", "1.18 ADTs in C; Amortized Analysis", "2 SIMPL: a simple imperative language", "2.1 Syntax and informal semantics", "2.2 Examples in several languages", "2.3 Formal semantics", "2.5 Proving imperative programs correct", "A primitive imperative language", "3.1 A primitive imperative language", "3.2 The PRIMPL simulator", "3.4 The SIMPL to A-PRIMPL compiler", "3.6 Strings in C", "3.7 Adding functions to SIMPL", "3.8 Adding both arrays and functions to SIMPL", "3.9 Implementing lists in PRIMPL", "4 MMIX: a realistic instruction set", "4.1 A more realistic processor", "4.2 The MMIX architecture", "4.2.1 Branches and Jumps", "4.2.2 Example", "4.2.3 Software Interrupts", "4.2.5 A Problem with Branches and Jumps", "4.4 Towards a SIMPL to MMIX compiler", "5.1 Storing primitive values", "5.3 Managing memory", "5.4 Structural and pointer equality", "5.5 Function application in a Racket interpreter", "5.7 Justifying the cost of Racket primitives", "5.8 Moving towards implementation in an imperative language", "6.2 Zippers", "6.3 A continuation-passing interpreter", "6.6.2 Mark-and-sweep", "6.6.3 Copying garbage collection", "6.7 Heterogeneous Data in C", "6.8 Multidimensional Arrays in C", "6.10 Variable-length Argument Lists", "7.1 Continuation-passing style", "7.2 Exception handling", "7.3 Undelimited continuations", "7.4 Delimited continuations", "7.5 Racket’s implementation of continuations", "In CS 146, we will examine the imperative paradigm, and compare and contrast the way that efficient algorithms and data structures are designed in imperative and functional languages.", "Racket is a laboratory for current research on aspects of functional programming languages, and we will continue to look at interesting topics in this area, perhaps at the cost of some coherency in the flow of material.", "They will not be due each week on the same day, as is common in the other first-year CS courses and the first-year Math courses.", "Assignment questions are the main way to reinforce and deepen your understanding of the concepts and skills discussed in lecture.", "You will submit program files electronically to the Marmoset system , which runs tests on your code and informs you of the results fairly rapidly.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "(Please also note that we may use the trends in a student's submission history to estimate the likelihood of other forms of cheating as well.)", "Library for research-based assignments"]}, {"course_id": 12, "course_code": "CS 240", "course_name": "CS240 - Data Structures and Data Management (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["Data Structures and Data Management Winter 2025", "10:00AM - 11:20AM RCH 112", "11:30AM -", "10:30AM - 11:20AM MC 4040", "11:30AM - 12:20PM MC 4040", "Email: oveksler@uwaterloo.ca", "Email: cs240@uwaterloo.ca", "Email: cs240@uwaterloo.ca", "All of Tom's consulting hours are in-person in MC 4065.", "Email: cs240@uwaterloo.ca", "Email: cs240@uwaterloo.ca", "Email: cs240@uwaterloo.ca", "Instructional Support Coordinator: Karen Anderson", "Email: kaanders@uwaterloo.ca", "Introduction to widely used and effective methods of data organization, focusing on data structures, their algorithms, and the performance of these algorithms.", "CS 240: Data Structures and Data Management", "This course introduces widely used and effective methods of data organization, focusing on data structures, their algorithms, and the performance of these algorithms.", "Analyze, apply, and use various data structures and data-management techniques in a variety of applications", "Perform rigorous complexity analyses of simple algorithms and data structures, which includes writing correct mathematical proofs on inductively-defined structures and solving simple recurrence relations", "Select a good data structure to solve a specific algorithmic problem", "Apply data structures correctly and efficiently in one or more high-level programming languages, including C++", "Audience", "Successors: Most third-year CS major courses", "Conflicts: Other courses that seriously consider efficiency and correctness of fundamental data structures and their algorithms", "Analytical:", "Define and explain order notation; perform complexity analyses of simple algorithms", "Perform basic computations of discrete probability and expectation", "Use mathematical induction on recursively defined structures, including finding simple errors in inductive arguments", "Prove simple properties of program fragments correct through the use of pre-conditions and post-conditions for loops and recursive calls", "Computational and algorithmic:", "Design, implement, test, and debug C++ programs to solve problems requiring hundreds of lines of code", "Define the ADTs for stacks and queues; write efficient implementations in C/C++", "Describe tree structures, including binary search trees and multi-way trees; use these structures in C/C++ programs", "Describe basic sorting algorithms (including Quicksort) and implement them in C/C++", "Perform rigorous asymptotic analyses of simple algorithms and express the result using order notation; compare algorithms based on their asymptotic complexity; and prove formal results involving order notation", "Apply the priority-queue ADT to solve various application problems, implement a priority queue using heaps, and analyze the complexity of common implementations of heap operations", "Develop best-, worst- and average-case analyses of sorting algorithms, including Quicksort, and explain the ramifications of these analyses in practice; explain the basic principles of randomized algorithms and their potential advantages, specifically in the case of Quicksort; explain the difference between comparison-based sorting and non-comparison-based sorting algorithms, and when and why the latter may run faster; and apply sorting-based techniques to algorithmic problems, such as elimination of duplicates", "Explain the advantages and disadvantages of various hashing techniques; identify the best hashing techniques to use in a particular application scenario; and recognize when hashing techniques are preferable to other dictionary implementations", "Design data structures for real-world data (where keys are often inherently multidimensional) in such a way that common operations (including range search) can be implemented efficiently", "Design special data structures that can efficiently store and process words and strings, and select and apply a suitable technique for data compression in a specific application scenario", "Introduction and review (3 hours)", "Basic computer model: the random-access machine", "Runtime of an algorithm: worst-case, best-case, and average-case", "Review of stacks and queues", "Priority queue ADT and simple implementations", "Sorting and analysis of randomized algorithms (5 hours)", "Quicksort (non-randomized): worst-case, best-case, and average-case complexity", "Randomized quicksort and its analysis; application to selection and its analysis", "Lower bound on comparison-based sorting", "Non-comparison-based sorting algorithms (e.g., Counting Sort and Radix Sort)", "Dictionary ADT and simple implementations", "Binary search trees (insert and delete operations and analysis)", "Key-indexed search, simple hash functions", "Range search in a binary search tree", "Algorithms and data structures for text processing (8 hours)", "Sometimes these include animations/overlays, in case of which there will be both a Display version (with them) and a Print version (omitting them, but otherwise the same content).", "The slides for each module will be posted as the term progresses.", "Module 1 Introduction and Asymptotic Analysis M1.pdf", "Module 3 Sorting, Average-Case and Randomized Algorithms M3.pdf", "Optional: Goodrich & Tamassia   8.3", "Module 8 Range-Searching in Dictionaries of Points   Course notes Chapter 8", "A0.tex", "A1.tex", "The following books are on reserve in the DC library for reference and additional resources:", "Algorithm Design and Applications (2015)", "Also covers cuckoo hashing.", "Sedgewick] Algorithms in C++, Third Edition (1998)", "Computational Geometry: Algorithms and Applications", "CLRS] Introduction to Algorithms, 2nd edition (2001)", "Introduction to Algorithms, 2nd edition is also avaliable online (in campus).", "This website will be the primary means of communication and distribution of materials for the course.", "The course uses a number of different tools for distributing information and receiving submissions.", "These are not worth credit, but may help you in self-testing your understanding of the material.", "Only one programming question can be shifted to the final exam.", "If more than this has verification for non-submittal, then it will be considered on a case-by-case basis.", "A student with a medical reason may not be granted an INC because they have not performed sufficiently well during the academic term.", "An INC will be granted ONLY if there is a strong reason for missing the exam (generally a serious medical issue verified by a doctor's note) AND a satisfactory performance during the term (both assignments and midterm).", "Academic Dishonesty", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "The first criterion for marking is the correctness, the second criterion is efficiency.", "describe the main idea first in words,", "In the case that you are using facts stated in lectures/modules, be sure to cite where you got them from.)", "Files should be named .cpp, where the specific file name will be specified in the assignment.", "You should include sufficiently many comments in your code that the main ideas of design and correctness are clear.", "One-line changes: In the case you passed the public test, and failed some secret tests, if your program works with a one line change, then we may accept it for remarking and give some marks after deducting a penalty (typically 10-20% of the programming question).", "Here are some ways to create PDF files:", "Create your solution in LaTeX. LaTeX is a document preparation system that uses a mark-up language to write/create and co-ordinate different parts of documents, including diagrams and was introduced in Assignment 0.", "The following are least preferred methods since the results may be hard for markers to read and/or the files may be too large.", "Submitting a Re-Mark Request: Please email cs240@uwaterloo.ca in order to submit a request.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 13, "course_code": "CS 240E", "course_name": "CS240E - Data Structures and Data Management (Enriched) (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["Data Structures and Data Management (Enriched)", "10:00AM - 11:20AM MC 4041", "Email: biedl [", "Email: cs240e", "All of Tom's consulting hours are in-person in MC 4065.", "Email: cs240", "Instructional Support Coordinator: Karen Anderson", "Email: kaanders [", "Module 1 Introduction and Asymptotic Analysis Course notes Chapter 1 (skip 1.5 for now)", "(updated)  Sorting, Average-Case and Randomized Algorithms Course notes Chapter 3 (and parts of 1.5)", "Optional: Goodrich & Tamassia   8.3", "Module 8 Range-Searching in Dictionaries of Points Course notes Chapter 8", "Tutorial 3 Friday, January 24 Average-case vs expected, sorting", "The following books are on reserve in the DC library for reference and additional resources:", "Algorithm Design and Applications (2015)", "Also covers cuckoo hashing.", "Sedgewick] Algorithms in C++, Third Edition (1998)", "Computational Geometry: Algorithms and Applications", "CLRS] Introduction to Algorithms, 2nd edition (2001)", "Introduction to Algorithms, 2nd edition is also avaliable online (in campus).", "Only one programming question can be shifted to the final exam.", "If more than this has verification for non-submittal, then it will be considered on a case-by-case basis.", "A student with a medical reason may not be granted an INC because they have not performed sufficiently well during the academic term.", "An INC will be granted ONLY if there is a strong reason for missing the exam (generally a serious medical issue verified by a doctor's note) AND a satisfactory performance during the term (both assignments and midterm).", "Academic Dishonesty", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Communication & Resources in CS 240E", "CS240E uses a variety of platforms in order to communicate and provide course materials to students.", "If your issue is confidential, but not specifically for one member of the course personnel, then a better option might be a private post to piazza.", "You can ignore these if you are comfortable with the material.", "Written assignments are submitted electronically using Crowdmark - a web-based submission and marking system.", "To submit files for Assignments, follow these instructions:", "Under each question, you can select files to add them to your submission for that question.", "You can submit and re-submit files as many times as you want before the deadline.", "Logging In", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 14, "course_code": "CS 241", "course_name": "CS241 - Foundations of Sequential Programs (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["ISA", "Yiwen Dong", "ISC", "The relationship between high-level languages and the computer architecture that underlies their implementation, including basic machine architecture, assemblers, specification and translation of programming languages, linkers and loaders, block-structured languages, parameter passing mechanisms, and comparison of programming languages.", "Write short machine- and assembly-language programs to perform simple data manipulation", "Write a basic assembler supporting labels", "Give formal specifications for regular languages, including regular expressions and finite-state machines", "Write a scanner capable of dealing with a typical high-level programming language (given the specification)", "Give a grammar for a context-free language and create derivations for strings in a context-free language", "Perform context-sensitive analysis including type checking for high-level languages", "Write a simple code generator for an imperative language, i.e., one doing little or no optimization", "Apply appropriate design decisions when programming in C/C++ based on a detailed understanding of the way memory is used by a running C/C++ program", "Week 1: Introduction and Modules 1, 2", "20M+40F", "This course includes the independent development and practice of specific skills, such as development of large software artifacts.", "Library for research-based assignments"]}, {"course_id": 15, "course_code": "CS 241E", "course_name": "CS241E - Foundations of Sequential Programs (Enriched) (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["03:30PM - 04:20PM MC 1056", "02:30PM - 03:20PM", "07:00PM - 08:50PM", "The relationship between high-level languages and the computer architecture that underlies their implementation, including basic machine architecture, assemblers, specification and translation of programming languages, linkers and loaders, block-structured languages, parameter passing mechanisms, and comparison of programming languages.", "Non-enriched version: Any CS 241E student may switch to the regular version of CS 241 during the first two weeks of lectures.", "Machine-level implementation of high-level language features (9 hours)", "Introduction to formal languages.", "Regular languages, regular expressions and finite state machines.", "Semantic Analysis and Code generation (6 hours)", "Dynamic Memory Allocation.", "Write short machine- and assembly-language programs to perform simple data manipulation.", "Write a basic assembler supporting labels.", "Give formal specifications for regular languages, including regular expressions and bubble diagrams.", "Write a scanner capable of dealing with a typical high-level programming language (given the specification).", "Give a grammar for a context-free language and, given a grammar, produce a derivation for a given string in the language.", "Write a simple code generator for an imperative language, i.e., one doing little or no optimization.", "Apply appropriate design decisions when programming in C/C++ based on a detailed understanding of the way memory is used by a running C/C++ program.", "I Sept. 5 Introduction", "A link to the Marmoset system and instructions for using it may be found on the course web page.", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as implementing and debugging a compiler.", "Library for research-based assignments"]}, {"course_id": 16, "course_code": "CS 245", "course_name": "CS245 - Logic and Computation (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["Logic and Computation Winter 2025", "10:30AM - 11:20AM MC 4041", "Formalizing the notions of correct and incorrect reasoning, defining what is computable, and exploring the limits of computation.", "The course covers a variety of topics related to logic and computation that are required as background for other courses in Computer Science.", "It differs both in tone and content from a logic course one would typically find in a mathematics program.", "Develop mathematical reasoning skills", "Improve understanding of propositional and first-order logic, including key notions, such as: expressing natural language statements as logical formulas, distinguishing between correct and incorrect reasoning (between valid and invalid logical arguments), constructing a formal proof, distinguishing between syntax and semantics", "Explore the limits of computers, including decidability and undecidability", "Introduction", "Structural induction and its use in proving statements about formulas", "Adequate sets of connectives", "Soundness and completeness of formal deduction", "Applications of propositional logic to computer science, such as: Automated proofs: Resolution, Davis-Putnam Procedure; Hardware and software veriﬁcation", "First-Order Logic", "Limitations of propositional logic, and the necessity of first-order logic for reasoning about objects and properties", "Quantiﬁers, universe of discourse, translation between English and first-order logic formulas", "Syntax of first-order logic: terms, formulas", "Semantics of first-order logic: valuations", "Proving argument validity in first-order logic (semantically)", "Formal deduction in first-order logic; Proving argument validity by formal deduction (syntactically)", "Applications of first-order logic to computer science, such as: Automated theorem provers and veriﬁers; Databases", "Decidability and Peano Arithmetic", "Turing Machine as a model of computation", "Undecidability: Basic notions, undecidability of the Halting Problem and other decision problems", "The Peano axioms for number theory (including the induction axiom), undecidability of Peano Arithmetic", "An Important Application of Logic to Computer Science", "Hoare triples", "partial and total correctness", "Formalize English sentences into properly formed formulas in the propositional and first-order logic and, conversely, interpret such formulas in English", "Formalize the notion of correct reasoning and proof, and be able to construct formal proofs", "Realize the limitation of formal proof systems", "Understand the applications of logic to computer science", "This means that you must decide whether to exercise your option to submit late before the deadline, and refrain from making a partial submission in this case.", "There will be a marked quiz due in each week when there will not be a Crowdmark assignment due or a mid-term examination.", "This course includes the independent development and practice of specific skills, including writing numerous proofs using numerous abstract definitions.", "Library for research-based assignments"]}, {"course_id": 17, "course_code": "CS 245E", "course_name": "CS245E - Logic and Computation (Enriched) (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["10:00AM - 11:20AM MC 2034", "Tuesday -", "This includes:", "Basic sematic notions:", "Truth tables", "A formal proof system for Propositional logic", "Soundness and completeness theorems for the proof system", "Basic sematic notions", "Structures for a vocabulary", "Logical truths and logical implications", "Translations between FOL formulas and English and mathematical statements.", "A formal proof system for Predicate logic", "Soundness theorem for the proof system", "However, the focus of this version of the course is more on fundamental and mathematical concepts (on the expense of developing technical skills, such as designing formal proofs).", "We will use propositional logic as a main tool for demonstration key logical concepts such as", "Structural induction its justification and many applications.", "soundness and completeness theorems", "the expressive power of the logic (what can and what cannot be expressed).", "We will revisit these topics for first order logic.", "Finally, we will discuss applications of logic to computer science, in particular showing limitations of computations (undesirability)."]}, {"course_id": 18, "course_code": "CS 246", "course_name": "CS246 - Object-Oriented Software Development (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["Object-Oriented Software Development Winter 2025", "10:00AM - 11:20AM MC 1056", "10:30AM - 11:20AM MC 3003", "11:30AM - 12:20PM MC 3003", "Tuesday -", "Ross Evans rpevans@uwaterloo.ca", "Introduction to object-oriented programming and to tools and techniques for software development.", "Designing, coding, debugging, testing, and documenting medium-sized programs: reading specifications and designing software to implement them; selecting appropriate data structures and control structures; writing reusable code; reusing existing code; basic performance issues; debuggers; test suites.", "This course introduces students to object-oriented programming in C++ to facilitate designing, coding, debugging, testing, and documenting medium-sized programs.", "Students learn to read a specification and design software to implement it.", "Important skills are selecting appropriate data structures and control structures, writing reusable code, reusing existing code, understanding basic performance issues, developing debugging skills, and learning to test a program.", "C++", "Introduction to C++", "I/O and Strings", "Basic language constructs and Functions", "Exceptions", "Introduction to Templates", "Exception safety", "Template functions and algorithms", "Object-Oriented Programming", "UML class models", "Constructors and Destructors", "Encapsulation", "Inheritance", "Design patterns: Iterator, Observer, Decorator, Factory method, Template method, Non-virtual interface (NVI), and the Pimpl idiom", "Inheritance: vtables", "Multiple inheritance", "Design quality", "MVC (model-view-controller) architecture", "Design, implement, test, and debug C++ programs to solve problems requiring hundreds of lines of code, making appropriate use of", "types, variables, arrays, strings, and dynamic memory; loops, conditionals, and other control structures; structures, unions, and enumerations; procedures and functions; the preprocessor; formatted and unformatted I/O", "a subset of the STL, including vector, list, and map", "assertions and exceptions", "test suites for regression testing, white and black box testing", "structured programming, incremental development", "interface design, abstractions, information hiding, cohesion and coupling", "a subset of UML to specify classes, objects and relationships among them", "a selection of design patterns", "Explain the following properties of the memory model used in C++, including their impact on time and space efficiency when designing code: bytes vs. words, memory as an array, run-time stack and stack frames, memory allocation on the heap vs. automatic allocation on the stack, pointers as memory addresses, the representation of objects in memory", "You must complete A0 in order to receive marks for the rest of the course.", "A1 Basic C++ Monday, January 20 Monday, January 27 5", "A2 Introduction to OOP Monday, February 3 Monday, February 10 6", "A4 Design Patterns Monday, March 10 Monday, March 17 8", "Note: Marmoset is not a compiler!", "Do not submit C++ code to Marmoset, without first attempting to compile it yourself.", "Students from different sections can be in the same group.", "Working on a group is an important learning experience for software development in a team.", "Students in a group will be responsible for forming and managing the group.", "Please be very careful in selecting your group as there are always groups that end up having major issues every term.", "Exams", "Examination Date Final Grade Weight", "Each weekly set of problems completed succesfully can be used to replace 0.5% of the final grade from the final exam.", "In the case where both a midterm and final exam can be held, the final course grade will be calculated from the following components and weights:", "To pass the course, you must satisfy these three conditions:", "A grade of at least 45% on the weighted average of assignments A1-A4", "Assignments1to4  = (A1*5 + A2*6 + A3*6 + A4*8) / 25", "Normal = A1*5 + A2*6 + A3*6 + A4*8 + A5*15 + Midterm*20 + Final*(40-0.5*TutorialsCompleted) + 0.5*TutorialsCompleted", "if (MidtermInPerson==TRUE && FinalInPerson==TRUE)", "else", "if (MidtermInPerson==FALSE && FinalInPerson==TRUE)", "else", "if (MidtermInPerson==TRUE && FinalInPerson==FALSE)", "else", "if (MidtermInPerson==FALSE && FinalInPerson==FALSE)", "else", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 19, "course_code": "CS 246E", "course_name": "CS246E - Object-Oriented Software Development (Enriched) (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["Object-Oriented Software Development (Enriched)", "Tuesday -", "CS246 description: Introduction to object-oriented programming and to tools and techniques for software development.", "Designing, coding, debugging, testing, and documenting medium-sized programs: reading specifications and designing software to implement them; selecting appropriate data structures and control structures; writing reusable code; reusing existing code; basic performance issues; debuggers; test suites.)", "functions and classes as the basic building blocks for abstractions", "function and class templates; exception safety", "object-oriented design principles; design patterns", "language features in combination", "Software library development for general client use.", "Principles of object-oriented software design.", "A selection of software design patterns.", "A1     10%", "Office hours: the list of office hours can be found at https://student.cs.uwaterloo.ca/~cs246e/F24/officehours.shtml", "Note: Marmoset is not a compiler!", "Please do not submit C++ code to Marmoset without first attempting to compile it yourself.", "The release test for a problem gives you the result of running your program on one basic test case (usually a case that appears in the assignment specification).", "So be sure to test your code thoroughly, so that you pass as many of our secret tests as possible.", "Testing", "Hand-Marking", "Note that correctly-working code is only one component of an assignment mark.", "Intellectual property includes items such as:", "CAN I POST MY CODE ONLINE?", "The second complicating factor concerns the question of who actually owns assignment solutions.", "The instructor supplies the question, a framework for the solution (including rules, guidelines, and possibly some starter code or libraries) and has in mind the general structure of what a correct solution ought to look like.", "the instructor(s) may permit posting of only those portions of assignments that were not provided as starter code;", "The instructors' policy for a given offering of a course will be stated in the course outline.", "If you wish to share your code with potential employers, and your instructor does not permit you to publicly post your solutions, you may host your code in a private repository, and provide a password to potential employers (for example, on your resume).", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 20, "course_code": "CS 251", "course_name": "CS251 - Computer Organization and Design (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["Notice of Recording", "Computer Organization and Design Winter 2025", "11:30AM -", "RCH 307", "10:30AM - 11:20AM EV3 1408", "Silvia Zhang cs251@uwaterloo.ca", "Basics of digital logic design.", "Data representation and manipulation.", "Basics of processor design.", "This course enables students to develop an accurate mental model of the architecture and organization of physical computers and it introduces them to theoretical and practical concepts relevant to the structure and design of modern digital computers.", "Design simple combinational and sequential hardware at the logic gate level in order to implement simple algorithms and computations, such as addition, multiplication, and data-path control for processors.", "Describe number systems used by computer hardware, including IEEE floating point and two's complement.", "Analyze how machine language is executed by hardware, and describe a simple pipelined processor architecture for executing a RISC machine language.", "Explain basic cache and virtual-memory architectures, and how they can impact performance.", "Introduction and ARM (~3 hours)", "Combinational logic and basic components.", "Basic Processor Design (~9 hours)", "Processor design using single-cycle control.", "Multi-cycle control.", "Virtual memory.", "Multi-processor systems and core processors.", "Patterson and Hennessy: \"Computer Organization and Design\".", "Students registering their clicker for other sections will receive a grade of zero on clicker questions.", "else", "Notice of Recording", "In general, assignments submitted late and without an approved extension by the course ISC will not be accepted and will be given a grade of zero.", "If a student makes a short-term 48-hour declaration, they may contact the course ISC to obtain a 48-hour extension.", "Note that penalties are significantly higher for exams and for repeat offenders.", "Discussion of assignments is allowed, but each student must hand in their own copy of the assignment and word-for-word copying is not allowed.", "In-Class Discipline", "A student who is found to be disruptive during lectures will be given only one verbal warning for the term.", "Students should attend the section they're enrolled in and only the section they're enrolled in", "Further, a weekly quiz will be given and used in place of clickers in the marking scheme.", "Dropping lowest clickers marks, lowest quiz score", "Online Exams", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:"]}, {"course_id": 22, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 23, "course_code": "MATH 137", "course_name": "MATH137 - Calculus 1 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["Notice of Recording", "10:30AM - 11:20AM MC 4059", "Monday -", "Monday", "07:00PM - 08:50PM", "Absolute values and inequalities.", "Sequences and their limits.", "Introduction to series.", "Limits of functions and continuity.", "Applications of the Mean Value theorem, Taylor polynomials and Taylor's theorem, Big-O notation.", "We will study these ideas as they relate to sequences and functions.", "First, we will examine sequences and what it means for one to converge.", "Next, we will use our knowledge of sequences to discuss functions, including limits and derivatives.", "Write clear and well-organized mathematical solutions and proofs.", "Solve problems in Calculus through logical thinking and careful analysis.", "Determine if a recursively-defined sequence converges and prove it using mathematical induction.", "Compute the limits of various functions using both the formal definition of the limit, arithmetic rules for limits,and l'Hopital's Rule.", "Find solutions to optimization and related rates problems.", "Sketch curves by first analyzing a given function and its derivatives.", "4: Jan 27 - 31 2.1 - 2.2 Functions and their Limits, Sequential Characterization of Functions, Squeeze Theorem Quiz 3", "7: Mar 3 - 7 3.5 -  3.7 Linear Approximation, Newton's Method, IFT Quiz 6", "8: Mar 10 - 14 3.8 - 4.2 Implicit and Logarithmic Differentiation, Related Rates, Local & Global Extrema, EVT Quiz 7", "9: Mar 17 - 21 ‡ 4.3 - 4.6 MVT and its Applications, Shape of a Function via 1st and 2nd Derivatives Quiz 8", "FE: Mar 31 - Apr 4 4.9 - 4.10 Curve Sketching, Optimization Quiz 10", "Notice of Recording", "Phone: 519-884-0000 extension 213", "Please let us", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 24, "course_code": "MATH 147", "course_name": "MATH147 - Calculus 1 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["11:30AM - 12:20PM MC 4059", "04:30PM - 05:20PM", "Monday -", "Monday", "07:00PM - 08:50PM", "Introduction to mathematical proofs: Week 1;", "2. Sequences and Limits: Weeks 2 – 4;", "3. Functions and Continuity: Weeks 5–8;", "Introduction to Real Analysis, by R. Bartle and D. Sherbert No", "Any missed assignment will be given a score of zero.", "For any missed examination, you must have a valid reason and appropriate supporting documentation.", "In case VIF or STAD covers the midterm, the midterm may be excused, and its weight may be transferred to the final exam."]}, {"course_id": 25, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Computer Science", "program_id": 40, "major_id": 3, "major_name": "Business Administration and Computer Science Double Degree (Bachelor of Business Administration and Bachelor of Computer Science - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}]