[{"course_id": 1, "course_code": "ACTSC 372", "course_name": "ACTSC372 - Investment Science and Corporate Finance (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Monitor discussions & respond to questions on Piazza.", "Introduction to financial markets.", "Rigorous derivations of Markowitz portfolio optimization and its application in investment decisions.", "Introduction to options, forwards, and swaps.", "This course provides a comprehensive introduction to capital markets, investment principles, and financial decision-making.", "The course also examines behavioral finance and the limitations of financial models, offering a balanced perspective on modern finance.", "Understand the structure and functioning of capital markets and evaluate risk-return trade-offs in investment decisions.", "Apply mean-variance optimization to construct efficient portfolios and analyze risk-return trade-offs.", "Utilize Arbitrage Pricing Theory (APT) to identify and assess multiple risk factors influencing asset returns.", "Understand and apply the Modigliani-Miller (MM) propositions to assess capital structure decisions in perfect markets.", "Explain put-call parity and its role in pricing options and identifying arbitrage opportunities.", "Analyze the impact of behavioral biases on investor decision-making and market outcomes.", "Evaluate the limitations of financial models and theories in real-world applications.", "Course Intro & Overview of Financial Markets", "Investment Rules & Capital Budgeting", "Mean-variance optimization", "CAPM & Arbitrage pricing theory (APT)", "Dividend policy & Introduction to options", "Option Pricing & Expected utility theory", "Behavioral finance & course review.", "Midterm locations are MC 1085 & EIT 1015."]}, {"course_id": 2, "course_code": "AFM 101", "course_name": "AFM101 - Introduction to Financial Accounting (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Financial Accounting Winter 2025", "AFM 101", "AFM 101 081", "AFM 101:", "This course is an introduction to financial accounting.", "View requirements for AFM 101", "Define and use financial accounting terminology.", "Identify and correct basic accounting errors in financial statement accounts.", "Draw conclusions and make recommendations based on financial information.", "Identify and apply the principles of financial reporting.", "Apply basic financial accounting principles in an industry.", "Your access code is available in multiple formats.", "Financial Accounting and MyLab - ebook and access code", "MyLab - access code only", "This course includes the independent development and practice of specific skills, such as understanding financial statements, conducting financial analysis, and preparing financial statements.", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 3, "course_code": "AFM 102", "course_name": "AFM102 - Introduction to Managerial Accounting (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Managerial Accounting Winter 2025", "AFM 102", "AFM 102 081", "Your instructor checks email and the Ask the Instructor discussion topics frequently and will make every effort to reply to your questions within 24–48 hours, Monday to Friday.", "AFM 102:", "This course is an introduction to the preparation and use of accounting information for management decision-making and reporting.", "Cost behaviour, cost accumulation systems, and short- and long-term decision models are discussed.", "View requirements for AFM 102", "We will be learning how to perform internal analysis including cost-volume-profit analysis, profitability analysis, performance analysis, and capital budgeting analysis.", "Distinguish between various cost classifications and analyze a company’s cost structure to facilitate internal decision-making.", "Apply cost-volume-profit (CVP) analysis to recommend the best course of action given different “what-if” scenarios.", "Explain the budgeting process and prepare components of master and flexible budgets.", "Week 1: Introduction to Managerial Accounting", "Week 2: Cost Terms and Concepts", "Week 4: Cost-Volume-Profit Analysis", "Week 9: Standard Costs and Over Analysis", "Week 11: Relevant Costs and Benefits for Decision-Making", "Week 12: Capital Budgeting Decisions", "Optional No $99 (e-book & Connect Access Code)", "Re-Grading", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 4, "course_code": "AFM 131", "course_name": "AFM131 - Introduction to Business in North America (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Business in North America Winter 2025", "AFM 131", "Coverage also includes study of the principles of effective management and the financial system as a source of corporate capital.", "View requirements for AFM 131", "Describe the business environment and the relationships between the functional areas of business", "Write in a professional manner to effectively communicate in the appropriate context (e.g., in a discussion board)", "Demonstrate collaboration skills (i.e., understanding, respect) to work effectively in a team during discussions", "Penalties for Academic Integrity Offenses", "48 hour short-term absence", "Self-declared COVID-related absence", "Intellectual property includes items such as:", "Cross-listed courses", "Phone: 519-884-0000 extension 213", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 5, "course_code": "AMATH 350", "course_name": "AMATH350 - Differential Equations for Business and Economics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Differential Equations for Business and Economics Winter 2025", "11:30AM - 12:20PM MC 4045", "First order ordinary differential equations.", "Applications to continuous compounding and the dynamics of supply and demand.", "Higher order linear ordinary differential equations.", "Systems of linear ordinary differential equations.", "Introduction to linear partial differential equations.", "Ordinary differential equations and their applications", "Systems of linear ordinary differential equations", "Linear partial differential equations and Fourier transform", "Black-Scholes equation and solution", "(Jan 6-10) Introduction to Differential Equations (DEs), Separable Equations, Initial-Value Problems, Applications from Finance", "Dimensional Homogeneity, First-Order Linear Ordinary DEs, Use of Substitutions, Applications from Finance Chapter 2 Posting Assignment 1", "Introduction to Higher-Order Linear Equations: Theoretical Background", "Introduction to Systems of Ordinary Differential Equations, Method of Solution for Homogeneous Systems (Second Order)", "(Mar 3-7) Introduction to Partial Differential Equations, First-order Equations (Partial Integration, Method of Characteristics) Chapter 5", "Second-Order Linear PDEs: Classification, Solution by Partial Integration or Method of Characteristics Chapter 5", "Please submit your assignments early in case of unexpected technical difficulties."]}, {"course_id": 6, "course_code": "COMM 101", "course_name": "COMM101 - Introduction to Financial Markets (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Financial Markets Winter 2025", "The course introduces students to the role of finance in the global economy and aims to develop students' understanding of the basic principles of financial decision-making.", "View requirements for COMM 101", "Solve fundamental time value of money problems faced by Canadian consumers and investors.", "Explain how the various securities markets in Canada operate.", "Analyse a company’s financial performance sufficiently to arrive at an investment opinion.", "Identify fundamental strategies for exchange traded funds, mutual funds, and options, and their suitability for Canadian investors.", "The objective of this course is to introduce students to the financial markets with a particular emphasis on providing sufficient material to allow students to trade on such markets either through a stock market simulation game, or directly for their own account.", "Course Introduction Introduce Yourself", "Students will require a financial calculator or Microsoft Excel for calculations on some concept checks and quizzes.", "We cannot accept late submissions except in the case of a verifiable illness.", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 7, "course_code": "CS 330", "course_name": "CS330 - Management Information Systems (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Management Information Systems Winter 2025", "Email: kevin.lanctot@uwaterloo.ca", "An introduction to information systems and their strategic role in business.", "Topics include types of information systems, organizational requirements, systems development strategies, decision support systems, data and information management, and information systems management, control, and implementation.", "This course is aimed at students who are not CS majors but are interested in continuing their study of computer science beyond first year.", "Make informed decisions about using technology in a business environment.", "Define and explain the characteristics of a variety of business information systems.", "Describe strategic roles and management usage for information systems in business.", "Understand the relationships among various information systems.", "A1", "Feb 25, 27 Topic 4 - Introduction to IS (Ch 1 in text)", "A2", "A4", "A copy of the 7th edition will be placed on 3-hour reserve in the Davis Library.", "Evaluation", "If you miss the final assessment, you will be given an INC if there is a strong reason for missing it (generally a serious medical issue verified by a VIF).", "This course includes the independent development and practice of specific skills, such as designing information systems.", "Library for research-based assignments", "Physical and Mental Health", "See https://uwaterloo.ca/campus-wellness/ for a list of on-campus supports and workshops.", "In particular:", "Intellectual property includes items such as:"]}, {"course_id": 8, "course_code": "ECON 101", "course_name": "ECON101 - Introduction to Microeconomics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Microeconomics Winter 2025", "ECON 101", "Email: chvandew@uwaterloo.ca", "“ECON 101” must appear in the subject line and the message must include your full name and student ID number.", "This course provides an introduction to microeconomic analysis relevant for understanding the Canadian economy.", "The behaviour of individual consumers and producers, the determination of market prices for commodities and resources, and the role of government policy in the functioning of the market system are the main topics covered.", "View requirements for ECON 101", "The course comprises the theoretical essentials of microeconomics and will serve as a prerequisite for virtually every economics class that you will endeavour to take in the future.", "understand the need for people to make choices and to work together towards overcoming the universal problem of scarcity;", "appreciate the relevance of economics in a changing world;", "apply elements of microeconomic theory to understand how consumers and producers make rational decisions;", "decompose problems into their economic parts.", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Intellectual property includes items such as:", "Please carefully read the Economics Department policy for instructions.", "Economics Department Deferred Final Exam Policy", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Applications for Accommodation", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 9, "course_code": "ECON 102", "course_name": "ECON102 - Introduction to Macroeconomics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Macroeconomics Winter 2025", "ECON 102", "04:00PM - 05:20PM", "View requirements for ECON 102", "Describe important macroeconomic questions and goals, and explain how monetary and fiscal policy may influence economic outcomes.", "Explain and solve simple models and problems.", "Identify strengths and weaknesses of macroeconomic data, models and theories.", "I. Introduction", "Measurement, Accounting and Data", "Gross Domestic Product and the System of National Accounts.", "Inflation and Price Indices.", "Economic Frameworks", "Modelling Concepts and Model Evaluation.", "Concept of Aggregate Demand in the Goods Market.", "Trends, Cycles and Inequality", "Inequality and Poverty concepts and issues.", "Money and Inflation", "Monetary System and role of money.", "Cost of Inflation", "International Economic Concepts, Exchange Rates and Balance of Payments", "The lecture slides cover a variety of standard macroeconomic topics.", "CAUTION: the notation and even the macroeconomic models presented can vary subtly across textbooks.", "Differences in approach and thought can also help to better understand the benefits and drawbacks of different economic theory and methods.", "The format of the mid-term will be multiple-part short-answer questions.", "All deferred Final Exam requests for Economics courses are administered by the Economics Undergraduate Office.", "In order to achieve a healthy balance between work hours and personal life, there will be a finite amount of time I can dedicate to appointments and emails.", "Also know that I am here to support your learning goals, whether they be to understand a subset of the econometric tools, to pass the course, or to achieve a high grade.", "Applications for Accommodation", "Economics Department Deferred Final Exam Policy", "On campus supports", "Other on-campus supports", "Please see WUSA main web page for these and other services and clubs which may provide more specific and personalized support for specific needs.", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 10, "course_code": "STAT 371", "course_name": "STAT371 - Applied Linear Models and Process Improvement for Business (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Applied Linear Models and Process Improvement for Business Winter 2025", "08:30AM - 09:50AM RCH 307", "Practical and theoretical aspects of simple and multiple linear regression models.", "Strategies for variation reduction such as control charting.", "Applications to problems in business.", "View requirements for STAT 371", "Develop appropriate and meaningful linear regression models to fit to data from business, finance, and other fields for the purpose of answering relevant questions about relationships between the response and explanatory variables in a population or process of interest.", "Use the programming language, R, to fit regression models and to explore course concepts.", "Interpret regression results from R output, draw conclusions from these results in the context of the study, and effectively communicate these results and conclusions to disparate audiences and interest groups.", "Use graphical and numerical analyses to determine whether the fitted model is appropriate with respect to its underlying model assumptions.", "Employ model selection methods and model improvement techniques to improve the fit of the model.", "Explain the mathematical theory behind the results and output from a regression analysis, including the derivation of the distributions of model parameter estimators.", "To understand and apply the statistical concepts, theory and techniques necessary to monitor and assess process performance.", "Simple linear regression review:", "Graphical and numerical summaries of bivariate data", "The simple linear regression model", "Assumptions of the normal model", "Least squares estimation of β0 and β1", "Least squares estimation of σ2", "Interpretation of parameter estimates", "Distribution of", "Confidence intervals and hypothesis tests for β1", "Multiple linear regression:", "The normal model", "Least squares estimation of β", "The hat matrix", "Least squares estimation of σ2", "Distribution of", "Confidence intervals and hypothesis tests for β", "Confidence intervals for µnew and prediction intervals for Ynew", "Modelling categorical variables", "Inference for model parameters", "Analysis of Variance (ANOVA)", "Introduction", "ANOVA table and the F-test", "Additional sum of squares", "Analysis of Variance (ANOVA) (cont'd)", "Indicator variates and additional sum of squares", "General linear hypothesis", "Model Assumptions", "Addressing model inadequacies", "Distribution of residual vector, e", "Leverage and influential observations", "Model selection", "Sequential methods of model selection", "Interaction", "Waterloo Faculty Salary case study", "Fitting linear models to time series data", "Introduction", "Modelling seasonal and trend components", "Mar. 24 - 28", "Introduction to Process Performance", "Introduction", "Control charts", "Average run length", "3-sigma control limits and other signals of process instability", "Control charts for count data", "CUSUM and EWMA control charts", "Housing bubble article example", "Introduction to Regression Modelling, by B. Abraham and J. Ledolter (Brooks/Cole pub.)", "compassionate grounds", "Answers to questions requiring verbal explanations must be in your own words.", "Please be sure to read the posted Assignment Information and Guidelines document for important assignment and submission information (in particular, be sure you understand the 72-hour grace period policy for each assignment).", "In-person concept quizzes will be replaced with online quizzes", "Instructor INC Policy for STAT 371: In the case of a missed final exam with supporting documentation, an INC grade will only be awarded if both the following conditions are satisfied:"]}, {"course_id": 11, "course_code": "ACTSC 446", "course_name": "ACTSC446 - Mathematics of Financial Markets (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Mathematics of Financial Markets Fall 2023", "08:30AM - 09:50AM MC 4058", "This course covers mathematical techniques for no-arbitrage pricing and hedging financial derivatives.", "Topics to be covered can be classified into three broad areas: derivatives markets (options; forwards and futures; other derivatives; put-call parity), discrete-time financial models (binomial models; general multi-period models; Fundamental Theorems of Asset Pricing; risk-neutral probability), and continuous-time financial models (basic stochastic calculus and Itô's lemma; Black-Scholes model; interest rate models and bond pricing)."]}, {"course_id": 12, "course_code": "MATBUS 470", "course_name": "MATBUS470 - Derivatives (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM MC 1085", "Email: keith.freeland@uwaterloo.ca", "Friday's 9:30-10:30am in M3-2016", "Chapter 2: Futures markets and CCP", "Chapter 10: Mechanics of options market", "Chapter 11: Properties of stock options", "Chapter 12: Trading strategies involving options", "I currently have the 11th edition of the textbook.", "Answers to End of Chapter Questions in North American Edition", "There will not be a 24-hour window, the test must be completed during the scheduled class time.", "Give a clear explanation as to why you think you deserve a different mark.", "No alternatives arrangements will be made for students in other locations, time zones or for those choosing to travel during the exam period.", "Notice of Recording"]}, {"course_id": 13, "course_code": "AFM 231", "course_name": "AFM231 - Business Law (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["07:00PM - 09:50PM", "Students can contact the course instructor via email at rhussein@uwaterloo.ca.", "Particular attention is given to the law relating to contracts and business organizations.", "AFM 231: View requirements for AFM 231", "While the course introduces you to basic concepts in law, it is designed for, and particularly emphasizes topics that will be of specific relevance to you as future business managers, owners, or even practicing professionals.", "This includes understanding the basics of legal risk so you can make more effective business decisions.", "Business managers/owners often must engage in risk management exercises.", "Appreciate the complexity of integrating multiple private law concepts into the analysis of a business situation.", "Utilize a basic framework for legal risk management assessments and generate an inventory of possible legal risk management tools.", "Describe the common as well as contrasting relationship between legal compliance and ethical conduct.", "March 24-28", "Wrap-up", "Accordingly, if students do opt to use an older edition it would be advisable to use an edition that is as close to the 8th edition as possible and consider cross-referencing it to the current edition and noting any differences.", "Completion", "The response demonstrates a clear understanding of the relevant course concepts and effectively applies these concepts to the hypothetical scenario.", "Application to Real-World Example", "The response includes an appropriate real-world example that relates to the course material, illustrating how the concept can be applied outside the context of the hypothetical.", "Students may also include a revised answer based on a similar but different set of hypothetical facts.", "For example, a student may propose one solution based on the given facts but suggest a different solution if the facts were altered.", "Students are expected to demonstrate critical thinking and clearly articulate their reasoning.", "Each quiz covers content that relates to the current course content (the current chapters and occasionally a prior chapter as well if it has not yet been part of a quiz).", "Submission Times", "Reevaluation Request", "Requests for re-evaluation of submitted material can be done via email.", "Also, students should detail what their concern as specifically as possible.", "Artificial Intelligence Tools", "Also, some evaluation elements are structured such that it may be even quicker to do it yourself than to utilize an AI tool and then further edit/revise before submission.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 15, "course_code": "LS 283", "course_name": "LS283 - Business Law (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["07:00PM - 09:50PM", "Students can contact the course instructor via email at rhussein@uwaterloo.ca.", "Particular attention is given to the law relating to contracts and business organizations.", "AFM 231: View requirements for AFM 231", "While the course introduces you to basic concepts in law, it is designed for, and particularly emphasizes topics that will be of specific relevance to you as future business managers, owners, or even practicing professionals.", "This includes understanding the basics of legal risk so you can make more effective business decisions.", "Business managers/owners often must engage in risk management exercises.", "Appreciate the complexity of integrating multiple private law concepts into the analysis of a business situation.", "Utilize a basic framework for legal risk management assessments and generate an inventory of possible legal risk management tools.", "Describe the common as well as contrasting relationship between legal compliance and ethical conduct.", "March 24-28", "Wrap-up", "Accordingly, if students do opt to use an older edition it would be advisable to use an edition that is as close to the 8th edition as possible and consider cross-referencing it to the current edition and noting any differences.", "Completion", "The response demonstrates a clear understanding of the relevant course concepts and effectively applies these concepts to the hypothetical scenario.", "Application to Real-World Example", "The response includes an appropriate real-world example that relates to the course material, illustrating how the concept can be applied outside the context of the hypothetical.", "Students may also include a revised answer based on a similar but different set of hypothetical facts.", "For example, a student may propose one solution based on the given facts but suggest a different solution if the facts were altered.", "Students are expected to demonstrate critical thinking and clearly articulate their reasoning.", "Each quiz covers content that relates to the current course content (the current chapters and occasionally a prior chapter as well if it has not yet been part of a quiz).", "Submission Times", "Reevaluation Request", "Requests for re-evaluation of submitted material can be done via email.", "Also, students should detail what their concern as specifically as possible.", "Artificial Intelligence Tools", "Also, some evaluation elements are structured such that it may be even quicker to do it yourself than to utilize an AI tool and then further edit/revise before submission.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 16, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 17, "course_code": "CO 255", "course_name": "CO255 - Introduction to Optimization (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Introduction to Optimization (Advanced Level)", "08:30AM - 09:50AM MC 4040", "Linear optimization: feasibility theorems, duality, the simplex algorithm.", "Know a variety of optimization algorithms, including the Simplex method, cutting plane methods, and descent methods.", "Know and apply the definition and properties of convex sets and functions.", "Write the dual of a linear programming problem and understand the properties relating the primal and dual.", "Apply optimization methods to common continuous and discrete problems including game theory, flow, scheduling, and data science.", "Linear programming, Fourier-Motzkin elimination, and Farkas's lemma.", "Duality in linear programming.", "Convex optimization and the KKT conditions.", "Discrete optimization and total unimodularity.", "Applications of total unimodularity to matching and flow problems", "Application of nonlinear optimization to data science", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course.", "If you have questions or concerns about these matters, please email mathadvisor@uwaterloo.ca."]}, {"course_id": 18, "course_code": "CS 335", "course_name": "CS335 - Computational Methods in Business and Finance (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Computational Methods in Business and Finance Winter 2025", "Tuesday -", "An introduction to numerical methods for business and finance.", "Methods for portfolio optimization and contingent-claims valuation.", "This course will cover topics such as: lattice methods for pricing contingent claims, Monte Carlo techniques for pricing options and evaluating investment strategies, use of optimization software for portfolio optimization, solution of nonlinear equations (yield to maturity, implied volatility), floating point error propagation, and polynomial interpolation.", "Assignments will involve both theoretical problems and practical programming tasks using Python.", "This course will give students in the business-related programs in the Faculty of Mathematics an introduction to basic computational methods used in business and financial applications.", "Introduce students to basic computational methods used in business and financial applications.", "Week of Jan 27: Dynamic programming, Black-Scholes equation", "Computational Methods in Business and Finance Course Notes Provided digitally on LEARN for free Yes", "Students may discuss general concepts and problems with other individuals in class.", "You should start the first assignment as soon as possible to begin setting up and getting familiar with these tools.", "The focus of this course is on learning general mathematical and financial computing concepts, rather than a particular programming language.", "Marking", "Your code and its output are an important part of the assignment, so they should be readable and well-commented.", "Likewise, assignment figures and graphs should be carefully thought out to present your data and conclusions in an effective and clear manner.", "Any code and algorithms you write should be sufficiently well documented through code comments or descriptions to be readily understood.", "If you feel your assignment/midterm was marked incorrectly, first write a clear explanation of specifically what you would like reviewed, and communicate this to the appropriate instructor or TA.", "We encourage you to discuss general concepts and problems with classmates, tutors, TAs, and the instructor.", "Intellectual property includes items such as:"]}, {"course_id": 19, "course_code": "CS 476", "course_name": "CS476 - Numeric Computation for Financial Modeling (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Numeric Computation for Financial Modeling Winter 2025", "10:00AM - 11:20AM MC 2035", "Erik Hintz", "The interaction of financial models, numerical methods, and computing environments.", "Basic computational aspects of option pricing and hedging.", "Numerical methods for stochastic differential equations, strong and weak convergence.", "Finite difference methods for the Black-Scholes equation.", "Methods for portfolio optimization, effect of data errors on portfolio weights.", "The interaction of financial modes, numerical methods, and computing environments.", "Basic computational aspects of option pricing and hedging.", "Numerical methods for stochastic differential equations, strong and weak convergence.", "Finite difference methods for Black-Scholes equation.", "Methods for portfolio optimization, effect of data errors on portfolio weights.", "apply and understand modern numerical algorithms for use in financial applications.", "The following are the tentative topics in chronological order:", "Introduction to financial markets:", "Introduction to stocks, bonds, options", "no arbitrage pricing", "option pricing on lattices", "Black Scholes model and Ito's Lemma", "Random variate generation", "Option pricing", "VaR and CVaR estimation", "Correlate assets", "PDEs for European and American Options", "Explicit and Implicit Finite Difference Methods", "4. Calibration and Optimization", "Option model calibration", "CVaR portfolio optimization", "non-linear optimzation", "Your Crowdmark submission must include all code and relevant output; code must be reasonably well commented.", "The first weeks will be spent on introducing some basics of financial markets/financial mathematics.", "), usually a make-up examination will take place at a time mutually agreed-upon.", "To have your document considered for regrading you must formulate a request in writing by email to the instructor, providing the problem and a reason for why you believe it should be regraded.", "A mechanic encounters a problem, analyzes it, and fixes it with the tools from her/his toolbox."]}, {"course_id": 20, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 21, "course_code": "MATH 247", "course_name": "MATH247 - Calculus 3 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Topology on RN: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. (~3 weeks)", "Differentiation: partial differentiability, differentiability, chain rule, [midterm likely here], Taylor polynomials, extreme value problems. (~4 weeks)", "Integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. (~3 weeks)", "Local properties of continuously differentiable functions:  open mapping theorem, inverse function theorem, implicit function theorem. (~2 weeks)", "11:30AM - 12:20PM QNC 2501", "Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem.", "Topology of real n-dimensional space: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. Differential calculus on multivariable functions: partial differentiability, differentiability, chain rule, Taylor polynomials, extreme value problems. Riemann integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem."]}, {"course_id": 22, "course_code": "STAT 334", "course_name": "STAT334 - Probability Models for Business and Accounting (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Probability Models for Business and Accounting Fall 2024", "TBA", "Be able to define and apply appropriate mathematical models to real life situations, and be able to present these conclusions to a “non-statistical” audience in both oral and written communication", "7 Oct 21-25 IV Short-Term Behaviour of Markov Chains", "9 Nov 4-8 V Poisson Process Basics, Advanced Properties", "Poisson Process Basics, Advanced Properties", "Brownian Motion Basics, Modifications, Advanced Properties", "The basic idea will be to select a topic of interest to you and model it with a Markov Chain.", "There will be a presentation and a report due, as well as peer and self-reflective evaluations."]}, {"course_id": 23, "course_code": "STAT 330", "course_name": "STAT330 - Mathematical Statistics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Mathematical Statistics Winter 2025", "10:30AM - 11:20AM DC 1351", "This course provides a mathematically rigorous treatment for topics covered in STAT230 and 231, and to make essential extensions to the multivariate case.", "Topics covered include independence of random variables, conditional expectation and the determination of the distribution of functions of random variables using the cumulative distribution method, change of variable and moment generating functions.", "Asymptotic properties of the maximum likelihood estimator are examined and used to construct confidence intervals or regions.", "Tutorial: tutorials will be used for going over solutions of practice problem sets and holding term tests.", "Have a deep understanding of various mathematical aspects of Statistics and Probability.", "Week 4 Chapter 3. Expectation & M.G.F. Term Test 1 January 28th", "Asymptotic Distributions", "Introduction to Probability and Mathematical Statistics by Bain and Engelhardt, Second Edition No 112", "Arrangements for students with official conflicts will be handled on a case by case basis."]}, {"course_id": 24, "course_code": "STAT 333", "course_name": "STAT333 - Stochastic Processes 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM DC 1350", "04:00PM - 05:20PM", "Erik Hintz: Fridays, 2:00pm - 3:00pm, in M3-2106", "Requests must be emailed to: sasugradadv@uwaterloo.ca", "Topics cover generating functions, conditional probability distributions and conditional expectation, discrete-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, applications including the random walk, the gambler's ruin problem, and the Galton-Watson branching process, an introduction to counting processes, connections between the exponential distribution and Poisson process, and non-homogeneous and compound Poisson processes.", "use moment generating functions as a tool to determine expected values and identify probability distributions of random variables;", "use the law of total expectation to calculate expected values and probabilities through the principle of conditioning;", "specify a discrete-time Markov chain (DTMC), in terms of its transition probability matrix and initial conditions, and calculate various transition probabilities;", "classify the states of a DTMC;", "define fundamental DTMC concepts including irreducibility, periodicity, and recurrence/transience;", "find limiting/stationary probability distributions for certain DTMCs through the use of the Basic Limit Theorem;", "calculate absorption probabilities and expected absorption times for DTMCs using the principle of conditioning with respect to the first transition;", "Week 11 March 24 - March 28 Chap 4: Exponential Distribution & Poisson Processes Tutorial Assignment 2", "Week 12 March 31 - April 4 Chap 4: Exponential Distribution & Poisson Processes Tutorial Test 3", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solving exercises from the Course Notes on your own.", "Introduction to Probability Models by Sheldon M. Ross (2019)"]}, {"course_id": 25, "course_code": "CO 372", "course_name": "CO372 - Portfolio Optimization Models (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Portfolio Optimization Models Fall 2024", "10:00AM - 11:20AM MC 2034", "Computational optimization methodologies underlying portfolio problems in finance.", "Computational linear algebra, determining derivatives, quadratic, and nonlinear optimization.", "Applications of optimization in finance such as volatility surface determination and global minimization for value-at-risk.", "Assignments include formulation and analysis of models used in portfolio optimization as well as some Matlab coding.", "Analyze and code optimization methods for portfolio models.", "Week 1: Linear algebra review", "Week 2: Solving a portfolio optimization problem with QR factorization; symmetric matrices", "Week 3: Three formulations of portfolio optimization", "Week 5: Risk-free security; Sharpe ratio; capital market line", "Week 7: Numerical linear algebra; null space method", "Week 8: Active set methods and parametric programming", "Week 11: Nonlinear programming and applications to portfolio optimization", "Week 12: Advanced topics: arbitrage, factor models, conditional independence, risk parity, machine learning in portfolio optimization", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course.", "·   In Fall 2022, a second self-declaration form was created for students to declare a short-term absence."]}, {"course_id": 26, "course_code": "CS 338", "course_name": "CS338 - Computer Applications in Business: Databases (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Computer Applications in Business: Databases Winter 2025", "A user-oriented approach to the management of large collections of data.", "Design relational databases", "Construct SQL queries for data retrieval", "Develop strategies for data storage and backup", "Introduction and Terminology", "Relational Data Model", "Relational Algebra", "SQL: Aggregation and Grouping", "SQL: Data and Schema Modifications", "SQL: Null Values", "ER Models", "EER Model", "EER to Relation Mapping", "DBMS Concepts and Architecture", "Transaction Processing", "Database Recovery", "Database Security", "Distributed Databases", "Business Analytics", "We highly recommend thoroughly understanding and verifying your assignment solutions to set yourselves up for success in this course since  exams in CS 338 will be closed-book, and without a strong understanding of the assignments, you may find the exams challenging."]}, {"course_id": 27, "course_code": "MATBUS 471", "course_name": "MATBUS471 - Fixed Income Securities (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Fixed Income Securities Winter 2025", "10:00AM - 11:20AM E2 1736", "M3 2109", "Analysis of fixed income securities.", "Overview of Fixed Income markets", "Price-Yield conventions", "The yield curve", "Duration and Convexity.", "Yield Curve and Interest Rate Models", "Interest Rate Derivatives", "Swaps", "Mortgage-backed Securities", "Credit analysis and derivatives", "Details and policies for all the assessments can be found on LEARN.", "Written assignments can be completed in groups of up to three students.", "Notice of Recording"]}, {"course_id": 28, "course_code": "ACTSC 445", "course_name": "ACTSC445 - Quantitative Enterprise Risk Management (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["09:30AM - 10:20AM E2 1736", "Erik Hintz", "M3-2106", "2) Basic concepts in risk management (~3 Weeks)", "3) Empirical properties of financial data and Financial time series (~ 1 Week)", "The website https://www.qrmtutorial.org also provides material closely following our reference book, including slides and R Scripts.", "Finally, note that we will work exclusively with the free software environment R for statistical computing and graphics.", "Topics and details about the final project will be given in the middle of the term.", "), usually a make-up examination will take place at a time mutually agreed-upon."]}, {"course_id": 29, "course_code": "MATBUS 472", "course_name": "MATBUS472 - Risk Management (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "11:30AM -", "Email: keith.freeland@uwaterloo.ca", "Fridays 9:30-10:30am in M3-2016", "Hedging strategies and risks in hedging.", "Chapter 1: Introduction 1.1-1.7", "Chapter 2: Banks 2.1-2.8", "Chapter 5: Trading in Financial Markets 5.1-5.5 & 5.8", "Chapter 6: The OTC Derivatives Market 6.1-6.5", "Chapter 25: Basel I & II 25.1-25.11", "Chapter 26: Basel II.5, III & Other Post-Crisis Changes 26.1-26.6", "There will not be a 24-hour window, the test must be completed during the scheduled class time.", "Give a clear explanation as to why you think you deserve a different mark.", "No alternatives arrangements will be made for students in other locations, time zones or for those choosing to travel during the exam period.", "Notice of Recording"]}, {"course_id": 30, "course_code": "AMATH 331", "course_name": "AMATH331 - Applied Real Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["04:00PM - 05:20PM", "henry.shum@uwaterloo.ca", "Email: henry.shum@uwaterloo.ca", "Give mathematical definitions of limits for sequences of real numbers, vectors, and functions.", "Define open, closed, bounded, compact, and complete sets, and distinguish these concepts.", "Determine whether a vector-valued function is continuous or discontinuous .", "2.6-2.7", "Jan 27-31 Euclidean space, sequences and convergence in Rn, closed sets  1.2, 4.1-4.3 Assign 1", "Feb 24-28 Uniform continuity, normed vector spaces 5.1, 5.5, 6.1, 7.1  Midterm", "Mar 3 - 7 Normed and inner product spaces, sequences of functions 7.1, 7.2, 7.4, 8.1, 8.2", "Mar 31-Apr 4 Finite-dimensional spaces, series of functions 7.3, 7.5, 7.6, 8.4 Assign 4", "Real Analysis and Applications: Theory in Practice Available online: https://proxy.lib.uwaterloo.ca/login?url=http://dx.doi.org/10.1007/978-0-387-98098-0 No 0", "Principles of Mathematical Analysis.", "Topics covered in each assignment will be those of roughly the two weeks up to and including Monday of the week before the deadline.", "The final exam will be registrar-scheduled and in-person, if possible, with a duration of 150 minutes.", "Re-mark Request Policy", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 31, "course_code": "PMATH 331", "course_name": "PMATH331 - Applied Real Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["04:00PM - 05:20PM", "henry.shum@uwaterloo.ca", "Email: henry.shum@uwaterloo.ca", "Give mathematical definitions of limits for sequences of real numbers, vectors, and functions.", "Define open, closed, bounded, compact, and complete sets, and distinguish these concepts.", "Determine whether a vector-valued function is continuous or discontinuous .", "2.6-2.7", "Jan 27-31 Euclidean space, sequences and convergence in Rn, closed sets  1.2, 4.1-4.3 Assign 1", "Feb 24-28 Uniform continuity, normed vector spaces 5.1, 5.5, 6.1, 7.1  Midterm", "Mar 3 - 7 Normed and inner product spaces, sequences of functions 7.1, 7.2, 7.4, 8.1, 8.2", "Mar 31-Apr 4 Finite-dimensional spaces, series of functions 7.3, 7.5, 7.6, 8.4 Assign 4", "Real Analysis and Applications: Theory in Practice Available online: https://proxy.lib.uwaterloo.ca/login?url=http://dx.doi.org/10.1007/978-0-387-98098-0 No 0", "Principles of Mathematical Analysis.", "Topics covered in each assignment will be those of roughly the two weeks up to and including Monday of the week before the deadline.", "The final exam will be registrar-scheduled and in-person, if possible, with a duration of 150 minutes.", "Re-mark Request Policy", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 32, "course_code": "PMATH 333", "course_name": "PMATH333 - Introduction to Real Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Real Analysis Fall 2024", "11:30AM - 12:20PM RCH 112", "Topics discussed include the completeness properties of the reals; the density of the rationals; the topology of real n-dimensional space: open and closed sets, connectedness, compactness (by open covers), the Heine-Borel theorem, completeness; sequences in real n-dimensional space: convergence, Cauchy sequences, subsequences, the Bolzano-Weierstrass theorem; multivariable functions: limits, point-wise and uniform continuity, the extreme value theorem, uniform convergence of sequences of functions, Taylor's theorem, term-by-term differentiation of power series; integration in real n-dimensional space: Riemann integrability, Fubini's theorem for continuous functions on rectangles, term-by-term integration of power series.", "Ordered Fields", "The Riemann Integral", "Chapter 4. Sequences and Series of Functions", "Topology in Euclidean Space", "Differentiation in Euclidean Space", "Chapter 7. Jordan Content and Integration in Euclidean Space", "Course materials can be found at http://www.math.uwaterloo.ca/~snew/", "A suggested text is An Introduction to Analysis, by William Wade."]}, {"course_id": 33, "course_code": "PMATH 351", "course_name": "PMATH351 - Real Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Real Analysis Winter 2025", "09:30AM - 10:20AM RCH 301", "Email: kghare@uwaterloo.ca", "Email: nmrslavitch@uwaterloo.ca", "Email: s352lee@uwaterloo.ca", "Normed and metric spaces, open sets, continuous mappings, sequence and function spaces, completeness, contraction mappings, compactness of metric spaces, finite-dimensional normed spaces, Arzela-Ascoli theorem, existence of solutions of differential equations, Stone-Weierstrass theorem.", "Week 7: February 24 - 28 Section 3.1 - 3.2 Midterm February 28,", "Please note, you will be responsible for all material on assignments for midterms and final exams.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 34, "course_code": "STAT 340", "course_name": "STAT340 - Stochastic Simulation Methods (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Stochastic Simulation Methods Winter 2025", "STAT 340", "10:30AM - 11:20AM MC 4045", "Office hours: Fridays, 1:00pm - 2:00pm, in M3 - 2106", "Random variate generation in the univariate and multivariate case, Monte Carlo integration, advanced computer implementation, variance reduction, statistical analysis of simulated data, extensions to challenging simulation problems.", "Mathematical treatment of the underlying stochastic concepts and proofs.", "View requirements for STAT 340", "Random variate generation in the univariate and multivariate case, Monte Carlo integration, advanced com- puter implementation, variance reduction, statistical analysis of simulated data, extensions to challenging simulation problems.", "Mathematical treatment of the underlying stochastic concepts and proofs.", "1)  Introduction to simulation and Rprogramming;", "4)  Inversion method, acceptance-rejection method, table-look up method to sample from non-uniform distributions;", "Sampling from multivariate distributions and copulas;", "7)  Monte-Carlo estimators and its properties;", "Further topics time-permitting", "iClicker Rules", "), usually a make-up examination will take place at a time mutually agreed-upon.", "To have your document considered for regrading you must formulate a request in writing by email to the instructor, providing the problem and a reason for why you believe it should be regraded.", "A mechanic encounters a problem, analyzes it, and fixes it with the tools from her/his toolbox."]}, {"course_id": 35, "course_code": "STAT 341", "course_name": "STAT341 - Computational Statistics and Data Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 2, "major_name": "Mathematics/Financial Analysis and Risk Management - Professional Risk Management Specialization (Bachelor of Mathematics - Honours)", "topics": ["Computational Statistics and Data Analysis Winter 2025", "04:00PM - 05:20PM", "10:00AM - 11:20AM EIT 1015", "04:30PM - 05:20PM", "Megan French", "Daniel Zhang", "While personal matters can be communicated via email, Piazza should be the primary platform for Q&A outside of class.", "A computationally focused approach to statistical reasoning in the context of real data.", "Functional programming in R and algorithms will be used to define interesting attributes of finite populations and their sampling characteristics.", "Understand the fundamentals of population-based statistical analyses, as well as implicitly/explicitly defined population attributes", "Understand the basics of sampling and the underlying ideas/mechanisms of probability sampling and related issues", "Understand the basics of inductive inference including target and study populations, measurements, comparing subpopulations, random intervals and coverage probabilities, and resampling methods such as bootstrap", "Generate high-quality visualization and inferential statistics R output for the topics above", "Prepare reports that communicate your statistical analyses using LaTeX and R Markdown.", "Jan. 6 Introduction to the course", "location and scale invariance/equivariance", "Power transformations and linear relationships", "Implicitly defined Attributes", "Solving system of equations Assignment #1", "Iteratively re-weighted least-squares", "Sampling mechanisms and inclusion probabilities", "Sampling design", "9. Mar. 3 Anatomy of tests of significance", "A t-like discrepancy measure  Assignment #2", "Mar. 10 Multiple testing", "Student-t-based intervals", "Mar. 17  Introduction to resampling methods", "Bootstrap in regression", "Multiple samples and prediction", "Decomposition of APSE, bias-variance trade-off", "Training and Test sets", "K-fold cross validation Assignment #3", "Each folder will contain five files, e.g. for section 2.1-", "There will be a 2.5-hour, closed book, cumulative final exam during the Final Examination Period: April 9 – April 25.", "An INC grade is rarely granted and will be considered on a case-by-case basis, with decisions based largely on your performance throughout the semester.", "Self-Declared COVID-19 Related Absences: You may self-declare one absence per term during the formal lecture period for influenza-like illnesses.", "Course Software: R is a language and a free statistical computing and graphics software that we will use extensively throughout the course.", "The only time you may run into trouble is if you call a function from a package to handle a task you have been asked to code out explicitly.", "For example, if you are asked to code a function that calculates the mean of a vector in R, and your solution is to just call the function mean(), then you will not receive any marks.", "Communication: When you email your instructor, make sure you include the following information in your email:", "Including non-English characters in your email (sometimes imposed by installing a non-English operating system) prompts UW servers to spam your emails for the instructor.", "These characters most often appear in (not exclusively) the subject line, From, To, and Date/Time portions of previous communications if you reply to an email.", "You must use the web-based email platform if you suspect that you have non-English characters in your emails imposed by your computer, phone, tablet, etc.", "This course includes the independent development and practice of specific skills related to computational statistics and data analysis.", "Phone: 519-884-0000 extension 213"]}, {"course_id": 0, "course_code": "CHE 102", "course_name": "CHE102 - Chemistry for Engineers (0.50)", "term_name": "1A Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Chemistry for Engineers Winter 2025", "CHE 102", "E. Boghaert", "Eline Boghaert (eline.boghaert@uwaterloo.ca)", "While this course can be completed asynchronously online, synchronous online sessions will be held on Wednesday from 11:30 AM - 12:30 PM and Friday from 12:30 PM - 1:30 PM to review key concepts, demonstrate problem solving and answer questions.", "Stoichiometric calculations, properties of gases, properties of liquids and solutions, gas phase chemical equilibrium, ionic equilibrium in aqueous solution, oxidation-reduction reactions, chemical kinetics.", "View requirements for CHE 102", "Explain the behavior of ideal systems (including different states of matter, physical and chemical equilibrium and reaction kinetics) in terms of the molecular nature of matter.", "Write balanced chemical reactions and perform stoichiometric calculations.", "Identify which principles of physical chemistry are relevant to the analysis of problems involving physical and chemical equilibrium and rates of reaction.", "Select and apply an appropriate law to solve problems involving physical and chemical equilibrium and rates of reaction.", "Apply course concepts to identify and analyze concerns regarding the safety and/or sustainability of a chemical process.", "Unit 1: Introduction and Stoichiometry Week 1", "Introduction Lesson 1: Introduction to Significant Digits, Line Calculations and Unit Conversions (1.4, 1.5, 1.7)", "Lesson 5.1: Chemical Equilibrium and Equilibrium Constants (15.1-15.4)", "Unit 6: Equilibrium in Electrochemical Systems Week 11", "Lesson participation grades for each lesson are evenly weighted in the total lesson participation grade.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 1, "course_code": "MATH 115", "course_name": "MATH115 - Linear Algebra for Engineering (0.50)", "term_name": "1A Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Linear Algebra for Engineering Fall 2024", "02:30PM - 03:20PM", "RCH 301", "RCH 301", "10:30AM - 11:20AM E7 5353", "02:30PM - 03:20PM", "E. Dupont", "03:30PM - 04:20PM E7 5343", "10:30AM - 12:20PM RCH 301", "10:30AM - 12:20PM", "PHY 313", "E. Dupont", "08:30AM - 09:20AM", "08:30AM - 10:20AM PHY 313", "08:30AM - 10:20AM RCH 309", "10:30AM - 11:20AM RCH 103", "11:30AM - 12:20PM RCH 103", "RCH 204", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "08:30AM - 10:20AM EV3 4412", "08:30AM - 10:20AM MC 4058", "02:30PM - 03:20PM", "09:30AM - 10:20AM RCH 302", "F. Al-Faisal", "10:30AM - 12:20PM MC 4063", "10:30AM - 12:20PM MC 4060", "10:30AM - 11:20AM RCH 110", "F. Al-Faisal", "03:30PM - 04:20PM", "02:30PM - 04:20PM MC 4060", "DWE 3522", "Tuesday -", "07:00PM - 08:50PM", "Linear equations, matrices, and determinants.", "Introduction to vector spaces.", "Eigenvalues and diagonalization.", "Present solutions to problems in a clear and logical manner with all steps being fully justified.", "Understand the basic operations of addition and scalar multiplication as they apply to vectors, matrices and linear transformations.", "Find the solution to a system of linear equations using matrices and elementary row operations.", "Understand matrix algebra and its connection to systems of equations.", "Have both a geometric and an algebraic understanding of span, linear independence, bases and subspaces.", "Recognize the link between matrices and linear transformations, and understand that many common geometric operations such as projections, reflections and rotations are linear transformations.", "Develop a basic algebraic and geometric understanding of complex numbers and complex polynomials.", "Determine the eigenvalues and eigenvectors of a matrix and diagonalize a matrix.", "1.1 Vectors in Rn", "1.2 Linear Combinations", "1.3 The Norm and the Dot Product", "1.4 Vector Equations of Lines and Planes", "1.5 The Cross Product in R3", "1.6 The Scalar Equation of Planes in R3", "1.7 Projections", "Chapter 2 Systems of Linear Equations", "2.1 Introduction and Terminology", "2.2 Solving Systems of Linear Equations", "2.3 Rank", "2.4 Homogeneous Systems of Linear Equations", "3.1 Matrix Algebra", "3.2 The Matrix-Vector Product", "3.3 The Matrix Equation Ax=b", "3.4 Matrix Multiplication", "3.5 Matrix Inverses", "4.1 Spanning Sets", "4.2 Geometry of Spanning Sets", "4.3 Linear Dependence and Linear Independence", "4.4 Subspaces of Rn", "4.5 Bases and Dimension", "4.6 Fundamental Subspaces of a Matrix", "Chapter 5 Linear Transformations", "5.1 Matrix Transformations and Linear Transformations", "5.2 Examples of Linear Transformations", "5.3 Operations on Linear Transformations", "5.4 Inverses of Linear Transformations", "5.5 The Kernel and the Range", "Chapter 6 Determinants", "6.1 Determinants and Invertibility", "6.2 Elementary Row and Column Operations", "6.3 Properties of Determinants", "7.1 Basic Operations", "7.2 Conjugate and Modulus", "7.3 Polar Form", "7.4 Complex Polynomials", "7.5 Complex nth Roots", "Chapter 8 Eigenvalues and Eigenvectors", "8.1 Introduction", "8.2 Computing Eigenvalues and Eigenvectors", "8.3 Eigenspaces", "8.4 Diagonalization", "8.5 Powers of Matrices", "Linear Algebra for Engineering Fall 2024 Course Notes Required text provided on LEARN Yes", "Linear Algebra with Applications by Keith Nicholson Optional text provided on LEARN No", "The Linear Algebra for Engineering Fall 2024 Course Notes is the required text for this course, and is available on LEARN.", "The text Linear Algebra with Applications is an optional text also available on LEARN for those students looking for an alternate exposition of the material and/or additional problems to work on.", "Students looking for extra practice beyond the course notes are welcome to attempt problems in the corresponding sections of the optional textbook.", "Python Assignments: Throughout the term, there will be 5 equally weighted assignments where students will use python to execute some prewritten code in an effort to explore some larger-scale applications of linear algebra.", "If you find yourself in a situation where you are missing multiple assessments, then you are advised to contact both your instructor and the First Year Engineering Office to make sure you have the proper supports in place to succeed in this courses.", "To be clear - such websites are not allowed to be used for the completion of any part of the course MATH 115, and students are not permitted to share questions from the course anywhere.", "Generative AI: This course includes the independent development and practice of specific skills, such as computations, problem solving and proof writing.", "Library for research-based assignments"]}, {"course_id": 2, "course_code": "MATH 116", "course_name": "MATH116 - Calculus 1 for Engineering (0.50)", "term_name": "1A Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["03:30PM - 04:20PM", "RCH 301", "RCH 301", "08:30AM - 09:20AM", "03:30PM - 04:20PM", "Monday, Friday -", "11:30AM - 12:20PM", "02:30PM - 03:20PM", "09:30AM - 10:20AM RCH 103", "11:30AM - 12:20PM RCH 103", "11:30AM - 12:20PM STC 0060", "02:30PM - 03:20PM", "02:30PM - 03:20PM", "10:30AM - 11:20AM RCH 101", "09:30AM - 10:20AM RCH 110", "03:30PM - 04:20PM", "07:00PM - 08:50PM", "RCH 204", "DWE 3516", "PHY 313", "02:30PM - 04:20PM DWE 3518", "08:30AM - 10:20AM RCH 204", "08:30AM - 10:20AM MC 4063", "08:30AM - 10:20AM MC 4060", "08:30AM - 10:20AM MC 4058", "02:30PM - 04:20PM MC 4060", "DWE 1515", "DWE 3522A", "Applications of the integral.", "Use trigonometric, exponential, and logarithmic functions to solve a variety of problems.", "Use differentiation to solve a variety of application problems including curve sketching, related rates, and optimization problems.", "Introduction and Review of Functions (Domain, Range, etc.)", "Compositions of Functions", "Inverses of Functions", "Odd and Even Functions, Transformations", "Piecewise and Heaviside Function", "Trigonometric and \"Inverse\" Trigonometric Functions", "Exponential and Logarithmic Functions", "Hyperbolic Trig Functions", "Limits", "Continuity", "§ 2.1-2.4", "Differentiation", "Implicit and Logarithmic Differentiation", "Curve Sketching Techniques", "Optimization Problems", "§ 4.2-4.8", "Linear Approximation, Differentials", "The Definite Integral", "Indefinite Integrals", "Integration by Substitution", "Integration by Parts", "In particular:"]}, {"course_id": 3, "course_code": "PHYS 115", "course_name": "PHYS115 - Mechanics (0.50)", "term_name": "1A Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:50AM RCH 110", "08:30AM - 09:20AM", "09:30AM - 10:20AM RCH 105", "Name Role Email", "How to Email the Teaching Team", "See the document \"Guidance for Writing Emails to the Teaching Team\" on LEARN for email formatting tips and examples.", "Discuss strategies for solving problems.", "Please see “First-Year Engineering Tutors” and “Physics Tutorial Centre” below.", "Conservation of linear momentum, collisions, rotational kinematics and dynamics, conservation of angular momentum.", "Define and describe core concepts of classical mechanics (e.g., free fall, force, energy) and provide real-world examples to demonstrate their applications [KB, LL].", "Break down complex physical scenarios into their underlying principles, identifying relationships between forces, motion, and energy; for instance, by drawing free body diagrams [KB, PA].", "Section", "Units", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "TUT 103 & 104", "L1 and L2, Math Review 1-1 – 1.3, 2.1 – 2.3, 2.6 IQ0, TQ0 & TPS0 0, 1 / 0, 1 PE1 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "L3 and L4 2.4 – 2.5, 4.1 – 4.4 IQ1, TQ1 & TPS1 1, 2 / 1, 2 IQ0 & TQ0 (TUT 101 & 102) marks released @ 7 PM, PE2 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L3 and L4 2.4 – 2.5, 4.1 – 4.4 IQ1, TQ1 & TPS1 1, 2 / 1, 2 IQ0 & TQ0 (TUT 103 & 104) marks released @ 7 PM, PA2 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "L5 and L6 4.6 – 4.7, 5.1 IQ2, TQ2 & TPS2 2, 3 / 2, 3 IQ1 & TQ1 (TUT 101 & 102) marks released @ 7 PM, PA3 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L5 and L6 4.6 – 4.7, 5.1 IQ2, TQ2 & TPS2 2, 3 / 2, 3 IQ1 & TQ1 (TUT 103 & 104) marks released @ 7 PM, PA3 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "Applications of Newton's Laws 5.2 – 5.3 VQ7 4 / 4 -", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "TUT 103 & 104", "LEC 001 & 002", "Kinetic energy, Work and Kinetic energy 7.1 – 7.2 VQ10 5 / 5 -", "LEC 001 & 002", "LEC 001 & 002", "Potential Energy, Conservation of Mechanical Energy, Reading a Potential Energy Curve 8.1 – 8.3 VQ12 5 / 5 AS4 closed @ 7 PM, AS5 & PS5 released @ 7 PM", "T5", "TUT 101 & 102", "L10 to L12 7.1 – 7.6, 8.1 – 8.3 IQ4 TQ4 & TPS4 4, 5 / 4, 5 IQ3 & TQ3 (TUT 101 & 102) marks released @ 7 PM, PA5 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L10 to L12 7.1 – 7.6, 8.1 – 8.3 IQ4, TQ5 & TPS4 4, 5 / 4, 5 IQ3 & TQ3 (TUT 103 & 104) marks released @ 7 PM, PA5 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "Work done on a System by an External Force, Conservation of Energy 8.4 – 8.5 VQ13 6 / 6 -", "LEC 001 & 002", "T6", "TUT 101 & 102", "L13 and L14 8.4 – 8.5 IQ5, TQ5 & TPS5 5, 6 / 5, 6 IQ4 & TQ4 (TUT 101 & 102) marks released @ 7 PM, PA6 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L13 and L14 8.4 – 8.5 IQ5, TQ5 & TPS5 5, 6 / 5, 6 IQ4 & TQ4 (TUT 103 & 104) marks released @ 7 PM, PA6 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "Conservation of Linear Momentum, Elastic Collisions in One Dimension 9.5 – 9.6 VQ16 7 / 7 AS7 & PS7 released @ 7 PM", "TUT 101 & 102", "L15 and L16 9.1 – 9.6 IQ6 & TPS6 (L13 & L14) 6, 7 / 6, 7 IQ5 & TQ5 (TUT 101 & 102) marks released @ 7 PM, PA7 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L15 and L16 9.1 – 9.6 IQ6 & TPS6 (L13 & L14) 6, 7 / 6, 7 IQ5 & TQ6 (TUT 103 & 104) marks released @ 7 PM, PA7 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "Momentum and Kinetic Energy in Collisions,  9.7 – 9.8 VQ17 8 / 8 -", "LEC 001 & 002", "TUT 101 & 102", "L17 and L18 9.7 – 9.9 IQ7, TQ7 & TPS7 7, 8 / 7, 8 IQ6 & TQ6 (TUT 101 & 102) marks released @ 7 PM, PA8 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "LEC 001 & 002", "LEC 001 & 002", "T9", "TUT 101 & 102", "L19 and L20 10.1 – 10.7, 11.4 IQ8, TQ8 & TPS8 8, 9 / 8, 9 IQ7 & TQ7 (TUT 101 & 102) marks released @ 7 PM, PA9 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "L19 and L20 10.1 – 10.7, 11.4 IQ8, TQ8 & TPS8 8, 9 / 8, 9 IQ7 & TQ7 (TUT 103 & 104) marks released @ 7 PM, PA9 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "Work and Rotational Kinetic Energy 10.8 VQ22 10 / 10", "LEC 001 & 002", "TUT 101 & 102", "L21 to L23 11.5 – 11.9, 10.8 IQ9, TQ9 & TPS9 9, 10 / 9, 10 IQ8 & TQ8 (TUT 101 & 102) marks released @ 7 PM, PA10 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L21 to L23 11.5 – 11.9, 10.8 IQ9, TQ9 & TPS9 9, 10 / 9, 10 IQ8 & TQ8 (TUT 103 & 104) marks released @ 7 PM, PA10 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "L24 and L25 11.1 – 11.3, 12.1 – 12.2 IQ10, TQ10 & TPS10 10, 11 / 10, 11 IQ9 & TQ9 (TUT 101 & 102) marks released @ 7 PM, PA11 opened @ 4PM & closed @ 5PM", "14 - 2025/04/07 (Mon) - - - - IQ9 & TQ9 (TUT 103 & 104) marks released @ 7 PM, PA11 opened @ 4PM & closed @ 5PM", "Important Dates and Events in Winter 2025", "First Day of Classes Monday, January 6", "Resume Reviews Ongoing – E2 1772", "Yes -", "Yes -", "Yes -", "Marking Scheme A", "Weekly Group Progress Reports in Tutorial Sessions 3.5%", "Weekly Peer Evaluation in Tutorial Sessions 1.5%", "Weekly Team Progress Reports in Tutorial Sessions 3.5%", "Weekly Peer Evaluation in Tutorial Sessions 1.5", "As outlined below, your final mark incorporates both in-class and out-of-class activities, individual and teamwork, as well as test-based and non-test-based assessments.", "Only the first ten correct responses receive bonus marks.", "This rubric is adapted from a similar rubric in the PHYS 111 course, Fall 2022).", "Extraction of Physical Properties - Well-labeled (free-body) Diagram No physical properties extracted.", "All information represented on a well-labeled (free-body) diagram including coordinate systems, vectors.", "Manipulating Equations and Use of Numbers - Algebra and Calculations Incorrect or missing steps in algebra and numbers introduced prematurely.", "Equations manipulated satisfactorily but coordinates or numbers used incorrectly.", "Weekly Progress Reports in Tutorial Sessions", "Extraction of Physical Properties - Well-labeled (free-body) Diagram No physical properties extracted.", "Manipulating Equations and Use of Numbers - Algebra and Calculations Incorrect or missing steps in algebra and numbers introduced prematurely.", "Equations manipulated satisfactorily but coordinates or numbers used incorrectly.", "Weekly Peer Evaluation in Tutorial Sessions", "Aspect of team functioning Well below average Below average Average Above average Well above average", "Problem Solving Skills", "Level of Collaboration Allowed: Allowed – Team collaboration is required during tutorial sessions and strongly encouraged outside of them.", "Students complete at least the first two questions in teams during tutorials and submit team progress reports.", "Solutions for the remaining questions can be collaboratively discussed outside tutorials.", "I frequently monitor this channel and try to address your questions as much as I can.", "One short-term self-declaration", "Cannot be used for in-person LAB or STU", "One self-declaration of COVID-like symptoms", "Reason and dates of absence required for submission", "Discord", "The First Year Office", "The office supports you in establishing a strong academic foundation during your first year, which will help you throughout your undergraduate studies and prepare you for a successful career.", "First-Year Engineering Tutors", "Peer success coaching", "My learning skills evaluation is a self-reflection tool designed to help you assess your current learning strategies and identify areas for growth and improvement.", "Quick Tips and Resources", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Library for research-based assignments"]}, {"course_id": 4, "course_code": "MATH 118", "course_name": "MATH118 - Calculus 2 for Engineering (0.50)", "term_name": "1B Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:30AM - 11:20AM RCH 110", "02:30PM - 03:20PM", "RCH 306", "09:30AM - 10:20AM RCH 105", "RCH 306", "10:30AM - 11:20AM RCH 103", "RCH 204", "02:30PM - 03:20PM", "02:30PM - 04:20PM MC 4060", "Monday -", "Monday", "Linear and separable first order differential equations, applications.", "Parametric curves and polar coordinates, arc length and area.", "Get experience in writing well-organized and readable mathematical solutions, so that you will be able to communicate mathematical or technical ideas.", "Select an appropriate integration technique and apply it to solve indefinite or definite integrals.", "Find a power series representation of a function and find a closed form for a function represented by a power series.", "Understand the formal definition of the limit of a sequence and use it to prove basic limits.", "Understand the principle of mathematical induction and use it to prove some mathematical statements.", "Integration by substitution (review)", "Integration by parts (review)", "Trigonometric integrals", "Trigonometric substitution and completing the square", "Partial fractions", "Numerical integration", "Error bounds for numerical integration", "Improper integrals", "First make up lecture occurs", "Separable DEs, linear first-order DEs", "Applications of DEs", "Sequences, limits of sequences", "Recursively-defined sequences, mathematical induction", "Appendix A", "Integral test, p-series", "Comparison tests", "Second make up lecture occurs", "-", "Winter reading week", "-", "Absolute vs. conditional convergence", "Ratio and root tests", "Estimating sums", "Power series", "Taylor and Maclaurin series", "Sums of power series", "Applications of series", "Parametric equations", "Polar coordinates, polar curves", "Area and arc length of polar curves", "In particular:"]}, {"course_id": 5, "course_code": "ME 115", "course_name": "ME115 - Structure and Properties of Materials (0.50)", "term_name": "1B Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Structure and Properties of Materials Winter 2025", "Tuesday -", "08:30AM - 10:20AM", "08:30AM - 09:20AM", "08:30AM - 09:20AM", "DWE 3518", "08:30AM - 09:20AM", "DWE 3518", "09:30AM -", "12:20PM E3 2119", "09:30AM -", "12:20PM E3 2119", "Email: kevin.musselman@uwaterloo.ca", "Electrical and magnetic properties of materials.", "Understand primary concepts that define materials science & engineering (Ch.1) - KB", "Define four different mechanisms of bonding in materials (Ch.2) - KB", "Understand how atoms are arranged in common crystal structures (Ch.3) - KB", "Identify close-packed planes and directions in crystal structures (Ch.3) - KB", "Learn how to use Miller indices to described planes and directions (Ch.3) - KB", "Describe point defects in crystalline materials (Ch.4) - KB", "Identify likely slip systems for crystal structures (Ch.4) - KB", "Understand how grain boundaries strengthen polycrystalline materials (Ch.4) - KB", "Identify critical features of a stress strain curve (Ch.6) - KB", "Understand the basic structure and properties of polymers and composites (Ch.16,17) - KB", "Construct a stress strain curve given load and displacement data & calculate sample ductility (Ch.6) - PA", "Calculate engineering & true stress/strain (Ch.6) - PA", "Define fracture toughness; calculate it and the critical flaw size for a material (Ch.7) - PA", "Define the fracture mechanics relationship between material properties, applied stress and flaw size (Ch.7) - PA", "Quantify fatigue and creep behavior in materials (Ch.7) - PA", "Develop skills to investigate the properties of different materials by performing experiments, analyzing and interpreting data, and drawing conclusions (Labs) - I", "Understand the role of materials science in the design process (Ch.1) - D", "Recognize the role of the engineer in protecting the public and the public interest, through appropriate selection of materials for engineering components to ensure their safety and performance - P", "KB - A knowledge base for engineering", "PA - Problem analysis", "I - Investigation", "D - Design", "C - Communication skills", "P - Professionalism", "Course Introduction and Atomic Bonding (Ch.1-2)", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as preparation of lab reports (technical communication).", "Library for research-based assignments"]}, {"course_id": 6, "course_code": "ME 123", "course_name": "ME123 - Electrical Engineering for Mechanical Engineers (0.50)", "term_name": "1B Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Electrical Engineering for Mechanical Engineers Winter 2025", "11:30AM - 12:20PM RCH 103", "08:30AM - 09:20AM", "First Year Engineering Tutor:", "Navdeep Dhaliwal Monday 4:00PM - 5:00PM E7-3414 navdeep.dhaliwal@uwaterloo.ca", "Oleksii Zamozhskyi Tuesday 4:30PM - 5:30PM E2 - 1782 ozamozhs@uwaterloo.ca", "Alireza Chalik Friday 4:30PM - 5:30PM E2 - 1782 achalik@uwaterloo.ca", "Definitions of electric and magnetic fields.", "Introduction to circuit theory (direct current) DC circuits, amplifiers, operational amplifiers, single- and three-phase (alternating current) AC circuits.", "Introduction to basic electronic devices.", "Identify the linear circuit elements in a network and learn to identify how these circuit elements are connected - series and parallel connections", "Analyze any linear circuit and calculate the current, voltage, power and energy in that circuit.", "State Ohms law, Kirchhoff current law and Kirchhoff voltage law calculate the current through and voltage at the nodes by applying these laws.", "Apply voltage divider to find voltage across the linear circuit element and apply current divider to find current through the circuit element.", "Apply network theorems to simplify and analyze DC circuits.", "Analyze and design operational amplifier circuits for algebraic equations.", "Predict and analyze transient behavior of first and second order circuits.", "Analyses of sinusoidal steady state using phasors to solve AC circuits with R, L and C components", "Analyze power consumption of AC circuits", "2 Resistive Circuits", "4 DC Circuit Analysis", "5 Network Theorems", "6 Dependent Sources - Transistors", "7 Operational Amplifiers", "9 Electromagnetism and Inductance", "11 Steady State AC Circuits", "While a cell phone can be used, a device with a larger screen will give you a better experience.", "The only exception to this rule is under extenuating circumstances, accommodations and submission of VIF (in case of illness).", "The only exception to this rule is under extenuating circumstances, accommodations and submission of VIF (in case of illness).", "You will be informed in advanced if the lab is cancelled for a particular week.", "No extensions are allowed in submission of labs except under extenuating circumstances, accommodations and in case of approval of Verification of Illness.", "If you miss a deadline for health reasons, a Verification of Illness form should be submitted to the First Year Engineering Office.", "Exams", "**", "***Any guidelines UW releases on verification and declaration of illness for the term, will supersede the instructions given here***", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as analyzing and designing circuits.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 7, "course_code": "ME 201", "course_name": "ME201 - Advanced Calculus (0.50)", "term_name": "2A Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 09:50AM E5 3101", "08:30AM - 09:50AM E5 3101", "Prof. John Wen (Mechanical & Mechatronics Engineering)", "Office hour: Tuesday 3:00pm-4:00pm; available for in-person in Dr. Wen’s office and remote zoom meetings (please send email to Dr. Wen to make appointment)", "A continuation of first-year calculus, focusing on calculus of scalar and vector functions of several variables.", "Both classical calculus techniques and the computer implementation of numerical methods are discussed.", "Applications include geometrical problems, error estimation, maxima and minima, least squares curve fits.", "Multiple integration in standard coordinate systems, Jacobians.", "The objective of this course is to motivate and facilitate students’ understanding in advanced calculus and its applications in the engineering field.", "A) Vectors and Three Dimensional Analytic Geometry", "B) Differential Calculus of Multivariable Functions", "C) Multiple Integrals", "D) Vector Calculus", "The textbook may be ordered @"]}, {"course_id": 8, "course_code": "ME 202", "course_name": "ME202 - Statistics for Engineers (0.50)", "term_name": "2A Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Statistics for Engineers Winter 2025", "10:00AM - 11:20AM E5 3101", "Xamy Lopez Cortes - xlopezcortes@uwaterloo.ca", "Yixing Zhao - y679zhou@uwaterloo.ca", "Frequency distributions; measures of central tendency; standard deviation and other measures of dispersion.", "Techniques of sampling and statistical estimation.", "The t-test and chi-squared test.", "Curve fitting by least squares.", "Correlation and regression.", "Define a probability model and determine probabilities of events using counting techniques", "Define and use probability mass functions / probability density functions and cumulative distribution functions to determine probabilities of events", "Calculate and interpret means and variances, particularly for the named distributions", "Use numerical and graphical summaries of a data set to estimate parameters and to characterize the distribution of the data", "Interpret the parameters in the named distributions", "Use a pivotal quantity to construct a confidence interval for a parameter in some specific cases, and interpret the confidence interval.", "Interpret p-values and describe the connection with confidence intervals", "Define the properties of the Normal and t-distributions.", "Define a Gaussian response model including simple linear regression; determine point and interval estimates and conduct tests of hypotheses for the parameters in a Gaussian model.", "Perform post-fit analysis of the simple linear regression model using analysis of variance and residual plots", "Calculate and interpret the simple coefficient of determination (r-squared value)", "I will post them on LEARN.", "Probability and Statistics for Engineers and Scientists, 4th edition An e-text is available for this edition.", "This learning consists mostly of making sure you understand the concepts and steps that were introduced and used in class to solve examples and then solving problems from the text on your own.", "If you have a question regarding the marking of an assessment, you should first check the posted solutions on the LEARN website.", "This should be released in mid to late February.", "Intellectual property includes items such as:", "These materials are made available for the personal use of students registered in the Winter 2025 offering of ME 202.", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 9, "course_code": "ME 219", "course_name": "ME219 - Mechanics of Deformable Solids 1 (0.50)", "term_name": "2A Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Mechanics of Deformable Solids 1 Winter 2025", "10:30AM - 11:20AM E5 3101", "10:30AM - 12:20PM E5 3101", "Email: john.montesano@uwaterloo.ca", "Concept of equilibrium, force analysis of structures and structural components, equilibrium of deformable bodies, stress and strain concepts, stress-strain relationships, stress analysis of prismatic members in axial, shearing, torsional and flexural deformations, shear force and bending moment diagrams.", "Identify, classify, and solve statically indeterminate problems for uniaxial and torsion loading cases (2)", "A knowledge base for engineering", "Equilibrium at a Point", "Shear and Bending Moment Diagrams for Beams Chapter 7: 7.2-7.3", "Legible and organized tests and exams", "Success in ME219 is directly proportional to class attendance and self-study of practice problems", "In-class announcements and LEARN announcements are the official methods of communication.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 10, "course_code": "ME 230", "course_name": "ME230 - Control of Properties of Materials (0.50)", "term_name": "2A Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["01:30PM - 04:20PM E3 2119", "01:30PM - 04:20PM E3 2119", "01:30PM - 04:20PM E3 2119", "Explain the relationship between heat-treatment and the resulting mechanical properties of common structural metals", "Recommend suitable thermal/mechanical treatments to achieve a set of desired mechanical properties for a given metals with access the handbook data", "Evaluate engineering designs for potential environmental degradation and recommend suitable mitigation methods", "Perform a material selection process given a design, the requirements, and the constraints", "Corrosion and Durability in Design, Briefly (Askeland – Sections 23-6, 23-9, plus other notes)", "Materials Selection in Mechanical Design (Ashby, Ch. 5 and Ch.6)", "*Basic Thermodynamics, Concept of Free Energy, Enthalpy, Entropy", "*Some of these topics may be interwoven with each other to keep with the flow of the topics", "Materials Selection in Mechanical Design (4th Edition).", "Engineering Materials 1 - An Introduction to Properties, Applications, and Design (4th Edition).", "Engineering Materials 2 - An Introduction to Microstructures and Processing (4th Edition).", "Everything that may merit discussion will be posted on Piazza, most notably this includes solution to take-home practice problems.", "Initial Plans and Milestone:January 30th,2025 @ 11:59 pm", "Please note that most web pages are not refereed and, therefore, are not normally considered to be reliable sources of information for engineering purposes.", "----------------", "2* - Heat Treatment of Non-Ferrous Alloys - Week of February 3rd", "These includes the lab.", "----", "----", "In this email you should detail where you perceive a grading error exist, and provide reasons why you believe it was graded in error.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as communicating your understanding and scientific findings in written and verbal form.", "Library for research-based assignments"]}, {"course_id": 11, "course_code": "ME 269", "course_name": "ME269 - Electromechanical Devices and Power Processing (0.50)", "term_name": "2A Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electromechanical Devices and Power Processing Winter 2025", "08:30AM - 09:20AM", "11:30AM - 12:20PM E5 3101", "Basharat Mehmood", "Basic electromagnetic theory.", "Introduction to typical speed and torque control techniques of machines using power electronic based devices.", "E5 - 3101", "E5 - 3101", "E5 - 3101", "Fitzgerald & Kingsley's Electric Machinery, 7th Edition (optional)"]}, {"course_id": 12, "course_code": "ME 203", "course_name": "ME203 - Ordinary Differential Equations (0.50)", "term_name": "2B Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Ordinary Differential Equations Fall 2024", "First and higher order differential equations.", "Linear equations with constant and variable coefficients.", "Systems of linear equations.", "Applications involving simple dynamical systems and principles of mass, momentum and heat conservation will emphasize the role of ordinary differential equations in understanding the behaviour of physical systems.", "Introduction to the Laplace transform method for solving ordinary differential equations.", "Specifically, we define what ordinary differential equations are and how they relate to the physical problems encountered in simplified engineering systems.", "Techniques for solving first and higher order differential equations, linear equations with constant and variable coefficients, and non-linear equations are introduced.", "Applications involving simple dynamical systems and principles of mass, momentum, and heat conservation will emphasize the role of ordinary differential equations in understanding the behaviour of physical systems.", "Classify a differential equation with respect to order and form", "Understand what it means for a function to be a solution to a ODE/IVP", "Use appropriate analytical method(s) to find a solution to different types of ODE problem", "Select appropriate analytical method(s) to solve ODEs", "Formulate simplified models which represent the behaviour of simplified engineering systems", "Find solutions to said simplified models and provide a meaningful interpretation of found solution", "a) Classify a differential equation with respect to order and form", "b) Understand what it means for a function to be a solution to a ODE/IVP", "2. Find explicit solutions to specific classes", "a) Be able to find explicit solutions for particular first or second order ODES and systems of first order equations using a range of approaches which includes the Laplace transform", "b) Determine the correct solution technique to solve a problem", "3. Effectively apply the concepts of differential equations in the analysis of simplified engineering systems", "a) Formulate simplified models which represent the behaviour of simplified engineering systems", "b) Find solutions to said simplified models and provide a meaningful interpretation of found solution", "Linear Independence (Wronskian, Variation of Parameters, & Reduction of Order) ~ 5 Lectures", "Cauchy-Euler & Variable Coefficient ODEs ~ 2 Lectures", "Systems of 1st order ODEs ~ 4 Lectures", "Giordano and Weir:  Differential Equations: A Modelling Approach, Addison-Wesley", "You will be permitted calculators and a single sided (US letter page - 8.5 by 11 inches) cheat sheet where you can write anything you want except worked examples.", "Solutions to these problem sets will be available on LEARN the following Monday.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 13, "course_code": "ME 212", "course_name": "ME212 - Dynamics (0.50)", "term_name": "2B Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Dynamics Fall 2024", "Email: ehsan.toyserkani@uwaterloo.ca", "Email: ali.zardoshtian@uwaterloo.ca                                   Email: f2liravi@uwaterloo.ca", "An introduction to the kinematics of particle and rigid body motion.", "Work-energy methods and Euler's equations.", "The ultimate goal of this course is to promote students’ abilities to develop a complete characterization of moving 2D/planar mechanical systems in terms of main dynamical parameters (i.e., position, velocity, acceleration, force and momentum).", "A.1 Recognize the differences of kinematics/kinetics of particles and rigid bodies", "A.2 Understand the concepts of moment of point", "A.3 Understand the concepts of moment of inertia", "A.4 Select appropriate modeling approaches for particle and rigid body systems", "B. To apply principles of 2-D kinematics and planer kinetics engineering to a variety of “real-world” systems", "B.1 Select appropriate coordinates for given moving 2D mechanical systems", "B.4 Distinguish conservative and non-conservative work and energy", "C. To differentiate types of motion and customize solving methodologies accordingly", "C.1 Differentiate dependent and relative motion", "C.2 Recognize continuous and erratic motion", "D. To identify appropriate solving methodologies based on their advantages and disadvantages", "D.2 Understand “Energy Principle”, “Work Principle” and “Conservation of Momentum” and apply them to moving bodies", "*Dynamic vs. Static", "*History", "*Applications,", "*Particles vs. Rigid body approaches", "Kinematics of Particles", "*Coordinates", "*Types of motion", "-Continuous vs. Erratic", "Kinetics of Particles", "*Equation of Motion for different Coordinates", "-n-t", "*FBD", "*Friction", "*Elastic Spring", "*Space Mechanics", "*Work and Energy", "*Principle of Work", "*Principle of Energy", "*Impulse and Momentum", "*Angular Momentum", "B.2", "B.4", "B.4", "B", "*Type of Motion", "- Translational", "*Inertia and non-inertia coordinates", "B", "Kinetics of Rigid Body", "*Equations of motion for planar kinetics", "*Principles of Work and Energy", "*Conservation of Momentum", "Each student will act as a solver as well as a marker during this practice.", "55% Final Exam: This exam will assess your ability in kinematics and kinetics of rigid bodies.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 14, "course_code": "ME 220", "course_name": "ME220 - Mechanics of Deformable Solids 2 (0.50)", "term_name": "2B Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Mechanics of Deformable Solids 2 Fall 2024", "Email: john.montesano@uwaterloo.ca", "A general treatment of the behaviour of structural components from the study of stress and strain in solids.", "ME220 builds upon the concepts and methods developed in the course prerequisite, ME 219.", "After the completion of Ch.7, you will have a complete set of equations to calculate:", "Here, you will be introduced to multi-axially loaded structural members which may be simultaneously subjected to P, T, M and V.  For a given loading scenario, we will individually calculate the normal and shear stress components at a given point within a sectional plane and superimpose these to establish the combined stress-state at that point.", "Finally, we will cover the fundamental aspects of Buckling of Columns (Ch. 13) as well as Energy Methods (Ch. 14), which are alternative methods of finding the deflections of structural members and mechanical elements.", "Where we are in terms of Solid Mechanics and Design", "ME 219 – Mechanics of Deformable Solids I", "ME 212 - Dynamics", "ME 220 – Mechanics of Deformable Solids II", "ME 321 – Kinematics and Dynamics of Machines", "ME 526 – Fatigue and Fracture Analysis", "ME 559 – Finite Element Methods", "Legible and organized tests and exams.", "In-class announcements, LEARN announcements, and Email are the official methods of communication.", "Understand the concept of combined stress states in structural members and stress/strain transformations for stress analysis problems (1)", "Identify and solve problems involving combined stress states in various structures (2)", "Identify, classify, and solve statically determinate/indeterminate problems involving deflection of beams and shafts (2)", "Ch. 12 – Deflection of Beams and Shafts 12.1-12.3, 12.6-12.7", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills related to mechanics of deformable solids, including solving problem sets and completing a design project.", "Library for research-based assignments"]}, {"course_id": 15, "course_code": "ME 250", "course_name": "ME250 - Thermodynamics 1 (0.50)", "term_name": "2B Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "https://learn.uwaterloo.ca/d2l/home/1049828", "Control-mass and control-volume energy analysis.", "identify thermodynamic processes in engineering problems (1d)", "perform thermodynamic analysis on simple thermodynamic systems (2b)", "formulate the correct models and analyze thermodynamic systems.", "“1d Demonstrate understanding of specialized engineering knowledge.”", "In-person: lectures on MWF 1:30 - 2:20 pm in E5-3101, tutorials on Tuesdays 3:30 - 4:20 pm in E5-3101", "Your own class-notes: Important references for problem solving and the exam preparation", "The recordings of the classes will be shared in MS Teams and might be used in future offerings of the course or similar courses.", "Completion of these homework is aimed to facilitate students’ development of an in-depth understandings of the course materials.", "a crib sheet (letter-sized paper, two sides total, prepare your own sheet)", "non-programmable calculator, and", "Under unexpected circumstances, a make-up written exam or oral exam will be given to whom miss an exam.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as analysis of thermodynamic system.", "Library for research-based assignments"]}, {"course_id": 16, "course_code": "ME 262", "course_name": "ME262 - Introduction to Microprocessors and Digital Logic (0.50)", "term_name": "2B Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "02:30PM - 03:20PM", "Number systems, logic gates, Boolean algebra.", "Karnaugh maps and combinational logic design.", "Sequential logic and state machines.", "Microcomputer structure and operation, I/O and interfacing.", "A calendar change to make the updates official is currently being processed:", "Number systems, logic gates, Boolean algebra.", "Karnaugh maps and combinational logic design.", "Sequential logic and state machines.", "Microcontroller I/O and interfacing.", "Use logic gates and common circuit blocks to build and analyze combinational logic circuits", "Explain different number systems and convert between bases, in particular decimal and binary and decimal and hexadecimal, which are commonly used in digital systems", "Manipulate and simplify circuits using Boolean algebra and Karnaugh maps", "Build control circuits using relays and basic electronic components", "Implement digital logic using industry grade tools such as Programmable Logic Controllers (PLC) and system simulations", "Develop and use state machines to implement and analyze sequential circuits", "9/4", "Introduction, Basic gates", "9/9", "Boolean algebra", "9/16", "Karnaugh maps, Number systems", "9/30", "Encoders and decoders, midterm review", "10/28", "Sequential logic", "Sensors and sensor technology", "Microcontrollers", "While a cell phone can be used, a device with a larger screen will give you a better experience.", "Exercises are not handed in; however, completion of these problems will allow you to regularly test and reinforce your comprehension of the concepts and analysis techniques presented throughout the term.", "In the case of an emergency, you must contact the instructor as soon as possible after the emergency has been dealt with.", "Can I reuse material from previous lab submissions?", "No, you must start with a blank page and redo the labs as though you are completing them for the first time.", "Exams", "The weight of the examination will not be changed", "**", "Notice of Recording", "In case of shutdown of in-person activities, the following arrangements will take place:", "Discussions and questions", "This course includes the independent development and practice of specific skills, such as using digital logic to solve problems and PLC implementations.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 17, "course_code": "ME 303", "course_name": "ME303 - Advanced Engineering Mathematics (0.50)", "term_name": "3A Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Advanced Engineering Mathematics Winter 2025", "08:30AM - 09:50AM E7 3343", "08:30AM - 09:50AM E7 3343", "A continuation of ME201 and ME203 in which both classical calculus techniques and the computer implementation of numerical methods are discussed.", "Boundary and initial conditions.", "Numerical methods for ordinary and partial differential equations.", "Applications will emphasize the role of ordinary and partial differential equations in understanding the behaviour of physical systems.", "View requirements for ME 303", "Identify and classify differential equations", "Associate differential equations to physical problems", "Select the correct solution strategy for the classes of differential equations", "Implement numerical methods to solve problems in standard programming languages", "Quantify the error and uncertainty associated with the numerical solution method", "Chapter 1 - Ordinary Differential Equations  (ODEs)", "Chapter 2 - Numerical Methods", "Chapter 3 - Numerical Solution to ODEs", "Chapter 6 - Analytical Solution of PDEs"]}, {"course_id": 18, "course_code": "ME 321", "course_name": "ME321 - Dynamics of Machines and Mechanical Vibrations (0.50)", "term_name": "3A Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Dynamics of Machines and Mechanical Vibrations Winter 2025", "10:00AM - 11:20AM E7 3343", "E5 3102", "I highly encourage the students to meet with Farid first for their questions.", "Principles of the geometry of motion, uniform and non-uniform motion, linkage, and analysis of mechanisms.", "Consideration of the static and dynamic forces in machines.", "We will study single-degree-of-freedom systems, multiple-degree-of-freedom (lumped mass) systems, and modal analysis for vibration problems in the first part of the course.", "The first part of the course heavily depends on your previous courses in Dynamics, Differential Equations and Linear Algebra.", "You are expected to know/learn MATLAB and Linear Algebra very well.", "This course is very mathematical, but we also discuss some real-life examples of dynamic systems.", "Concepts of degrees of freedom and inversion mechanisms will be discussed.", "Finally, different kinds of gears and the fundamental law of toothed gearing will be discussed.", "Identify different types of mechanisms and their degrees of freedom", "Develop Equations of Motion for linkage mechanisms", "Quantify kinematics and kinetics parameters such as position, velocity, acceleration, force, and momentum for the points in linkage mechanisms", "Identify the geometry of different types of gears", "Formulate the eigenvalue problems and obtain solutions for eigenvalues and eigenvectors for the coupled 2-degree-of-freedom mechanisms", "Obtain solutions to the Ordinary Differential Equations subject to Initial Conditions (I.C.) and harmonic force excitations", "Understand and analyze the concepts of stability in a vibrating system", "Chapters 1.1, 1.2", "Introduction to Vibrations", "Free Response of a Single Degree of Freedom System (SDOF)", "Chapters 1.2 Natural Frequency and Oscillation Period", "Chapters 1.3 Viscous Damping", "- Stability", "Chapters 2.1, 2.2 Forced Response of a SDOF (Harmonic Excitation) Frequency Response Function (FRF)", "Chapters 2.1 Beat Phenomenon", "Chapters 4.1 Vibrations Equations of Motion for Multiple Degree of Freedom Systems (MDOF), 2-DOF", "Chapters 4.1 Modeshapes and Natural Frequencies of MDOF", "Chapters 4.2", "Introduction to Matrix Theory", "Stability of MDOF Systems", "- Singularity and Rigid Body Mode", "-", "Orthogonality of EigenVectors", "Examples", "Makeup lecture #2 at 8:30-9:20 AM in E7 3343", "Chapters 4.3", "Modal Analysis of MDOF", "Decoupled Coordinate Systems", "Chapters 4.5 Viscous Damping in MDOF", "Chapters 4.5, 4.6", "- Frequency Response Functions for MDOF", "- Frequency Response Functions for MDOF", "Makeup lecture #3 at 9:30-10:20 AM in E7 3343", "Introduction to Machines and Mechanisms", "Chapters 1.6", "Introduction to Machines and Mechanisms (Cont’d.)", "Inversion", "Chapters 1.7.1 Grashof condition", "Chapters 4.1, 4.2", "Analytical Kinematic Analysis of Planar Mechanisms", "Chapters 4.3", "Analytical Kinematic Analysis of Mechanisms (Cont’d.)", "One-loop mechanisms", "Chapters 9.1, 9.2, 9.3", "Analytical Kinetic Analysis of Mechanisms", "Chapters 9.1, 9.2, 9.3", "Analytical Kinetic Analysis of Mechanisms (Cont’d.)", "Chapters 5.1, 5.2", "Chapters 5.3, 5.4", "January 17th: Makeup lecture #1 at 9:30-10:20 AM to be held in E7 3343", "February 7th: Makeup lecture #2 at 8:30-9:20 AM to be held in E5 3343", "March 7th: Makeup lecture #3 at 9:30-10:20 AM to be held in E5 3343", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 19, "course_code": "ME 340", "course_name": "ME340 - Manufacturing Processes (0.50)", "term_name": "3A Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 11:20AM E7 3343", "01:30PM - 04:20PM E3 2119", "ME 340 101", "10:30AM - 11:20AM E7 3343", "Email: myavuz@uwaterloo.ca"]}, {"course_id": 20, "course_code": "ME 351", "course_name": "ME351 - Fluid Mechanics 1 (0.50)", "term_name": "3A Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Fluid Mechanics 1 Winter 2025", "11:30AM -", "12:20PM E7 3343", "11:30AM -", "12:20PM E7 3343", "11:30AM -", "12:20PM E7 3343", "Questions of a personal nature", "Your instructor checks email and the Discussion topics* frequently and will make every effort to reply to your questions within 24 hours, Monday to Friday.", "Physical properties of fluids and fundamental concepts in fluid mechanics.", "Conservation laws for mass, momentum and energy.", "It covers basic definitions and static fluids and then develops an analytical approach to analyze fluids in motion using the conservation equations.", "Practical applications are evaluated using the conservation equations and correlations where appropriate.", "Flow over external objects is examined and conservation equations and correlations are used to analyze these flows.", "Understand and classify fluid flow regimes and discuss flow phenomena using appropriate vocabulary", "Understand static fluids and manometry and determine forces in typical applications", "Develop the Reynolds Transport Theorem and apply with vector relations to conservation laws", "Apply the Continuity, Momentum and Energy equations to control volumes and systems", "Determine system behavior for an incompressible fluid system (pipes or ducts)", "Measure flow parameters and analyze experimental data", "Describe important dimensionless groups and utilize them appropriately", "Describe external flow and the associated dimensionless groups and determine forces in typical applications", "1 Introduction Definitions 1", "3   Hydrostatic Forces", "4 Control Volume Analysis Reynolds Transport Thm (RTT) 3", "Conservation Equations Continuity 3", "5 Conservation Equations Linear Momentum 3", "6 Conservation Equations Bernoulli equation 3", "9 Conservation Equations Energy equation 3", "10 Viscous Flow in Ducts Reynolds Number 6", "Dimensionless Groups", "Modelling & Prototypes", "There are many similar introductory fluid mechanics texts available and in the library and they are a good source of extra problem examples.", "Some examples: Fundamentals of Fluid Mechanics, Munson et al; Mechanics of Fluids, Potter and Wiggert", "The laboratory will be completed in a small group (3-4 students) and involves the collection and analysis of data related to fluid mechanics measurement.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 21, "course_code": "ME 354", "course_name": "ME354 - Thermodynamics 2 (0.50)", "term_name": "3A Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 09:50AM E7 3343", "08:30AM - 09:50AM E7 3343", "11:30AM -", "12:20PM E7 3343", "Real fluids, evaluation of state functions of real fluids.", "The course will include study of key applications of engineering thermodynamics, including converting heat to work, transfer of thermal energy from lower to higher temperature, processes involving simple chemical reactions, and air-conditioning processes (psychrometrics).", "The analysis techniques to be studied might be applied in addressing the following questions: How might the performance of a device/system/process be improved?", "What are the limits on the energy efficiency of a device/system/process?", "Which components of a system offer the greatest potential for improvement?", "Students should have some knowledge of basic concepts in energy and entropy analysis, and evaluation of thermodynamic property changes (of simple substances) due to a process.", "Apply basic energy and entropy analysis to thermodynamic processes.", "3. Perform basic thermodynamic calculations for processes involving non-reacting gas mixtures.", "Perform basic thermodynamic calculations for processes involving simple chemical reactions.", "7. Integrate basic environmental impact considerations into thermodynamic process analyses.", "Criteria for accreditation include expectations that graduating students will be generally capable of demonstrating certain attributes.", "Indicator", "Knowledge Base (1b) Demonstrate understanding of concepts in natural science.", "D", "(1c) Demonstrate understanding of engineering fundamentals.", "D", "(1d) Demonstrate understanding of specialized engineering knowledge.", "D", "D", "D", "D", "Impact of Engineering (9b) Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "D", "Fundamentals of Thermodynamic Analysis", "Review & enhancement of selected material, including: thermodynamics systems and processes; balances; properties; equations of state; entropy generation and irreversibility.", "Simple vapor compression refrigerant cycle and components.", "Choice of evaporating & condensing temperatures.", "Aspects of Exergy Analysis", "Definitions of exergy and exergy destruction.", "Exergy as a property of a simple compressible substance.", "Exergy transfers and exergy balances.", "2.5", "Power Generation Cycles", "Psychrometric Analysis", "Psychrometric analysis of simple air-conditioning processes.", "Chemical Reactions and Equilibrium", "Energy balances.", "Equilibrium composition for a reacting mixture.", "Each student must bring a clean copy (printed by UW Courseware) to the midterm and final exam.", "Scheme A", "Please consider that the personal traits and habits that you develop during your education are carried forward into your career.", "Those who find ways to justify “taking short-cuts” as they pursue their education may be unintentionally training themselves do the same in their careers.", "Unfortunately, engineers who have “taken short-cuts” have been responsible for many disasters and failures."]}, {"course_id": 22, "course_code": "ME 322", "course_name": "ME322 - Mechanical Design 1 (0.50)", "term_name": "3B Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["j2maglia@uwaterloo.ca", "Email: m42joshi@uwaterloo.ca", "Email: advaithnarayanan@uwaterloo.ca", "Prerequisites: ME321 (Dynamics of Machines and Mechanical Vibrations) and ME220 (Mechanics of Deformable Solids 2); Must be at least level 3B enrolled in H-Mechanical Engineering", "Identify loading conditions and solve for resultant stresses and strains in machine elements.", "Estimate the safe operating limits and service life of components that experience repeating (fluctuating) loads using the concepts of stress- and strain-based fatigue life.", "Analyze and design machine elements for power transmission (e.g., shafts).", "Identify the potential sources of failure for a load bearing component and revise the design based on considerations for static and/or fatigue-based failure.", "Communicate (graphically and in written form) the most important details on the methods used, observed results and key conclusions in a brief technical report.", "Failure under static loading: Ductile versus", "Failure under static loading: Failure criterion selection, Essential design equations", "Design of shafts: Shaft layout and materials, Stress and stress concentrations, Deflection considerations, Miscellaneous components", "2/17/2025", "Fasteners: Thread standards and definitions, Power screws, Fastener strength and tension joints", "Fasteners: Bolt torque and tension, Pre-load effects, Fatigue of tension joints, Bolts and rivets under shear", "Mechanical springs: Stresses in helical springs, Curvature effects, Material selection, Design for static and fatigue (repeated) loading", "No classes", "Major topics will include failure criterion and analyses, machine element failure under static loading, multidimensional fatigue analysis and design of power transmission elements (e.g., shafts).", "The most important methodology, results and conclusions necessary to understanding and replicate the work will be provided in a formatted technical report (template will be available on D2L)."]}, {"course_id": 23, "course_code": "ME 353", "course_name": "ME353 - Heat Transfer 1 (0.50)", "term_name": "3B Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Both Avery and Ornel are in E3 2133.", "Introduction to heat transfer mechanisms.", "The formulation and solution of steady and transient heat conduction.", "Interpret heat transfer problems using the First and Second Laws of Thermodynamics", "Conceptualize and solve industrially-relevant engineering problems involving heat transfer", "Provide examples of heat transfer in the natural world", "Determine heat transfer rates and temperature distributions within solids", "Calculate heat transfer rates for forced, natural, external, and internal convection scenarios", "1 Jan 6 (M) Introduction to heat transfer Modes of heat transfer 1.1-1.2", "Example engineering applications, natural world", "Relationship to thermodynamics 1.3", "Heat equation and boundary conditions 2.3-2.4", "2 Jan 13 (M) Conduction through a plane wall, cont’d Thermal circuits and composite walls 3.1.2, 3.1.3", "Radiation boundary condition (nonlinear)", "Example problem: human comfort", "Conduction through cylindrical and spherical walls 3.3", "Jan 15 (W) Volumetric heat generation Examples of volumetric energy generation 3.5", "Volumetric generation in a plane wall  3.5.1", "Derivation of governing equation 3.6.2", "Solution of differential equation 3.6.2", "Tip boundary conditions 3.6.2", "Example problem: heat transfer through a fin", "Exact solution for 2D rectangles 4.2", "Conduction shape factors 4.3", "Example problem: buried pipe", "Lumped capacitance 5.1", "Example problem: transient conduction", "Boundary conditions 5.7", "Semi-infinite solids in contact 5.7", "Example: Age of the Earth", "Velocity and thermal boundary layers, “wedge effect” 6.1", "Example problem: flow over a flat plate 7.3", "9 Mar 3 (M) Flow over cylinders and spheres Flow over a cylinder: b. l. development and separation 7.4", "Correlations for flow over a cylinder 7.4", "Flow over a sphere 7.5", "Example problem: Copper pin fin", "Entry region and fully-developed flow 8.1", "Dimensionless temperature profiles 8.2", "Entry length effects 8.4.2", "3.3", "Mar 12 (W) Natural convection: phenomenology Introduction to natural convection, boundary layers 9.1", "Origin of buoyancy 9.1", "Example problem: vertical cylinder", "Natural convection in enclosures 9.8", "13 Mar 24 (M) Thermal radiation: Introduction Introduction to thermal radiation 12.1", "Example problem: surface properties", "Reciprocity and summation 13.1", "Example: circular cylinder of black surfaces 13.2", "This course includes the independent development and practice of specific skills, such as technical communication via lab reports.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 24, "course_code": "ME 360", "course_name": "ME360 - Introduction to Control Systems (0.50)", "term_name": "3B Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Introduction to Control Systems Winter 2025", "08:30AM - 11:20AM E3 3164", "08:30AM - 11:20AM E3 3164", "08:30AM - 11:20AM E3 3164", "08:30AM - 11:20AM E3 3164", "Email: eugene.li@uwaterloo.ca", "Email: m23qureshi@uwaterloo.ca", "Email: hisham.khalil@uwaterloo.ca", "mahdi.rahmani@uwaterloo.ca", "Laws governing mechanical, electrical, fluid and thermal control components.", "Analysis of some engineering control systems using block diagram algebra, transient and steady-state operation.", "Brief treatment of linear flow graphs and bondgraphs.", "Be able to model linear and nonlinear dynamic systems using differential equations, Laplace Transforms, Laplace Transfer Functions, and block diagrams.", "Be able to determine the poles and zeros of a system and understand how the poles and zeros determine the behaviour of the system.", "Be able to design PID controllers based on the desired time response of a dynamic system.", "Be able to design PID controllers based on the desired frequency response of a dynamic system.", "Introduction; Modeling: Mechanical Systems", "Modeling: Nonlinear Modeling & Linearization, Electrical Systems", "Laplace Transfer Functions; Block Diagrams", "Block Diagrams; Time Response: Poles & Zeros, Transient Performance for First and Second Order Systems", "Time Response: Steady-State Error; PID Control", "Frequency Response; Bode Plots", "Lab 1 - System identification and P Control 10", "Lab 2 - PID Design 10", "Lab 3 - Design in frequency domain 5", "The labs are done in groups of four.", "Appropriate Referencing of Material", "Example:", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 25, "course_code": "ME 362", "course_name": "ME362 - Fluid Mechanics 2 (0.50)", "term_name": "3B Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Fluid Mechanics 2 Winter 2025", "Email: cdevaud@uwaterloo.ca", "Email: fhatiesm@uwaterloo.ca", "Email: jdchateauneuf@uwaterloo.ca", "All lectures will be recorded and made available on Learn, unless there is a technical issue preventing the recording.", "Basic equations of two-dimensional flow, potential flow, exact viscous solutions.", "Introduction to lubrication, boundary layers, turbulence, and compressible flow.", "The material in ME 362 is an extension of ME 351 – Fluids I covering topics in theoretical and applied fluid mechanics.", "Since we will not be able to allocate time to review all of these concepts during class time, please brush up on these topics as required.", "The first part of the course will focus on the theoretical side, and involves the derivation and solution of the coupled, nonlinear partial differential equations that govern multi-dimensional fluid motion.", "The second part includes applied topics such as compressible flow using approaches and tools similar to those presented in the Fluids 1 course.", "Classify fluid flows and select appropriate quantitative methods for evaluation.", "Develop quantitative models for common fluid flows in engineering applications.", "Solve practical fluids engineering problems by applying appropriate assumptions and fluid mechanics principles.", "Course chapters Relevant textbook sections", "Review and Introduction", "Classification of flows", "Forces in fluids", "Control volume analysis", "Dimensional analysis and similarity", "The differential equations of conservation", "Velocity field visualization", "The governing pdes of fluid flow", "Continuity equation", "Navier-Stokes equations", "1.11", "4.1", "4.2", "4.10", "4.10", "Conservation equations for inviscid flow", "Irrotational and potential flow and 2D potential flow equations", "Examples of common fundamental flows", "Method of images", "Example: Potential flow around a Rankine half-body", "4.9", "8.2 - 8.4", "8.6", "4.10", "Some definitions", "Boundary layer equations", "Blasius solution for a flat plate", "Momentum integral equation", "Turbulent boundary layer over a smooth plate", "7.1", "7.2", "7.1", "7.3", "7.4", "7.2", "7.4", "Introduction to compressible flow", "Steady, 1D, frictionless, adiabatic conservation equations", "Speed of sound and flow Mach number", "Velocity behaviour in nozzles and diffusers", "Stagnation properties", "Normal shock waves", "9.2", "9.4", "9.4", "9.4", "9.4", "9.4", "Ungraded homework:    Each week problems requiring in depth application of the course concepts will be assigned.", "Each group must submit a short and clear description of their project (one page maximum, including their selected sport, objectives and methodology) by email to Akira Tiesma (TA).", "The project report has a firm submission deadline.", "In order to perform well on examinations in this course, you must not only understand how to solve new problems in fluid mechanics, but also be comfortable with the basic concepts.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as engineering model development, data presentation, and technical report writing.", "Library for research-based assignments"]}, {"course_id": 26, "course_code": "ME 380", "course_name": "ME380 - Mechanical Engineering Design Workshop (0.50)", "term_name": "3B Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Mechanical Engineering Design Workshop Winter 2025", "The design project typically includes construction of a prototype, and part of the course grade may depend on the performance of the prototype in a competitive test.", "Identify and formulate a practical mechanical engineering problem", "Design a mechanical engineering system, product, or process", "Implement and verify a design solution", "Apply project management skills to develop and follow a project plan and budget", "Note that in the event a team member is assessed poorly by their peers in both evaluations (i.e., an extreme case), the instructor may deduct additional marks from the individual pending a one-on-one meeting with the individual.", "It is up to the group members to agree upon the structure and communicate to the instructional team that they will each be responsible for performing their designated roles and be accountable for their actions.", "Design Logs and Weekly Meetings:", "Have mitigation strategies been identified?", "Design logs should be a concise summary over ~2-5 pages; use of descriptive bullet points, photos and figures is highly encouraged.", "Design logs will be evaluated based on project management and evidenced of design progress.", "The course grade component (15%) will be equally split over the three design logs; failed design logs will receive a grade of 0.", "Design logs must be submitted to Learn by the deadline (see Schedule).", "Each design portfolio must be signed by another group member as confirmation of the described contributions.", "The majority of the allocated course time in this design workshop course is to be used towards project design, testing and analysis as a team.", "All times listed are in EST", "Lecture 1: Course Introduction & Needs Analysis", "Specifications & Conceptual Design", "Design Proposal Presentation", "Design Proposal Presentation (15%)", "READING WEEK ** No Deliverables", "MIDTERM WEEK ** No Deliverables", "Friday Mar 7th 1:30-2:20pm", "Friday Mar 7th 2:30-4:30pm", "** No Deliverables", "Friday Mar 21st 2:30-4:30pm", "** No Deliverables", "Design Verification Presentation:", "Mar 28thth 8:30am-12:00pm", "Design Verification Presentation (25%)", "Friday April 4th 1:30-2:20pm", "Each team is required to design, build, test, and verify the performance of a powered mechanism to move multiple objects from a storage area onto a raised conveyor belt to deliver to a drop-off area.", "Move 2 objects (one from red, one from blue) from the storage area to the drop-off area of the corresponding colour", "Other objects can be used to demonstrate certain design objectives have been achieved", "Demonstrate how your design meets your selected Design Objectives and Engineering Specifications", "Energy must be supplied to the system using provided electrical power source(s) or a separate used console", "Pick-up and drop-off areas cannot be manipulated to assist with object pick-up or placement*", "Possible Design Objectives:", "Possible Design Objectives:", "Design for speed to move 2+ objects", "Design for accuracy/precision of object placement or storage in drop-off area", "Design for strength-weight ratio to lift and move heavier objects", "Design for efficiency to minimize the amount of energy or work required", "Design for range of motion to pick up objects from multiple storage areas", "Design for dexterity to place objects on the conveyor in different orientations", "Design for compliance to pick up difficult to grasp objects (beyond the baseline 3DBenchy)", "Design for smooth operation (e.g. minimize jerkiness)", "Design for adaptability to handle variable storage area conditions (e.g. mixed objects)", "Project Scope: The individual design criterion and demonstration methods for the selected design objective are intended to be open-ended and up to the team to propose to the “client” (instructor and TAs).", "In general, the overall structure of the project should follow:", "Identify the design need, define design requirements, and develop design specifications", "Generate and assess design concepts", "Embodiment and detailed design", "Verify that the design meets the requirements", "The kit contains several key components that were ordered in bulk for the course.", "Some of these components have been used in previous course offerings – make sure to test your components to verify they are working as required.", "Here is a list of the kit components and their cost:", "If you are not already enrolled please self-register into \"WATiMake Orientation & Training\" course.", "Items from these vendors can be purchased by submitting a purchase request to Paul Groh.", "Final budgeting details must be explained in the final report, with appropriate cost justification and supporting documentation, where applicable.", "Proper cost justification and supporting documentation, where applicable, will be necessary for these items.", "Costs for computers to operate the system do not need to be included.", "Arduino coding support:", "The Learn course “WATiMake Orientation and Training” contains a section called \"ARDUINO 101 – Beginner's Basics\" which can be accessed for support.", "Documentation and sample Arduino source code on servo motor control can be found on the course Learn site under “Project Resources – Servo Motor Control”.", "Design Logs 15%", "Design Proposal Presentation 15%", "Verification of Design Presentation 25%", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 27, "course_code": "MSE 261", "course_name": "MSE261 - Engineering Economics: Financial Management for Engineers (0.50)", "term_name": "3B Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Economics: Financial Management for Engineers Winter 2025", "10:30AM -", "12:20PM RCH 306", "S. Mortazavian Farsani", "10:30AM - 11:20AM RCH 306", "Depreciation models and asset replacement analysis.", "View requirements for MSE 261", "Engineers are often required by society to make responsible decisions on complex issues that have financial, economic, political and environmental elements.", "This course presents engineering economics as a key part of an engineer’s decision-making mandate.", "Engineering Economics focuses on basic principles and applications of economic decision-making between alternatives encountered in engineering systems projects.", "Apply basic financial calculations, useful in personal life and business [", "4. Recognize the impact of inflation and taxation in making engineering economics decisions [11b]", "Analyze the public centered projects by their costs and benefits (dis-benefits) to society and environment [9a, 9b, 11b]", "Understand and analyze the components of financial statements and use them in investment decisions and preparing business plans [1c, 11b]", "The course will be dynamic and hence, the weekly schedule provided in this document is tentative and subject to slight changes in order to adapt to the needs and conditions the class may face.", "Week of", "Introduction", "Cash Flow Analysis", "-", "Replacement Analysis", "Inflation", "Public Sector Decision Making", "Introduction to Project Management", "Engineering Economics: Financial Decision Making for Engineers (7th Edition).", "Engineering Economic Analysis (4th Canadian Edition).", "Quizzes are non-cumulative while midterm and final exams are cumulative in the sense that final exam covers whatever covered after the midterm content.", "In case of any technical issues uploading the files, please email the TAs right away.", "All assessments will be also submitted online in that case.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 28, "course_code": "GENE 403", "course_name": "GENE403 - Interdisciplinary Design Project 1 (0.50)", "term_name": "4A Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Email", "Tuesday 2:30pm-4pm & Thursday 10am-11am in MC 2037", "In the course they will formulate and communicate an interdisciplinary engineering problem or opportunity; develop a feasible design project proposal and plan; generate feasible solutions that address the formulated problem; evaluate alternatives and identify preferred solution; address safety, regulatory, sustainability and professional ethics requirements, as appropriate; effectively manage design project technical and non-technical risks using project management tools and techniques; deliver a report and/or a presentation that summarizes the work completed; work effectively as an interdisciplinary team member and/or team leader.", "View requirements for SCI 300", "On the heels of launching the Future Cities Institute, UW is offering a new special course: an interdisciplinary capstone course involving students and professors from multiple faculties working together to explore the complex challenges of Future Cities.", "In the first half of the course (Fall 2024), you will develop a deep understanding of the focal problem through months of thoughtful research, building the foundation for your project (e.g. problem definition, situation analysis, conducting a literature review, solutions identification and evaluation, and managing your team and your project and developing your communication skills).", "Where i-capstone differs is that you get to engage with other motivated learners from across faculties to leverage your unique perspectives, knowledge and skills, to contribute to solution-oriented projects that demonstrate mastery of problem-solving, critical thinking, and communication on a selected topic under the theme of Future Cities.", "Didactic vs Dialectic Instruction", "This is a solitary experience.", "Clearly define the interdisciplinary problem to be solved", "Identify multiple solutions that can address the focal problem", "Apply critical thinking, data collection and analysis skills to determine the optimal solution", "Understand a wide range of techniques, tools, skills, concepts, frameworks and professional practices from various disciplines", "Select and apply appropriate techniques, tools, skills, concepts, frameworks and professional practices for a particular project", "Introduction to i-Capstone", "Oct 9 Environmental Scan", "Mapping Actor and Leverage Points", "&", "Potential Solutions & Action Plan", "Divide & conquer often does not work well for capstone projects: the work needs to be integrated.", "Team friction/conflicts are a normal part of working life, and finding collaborative ways to resolve them is an important professional skill.", "The instructor can assist in helping the team find ways to move forwards together.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "Environmental Scan  Monday, October 21st", "You must specify the sections you want addressed and a rationale for why it deserves consideration, with specific reference to the rubric and assessment criteria.", "Only in exceptional cases will this penalty be waived!", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "This course includes the independent development and practice of specific skills, such as critical analysis and effective communication.", "Library for research-based assignments", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 29, "course_code": "ME 481", "course_name": "ME481 - Mechanical Engineering Design Project 1 (0.50)", "term_name": "4A Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Mechanical Engineering Design Project 1 Fall 2024", "11:30AM - 12:20PM MC 4045", "Role and responsibilities:", "Role and responsibilities:", "The first of two required courses for the mechanical engineering capstone design project.", "This course is intended to enable students to engage in in-depth engineering design and decision-making using engineering science while encouraging creativity and resourcefulness, and addressing the criteria listed in the faculty of engineering design rubrics.", "The goal is to develop a design proposal, consisting of the needs analysis, design specifications and project plan, followed by the initial and detailed design work.", "While research (i.e. discovery of new knowledge) is an important part of a design project methodology, research-only projects are not appropriate for this course sequence.", "Identify, represent and communicate a mechanical engineering problem or opportunity [", "Design a mechanical engineering system, product and/or process [", "Design review presentations   Monday – Friday, Nov. 25 – 29  TBA", "The following items should be kept in mind when you are choosing your project:", "A normal team size is 4 students; exceptions can be made by the course instructor given adequate justification.", "The topic is based in the field of mechanical engineering", "The problem is open-ended and has sufficient scope and complexity to provide a significant challenge", "The analysis required to complete the project makes use of mechanical engineering knowledge and skills", "Industry-based collaborative projects are welcome.", "Proposal – During the fourth week of the term each team will submit a written project proposal that includes the following information:", "Needs analysis, including requirements, constraints and/or criteria, captured in the form of a revision-controlled engineering design specification document.", "Requirements should be expressed as values wherever possible, with justification provided.", "Organization chart of team, including roles", "Work breakdown structure, including estimated number of hours for each task", "Project schedule, including key milestones", "Estimated project cost and expected sources of funding", "Identified risks and mitigation plans", "Change management implementation strategy and examples", "Evaluation of your design decisions based on the decision criteria presented in proposal", "Presentations must be kept within the time specified and should include information intended for a technical audience who is not familiar with the project.", "This grade will be based on the team charter, and a survey conducted at the end of the term to assess the contribution of each member to the team.", "Financial Support for Projects – The Mechanical and Mechatronics Department supports design projects to a maximum of $75 per student per term, or $150 per student for both ME481 and ME482 combined.", "Design review presentation 20", "A common grade for each of these elements will be awarded to all members of the team.", "The progress report meeting grade will be assessed for individual students based on preparation and participation in the meetings and demonstration of a complete, up-to-date engineering log book.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 30, "course_code": "MTE 481", "course_name": "MTE481 - Mechatronics Engineering Design Project (0.50)", "term_name": "4A Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Mechatronics Engineering Design Project Fall 2024", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Prof. Baris Fidan", "Office: E3-4119", "Email: fidan@uwaterloo.ca", "Prof. Andrew Morton", "Email: andrew.morton@uwaterloo.ca", "Email: jthistle@uwaterloo.ca", "This course is intended to reinforce the concepts learned in MTE380 and to extend the significant design experience obtained.", "Students work individually or in small groups applying the principles of engineering design and problem-solving to a design project of their own choosing.", "Identify an engineering problem and assess solution constraints and criteria", "Apply the design process to develop and build a solution", "Critique candidate solutions and evaluate them against constraints and criteria", "Apply knowledge and skills in mechanical design, electronics, computers and software", "Work in a team both as a leader and as a member", "Consider environment, society and economic concerns", "Consider safety in all design choices and proposed solutions.", "Document the design process in a systematic manner", "Communicate orally and in writing", "Educate themselves in order to reach a goal", "Sept 16 Choose a design problem:  identify a real-world need.", "Sept 23 Specify what it means to solve the problem, and formulate constraints that any solution must satisfy in order to meet the need appropriately.", "Describe your solution in terms of straightforwardly implementable elements.", "Design log (website) 10%"]}, {"course_id": 31, "course_code": "GENE 404", "course_name": "GENE404 - Interdisciplinary Design Project 2 (0.50)", "term_name": "4B Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Interdisciplinary Design Project 2 Winter 2025", "At the end of this course students will be able to re-formulate and re-communicate an engineering problem or opportunity (as appropriate); revise and communicate a feasible design project plan; revise solutions that address the formulated problem (as appropriate); implement and verify design solutions by analysis, test or prototype; communicate design solutions using accepted data formats, working documents and oral presentations; address safety, regulatory, sustainability and professional ethics requirements, as appropriate; effectively manage and communicate design project plans, technical and non-technical risks, using project management tools and techniques; work effectively as an interdisciplinary team member and/or team leader.", "View requirements for SCI 300", "On the heels of launching the Future Cities Institute, UW is offering a new special course: an interdisciplinary capstone course involving students and professors from multiple faculties working together to explore the complex challenges of Future Cities.", "In the first half of the course (Fall 2024), you will develop a deep understanding of the focal problem through months of thoughtful research, building the foundation for your project (e.g. problem definition, situation analysis, conducting a literature review, solutions identification and evaluation, and managing your team and your project and developing your communication skills).", "Where i-capstone differs is that you get to engage with other motivated learners from across faculties to leverage your unique perspectives, knowledge and skills, to contribute to solution-oriented projects that demonstrate mastery of problem-solving, critical thinking, and communication on a selected topic under the theme of Future Cities.", "Didactic vs Dialectic Instruction", "This is a solitary experience.", "Parts for Physical Prototypes", "Clearly define the interdisciplinary problem to be solved", "Identify multiple solutions that can address the focal problem", "Apply critical thinking, data collection and analysis skills to determine the optimal solution", "Understand a wide range of techniques, tools, skills, concepts, frameworks and professional practices from various disciplines", "Select and apply appropriate techniques, tools, skills, concepts, frameworks and professional practices for a particular project", "Available in the library No", "Divide & conquer often does not work well for capstone projects: the work needs to be integrated.", "Team friction/conflicts are a normal part of working life, and finding collaborative ways to resolve them is an important professional skill.", "-", "-", "Abstracts & team photo LEARN Feb 10", "3:30-7:30pm", "Final self & team member evaluation Peer Scholar via LEARN Apr 9", "End-of-Term Individual reflection & advice for younger cohorts PebblePad via LEARN Apr 9", "Disclaimer", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 32, "course_code": "ME 482", "course_name": "ME482 - Mechanical Engineering Design Project 2 (0.50)", "term_name": "4B Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Mechanical Engineering Design Project 2 Winter 2025", "11:30AM - 12:20PM DC 1351", "Chair all design reviews", "Calling for and conducting additional Design Project Reviews as appropriate", "Evaluating course deliverables, including attending design reviews", "A continuation of ME481.", "The final design of the major mechanical engineering project proposed in ME481 will be undertaken.", "This course, together with the required first course, should provide a culminating and significant design experience for students.", "create] solutions for complex, open-ended mechanical engineering problems, and to design [", "4]“3.4.4.4 The engineering curriculum must culminate in a significant design experience conducted under the professional responsibility of faculty licensed to practise engineering in Canada, preferably in the jurisdiction in which the institution is located.", "Identify, represent and communicate a mechanical engineering problem or opportunity", "Design a mechanical engineering system, product and/or process", "Implement, verify and refine a design", "Apply project management skills and techniques", "Work effectively as a member of a team", "DC-1351", "Design Project Presentation", "Team information for Symposium Brochure", "Safety information", "Specifics to follow", "Design Project Presentation; Peer Review", "Pre-Symposium Meeting DC-1351", "Design Project Presentation", "Capstone Awards Dinner & Presentation", "Monday March 24", "To be submitted as a survey", "Design Project Report  (DPR)", "Design Reviews:", "A very brief review of the project background and objectives", "A summary of the status of the project, including a presentation of key design and analysis work completed since the previous review", "A concise plan for work for the remainder of the course", "A current summary of project management data, with an emphasis on milestones and budget(s)", "In each case, students are encouraged to identify issues, make considered proposals as appropriate, and use this opportunity to seek advice from the review committee.", "Initial Design Review", "The IDR serves as a ‘kick-off’ meeting for the term.", "A sign-up sheet will be available.", "Mechanical Engineering Symposium", "Design Project Report", "Team number and students’ names", "Confidentiality provisions as appropriate", "A list of Appendices", "A concise summary of work completed in ME481, including a brief project justification and background, and project specifications.", "Be sure to only summarize the ME481 proposal and report and reference them.", "Make sure to include key figures in the main text, and more detailed information in the Appendix.", "Briefly summarize the options considered, design decisions made, and the engineering analyses completed to support these design decisions.", "Include design options considered and any detailed calculations in an Appendix.", "A summary of the final design, with key figures in the text.", "A summary of the design verification of engineering design specifications.", "Summary of design project management activities, including a brief discussion of what went well and what was not as useful, and a summary of the cash budget.", "Current revision of the engineering design specification", "Verification of design data", "Optional but desired: a team summary chart of “who a team member mentored” and “what mentoring they received” by other team members", "Other data as appropriate", "Design Project Management Data (as separate, stand-alone, configuration-controlled documents)", "Budget (separate in-kind and cash budgets, and compare with resources)", "Exhibits", "Deviations from this structure are allowed provided students can justify them.", "Figures and graphs must be clear and readable.", "Design Project Report 30", "Grades will be assigned for Design, Project Management, and Communication for all design deliverables: project reviews and the report.", "Evaluation Adjustments", "This could result in a significant decrease (in extreme cases no marks being awarded for relevant components of the course), or in a small increase in your course mark.", "Canadian Standards Association", "Formal CSA electrical inspections may not be possible.", "Reference guidelines will be available in Learn and the technical staff can also be consulted.", "Appropriate attention must be given to design for sustainability, impact of engineering to society and the environment, regardless of the design project, as with professional ethics considerations.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 33, "course_code": "MTE 482", "course_name": "MTE482 - Mechatronics Engineering Project (0.50)", "term_name": "4B Term", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["11:30AM - 12:20PM RCH 101", "11:30AM - 12:20PM RCH 101", "11:30AM - 12:20PM RCH 101", "11:30AM - 12:20PM RCH 101", "Office: E3-4119", "02:30PM - 05:20PM", "The students either individually or in small groups demonstrate the working prototypes; make a poster presentation for the design competition; and pitch their product on a website.", "View requirements for MTE 482", "Demonstrate mastery in:", "- The mechatronic design process", "- Working in a team both as team lead and a member", "- Verbal and written communication", "- Self-learning", "- Consideration of environment, society, and economic concerns", "- Safety", "Demonstration of your prototype 40%"]}, {"course_id": 34, "course_code": "PD 22", "course_name": "PD22 - Professionalism and Ethics in Engineering Practice (0.50)", "term_name": "Ethics List", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Professionalism and Ethics in Engineering Practice Winter 2025", "Email", "Email is checked frequently and you can expect a response to your questions by email within 24-48 hours, Monday to Friday.", "In the case of co-op specific situations, check your skills inventory in WaterlooWorks for the name of your CECA contact.", "This course provides a framework for understanding professionalism and ethics within society as reflected through practice in the field of professional engineering.", "Course topics on professionalism include the history of engineering and professions, the licensing of professional engineers and the certification of the practice of offering engineering services to the public, and the regulation of professional engineering in Ontario through Professional Engineers Ontario.", "articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "identify ethical and unethical behaviour in their professional environment by applying PEO's code of ethics (O. Reg. 941/72, 77).", "identify stakeholders and their interests in the context of ethical dilemmas.", "Unit 1: Introduction", "Unit 4: Ethics and Ethical theories", "Your extension request information", "What can Late Days not be used for?", "Users remain responsible for ensuring that their use of AI tools complies with copyright and intellectual property laws.", "Documenting and Citing GenAI content", "The Writing and Communication Centre has a great resource on Using ChatGPT and other Text-Generating Artificial Intelligence (GenAI) and how to be productive and ethical in your use of GenAI as well as cautions and risks to consider.", "Professionalism in Communication", "Would you present this to your supervisor post-graduation?"]}, {"course_id": 36, "course_code": "AE 572", "course_name": "AE572 - Building Energy Analysis (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Building Energy Analysis Fall 2024", "Introduction to whole-building energy analysis.", "Energy auditing, benchmarking, and simulation.", "Review of relevant concepts in heat transfer and thermodynamics, including introductory psychrometrics.", "Economic and environmental impacts of building energy use.", "The course is intended to help students develop knowledge and skills that will be useful in analyzing and diagnosing the energy use of buildings, with the general objectives of reducing environmental, economic, and social impacts of energy use.", "Topics will be presented from a multi-disciplinary perspective, as the design, construction, and operation & maintenance of buildings are all multi-disciplinary endeavors.", "Relevant concepts in thermodynamics and heat transfer will be reviewed.", "Selected building systems and components will be studied, including aspects of building envelope, lighting, and HVAC systems.", "Apply basic energy calculations to a variety of components and systems impacting building energy use.", "2. Apply simple analysis techniques in building energy auditing and simulation.", "Apply basic calculations to assess impacts of building energy use (e.g. economic cost, GHG emissions).", "Criteria for accreditation include expectations that graduating students will be generally capable of demonstrating certain attributes.", "Indicator", "Knowledge Base (1c) Demonstrate understanding of specialized engineering knowledge.", "D", "D", "D", "D", "D", "D", "D", "Impact of Engineering (9b) Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "D", "Introduction & Fundamentals", "Energy Analysis Fundamentals", "Energy Auditing, Benchmarking, & Re-tuning", "Simple Heating System: Design & Analysis", "Load Duration Curve", "2. Building Components & Systems", "Interior Lighting Systems", "Aspects of 1-D Heat Transfer", "Building Envelope", "Aspects of Simple HVAC Components & Systems", "3. Aspects of Building Energy Simulation", "Aspects of Whole-Building Energy Simulation", "Application of Simulation Results in Design", "Careful review of the course notes and completion of the practice problems should be viewed as key activities to help you develop understanding of the course material and prepare for tests/exams.", "Some projects may be completed in small groups.", "P1 Small Building Re-Tuning", "P2 Lighting System Analysis", "P3 Building Envelope Analysis", "P4 Whole-Building Energy Simulation", "eQUEST", "Please consider that the personal traits and habits that you develop during your education are carried forward into your career.", "Those who find ways to justify “taking short-cuts” as they pursue their education may be unintentionally training themselves do the same in their careers.", "Unfortunately, engineers who have “taken short-cuts” have been responsible for many disasters and failures."]}, {"course_id": 37, "course_code": "AE 573", "course_name": "AE573 - HVAC Systems, Equipment, and Energy Efficiency (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "HVAC Systems, Equipment, and Energy Efficiency Winter 2025", "Selected topics in HVAC systems design with focus on energy-efficiency and environmental-sustainability.", "Heating and cooling distribution using air-, water-, and refrigerant-based systems.", "Constant- and variable-flow systems.", "Heat- and energy-recovery systems.", "Vapour-compression refrigeration and heat-pump systems (including air- and geothermal-source heat pumps).", "Selected topics in HVAC systems design, with focus on energy-efficiency and environmental-sustainability: heating and cooling distribution using air-, water-, and refrigerant-based systems; constant- and variable-flow systems; heat- and energy-recovery systems; vapor-compression heat-pump systems, including air-and geothermal-source heat pumps.", "Course Overview: Achieving significant reductions in building energy consumption will be important in efforts to deal with the environmental and socioeconomic impacts of energy use.", "The energy used by heating, ventilating, and air-conditioning (HVAC) systems represents a large portion of the energy consumption of most commercial, institutional, and residential buildings.", "This course will introduce selected topics in HVAC systems design, with focus on energy-efficiency and environmental-sustainability: heating and cooling distribution using air-, water-, and refrigerant-based systems; constant- and variable-flow systems; heat- and energy-recovery systems; vapor-compression heat-pump systems, including air- and geothermal-source heat pumps.", "Recommended Preparation: It is strongly recommended that students have engaged in prior study of introductory concepts in thermodynamics, heat transfer, and fluid mechanics, including analysis of refrigeration cycles and basic psychrometrics.", "Students without this background are expected to undertake additional study to acquire sufficient competency in each topic.", "Perform simple thermodynamic calculations for selected HVAC components and systems.", "2. Explain operational characteristics of selected energy-saving strategies for HVAC systems.", "3. Assess the potential for selected energy-saving strategies to operate effectively for a variety of operating conditions and applications.", "Criteria for accreditation include expectations that graduating students will be generally capable of demonstrating certain attributes.", "Indicator", "Knowledge Base (1c) Demonstrate understanding of engineering fundamentals.", "D", "(1d) Demonstrate understanding of specialized engineering knowledge.", "D", "D", "D", "D", "D", "Impact of Engineering (9b) Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "D", "Section", "Introduction", "Review of selected fundamental concepts.", "Considerations for equipment selection.", "3. Variable-Flow Hydronic Systems", "Closed-loop hydronic systems.", "Constant- and variable-flow systems.", "4. Aspects of Ventilation Systems", "Air-to-air energy recovery systems.", "4. Aspects of Ventilation Systems (cont'd)", "System considerations with AAER equipment.", "Heat-Pump Systems and Equipment", "Simple and modified refrigerant cycles.", "Air- and water-source systems.", "Simultaneous heating/cooling systems.", "Useful References:  i) the ASHRAE Handbooks can be accessed through the university library via the Knovel database; ii) the CIBSE applications manual “AM17 Heat Pump Installations for Large Non-Domestic Buildings (2022)” (free pdf) is an excellent reference for many concepts covered by this course; iii) for a textbook covering general aspects of HVAC design & analysis, consider: “Heating and Cooling of Buildings: Principles and Practice of Energy Efficient Design (Third Edition)”, by T.A. Reddy et al.. CRC Press, 2016.", "Notice of Recording", "Please consider that the personal traits and habits that you develop during your education are carried forward into your career.", "Those who find ways to justify “taking short-cuts” as they pursue their education may be unintentionally training themselves do the same in their careers.", "Unfortunately, engineers who have “taken short-cuts” have been responsible for many disasters and failures."]}, {"course_id": 38, "course_code": "CIVE 460", "course_name": "CIVE460 - Engineering Biomechanics (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Biomechanics Winter 2025", "02:30PM - 05:20PM", "RCH 301", "Introduction to engineering technologies applicable to the field of biomechanics.", "Specific topics covered may include biological growth, form and function; biomaterials; kinematics and neurology of gait; biotribology; joint anatomy, function and repair; occupational biomechanics; trauma prevention.", "The course will provide a general overview of engineering biomechanics for civil, mechanical and biomedical engineering students.", "2. Conduct gait analysis and calculate forces applied at joints and foot reactions", "Introduction", "Evolution of Biomechanics", "Applications (medical and engineering)", "Musculoskeletal System", "Introduction,", "Anatomical positions & movements,", "System components,", "Gait Biomechanics", "Introduction;", "Muscles forces,", "Bone & Cartilage Biomechanics", "Introduction (highlights & progress),", "Bone mechanical properties & applications;", "Cartilage structure and mechanics", "Tendon & Ligament biomechanics", "Mechanical behaviour", "Biotribology & Joint Replacement", "Biotribology subfields,", "Cancer Biomechanics", "Introduction: cancer stages,", "Mechanical characteristics of cancer cells,", "Biomechanics and cancer treatment,", "Cardiovascular biomechanics, and", "Biomechanics in Radiotherapy", "“Orthopaedic Biomechanics: Mechanics and Design in Musculoskeletal Systems,” Pearson Prentice Hall.", "Biomechanics and motor control of human movement.", "Biomechanics and motor contAl-Mayah, A. (Ed.)"]}, {"course_id": 39, "course_code": "ME 423", "course_name": "ME423 - Mechanical Design 2 (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Mechanical Design 2 Fall 2024", "11:30AM - 12:20PM E5 3102", "09:30AM - 11:20AM E5 3102", "Role Full Name Email", "-", "Full Name In-Person Meeting Online Meeting", "Both online and in-person meetings will begin in the second week of the course.", "A continuation of the ME322 course in analysis and synthesis of machinery, including advanced analysis of machine elements such as clutches, brakes, couplings, journal bearings, and gears.", "Advanced machine design concepts such as reliability, optimization, and techniques for stimulating innovative design.", "Where we are in terms of Solid Mechanics:", "ME 219 - Mechanics of Deformable Solids I (Statics)", "ME 212 - Dynamics", "ME 220 - Mechanics of Deformable Solids II (Statics)", "ME 321 - Kinematics and Dynamics of Machines (Dynamics)", "ME 322 - Mechanical Design 1", "ME 526 - Fatigue and Fracture Analysis (optional)", "Design process, review, and consolidation of analysis techniques", "Design Project", "Load and Stress Analysis: Chapter 3", "Beam deflection: statically indeterminate problems: 4-10", "Failures in Static Loading: Chapter 5", "Distortion-Energy Theory for ductile materials: 5-5", "Endurance limits, design scale factors", "Design process, review, and consolidation of analysis techniques", "Project introduction and sign-up", "Identify, represent and communicate a mechanical engineering problem or opportunity", "Design a mechanical engineering system, product and/or process Implement, analyze, verify and refine a mechanical design", "Implement, analyze, verify and refine a mechanical design", "Apply project management skills and techniques", "Work effectively as a member of a team", "Communicate accurately and effectively in technical writing and engineering design calculations", "FRI", "Begin", "Study Day", "Study Day", "9th & 10th editions are admissible but 11th is the official course text in case of conflict.", "Design", "- Introduction to ME 423", "- Design Process", "- Reliability and Statistics", "- Dimensions and Tolerances (review)", "- Review of Stress Analysis", "- Project Introduction (week 2)", "- Introduction to gears", "Nomenclature", "Force analysis", "Strength Analysis", "- Strength analysis of gears", "Surface failure", "Bearings", "- Bearings", "Clutches and Brakes", "- Clutches and brakes", "The project reports may be subjected to scanning on software such as Ithenticate and Turnitin.", "Notice of Recording", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 40, "course_code": "ME 435", "course_name": "ME435 - Industrial Metallurgy (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 11:20AM MC 4064", "Maryam Soleimani", "Email: m7soleim@uwaterloo.ca", "Office: E3-3173", "This course is intended for those students interested in acquiring a working knowledge of metallurgy.", "It covers: metals and alloy systems, iron-carbon alloys, heat treatment and the function of alloying elements in steel, corrosion and scale resistant alloys, copper and nickel base alloys, light metals and their alloys; casting, hot and cold working of metals; soldering, brazing and welding; corrosion and oxidation; metal failure analysis.", "Identify the alloy in a component by conducting a metallographic analysis and materials testing.", "Describe the typical uses and properties for various alloys, and recognize their designations and naming systems.", "Introduction and Background", "Elements of Metallurgy and Engineering Alloys F.C. Campbell, “Elements of Metallurgy and Engineering Alloys,” ASM International, 2008 No"]}, {"course_id": 41, "course_code": "ME 436", "course_name": "ME436 - Welding and Joining Processes (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "E3 2119", "Introduction to modern welding and joining processes for metals, polymers and ceramics.", "Fusion welding processes such as shielded metal arc, gas tungsten arc, gas metal arc, submerged arc welding and others including electron beam and laser beam welding.", "Resistance welding processes, solid-state welding processes, soldering and brazing.", "Laboratory exercises will provide hands-on experience with a number of industrially significant welding processes.", "Many welding and joining processes have been in use for a long time, and their fundamental mechanisms are still being researched.", "Welding and joining operators use their experience to setup joining processes for specific applications.", "This course covers several commonly used welding and joining processes as applied to join different materials in different industries and gives a look-out to challenges and opportunities for future processes.", "explain the fundamental barriers of welding and joining of engineering materials.", "Introduction", "Fusion welding", "Arc welding", "Power beam welding", "Brazing and Soldering", "Solid state welding", "Friction welding, ultrasonic welding, explosion welding", "Resistance welding", "Electronics packaging", "Microwelding and Nanojoining", "Additive manufacturing", "Notice of Recording", "Library for research-based assignments"]}, {"course_id": 42, "course_code": "ME 452", "course_name": "ME452 - HVAC Load Analysis and Design Fundamentals (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "HVAC Load Analysis and Design Fundamentals Winter 2025", "11:30AM - 12:20PM RCH 305", "Email: hasan.habib@uwaterloo.ca", "Duct design and fan selection.", "Heating and cooling load calculations.", "Infiltration and exfiltration.", "B. Be able to fully design an air conditioning and ventilation system", "C. Be able to perform heating and cooling load, and preliminary energy use calculations for buildings", "D. Have developed the ability to apply their knowledge in a real-world setting (practical experience)", "E. Be capable of communicating effectively with industry professionals and clients", "F. Have developed the skills to research and interpret information needed to remain current in the field", "Module 1: Introduction to HVAC:  History, ASHRAE, Unit Systems (chap.", "Module 2: Air Conditioning and Ventilation: Fundamental Concepts of HVAC/Air Conditioning Systems (chap.", "3), Fans and Air Distribution Systems (chap. 16).", "A tentative checklist of material to be reviewed each week will be posted in Learn.", "Midterm Exam: will be held in two parts during scheduled lecture time.", "You can also present case studies of interesting buildings or even a biographical review of someone who made an impact to HVAC.", "A) Develop an appreciation and understanding for the various codes, standards, and guidelines that determine HVAC design practices X    X", "B) Fully specify and design an air conditioning and ventilation system   X", "C) Perform heating and cooling load, and preliminary energy use calculations for buildings     X", "F) Develop the skills to research and interpret information needed to remain current in the field X", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 43, "course_code": "ME 456", "course_name": "ME456 - Heat Transfer 2 (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["DWE 2402", "DWE 2402", "The remaining topics will be chosen from design of heat exchangers; condensation heat transfer; boiling heat transfer; and the treatment of problems in heat conduction.", "Topics to be covered include boiling and condensation, radiation heat transfer, finite difference formulation for heat conduction, heat exchangers, and advanced topics in convection.", "Understand boiling and condensation and carry out analysis of industrially relevant systems", "Understand advanced concepts of thermal radiation in multi-surface enclosures and participating media", "Become familiar with heat exchanger configurations, and carry out basic simulations", "Apply numerical techniques to analyze heat conduction in a multidimensional media, and understand the general procedure for implementing a numerical solution to an engineering problem", "Apply advanced convection concepts, including scale analysis, to derive basic correlations", "Understand the historical context of many heat transfer innovations, and appreciate the importance of equity, diversity, and inclusion", "1 5-Sep A Course Introduction Course Introduction Supplemental", "Intro to boiling and condensation Industrial importance of boiling 10.1", "Pool boiling vs. forced convection boiling 10.2-10.3", "Subcooled vs. saturated boiling 10.3", "6-Sep B Pool boiling correlations Parts of the boiling curve 10.3", "Force balance for nucleation Supplemental", "Derivation of the Rohsenow correlation 10.4.1", "Pool boiling example Supplemental", "Droplets and the role of surface condensation Supplemental", "13-Sep B Nusselt condensation model Assumptions that underlie Nusselt model 10.7", "Derivation of Nusselt model 10.7", "Example condensation calculation Supplemental", "Condensation on cylinders, effect of non-condensate 10.9, Supplemental", "3 19-Sep A Introduction to thermal radiation Why is thermal radiation important?", "Supplemental", "Energy balance at a surface 12.2", "C Intensity Definition of the solid angle 12.3.1", "Calculation of emissive power and irradiation from intensity 12.3.2, 12.3.3", "4 25-Sep A Intensity example Review from last week Discussion", "Intensity example: solar irradiation of the earth Supplemental", "Example: calculate radiative properties of aluminized steel Supplemental", "5 3-Oct A View factors Basic definitions, reciprocity, summation 13.1", "4-Oct B Radiation between diffuse-grey surfaces Derivation of radiosity equations 13.3", "Formation of matrix equations Supplemental", "Supplemental", "6 10-Oct A Radiation in participating media Absorption, emission, out-scattering, in-scattering 13.6, supplemental", "Differential form of the non-scattering RTE 13.6, supplemental", "Irradiation of a differential element at the base of a hemisphere Supplemental", "V-R bands for a molecular gas Supplemental", "7 24-Oct A Numerical solution techniques Types of numerical simulations Supplemental", "Steps for solving a problem numerically, ethical obligations Supplemental", "8 31-Oct A Steady state FD Finite difference control volume formulation 4.4.3", "Boundary conditions, definition of Biot number 4.4.3", "Matrix structure Supplemental", "1-Nov B Transient FD Equation formulation, elliptical and parabolic equations Supplemental", "Explicit and implicit formulations 5.10", "C Transient FD (cont’d) FD formulation for explicit Euler, definition of Fourier number 5.10", "Finite difference formulation for implicit Euler 5.10", "9 7-Nov A Introduction to heat exchangers Heat exchangers in industry and the natural world Supplemental", "Types of heat exchangers 11.1", "Definition of the overall heat transfer coefficient 11.2", "8-Nov B Heat exchangers (cont’d) Overall HTC example Supplemental", "C Log mean temperature difference Derivation of LMTD equations for a parallel flow heat exchanger 11.3", "Special operating conditions 11.3.3", "Derivation of e-NTU method for a parallel flow heat exchanger 11.4.2", "11 21-Nov A Convection from a flat plate Velocity and thermal boundary later, momentum and heat transfer Supplemental", "Derivation of the continuity equation Supplemental", "Conservation of x-momentum Supplemental", "22-Nov B Convection from a flat plate General advection-diffusion equation Supplemental", "Derivation of the energy equation Supplemental", "C Convection from a flat plate General advection-diffusion equation Supplemental", "12 28-Nov A Scale analysis Blasius solution for momentum and heat transfer Supplemental", "Scale analysis for continuity equation Supplemental", "Scale analysis for x-momentum equation Supplemental", "Scale analysis for energy equations Supplemental", "29-Nov B Boundary layer analogies Similarity of momentum and energy equations Supplemental", "C Biographical presentations   Student-led", "Laboratories on boiling and condensation are provisionally scheduled for Sep 23-27 and will be held in E3 2103G.) Laboratories should be performed in groups of two or three.", "This course includes the independent development and practice of specific skills, such as computer programming."]}]