[{"course_id": 39, "course_code": "CHEM 266L", "course_name": "CHEM266L - Organic Chemistry Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["CHEM 266L", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "CHEM 266L 006", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Answers can be expected within 24 hours.", "Piazza is available for clarification questions but I will only provide quick answers as I prefer having longer conversations in person.", "View requirements for CHEM 266L", "Topics include acid-base chemistry, substitution reactions, Grignard reactions, liquid-liquid extraction, product isolation and purification.", "Be proficient with basic organic laboratory techniques including selecting proper glassware, measuring small and large quantities of solids and liquids, designing the setup required for simple synthetic reactions, filtration, and basic characterization.", "Understand and be able to design and execute a liquid-liquid extraction processes for the separation of ionizable acidic, ionizable basic, and non-ionizable (neutral) substances.", "Demonstrate independent thinking by answering questions in your own words, showing critical reflection beyond the initial description of observations and facts.", "Laboratory performance marks will be given by the Teaching Assistants and Lab Instructor and averaged for each in-person lab period.", "This is not directly the case; we do expect students to need a lot of clarifications when working in the lab for the first time.", "Laboratory Worksheets and Reports", "Questions similar to the pre-laboratory quizzes and reports will be used, but may be modified to be multiple choice.", "Human rights must be centered in our pedagogical practice to ensure students feel safe and respected into our instructional spaces.", "We also acknowledge that speaking of underrepresented groups in Science is a misnomer and we should speak of historically excluded persons as Black, Indigenous, Queer and Persons of Colour have contributed to chemical research since the inception of the field.", "Scheduling issues", "General Policies", "Aside from LEARN, we will use various software to facilitate the delivery of the laboratory.", "Important note: Since the manual is printed months before delivery of the lab, we may need to make corrections during the term.", "Expectation of Academic Integrity", "Be especially careful with sharing diagrams and mechanisms, as we often detect excessive collaboration when students share images.", "None-the-less all violations of academic misconduct will be dealt with be taken seriously and dealt with according to the consequences outlines in Policy 71."]}, {"course_id": 40, "course_code": "ECON 101", "course_name": "ECON101 - Introduction to Microeconomics (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Introduction to Microeconomics Winter 2025", "ECON 101", "Email: chvandew@uwaterloo.ca", "“ECON 101” must appear in the subject line and the message must include your full name and student ID number.", "This course provides an introduction to microeconomic analysis relevant for understanding the Canadian economy.", "The behaviour of individual consumers and producers, the determination of market prices for commodities and resources, and the role of government policy in the functioning of the market system are the main topics covered.", "View requirements for ECON 101", "The course comprises the theoretical essentials of microeconomics and will serve as a prerequisite for virtually every economics class that you will endeavour to take in the future.", "understand the need for people to make choices and to work together towards overcoming the universal problem of scarcity;", "appreciate the relevance of economics in a changing world;", "apply elements of microeconomic theory to understand how consumers and producers make rational decisions;", "decompose problems into their economic parts.", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Intellectual property includes items such as:", "Please carefully read the Economics Department policy for instructions.", "Economics Department Deferred Final Exam Policy", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Applications for Accommodation", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 41, "course_code": "ECON 102", "course_name": "ECON102 - Introduction to Macroeconomics (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Introduction to Macroeconomics Winter 2025", "ECON 102", "04:00PM - 05:20PM", "View requirements for ECON 102", "Describe important macroeconomic questions and goals, and explain how monetary and fiscal policy may influence economic outcomes.", "Explain and solve simple models and problems.", "Identify strengths and weaknesses of macroeconomic data, models and theories.", "I. Introduction", "Measurement, Accounting and Data", "Gross Domestic Product and the System of National Accounts.", "Inflation and Price Indices.", "Economic Frameworks", "Modelling Concepts and Model Evaluation.", "Concept of Aggregate Demand in the Goods Market.", "Trends, Cycles and Inequality", "Inequality and Poverty concepts and issues.", "Money and Inflation", "Monetary System and role of money.", "Cost of Inflation", "International Economic Concepts, Exchange Rates and Balance of Payments", "The lecture slides cover a variety of standard macroeconomic topics.", "CAUTION: the notation and even the macroeconomic models presented can vary subtly across textbooks.", "Differences in approach and thought can also help to better understand the benefits and drawbacks of different economic theory and methods.", "The format of the mid-term will be multiple-part short-answer questions.", "All deferred Final Exam requests for Economics courses are administered by the Economics Undergraduate Office.", "In order to achieve a healthy balance between work hours and personal life, there will be a finite amount of time I can dedicate to appointments and emails.", "Also know that I am here to support your learning goals, whether they be to understand a subset of the econometric tools, to pass the course, or to achieve a high grade.", "Applications for Accommodation", "Economics Department Deferred Final Exam Policy", "On campus supports", "Other on-campus supports", "Please see WUSA main web page for these and other services and clubs which may provide more specific and personalized support for specific needs.", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 42, "course_code": "SCBUS 122", "course_name": "SCBUS122 - Management of Business Organizations (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Ghajaa Senthilkumaran - g3senthilkumaran@uwaterloo.ca", "Be sure to mark your section number and name in the Subject line.", "This course introduces and applies common tools used by managers such as the Business Model Canvas and frameworks like Decision Making and Project Management models.", "Managerial skills such as communication (oral and written), working in and leading teams and critical thinking will be a focus, using current events and real life scenarios in business and organizations to learn from.", "Identify the roles leaders and managers play within an organization, in particular the important role of Science and Innovation in organizations", "Apply a decision making framework taking into account ethical concerns and other criteria", "General Information", "Teams should escalate quickly to Faculty if they need help resolving critical team issues.", "Students failing the final exam will receive a maximum grade of 45%", "Notice of Recording", "It is not appropriate to attend a session you are not enrolled in, without talking to the instructor first", "You can self-declare an absence on Quest in certain situations.", "The dates affected and degree of incapacitation will be used to determine follow-up action.", "Offenses include the following:", "Avoidance of Academic Offenses", "All students are expected to know what constitutes an academic offense and thereby avoid committing them by doing the following:", "Resolution of Academic Offenses", "Instructors must notify the Associate Dean of the infraction in writing with all supporting evidence.", "Copyright Information", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline).", "Intellectual property includes items such as:", "Writing and Communication specialists offer one-on- one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "Phone: 519-884-0000 extension 213"]}, {"course_id": 43, "course_code": "SCBUS 225", "course_name": "SCBUS225 - Organizational Behaviour in Scientific and Technical Workplaces (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Organizational Behaviour in Scientific and Technical Workplaces Winter 2025", "Avneet Dhiman", "TBA", "This workshop uses case studies, lectures, and discussions to explore a basic understanding of how organizations work, and how people interact within organizations in order to achieve ethical human, organizational, and social objectives.", "This course considers organizational structure and models, ethics, organizational theory, organizational culture, motivation, diversity, negotiation, communication, leadership, and management, and how these principles are applied in start ups or scientific and technical environments.", "SCBUS225 explores the behavior of individuals and groups in organizations.", "The course looks at job performance and organizational commitment, explores personal behaviors and their impact, examines relational skills and finally considers organizational structure and change.", "Define, summarize, and explain the core concepts or Organizational Behaviour - Individual outcomes, Individual Characteristics and Mechanisms, Relational Mechanisms and Organizational Mechanisms", "Describe and explain the connections between Organizational Behaviour concepts", "Evaluate the workplace performance of yourself and others and be able to assess motivations, stress, personality and other OB factors to get a new desired outcome", "In", "In", "Introduction and", "Welcome and Intro to", "Personality and EI", "Stress / Decision Making", "Cultural Differences and Organizational Commitment", "Motivation", "Teams", "In-Class Individual Case Analysis", "Power, Influence and Negotiation", "Individual Case Analysis", "Peer evaluations are used because group case exercises represent a considerable portion of your overall course grade.", "During the second week of classes, you will choose a team.", "Submission Times"]}, {"course_id": 44, "course_code": "BIOL 345", "course_name": "BIOL345 - Microorganisms in Foods (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Microorganisms in Foods Fall 2024", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM B1 374", "cheryl.duxbury@uwaterloo.ca", "You can!", "ca", "Food preservation, spoilage, poisoning and modern concepts in quality assurance programs are studied.", "Microorganisms interact with the human food supply in a number of ways; some we consider beneficial, others detrimental.", "In this course we'll look at factors that influence microbial growth in food.", "If uncontrolled, such growth can lead to food spoilage, and, in some cases the safety of the food may be compromised.", "Techniques to preserve foods, thereby extending their shelf-life and reducing potential health hazards, will be considered.", "Identify factors that influence microbial growth in foods", "Relate concepts in food microbiology to core concepts in biology (evolution, cell structure, metabolism)", "Differentiate between microbes as spoilage organisms, pathogens, and useful food fermenters", "Predict how specific changes would affect food microbiology parameters in a given scenario", "Determine appropriate techniques for microbial analysis of food and for food preservation", "Monday", "Microbial growth in the food environment", "Sources of microbes in food", "Chapter 2: Microbial growth, survival, & death in foods;", "Chapter 4: Detection & enumeration of microbes in food (11 pages)", "Food preservation: physical methods", "Food preservation: chemical & biological methods", "Chapter 26: Biologically based food preservation & probiotic bacteria (13 pages)", "Chapter 19: Lactic acid bacteria & their fermentation products (16 pages);", "Chapter 20: Yeast-based & other fermentations (15 pages)", "Fungi, viruses, & prions in food", "Quality assurance & control", "Chapter 6: Indicator microorganisms & microbiological criteria (19 pages);", "Chapter 29: Sanitation & related practices (21 pages)", "The following book covers many of the same topics and may also be useful:", "There may also be a few multi-select questions (where you can choose multiple correct answers).", "You can miss up to 3 classes and still achieve full participation marks.", "You can self-declare an absence on Quest in certain situations.", "The dates affected and degree of incapacitation will be used to determine follow-up action."]}, {"course_id": 45, "course_code": "BIOL 431", "course_name": "BIOL431 - Bacterial Molecular Genetics (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Bacterial Molecular Genetics Winter 2025", "Bacterial molecular biology with an emphasis on the use of genetic tools to study the biology of microorganisms.", "recognize the power of the bacterial genetics method, apply genetic concepts to challenges in fundamental and applied microbiology, and consider the impact of bacterial genetics on human society.", "Introduction to Bacterial Genetics", "Mutation and Evolution", "Gene Regulation and Intercellular Signaling", "Genetics and Metagenomics", "Synthetic Biology and Genome Engineering"]}, {"course_id": 46, "course_code": "BIOL 434", "course_name": "BIOL434 - Human Molecular Genetics (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Human Molecular Genetics Fall 2024", "Recent advances in human molecular genetics will be examined with emphasis on how human disease-causing genes are mapped, identified, isolated, and characterized.", "describe structural elements of the human genome and their uses in gene mapping", "describe molecular techniques applied to mapping the location of and determining the sequence of specific genes", "differentiate between complex and simple traits in the etiology of disease using real world examples", "describe how various molecular change contribute to human disease", "describe the role of genomics tools in the determination of disease predisposition and appreciate how pathogenicity/neutrality of a sequence variant is determined", "evaluate the current limitations in the applications of genomics to the etiology of disease", "appreciate ethical and legal issues that have developed as a result of expanding human molecular genetic technologies", "evaluate and critically read primary literature on disease (to identify rationale/hypothesis, and and assess the skills needed to critically evaluate the methods and assess the conclusions", "Pattern of inheritance", "Pattern of inheritance", "Human genome sequencing", "23-Sep-24 M", "Human genome sequencing", "The architecture and working of human genome", "The architecture and working of human genome", "Human gene regulation and epigenome", "Human gene regulation and epigenome", "Human genetic variation", "Human gene regulation and epigenome", "18-Oct-24 F", "21-Oct-24 M  Epigenome/ Comparative genomics and evolution", "Molecular pathology", "25-Oct-24 F", "28-Oct-24 M", "Mapping and identifying genes for monogenic disorders", "Mapping and identifying genes for monogenic disorders", "Complex diseases", "4-Nov-24 M  Cancer genetics and genomics", "6-Nov-24 W Cancer genetics and genomics", "Model organisms", "29-Nov-24 F", "To facilitate equal contribute from all members, it is vital to maintain open and constant communication.", "Notice of Recording", "They host in-person appointments in their offices in South Campus Hall (SCH), remote appointments via a virtual platform, drop-in appointments at the Library, and email-based appointments so you can get help without missing class."]}, {"course_id": 47, "course_code": "BIOL 441", "course_name": "BIOL441 - Advances in Immunology (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Advances in Immunology Winter 2025", "10:00AM - 11:20AM PAS 1241", "E-mail: barb.katzenback@uwaterloo.ca", "A survey of the recent advances in the vertebrate immune response; the cells and tissues of the lymphoid system; humoral and cell-mediated immunity; initiation and regulation of the immune response; the immune system and disease, emerging techniques used in immunology.", "Evaluate the strengths and weaknesses of research techniques and animal models used in immunology.", "Identify the appropriate technique and corresponding controls to generate high-quality, meaningful data.", "Critique primary literature papers in immunology by critically interpreting data and forming evidence-based conclusions.", "Design experiments to address research hypothesis and questions", "Each week students will be reading scientific literature on the topics to be discussed in class – links to these articles will be posted on Learn and students are responsible for accessing and reading these papers.", "While ~50% of Midterm #2 will mainly focus on material covered after Midterm #1, Midterm #2 is cumulative and students should still have an excellent mastery of the material covered in the first half of the course as the immune system is interconnected and many of the same techniques are used in immunology research.", "Thus, students are still expected to know these immunology concepts and techniques.", "However, students should should have a mastery of the material such that they could complete the midterm without course materials as there is not enough time to learn material during exams – lecture notes and papers are for quick reference in case you have forgotten a detail.", "Group Oral Presentations: Presentations will be a critique of the paper and will be approximately 25 minutes in length followed by ~5 minutes for questions.", "This does not need to be shown during the oral presentation (but a slide needs to be included with this information in the version submitted to Learn) and does not count towards page limits for the Group Written Paper Critique (this information can be placed on the title page).", "A VALID Verification of Illness Form (VIF; see below) must be supplied in order to qualify for a make-up midterm.", "Compassionate leave (e.g., death in the immediate family) will be granted by the instructor/lecturer on a case-by-case basis and will normally require validation by documentation.", "Please make contact as soon as possible in this event so judgment can be made before the examination.", "**", "The assignment in question will be given a mark of zero.", "Examples of plagiarism and excessive collaboration"]}, {"course_id": 48, "course_code": "BIOL 442", "course_name": "BIOL442 - Virology (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "View requirements for BIOL 442", "As such they act as pathogens, drivers of evolutionary processes, and players in environmental and ecological processes.", "Some viruses are also tools for combating other disease-causing agents, and they have numerous applications these days in molecular biology.", "Describe common molecular themes for entry, replication, and exit of viruses.", "Predict how a virus might carry out the above processes given basic viral structure and nucleic acid composition.", "Understand the ecological roles of viruses in the environment.", "Perform basic skills for isolating and culturing viruses.", "Generate and interpret laboratory results in the field of virology.", "If in multiple rooms, Dr. Nissimov will move from room to room during the test period.", "I will first post the questions and give you a few days to go over them, and then post the answers.", "These recap sessions will be during class time and are an opportunity for us to go again together over concepts that require further clarification.", "Note that these recap sessions ARE NOT intended to go over again entire lecture topics so please be specific with what you are asking (you can point to specific slide numbers if easier).", "If I don’t get a lot of questions for these recap sessions, then we will move over to new material so please make sure to attend those sessions.", "*All exams and laboratory exercises/assignments must normally be completed in order to qualify for a pass in this course.", "Notice of Recording", "Do not share these with any third-party sites or on social media.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 50, "course_code": "BIOL 483", "course_name": "BIOL483 - Animal Cell Biotechnology (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Email – vrdayeh@uwaterloo.ca", "Email – ljlemieux@uwaterloo.ca", "A study of the techniques and applications of animal cell culture to biotechnology.", "Topics include basic cell culture technique, gene modification, products of animal cell culture, large-scale productions, and tissue engineering.", "Explain and justify the basic techniques for animal cell culture", "Explain how animal cells/tissues can be grown in an in vitro environment", "Explain the process of genetically modifying cells in culture", "Effectively communicate and present assigned Culture club article and Animal Biotech application", "Develop critical thinking skills", "Introduction to Animal Cell Biotechnology & Cell Culture Requirements", "Cell Culture Requirements & Characteristics of Cells in Culture", "Characteristics of Cells in Culture & Cell Lines, Cloning and Selection", "see readings in Week 3  Culture Club Question Submission & Attendance    Friday January 24 at 11:59pm  2%", "Cell Line and Culture Monitoring,  Animal Cell Culture Scale-up and Cellular Agriculture", "see readings in Week 4 Culture Club Presentation PDF Submission    Friday January 31 at 11:59pm", "Week of February 24 Genetic Modification: Selection & Goals   see readings and notes in Week 7", "see readings and notes", "Cells as Products & Organs as Products", "Week of March 24", "Presentations  begin in class- Attendance", "Peer Evaluation       No late submissions", "Biology 483 Course Notes This booklet contains skeletal version of the notes that will be presented during the lectures for the first half of the course.", "Question submission & participation in Culture Club 2%", "Approved Animal Biotech presentation (in person in groups of 4) 15%", "The format for the Term exam 1 and Term exam 2 will be true/false, fill-in-the-blank short and long answer written exam.", "Emails can be received 24 hours per day.", "At the discretion of the instructor, you may be permitted to take a make-up exam.", "The make-up exam may be of different format than the missed examination (e.g. oral examination for the make-up).", "Students should carefully consider the wisdom of missing a test or exam.", "Don’t waste your time with these requests!", "Expectations for Change", "This course includes the independent development and practice of specific skills, such as public speaking and academic writing.", "Library for research-based assignments"]}, {"course_id": 51, "course_code": "CHEM 333", "course_name": "CHEM333 - Metabolism 1 (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["09:30AM - 10:20AM DWE 2527", "First we will cover general principles of thermodynamics and high energy compounds ( NTPs, NAD(P)+ and fats).", "And some general principles of the energy metabolism and the regulation of metabolic pathways.", "understand the logic of the pathways by being able to draw the chemical structures of the intermediates in these pathways.", "draw the chemical mechanisms of the enzymes involved in these metabolic pathways and to use that information to apply it to new systems.", "understand the interconnection of these pathways and the basis, of the regulation and coordination of these pathways.", "week ART Reading VVP reading and practice problems MVH", "1: Introduction to metabolism, review of Energy Metabolic Energy (410-429)", "6: Electron transport and oxidative phosphorylation Energy: Electron Transport & Oxidative Phosphorylation (430-471)", "10: Integration and coordinated regulation of the pathways metabolic disorders Signalling (828-855)", "Biochemistry Free for All https://biochem.oregonstate.edu/undergraduate/educational-resources Yes", "Fundamentals of Biochemistry 5th edition by Voet, Voet and Pratt Yes", "Online quizzes   10% of final mark These will be a combination of multiple choice and written answers."]}, {"course_id": 52, "course_code": "CHEM 432", "course_name": "CHEM432 - Metabolism 2 (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "11:30AM - 12:20PM", "RCH 211", "Dara Gilbert", "Biosynthesis and mode of action of selected cofactors.", "Structure-function relationships of enzymes.", "THF and vitamin B12 reactions", "Changes to these and other pathways in cancer", "engineering these pathways in microorganisms to produce useful chemicals", "For each of these topics we will cover the chemistry and enzymes of each step in the pathway.", "How the inhibition of some of the enzymes involved can that human diseases such and autoimmune disorders and cancer.", "to learn the chemistry of the steps in the pathways covered", "to understand the chemical \"logic\" of these steps", "to be able to interpret data and even propose experiments to exploit the pathways to treat diseases and synthesize useful compounds", "develop skills for working in groups", "Biochemistry 4th edition Voet and Voet", "Fundamentals of Biochemistry: Life at the molecular level by Voet, Voet and Pratt", "mock OGS proposal 40", "participation in class discussion includes pop quizzes 10", "Notice of Recording", "Oral presentations will be recorded so that I can mark them.", "you must completely rewrite source material in your own words.", "quotations marks around large sections of text do not make it okay"]}, {"course_id": 54, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 0, "course_code": "CHE 100", "course_name": "CHE100 - Chemical Engineering Concepts 1 (0.50)", "term_name": "1A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["CHE 100", "09:30AM - 10:20AM RCH 301", "RCH 301", "10:30AM - 11:20AM DWE 3516", "CHE 100 103", "11:30AM - 12:20PM DWE 3516", "Outside of these office hours,  Prof. Tam and Prof. Kamkar can be contacted by email.", "Introduction to basic methods and principles in chemical engineering.", "View requirements for CHE 100", "The lectures will present and discuss key concepts of chemical processes and provide examples and applications of these concepts.", "Email correspondence", "Define and calculate degree of freedom in the context of material balances.", "Translate and visualize complex written problem statements into flowcharts.", "Understand the importance of integrity in engineering profession.", "*FRB: Elementary Principles of Chemical Processes.", "1.1-1.2 Process data representation and analysis (*FRB, 2.7)", "Process data representation", "2.1-2.3 Process and variables: force, weight, pressure & flow measurements", "Product/Chemical composition", "Process representation and material balance", "3.3 General material balances calculations, sustainable development and circular economy", "3.4 Material balances – no reaction and multiple unit operations", "3.7.1 Combustion chemistry", "Sunday December 8th", "*The exam starts at 12:45 pm but you should be in the room at 12:30 pm.", "The make-up lectures for CHE 100 are currently scheduled for 1:30 - 2:20 pm on the following Tuesdays in RCH 301:", "November 5th", "Tutorial objectives and organization", "The purpose of the tutorials is to provide a smaller class environment and guidance to practice solving problems and analysis of chemical processes and product manufacturing.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 1, "course_code": "CHE 102", "course_name": "CHE102 - Chemistry for Engineers (0.50)", "term_name": "1A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Chemistry for Engineers Winter 2025", "CHE 102", "E. Boghaert", "Eline Boghaert (eline.boghaert@uwaterloo.ca)", "While this course can be completed asynchronously online, synchronous online sessions will be held on Wednesday from 11:30 AM - 12:30 PM and Friday from 12:30 PM - 1:30 PM to review key concepts, demonstrate problem solving and answer questions.", "Stoichiometric calculations, properties of gases, properties of liquids and solutions, gas phase chemical equilibrium, ionic equilibrium in aqueous solution, oxidation-reduction reactions, chemical kinetics.", "View requirements for CHE 102", "Explain the behavior of ideal systems (including different states of matter, physical and chemical equilibrium and reaction kinetics) in terms of the molecular nature of matter.", "Write balanced chemical reactions and perform stoichiometric calculations.", "Identify which principles of physical chemistry are relevant to the analysis of problems involving physical and chemical equilibrium and rates of reaction.", "Select and apply an appropriate law to solve problems involving physical and chemical equilibrium and rates of reaction.", "Apply course concepts to identify and analyze concerns regarding the safety and/or sustainability of a chemical process.", "Unit 1: Introduction and Stoichiometry Week 1", "Introduction Lesson 1: Introduction to Significant Digits, Line Calculations and Unit Conversions (1.4, 1.5, 1.7)", "Lesson 5.1: Chemical Equilibrium and Equilibrium Constants (15.1-15.4)", "Unit 6: Equilibrium in Electrochemical Systems Week 11", "Lesson participation grades for each lesson are evenly weighted in the total lesson participation grade.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 2, "course_code": "CHE 120", "course_name": "CHE120 - Computer Literacy and Programming for Chemical Engineers (0.50)", "term_name": "1A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Computer Literacy and Programming for Chemical Engineers Fall 2024", "10:30AM - 11:20AM RCH 301", "10:30AM - 11:20AM RCH 301", "Department of Chemical Engineering", "Email me!", "Email", "Amaan Fathima", "Arshia Fazeli", "Casey Dudding", "Th 16:30-17:30 in QNC 5324", "Introduction to computer architecture and networking.", "Effective use of command line interfaces and graphical user interfaces.", "Introduction to programming and numerical computing using a high-level interpreted programming language.", "View requirements for CHE 120", "Integrate data and text into technical reports that are organized and of professional quality.", "Understand and apply fundamental programming concepts.", "Design and implement simple computer programs in a high-level interpreted language.", "Corresponding chapter in textbook", "Word processing and presentation software", "Spreadsheet software", "Programming & Computer Architecture 2", "Design and Use of Functions", "Strings and Text I/O", "Relational Operators & if Statements", "Modules, Methods, & Scripts", "Designing Algorithms", "Practical Programming: An Introduction to Computer Science Using Python 3.6 Available https://ocul-wtl.primo.exlibrisgroup.com/permalink/01OCUL_WTL/vk29fk/alma999986579775105162", "First year Engineering", "As a first year Engineering student, I would highly recommend that you visit", "First year Engineering page here.", "This course includes the independent development and practice of specific skills, such as learning core programming skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 3, "course_code": "CHE 180", "course_name": "CHE180 - Chemical Engineering Design Studio 1 (0.50)", "term_name": "1A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Chemical Engineering Design Studio 1 Fall 2024", "08:30AM - 09:20AM E2 1792", "10:30AM - 11:20AM RCH 301", "08:30AM - 10:20AM E2 1792", "ChE180: Chemical Engineering Design Studio 1", "Email: maucoin@uwaterloo.ca", "First-Year Engineering Tutors", "An introduction to the fundamentals of data analysis, investigation, design, and communication in chemical engineering.", "Introduction to chemical product and process design.", "Design requirements, constraints, and criteria.", "Development and preliminary evaluation of alternative solutions using software tools.", "Introduction to computer-aided design (CAD).", "Introduction to process safety and process hazard identification.", "Students undertake a term-long design project under the supervision of the instructor.", "View requirements for CHE 180", "Brainstorm and develop ideas for engineering design.", "Use standard computational tools needed for performing engineering analysis, calculation, and communication.", "Prepare reports using word-processing tools.", "Prepare and deliver oral presentations.", "Prepare a design using computer-assisted drawing tools.", "Design a process for a chemical commodity.", "6a", "Introduction", "Monday 9 12:30-2:20 110 E2-1792", "Introduction", "Monday 16 12:30-2:20 110 E2-1792 Specialized knowledge and reasonable care, engineering design, brainstorming", "Tuesday 17 8:30-10:20 110 E2-1792 Specialized knowledge and reasonable care, engineering design, brainstorming", "Thursday 19 8:30-10:20 110 E2-1792 Specialized knowledge and reasonable care, engineering design, brainstorming", "Monday 23 12:30-2:20 110 E2-1792 SolidWorks Computer-Aided Design", "Tuesday 24 8:30-10:20 110 E2-1792 SolidWorks Computer-Aided Design", "Thursday 27 8:30-10:20 110 E2-1792 SolidWorks Computer-Aided Design", "Monday 7 12:30-2:20 110 E2-1792 Soap calculator and project proposal", "Tuesday 8 8:30-10:20 110 E2-1792 Soap calculator and project proposal", "Thursday 10 8:30-10:20 110 E2-1792 Engineering calculations around soap (mass and energy calculations)", "Monday 21 12:30-2:20", "Tuesday 12 8:30-10:20 110 E2-1792 Engineering calculations", "Monday 18 12:30-2:20 110 E2-1792 Development of Symposium Deliverables", "Tuesday 19 8:30-10:20 110 E2-1792 Development of Symposium Deliverables", "Thursday 21 8:30-10:20 110 E2-1792 Development of Symposium Deliverables", "Thursday 28 8:30-10:20 110 E2-1792 Resubmission of Check-In Should Project not Pass Check-In", "December Week14", "Final Exam Period Starts", "Introduction to Professional Engineering in Canada, Fifth Canadian Edition, 5th Edition.", "Historical perspective about the evolution of Chemical Engineering:", "Evaluation", "Introduction to CFE and co-op, followed by in-classroom Q&A with a co-op advisor.", "Check for LEARN announcements about location reminders and other important event info", "Introduction to co-op and co-op process; writing a résumé; writing a cover letter; tailoring applications to job postings", "Interview process at Waterloo; preparing for interviews; interview questions; STAR response; questions to ask employers; interview supports", "Rank and match", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 4, "course_code": "MATH 115", "course_name": "MATH115 - Linear Algebra for Engineering (0.50)", "term_name": "1A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Linear Algebra for Engineering Fall 2024", "02:30PM - 03:20PM", "RCH 301", "RCH 301", "10:30AM - 11:20AM E7 5353", "02:30PM - 03:20PM", "E. Dupont", "03:30PM - 04:20PM E7 5343", "10:30AM - 12:20PM RCH 301", "10:30AM - 12:20PM", "PHY 313", "E. Dupont", "08:30AM - 09:20AM", "08:30AM - 10:20AM PHY 313", "08:30AM - 10:20AM RCH 309", "10:30AM - 11:20AM RCH 103", "11:30AM - 12:20PM RCH 103", "RCH 204", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "08:30AM - 10:20AM EV3 4412", "08:30AM - 10:20AM MC 4058", "02:30PM - 03:20PM", "09:30AM - 10:20AM RCH 302", "F. Al-Faisal", "10:30AM - 12:20PM MC 4063", "10:30AM - 12:20PM MC 4060", "10:30AM - 11:20AM RCH 110", "F. Al-Faisal", "03:30PM - 04:20PM", "02:30PM - 04:20PM MC 4060", "DWE 3522", "Tuesday -", "07:00PM - 08:50PM", "Linear equations, matrices, and determinants.", "Introduction to vector spaces.", "Eigenvalues and diagonalization.", "Present solutions to problems in a clear and logical manner with all steps being fully justified.", "Understand the basic operations of addition and scalar multiplication as they apply to vectors, matrices and linear transformations.", "Find the solution to a system of linear equations using matrices and elementary row operations.", "Understand matrix algebra and its connection to systems of equations.", "Have both a geometric and an algebraic understanding of span, linear independence, bases and subspaces.", "Recognize the link between matrices and linear transformations, and understand that many common geometric operations such as projections, reflections and rotations are linear transformations.", "Develop a basic algebraic and geometric understanding of complex numbers and complex polynomials.", "Determine the eigenvalues and eigenvectors of a matrix and diagonalize a matrix.", "1.1 Vectors in Rn", "1.2 Linear Combinations", "1.3 The Norm and the Dot Product", "1.4 Vector Equations of Lines and Planes", "1.5 The Cross Product in R3", "1.6 The Scalar Equation of Planes in R3", "1.7 Projections", "Chapter 2 Systems of Linear Equations", "2.1 Introduction and Terminology", "2.2 Solving Systems of Linear Equations", "2.3 Rank", "2.4 Homogeneous Systems of Linear Equations", "3.1 Matrix Algebra", "3.2 The Matrix-Vector Product", "3.3 The Matrix Equation Ax=b", "3.4 Matrix Multiplication", "3.5 Matrix Inverses", "4.1 Spanning Sets", "4.2 Geometry of Spanning Sets", "4.3 Linear Dependence and Linear Independence", "4.4 Subspaces of Rn", "4.5 Bases and Dimension", "4.6 Fundamental Subspaces of a Matrix", "Chapter 5 Linear Transformations", "5.1 Matrix Transformations and Linear Transformations", "5.2 Examples of Linear Transformations", "5.3 Operations on Linear Transformations", "5.4 Inverses of Linear Transformations", "5.5 The Kernel and the Range", "Chapter 6 Determinants", "6.1 Determinants and Invertibility", "6.2 Elementary Row and Column Operations", "6.3 Properties of Determinants", "7.1 Basic Operations", "7.2 Conjugate and Modulus", "7.3 Polar Form", "7.4 Complex Polynomials", "7.5 Complex nth Roots", "Chapter 8 Eigenvalues and Eigenvectors", "8.1 Introduction", "8.2 Computing Eigenvalues and Eigenvectors", "8.3 Eigenspaces", "8.4 Diagonalization", "8.5 Powers of Matrices", "Linear Algebra for Engineering Fall 2024 Course Notes Required text provided on LEARN Yes", "Linear Algebra with Applications by Keith Nicholson Optional text provided on LEARN No", "The Linear Algebra for Engineering Fall 2024 Course Notes is the required text for this course, and is available on LEARN.", "The text Linear Algebra with Applications is an optional text also available on LEARN for those students looking for an alternate exposition of the material and/or additional problems to work on.", "Students looking for extra practice beyond the course notes are welcome to attempt problems in the corresponding sections of the optional textbook.", "Python Assignments: Throughout the term, there will be 5 equally weighted assignments where students will use python to execute some prewritten code in an effort to explore some larger-scale applications of linear algebra.", "If you find yourself in a situation where you are missing multiple assessments, then you are advised to contact both your instructor and the First Year Engineering Office to make sure you have the proper supports in place to succeed in this courses.", "To be clear - such websites are not allowed to be used for the completion of any part of the course MATH 115, and students are not permitted to share questions from the course anywhere.", "Generative AI: This course includes the independent development and practice of specific skills, such as computations, problem solving and proof writing.", "Library for research-based assignments"]}, {"course_id": 5, "course_code": "MATH 116", "course_name": "MATH116 - Calculus 1 for Engineering (0.50)", "term_name": "1A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["03:30PM - 04:20PM", "RCH 301", "RCH 301", "08:30AM - 09:20AM", "03:30PM - 04:20PM", "Monday, Friday -", "11:30AM - 12:20PM", "02:30PM - 03:20PM", "09:30AM - 10:20AM RCH 103", "11:30AM - 12:20PM RCH 103", "11:30AM - 12:20PM STC 0060", "02:30PM - 03:20PM", "02:30PM - 03:20PM", "10:30AM - 11:20AM RCH 101", "09:30AM - 10:20AM RCH 110", "03:30PM - 04:20PM", "07:00PM - 08:50PM", "RCH 204", "DWE 3516", "PHY 313", "02:30PM - 04:20PM DWE 3518", "08:30AM - 10:20AM RCH 204", "08:30AM - 10:20AM MC 4063", "08:30AM - 10:20AM MC 4060", "08:30AM - 10:20AM MC 4058", "02:30PM - 04:20PM MC 4060", "DWE 1515", "DWE 3522A", "Applications of the integral.", "Use trigonometric, exponential, and logarithmic functions to solve a variety of problems.", "Use differentiation to solve a variety of application problems including curve sketching, related rates, and optimization problems.", "Introduction and Review of Functions (Domain, Range, etc.)", "Compositions of Functions", "Inverses of Functions", "Odd and Even Functions, Transformations", "Piecewise and Heaviside Function", "Trigonometric and \"Inverse\" Trigonometric Functions", "Exponential and Logarithmic Functions", "Hyperbolic Trig Functions", "Limits", "Continuity", "§ 2.1-2.4", "Differentiation", "Implicit and Logarithmic Differentiation", "Curve Sketching Techniques", "Optimization Problems", "§ 4.2-4.8", "Linear Approximation, Differentials", "The Definite Integral", "Indefinite Integrals", "Integration by Substitution", "Integration by Parts", "In particular:"]}, {"course_id": 6, "course_code": "CHE 101", "course_name": "CHE101 - Chemical Engineering Concepts 2 (0.50)", "term_name": "1B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "CHE 101", "02:30PM - 03:20PM", "peter.angelo@uwaterloo.ca", "10:00AM - 11:20AM RCH 110", "08:30AM - 09:20AM", "Development of chemical process analysis skills.", "Introduction to single- and multi-phase physical equilibria.", "Material and energy balances in reactive and non-reactive systems.", "Introduction to investigation and technical communication through laboratory experiments illustrating the physical principles discussed.", "View requirements for CHE 101", "Incorporate material balances and fundamentals of chemistry into physical chemistry applications.", "Apply physical and chemical laws, rules, and approximations to model phase equilibrium in homogeneous, binary, and ternary systems.", "Describe operating processes for basic chemical processing equipment, including flash distillation and liquid-liquid extraction columns.", "Conduct steady state energy balances on mechanical, non-reactive, and reactive systems.", "Module & Chapter", "Introduction and Review", "Vapour pressure and saturation", "Module 2: Binary Systems", "Binary vapour-liquid, solid-liquid, and liquid-liquid equilibrium", "Miscibility and partitioning", "Module 3: Basic Energy Balances", "Energy and pressure", "Steady-state energy balances", "Mechanical and Bernoulli balances", "Sensible heat and latent heat", "Enthalpies of mixing and solution", "Enthalpies of formation and reaction", "Each week, excluding Midterm Week, a Concept Check question will be introduced in the first lecture session.", "Discussion", "To assist in clarifying and expanding upon topics discussed in class, students are expected to submit a Discussion post to a LEARN Dropbox at the end of each week.", "Each Assignment will include some open-ended aspects and involve some design decisions and rationale.", "Laboratory assessments will be specified by the Laboratory Instructor during the first laboratory information session in Week 1.", "Discussion", "Final Examination TBD", "Notice of Recording", "First-Year Office", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 7, "course_code": "CHE 161", "course_name": "CHE161 - Engineering Biology (0.50)", "term_name": "1B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["09:30AM - 10:20AM RCH 110", "08:30AM - 09:20AM", "Friday -", "Friday", "10:30AM - 12:20PM", "•Chemical Engineering", "•Office hours: 2.30 pm-3.30 pm Mondays, can also be scheduled upon email request", "Introduction to basic concepts of biochemistry and cell biology.", "Properties and functions of biopolymers.", "Elements of cell structure and diversity, and relationship of biochemistry with cell metabolism.", "View requirements for CHE 161", "1) Demonstrate a basic understanding of biochemistry, cell biology and molecular biology (1b)", "2) Converse at a fundamental level with scientist and engineers that use biology and biotechnology (1b)", "5) Identify societal, safety and ethical concerns surrounding biotechnology.", "Biomolecules", "1.1 Sugar and Polysaccharides", "1.2 Fatty acids and derived polymers", "1.3 Amino acid and Proteins", "1.4 Nucleotides and Nucleic acids", "2.1 Life definition and classification", "2.2 Cell structure and reproduction", "2.3 Bioproduction", "3.2 Sugar metabolism", "3.3 Fatty acid metabolism", "3.4 Protein metabolism", "3.5 Enzyme kinetics", "4.1 Central Dogma"]}, {"course_id": 8, "course_code": "CHE 181", "course_name": "CHE181 - Chemical Engineering Design Studio 2 (0.50)", "term_name": "1B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Chemical Engineering Design Studio 2 Winter 2025", "02:30PM - 03:20PM", "Gerard Agravante - gerard.agravante@uwaterloo.ca", "Development of chemical engineering analysis, investigation, design, and communication skills.", "Introduction to engineering measurement.", "Electric circuits, current, voltage and resistance, measurements, and signal transmission.", "Electrical safety.", "Sensor interfacing and data acquisition using software.", "Students undertake a term-long design project under the supervision of the instructor.", "View requirements for CHE 181", "We will be dedicating this hour to a suite of technical drawing tutorials.", "Studio", "• A breadboard", "• Eight male-to-male 6” jumper wires", "Produce and interpret technical drawings and figures.", "Identify components of and select appropriate measurement systems and sensors.", "Define performance characteristics and related terminology.", "Design electronic circuits to measure response of electronic sensors.", "Describe the operating principles behind common sensors.", "Calculate sensor response for common systems.", "Troubleshoot and diagnose technical problems.", "Create and accomplish things that are beyond your current skillset.", "Mar. 3 – Mar. 10 Dimensioned Drawing", "Studio", "Jan. 9 – Jan. 23 Basic Python-Arduino Program", "Feb. 13 – Mar. 6 RTD Installation and Validation", "Experimental Methods and Instrumentation for Chemical Engineers FREE electronic version available through the library No 0", "One short-term self-declaration", "Cannot be used for in-person Studio task such as the the symposium.", "One self-declaration of COVID-like symptoms", "Reason and dates of absence required for submission"]}, {"course_id": 9, "course_code": "MATH 118", "course_name": "MATH118 - Calculus 2 for Engineering (0.50)", "term_name": "1B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:30AM - 11:20AM RCH 110", "02:30PM - 03:20PM", "RCH 306", "09:30AM - 10:20AM RCH 105", "RCH 306", "10:30AM - 11:20AM RCH 103", "RCH 204", "02:30PM - 03:20PM", "02:30PM - 04:20PM MC 4060", "Monday -", "Monday", "Linear and separable first order differential equations, applications.", "Parametric curves and polar coordinates, arc length and area.", "Get experience in writing well-organized and readable mathematical solutions, so that you will be able to communicate mathematical or technical ideas.", "Select an appropriate integration technique and apply it to solve indefinite or definite integrals.", "Find a power series representation of a function and find a closed form for a function represented by a power series.", "Understand the formal definition of the limit of a sequence and use it to prove basic limits.", "Understand the principle of mathematical induction and use it to prove some mathematical statements.", "Integration by substitution (review)", "Integration by parts (review)", "Trigonometric integrals", "Trigonometric substitution and completing the square", "Partial fractions", "Numerical integration", "Error bounds for numerical integration", "Improper integrals", "First make up lecture occurs", "Separable DEs, linear first-order DEs", "Applications of DEs", "Sequences, limits of sequences", "Recursively-defined sequences, mathematical induction", "Appendix A", "Integral test, p-series", "Comparison tests", "Second make up lecture occurs", "-", "Winter reading week", "-", "Absolute vs. conditional convergence", "Ratio and root tests", "Estimating sums", "Power series", "Taylor and Maclaurin series", "Sums of power series", "Applications of series", "Parametric equations", "Polar coordinates, polar curves", "Area and arc length of polar curves", "In particular:"]}, {"course_id": 10, "course_code": "PHYS 115", "course_name": "PHYS115 - Mechanics (0.50)", "term_name": "1B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:50AM RCH 110", "08:30AM - 09:20AM", "09:30AM - 10:20AM RCH 105", "Name Role Email", "How to Email the Teaching Team", "See the document \"Guidance for Writing Emails to the Teaching Team\" on LEARN for email formatting tips and examples.", "Discuss strategies for solving problems.", "Please see “First-Year Engineering Tutors” and “Physics Tutorial Centre” below.", "Conservation of linear momentum, collisions, rotational kinematics and dynamics, conservation of angular momentum.", "Define and describe core concepts of classical mechanics (e.g., free fall, force, energy) and provide real-world examples to demonstrate their applications [KB, LL].", "Break down complex physical scenarios into their underlying principles, identifying relationships between forces, motion, and energy; for instance, by drawing free body diagrams [KB, PA].", "Section", "Units", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "TUT 103 & 104", "L1 and L2, Math Review 1-1 – 1.3, 2.1 – 2.3, 2.6 IQ0, TQ0 & TPS0 0, 1 / 0, 1 PE1 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "L3 and L4 2.4 – 2.5, 4.1 – 4.4 IQ1, TQ1 & TPS1 1, 2 / 1, 2 IQ0 & TQ0 (TUT 101 & 102) marks released @ 7 PM, PE2 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L3 and L4 2.4 – 2.5, 4.1 – 4.4 IQ1, TQ1 & TPS1 1, 2 / 1, 2 IQ0 & TQ0 (TUT 103 & 104) marks released @ 7 PM, PA2 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "L5 and L6 4.6 – 4.7, 5.1 IQ2, TQ2 & TPS2 2, 3 / 2, 3 IQ1 & TQ1 (TUT 101 & 102) marks released @ 7 PM, PA3 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L5 and L6 4.6 – 4.7, 5.1 IQ2, TQ2 & TPS2 2, 3 / 2, 3 IQ1 & TQ1 (TUT 103 & 104) marks released @ 7 PM, PA3 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "Applications of Newton's Laws 5.2 – 5.3 VQ7 4 / 4 -", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "TUT 103 & 104", "LEC 001 & 002", "Kinetic energy, Work and Kinetic energy 7.1 – 7.2 VQ10 5 / 5 -", "LEC 001 & 002", "LEC 001 & 002", "Potential Energy, Conservation of Mechanical Energy, Reading a Potential Energy Curve 8.1 – 8.3 VQ12 5 / 5 AS4 closed @ 7 PM, AS5 & PS5 released @ 7 PM", "T5", "TUT 101 & 102", "L10 to L12 7.1 – 7.6, 8.1 – 8.3 IQ4 TQ4 & TPS4 4, 5 / 4, 5 IQ3 & TQ3 (TUT 101 & 102) marks released @ 7 PM, PA5 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L10 to L12 7.1 – 7.6, 8.1 – 8.3 IQ4, TQ5 & TPS4 4, 5 / 4, 5 IQ3 & TQ3 (TUT 103 & 104) marks released @ 7 PM, PA5 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "Work done on a System by an External Force, Conservation of Energy 8.4 – 8.5 VQ13 6 / 6 -", "LEC 001 & 002", "T6", "TUT 101 & 102", "L13 and L14 8.4 – 8.5 IQ5, TQ5 & TPS5 5, 6 / 5, 6 IQ4 & TQ4 (TUT 101 & 102) marks released @ 7 PM, PA6 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L13 and L14 8.4 – 8.5 IQ5, TQ5 & TPS5 5, 6 / 5, 6 IQ4 & TQ4 (TUT 103 & 104) marks released @ 7 PM, PA6 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "Conservation of Linear Momentum, Elastic Collisions in One Dimension 9.5 – 9.6 VQ16 7 / 7 AS7 & PS7 released @ 7 PM", "TUT 101 & 102", "L15 and L16 9.1 – 9.6 IQ6 & TPS6 (L13 & L14) 6, 7 / 6, 7 IQ5 & TQ5 (TUT 101 & 102) marks released @ 7 PM, PA7 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L15 and L16 9.1 – 9.6 IQ6 & TPS6 (L13 & L14) 6, 7 / 6, 7 IQ5 & TQ6 (TUT 103 & 104) marks released @ 7 PM, PA7 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "Momentum and Kinetic Energy in Collisions,  9.7 – 9.8 VQ17 8 / 8 -", "LEC 001 & 002", "TUT 101 & 102", "L17 and L18 9.7 – 9.9 IQ7, TQ7 & TPS7 7, 8 / 7, 8 IQ6 & TQ6 (TUT 101 & 102) marks released @ 7 PM, PA8 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "LEC 001 & 002", "LEC 001 & 002", "T9", "TUT 101 & 102", "L19 and L20 10.1 – 10.7, 11.4 IQ8, TQ8 & TPS8 8, 9 / 8, 9 IQ7 & TQ7 (TUT 101 & 102) marks released @ 7 PM, PA9 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "L19 and L20 10.1 – 10.7, 11.4 IQ8, TQ8 & TPS8 8, 9 / 8, 9 IQ7 & TQ7 (TUT 103 & 104) marks released @ 7 PM, PA9 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "Work and Rotational Kinetic Energy 10.8 VQ22 10 / 10", "LEC 001 & 002", "TUT 101 & 102", "L21 to L23 11.5 – 11.9, 10.8 IQ9, TQ9 & TPS9 9, 10 / 9, 10 IQ8 & TQ8 (TUT 101 & 102) marks released @ 7 PM, PA10 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L21 to L23 11.5 – 11.9, 10.8 IQ9, TQ9 & TPS9 9, 10 / 9, 10 IQ8 & TQ8 (TUT 103 & 104) marks released @ 7 PM, PA10 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "L24 and L25 11.1 – 11.3, 12.1 – 12.2 IQ10, TQ10 & TPS10 10, 11 / 10, 11 IQ9 & TQ9 (TUT 101 & 102) marks released @ 7 PM, PA11 opened @ 4PM & closed @ 5PM", "14 - 2025/04/07 (Mon) - - - - IQ9 & TQ9 (TUT 103 & 104) marks released @ 7 PM, PA11 opened @ 4PM & closed @ 5PM", "Important Dates and Events in Winter 2025", "First Day of Classes Monday, January 6", "Resume Reviews Ongoing – E2 1772", "Yes -", "Yes -", "Yes -", "Marking Scheme A", "Weekly Group Progress Reports in Tutorial Sessions 3.5%", "Weekly Peer Evaluation in Tutorial Sessions 1.5%", "Weekly Team Progress Reports in Tutorial Sessions 3.5%", "Weekly Peer Evaluation in Tutorial Sessions 1.5", "As outlined below, your final mark incorporates both in-class and out-of-class activities, individual and teamwork, as well as test-based and non-test-based assessments.", "Only the first ten correct responses receive bonus marks.", "This rubric is adapted from a similar rubric in the PHYS 111 course, Fall 2022).", "Extraction of Physical Properties - Well-labeled (free-body) Diagram No physical properties extracted.", "All information represented on a well-labeled (free-body) diagram including coordinate systems, vectors.", "Manipulating Equations and Use of Numbers - Algebra and Calculations Incorrect or missing steps in algebra and numbers introduced prematurely.", "Equations manipulated satisfactorily but coordinates or numbers used incorrectly.", "Weekly Progress Reports in Tutorial Sessions", "Extraction of Physical Properties - Well-labeled (free-body) Diagram No physical properties extracted.", "Manipulating Equations and Use of Numbers - Algebra and Calculations Incorrect or missing steps in algebra and numbers introduced prematurely.", "Equations manipulated satisfactorily but coordinates or numbers used incorrectly.", "Weekly Peer Evaluation in Tutorial Sessions", "Aspect of team functioning Well below average Below average Average Above average Well above average", "Problem Solving Skills", "Level of Collaboration Allowed: Allowed – Team collaboration is required during tutorial sessions and strongly encouraged outside of them.", "Students complete at least the first two questions in teams during tutorials and submit team progress reports.", "Solutions for the remaining questions can be collaboratively discussed outside tutorials.", "I frequently monitor this channel and try to address your questions as much as I can.", "One short-term self-declaration", "Cannot be used for in-person LAB or STU", "One self-declaration of COVID-like symptoms", "Reason and dates of absence required for submission", "Discord", "The First Year Office", "The office supports you in establishing a strong academic foundation during your first year, which will help you throughout your undergraduate studies and prepare you for a successful career.", "First-Year Engineering Tutors", "Peer success coaching", "My learning skills evaluation is a self-reflection tool designed to help you assess your current learning strategies and identify areas for growth and improvement.", "Quick Tips and Resources", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Library for research-based assignments"]}, {"course_id": 11, "course_code": "COMMST 100", "course_name": "COMMST100 - Interpersonal Communication (0.50)", "term_name": "1B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["jclausen@uwaterloo.ca (please do not use the D2L email system)", "I monitor my email M-F, 9:00 am - 5:00 pm.", "Focuses on the one-to-one, face-to-face communication in both the personal and professional realms.", "Such topics as verbal and non-verbal interactions, listening, and the better management of interpersonal communication will be studied.", "In this course, we will work to understand more fully how we communicate (and are communicated to) in the world we live in and to develop the tools to research, apply, and practice key interpersonal communication concepts in our everyday lives.", "Students will be encouraged to identify, negotiate, and challenge existing communicative norms as they explore a range of interpersonal and intrapersonal issues that include culture, identity, and power.", "Understand the complexity of communication as a human process of shared meaning- making in the context of power, history, and culture", "Increase your capacity to recognize and enhance yours and others’ agency – the ability to make a difference in the world for yourself and others – and understand the implications of your communication behaviours for yourself and others", "Understand communication as a practice and improve your critical and creative communication competencies by developing your ability to use writing and other media of communication to create meaning", "This entails opportunities for student-directed inquiry, challenge and risk-taking, and reflection on your roles and responsibilities", "Reflect on your role in fostering the public good (the multifaceted well-being of individuals and groups), begin to imagine a better future, and make decisions in your communication that can transform the communities to which you belong", "Recognize diverse linguistic practices and modes of expression as resources for writers and speakers", "Introduction", "Read: Meaning as Co-Created", "Read: “Cultural and Historical Influences: Communication Competence in Context”", "Exceeds assignment guidelines; strong and consistently applied definition of audience and purpose; thoughtful and innovative adaptation of the subject to the audience’s needs; subject developed and organized at every level for listener comprehension; speaker uses language appropriately, effectively and even inventively; maintains relaxed, inviting delivery free of verbal fillers and distractions; cites sources appropriately both in spoken and written work; submits well prepared required materials.", "Your entries should be roughly two typewritten, double- spaced pages each although they can go slightly over.", "While the amount you write under each heading may change week to week, this format allows you to address each area regularly.", "Decide how often you will communicate and in what manner.", "Decide how you will divide the workload and handle conflicts.", "Handing in a clear contract will earn 5%.", "Your job will be to engage the class and apply what we are reading to people’s own opinions, experience, etc. Sign up for this assignment is on a first-come/first-served basis starting during week two of classes.", "Group Presenation 2: Final Presenation You and your group will create a fifteen-minute videotaped presentation exploring a problem in interpersonal communication and proposing a solution for that problem.", "This presentation will involve research into a specific issue related to interpersonal communication and creating good reasons for following your proposed solution.", "This course includes the independent development and practice of specific skills, such as self reflection, critical thinking skills and interpersonal communication.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 12, "course_code": "COMMST 223", "course_name": "COMMST223 - Public Speaking (0.50)", "term_name": "1B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["In the case of service interruptions to the LEARN system, please see the LEARN Service Interruption Policy https://uwaterloo.ca/secretariat-general-counsel/service-interruptions-online-learning-environment-guidelines", "A workshop course involving design and delivery of various kinds of speeches, and the development of organizational, vocal, listening, and critical skills.", "Apply speech communication concepts in designing and delivering public speeches and digital productions", "Understand and negotiate cultural assumptions and expectations in public address", "Foundations of a public speaking performance", "Your first speech: Informing about your language", "First speech workshop: a life story of the language I speak (voice, body, presence)", "First speech presentation 1", "First speech presentation 2", "Oct. 3: Read: Evaluating speeches critically (Zarefsky & Engels)", "First speech presentation 3", "Discussion and Introduction to Second Speech Assignment: Persuading a local audience", "(and Choosing your topic -CH 6 .Zarefsky & Engels)", "Your second speech: persuading a local audience", "(Ch 14 and Ch 16 -up until 16.5-, Zarefsky & Engels)", "Second Speech Development", "Exercise # 2: Describe a local situation and evaluate it as a problem for your peers - 90 sec. speech", "Mediated public speaking: Persuading a Digital Audience", "Read; Appendix B, Ch. 16, Zarefsky & Engels", "Development & Research of your project", "Nov. 26 &", "Second Speech: Persuading a Local Audience 30%", "Third Speech: Persuading a Digital Audience 30%", "First Speech: Informing about your language", "The goal of this speech is for you to inform your audience about how your mother tongue  background, individual experience, and culture impact your self-concept, language use, sense of audience perceptions, constraints stemming from communicative norms, and methods you employ to negotiate various rhetorical situations.", "Second Speech: Persuading a Local Audience", "Third Speech: Persuading a Digital Audience", "3 short speech excercises: 3.33% each for a total of 10%", "You should also write a few brief notes on why you chose each quotation.", "How does it relate to the class?", "The moderator is responsible for running the class in an efficient and creative manner: introducing speakers, organizing the discussions with the evaluators, initiating class comments, and generally making sure that the session runs smoothly and according to schedule.", "90-Second Short Speech Exercises  (3 total, marked for completion):", "These public speaking exercisesintroduce students to fundamental rhetorical concepts and strategies.", "Over the course of the semester, you will present three exercises as 90-second speeches in front of the class or in small groups.", "For the first and second major assignments of the term, you will offer and accept productive feedback and produce brief analyses of your peers’ speeches in two-page, double-spaced papers (one each for the first and second major speech rounds).", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 13, "course_code": "EMLS 101R", "course_name": "EMLS101R - Oral Communications for Academic Purposes (0.50)", "term_name": "1B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["& Location:", "Email:                         christa.schuller@uwaterloo.ca", "Designed specifically for students for whom English is not the first language, this course introduces group discussion strategies and presentation skills.", "A focus on pronunciation and vocabulary assists learners to better engage in conversations and listen to and deliver English presentations.", "This is achieved with the focus on gambits, voice quality, and speech clarity, which assist learners in developing strategies to better engage in discussions, and listen to and deliver English presentations in both remote and face-to-face contexts.", "Create and organize discussions and presentations", "Use a clear and appropriate format", "Develop relevant and well formatted materials (PowerPoint slides and discussion notes)", "Select effective introductions and conclusions to engage the audience", "Clearly express their ideas verbally and non-verbally", "Use communication gambits and signpost language effectively during discussions as well as individual and team presentations", "Use body language and space on stage to enhance the expression of ideas", "Listen for main ideas and details of some selected TED talks to form opinions on current socio-cultural, educational, environmental, and technological issues", "Critically evaluate various sources of information and then incorporate these sources in oral communication to create strong, academic support for their ideas", "Topics & Activities In-class Activities & Assignments Home                 Assignments", "Nonverbal communication- Importance of body language", "Introduction to group discussion assignment", "Analysis of non-verbal communication of selected presenters", "Small talk & non-verbal communication practice", "Main ideas and brief summary of TED Talks", "Question types for semi-formal discussion", "Discussion facilitation and gambits", "Non-verbal communication during a discussion", "Discussion skills", "Introduction to informative presentation introductions and conclusions", "Introduction to individual  presentations: thesis statement and format", "Chunking, pausing and focus words", "Writing thesis statements", "Pausing and focus words", "Effective PowerPoint slide design & APA citations", "Opening and closing a presentation", "Practice designing a slide and presenting its content", "Sample presentation", "Submitting PPT and Outline", "Submitting PPT and Outline", "Introduction to product review", "Inventions and innovations; product features", "Brainstorming for main ideas", "March 24 - 28", "Product review development – outline and slides", "Sample product review slides & outline", "Search for support materials, content development & slide design", "Product review presentations", "You will also need to watch the presentations of the other students and actively participate in the Q & A sessions following these presentations.", "A self-reflection on your preparation for the presentation, its delivery, and the Q & A will follow.", "A brief Q & A session will then follow.", "You will also need to watch the presentations of the other students and actively participate in the Q & A sessions following these presentations.", "These quizzes will cover the concepts related to academic and professional presentations, both individual and co-delivered, as well as discussions.", "Electronic Device Policy", "This course includes the independent development and practice of specific skills, such as collecting, synthesizing, and analyzing information; developing and practicing oral skills; critically evaluating and elaborating on ideas.", "Library for research-based assignments", "You can earn an EMLS Diploma by completing four EMLS courses and earning a cumulative average of 65%.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 14, "course_code": "EMLS 102R", "course_name": "EMLS102R - Clear Communication in English Writing (0.50)", "term_name": "1B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Clear Communication in English Writing Winter 2025", "K. Williams", "k33willi@uwaterloo.ca", "Designed specifically for students for whom English is not the first language, this course offers sentence-level instruction in grammar and idiom to teach students to produce, evaluate, and edit writing under time constraints.", "It emphasizes readability and error reduction in sentences and paragraphs.", "Identify sentence organization patterns and use them accurately and appropriately.", "Consider the importance of purpose and audience for specific writing tasks.", "In the case of emergency that may result in late submission, please contact the course instructor(s) to discuss potential extensions.", "You can earn an EMLS Diploma by completing four EMLS courses and earning a cumulative average of 65%.", "This course includes the independent development and practice of specific skills, such as writing sentences with grammatical accuracy and sentence structure, being able to edit writing for grammatical errors, developing and increasing vocabulary skills, and writing required organization patterns.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 15, "course_code": "EMLS 129R", "course_name": "EMLS129R - Written Academic English (0.50)", "term_name": "1B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Designed specifically for students for whom English is not the first language, this writing skills course provides instruction in grammar, sentence and paragraph structure, elements of composition, and academic essay writing, including a focus on theme, development of central ideas, exposition, and argumentation.", "The course provides instruction in grammatical accuracy, written fluency, and conventional essay patterns.", "This writing course is for students whose first language is not English.", "recognize and write conventional patterns of essay organization such as definition, compare-contrast and argument,", "use appropriate grammar structures to achieve accuracy in writing,", "draft and edit to achieve fluency in writing,", "Library for research-based assignments"]}, {"course_id": 16, "course_code": "ENGL 109", "course_name": "ENGL109 - Introduction to Academic Writing (0.50)", "term_name": "1B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Academic Writing Winter 2025", "View requirements for ENGL 109", "You will learn about different forms of academic writing, as well as the processes that great writers engage in to create their best work.", "Even programs like engineering, or accounting, or geography include major writing assignments, especially in upper years, in part because they recognize that careers in those fields require far more writing than students might expect.", "Because we value learning as a social activity, and thus recognize that writers and readers learn from one another, much of your work in English 109 will involve different kinds of collaboration with your peers.", "think critically and communicate effectively;", "These quick interactive elements provide opportunities to test your understanding of course concepts but are not graded.", "Standard of Work", "Every member of this course—instructors as well as students—has rights and responsibilities to ensure a pleasant and productive experience for all.", "Online Etiquette", "Exemptions from late penalties can only be given where there are significant extenuating circumstances.", "Intellectual property includes items such as:", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 18, "course_code": "CHE 200", "course_name": "CHE200 - Equilibrium Stage Operations (0.50)", "term_name": "2A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Equilibrium Stage Operations Winter 2025", "CHE 200", "RCH 211", "02:30PM - 03:20PM", "RCH 211", "03:30PM - 04:20PM", "RCH 211", "Equilibrium between phases; the equilibrium stage concept.", "Cascades of stages with and without reflux; group methods and stage-by-stage approaches; graphical solutions.", "View requirements for CHE 200", "Introduction to Equilibrium Stage Operations (Chapter 1)", "Importance or Relevance of Equilibrium Stage Operations", "Concept of an Equilibrium Stage and Different Types of Equilibrium Stages", "Cascading of Equilibrium Stages - Multistage contacting of two phases", "Industrial Applications of Equilibrium Staged Separation Processes", "Distillation- Definitions and Basic Concepts (Chapter 6)", "Multi-Stage Distillation (Chapter 9)", "Multi-Stage Distillation Column", "Analysis and Design of Multi-stage Distillation Columns", "Approximate Analytical Method of Designing Distillation Columns (Chapter 10)", "FUG method of estimating the number of equilibrium stages", "Single-stage Extraction", "Multi-Stage Extraction", "Single-Stage Leaching", "Multi-Stage Leaching", "explain the concepts of equilibrium and equilibrium stage [1b,1d]", "carry out steady state mass and energy balances around an equilibrium stage using different composition variables, such as mole fractions and mole ratios [1b,1d]", "analyze multistage countercurrent cascades for absorption and stripping-graphically and analytically (Kremser equations); determine the number of equilibrium stages needed for a given separation [", "prepare isobaric equilibrium diagrams such as T-x-y and y-x diagrams [", "analyze flash distillation graphically and analytically [", "apply McCabe-Thiele method to analyze multi-stage distillation columns; determine the number of equilibrium stages needed for a given separation; estimate the height and diameter of distillation columns [2a,2b,4a,4c", "use approximate method of designing multi-component distillation columns [2a,2b,4a,4c", "estimate overall and tray efficiencies of a distillation column [2a,2b]", "analyze batch distillation graphically and analytically (Rayleigh equation) without and with reflux [", "analyze multistage liquid-liquid extraction using triangular diagrams; determine the number of equilibrium stages needed for a given separation [2a,2b,4a,4c", "analyze and design single-stage and multi-stage solid-liquid leaching processes [2a,2b,4a,4c", "Introduction to Equilibrium Stage Operations (Chapter 1)", "Distillation- Definitions and Basic Concepts (Chapter 6)", "Multi-Stage Distillation (Chapter 9)", "Approximate Analytical Method of Designing Distillation Columns (Chapter 10)", "Introduction to Analysis and Design of Equilibrium Staged Separation Processes Second Edition, Central West Publishing, 2022, 546 pages.", "Pal, Rajinder, “Introduction to Analysis and Design of Equilibrium Staged Separation Processes”, Second Edition, Central West Publishing, 2022, 546 pages."]}, {"course_id": 19, "course_code": "CHE 220", "course_name": "CHE220 - Process Data Analysis (0.50)", "term_name": "2A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Process Data Analysis Winter 2025", "CHE 220", "CHE 220 001", "02:30PM - 03:20PM", "CHE 220 101", "03:30PM - 04:20PM", "Email: shahla@uwaterloo.ca", "Email: dgajera@uwaterloo.ca", "Introduction to statistical methods for analyzing and interpreting process data.", "Introduction to statistical ideas, probability theory, distribution theory, sampling theory, confidence intervals, and significance tests.", "Introduction to regression analysis.", "Introduction to design of experiments and statistical quality control.", "View requirements for CHE 220", "This course introduces statistical methods for analyzing and interpreting process data.", "Basic statistical", "design and statistical quality control.", "Define the role of statistics in engineering problem-solving and decision-making.", "Apply statistically rigorous methods of data collection and treatment.", "Construct and assess the adequacy of linear regression models for process variables.", "Module & Chapter Topics", "Introduction and Review", "Importance of statistical analysis", "Collection and presentation of data", "Basics of statistics in MS Excel", "Confidence limits and levels", "Process data monitoring and charting", "8-10 Module 4: Hypothesis Testing Single sample and two-sample comparison", "11-12 Module 5: Regression Simple linear regression", "Hypothesis testing on parameters", "Multiple linear regression", "Holicky, M. Introduction to Probability and Statistics for Engineers Available through UW Libraries No", "Assignments will be given every other week and must be submitted via Crowdmark within one week.", "Tests and Examinations:", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 20, "course_code": "CHE 230", "course_name": "CHE230 - Physical Chemistry 1 (0.50)", "term_name": "2A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 10:20AM RCH 211", "08:30AM - 09:20AM", "RCH 211", "CHE 230 101", "09:30AM - 10:20AM RCH 211", "Heats of chemical and physical changes.", "Systems of variable composition, chemical equilibrium.", "View requirements for CHE 230", "Understand the first and second laws of thermodynamics and apply them to solve problems involving state changes of systems undergoing different processes.", "Understand the concepts of internal energy, enthalpy, entropy and free energy, and know how to determine system state property changes for given processes.", "Understand the concepts of phase equilibrium and phase rule, and know how to apply them to material equilibrium.", "Understand the concepts of ideal and ideally dilute solutions, and apply them to determine colligative properties.", "January 9 to 16 Internal Energy, 1st law of thermodynamics, Introduction to Closed System & Equilibrium Chapter 2.2 to 2.5", "February 11 to 13 Phase Rule & PVT behaviour of Pure Substances Chapter 3.1, 3.2", "March 4 to 11 Mole Fraction, Phase Equilibrium, partial properties, Ideal Gas Law & Ideal Solution model", "Introduction to Chemical Engineering Thermodynamics, J.M Smith, Hendrick Van Ness, Michael Abbott and Mark Swihart Yes 90.00"]}, {"course_id": 21, "course_code": "CHE 290", "course_name": "CHE290 - Chemical Engineering Lab 1 (0.25)", "term_name": "2A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["CHE 290", "CHE 290 001", "08:30AM - 11:20AM DWE 2529", "DWE 2529", "A selection of computer and laboratory exercises refreshing and reinforcing material covered in the previous term.", "Topics may include basic microbiology and biotechnology, introductory physical chemistry, mass and energy balances.", "View requirements for CHE 290", "The experiments in this laboratory course are designed to reinforce theoretical concepts introduced in your first year of study (e.g. biology, energy balances, electrochemistry, thermodynamics) while providing an introduction to chemical process modeling using ASPEN Plus.", "Apply investigative strategies (i.e. scientific method) to derive conclusions from measured data specifically in topics of control of microbial growth, protein separation, bioassays, electrochemistry/reactions.", "Model a real-world industrial process using ASPEN PLUS/HYSYS simulation software.", "Identify sources of error and apply error propagation for chemical engineering experimental and process situations.", "Each lab group will be given control of their own sub-channel in the ChE290 W215 Team.", "Each member is tested for competency in Aseptic Technique before performing Gram Stain and susceptibility plates with live culture.", "Prep blank datasheets.", "Members separate to complete L2 data collection tasks.", "Should include error propagation when reporting results.", "If problems have not been resolved within the group by end of term, a distribution of effort evaluation may be used to adjust the portion of each member group report mark to reflect their effort.", "Blank datasheet prepared in advance.", "ATTENTION TO SAFETY PROTOCOL: you must wear eye protection, lab coat and closed-toe shoes during lab sessions.", "Several network computers are available in the lab.", "LAB REPORTS:  three different formats of reports required in this lab course: Data Analysis and Memo styles and a ASPEN Tutorial report.", "Guidelines for expected content in DA and Memo type of reports can be found in the lab manual.", "to evaluate the quality of the data", "to provide possible explanations of errors based on a critical review of the procedures", "A MEMO report is a full account of your observations and interpretations of experimental data in a proper technical report format that is both clear and concise.", "It includes an abstract to summarize the report content and key findings of the undertaken study.", "Be creative when writing your reports and investigate the theory further than given in the manual.", "*", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 22, "course_code": "CHEM 262", "course_name": "CHEM262 - Organic Chemistry for Engineering (0.50)", "term_name": "2A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "10:30AM - 12:20PM RCH 207", "10:30AM - 11:20AM RCH 207", "Bonding, structure, and nomenclature in organic chemistry.", "Be familiar with the language of organic chemistry including pushing electrons, conformational analysis and stereochemical nomenclature", "Have a good understanding of reactivity in organic chemistry with emphasis on structure-reactivity relationships", "Understand and predict specific reactivity patterns of some classes of organic compounds", "To appreciate the inherent logic in organic chemistry", "Week 3            Module 4: Acids and Bases", "Week 9            Module 11: Substitution-Elimination: Discerning the Differences", "Week 12          Modules 14 and 15: Alcohols and Oxiranes and Ethers", "Go to tophat.com and join course code 917480", "Course grade:your final grade will be the highest of the following grade calculations:", "Notice of Recording", "The VIF will be used to decide whether a student had a legitimate reason for missing the exam."]}, {"course_id": 23, "course_code": "CHEM 262L", "course_name": "CHEM262L - Organic Chemistry Laboratory for Engineering Students (0.25)", "term_name": "2A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 11:20AM ESC 104", "08:30AM - 11:20AM ESC 104", "Answers can be expected within 24 hours.", "Topics include acid-base chemistry, substitution reactions, liquid-liquid extraction, product isolation and purification.", "Be proficient with basic organic laboratory techniques including selecting proper glassware, measuring small and large quantities of solids and liquids, designing the setup required for simple synthetic reactions, filtration, and basic characterization.", "Understand and be able to design and execute a liquid-liquid extraction processes for the separation of ionizable acidic, ionizable basic, and non-ionizable (neutral) substances.", "Demonstrate independent thinking by answering questions in your own words, showing critical reflection beyond the initial description of observations and facts.", "Scheduling issues", "Fillable form online for Möbius support", "Laboratory performance marks will be given by the Teaching Assistants and Lab Instructor and averaged for each in-person lab period.", "This is not directly the case; we do expect students to need a lot of clarifications when working in the lab for the first time.", "Laboratory Worksheets and Reports", "Questions similar to the pre-laboratory quizzes and reports will be used, but may be modified to be multiple choice.", "General Policies", "Aside from LEARN, we will use various software to facilitate the delivery of the laboratory.", "Important note: Since the manual is printed months before delivery of the lab, we may need to make corrections during the term.", "All in-lab worksheets are completed individually but reports submitted on Crowdmark can be completed with your partner.", "Please be mindful of this and avoid missing your lab for unapproved reasons.", "Human rights must be centered in our pedagogical practice to ensure students feel safe and respected into our instructional spaces.", "We also acknowledge that speaking of underrepresented groups in Science is a misnomer and we should speak of historically excluded persons as Black, Indigenous, Queer and Persons of Colour have contributed to chemical research since the inception of the field."]}, {"course_id": 24, "course_code": "MATH 217", "course_name": "MATH217 - Calculus 3 for Chemical Engineering (0.50)", "term_name": "2A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["11:30AM - 12:20PM E2 1736", "10:30AM - 11:20AM E2 1736", "the \"soft skill\" of email communication is one you will use daily in your future roles as a professional engineer, and it is best to develop good email communication habits in university before entering the workforce).", "Amirhossein Dehghanizadeh: a8dehgha@uwaterloo.ca", "Vector fields, divergence and curl.", "Vector integral calculus: Green's theorem, the Divergence theorem and Stokes' theorem.", "Applications in engineering are emphasized.", "Jan. 13 - 17 Unit 2: Vector-valued and multivariable functions", "Feb. 10 - 14 Unit 5 Part II: Optimization continued", "Mar. 10 - 14 Unit 8: Vector fields and line integrals", "Mar. 31 - Apr. 4 Unit 11: Gradient vector fields", "If the grader cannot read or make sense of your work, your mark may be reduced as a result.", "help you study for exams because the explanations are in your own words,", "develop technical communication skills that will serve you in your future roles as a professional engineer.", "A grade of INC will be considered on a case-by-case basis.", "Human readers may be used to monitor plagiarism."]}, {"course_id": 25, "course_code": "CHE 211", "course_name": "CHE211 - Fluid Mechanics (0.50)", "term_name": "2B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Fluid Mechanics Fall 2024", "CHE 211", "CHE 211 001", "02:30PM - 03:20PM E2 1732", "CHE 211 101", "03:30PM - 04:20PM E2 1732", "Email: s72patel@uwaterloo.ca", "CHE 211:", "Conservation laws for mass, momentum and mechanical energy.", "Flow of fluids in conduits.", "View requirements for CHE 211", "Fluid Mechanics - Statics and Dynamics; Why study fluid mechanics (practical significance)?", "Principle of hydrostatic equilibrium; Pressure variation throughout a static fluid; Applications of fluid statics - Barometric equation; manometers; Hydrostatic equilibrium in a centrifugal field; continuous gravity and centrifugal separators.", "3. INTRODUCTION TO FLUID FLOW (Basic Concepts)", "Influence of solid boundaries on fluid flow; No-slip boundary condition; Boundary layer; Boundary layer in flow over a thin plate; Boundary layer in pipe flow.", "Definition of viscosity (Newton's law of viscosity); Dependence of viscosity on temperature and pressure; Kinematic viscosity; Ideal fluid and potential flow; Introduction to non-Newtonian fluids.", "Laminar and turbulent flows (Reynolds experiment); Reynolds number; Generalized Reynolds number; Turbulence in boundary layers.", "Microscopic versus Macroscopic balances", "Macroscopic Momentum Balance; Momentum correction factor.", "Macroscopic Mechanical Energy Balance for ideal frictionless fluids (Bernoulli equation); Bernoulli equation for viscous fluids; Kinetic energy correction factor; Pump work in Bernoulli equation.", "Shear-stress distribution in a cylindrical tube; Friction factor.", "Laminar flow in pipes; velocity distribution for Newtonian fluids; Maximum velocity; Average velocity; Hagen-Poiseuille Law; Reynolds number-friction factor law; Velocity distribution for non-Newtonian fluids.", "Turbulent flow in pipes; Velocity distribution for Newtonian fluids; Reynolds number-friction factor law for smooth tubes; Friction factors for rough pipes; Colebrook's equation; Reynolds number-friction factor law for non-Newtonian fluids (Dodge-Metzner equation).", "Flow in non-circular pipes; Concept of hydraulic diameter; Friction factor relations.", "Friction loss in sudden expansion and sudden contraction of cross section; Effect of fittings and valves on friction loss.", "Fluidization; conditions for fluidization; Minimum fluidization velocity; Types of fluidizations (particulate fluidization versus bubbling fluidization); Expansion of fluidized beds - particulate fluidization and bubbling fluidization; Applications of fluidization.", "Continuity Equation; Navier-Stokes Equation", "Applications of Equations of Motion", "Demonstrate an understanding of the fundamental concepts of statics and dynamics of fluids [", "Apply the principles of fluid statics to determine pressure distribution, net force, and moments in a static fluid.", "Use the principles of fluid statics to analyze and design manometers, gravity separators and centrifugal separators for two-phase dispersions [1d,2a,2b].", "Use these principles along with the constitutive laws to analyze flows of Newtonian and non-Newtonian fluids in pipes in terms of velocity distribution, shear stress distribution and pressure distribution [1d,2a,2b]", "Estimate pumping energy requirements for flows in practical pipeline systems making use of the Engineering Bernoulli Equation [1d,2a,2b].", "Analyze filtration and fluidization", "Demonstrate a good understanding of the metering of fluids using devices such as orifice and venturi meters and pitot tubes [", "Simplify and solve fluid flow problems using partial differential equations of motion [1d,2a,2b].", "3. INTRODUCTION TO FLUID FLOW (Basic Concepts)", "Total"]}, {"course_id": 26, "course_code": "CHE 225", "course_name": "CHE225 - Strategies for Process Improvement and Product Development (0.50)", "term_name": "2B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Strategies for Process Improvement and Product Development Fall 2024", "08:30AM - 10:20AM RCH 101", "02:30PM - 03:20PM", "RCH 307", "03:30PM - 04:20PM", "RCH 307", "Material includes regression analysis for linear and nonlinear models, analysis of variance, statistical inference, single and multiple comparisons, and an introduction to the design of experiments including single factor designs, multifactor designs, response surface methods, d-optimality (with empirical and mechanistic models), and the analysis of undesigned data.", "Applications to process improvement, product development, and research problems will be explored.", "Use of statistical analysis software to apply these techniques.", "CHE 225: View requirements for CHE 225", "CHE 425: View requirements for CHE 425", "The course will discuss the role of statistical design of experiments (and subsequent data analysis) for process/recipe improvement and product development (modeling, process troubleshooting and steps towards optimization).", "Estimate confidence and prediction intervals and construct ANOVA tables (variance decomposition) in both regression and design of experiments situations.", "Be fluent with advanced linear regression situations (correlation, prediction, analysis of residuals, model comparisons, model diagnostic checks); joint confidence regions to describe parameter uncertainty, design of experiments using D-optimality and other related optimal measures.", "Design single factor experiments: data analysis, multiple comparisons, comparison-wise vs experiment-wise error, with and without blocking of (lurking) stochastic variables.", "Design multifactor experiments: emphasis on 2-level full and fractional factorial designs, assessing significance of factor and factor interaction effects, confounding of effects, benefits of orthogonal designs, estimation of process error, selection of best design fraction, screening designs to generate process information.", "Weeks 1, 2 Review of confidence Intervals and hypothesis testing", "Week 3 Linear regression with matrix calculus; analysis of variance and analysis of residuals; emphasis on regression diagnostics Assignment 1 is due Sept. 18", "Design and analysis of single factor experiments", "Randomization; replication; multiple comparisons", "Design and analysis of single factor experiments with blocking", "Emphasis on blocking (variance reduction techniques); paired comparisons; multiple comparisons; special metrics", "Two-level full factorial experiments and related models", "Design and Analysis of Experiments (8th, 9th or 10th edition), Wiley optional No", "How to Succeed: The first step in doing well in this course is to realize that statistics is not a subfield of mathematics but is a distinct discipline.", "Statistics evolved from the need to systematically combine concepts from philosophy, the sciences, and mathematics in order to construct a coherent methodology for describing phenomena in the presence of random variation.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 27, "course_code": "CHE 231", "course_name": "CHE231 - Physical Chemistry 2 (0.50)", "term_name": "2B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["02:30PM - 03:20PM", "03:30PM - 04:20PM", "Appointment may be made via email for one-to-one assistance.", "Thermodynamics: ideal solutions; non-ideal solutions, non-electrolytic and electrolytic solutions, phase equilibrium and phase diagrams, reaction equilibrium.", "View requirements for CHE 231", "Understand partial molar properties of solutions and thermodynamics of mixing and apply these concepts to processes involving non-ideal solutions.", "Understand the concepts of ideal and ideally dilute solutions and apply them to problems on gas-liquid and liquid-liquid separations based on solubility differences.", "Know the important features of phase diagrams of binary systems and be able to construct two-component phase diagrams from thermodynamic information provided.", "Understand phase diagrams of gas-liquid, liquid-liquid, solid-liquid and solid-solid systems.", "Understand concepts of surface chemistry (e.g., interfacial energy, capillarity, adsorption) and apply them to solving surface phenomena problems.", "Understand concepts of chemical kinetics and apply them to reaction rate problems.", "Week 1: Introduction to ChE 231 & Review of fundamental thermodynamic", "Week 4: Two-component Phase diagram: Miscibility of liquid and solid solutions", "Week 5: Partial and complete miscibility; Compound formation with congruent & incongruent melting", "Week 7: Rational system & Practical system for non-ideal solutions", "Week 9: Surface chemistry: Interfacial tension & Properties of small particles", "Week 11: Reaction kinetics: Reaction rates and rate laws", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 28, "course_code": "CHE 241", "course_name": "CHE241 - Materials Science and Engineering (0.50)", "term_name": "2B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Materials Science and Engineering Fall 2024", "CHE 241", "CHE 241 001", "10:30AM - 12:20PM DWE 3522", "H. Shahsavan", "10:30AM - 11:20AM MC 4060", "CHE 241 101", "11:30AM - 12:20PM MC 4060", "H. Shahsavan", "Prof. Hamed Shahsavan", "E-mail: hshahsav@uwaterloo.ca", "E-mail: agmessele@uwaterloo.ca", "Processing and concepts of engineering design of materials.", "View requirements for CHE 241", "Demonstrate understanding on atomic and intermolecular interactions and use that knowledge to develop an understanding of materials microstructure.", "Understand, explain and calculate basic/fundamental mechanical, thermal and electrical, and magnetic properties in solids.", "Describe phase diagrams and properties in solids and calculate phase composition important to optimize manufacturing conditions.", "Tentative course content: We will go over selected sections of the following chapters in the textbook.", "Introduction (Chapter 1)", "Electrical Properties (Chapter 18 )", "Optical Properties (Chapter 21)", "Applications and processing of metal alloys (Chapter 11)", "Applications and processing of ceramics (Chapter 13)", "More information about this will be provided in the first session of the class and on LEARN.", "There will be two categories of topics to choose from, on a first-come-first-serve basis:", "Topics related to a certain class of materials or concepts related to materials science.", "➢ All instructions, expectations, templates, and rubrics for marking deliverables for delivering these reports will be provided in UW-LEARN.", "The deadline for uploading the presentation slides to UW-LEARN is November 25th.", "The tentative time slot for the oral presentation can be found in the course calendar.", "Monopolizing classroom discussions", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 29, "course_code": "CHE 291", "course_name": "CHE291 - Chemical Engineering Lab 2 (0.25)", "term_name": "2B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["09:30AM -", "12:20PM DWE 2529", "09:30AM -", "12:20PM DWE 2529", "A selection of computer and laboratory exercises refreshing and reinforcing material covered in the previous term.", "Topics may include physical chemistry, design of experiments and statistics, and equilibrium stage operations.", "View requirements for CHE 291", "Labs cover topics in physical chemistry (ChE100/101/230/231) and data analysis (ChE220) and connect to concepts from equilibrium stage processes (ChE200) and fluid mechanics (ChE211).", "Computer tutorials are designed to extend your PYTHON programming skills (ChE120) with assignments related to numerical data fitting and thermodynamic modeling of multicomponent systems that will be useful for future lab data analysis.", "Analyze experimental results and fit empirically-derived data to theoretical models in the following topics: (I) chemical thermodynamics, (ii) fluid mechanics, (iii) equilibrium stage operations (2b, 2c,3b, 3c)", "Propose experimental objectives and control parameters (3a)", "Work successfully in a team (6) and effectively communicate findings in technical reports (3a,3b,6a,6b,7b,7c,12a,12b)", "Identify sources of error and apply error propagation for chemical engineering experimental and process situations (2c)", "Each lab group will be given control of their own sub-channel in the ChE291 F24 Team.", "Design and run product formulation/temperature effect tests.", "Submit raw data and highlighted calculations to in-lab dropbox by end of day after lab.", "Plot equilibrium curve for system.", "Submit highlighted calculations to in-lab dropbox by end of day after lab", "LAB 3 VLE Diagrams", "Decide task assignments.", "Group submits proposed mixture volumes for Parts A & B.  Contact Jennifer Moll to schedule mixture prep.", "Collect data for Parts A thru C.  Submit plot of observed ternary diagram to in-lab dropbox by end of day after lab", "In-Class Exercise", "PYTHON assignments will be an extension of Python programming from ChE120 focusing on applying Python library functions to engineering problem-solving, data visualization and presentation of results.", "If problems have not been resolved within the group by end of term, a distribution of effort evaluation may be used to adjust the portion of each member group report mark to reflect their effort.", "Full mark earned for completion before start of scheduled lab session.", "ATTENTION TO SAFETY PROTOCOL: you must wear eye protection, lab coat and closed-toe shoes during lab sessions.", "LAB REPORTS:  three different formats of reports required in this lab course: Data Analysis and Memo styles and a Python Tutorial report.", "Guidelines for expected content in DA and Memo type of reports can be found in the lab manual.", "to evaluate the quality of the data", "to provide possible explanations of errors based on a critical review of the procedures", "A MEMO report is a full account of your observations and interpretations of experimental data in a proper technical report format that is both clear and concise.", "It includes an abstract to summarize the report content and key findings of the undertaken study.", "Be creative when writing your reports and investigate the theory further than given in the manual.", "*", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 30, "course_code": "MATH 218", "course_name": "MATH218 - Differential Equations for Engineers (0.50)", "term_name": "2B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Differential Equations for Engineers Spring 2024", "10:30AM - 12:20PM MC 2038", "10:30AM - 11:20AM MC 2038", "First order equations, second order linear equations with constant coefficients, series solutions, the Laplace transform method, systems of linear differential equations.", "Applications in engineering are emphasized.", "convert various real-world physical scenarios to common differential equations and systems of DEs (e.g. Newton's law of cooling, mixing tanks, oscillators).", "navigate new solution techniques often based on unusual substitutions.", "describe theoretical concepts with a math or engineering emphasis (e.g. existence, uniqueness, transfer functions, resonance, unit impulse).", "Differential Equations for Engineers, Course Notes for Math 218 by J.Wainwright and J. West Main text Yes", "Students should attempt all assigned questions, but we may decide to only mark a subset of questions."]}, {"course_id": 31, "course_code": "CHE 312", "course_name": "CHE312 - Mathematics of Heat and Mass Transfer (0.50)", "term_name": "3A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Mathematics of Heat and Mass Transfer Winter 2025", "CHE 312", "CHE 312 001", "10:30AM - 12:20PM DWE 3516", "E. Boghaert", "10:30AM - 11:20AM DWE 3516", "CHE 312 101", "11:30AM - 12:20PM DWE 3516", "E. Boghaert", "Eline Boghaert (eline.boghaert@uwaterloo.ca)", "Vector form of the microscopic thermal energy balance for solids and incompressible fluids.", "Mass and heat transfer models leading to ordinary differential equation problems in Cartesian, cylindrical and spherical geometries; types of boundary conditions.", "Bessel functions.", "Analytical solution of linear partial differential equations: combination of variables, separation of variables and Sturm-Liouville theory, Laplace transform.", "Mass and heat transfer models leading to linear partial differential equations: 1D transient diffusion and conduction in Cartesian, cylindrical and spherical geometries; steady-state 2D conduction and diffusion.", "View requirements for CHE 312", "Create simple mathematical models of heat and mass transport on the basis of justifiable assumptions and your understanding of the physical situation (i.e. modes of transport, geometry, boundary and initial conditions, etc.)", "Develop analytical solutions to these models [", "Apply these solutions to quantify heat and mass transport rates [", "2b", "Critique the performance of these models [", "Work in a team to model and design a solution to a heat transfer problem of interest [2b, 4a, 4b, 4c].", "Write a technical report describing a model developed to describe a heat transfer problem of interest [", "7b", "Note numbers in brackets refer to the related chapters in the recommended textbook.", "Develop and solve one-dimensional steady state heat transfer models.", "Develop and solve one-dimensional steady state heat transfer models.", "Develop and solve one-dimensional steady state mass transfer models.", "Develop and solve two-dimensional steady state mass transfer models.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 32, "course_code": "CHE 314", "course_name": "CHE314 - Chemical Reaction Engineering (0.50)", "term_name": "3A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["CHE 314", "CHE 314 001", "03:30PM - 05:20PM", "03:30PM - 04:20PM", "CHE 314 101", "04:30PM - 05:20PM", "Multiple reactions in reactor networks.", "View requirements for CHE 314", "This course applies the concepts of reaction stoichiometry and rate laws combined with the concepts of mass and energy balances to the analysis of chemical reactors.", "This includes derivation of rate expressions and design of chemical reactors via synthesis of chemical kinetics with mass and energy balances.", "Demonstrate competence in the fundamental concepts of Chemical Reaction Engineering.", "Apply these concepts to design and analysis of basic isothermal and non-isothermal reactors.", "Design and analyze chemical reactors under steady state and transient operation.", "Week 1: Introduction, Basic Principles & Reaction Kinetics", "Course structure, basic principles, rate laws, and catalytic reactions", "Week 2: Ideal Reactors & Multiple Reactors", "Week 3: Stoichiometry & Isothermal Reactor Design", "Rate expressions in terms of conversion.", "Week 4: Pressure drop & Transient Reactor Design", "Batch reactor & CSTR startup.", "Week 5: Non-Isothermal Reactor Design", "General energy balance.", "Week 6: Non-Adiabatic Reactor Design", "Boundary layer diffusion & external resistance.", "Literature survey, reactor design, and model definition", "Numerical solution & parameter sensitivity analysis.", "Final report preparation & submission", "Deadlines & Examination Dates:"]}, {"course_id": 33, "course_code": "CHE 322", "course_name": "CHE322 - Numerical Methods for Process Analysis and Design (0.50)", "term_name": "3A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Numerical Methods for Process Analysis and Design Winter 2025", "CHE 322", "CHE 322 001", "DWE 2529", "02:30PM - 03:20PM", "DWE 2529", "CHE 322 101", "03:30PM - 04:20PM", "DWE 2529", "Email: pulsipher@uwaterloo.ca", "Email: shayesteh.dolatabadi@uwaterloo.ca", "CHE 322:", "Systems of linear and non-linear algebraic equations; polynomial and spline interpolation; numerical differentiation and integration; numerical solution of initial value and boundary value ordinary differential equation problems: accuracy and stability, step size control and stiffness; finite differences for the numerical solution of elliptic and parabolic partial differential equations: method of lines, explicit vs. implicit finite-difference methods; introduction to the finite element method (optional).", "View requirements for CHE 322", "Describe mathematical algorithms for a range of common problems of engineering interest (including root finding, systems of simultaneous equations, interpolation, differentiation and integration).", "Describe related numerical concepts, such as types of error, stability, and convergence.", "Use numerical methods to solve chemical engineering design problems with simple python programs and evaluate the output of the program (including debugging).", "3 Systems of equations", "5 Integration", "8 Ordinary differential equations", "9 Partial differential equations (elliptical equations)", "11 Partial differential equations", "Practical Programming: An Introduction to Computer Science Using Python 3.6 (2016) O'Reilly and Associates, Inc Available https://ocul-wtl.primo.exlibrisgroup.com/permalink/01OCUL_WTL/vk29fk/alma999986579775105162", "Numerical Methods", "Python Programming And Numerical Methods: A Guide For Engineers And Scientists Available https://pythonnumericalmethods.berkeley.edu/notebooks/Index.html No 0", "Fun reading!", "This course includes the independent development and practice of specific skills, such as computational solutions to engineering problems.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 34, "course_code": "CHE 330", "course_name": "CHE330 - Chemical Engineering Thermodynamics (0.50)", "term_name": "3A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["CHE 330", "01:30PM - 03:20PM", "CHE 330 101", "02:30PM - 03:20PM", "Appointment may be made via email for one-to-one assistance.", "Review of fundamentals, including 2nd law and concepts of equilibrium, phase and reaction equilibria, fugacity, exergy.", "Examples chosen from: fluid flow; power generation; refrigeration; air conditioning and water cooling; liquefaction of gases; equilibria in complex chemical reactions and separation processes; surface phenomena; electrochemical reactions; biological processes.", "View requirements for CHE 330", "Understand the P-V-T relations of pure substances, and know how to determine volumetric properties of pure fluids using equations of state and generalized correlations.", "Understand the concepts of sensible heat, latent heat and standard heat of reaction, and know how to apply them to determining the heat effects of industrially important reactions.", "Understand the concepts of power generation and refrigeration/liquifaction, and apply them to various operating cycles.", "Know how the reaction equilibrium constant is related to standard Gibbs energy of the reaction and be able to determine the composition of the reaction mixture at reaction equilibrium.", "Introduction to ChE thermodynamics", "Review of basic concepts", "Volumetric properties of pure fluids", "Heat effects", "First, second and third laws of thermodynamics", "Thermodynamic properties of fluids", "Production of power from heat", "Refrigeration and liquefaction", "Solution thermodynamics", "Vapor-liquid equilibria", "Textbook purchase/subscription options & prices can be found from W Store: https://wstore.uwaterloo.ca/pages/course-materials"]}, {"course_id": 35, "course_code": "CHE 390", "course_name": "CHE390 - Chemical Engineering Lab 3 (0.50)", "term_name": "3A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["CHE 390", "CHE 390 001", "DWE 2529", "09:30AM -", "12:20PM DWE 2529", "Email: m78zhang@uwaterloo.ca", "Email", "A selection of computer and laboratory exercises, and project-based investigations, refreshing and reinforcing material covered in the previous term.", "Topics may include fluid mechanics, physical chemistry and kinetics, materials properties, and testing.", "View requirements for CHE 390", "ChE 390 Chemical Engineering Laboratory 3 involves the experimental and numerical studies of core chemical engineering subjects.", "The primary objective of this course is to reinforce the understanding and practical applications of chemical engineering theories and concepts from the lecture courses through hands-on experiments with pilot-scale unit operations.", "The laboratory course consists of the following five laboratories:", "A1", "Scale-up and Optimization of Mechanically Agitated Bioreactors", "DWE 1520", "B1", "DWE 1514", "B2", "Design and Calibration of a Flow Meter for Distillation Column", "DWE 1513", "DWE 1513", "DWE 1513", "Conduct experimental investigations of ChE fundamentals and process problems by appropriately selecting experimental methods and procedures, critically analyzing and interpreting experimental results [", "Apply modern engineering tools (online data acquisition and control, numerical computations) and problem-solving skills to solve the practical ChE experimental and process problems and reach valid conclusions [2c, 3c, 4c, 5a,5c].", "Communicate clearly and effectively in oral, written, and/or visual form through working in a lab team and writing technical reports [", "6a", "E1", "E3", "E2", "E1", "E3", "B2", "E2", "E2", "E3", "E1", "E2", "E3", "A1", "E1", "E3", "E2", "B1", "E1", "E3", "E2", "A1", "E1", "E1", "E3", "B1", "E2", "E1", "E3", "B1", "E2", "E2", "E3", "B1", "E1", "E2", "E3", "A1", "E1", "E1", "E3", "E2", "E1", "E3", "A1", "E2", "E2", "E3", "E1", "E2", "E3", "E1", "E3 and E4: Individual In-Class Exercise and group partial Assignment and Report", "Inappropriate academic behaviors and misconducts such as plagiarism, cheating, copying and sharing will be strongly prohibited for this laboratory course, and can result in serious consequences.", "Generative AI in ChE 390", "The use of GenAI needs to be acknowledged in terms of where and how the GenAI is used as a learning tool in the lab submissions.", "Laboratory Safety AND Regulations", "Any unsafe practice and unprofessional conduct in the lab session will result in a deduction of marks.", "A serious violation of any of the laboratory safety rules may result in an expulsion from the in-person lab session."]}, {"course_id": 36, "course_code": "MSE 261", "course_name": "MSE261 - Engineering Economics: Financial Management for Engineers (0.50)", "term_name": "3A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Economics: Financial Management for Engineers Winter 2025", "10:30AM -", "12:20PM RCH 306", "S. Mortazavian Farsani", "10:30AM - 11:20AM RCH 306", "Depreciation models and asset replacement analysis.", "View requirements for MSE 261", "Engineers are often required by society to make responsible decisions on complex issues that have financial, economic, political and environmental elements.", "This course presents engineering economics as a key part of an engineer’s decision-making mandate.", "Engineering Economics focuses on basic principles and applications of economic decision-making between alternatives encountered in engineering systems projects.", "Apply basic financial calculations, useful in personal life and business [", "4. Recognize the impact of inflation and taxation in making engineering economics decisions [11b]", "Analyze the public centered projects by their costs and benefits (dis-benefits) to society and environment [9a, 9b, 11b]", "Understand and analyze the components of financial statements and use them in investment decisions and preparing business plans [1c, 11b]", "The course will be dynamic and hence, the weekly schedule provided in this document is tentative and subject to slight changes in order to adapt to the needs and conditions the class may face.", "Week of", "Introduction", "Cash Flow Analysis", "-", "Replacement Analysis", "Inflation", "Public Sector Decision Making", "Introduction to Project Management", "Engineering Economics: Financial Decision Making for Engineers (7th Edition).", "Engineering Economic Analysis (4th Canadian Edition).", "Quizzes are non-cumulative while midterm and final exams are cumulative in the sense that final exam covers whatever covered after the midterm content.", "In case of any technical issues uploading the files, please email the TAs right away.", "All assessments will be also submitted online in that case.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 37, "course_code": "CHE 313", "course_name": "CHE313 - Applications of Heat and Mass Transfer (0.50)", "term_name": "3B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Applications of Heat and Mass Transfer Winter 2025", "CHE 313", "CHE 313 001", "08:30AM - 10:20AM E6 2024", "08:30AM - 09:20AM", "CHE 313 101", "Danny Kang", "CHE 313:", "Analysis of convective heat transfer in external flows using the boundary layer approach.", "Analysis of convective heat transfer in internal flows.", "Empirical correlations for convective heat transfer.", "Empirical correlations for convective mass transfer.", "Design of continuous differential contactors for absorption/stripping, distillation and liquid-liquid extraction.", "View requirements for CHE 313", "Heat Diffusion Equation", "Introduction to Convective Heat Transfer", "Rate Equation for Convective Heat Transfer", "Analysis of Convective Heat Transfer", "Basic Concepts", "Analysis of Convective Heat Transfer in External Flows; Equations for Heat Transfer Coefficient", "Analysis of Convective Heat Transfer in Internal Flows; Equations for Heat Transfer Coefficient", "Introduction to Convective Mass Transfer", "Analysis of Convective Mass Transfer", "Basic Concepts", "Analysis of Convective Mass Transfer in External Flows; Equations for Mass Transfer Coefficient", "Analysis of Convective Mass Transfer in Internal Flows; Equations for Mass Transfer Coefficient", "Inter-phase Mass Transfer", "Design of Heat Exchangers and Mass Transfer Equipment", "Double Pipe Heat Exchangers", "Shell and Tube Heat Exchangers", "Boiling and Condensation", "Develop insulation systems to minimize heat losses [2a,2b]", "Select and apply appropriate convective heat transfer coefficient correlations to internal and external flows [", "Understand and apply the principles of mass transfer in a stationary medium and in a moving fluid [1c,1d]", "Select and apply appropriate convective mass transfer coefficient correlations to internal and external flows [", "Design double pipe heat exchangers [", "Design shell-and-tube heat exchangers [", "Design packed bed columns for mass transfer – estimate height and diameter of columns [2a,2b,4a]", "Estimate heat transfer in fluids undergoing phase change – Boiling and Condensation [", "Understand and apply the concepts of radiative heat transfer to relevant problems [1c,1d]", "Appreciate analogy between heat, mass, and momentum transfer [1c,1d]", "The numbers in brackets refer to program indicators defined by the Faculty of Engineering to assess the twelve CEAB defined graduate attributes (https://uwaterloo/engineering/graduate-attributes)", "Introduction to Convective Heat Transfer", "Analysis of Convective Heat Transfer", "Introduction to Convective Mass Transfer", "Analysis of Convective Mass Transfer", "Inter-phase Mass Transfer", "Design of Heat Exchangers and Mass Transfer Equipment", "Boiling and Condensation", "Total"]}, {"course_id": 38, "course_code": "CHE 331", "course_name": "CHE331 - Electrochemical Engineering (0.50)", "term_name": "3B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electrochemical Engineering Winter 2025", "CHE 331", "01:30PM - 03:20PM", "CHE 331 101", "Topics and applications of electrochemistry and electrochemical engineering.", "Thermodynamic and kinetic aspects of corrosion.", "Electrochemical energy conversion and storage.", "View requirements for CHE 331", "Extend chemical thermodynamics to electrochemical systems.", "Use thermodynamics to predict when a reaction can happen and to describe the activation overpotential of electrokinetic processes.", "Design electrochemical cells and reactors for electrolysis and galvanic processes under given conditions.", "Design and assess corrosion mitigation strategy to extend the lifetime of materials/parts.", "cells, Faraday's law ,current efficiency and electrochemical CSTRs 5-7", "10   8 Current and next-generation battery technologies 19-20", "There final quiz will be during the examination period (April 8th to 25th)", "The most useful textbook in the context of learning fundamental electrochemistry is Bard & Faulkner, Electrochemical Methods: Fundamentals and Applications and also, Electrochemical Science and Technology by Oldham, Myland and Bond was used as a reference for part of the lecture material.", "IMPORTANT:   You cannot fail quiz component and still be given a passing mark in the course.", "Intellectual property includes items such as:", "Graduate Attribute Program Indicators", "A knowledge base for engineering: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "1a Demonstrate understanding of concepts in mathematics.", "1b Demonstrate understanding of concepts in natural science.", "1c Demonstrate understanding of engineering fundamentals.", "1d Demonstrate understanding of specialized engineering knowledge.", "2. Problem Analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "3a Create investigative studies of complex engineering problems.", "3b Gather information from relevant sources to address complex engineering problems.", "4. Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "4a Define design requirements and specifications for complex, open-ended engineering problems.", "4b Critically evaluate and compare design choices.", "7. Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "8a Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Impact of Engineering: An ability to analyze social and environmental aspects of engineering activities.", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "10a Identify ethical and unethical behavior in professional situations.", "10b Identify how an engineer is accountable to multiple stakeholders in engineering practice.", "Life-long Learning: An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge.", "12a Identify gaps in their knowledge, skills and abilities."]}, {"course_id": 39, "course_code": "CHE 341", "course_name": "CHE341 - Introduction to Process Control (0.50)", "term_name": "3B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Process Control Winter 2025", "CHE 341", "CHE 341 001", "CHE 341 101", "CHE 341:", "Proportional-integral-derivative control.", "Frequency response methods.", "Process control simulation and computer control systems.", "View requirements for CHE 341", "Understand the concepts of process control and its relation to industrial processes.", "Develop basic process dynamic models from fundamental chemical engineering processing units.", "Differentiate between the different process dynamics expected from chemical engineering processes.", "Understand the concept of feedback in process control and the basic equipment/devices needed to perform basic feedback control for chemical engineering processes.", "Design and tune basic feedback controllers (i.e. P, PI, PID) and understand the advantages and limitations of each controller.", "Understand the basic concepts of advanced process control systems (e.g. cascade control, feed forward).", "Develop the ability to use computer software to help describe and design control systems.", "Comprehend the concept of process stability and predict the closed-loop behavior of simple control loops.", "Model single-input-single-output (linear) dynamic systems in different representations (e.g., time-domain, Laplace domain, state-space) and describe the relative advantages/limitations of each.", "Introduction to process control (Chapter 1)", "Modeling of chemical systems (Chapter 2, 4.3)", "Transfer functions (Chapter 4)", "Dynamic response of chemical systems (Chapter 5, 6)", "Empirical models from input/output data (Chapter 7)", "Internal model control (IMC)", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 40, "course_code": "CHE 361", "course_name": "CHE361 - Bioprocess Engineering (0.50)", "term_name": "3B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["03:30PM - 05:20PM", "03:30PM - 04:20PM", "04:30PM - 05:20PM", "Introduction of biological systems for the production of commercial goods and services, e.g., foods, pharmaceuticals, chemicals, fuels, diagnostics, waste treatment, and biomaterials.", "Introduction to design of bioprocess systems, including biosafety and sustainability.", "Development of reaction kinetics associated with biological systems.", "Development of material balances for key constituents in bioreactors operated in different modes, e.g., batch, fed-batch, continuous stirred-tank reactor (CSTR), perfusion, recycle.", "Introduction to mass and heat transfer considerations for bioreactors.", "Dynamic simulation of cultures defined by ordinary differential equations.", "Introduction of downstream processes associated with biological systems and recovery of biological products.", "View requirements for CHE 361", "Understand enzyme kinetics and derive enzyme kinetic equations based on associated biological information", "Model bioreactor for enzymatic reactions", "Understand how cells replicate with bioproduct formation", "Model bioreactor for cell cultivation and bioproduct formation", "Demonstrate competence in the fundamental concepts of biological sciences and biochemical/bioprocess engineering, including biomolecules, biocatalysts, metabolic pathways, enzyme functions/kinetics, cell behaviors and growth kinetics, bioreactor systems for enzymatic reactions and cell cultivation.", "Apply biological and chemical engineering concepts to design and analysis of bioreactor systems, including mass balance, bioreactor types, bioreactor configurations, bioreactor operation, bioreactor control, bioreactor modeling, bioreactor optimization etc. (2a; 2b; 2c; 4a; 5a; 11b)", "•Week 1: Bioprocess introduction and biological background review", "•Week 2: Enzyme kinetics introduction", "•Week 3: Enzyme kinetics modeling", "•Week 4: Bioreactor modeling for enzymatic reaction", "•Week 6: Enzyme inhibition kinetics", "•Week 7: Enzyme inhibition kinetics (continued) and other enzyme kinetics", "•Week 8: Cell growth biology and cell cultivation", "•Week 9: Cell growth kinetics", "•Week 10: Bioreactor (batch) modeling for cell cultivation and bioproduction", "•Week 11: Bioreactor (CSTR) modeling for cell cultivation and bioproduction", "•Week 12: Stoichiometric modeling of cell cultivation and bioproduction", "Bioprocess Engineering (Basic Concepts) No 173.59"]}, {"course_id": 41, "course_code": "CHE 383", "course_name": "CHE383 - Chemical Engineering Design Workshop (0.25)", "term_name": "3B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Chemical Engineering Design Workshop Winter 2025", "CHE 383", "CHE 383 001", "01:30PM - 03:20PM", "CHE 383:", "An introduction to the engineering design process, including problem definition and needs analysis, critical analysis of problems, alternative solutions, process synthesis, design constraints, and safety and environmental protection in design.", "View requirements for CHE 383", "Develop a problem statement and specification for a design problem by performing a needs analysis [", "Identify relevant economic, social, health, safety, legal, and cultural aspects of a design problem [8b, 9a, 9b]", "Generate and screen potential design solutions using appropriate methods [", "Produce a work plan for a significant team project and work effectively on a team to establish roles and expectations [", "Execute the work plan to investigate, design, and evaluate solutions for complex engineering problems [", "Present a design project proposal in written and oral format [7a,7b", "Week Date Topics Deliverables", "1 Jan 8 WS1 - Introduction to Problem Finding -", "3 Jan 22 WS2 - Problem Specification -", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 42, "course_code": "CHE 480", "course_name": "CHE480 - Process Analysis and Design (0.50)", "term_name": "4A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Process Analysis and Design Fall 2024", "CHE 480", "10:30AM - 12:20PM MC 4020", "peter.angelo@uwaterloo.ca", "peter.angelo@uwaterloo.ca", "CHE 480 102", "10:30AM - 12:20PM E2 1792", "peter.angelo@uwaterloo.ca", "Sogol Shaghaghi Afzali", "Development and analysis of process flowsheets and chemical product design.", "Design and selection of common process equipment such as heat exchangers, pumps, piping, staged separations.", "Incorporation of pollution prevention and inherently safer design principles.", "Equipment and project cost estimation.", "View requirements for CHE 480", "Interpret and create common chemical engineering flowsheets, including process flow diagrams (PFDs) and piping and instrumentation diagrams (P&IDs)", "Select process units and instrumentation according to design, safety, and economic specifications and constraints [", "Identify suitable build configurations, materials, sizes, of key pieces of equipment to meet physical and chemical requirements of a process [1d, 3b, 8b, 10b, 11b]", "Justify design choices in process units and instrumentation using design equations, heuristics, industry standards/regulations, and engineering judgement [1c, 4b, 4c, 5a]", "Prioritize safety risks and evaluate reasonable mitigation strategies using structured frameworks, such as HAZOP [", "Introduction to Process Design", "Piping and instrumentation diagrams", "Process control basics", "Piping and Instrumentation", "Pipe materials and sizing conventions", "Pump types and components", "Compressor sizing and peripheral instrumentation", "Heat Exchangers", "Types of heat exchangers", "Internals and materials of construction", "Networks and integration", "Vessels and Reactors", "Vessel types and features", "Column body and internal design", "Fault and failure analysis", "Economics", "Capital costs", "Operating costs", "Towler, G.; Sinnott, R. Chemical Engineering Design: Principles, Practice and Economics of Plant and Process Design.", "Assignment 3 (Reactor and Separator Design)", "Students are welcomed and encouraged to complete any additional modules as well for their own professional development."]}, {"course_id": 43, "course_code": "CHE 490", "course_name": "CHE490 - Chemical Engineering Lab 4 (0.50)", "term_name": "4A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["CHE 490", "09:30AM - 04:20PM", "DWE 1513", "09:30AM - 04:20PM", "DWE 1513", "Office & email", "Email", "Email & meetings", "Email & meetings", "Email & meetings", "Email & meetings", "Email & meetings", "A project-based experimental investigation of complex systems in main areas of application of chemical engineering.", "View requirements for CHE 490", "ChE 490 Chemical Engineering Laboratory 4 involves the experimental investigation of chemical engineering unit operations through traditional laboratories and open-ended project laboratories, focusing on solving practical chemical engineering experimental, design, and simulation problems through the integration of fundamental unit operation concepts and pilot-scale lab experiments.", "Identify, formulate, and solve practical chemical engineering experimental and open-ended design problems by applying core principles of chemical engineering.", "Conduct experimental investigations of ChE unit operations by appropriately selecting experimental methods and procedures as per the needs of the open-ended design, critically analyzing and interpreting experimental results, and synthesizing all into valid conclusions.", "Apply modern engineering tools (online data acquisition and control, numerical computation, process simulation) and problem-solving skills to solve practical ChE experimental and design problems.", "Locate and evaluate relevant standards and technical literature, and seek out and use the well-established information to validate experimental or simulation results, the open-ended design, and conclusions.", "Communicate clearly and effectively in oral, written, and/or visual form through working in a lab team and writing technical reports.", "6a", "Alternative arrangements are possible on a case-by-case basis.", "A1", "PEM Fuel Cell Based Combined Heat-and-Power System for Residential Applications", "DWE 1514", "A2", "DWE 1514", "DWE 1519", "B1", "Pilot Distillation Operation, Simulation, and Design", "DWE 1513", "B2", "Pilot Distillation Operation, Hydraulics, and Retrofit Design", "DWE 1513", "Liquid-Liquid Extraction Column Design for Bioethanol Separation", "DWE 1520", "CO2 Absorption and Stripping in Pilot Packed Columns", "DWE 1513", "Optimal Design of Double Pipe Heat Exchanger for Food Processing", "DWE 1514", "Heat Transfer of Non-Newtonian Fluid in a Jacketed Batch Reactor", "DWE 1519", "E1", "DWE 1514", "E2", "DWE 1514", "E3", "Boiling Heat Transfer in a Thermosiphon Reboiler", "DWE 1513", "DWE 2526", "E5", "Unsteady State Operation and Simulation of CSTRs in Series", "DWE 1513", "Batch and Semibatch Reactors for Exothermic Reaction", "DWE 1519", "E5", "B2", "B1", "S4", "E3", "A1", "E1", "A2", "E2", "S8", "E1", "B1", "A1", "E5", "E2", "A2", "Sinnott, R. K., “Coulson and Richardson's Chemical Engineering Volume 6 - Chemical Engineering Design”, 4th ed., Elsevier, 2005 Electronic version of the book is available on Knovel site at: https://subjectguides.uwaterloo.ca/c.php?g=695419&p=4931331", "Towler, G., and Sinnott, R., “Chemical Engineering Design - Principles, Practice and Economics of Plant and Process Design”, 3rd ed., Elsevier, 2022 Electronic version of the book is available at: https://subjectguides.uwaterloo.ca/c.php?g=695419&p=4931331"]}, {"course_id": 44, "course_code": "CHE 482", "course_name": "CHE482 - Group Design Project (0.50)", "term_name": "4A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["CHE 482", "CHE 482 001", "DWE 2529", "DWE 2529", "The first of two required courses for the Chemical Engineering capstone design project.", "Student design teams of three to five members work on design projects of industrial scope and importance under the mentorship of a faculty member.", "Students develop and communicate a feasible design project proposal and plan; generate feasible solutions that address the formulated problem; evaluate alternatives and identify preferred solution; address safety, regulatory, sustainability and professional ethics requirements, as appropriate; effectively manage design project technical and non-technical risks using project management tools and techniques; deliver a report and/or a presentation that summarizes the work completed; work effectively as a team member and/or team leader.", "View requirements for CHE 482", "Perform a comprehensive literature search and screen out relevant and useful information (3b).", "Design and analyze chemical processes and/or products using fundamental chemical engineering principles of process and product design (1c, 1d, 2a, 2b, 2c, 3a, 3c, 4a, 4b, 4c, 5a, 5b, 5c).", "Carry out engineering design, analyze social and environmental aspects of engineering activities economic, social, health, safety, legal, and cultural aspects of society, apply the concepts of sustainable design and development and use appropriate economics and business practices in the project (4c, 9a, 9b, 11b).", "Analyze safety concerns for process systems and apply best HSE practices for design of products, systems, and processes (8b, 9a, 9b).", "Kick-off Meeting", "Instructors will meet with groups that require a follow-up", "Due Oct 25th: Video & initial literature review", "Due Dec 3: Interim capstone report & personal reflection", "Use provided rubric and format", "Group grade & individual contribution", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 45, "course_code": "GENE 403", "course_name": "GENE403 - Interdisciplinary Design Project 1 (0.50)", "term_name": "4A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Email", "Tuesday 2:30pm-4pm & Thursday 10am-11am in MC 2037", "In the course they will formulate and communicate an interdisciplinary engineering problem or opportunity; develop a feasible design project proposal and plan; generate feasible solutions that address the formulated problem; evaluate alternatives and identify preferred solution; address safety, regulatory, sustainability and professional ethics requirements, as appropriate; effectively manage design project technical and non-technical risks using project management tools and techniques; deliver a report and/or a presentation that summarizes the work completed; work effectively as an interdisciplinary team member and/or team leader.", "View requirements for SCI 300", "On the heels of launching the Future Cities Institute, UW is offering a new special course: an interdisciplinary capstone course involving students and professors from multiple faculties working together to explore the complex challenges of Future Cities.", "In the first half of the course (Fall 2024), you will develop a deep understanding of the focal problem through months of thoughtful research, building the foundation for your project (e.g. problem definition, situation analysis, conducting a literature review, solutions identification and evaluation, and managing your team and your project and developing your communication skills).", "Where i-capstone differs is that you get to engage with other motivated learners from across faculties to leverage your unique perspectives, knowledge and skills, to contribute to solution-oriented projects that demonstrate mastery of problem-solving, critical thinking, and communication on a selected topic under the theme of Future Cities.", "Didactic vs Dialectic Instruction", "This is a solitary experience.", "Clearly define the interdisciplinary problem to be solved", "Identify multiple solutions that can address the focal problem", "Apply critical thinking, data collection and analysis skills to determine the optimal solution", "Understand a wide range of techniques, tools, skills, concepts, frameworks and professional practices from various disciplines", "Select and apply appropriate techniques, tools, skills, concepts, frameworks and professional practices for a particular project", "Introduction to i-Capstone", "Oct 9 Environmental Scan", "Mapping Actor and Leverage Points", "&", "Potential Solutions & Action Plan", "Divide & conquer often does not work well for capstone projects: the work needs to be integrated.", "Team friction/conflicts are a normal part of working life, and finding collaborative ways to resolve them is an important professional skill.", "The instructor can assist in helping the team find ways to move forwards together.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "Environmental Scan  Monday, October 21st", "You must specify the sections you want addressed and a rationale for why it deserves consideration, with specific reference to the rubric and assessment criteria.", "Only in exceptional cases will this penalty be waived!", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "This course includes the independent development and practice of specific skills, such as critical analysis and effective communication.", "Library for research-based assignments", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 46, "course_code": "CHE 491", "course_name": "CHE491 - Chemical Engineering Lab 5 (0.50)", "term_name": "4B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["DWE 2529", "DWE 2529", "Office & email", "Email", "Email & meetings", "Email & meetings", "Email & meetings", "Email & meetings", "Email & meetings", "sjankhan@uwaterloo.ca", "Project-based experimental investigation of complex systems in main areas of application of chemical engineering.", "View requirements for CHE 491", "ChE 491 Chemical Engineering Laboratory 5 involves the experimental investigation of chemical engineering unit operations through open-ended project laboratories, focusing on solving practical chemical engineering experimental, design, and simulation problems through the integration of fundamental unit operation concepts and pilot-scale laboratory experiments.", "The primary objectives of this course are (1) to enhance the in-depth understanding and applications of chemical engineering theories to the performance of authentic unit operation processes through hands-on experience, and (2) to integrate the unit operation theories and experimental observation into practical chemical engineering design and simulation.", "Catalytic Reactor Design for the Removal of VOCs in Air DWE 2526", "Pilot Distillation Operation, Design, and Optimization DWE 1513", "Design and Optimization of Stripping Column for CO2 Capture and Utilization DWE 1513", "Packed Column Design for Bioethanol Separation via Continuous Liquid-Liquid Extraction DWE 1520", "Packed Column Design for CO2 Capture through Pressure Swing Adsorption DWE 2526", "H1", "Batch and Fed-Batch Bioethanol Fermentation: Operation, Design, and Optimization DWE 1520", "Application and Design of Ion Exchange Chromatography for the Purification of Major Whey Proteins DWE 1520", "Hydrogel Synthesis and Design for Controlled Drug Delivery DWE 1519", "Lithium Ion Battery Design for Sustainable Energy Storage and Applications DWE 1517", "Vanadium Redox Flow Battery: Performance, Design, and Optimization for Renewable Energy Storage DWE 1517", "Identify, formulate, and solve practical chemical engineering unit operation problems by applying core principles of chemical engineering [1c, 1d, 2a, 2b, 3b, 4a, 4c].", "Design and conduct experimental investigations of ChE unit operations by appropriately selecting experimental methods and procedures, critically analyzing and interpreting experimental results, and synthesizing all into valid conclusions [1d, 2c, 3a, 3c, 4b].", "Apply modern engineering tools (online data acquisition and control, numerical computation software) and problem-solving skills to solve practical ChE experimental, design, and simulation problems.", "Locate and evaluate relevant standards and technical literature, and seek out and use the well-established information to validate experimental, design, or simulation results and conclusions [1d, 3b], and further implement open-ended design or simulation project [", "Communicate clearly and effectively in oral, written, and/or visual form through working in a lab team and writing technical reports [6b, 7a, 7b, 7c].", "6a", "H1", "H1", "H1", "*", "Electronic version of the book is available on Knovel site at:", "Electronic version of the book is available at: http://www.accessengineeringlibrary.com/subject/chemical_engineering", "Presentation of the first project lab 12%", "Presentation of the first project lab: 12%", "Generative AI in ChE 491", "The use of GenAI needs to be acknowledged in terms of where and how the GenAI is used as a learning tool in the lab submissions.", "As a deep understanding of lab equipment, process, and experimental observation is paramount for data analysis and design for the unit operation labs, active participation of all the lab activities through hands-on operation as well as active observation and interaction is strongly encouraged."]}, {"course_id": 47, "course_code": "CHE 483", "course_name": "CHE483 - Group Design Project and Symposium (0.50)", "term_name": "4B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:30AM - 12:20PM MC 4060", "10:30AM - 12:20PM MC 4042", "View requirements for CHE 483", "Design and analyze chemical processes and/or products using fundamental chemical engineering principles of process and product design (1a, 1b, 1c, 1d, 2a, 2b, 2c, 3a, 3c, 4a, 4b, 4c, 5a, 5b, 5c).", "Carry out engineering design, analyze social and environmental aspects of engineering activities economic, social, health, safety, legal, and cultural aspects of society, apply the concepts of sustainable design and development and use appropriate economics and business practices in the project (4c, 9a, 9b, 11b).", "Perform a comprehensive literature search and screen out relevant and useful information (3b, 12a, 12b, 12c).", "Time logs 1st and 15th of each month 5%", "Video presentation for non-technical audience Friday, Feb 14 10%", "The level of bonus is a function of the effort required and performance in the competition.", "Eligible competitions include faculty-level capstone competitions and external competitions.", "Progress meeting:", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 48, "course_code": "GENE 404", "course_name": "GENE404 - Interdisciplinary Design Project 2 (0.50)", "term_name": "4B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Interdisciplinary Design Project 2 Winter 2025", "At the end of this course students will be able to re-formulate and re-communicate an engineering problem or opportunity (as appropriate); revise and communicate a feasible design project plan; revise solutions that address the formulated problem (as appropriate); implement and verify design solutions by analysis, test or prototype; communicate design solutions using accepted data formats, working documents and oral presentations; address safety, regulatory, sustainability and professional ethics requirements, as appropriate; effectively manage and communicate design project plans, technical and non-technical risks, using project management tools and techniques; work effectively as an interdisciplinary team member and/or team leader.", "View requirements for SCI 300", "On the heels of launching the Future Cities Institute, UW is offering a new special course: an interdisciplinary capstone course involving students and professors from multiple faculties working together to explore the complex challenges of Future Cities.", "In the first half of the course (Fall 2024), you will develop a deep understanding of the focal problem through months of thoughtful research, building the foundation for your project (e.g. problem definition, situation analysis, conducting a literature review, solutions identification and evaluation, and managing your team and your project and developing your communication skills).", "Where i-capstone differs is that you get to engage with other motivated learners from across faculties to leverage your unique perspectives, knowledge and skills, to contribute to solution-oriented projects that demonstrate mastery of problem-solving, critical thinking, and communication on a selected topic under the theme of Future Cities.", "Didactic vs Dialectic Instruction", "This is a solitary experience.", "Parts for Physical Prototypes", "Clearly define the interdisciplinary problem to be solved", "Identify multiple solutions that can address the focal problem", "Apply critical thinking, data collection and analysis skills to determine the optimal solution", "Understand a wide range of techniques, tools, skills, concepts, frameworks and professional practices from various disciplines", "Select and apply appropriate techniques, tools, skills, concepts, frameworks and professional practices for a particular project", "Available in the library No", "Divide & conquer often does not work well for capstone projects: the work needs to be integrated.", "Team friction/conflicts are a normal part of working life, and finding collaborative ways to resolve them is an important professional skill.", "-", "-", "Abstracts & team photo LEARN Feb 10", "3:30-7:30pm", "Final self & team member evaluation Peer Scholar via LEARN Apr 9", "End-of-Term Individual reflection & advice for younger cohorts PebblePad via LEARN Apr 9", "Disclaimer", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 49, "course_code": "ARBUS 202", "course_name": "ARBUS202 - Professional and Business Ethics (0.50)", "term_name": "Ethics List", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["11:30AM -", "V. Fernandes", "Study of ethical and moral issues that typically arise in professional and business activity.", "In the context of this course we will look specifically at ethical issues and principles of conduct that are relevant to professionals and business people.", "Topics include: fundamentals of moral and political theory, ethical decision-making, professional responsibility, corporate social responsibility, and equality, among other things.", "Like many other courses in philosophy, this series of lectures, readings, and discussions will deal with a critical analysis of many and varied views regarding life, existence, values, religious belief, etc.", "Form an opinion on the importance of ethical reasoning in business and professional contexts.", "Identify ethical problems in complex professional and business related situations.", "Apply ethical concepts to particular business and professional situations.", "Explain the roles of professional codes of conduct and codes of ethics in real world contexts.", "1 Jan 6 - 10 Introduction", "Module 2 Check-in", "3 Jan 20 - 24 Ethical Decision Making", "Module 3 Check-in", "5 Feb 3 - 7 Equality & Discrimination", "Module 6 Check-in", "7 Feb 24 - 28 Markets & the Environment", "Module 7 Check-in", "Module 9 Check-in", "Module 10 Check-in", "11 Mar 24 - 28 Whistle-blowing and Codes of Ethics", "Module 11 Check-in", "Module 12 Check-in", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 50, "course_code": "PD 22", "course_name": "PD22 - Professionalism and Ethics in Engineering Practice (0.50)", "term_name": "Ethics List", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Professionalism and Ethics in Engineering Practice Winter 2025", "Email", "Email is checked frequently and you can expect a response to your questions by email within 24-48 hours, Monday to Friday.", "In the case of co-op specific situations, check your skills inventory in WaterlooWorks for the name of your CECA contact.", "This course provides a framework for understanding professionalism and ethics within society as reflected through practice in the field of professional engineering.", "Course topics on professionalism include the history of engineering and professions, the licensing of professional engineers and the certification of the practice of offering engineering services to the public, and the regulation of professional engineering in Ontario through Professional Engineers Ontario.", "articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "identify ethical and unethical behaviour in their professional environment by applying PEO's code of ethics (O. Reg. 941/72, 77).", "identify stakeholders and their interests in the context of ethical dilemmas.", "Unit 1: Introduction", "Unit 4: Ethics and Ethical theories", "Your extension request information", "What can Late Days not be used for?", "Users remain responsible for ensuring that their use of AI tools complies with copyright and intellectual property laws.", "Documenting and Citing GenAI content", "The Writing and Communication Centre has a great resource on Using ChatGPT and other Text-Generating Artificial Intelligence (GenAI) and how to be productive and ethical in your use of GenAI as well as cautions and risks to consider.", "Professionalism in Communication", "Would you present this to your supervisor post-graduation?"]}, {"course_id": 51, "course_code": "PHIL 215", "course_name": "PHIL215 - Professional and Business Ethics (0.50)", "term_name": "Ethics List", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["11:30AM -", "V. Fernandes", "Study of ethical and moral issues that typically arise in professional and business activity.", "In the context of this course we will look specifically at ethical issues and principles of conduct that are relevant to professionals and business people.", "Topics include: fundamentals of moral and political theory, ethical decision-making, professional responsibility, corporate social responsibility, and equality, among other things.", "Like many other courses in philosophy, this series of lectures, readings, and discussions will deal with a critical analysis of many and varied views regarding life, existence, values, religious belief, etc.", "Form an opinion on the importance of ethical reasoning in business and professional contexts.", "Identify ethical problems in complex professional and business related situations.", "Apply ethical concepts to particular business and professional situations.", "Explain the roles of professional codes of conduct and codes of ethics in real world contexts.", "1 Jan 6 - 10 Introduction", "Module 2 Check-in", "3 Jan 20 - 24 Ethical Decision Making", "Module 3 Check-in", "5 Feb 3 - 7 Equality & Discrimination", "Module 6 Check-in", "7 Feb 24 - 28 Markets & the Environment", "Module 7 Check-in", "Module 9 Check-in", "Module 10 Check-in", "11 Mar 24 - 28 Whistle-blowing and Codes of Ethics", "Module 11 Check-in", "Module 12 Check-in", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 55, "course_code": "CHE 514", "course_name": "CHE514 - Fundamentals of Petroleum Production (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["09:00AM - 10:20AM E6 4022", "Darcy's law and modelling of steady-state and transient incompressible and compressible single-phase flow through porous media.", "Introduction to enhanced oil recovery.", "View requirements for CHE 514", "Understand fundamental concepts of multiphase flow in porous media relevant to petroleum production.", "1 Introduction to Petroleum Engineering", "4 Basic Concepts in Reservoir Engineering HA#1", "5 PVT Analysis for Oil", "8 Description of Fluid Flow in Oil Reservoirs", "10 Fundamentals of Oilwell Testing - Presentation Checkpoint", "11 Multiphase Flow of Immiscible Fluids in Oil Reservoirs", "12 Multiphase Flow of Immiscible Fluids in Oil Reservoirs HA#4", "I will be looking for the following:", "• Clear exposition of intermediate steps in calculations and derivations", "What was right and what wrong in your solution and why?", "Does it make sense to you?", "Quiz: The quiz is a summative test of your understanding of fundamental concepts and is not calculation heavy.", "Case Study: This is a term-long individual project that integrates knowledge from all modules to demonstrate competencies in well-log interpretation, reserves estimation, reservoir fluid characterization, primary production and oil well testing.", "Presentation: In this term-long individual project, you will prepare and deliver a presentation on a reservoir engineering topic chosen from a list provided.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 56, "course_code": "CHE 516", "course_name": "CHE516 - Energy Systems Engineering (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Energy Systems Engineering Winter 2025", "peter.angelo@uwaterloo.ca", "11:30AM -", "Energy systems in society.", "Transportation fuels and alternative fuels; the design of hybrid power trains, fuel cells and batteries.", "Design considerations of carbon-free energy generation and carbon-neutral technologies, including nuclear, wind, solar and bio-energy.", "Design of energy storage on a 'utility scale' and portable power sources.", "Applications of thermodynamics in the design of energy systems, including the Rankin and Brayton cycles.", "Other energy system topics as appropriate.", "View requirements for CHE 516", "Define the common thermodynamic cycles behind energy generation methods, comparing ideal conditions to practical conditions.", "Describe the extraction, processing, and delivery processes for common fuels and their associated energy sources.", "Differentiate between energy sources by their comparative practical and economic advantages and limitations.", "Identify sociopolitical and socioeconomic concerns associated with existing and emerging energy generation methods.", "Systems and Cycles", "Energy definitions and terminology", "Carnot, Otto, and Diesel cycles", "Energy Supply Systems", "Battery, capacitor, and hydrogen storage", "Turbine and generator design principles", "Electrical and piping distribution networks", "Carbon-Based Energy", "Coal, oil and gas usage and reserves", "Extraction and processing methods", "Nuclear Energy", "Review of nuclear chemistry, fission, and fusion", "Transitioning to renewable energy systems", "Debate (Nuclear Energy Expansion) 15%", "Design Project 2 (Hybrid Renewable Facility) 25%", "Design Project 1 Friday, February 7", "Debate", "In person", "Design Project 2 Friday, March 28", "Pitch Meeting", "In person", "Design Projects", "Design Projects comprise a summary report of a process, product, or facility that students will design based on the previous Module.", "Each project will require submission of a report containing sections specified by an appropriate rubric.", "In the case of Design Project 2, each group member will be responsible for specific sections of the report and presentation as specified in its rubric, and will be graded individually on those sections.", "The Case Study involves the examination of an operating process and its contextualization within the broader socioeconomic environment.", "Debate", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 57, "course_code": "CHE 520", "course_name": "CHE520 - Process Flowsheet Analysis (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["CHE 520", "CHE 520 101", "CHE 520 001", "Fateme Mohammad Mohammadi", "An integrated view of process flowsheet synthesis, analysis and optimization, emphasizing the use of computer aids to perform steady-state mass and energy balancing on chemical processes.", "Application of relevant chemical engineering concepts, including mass and energy balances, thermodynamics of mixtures and unit operation models, to process simulation.", "Process simulation modes, numerical solution of relevant non-linear equation systems, recycle partitioning, and tearing.", "Applications including heat exchanger networks, multistage separation processes, and chemical reactor networks.", "View requirements for CHE 520", "Describe, formulate, and develop nonlinear mass and energy balance models for standard chemical process units.", "Develop process-level models using individual nonlinear unit models, given process topologies and flowsheets.", "Formulate and solve process-level models using simplified linear models for individual units and ideal thermodynamic methods.", "Develop and solve process-level models using nonlinear unit models and thermodynamic methods via process simulation software.", "Describe and select appropriate thermodynamic methods given process conditions and available empirical data.", "Describe and select appropriate numerical methods for the solution of nonlinear unit and process models.", "Interpret and communicate process-level performance and analysis to peers in written format."]}, {"course_id": 58, "course_code": "CHE 521", "course_name": "CHE521 - Process Optimization (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Process Optimization Fall 2024", "Email: pulsipher@uwaterloo.ca", "An introduction to chemical process optimization.", "Model development and classification of optimization problems.", "Linear programming techniques, simplex algorithm, goal programming and barrier method, parametric sensitivity analysis and duality theory.", "Convex optimization, necessary and sufficient conditions for optimality for unconstrained and constrained problems.", "Applications include optimization of heat exchanger networks, multistage separation processes, batch operations, process scheduling and chemical reactor networks.", "View requirements for CHE 521", "Formulate well-posed optimization models given a problem statement [", "Classify optimization problems based on the optimization modelling features [", "Formulate and solve linear programming (LP) problems using conventional linear optimization techniques such as graphical and simplex methods [", "Understand the basic concepts in duality theory for linear and nonlinear programming (NLP)", "Understand the importance of convexity in optimization and classify the convexity of simple feasible regions [", "Derive and understand optimality conditions for LPs and NLPs", "Understand the basic concepts behind barrier methods to solve linear and nonlinear programs [", "Formulate and solve simple convex mixed-integer programming (MIP) problems using conventional algorithms, e.g., branch-and-bound [", "Formulate simple trajectory (e.g., ODE-constrained) optimization problems [", "Use optimization software to solve LP, NLP, MIP, and trajectory optimization problems that emerge in chemical engineering applications [", "Introduction to Process Optimization", "Optimization in chemical engineering", "Classification of optimization problems", "Development of well-posed optimization models", "Linear Programming", "Standard form and modelling", "Graphical method", "Duality theory & sensitivity analysis", "Optimality Conditions and Characterization", "Necessary and sufficient conditions for optimality", "Nonlinear Programming", "Standard form and modelling", "Duality theory", "Mixed-Integer Programming", "Introduction to convex mixed-integer optimization", "Branch-and-bound method", "Trajectory Optimization", "Modelling ODE-constrained optimization problems (e.g., optimal control)", "Direct transcription approach", "iClicker Account Free of charge for the 2024/2025 school year Yes", "Grossmann, I., Advanced Optimization for Process Systems Engineering, Cambridge: Cambridge University Press, 2021 Suggested Reference No", "Winston, W., Operations Research: Applications and Algorithms, Thomson, Fourth Edition, 2004 Suggested Reference No", "iClicker Account", "APMonitor design optimization course", "Julia-centric optimization textbook", "Introduction to optimization course notes (note that the code snippets are out-of-date)", "Optimization education resource list", "During each class live polling questions administered via iClicker will be integrated into the lecture material.", "Exams", "This course includes the independent development and practice of specific skills for modelling and solving mathematical programming problems.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 59, "course_code": "CHE 522", "course_name": "CHE522 - Advanced Process Dynamics and Control (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Advanced Process Dynamics and Control Winter 2025", "Sampled-data systems.", "Discrete systems.", "Design of controllers.", "Control of complex chemical systems.", "View requirements for CHE 522", "To implement state feedback controllers based on state space models", "To understand the effect of sampling in the implementation of computer control", "To design discrete controllers for implementation in computers", "To understand the effect of interaction among process variables in multivariate systems", "To analyze stability of multiple input- multiple output processes", "Introduction to state-space based control, computer control and multivariable control.", "At the conclusion of this course the students should be able to solve systemsof ODE’s by linear algebra techniques, formulate state feedback controllers and assess the observability and controllability of the states.", "For the purpose of computer control implementation and analysis students will learn the z- transform, analyzed closed loop stabilityof discrete systemsand design discrete controllers based on z- transformbased transfer functions.", "Then the student will learn concepts of multivariable control, stability of multivariable control strategies, determination of interaction in multivariable systems and decoupling strategies to deal with interactions.", "Linear Systems by Kailath, Ed. PrenticeHall, 1980.", "Why we need state space models for control?", "Homogeneous solution of systems of ODE's by linear algebra based methods: eigenvalues and eigenvectors.", "Homogeneous solution of systems of ODE’s", "2 Non-homogeneous solution of systems of ODE’s, State feedback controllers Example for particular solutions and Eigenvalue-placement method  for designing state feedback controllers", "Introduction to discrete control: differences with respect to continuous systems, brief presentation of hardware necessary for discrete control implementation.", "Example on the effect of sampling interval on stability of finite difference equations and control", "Introduction to z transform", "Closed loop transfer functions using z-transforms", "Examples", "Direct synthesis and Internal modelcontrol for discrete systems using z transforms", "Examples", "Introduction to multivariable control, closed loop stability of multivariable systems", "Examples", "Examples", "Linear Systems by Kailath, Ed. PrenticeHall, 1980.", "Linear Systems by Kailath, Ed. PrenticeHall, 1980."]}, {"course_id": 60, "course_code": "CHE 524", "course_name": "CHE524 - Process Control Laboratory (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["DWE 1513", "-", "DWE 1513", "Time constant; step and frequency response; controller tuning; multivariable control strategies.", "Implementation using simulation systems, mainframe computer control, microcomputers.", "View requirements for CHE 524", "Time constant; step and frequency response; controller tuning; multivariable control strategies; model predictive control.", "Implementation using simulation systems, main frame computer control, microcomputers.", "The Laboratory reports and the short quiz will be marked by the teaching assistant and the course instructor.", "Traditional Methods for System Identification in Process control.", "Internal Model Control, IMC", "Identify transfer function models of chemical processes from input-output experimental data", "Tune controllers for single input-single output processes", "Apply and tune Model Predictive Control to a multivariate process"]}, {"course_id": 61, "course_code": "CHE 541", "course_name": "CHE541 - Introduction to Polymer Science and Properties (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Polymer Science and Properties Fall 2024", "04:00PM - 05:20PM", "Department of Chemical Engineering", "Email: tmekonnen@uwaterloo.ca", "An introduction to principles governing polymerization reactions and the resultant physical properties of polymers.", "Step-growth and chain-growth polymerization and copolymerization.", "View requirements for CHE 541", "Polymers have become integral to modern life, often replacing conventional materials across various applications.", "A solid understanding of polymers is essential for Chemical, Material, and Mechanical Engineers.", "CHE 541 provides a comprehensive overview of polymeric materials' scientific and engineering aspects.", "The course introduces fundamental concepts in Polymer Science, which are crucial for understanding the properties (polymer characterization) and engineering processes (production and modification) of polymers.", "The primary objective of this course is to develop a foundational knowledge of the structure, properties, characterization, and processing of polymeric materials, as well as the methodologies for applying this knowledge in the design of practical applications.", "Introduce fundamental concepts in Polymer Science and Engineering", "Understand molecular weight concepts and practical methods for polymer molecular weight determination", "Understand correlation between structure, properties, and processing of polymeric materials", "Attain understanding of polymer production engineering"]}, {"course_id": 62, "course_code": "CHE 543", "course_name": "CHE543 - Polymer Production: Polymer Reaction Engineering (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["E5 3102", "For in-person meetings: Please set up via e-mail message", "Overview of polymer production technology and polymer reaction engineering analysis tools.", "Calculations and mathematical models for rate, copolymer composition, molecular weight and sequence length characteristics, for polymer reactor design/optimization of polymer productivity and quality variables.", "View requirements for CHE 543", "Be fluent with Polymer Reaction Engineering (PRE) tools (mathematical modelling and reaction engineering tools for understanding/designing/troubleshooting/optimizing polymerization reactors, and for controlling polymer product properties); optimization and control strategies in order to deliver desirable properties for final applications (3b, 3c, 4c, 4c, 5b, 5c)", "Understand basic polymer characterization or sensing techniques to monitor polymer properties; bridge between Polymer Science/Chemistry and Polymer Processing/ Modification/Rheology) (3b, 3c, 4c, 4c, 5b, 5c, 9a)", "Understand basics of Polymerization Production processes and how they relate to product design and properties (multicomponent polymer products, branched vs linear vs crosslinked molecules; emulsion/suspension vs bulk/solution; chain growth vs step growth vs ionic/coordinated systems with a catalyst vs controlled free radical or other specialty cases, etc.)", "The idea is to become fluent with polymer reactor aspects and the basic tools of PRE from mathematical modelling in aid of polymerization process (and polymer product) understanding, operation troubleshooting and, finally, optimization/control.", "CH 0:  Introduction (to polymerization and polymeric materials)", "CH 1:  Basic Concepts/Definitions", "CH 2:  General Introduction; Polymerization Process Information", "Anything else?", "Do not delay and do not postpone!", "Many references will be given in the beginning of the course; there is no such thing as one comprehensive and all-inclusive book that covers this material.", "Anything else?", "Do not delay and do not postpone!", "Intellectual property includes items such as:", "Outcome Definition", "A knowledge base for engineering Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "2. Problem analysis An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "4. Design", "An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "7. Communication skills An ability to communicate complex engineering concepts within the profession and with society at large.", "An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Impact of engineering on society and the environment", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Ethics and equity", "Life-long learning", "An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge."]}, {"course_id": 63, "course_code": "CHE 560", "course_name": "CHE560 - Nanomedicine and Nanobiotechnology (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 09:50AM E6 2024", "11:30AM -", "Email:  eyim@uwaterloo.ca", "Overview of biomedical engineering principles.", "Formulation and manufacturing processes for production of nanoparticles for medical applications.", "Route of administration and controlled delivery strategies.", "Formulation and manufacturing process for drug delivery in the biotechnology and pharmaceutical industries.", "CHE 560: View requirements for CHE 560", "Overview of biomedical engineering principles.", "Formulation and manufacturing processes for production of nanoparticles for medical applications.", "Route of administration and controlled delivery strategies.", "Formulation and manufacturing process for drug delivery in the biotechnology and pharmaceutical industries.", "4. Design scalable formulations and manufacturing processes to produce nanomedicine for biomedical applications.", "Week 1:  (Topic 1) Course overview: Introduction to biomaterials and nanomedicine", "Introduction to biomaterials and biointerface", "Micro / nanoparticle formulation strategies", "Emulsion", "Introduction to HLB", "Suspension", "Introduction to tablet and tablet manufacturing process", "Overview of physiology system related to oral drug administration: neural, cardiovascular, renal, gastrointestinal systems", "Pharmacokinetics", "Adsorption", "Distribution", "Metabolism", "Elimination", "Introduction to controlled release", "Overview of administration of nanomaterials and tissue response", "Examples of alternative administration, controlled release in body systems, targeted delivery", "Sterilization", "Introduction to regulatory approval process for drugs", "Preclinical and clinical trials", "Biomaterials Science: An Introduction to Materials in Medicine, 3rd edition.", "Design Projects 30%", "Online quizzes and Dropbox folders for projects will be access via Learn.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 64, "course_code": "CHE 561", "course_name": "CHE561 - Biomaterials and Tissue Engineering (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Biomaterials and Tissue Engineering Winter 2025", "Assistant Professor in the Department of Chemical Engineering and member of the Waterloo Institute for Nanotechnology", "The course provides an overview of the recent advances in medicine and nano-technologies for development of tissue engineering and regenerative medicine.", "Strategies and technologies for designing, testing, and manufacturing of biomaterials and tissue-engineering products will be introduced.", "The biological and clinical applications will be discussed.", "The unmet medical needs, challenges in manufacturing, regulatory approval and commercialization for tissue engineering applications will also be discussed.", "CHE 561: View requirements for CHE 561", "The course provides an overview of the recent advances in medicine and nano-technologies for development of tissue engineering and regenerative medicine.", "Strategies and technologies for designing, testing, and manufacturing of biomaterials and tissue-engineering products will be introduced.", "The biological and clinical applications will be discussed.", "The unmet medical needs, challenges in manufacturing, regulatory approval and commercialization for tissue engineering applications will also be discussed.", "Apply fundamentals of fabrication technology for tissue engineering applications", "Integrate fundamentals of materials science to solve biomedical unmet needs", "Understand the fundamentals of biocompatibility and physiology for tissue engineering applications", "Design tissue engineering solutions to solve health-care problems", "Communicate through reports and presentations", "-Introduction to tissue engineering", "-Scale in biological systems", "-Introduction biomaterials and nanotechnologies for biomedical engineering", "Biomaterials design and properties", "Drug and gene delivery", "-Key components of tissue engineering", "Biomaterials: engineering biological structures", "Protein interactions with biomaterials", "Molecular and cellular processes with living environment, blood-materials interaction, short and long term reactions to the body.Cell interactions with biomaterials", "Immune response and wound healing", "Growth factors, controlled release and gene delivery", "Cells and Stem cells", "Neural repair and regeneration", "Diabetes / bone tissue engineering", "Assessment of biomedical products", "Regulatory and commercialization", "Design project presentations", "Design project 40%", "Design project is to be done in groups of 3-4.", "Design Project Outline Friday, February 7 at 11:59 PM 10%", "Design Project peer and self-evaluations Friday, April 4, 11:59 PM 10%", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 65, "course_code": "CHE 562", "course_name": "CHE562 - Advanced Bioprocess Engineering (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Advanced Bioprocess Engineering Winter 2025", "View requirements for CHE 562", "•Bioreaction topics: enzyme kinetics; growth kinetics; homogeneous (i.e., enzymatic reaction and cell cultivation) vs. heterogeneous (immobilized) biocatalysts; bioreaction vs. mass transfer in immobilized biocatalysts; bioreactor modeling and design (BR, CSTR, PFR)", "Understand how immobilized biocatalysts are designed and made", "Model bioreactor systems with bioreactions catalyzed by both non-porous or porous immibilized enzymes", "Model bioreactor systems with bioreactions catalyzed by both active and passive immibilized cells", "Demonstrate competence in the fundamental concepts of biological sciences and biochemical/bioprocess engineering, including biomolecules, biocatalysts, metabolic pathways, enzyme functions/kinetics, cell behaviors and growth kinetics, bioreactor systems for enzymatic reactions and cell cultivation.", "Apply biological and chemical engineering concepts to design and analysis of bioreactor systems, including mass balance, bioreactor types, bioreactor configurations, bioreactor operation, bioreactor control, bioreactor modeling, bioreactor optimization etc. (2a; 2b; 2c; 4a; 5a; 11b)", "•Week 1: Bioprocess and biological background review: Immobilized biocatalyst introduction", "•Week 3: Non-porous IE system modeling", "•Week 4: Porous IE system introduction", "•Week 6: Porous IE system and bioreactor modeling", "•Week 7: Porous IE system/bioreactor modeling and immobilized cell (IC) system introduction", "•Week 8: Active IC system modeling", "•Week 9: Passive IC/slab system modeling", "•Week 10: Passive IC/slab system and bioreactor modeling", "•Week 11: Passive IC/spheric system modeling", "•Week 12: Passive IC/spheric system and bioreactor modeling", "Bioprocess Engineering, 3rd Edition No 173.59"]}, {"course_id": 66, "course_code": "CHE 564", "course_name": "CHE564 - Food Process Engineering (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["04:00PM - 05:20PM", "DWE 3518", "04:00PM - 05:20PM", "DWE 3518", "E-mail: tmekonnen@uwaterloo.ca", "E-mail correspondence", "Please allow one business day for a response to email.", "This course will be provided exclusively in person in classroom DWE 3518.", "Applications of unsteady and steady state heat and/or mass transfer operations to processing natural and texturized foods.", "Design and analysis of sterilization, low temperature preservation, concentration, separation and purification processes.", "View requirements for CHE 564", "Introduction to Food Composition and Chemistry, Food microbiology", "5. Describe the connections between food processing and society, recognizing gaps in knowledge and learning about emerging areas [9a, 10b, 12a]", "Introduction", "Course introduction and background", "Introduction to food safety", "Regulations and Labelling", "Process and equipmentdesign", "Cleaning in Place", "Thermal death kinetics", "Sterilization", "Batch and continuous operations", "Chilling", "Freezing", "Drying Operations", "Spray drying", "No textbook is required for this course, but you may find these books useful:", "Introduction to Food Engineering, 5th  Edition.", "Introduction to Food Process Engineering.", "The objective is to conduct a critical review of an emerging topic in food process engineering.", "The project will be completed in groups of two."]}]