[{"course_id": 5, "course_code": "PMATH 450", "course_name": "PMATH450 - Lebesgue Integration and Fourier Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Lebesgue Integration and Fourier Analysis Fall 2024", "Lebesgue measure on the line, the Lebesgue integral, monotone and dominated convergence theorems, Lp-spaces: completeness and dense subspaces.", "Prove theorems and solve problems on Lebesgue integrals and Fourier analysis, and move like Jagger."]}, {"course_id": 6, "course_code": "PMATH 451", "course_name": "PMATH451 - Measure and Integration (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Measure and Integration Winter 2025", "Instructor: Michael Brannan", "E-mail: michael.brannan@uwaterloo.ca", "Week of", "Abstract Measure and Integration I", "2 Jan 13 Abstract Measure and Integration II", "3 Jan 20 Construction of Measures - Caratheodory's Theorem A1", "9 March 10 Complex Measures, Radon-Nikodym Thoerem A4", "11 March 24 Integration on Product Spaces", "Real and Complex Analysis Author: Walter Rudin No", "Real Analysis: Modern Techniques and their Applications.", "Author: Gerald B. Folland No"]}, {"course_id": 7, "course_code": "STAT 330", "course_name": "STAT330 - Mathematical Statistics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Mathematical Statistics Winter 2025", "10:30AM - 11:20AM DC 1351", "This course provides a mathematically rigorous treatment for topics covered in STAT230 and 231, and to make essential extensions to the multivariate case.", "Topics covered include independence of random variables, conditional expectation and the determination of the distribution of functions of random variables using the cumulative distribution method, change of variable and moment generating functions.", "Asymptotic properties of the maximum likelihood estimator are examined and used to construct confidence intervals or regions.", "Tutorial: tutorials will be used for going over solutions of practice problem sets and holding term tests.", "Have a deep understanding of various mathematical aspects of Statistics and Probability.", "Week 4 Chapter 3. Expectation & M.G.F. Term Test 1 January 28th", "Asymptotic Distributions", "Introduction to Probability and Mathematical Statistics by Bain and Engelhardt, Second Edition No 112", "Arrangements for students with official conflicts will be handled on a case by case basis."]}, {"course_id": 8, "course_code": "STAT 331", "course_name": "STAT331 - Applied Linear Models (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Applied Linear Models Winter 2025", "08:30AM - 09:50AM MC 4020", "02:30PM - 03:20PM", "RCH 101", "Thursdays from 3:00-4:00pm in M3 3021", "Modelling the relationship between a response variable and several explanatory variables (an output-input system) via regression models.", "Model diagnostics and improvement.", "Algorithms for variable selection.", "Review of basic Normal theory, t, chi-squared, and F distributions.", "Simple linear regression.", "Analysis of variance.", "Multiple linear regression, variable selection techniques, indicator variables, diagnostics.", "Brief introduction to non-linear regression, factorial experimentation.", "Registered students can enroll in the class discussion board through Piazza.", "Search for your question first before posting.", "Do not expect a full solution to your question.", "To help maintain a safe, respectful, and productive community in which we – students and teaching team alike – can take risks in our learning/teaching, tackle challenging concepts, and ultimately grow as learners, we should endeavor to follow these mutual expectations:", "Explain the main concepts of linear regression models.", "Understand the methods of least squares and maximum likelihood estimation for model parameters.", "Interpret the model and its parameters (e.g., regression coefficients) in the context of any application.", "Draw inferences from a fitted model about the parameters of interest and make predictions.", "Apply the previous two outcomes when fitting linear models to real data using R.", "Assess model quality by diagnosing violations in underlying model assumptions (and identify strategies for improvement).", "Evaluate competing fitted models built using various model selection methods (and choose between them).", "Introduction", "The Straight Line Model", "Model formulation and interpretation", "Least squares estimation", "Mean response and residual variance estimation", "Introduction to R/RStudio", "Maximum likelihood estimation", "Estimators and their properties", "Important distributions", "Distributions of estimators", "Confidence intervals", "O - Ch. 2-4", "Straight Line Model in R", "Prediction intervals", "Intervals in R", "Hypothesis testing", "O - Ch. 4-5", "ANOVA and F test", "Model limits", "Data transformations", "O - Ch. 4-6", "O - Ch. 7", "A1 and Q1 Solutions", "Multivariate normal distribution", "The Linear Model", "Examples", "O - Ch. 8-9", "Estimation", "Estimators and their properties", "Distributions of estimators", "O - Ch. 9, 11, 12", "ANOVA and F test", "Significance tests", "General linear hypothesis", "O - Ch. 9, 11, 12", "A2 and Midterm Solutions", "Case Study: South African heart disease", "Nested models", "Additional sum of squares", "O - Ch. 12", "Outliers", "O - Ch. 13-14", "Influence", "O - Ch. 14-15", "A3 and Q2 Solutions", "One-variable-at-a-time selection methods", "Criteria-based selection methods", "O - Ch. 16", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solve exercises from the textbook on your own.", "Introduction to Regression Modeling by Abraham and Ledolter This textbook is an optional reference book (available for free on LEARN).", "R and R-Studio Free software.", "To serve as an opportunity to demonstrate your understanding, application, and integration of the course material, including practical application of the skills/concepts with the statistical software, R.", "Missed Assignment: The time window to complete these assessments are generous and, in general, a sickness lasting a couple of days will not be enough of a reason to ask for alternative accommodations and/or extension.", "Tips for Success", "Students should critically compare their work with available solutions and against the solutions of fellow classmates.", "Notice of Recording", "To help you decide if you should isolate, you can use the provincial self-assessment tool.", "In the scenario where we must transition back online the following contingencies will be used:", "These materials are made available for the personal use of students registered in the current offering of this course.", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical proofs and the fitting, interpretation, and assessment of linear models in real applications.", "Library for research-based assignments"]}, {"course_id": 9, "course_code": "STAT 333", "course_name": "STAT333 - Stochastic Processes 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM DC 1350", "04:00PM - 05:20PM", "Erik Hintz: Fridays, 2:00pm - 3:00pm, in M3-2106", "Requests must be emailed to: sasugradadv@uwaterloo.ca", "Topics cover generating functions, conditional probability distributions and conditional expectation, discrete-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, applications including the random walk, the gambler's ruin problem, and the Galton-Watson branching process, an introduction to counting processes, connections between the exponential distribution and Poisson process, and non-homogeneous and compound Poisson processes.", "use moment generating functions as a tool to determine expected values and identify probability distributions of random variables;", "use the law of total expectation to calculate expected values and probabilities through the principle of conditioning;", "specify a discrete-time Markov chain (DTMC), in terms of its transition probability matrix and initial conditions, and calculate various transition probabilities;", "classify the states of a DTMC;", "define fundamental DTMC concepts including irreducibility, periodicity, and recurrence/transience;", "find limiting/stationary probability distributions for certain DTMCs through the use of the Basic Limit Theorem;", "calculate absorption probabilities and expected absorption times for DTMCs using the principle of conditioning with respect to the first transition;", "Week 11 March 24 - March 28 Chap 4: Exponential Distribution & Poisson Processes Tutorial Assignment 2", "Week 12 March 31 - April 4 Chap 4: Exponential Distribution & Poisson Processes Tutorial Test 3", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solving exercises from the Course Notes on your own.", "Introduction to Probability Models by Sheldon M. Ross (2019)"]}, {"course_id": 10, "course_code": "STAT 443", "course_name": "STAT443 - Forecasting (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Forecasting Spring 2024", "04:00PM - 05:20PM", "Email: jeremy.vanderdoes@uwaterloo.ca", "This course is an introduction to statistical forecasting.", "This includes considerations of forecasts and uncertainty.", "Speciﬁc topics include:", "Linear time series models: AR, MA, ARMA, ARIMA, SARIMA", "Forecasting: Principles and Practice, 3rd edition free online at https://otexts.com/fpp3/", "Time Series Analysis and Its Applications, 4th edition free online in library or at https://www.stat.pitt.edu/stoffer/tsa4/ Yes", "Introduction to Time Series and Forecasting free online in library Yes"]}, {"course_id": 11, "course_code": "AFM 101", "course_name": "AFM101 - Introduction to Financial Accounting (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Financial Accounting Winter 2025", "AFM 101", "AFM 101 081", "AFM 101:", "This course is an introduction to financial accounting.", "View requirements for AFM 101", "Define and use financial accounting terminology.", "Identify and correct basic accounting errors in financial statement accounts.", "Draw conclusions and make recommendations based on financial information.", "Identify and apply the principles of financial reporting.", "Apply basic financial accounting principles in an industry.", "Your access code is available in multiple formats.", "Financial Accounting and MyLab - ebook and access code", "MyLab - access code only", "This course includes the independent development and practice of specific skills, such as understanding financial statements, conducting financial analysis, and preparing financial statements.", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 12, "course_code": "AFM 102", "course_name": "AFM102 - Introduction to Managerial Accounting (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Managerial Accounting Winter 2025", "AFM 102", "AFM 102 081", "Your instructor checks email and the Ask the Instructor discussion topics frequently and will make every effort to reply to your questions within 24–48 hours, Monday to Friday.", "AFM 102:", "This course is an introduction to the preparation and use of accounting information for management decision-making and reporting.", "Cost behaviour, cost accumulation systems, and short- and long-term decision models are discussed.", "View requirements for AFM 102", "We will be learning how to perform internal analysis including cost-volume-profit analysis, profitability analysis, performance analysis, and capital budgeting analysis.", "Distinguish between various cost classifications and analyze a company’s cost structure to facilitate internal decision-making.", "Apply cost-volume-profit (CVP) analysis to recommend the best course of action given different “what-if” scenarios.", "Explain the budgeting process and prepare components of master and flexible budgets.", "Week 1: Introduction to Managerial Accounting", "Week 2: Cost Terms and Concepts", "Week 4: Cost-Volume-Profit Analysis", "Week 9: Standard Costs and Over Analysis", "Week 11: Relevant Costs and Benefits for Decision-Making", "Week 12: Capital Budgeting Decisions", "Optional No $99 (e-book & Connect Access Code)", "Re-Grading", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 13, "course_code": "AFM 131", "course_name": "AFM131 - Introduction to Business in North America (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Business in North America Winter 2025", "AFM 131", "Coverage also includes study of the principles of effective management and the financial system as a source of corporate capital.", "View requirements for AFM 131", "Describe the business environment and the relationships between the functional areas of business", "Write in a professional manner to effectively communicate in the appropriate context (e.g., in a discussion board)", "Demonstrate collaboration skills (i.e., understanding, respect) to work effectively in a team during discussions", "Penalties for Academic Integrity Offenses", "48 hour short-term absence", "Self-declared COVID-related absence", "Intellectual property includes items such as:", "Cross-listed courses", "Phone: 519-884-0000 extension 213", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 15, "course_code": "AMATH 242", "course_name": "AMATH242 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 16, "course_code": "CS 335", "course_name": "CS335 - Computational Methods in Business and Finance (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Computational Methods in Business and Finance Winter 2025", "Tuesday -", "An introduction to numerical methods for business and finance.", "Methods for portfolio optimization and contingent-claims valuation.", "This course will cover topics such as: lattice methods for pricing contingent claims, Monte Carlo techniques for pricing options and evaluating investment strategies, use of optimization software for portfolio optimization, solution of nonlinear equations (yield to maturity, implied volatility), floating point error propagation, and polynomial interpolation.", "Assignments will involve both theoretical problems and practical programming tasks using Python.", "This course will give students in the business-related programs in the Faculty of Mathematics an introduction to basic computational methods used in business and financial applications.", "Introduce students to basic computational methods used in business and financial applications.", "Week of Jan 27: Dynamic programming, Black-Scholes equation", "Computational Methods in Business and Finance Course Notes Provided digitally on LEARN for free Yes", "Students may discuss general concepts and problems with other individuals in class.", "You should start the first assignment as soon as possible to begin setting up and getting familiar with these tools.", "The focus of this course is on learning general mathematical and financial computing concepts, rather than a particular programming language.", "Marking", "Your code and its output are an important part of the assignment, so they should be readable and well-commented.", "Likewise, assignment figures and graphs should be carefully thought out to present your data and conclusions in an effective and clear manner.", "Any code and algorithms you write should be sufficiently well documented through code comments or descriptions to be readily understood.", "If you feel your assignment/midterm was marked incorrectly, first write a clear explanation of specifically what you would like reviewed, and communicate this to the appropriate instructor or TA.", "We encourage you to discuss general concepts and problems with classmates, tutors, TAs, and the instructor.", "Intellectual property includes items such as:"]}, {"course_id": 17, "course_code": "CS 371", "course_name": "CS371 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 18, "course_code": "AMATH 250", "course_name": "AMATH250 - Introduction to Differential Equations (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Differential Equations Winter 2025", "Solving linear differential equations: first- and second-order scalar equations and first-order vector equations.", "The main purpose of the course is to explore how first and second order differential equations (DEs) are used to model physical systems and predict their behaviour.", "first order linear DE models of compartment problems, atomic decay, and bodies in motion;", "first order separable DE models of population growth;", "a first order exact DE model of the electric dipole;", "second order linear DE models for oscillatory systems such as mass-spring-damper systems and electrical circuits;", "second order nonlinear DE models for suspended cables and rocket motion;", "linear vector DE models of multiple compartment problems and species interactions.", "Both analytical solution techniques and qualitative methods (direction field analysis, dimensional analysis, and phase portraits) will be presented as ways to gain information about system behaviour.", "We will investigate conditions for existence, uniqueness, and continuity of solutions of both first and second order initial value problems, and for systems in the plane.", "Maple will be used to generate numerical and graphical solutions, to illustrate concepts graphically, and to explore model behaviour.", "increase your comprehension of some of the many ways that differential equations can help us understand the real world;", "develop your ability to understand a mathematical model for a specific situation;", "explore analytical and qualitative solution methods for first and second order differential equations, and the use of Maple; and", "Please choose only one of the two options below.", "Submission Instructions", "Copyright Notice", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as solving differential equations.", "Library for research-based assignments"]}, {"course_id": 19, "course_code": "AMATH 251", "course_name": "AMATH251 - Introduction to Differential Equations (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Introduction to Differential Equations (Advanced Level)", "Email: cbauch@uwaterloo.ca", "Email: apunnavajhala@uwaterloo.ca", "This course offers a more theoretical treatment of differential equations and solution methods.", "In addition, emphasis will be placed on computational analysis of differential equations and on applications in science and engineering.", "Newton's enthusiasm was due to his success in using differential equations to give the first mathematical description of planetary orbits.", "Can you imagine what his reaction would be to the present widespread use of differential equations, with applications ranging from the space shuttle guidance system to epidemic models and neural networks?", "learn how to solve simple differential equations", "understand how differential equations can be applied in various fields", "We will cover portions of the following chapters from Boyce & DiPrima, in order:", "Chapter 1: Introduction to DEs", "Chapter 2: First-order differential equations", "Chapter 3: Second-order differential equations", "Chapter 7: Systems of linear equations", "Chapter 8: Numerical methods", "Chapter 9: Nonlinear differential equations and stability", "Elementary Differential Equations and Boundary Value problems.", "Assignments are to be brought to the start of lecture as a hard copy.", "Notice of Recording", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 20, "course_code": "AMATH 350", "course_name": "AMATH350 - Differential Equations for Business and Economics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Differential Equations for Business and Economics Winter 2025", "11:30AM - 12:20PM MC 4045", "First order ordinary differential equations.", "Applications to continuous compounding and the dynamics of supply and demand.", "Higher order linear ordinary differential equations.", "Systems of linear ordinary differential equations.", "Introduction to linear partial differential equations.", "Ordinary differential equations and their applications", "Systems of linear ordinary differential equations", "Linear partial differential equations and Fourier transform", "Black-Scholes equation and solution", "(Jan 6-10) Introduction to Differential Equations (DEs), Separable Equations, Initial-Value Problems, Applications from Finance", "Dimensional Homogeneity, First-Order Linear Ordinary DEs, Use of Substitutions, Applications from Finance Chapter 2 Posting Assignment 1", "Introduction to Higher-Order Linear Equations: Theoretical Background", "Introduction to Systems of Ordinary Differential Equations, Method of Solution for Homogeneous Systems (Second Order)", "(Mar 3-7) Introduction to Partial Differential Equations, First-order Equations (Partial Integration, Method of Characteristics) Chapter 5", "Second-Order Linear PDEs: Classification, Solution by Partial Integration or Method of Characteristics Chapter 5", "Please submit your assignments early in case of unexpected technical difficulties."]}, {"course_id": 21, "course_code": "AMATH 351", "course_name": "AMATH351 - Ordinary Differential Equations (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Ordinary Differential Equations Fall 2024", "Linear differential equations with non-constant coefficients, Sturm comparison, oscillation and separation theorems, series solutions and special functions.", "Linear systems in Rn, an introduction to dynamical systems.", "Laplace transforms applied to linear systems, transfer functions, the convolution theorem.", "An introduction to dynamical systems and stability.", "Perturbation methods for differential equations.", "Create and understand scientific models in the language of ODEs.", "Know and derive properties of some special functions", "Find solutions to inhomogeneous, first-order ODEs in terms of the fundamental matrix (exponential matrix)", "Understand the existence and uniqueness theorems of ODEs and apply them to systems.", "Apply perturbation methods to find approximate solutions to systems of ODEs.", "September", "Chapter 1: Theory of Second-Order Linear ODEs", "1.1: Introduction to Modelling", "1.2: Classification of DEs", "1.3: 2nd-order linear ODEs", "September", "1.4: Existence and uniqueness", "1.5: General solutions of 2nd-order DEs", "1.7: Examples of 2nd-order DEs with non-constant coefficients", "1.8: Wave equation in a vibrating membrane", "1.10: Method of variation of parameters", "September", "1.11: Qualitative Analysis of DEs", "2.2: Series solutions of first-order equations", "September", "2.3: 2nd-order equations: ordinary points", "-", "2.5 Extended method of Frobenius", "2.6 Bessel functions", "Chapter 2b: Special Functions of mathematical physics", "Bessel functions and the gamma function and properties", "Bessel functions and the gamma function and properties (continued)", "Chapter 3: System of 1st-order equataions", "3.1: Introduction to linear systems", "-", "3.2: Existence-Uniqueness of IVPs", "3.2: Existence-Uniqueness of IVPs, Proof", "3.3 Linear systems and the fundamental matrix", "3.5: Exponential matrix", "3.4 Finding solutions using eigenvalues", "Chapter 7: Perturbation methods", "7.1: Algebraic equations", "7.2: Definitions of the order symbols", "7.3: Duffing's Equation", "7.4: Regular perturbation expansion", "7.5 Poincare Method", "5.2: An example of a BVP", "December", "Differential Equations and Boundary Value Problems, Edwards and Penny No", "Differential Equations with Applications and Historical Notes, Simmons No"]}, {"course_id": 22, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 23, "course_code": "CO 255", "course_name": "CO255 - Introduction to Optimization (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Introduction to Optimization (Advanced Level)", "08:30AM - 09:50AM MC 4040", "Linear optimization: feasibility theorems, duality, the simplex algorithm.", "Know a variety of optimization algorithms, including the Simplex method, cutting plane methods, and descent methods.", "Know and apply the definition and properties of convex sets and functions.", "Write the dual of a linear programming problem and understand the properties relating the primal and dual.", "Apply optimization methods to common continuous and discrete problems including game theory, flow, scheduling, and data science.", "Linear programming, Fourier-Motzkin elimination, and Farkas's lemma.", "Duality in linear programming.", "Convex optimization and the KKT conditions.", "Discrete optimization and total unimodularity.", "Applications of total unimodularity to matching and flow problems", "Application of nonlinear optimization to data science", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course.", "If you have questions or concerns about these matters, please email mathadvisor@uwaterloo.ca."]}, {"course_id": 24, "course_code": "PMATH 352", "course_name": "PMATH352 - Complex Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Complex Analysis Winter 2025", "Complex numbers provide the natural setting in which to study differentiable functions.", "Cauchy's theorem plays a central role in this subject, and many important results follow from it: Cauchy's integral formula, the theory of Taylor and Laurent series, Cauchy's residue theorem, the argument principle, the fundamental theorem of algebra, the maximum modulus theorem, Mittag-Lefler expansions, and Weierstrass products.", "We’ll start the course with a basic review of complex numbers, and the complex exponential and logarithm, complex analytic functions, and make our way towards Cauchy's theorem and its wonderful consequences.", "My lectures will draw on a number of books and sources, but I recommend Knopp's Elements of the Theory of Functions, and his Theory of Functions Parts I and II.", "Another reference is Marsden and Hoffman's Basic Complex Analysis.", "3) analytic functions, Cauchy Riemann equations", "6) complex integration", "8) Cauchy's Integral Formulas"]}, {"course_id": 25, "course_code": "AMATH 353", "course_name": "AMATH353 - Partial Differential Equations 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Partial Differential Equations 1 Winter 2025", "08:30AM - 09:20AM", "08:30AM - 09:50AM MC 4063", "Second order linear partial differential equations - the diffusion equation, wave equation, and Laplace's equation.", "Methods of solution - separation of variables and eigenfunction expansions, the Fourier transform.", "Physical interpretation of solutions in terms of diffusion, waves, and steady states.", "First order non-linear partial differential equations and the method of characteristics.", "Develop a mathematical model to explain a scientific principle in the language of Partial Differential Equations (PDEs)", "Determine what analytical method is appropriate to solve a given PDE", "Apply analytical methods to solve PDEs", "Physically interpret solutions of PDEs", "Feb 17-21 Family Day and reading week", "Applied Partial Differential Equations: with Fourier Series and Boundary Value Problems by R Haberman On reserve in DC No $158", "Here are some general instructions for using Crowdmark:", "This course includes the independent development and practice of specific skills, such as solving PDEs.", "Library for research-based assignments"]}, {"course_id": 26, "course_code": "CO 372", "course_name": "CO372 - Portfolio Optimization Models (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Portfolio Optimization Models Fall 2024", "10:00AM - 11:20AM MC 2034", "Computational optimization methodologies underlying portfolio problems in finance.", "Computational linear algebra, determining derivatives, quadratic, and nonlinear optimization.", "Applications of optimization in finance such as volatility surface determination and global minimization for value-at-risk.", "Assignments include formulation and analysis of models used in portfolio optimization as well as some Matlab coding.", "Analyze and code optimization methods for portfolio models.", "Week 1: Linear algebra review", "Week 2: Solving a portfolio optimization problem with QR factorization; symmetric matrices", "Week 3: Three formulations of portfolio optimization", "Week 5: Risk-free security; Sharpe ratio; capital market line", "Week 7: Numerical linear algebra; null space method", "Week 8: Active set methods and parametric programming", "Week 11: Nonlinear programming and applications to portfolio optimization", "Week 12: Advanced topics: arbitrage, factor models, conditional independence, risk parity, machine learning in portfolio optimization", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course.", "·   In Fall 2022, a second self-declaration form was created for students to declare a short-term absence."]}, {"course_id": 27, "course_code": "CS 476", "course_name": "CS476 - Numeric Computation for Financial Modeling (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Numeric Computation for Financial Modeling Winter 2025", "10:00AM - 11:20AM MC 2035", "Erik Hintz", "The interaction of financial models, numerical methods, and computing environments.", "Basic computational aspects of option pricing and hedging.", "Numerical methods for stochastic differential equations, strong and weak convergence.", "Finite difference methods for the Black-Scholes equation.", "Methods for portfolio optimization, effect of data errors on portfolio weights.", "The interaction of financial modes, numerical methods, and computing environments.", "Basic computational aspects of option pricing and hedging.", "Numerical methods for stochastic differential equations, strong and weak convergence.", "Finite difference methods for Black-Scholes equation.", "Methods for portfolio optimization, effect of data errors on portfolio weights.", "apply and understand modern numerical algorithms for use in financial applications.", "The following are the tentative topics in chronological order:", "Introduction to financial markets:", "Introduction to stocks, bonds, options", "no arbitrage pricing", "option pricing on lattices", "Black Scholes model and Ito's Lemma", "Random variate generation", "Option pricing", "VaR and CVaR estimation", "Correlate assets", "PDEs for European and American Options", "Explicit and Implicit Finite Difference Methods", "4. Calibration and Optimization", "Option model calibration", "CVaR portfolio optimization", "non-linear optimzation", "Your Crowdmark submission must include all code and relevant output; code must be reasonably well commented.", "The first weeks will be spent on introducing some basics of financial markets/financial mathematics.", "), usually a make-up examination will take place at a time mutually agreed-upon.", "To have your document considered for regrading you must formulate a request in writing by email to the instructor, providing the problem and a reason for why you believe it should be regraded.", "A mechanic encounters a problem, analyzes it, and fixes it with the tools from her/his toolbox."]}, {"course_id": 28, "course_code": "PMATH 453", "course_name": "PMATH453 - Functional Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Functional Analysis Fall 2024", "08:30AM - 09:20AM E2 1736", "E-mail: camila.sehnem@uwaterloo.ca", "Missed examination"]}, {"course_id": 29, "course_code": "ECON 101", "course_name": "ECON101 - Introduction to Microeconomics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Microeconomics Winter 2025", "ECON 101", "Email: chvandew@uwaterloo.ca", "“ECON 101” must appear in the subject line and the message must include your full name and student ID number.", "This course provides an introduction to microeconomic analysis relevant for understanding the Canadian economy.", "The behaviour of individual consumers and producers, the determination of market prices for commodities and resources, and the role of government policy in the functioning of the market system are the main topics covered.", "View requirements for ECON 101", "The course comprises the theoretical essentials of microeconomics and will serve as a prerequisite for virtually every economics class that you will endeavour to take in the future.", "understand the need for people to make choices and to work together towards overcoming the universal problem of scarcity;", "appreciate the relevance of economics in a changing world;", "apply elements of microeconomic theory to understand how consumers and producers make rational decisions;", "decompose problems into their economic parts.", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Intellectual property includes items such as:", "Please carefully read the Economics Department policy for instructions.", "Economics Department Deferred Final Exam Policy", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Applications for Accommodation", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 30, "course_code": "ECON 102", "course_name": "ECON102 - Introduction to Macroeconomics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Macroeconomics Winter 2025", "ECON 102", "04:00PM - 05:20PM", "View requirements for ECON 102", "Describe important macroeconomic questions and goals, and explain how monetary and fiscal policy may influence economic outcomes.", "Explain and solve simple models and problems.", "Identify strengths and weaknesses of macroeconomic data, models and theories.", "I. Introduction", "Measurement, Accounting and Data", "Gross Domestic Product and the System of National Accounts.", "Inflation and Price Indices.", "Economic Frameworks", "Modelling Concepts and Model Evaluation.", "Concept of Aggregate Demand in the Goods Market.", "Trends, Cycles and Inequality", "Inequality and Poverty concepts and issues.", "Money and Inflation", "Monetary System and role of money.", "Cost of Inflation", "International Economic Concepts, Exchange Rates and Balance of Payments", "The lecture slides cover a variety of standard macroeconomic topics.", "CAUTION: the notation and even the macroeconomic models presented can vary subtly across textbooks.", "Differences in approach and thought can also help to better understand the benefits and drawbacks of different economic theory and methods.", "The format of the mid-term will be multiple-part short-answer questions.", "All deferred Final Exam requests for Economics courses are administered by the Economics Undergraduate Office.", "In order to achieve a healthy balance between work hours and personal life, there will be a finite amount of time I can dedicate to appointments and emails.", "Also know that I am here to support your learning goals, whether they be to understand a subset of the econometric tools, to pass the course, or to achieve a high grade.", "Applications for Accommodation", "Economics Department Deferred Final Exam Policy", "On campus supports", "Other on-campus supports", "Please see WUSA main web page for these and other services and clubs which may provide more specific and personalized support for specific needs.", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 31, "course_code": "ECON 201", "course_name": "ECON201 - Microeconomic Theory for Business and Policy (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Microeconomic Theory for Business and Policy Winter 2025", "ECON 201", "10:00AM - 11:20AM DWE 2527", "Email: pacurry@uwaterloo.ca", "Topics include consumer choice, production, price and output under perfect and imperfect competition, price discrimination and two part pricing, vertical and horizontal firm boundaries and integration, and market structure.", "View requirements for ECON 201", "Possess skills that enable an evaluation of the societal effects of government policy decisions and understand why governments choose to intervene in markets", "1 Demand and Supply", "Economics Department Deferred Final Exam Policy", "Applications for Accommodation", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued."]}, {"course_id": 32, "course_code": "MATH 247", "course_name": "MATH247 - Calculus 3 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Topology on RN: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. (~3 weeks)", "Differentiation: partial differentiability, differentiability, chain rule, [midterm likely here], Taylor polynomials, extreme value problems. (~4 weeks)", "Integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. (~3 weeks)", "Local properties of continuously differentiable functions:  open mapping theorem, inverse function theorem, implicit function theorem. (~2 weeks)", "11:30AM - 12:20PM QNC 2501", "Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem.", "Topology of real n-dimensional space: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. Differential calculus on multivariable functions: partial differentiability, differentiability, chain rule, Taylor polynomials, extreme value problems. Riemann integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem."]}, {"course_id": 33, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 34, "course_code": "PMATH 333", "course_name": "PMATH333 - Introduction to Real Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Real Analysis Fall 2024", "11:30AM - 12:20PM RCH 112", "Topics discussed include the completeness properties of the reals; the density of the rationals; the topology of real n-dimensional space: open and closed sets, connectedness, compactness (by open covers), the Heine-Borel theorem, completeness; sequences in real n-dimensional space: convergence, Cauchy sequences, subsequences, the Bolzano-Weierstrass theorem; multivariable functions: limits, point-wise and uniform continuity, the extreme value theorem, uniform convergence of sequences of functions, Taylor's theorem, term-by-term differentiation of power series; integration in real n-dimensional space: Riemann integrability, Fubini's theorem for continuous functions on rectangles, term-by-term integration of power series.", "Ordered Fields", "The Riemann Integral", "Chapter 4. Sequences and Series of Functions", "Topology in Euclidean Space", "Differentiation in Euclidean Space", "Chapter 7. Jordan Content and Integration in Euclidean Space", "Course materials can be found at http://www.math.uwaterloo.ca/~snew/", "A suggested text is An Introduction to Analysis, by William Wade."]}, {"course_id": 0, "course_code": "AFM 101", "course_name": "AFM101 - Introduction to Financial Accounting (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Financial Accounting Winter 2025", "AFM 101", "AFM 101 081", "AFM 101:", "This course is an introduction to financial accounting.", "View requirements for AFM 101", "Define and use financial accounting terminology.", "Identify and correct basic accounting errors in financial statement accounts.", "Draw conclusions and make recommendations based on financial information.", "Identify and apply the principles of financial reporting.", "Apply basic financial accounting principles in an industry.", "Your access code is available in multiple formats.", "Financial Accounting and MyLab - ebook and access code", "MyLab - access code only", "This course includes the independent development and practice of specific skills, such as understanding financial statements, conducting financial analysis, and preparing financial statements.", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 1, "course_code": "CO 370", "course_name": "CO370 - Deterministic OR Models (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Deterministic OR Models Winter 2025", "Mahtab Alghasi: Wednesdays from 11am-12pm in MC5488", "An applications-oriented course that illustrates how various mathematical models and methods of optimization can be used to solve problems arising in business, industry, and science.", "Formulate computational tasks as optimization problems of appropriate type", "Understand optimization concepts surrounding real world challenges (sensitivity analysis, robust optimization, stochastic optimization)", "Have some familiarity with algorithmic techniques and heuristics for solving optimization problems", "Part I: Formulations", "Flows", "Integer Programs that reduce to Linear Programs", "Part 2: Real World Challenges that can be addressed in Optimization", "Robust optimization", "Stochastic Optimization", "Part 3: Algorithms and Heuristics for Solving Optimization", "Branch and Bound", "Please sign yourself up at", "A missed test will be treated the same as a mark of zero.", "The answer to most common issues as well as how-to videos can be found at", "To avoid issues, only use your UWaterloo email, never use multiple email addresses.", "Illnesses and INC", "In case of a", "short period of illness and a strong performance in the course we should be able to simply", "Copyright Information"]}, {"course_id": 2, "course_code": "ECON 101", "course_name": "ECON101 - Introduction to Microeconomics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Microeconomics Winter 2025", "ECON 101", "Email: chvandew@uwaterloo.ca", "“ECON 101” must appear in the subject line and the message must include your full name and student ID number.", "This course provides an introduction to microeconomic analysis relevant for understanding the Canadian economy.", "The behaviour of individual consumers and producers, the determination of market prices for commodities and resources, and the role of government policy in the functioning of the market system are the main topics covered.", "View requirements for ECON 101", "The course comprises the theoretical essentials of microeconomics and will serve as a prerequisite for virtually every economics class that you will endeavour to take in the future.", "understand the need for people to make choices and to work together towards overcoming the universal problem of scarcity;", "appreciate the relevance of economics in a changing world;", "apply elements of microeconomic theory to understand how consumers and producers make rational decisions;", "decompose problems into their economic parts.", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Intellectual property includes items such as:", "Please carefully read the Economics Department policy for instructions.", "Economics Department Deferred Final Exam Policy", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Applications for Accommodation", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 3, "course_code": "MSE 211", "course_name": "MSE211 - Organizational Behaviour (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Sofiia Doroshenko <sdoroshenko@uwaterloo.ca>", "Introduction to the concepts of learning, person perception, attitudes, and motivation in an organization.", "Discussion of power, control, leadership, and management in light of the above concepts.", "The basic objective of the course is to help you to develop both theoretical and practical approaches for analyzing and making sense of individual and group behaviour in organizational situations.", "Demonstrate understanding of basic theories/concepts of organizational behaviour.", "2. Demonstrate understanding of factors that affect the behaviour of individuals and groups in organizations.", "3. Demonstrate understanding of factors affecting communication effectiveness in organizations.", "Introduction                                            Ch 1", "Personality & Intelligence                     Ch 3", "Lewin’s field theory                               Handouts", "Groups & Teams                                    Ch 11", "Communication                                      Ch 20", "This course includes the independent development and practice of specific skills, such as analyzing and writing about organizational situations.", "In cases where there is further clear evidence of plagiarism regardless of AI% score, the work will be submitted to the Associate Dean as a potential academic integrity offence.", "Keep copies of your pre- and post- grammar-corrected drafts in case we ask to see them.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 4, "course_code": "STAT 340", "course_name": "STAT340 - Stochastic Simulation Methods (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Stochastic Simulation Methods Winter 2025", "STAT 340", "10:30AM - 11:20AM MC 4045", "Office hours: Fridays, 1:00pm - 2:00pm, in M3 - 2106", "Random variate generation in the univariate and multivariate case, Monte Carlo integration, advanced computer implementation, variance reduction, statistical analysis of simulated data, extensions to challenging simulation problems.", "Mathematical treatment of the underlying stochastic concepts and proofs.", "View requirements for STAT 340", "Random variate generation in the univariate and multivariate case, Monte Carlo integration, advanced com- puter implementation, variance reduction, statistical analysis of simulated data, extensions to challenging simulation problems.", "Mathematical treatment of the underlying stochastic concepts and proofs.", "1)  Introduction to simulation and Rprogramming;", "4)  Inversion method, acceptance-rejection method, table-look up method to sample from non-uniform distributions;", "Sampling from multivariate distributions and copulas;", "7)  Monte-Carlo estimators and its properties;", "Further topics time-permitting", "iClicker Rules", "), usually a make-up examination will take place at a time mutually agreed-upon.", "To have your document considered for regrading you must formulate a request in writing by email to the instructor, providing the problem and a reason for why you believe it should be regraded.", "A mechanic encounters a problem, analyzes it, and fixes it with the tools from her/his toolbox."]}, {"course_id": 5, "course_code": "AMATH 242", "course_name": "AMATH242 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 6, "course_code": "CS 370", "course_name": "CS370 - Numerical Computation (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["10:00AM - 11:20AM MC 2034", "Monday -", "Monday", "Principles and practices of basic numerical computation as a key aspect of scientific computation.", "Approximation by splines, fast Fourier transforms, solution of linear and nonlinear equations, differential equations, floating point number systems, error, stability.", "Understand floating point number representations and their limitations", "Analyze rounding error in a floating point calculation", "Perform stability and trunction error analyses of time integrators", "Understand and perform the fast Fourier transform for 1D and 2D numerical data", "Solve linear systems and perform basic linear algebra manipulations using LU factorizations", "Evaluate asymptotic behavior of numerical linear algebra operations in terms of floating point operations", "Use power iteration to find the dominant eigenvalue of a matrix", "Week of Jan 20: Splines & Parameterized Curves", "Week of Mar 3: FFT Applications", "Week of Mar 10: Google Page Rank / Power iteration", "Week of Mar 17: Gaussian Elimination & LU factorization", "Week of Mar 23: Numerical Linear Algebra Norms and Conditioning", "Week of Mar 31: More Numerical Linear Algebra, End of classes", "You should start the first assignment as soon as possible to begin setting up and getting familiar with these tools.", "The official guide for installing and using Jupyter is here: https://docs.jupyter.org/en/latest/install.html", "There are a huge number of online sources of introductory material for working with Jupyter/Python.", "The focus of this course is on learning general numerical computing concepts, rather than the syntax of a particular programming language.", "Please inform the instructor to make the deadline adjustment.", "Your code is an important part of the assignment, and as such it should be readable and well-commented.", "Assignment figures and graphs should be carefully thought out and labelled to present the data and your conclusions in an effective and clear manner.", "Any code and algorithms you write should be sufficiently well documented through code comments or descriptions as to be readily understood.", "This code submission should allow the TAs to run your code if and when necessary to verify the results that your code produces.", "Collaboration and Plagiarism", "We encourage you to discuss general concepts and problems with classmates, TAs, and instructors.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Intellectual property includes items such as:", "Avoiding Academic Offenses", "With these facts in mind, one way that everyone in our class can contribute to a safer and more equitable learning environment is to  stay home when you are ill and, at minimum, wear a mask if you suspect you might be contagious.", "A range of on- and off-campus resources are available including:"]}, {"course_id": 7, "course_code": "CS 371", "course_name": "CS371 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 8, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 9, "course_code": "CO 255", "course_name": "CO255 - Introduction to Optimization (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Introduction to Optimization (Advanced Level)", "08:30AM - 09:50AM MC 4040", "Linear optimization: feasibility theorems, duality, the simplex algorithm.", "Know a variety of optimization algorithms, including the Simplex method, cutting plane methods, and descent methods.", "Know and apply the definition and properties of convex sets and functions.", "Write the dual of a linear programming problem and understand the properties relating the primal and dual.", "Apply optimization methods to common continuous and discrete problems including game theory, flow, scheduling, and data science.", "Linear programming, Fourier-Motzkin elimination, and Farkas's lemma.", "Duality in linear programming.", "Convex optimization and the KKT conditions.", "Discrete optimization and total unimodularity.", "Applications of total unimodularity to matching and flow problems", "Application of nonlinear optimization to data science", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course.", "If you have questions or concerns about these matters, please email mathadvisor@uwaterloo.ca."]}, {"course_id": 10, "course_code": "CO 342", "course_name": "CO342 - Introduction to Graph Theory (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Graph Theory Fall 2024", "08:30AM - 09:20AM", "An introduction to some of the key topics in graph theory: connectivity, planarity, and matchings.", "Prove Kuratowski's chatacterization of planar graph", "Efficiently decide whether a given graph is planar", "Efficiently find a maximum matching in a graph", "Prove the Tutte-Berge formula on the size of a maximum matching", "Prove Menger's Theorem on vertex-disjoint paths", "Week 1: Introduction to minors", "Separating and non-separating cycles", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words."]}, {"course_id": 11, "course_code": "CO 351", "course_name": "CO351 - Network Flow Theory (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["In case of (medical or other) emergencies, or private issues, send E-mail to the instructor.", "Network simplex and primal-dual algorithms.", "Applications to problems of transportation, distribution, job assignments, and critical-path planning.", "The course covers mathematical models for optimization problems on networks.", "The max-flow-min-cut theorem has many applications including its implication of the Menger theorem in graph theory.", "Additionally, the course presents several algorithms for solving optimization problems on networks.", "Linear programming and LP duality are central to the design and analysis of some of the algorithms.", "- maximum flows and minimum cuts (max-flow/min-cut theorem, preflow-push algorithm);", "- applications to problems in transportation, distribution, job assignments, and critical-path planning, etc.", "1 Sep. 4-6 Review linear programming and graph theory", "4 Sep. 23-27 Shortest di-paths problem A1", "11 Nov. 18-22 Minimum cost flow A4", "\"Network Flow Algorithms\" (grad-level book) by D.P.Williamson http://www.networkflowalgs.com/ No", "This is a closed-book exam.", "This is a closed-book exam.", "Students are advised to invest in a reliable internet connection and a reliable device (for a fraction of the cost of UW tuition).", "The answer to most common issues as well as how-to videos can be found at"]}, {"course_id": 12, "course_code": "CO 353", "course_name": "CO353 - Computational Discrete Optimization (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Computational Discrete Optimization Winter 2025", "08:30AM - 09:50AM E2 1732", "Formulations of combinatorial optimization problems, greedy algorithms, dynamic programming, branch-and-bound, cutting plane algorithms, decomposition techniques in integer programming, approximation algorithms.", "A discrete optimization problem, broadly speaking, involves a discrete set of feasible solutions and a real-valued objective function that assigns a value to each solution.", "Discrete optimization problems are of immense practical importance, are solved every day (sometimes each hour or more frequently) by many Fortune 500 companies;  well-known problems in the class include", "This course provides an introduction to the broad field of discrete optimization and covers several classes of commonly used techniques for the design of algorithms, including:", "Dynamic programming,", "We will discuss algorithmic efficiency and introduce the basics of complexity theory.", "For NP-hard problems, we will explore the field of approximation algorithms, which provides efficient methods for computing solutions with guaranteed quality.", "Students will complete two practical projects as part of the course, where they will develop, implement, and test algorithms for specific discrete optimization problems.", "formulate discrete optimization problems;", "identify and apply algorithms that can be used to solve selected discrete optimization problems;", "prove correctness of above algorithms and results related to the structures of discrete optimization problems.", "\"The Design of Approximation Algorithms\" by David Williamson, David Shmoys No", "\"Approximation Algorithms\" by Vijay Vazirani No", "\"The Design of Approximation Algorithm\" by David Williamson, David Shmoys;", "\"Approximation Algorithms\" by Vijay Vazirani.", "Each collaboration and resource used to prepare the submission should be appropriately acknowledged in the submission.", "Projects are to be done in groups of two-three.", "Submissions not following the specified format might be assessed based only on their performance and correctness of their output without providing feedback.", "In case you are not able to participate in some of the assessments please visit this webpage to submit the required information.", "Notice of Recording", "If due to changes in regulations and guidelines, it becomes impossible for us to hold in-person lectures and office hours, the lectures and office hours will be held over Zoom."]}, {"course_id": 14, "course_code": "CO 372", "course_name": "CO372 - Portfolio Optimization Models (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Portfolio Optimization Models Fall 2024", "10:00AM - 11:20AM MC 2034", "Computational optimization methodologies underlying portfolio problems in finance.", "Computational linear algebra, determining derivatives, quadratic, and nonlinear optimization.", "Applications of optimization in finance such as volatility surface determination and global minimization for value-at-risk.", "Assignments include formulation and analysis of models used in portfolio optimization as well as some Matlab coding.", "Analyze and code optimization methods for portfolio models.", "Week 1: Linear algebra review", "Week 2: Solving a portfolio optimization problem with QR factorization; symmetric matrices", "Week 3: Three formulations of portfolio optimization", "Week 5: Risk-free security; Sharpe ratio; capital market line", "Week 7: Numerical linear algebra; null space method", "Week 8: Active set methods and parametric programming", "Week 11: Nonlinear programming and applications to portfolio optimization", "Week 12: Advanced topics: arbitrage, factor models, conditional independence, risk parity, machine learning in portfolio optimization", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course.", "·   In Fall 2022, a second self-declaration form was created for students to declare a short-term absence."]}, {"course_id": 16, "course_code": "CO 452", "course_name": "CO452 - Integer Programming (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Formulation of problems as integer linear programs.", "Solution by branch-and-bound and cutting plane algorithms.", "Introduction to the theory of valid inequalities and polyhedral combinatorics.", "Integer Programming is a mathematical program that can be seen as a linear program with the additional requirement that some (or all) of the variables are required to take on integer values.", "While linear programming is already very useful in modeling problems and can be solved well using either interior point methods or the simplex method, {\\bf Integer programs, or IPs} have a much broader range of applications.", "In this course we will explore an upper-level undergraduate/basic graduate introduction to the topic of Integer Programming.", "Understand basic theory and algorithms behind integer programming approaches", "Basic geometric definitions: Convex/affine/linear combinations.", "Basic polyhedral theory: Faces, facets, extreme points.", "Integral polyhedra and Total Dual Integrality.", "Union of polyhedra and representability.", "Equivalence of optimization and separation.", "Gomory cuts and other cutting planes.", "Rank and closures.", "Branch-and-bound: Basic ideas and extensions.", "Theoretical and computational results.", "This includes technical problems in your submission, like power outage, no internet access, etc.", "Collaboration", "Re-marking policies", "Note that your solution will be very carefully examined during a re-mark.", "In addition such student needs to be in good standing.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as undertanding theory and algorithms for some classes of optimization models.", "Library for research-based assignments"]}, {"course_id": 17, "course_code": "CO 454", "course_name": "CO454 - Scheduling (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Scheduling Spring 2024", "10:00AM - 11:20AM DWE 3517", "E-mail : nikhil.kumar2@uwaterloo.ca", "An overview of practical optimization problems that can be posed as scheduling problems.", "Simple and efficient combinatorial algorithms for easy problems.", "Scheduling problems form a large part of resource allocation problems where sparse resources have to be assigned over time to complete tasks and optimize over one or multiple objectives.", "The course will also contain a brief overview of computational complexity and various techniques for the design of efficient exact and approximate algorithms.", "Scheduling problems: Modeling and notations", "Single-machine Models, Optimal schedules, Exact algorithms", "Computational complexity - P, NP, NP-completeness.", "Multiple-machine models, approximation algorithms.", "Dynamic Programming and its application to scheduling", "Linear and Integer Programming techniques", "Scheduling: Theory, Algorithms, and Systems Author: Michael Pinedo No", "Algorithm Design Authors: Jon Kleinberg and Eva Tardos No"]}, {"course_id": 18, "course_code": "CO 456", "course_name": "CO456 - Introduction to Game Theory (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Game Theory Fall 2024", "A broad introduction to game theory and its applications to the modeling of competition and cooperation in business, economics, and society.", "Classical game theory studies the competitive and cooperative behaviour of rational and self‐interested individuals in strategic environments.", "It speciﬁcally develops beautiful analytic tools to analyze and model situations in which a person’s welfare is a function not only of their own actions, but also those of others.", "This course is meant to be a broad and mathematical introduction to game theory and its appications.", "We will attempt to cover these topics:", "This class is meant to be a broad and mathematical introduction to game theory and its applications.", "Game Theory Basics, Bernhard von Stengel http://www.maths.lse.ac.uk/personal/stengel/lectnotes1-7.pdf No", "An Introduction to Game Theory, Martin J. Osborne https://www.economics.utoronto.ca/osborne/igt/ No", "Mechanism Design and Approximation, Jason D. Hartline http://jasonhartline.com/MDnA/ No", "As the title implies, a basic introduction to various topics in game theory.", "An introduction to game theory and equilibria from a computer science perspective.", "An Introduction to Game Theory, Martin J. Osborne.", "The text contains a section on game theory, and some chapters about matching games.", "Mechanism Design and Approximation, Jason D. Hartline.", "These notes were written for a graduate class, and cover mechanism design from an advanced perspective.", "Your submission must be clear and legible, and in the correct orientation.", "You are expected to work on the assignment problems and submit them well ahead of the deadline, in case of technical difficulty.", "You must write up your own solutions without seeking help from anyone, and list the names of your collaborators in each of the assignment problems involved.", "This is a closed-book exam, no aids are allowed.", "A missed test will be treated the same as a mark of zero.", "This is a closed-book exam, no aids are allowed.", "Re-marking policies", "Note that your solution will be very carefully examined during a re-mark.", "In case of serious illness during the final exam, you may be granted a grade of INC provided that", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as finding Nash equilibria and applying game theory to real life applications.", "Library for research-based assignments"]}, {"course_id": 19, "course_code": "CO 463", "course_name": "CO463 - Convex Optimization and Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Convex Optimization and Analysis Winter 2024", "An introduction to the modern theory of convex programming, its extensions and applications.", "Structure of convex sets, separation and support, subgradient calculus for convex functions, Fenchel conjugacy and duality, Lagrange multipliers.", "Ellipsoid method for convex optimization.", "Determine whether sets and functions are convex and supply a proof", "Compute conjugates and subdifferentials of convex functions and duals of norms", "Determine Lagrange duals and necessary and sufficient conditions for convex optimization problems", "Recognize standard forms of convex programming", "Implement some convex optimization algorithms and use a convex optimization modeling language", "Convex sets", "Convex functions", "Characterization in terms of first and second derivative", "Conjugacy", "Norms and sublinear functions", "Convex optimization", "Standard forms of convex programming", "Basics of monotone operator theory", "First-order methods", "H. Bauschke and P. Combettes, Convex analysis and monotone operator theory in Hilbert spaces, 2017.", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 21, "course_code": "CO 471", "course_name": "CO471 - Semidefinite Optimization (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Semidefinite Optimization Spring 2023", "04:00PM - 05:20PM", "Optimization over convex sets described as the intersection of the set of symmetric, positive semidefinite matrices with affine spaces.", "Theoretical and practical consequences of these formulations.", "Duality theory and algorithms.", "Optimization over convex sets described as the intersections of the set of symmetric, positive semidefinite matrices with affine spaces.", "Formulations of problems from combinatorial optimization, graph theory, number theory, probability and statistics, engineering design and control theory.", "Theoretical and practical consequences of these formulations.", "Duality theory and algorithms.", "Topics Include: Optimization over convex sets described as the intersection of the set of symmetric, positive semideﬁnite matrices with aﬃne spaces: Semideﬁnite optimization vastly generalizes linear programming where variable vectors may be replaced with matrix variables and, in addition to linear equations and inequalities, one may utilize constraints requiring some of the matrix variables to be symmetric and positive semideﬁnite.", "duality theory for semideﬁnite optimization,", "algorithms for semideﬁnite optimization: ellipsoid method, ﬁrst‐order methods and primal‐dual interior‐point methods for semideﬁnite optimization, and approximation algorithms based on semideﬁnite optimization,", "formulations of problems from combinatorial optimization, graph theory, number theory, probability and statistics, complexity analysis of algorithms, engineering design and control theory, theoretical and practical consequences of these formulations,", "Polyhedral and Semidefinite Programming Methods in Combinatorial Optimization"]}, {"course_id": 22, "course_code": "CS 330", "course_name": "CS330 - Management Information Systems (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Management Information Systems Winter 2025", "Email: kevin.lanctot@uwaterloo.ca", "An introduction to information systems and their strategic role in business.", "Topics include types of information systems, organizational requirements, systems development strategies, decision support systems, data and information management, and information systems management, control, and implementation.", "This course is aimed at students who are not CS majors but are interested in continuing their study of computer science beyond first year.", "Make informed decisions about using technology in a business environment.", "Define and explain the characteristics of a variety of business information systems.", "Describe strategic roles and management usage for information systems in business.", "Understand the relationships among various information systems.", "A1", "Feb 25, 27 Topic 4 - Introduction to IS (Ch 1 in text)", "A2", "A4", "A copy of the 7th edition will be placed on 3-hour reserve in the Davis Library.", "Evaluation", "If you miss the final assessment, you will be given an INC if there is a strong reason for missing it (generally a serious medical issue verified by a VIF).", "This course includes the independent development and practice of specific skills, such as designing information systems.", "Library for research-based assignments", "Physical and Mental Health", "See https://uwaterloo.ca/campus-wellness/ for a list of on-campus supports and workshops.", "In particular:", "Intellectual property includes items such as:"]}, {"course_id": 24, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 25, "course_code": "MATH 247", "course_name": "MATH247 - Calculus 3 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Topology on RN: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. (~3 weeks)", "Differentiation: partial differentiability, differentiability, chain rule, [midterm likely here], Taylor polynomials, extreme value problems. (~4 weeks)", "Integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. (~3 weeks)", "Local properties of continuously differentiable functions:  open mapping theorem, inverse function theorem, implicit function theorem. (~2 weeks)", "11:30AM - 12:20PM QNC 2501", "Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem.", "Topology of real n-dimensional space: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. Differential calculus on multivariable functions: partial differentiability, differentiability, chain rule, Taylor polynomials, extreme value problems. Riemann integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem."]}, {"course_id": 26, "course_code": "MATH 239", "course_name": "MATH239 - Introduction to Combinatorics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics Winter 2025", "11:30AM - 12:20PM MC 4059", "09:30AM - 10:20AM MC 4021", "P. Nelson", "08:30AM - 09:20AM QNC 1502", "S. Pfannerer-Mittas", "10:30AM - 11:20AM MC 4058", "11:30AM - 12:20PM MC 4058", "09:30AM - 10:20AM MC 4042", "02:30PM - 03:20PM", "10:30AM - 11:20AM PHY 150", "04:30PM - 05:20PM", "You should have no reason to contact them directly, but you can find their email addresses through Learn.", "First name Last name", "Guilherme Zeus Dantas E Moura", "Theodore Morrison", "Matthew Kroeker", "Introduction to graph theory: colourings, matchings, connectivity, planarity.", "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.", "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 27, "course_code": "MATH 249", "course_name": "MATH249 - Introduction to Combinatorics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics (Advanced Level)", "09:30AM - 10:20AM MC 2017", "For graph theory, while we will focus on the same topics covered in MATH 239 (planarity and bipartite matching), our coverage of those topics will differ substantially in depth and in the techniques that we employ; in particular, we will see striking applications of algebra.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 28, "course_code": "ACTSC 231", "course_name": "ACTSC231 - Introductory Financial Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introductory Financial Mathematics Winter 2025", "11:30AM - 12:20PM QNC 1502", "03:30PM - 04:20PM MC 2065", "Indicate what you've tried and where you're stuck (e.g., \"I thought the solution should be ...", "The theory of rates of interest and discount; annuities and sinking funds with practical applications to mortgage and bond questions.", "This course provides foundational tools for understanding key financial concepts, such as interest rates, annuities, loans, and bonds.", "The principles introduced are essential for performing calculations related to everyday financial matters, like determining mortgage payments or valuing investments, and they play a key role in sectors like banking, insurance, and real estate.", "By the end of the course, you will have a strong grasp of the mathematical techniques used to approach real-world financial problems, laying a foundation for further study and practical applications in finance and actuarial science.", "You can find the Actuarial Science program and plan requirements in the Undergraduate Academic Calendar.", "This course meets several requirements for SOA, CAS, and CIA designations", "It covers most SOA FM Exam learning objectives, except interest rate swaps and determinants of interest rates.", "Bonds]", "General cash flows and portfolios]", "Immunization]", "Define cash flow matching and immunization.", "Yes $89 (6-month digital license)", "We will assign problems from the textbook as practice, and completing these independently is essential for developing and self-assessing your understanding of the material.", "Exam Practice: The individual stage simulates the pressure of closed-book individual exams, preparing you for midterms and the final exam.", "Collaborative Learning: Group work enhances understanding as you learn from and explain concepts to your teammates.", "Strategies for success", "Attend all lectures: Regular attendance helps you grasp key concepts and stay on track with the material.", "A financial calculator is not required, and all questions are designed so that full marks can be achieved with a standard non-financial calculator.", "The final exam covers all topics introduced in the course.", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 29, "course_code": "AFM 102", "course_name": "AFM102 - Introduction to Managerial Accounting (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Managerial Accounting Winter 2025", "AFM 102", "AFM 102 081", "Your instructor checks email and the Ask the Instructor discussion topics frequently and will make every effort to reply to your questions within 24–48 hours, Monday to Friday.", "AFM 102:", "This course is an introduction to the preparation and use of accounting information for management decision-making and reporting.", "Cost behaviour, cost accumulation systems, and short- and long-term decision models are discussed.", "View requirements for AFM 102", "We will be learning how to perform internal analysis including cost-volume-profit analysis, profitability analysis, performance analysis, and capital budgeting analysis.", "Distinguish between various cost classifications and analyze a company’s cost structure to facilitate internal decision-making.", "Apply cost-volume-profit (CVP) analysis to recommend the best course of action given different “what-if” scenarios.", "Explain the budgeting process and prepare components of master and flexible budgets.", "Week 1: Introduction to Managerial Accounting", "Week 2: Cost Terms and Concepts", "Week 4: Cost-Volume-Profit Analysis", "Week 9: Standard Costs and Over Analysis", "Week 11: Relevant Costs and Benefits for Decision-Making", "Week 12: Capital Budgeting Decisions", "Optional No $99 (e-book & Connect Access Code)", "Re-Grading", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 34, "course_code": "CS 338", "course_name": "CS338 - Computer Applications in Business: Databases (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Computer Applications in Business: Databases Winter 2025", "A user-oriented approach to the management of large collections of data.", "Design relational databases", "Construct SQL queries for data retrieval", "Develop strategies for data storage and backup", "Introduction and Terminology", "Relational Data Model", "Relational Algebra", "SQL: Aggregation and Grouping", "SQL: Data and Schema Modifications", "SQL: Null Values", "ER Models", "EER Model", "EER to Relation Mapping", "DBMS Concepts and Architecture", "Transaction Processing", "Database Recovery", "Database Security", "Distributed Databases", "Business Analytics", "We highly recommend thoroughly understanding and verifying your assignment solutions to set yourselves up for success in this course since  exams in CS 338 will be closed-book, and without a strong understanding of the assignments, you may find the exams challenging."]}, {"course_id": 35, "course_code": "ECON 102", "course_name": "ECON102 - Introduction to Macroeconomics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Macroeconomics Winter 2025", "ECON 102", "04:00PM - 05:20PM", "View requirements for ECON 102", "Describe important macroeconomic questions and goals, and explain how monetary and fiscal policy may influence economic outcomes.", "Explain and solve simple models and problems.", "Identify strengths and weaknesses of macroeconomic data, models and theories.", "I. Introduction", "Measurement, Accounting and Data", "Gross Domestic Product and the System of National Accounts.", "Inflation and Price Indices.", "Economic Frameworks", "Modelling Concepts and Model Evaluation.", "Concept of Aggregate Demand in the Goods Market.", "Trends, Cycles and Inequality", "Inequality and Poverty concepts and issues.", "Money and Inflation", "Monetary System and role of money.", "Cost of Inflation", "International Economic Concepts, Exchange Rates and Balance of Payments", "The lecture slides cover a variety of standard macroeconomic topics.", "CAUTION: the notation and even the macroeconomic models presented can vary subtly across textbooks.", "Differences in approach and thought can also help to better understand the benefits and drawbacks of different economic theory and methods.", "The format of the mid-term will be multiple-part short-answer questions.", "All deferred Final Exam requests for Economics courses are administered by the Economics Undergraduate Office.", "In order to achieve a healthy balance between work hours and personal life, there will be a finite amount of time I can dedicate to appointments and emails.", "Also know that I am here to support your learning goals, whether they be to understand a subset of the econometric tools, to pass the course, or to achieve a high grade.", "Applications for Accommodation", "Economics Department Deferred Final Exam Policy", "On campus supports", "Other on-campus supports", "Please see WUSA main web page for these and other services and clubs which may provide more specific and personalized support for specific needs.", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 36, "course_code": "MSE 432", "course_name": "MSE432 - Production and Service Operations Management (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Production and Service Operations Management Winter 2025", "Introduction to management, planning, and control decisions in manufacturing and service settings using quantitative approaches.", "Students are exposed to a number of examples and case studies, and work on a project that involves analysis and discussion of improved designs.", "Develop understanding of the impact of services and production operations in organizations [PA]", "Employ decision-making tools used by operations managers [", "Impact]", "Introduction to OM and Demand Forecasting (I)", "Demand Forecasting (II) and Product Design", "Capacity Planning and Process Design/Facility Layout", "Chapters 11", "Aggregate Operation Planning", "Just-in-Time Production and Project Management", "Demand Forecasting", "Capacity Planning and Process Design/Facility Layout", "Aggregate Operations Planning", "JIT & Project Management"]}, {"course_id": 37, "course_code": "STAT 371", "course_name": "STAT371 - Applied Linear Models and Process Improvement for Business (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Applied Linear Models and Process Improvement for Business Winter 2025", "08:30AM - 09:50AM RCH 307", "Practical and theoretical aspects of simple and multiple linear regression models.", "Strategies for variation reduction such as control charting.", "Applications to problems in business.", "View requirements for STAT 371", "Develop appropriate and meaningful linear regression models to fit to data from business, finance, and other fields for the purpose of answering relevant questions about relationships between the response and explanatory variables in a population or process of interest.", "Use the programming language, R, to fit regression models and to explore course concepts.", "Interpret regression results from R output, draw conclusions from these results in the context of the study, and effectively communicate these results and conclusions to disparate audiences and interest groups.", "Use graphical and numerical analyses to determine whether the fitted model is appropriate with respect to its underlying model assumptions.", "Employ model selection methods and model improvement techniques to improve the fit of the model.", "Explain the mathematical theory behind the results and output from a regression analysis, including the derivation of the distributions of model parameter estimators.", "To understand and apply the statistical concepts, theory and techniques necessary to monitor and assess process performance.", "Simple linear regression review:", "Graphical and numerical summaries of bivariate data", "The simple linear regression model", "Assumptions of the normal model", "Least squares estimation of β0 and β1", "Least squares estimation of σ2", "Interpretation of parameter estimates", "Distribution of", "Confidence intervals and hypothesis tests for β1", "Multiple linear regression:", "The normal model", "Least squares estimation of β", "The hat matrix", "Least squares estimation of σ2", "Distribution of", "Confidence intervals and hypothesis tests for β", "Confidence intervals for µnew and prediction intervals for Ynew", "Modelling categorical variables", "Inference for model parameters", "Analysis of Variance (ANOVA)", "Introduction", "ANOVA table and the F-test", "Additional sum of squares", "Analysis of Variance (ANOVA) (cont'd)", "Indicator variates and additional sum of squares", "General linear hypothesis", "Model Assumptions", "Addressing model inadequacies", "Distribution of residual vector, e", "Leverage and influential observations", "Model selection", "Sequential methods of model selection", "Interaction", "Waterloo Faculty Salary case study", "Fitting linear models to time series data", "Introduction", "Modelling seasonal and trend components", "Mar. 24 - 28", "Introduction to Process Performance", "Introduction", "Control charts", "Average run length", "3-sigma control limits and other signals of process instability", "Control charts for count data", "CUSUM and EWMA control charts", "Housing bubble article example", "Introduction to Regression Modelling, by B. Abraham and J. Ledolter (Brooks/Cole pub.)", "compassionate grounds", "Answers to questions requiring verbal explanations must be in your own words.", "Please be sure to read the posted Assignment Information and Guidelines document for important assignment and submission information (in particular, be sure you understand the 72-hour grace period policy for each assignment).", "In-person concept quizzes will be replaced with online quizzes", "Instructor INC Policy for STAT 371: In the case of a missed final exam with supporting documentation, an INC grade will only be awarded if both the following conditions are satisfied:"]}, {"course_id": 38, "course_code": "STAT 372", "course_name": "STAT372 - Survey Sampling and Experimental Design Techniques for Business (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Survey Sampling and Experimental Design Techniques for Business Winter 2025", "04:00PM - 05:20PM", "E-mail: cboudreau@uwaterloo.ca", "Design and analysis of surveys.", "Management of sample and non-sample error.", "Analysis of variance, factorial experiments, and interaction.", "Basic quantities and definitions", "Inclusion probabilities", "Sampling design", "Horvitz-Thompson estimator", "Horvitz-Thompson estimator under SRS", "Estimating population means, totals and proportions under SRS", "Confidence intervals", "R survey package", "Horvitz-Thompson estimator under STSRS", "Estimating population means, totals and proportions under STSRS", "Confidence intervals", "Sample allocation under STSRS", "Estimating ratios", "Ratio estimator", "Introduction to Hájek estimator", "Chap 5: Clustering and two-stage sampling", "Horvitz-Thompson estimator under two-stage sampling", "SRS-SRS and STSRS-SRS sampling design", "Hájek estimator", "PPS sampling", "Part 2 – Experimental Design", "One-way ANOVA model", "Sum of squares and ANOVA table", "F test", "Estimating factor level means", "Multiple comparisons", "Diagnostic", "Sum of squares and ANOVA table", "F tests", "Analysis when no interaction", "Analysis with interactions", "Diagnostic", "Randomized block design model", "Sum of squares and ANOVA table", "F tests", "Analysis of treatment effects", "I will mostly use slides that I will post on the Stat 372 LEARN website.", "I’m planning to post the slides Monday and Wednesday evenings.", "There is a companion book, entitled R Companion for Sampling Design and Analysis, which can be downloaded for free (pdf format) here.", "Carl-Erik Särndal was my master thesis supervisor, and his book greatly influenced my Stat 372 slides and teaching.", "This is a truly excellent textbook, which explains concepts and theory extremely well and nicely."]}, {"course_id": 39, "course_code": "AMATH 350", "course_name": "AMATH350 - Differential Equations for Business and Economics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Differential Equations for Business and Economics Winter 2025", "11:30AM - 12:20PM MC 4045", "First order ordinary differential equations.", "Applications to continuous compounding and the dynamics of supply and demand.", "Higher order linear ordinary differential equations.", "Systems of linear ordinary differential equations.", "Introduction to linear partial differential equations.", "Ordinary differential equations and their applications", "Systems of linear ordinary differential equations", "Linear partial differential equations and Fourier transform", "Black-Scholes equation and solution", "(Jan 6-10) Introduction to Differential Equations (DEs), Separable Equations, Initial-Value Problems, Applications from Finance", "Dimensional Homogeneity, First-Order Linear Ordinary DEs, Use of Substitutions, Applications from Finance Chapter 2 Posting Assignment 1", "Introduction to Higher-Order Linear Equations: Theoretical Background", "Introduction to Systems of Ordinary Differential Equations, Method of Solution for Homogeneous Systems (Second Order)", "(Mar 3-7) Introduction to Partial Differential Equations, First-order Equations (Partial Integration, Method of Characteristics) Chapter 5", "Second-Order Linear PDEs: Classification, Solution by Partial Integration or Method of Characteristics Chapter 5", "Please submit your assignments early in case of unexpected technical difficulties."]}, {"course_id": 44, "course_code": "CS 230", "course_name": "CS230 - Introduction to Computers and Computer Systems (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computers and Computer Systems Winter 2025", "08:30AM - 09:50AM MC 1085", "10:00AM - 11:20AM MC 2065", "10:30AM - 11:20AM MC 4045", "11:30AM - 12:20PM MC 2017", "MC6228", "TBA", "cs230@uwaterloo.ca", "TBA", "TBA", "An introduction to hardware and software concepts used in computer systems.", "Specific topics include machine-level programming, memory organization, and basic I/O mechanisms.", "Build and Execute", "Program in assembly language", "Understand the basics of machine internals", "Understand the basic elements of the compilation cycle", "Understand the basic principles of multiprocessing", "Note: Submissions for programming questions should only use code and concepts taught during lectures.", "Use of code or advanced concepts not taught in the course will be viewed as a possible violation of Academic Integrity for passing off someone else's work as your own.", "The assignments have a flexible late-day system detailed here:", "These cannot be used on quizzes.", "Multiple assignment extensions can be used on one assignment and/or split across different assignments.", "You do not need a reason to use assignment extensions, you may use them as you please.", "These servers are shared with all other CS courses.", "Students are expected to start assignments early in case something unexpected occurs closer to the deadline.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 45, "course_code": "CS 234", "course_name": "CS234 - Data Types and Structures (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Data Types and Structures Fall 2024", "MarkUs problems Email IAs at the course account", "Microsoft Teams problems Email ISG Coordinator Scott King", "Missed assignment or quiz Email ISG Coordinator Scott King", "Extenuating circumstances Email ISG Coordinator Scott King", "Error in mark entry Email IAs at the course account", "ISG Coordinator", "Introduction to commonly used data types, including lists, sets, mappings, and trees.", "This course introduces widely used and effective methods of data organization, focusing on data structures, their algorithms, and the performance of these algorithms.", "Students who successfully complete the course can use these tools to design and develop efficient programs for a wide variety of applications.", "Audience", "Students wishing to understand how choices made in program design can significantly affect performance and how to make these choices", "Highly recommended for students in Information Management and similar fields and for those in the Mathematics/Teaching plan", "The initial topics in CS 234 will present some material new to those coming out of CS 116 (but covered in CS 136) and some material new to those coming out of CS 136 (but covered in CS 116).", "Co-requisites: None", "Rance D. Neśaise, Data Structures and Algorithms Using Python, Wiley, 2010", "Describe basic quadratic sorting algorithms, such as Selection Sort or Insertion Sort.", "Given a simple, well-specified computational task, write a program in a high-level imperative language (e.g., Python, C, or Java) and generate appropriate test cases.", "Use as appropriate simple types, built-in compound types and control idioms, such as selection, iteration, and recursion.", "Explain the benefits of using abstract data types (ADTs) and data structures, and more generally, the concepts of modularity and data hiding, in solving problems in a wide variety of application areas.", "Understand the differing points of view of the user and provider of an ADT and the use of an interface to communicate between views.", "Explain and use the concepts of asymptotic running time, order notation, worst-case, average-case, and best-case complexity, and lower and upper bounds.", "Given a simple algorithm written in pseudocode, determine and informally justify its asymptotic running time, as expressed in order notation.", "Explain the basic structure of memory, including the distinction between external and internal memory and the concept of paging.", "Explain the complexity of some common implementations of these ADTs.", "Given a well-specified computational problem, determine which (if any) ADTs would be suitable.", "Explain how specialized data structures can lead to efficient solutions to specific real-world problems.", "Topics: User and provider viewpoints, planning and coding stages, abstract data types, modularity and data hiding, ADT Multiset, pseudocode, memory model", "Topics: Best, worst, and average-case running times, order notation, algorithm analysis", "Topics: Graph terminology, ADT Undirected Graph, ADT Directed Graph, implementations, depth-first search, breadth-first search", "Topics: Average-case analysis, interpolation search, heuristics, hashing, bucket sort, radix sort", "Notice of Recording", "Should problems occur, your early drafts serve as backups in case of computer problems, and provide evidence of your having attempted to submit work before the deadline.", "Re-mark requests", "The subject should be \"Ax re-mark request\" for x the number of the assignment.", "In the body of the email, include the rationale for the re-mark and the parts of the question that need atttention.", "Exam policies and missed examinations", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 46, "course_code": "MSE 311", "course_name": "MSE311 - Organizational Design and Technology (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Organizational Design and Technology Winter 2025", "MSE 311", "The instructor Kenneth McKay can be reached via email kmckay@uwaterloo.", "The focus of this course is on the procedures and variables involved in the design and redesign of organizations.", "View requirements for MSE 311", "understand underlying concepts and models which help to explain the impact of technology on organizational design decisions and how these choices can impact organizational performance, short and long term", "understand organizational design in practice", "apply organizational design concepts to student situations", "understand organizational design in the current context", "Knowledge base (D) - 1d - demonstrate understanding of specialized knowledge needed to understand and design organizational structures", "Design (D) - 4a - follow an engineering design methodogy suitable for designing organizational structures", "Use of engineering tools (D) - 5a, 5b, 5c - select, modify, use suitable tools and models for designing organizational structures", "Ethics and equity (D) - 10a - identify ethical and unethical behaviour in the organizational design and use of technology such as AI", "Overview and introduction", "Organizational evolution and design dimensions", "Drivers, criteria for design decisions", "Design constraints and limitations", "Governance and oversight", "Start-ups, small organizations", "Risk management considerations", "The major concepts outlined below illustrate the strategy being used and it is expected that the final assessment scheme will be close to the descriptions below.", "The requirements and process for self-assessment will be shared in the first week.", "The specific AI usage guidelines and requirements will be shared in the first week.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 48, "course_code": "STAT 440", "course_name": "STAT440 - Computational Inference (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Computational Inference Winter 2025", "PHY 313", "Introduction to and application of computational methods in statistical inference.", "Monte Carlo evaluation of statistical procedures, exploration of the likelihood function through graphical and optimization techniques.", "Topics include expectation-maximization, Bootstrapping, Markov Chain Monte Carlo, and other computationally intensive methods.", "A1 Feb 4th", "A4 Apr 3rd"]}, {"course_id": 49, "course_code": "STAT 442", "course_name": "STAT442 - Data Visualization (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Data Visualization Winter 2025", "11:30AM - 12:20PM B1 271", "Discussion Board", "Email", "Response time", "Both human perception and statistical properties inform the methods used to display and visually explore categorical, continuous, time-ordered, map, and high dimensional data.", "Statistical concepts visually presented include variability, densities, quantiles, conditioning, and hypothesis testing.", "Interactive graphics include linking, brushing, motion, and the navigation of high dimensional spaces guided via projection indices.", "Interpret and critique the most commonly used kinds of visualizations today.", "Create a variety of univariate, bivariate, and multivariate graphs using base R and the tidyverse.", "Look up the necessary code to complete additional graphs not covered here.", "Book - Data Science - A First Introduction.", "Book - The Chicago Guide to Multivariate Analysis, Jane E. Miller", "Book - Cool Infographics - Effective Communication with Data Visualization and Design, Randy Krum.", "Industry Paper - Making Data Meaningful, United Nations Economic Commission for Europe.", "Notice of Recording", "No waiving of this penalty will occur for technical issues.", "Details can be found here: https://uwaterloo.ca/math/accommodations", "Phone: 519-884-0000 extension 213", "Lots of people look like they have it together in public and online when they're a mess inside too.", "They got you into university, so they've already done most of the work, but at this point, the most they can really do for you decide if you can get into graduate school before doing industry experience.", "Don't let that be your reason for thinking this is as good as it gets.", "In particular:", "Please inform me of these at the start of the course."]}, {"course_id": 50, "course_code": "STAT 444", "course_name": "STAT444 - Statistical Learning - Advanced Regression (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 1, "major_name": "Mathematical Optimization - Business Specialization (Bachelor of Mathematics - Honours)", "topics": ["Statistical Learning - Advanced Regression Spring 2024", "Topics cover a wide selection of advanced methods useful to address the challenges arising from real-world and high-dimensional data; methods include robust regression, nonparametric regression such as smoothing splines, kernels, additive models, tree based methods, boosting and bagging, and penalized linear regression methods such as the ridge regression, lasso, and their variants.", "Students will gain an appreciation of the mathematical and statistical concepts underlying the methods and also computational experience in applying the methods to real data.", "Topics cover a wide selection of advanced methods useful to address the challenges arising from real-world and high-dimensional data; methods include robust regression, nonparametric regression such as smoothing splines, kernels, additive models, tree-based methods, boosting and bagging, and penalized linear regression methods such as the ridge regression, lasso, and their variants.", "Students will gain an appreciation of the mathematical and statistical concepts underlying the methods and also computational experience in applying the methods to real data.", "2 Nonlinear Regression I: Basis functions and Splines 3 – 4", "4 Predictive Modelling I: Error Estimation and Model Assessment 7 – 9", "Generalized Additive Models: An Introduction with R https://www.taylorfrancis.com/books/mono/10.1201/9781315370279/generalized-additive-models-simon-wood No"]}, {"course_id": 0, "course_code": "AFM 101", "course_name": "AFM101 - Introduction to Financial Accounting (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Financial Accounting Winter 2025", "AFM 101", "AFM 101 081", "AFM 101:", "This course is an introduction to financial accounting.", "View requirements for AFM 101", "Define and use financial accounting terminology.", "Identify and correct basic accounting errors in financial statement accounts.", "Draw conclusions and make recommendations based on financial information.", "Identify and apply the principles of financial reporting.", "Apply basic financial accounting principles in an industry.", "Your access code is available in multiple formats.", "Financial Accounting and MyLab - ebook and access code", "MyLab - access code only", "This course includes the independent development and practice of specific skills, such as understanding financial statements, conducting financial analysis, and preparing financial statements.", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 1, "course_code": "CO 370", "course_name": "CO370 - Deterministic OR Models (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Deterministic OR Models Winter 2025", "Mahtab Alghasi: Wednesdays from 11am-12pm in MC5488", "An applications-oriented course that illustrates how various mathematical models and methods of optimization can be used to solve problems arising in business, industry, and science.", "Formulate computational tasks as optimization problems of appropriate type", "Understand optimization concepts surrounding real world challenges (sensitivity analysis, robust optimization, stochastic optimization)", "Have some familiarity with algorithmic techniques and heuristics for solving optimization problems", "Part I: Formulations", "Flows", "Integer Programs that reduce to Linear Programs", "Part 2: Real World Challenges that can be addressed in Optimization", "Robust optimization", "Stochastic Optimization", "Part 3: Algorithms and Heuristics for Solving Optimization", "Branch and Bound", "Please sign yourself up at", "A missed test will be treated the same as a mark of zero.", "The answer to most common issues as well as how-to videos can be found at", "To avoid issues, only use your UWaterloo email, never use multiple email addresses.", "Illnesses and INC", "In case of a", "short period of illness and a strong performance in the course we should be able to simply", "Copyright Information"]}, {"course_id": 2, "course_code": "ECON 101", "course_name": "ECON101 - Introduction to Microeconomics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Microeconomics Winter 2025", "ECON 101", "Email: chvandew@uwaterloo.ca", "“ECON 101” must appear in the subject line and the message must include your full name and student ID number.", "This course provides an introduction to microeconomic analysis relevant for understanding the Canadian economy.", "The behaviour of individual consumers and producers, the determination of market prices for commodities and resources, and the role of government policy in the functioning of the market system are the main topics covered.", "View requirements for ECON 101", "The course comprises the theoretical essentials of microeconomics and will serve as a prerequisite for virtually every economics class that you will endeavour to take in the future.", "understand the need for people to make choices and to work together towards overcoming the universal problem of scarcity;", "appreciate the relevance of economics in a changing world;", "apply elements of microeconomic theory to understand how consumers and producers make rational decisions;", "decompose problems into their economic parts.", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Intellectual property includes items such as:", "Please carefully read the Economics Department policy for instructions.", "Economics Department Deferred Final Exam Policy", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Applications for Accommodation", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 3, "course_code": "MSE 211", "course_name": "MSE211 - Organizational Behaviour (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Sofiia Doroshenko <sdoroshenko@uwaterloo.ca>", "Introduction to the concepts of learning, person perception, attitudes, and motivation in an organization.", "Discussion of power, control, leadership, and management in light of the above concepts.", "The basic objective of the course is to help you to develop both theoretical and practical approaches for analyzing and making sense of individual and group behaviour in organizational situations.", "Demonstrate understanding of basic theories/concepts of organizational behaviour.", "2. Demonstrate understanding of factors that affect the behaviour of individuals and groups in organizations.", "3. Demonstrate understanding of factors affecting communication effectiveness in organizations.", "Introduction                                            Ch 1", "Personality & Intelligence                     Ch 3", "Lewin’s field theory                               Handouts", "Groups & Teams                                    Ch 11", "Communication                                      Ch 20", "This course includes the independent development and practice of specific skills, such as analyzing and writing about organizational situations.", "In cases where there is further clear evidence of plagiarism regardless of AI% score, the work will be submitted to the Associate Dean as a potential academic integrity offence.", "Keep copies of your pre- and post- grammar-corrected drafts in case we ask to see them.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 4, "course_code": "STAT 340", "course_name": "STAT340 - Stochastic Simulation Methods (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Stochastic Simulation Methods Winter 2025", "STAT 340", "10:30AM - 11:20AM MC 4045", "Office hours: Fridays, 1:00pm - 2:00pm, in M3 - 2106", "Random variate generation in the univariate and multivariate case, Monte Carlo integration, advanced computer implementation, variance reduction, statistical analysis of simulated data, extensions to challenging simulation problems.", "Mathematical treatment of the underlying stochastic concepts and proofs.", "View requirements for STAT 340", "Random variate generation in the univariate and multivariate case, Monte Carlo integration, advanced com- puter implementation, variance reduction, statistical analysis of simulated data, extensions to challenging simulation problems.", "Mathematical treatment of the underlying stochastic concepts and proofs.", "1)  Introduction to simulation and Rprogramming;", "4)  Inversion method, acceptance-rejection method, table-look up method to sample from non-uniform distributions;", "Sampling from multivariate distributions and copulas;", "7)  Monte-Carlo estimators and its properties;", "Further topics time-permitting", "iClicker Rules", "), usually a make-up examination will take place at a time mutually agreed-upon.", "To have your document considered for regrading you must formulate a request in writing by email to the instructor, providing the problem and a reason for why you believe it should be regraded.", "A mechanic encounters a problem, analyzes it, and fixes it with the tools from her/his toolbox."]}, {"course_id": 5, "course_code": "AMATH 242", "course_name": "AMATH242 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 6, "course_code": "CS 370", "course_name": "CS370 - Numerical Computation (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["10:00AM - 11:20AM MC 2034", "Monday -", "Monday", "Principles and practices of basic numerical computation as a key aspect of scientific computation.", "Approximation by splines, fast Fourier transforms, solution of linear and nonlinear equations, differential equations, floating point number systems, error, stability.", "Understand floating point number representations and their limitations", "Analyze rounding error in a floating point calculation", "Perform stability and trunction error analyses of time integrators", "Understand and perform the fast Fourier transform for 1D and 2D numerical data", "Solve linear systems and perform basic linear algebra manipulations using LU factorizations", "Evaluate asymptotic behavior of numerical linear algebra operations in terms of floating point operations", "Use power iteration to find the dominant eigenvalue of a matrix", "Week of Jan 20: Splines & Parameterized Curves", "Week of Mar 3: FFT Applications", "Week of Mar 10: Google Page Rank / Power iteration", "Week of Mar 17: Gaussian Elimination & LU factorization", "Week of Mar 23: Numerical Linear Algebra Norms and Conditioning", "Week of Mar 31: More Numerical Linear Algebra, End of classes", "You should start the first assignment as soon as possible to begin setting up and getting familiar with these tools.", "The official guide for installing and using Jupyter is here: https://docs.jupyter.org/en/latest/install.html", "There are a huge number of online sources of introductory material for working with Jupyter/Python.", "The focus of this course is on learning general numerical computing concepts, rather than the syntax of a particular programming language.", "Please inform the instructor to make the deadline adjustment.", "Your code is an important part of the assignment, and as such it should be readable and well-commented.", "Assignment figures and graphs should be carefully thought out and labelled to present the data and your conclusions in an effective and clear manner.", "Any code and algorithms you write should be sufficiently well documented through code comments or descriptions as to be readily understood.", "This code submission should allow the TAs to run your code if and when necessary to verify the results that your code produces.", "Collaboration and Plagiarism", "We encourage you to discuss general concepts and problems with classmates, TAs, and instructors.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Intellectual property includes items such as:", "Avoiding Academic Offenses", "With these facts in mind, one way that everyone in our class can contribute to a safer and more equitable learning environment is to  stay home when you are ill and, at minimum, wear a mask if you suspect you might be contagious.", "A range of on- and off-campus resources are available including:"]}, {"course_id": 7, "course_code": "CS 371", "course_name": "CS371 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 8, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 9, "course_code": "CO 255", "course_name": "CO255 - Introduction to Optimization (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Introduction to Optimization (Advanced Level)", "08:30AM - 09:50AM MC 4040", "Linear optimization: feasibility theorems, duality, the simplex algorithm.", "Know a variety of optimization algorithms, including the Simplex method, cutting plane methods, and descent methods.", "Know and apply the definition and properties of convex sets and functions.", "Write the dual of a linear programming problem and understand the properties relating the primal and dual.", "Apply optimization methods to common continuous and discrete problems including game theory, flow, scheduling, and data science.", "Linear programming, Fourier-Motzkin elimination, and Farkas's lemma.", "Duality in linear programming.", "Convex optimization and the KKT conditions.", "Discrete optimization and total unimodularity.", "Applications of total unimodularity to matching and flow problems", "Application of nonlinear optimization to data science", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course.", "If you have questions or concerns about these matters, please email mathadvisor@uwaterloo.ca."]}]