[{"course_id": 10, "course_code": "CO 342", "course_name": "CO342 - Introduction to Graph Theory (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Graph Theory Fall 2024", "08:30AM - 09:20AM", "An introduction to some of the key topics in graph theory: connectivity, planarity, and matchings.", "Prove Kuratowski's chatacterization of planar graph", "Efficiently decide whether a given graph is planar", "Efficiently find a maximum matching in a graph", "Prove the Tutte-Berge formula on the size of a maximum matching", "Prove Menger's Theorem on vertex-disjoint paths", "Week 1: Introduction to minors", "Separating and non-separating cycles", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words."]}, {"course_id": 12, "course_code": "CO 372", "course_name": "CO372 - Portfolio Optimization Models (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Portfolio Optimization Models Fall 2024", "10:00AM - 11:20AM MC 2034", "Computational optimization methodologies underlying portfolio problems in finance.", "Computational linear algebra, determining derivatives, quadratic, and nonlinear optimization.", "Applications of optimization in finance such as volatility surface determination and global minimization for value-at-risk.", "Assignments include formulation and analysis of models used in portfolio optimization as well as some Matlab coding.", "Analyze and code optimization methods for portfolio models.", "Week 1: Linear algebra review", "Week 2: Solving a portfolio optimization problem with QR factorization; symmetric matrices", "Week 3: Three formulations of portfolio optimization", "Week 5: Risk-free security; Sharpe ratio; capital market line", "Week 7: Numerical linear algebra; null space method", "Week 8: Active set methods and parametric programming", "Week 11: Nonlinear programming and applications to portfolio optimization", "Week 12: Advanced topics: arbitrage, factor models, conditional independence, risk parity, machine learning in portfolio optimization", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course.", "·   In Fall 2022, a second self-declaration form was created for students to declare a short-term absence."]}, {"course_id": 13, "course_code": "CS 330", "course_name": "CS330 - Management Information Systems (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Management Information Systems Winter 2025", "Email: kevin.lanctot@uwaterloo.ca", "An introduction to information systems and their strategic role in business.", "Topics include types of information systems, organizational requirements, systems development strategies, decision support systems, data and information management, and information systems management, control, and implementation.", "This course is aimed at students who are not CS majors but are interested in continuing their study of computer science beyond first year.", "Make informed decisions about using technology in a business environment.", "Define and explain the characteristics of a variety of business information systems.", "Describe strategic roles and management usage for information systems in business.", "Understand the relationships among various information systems.", "A1", "Feb 25, 27 Topic 4 - Introduction to IS (Ch 1 in text)", "A2", "A4", "A copy of the 7th edition will be placed on 3-hour reserve in the Davis Library.", "Evaluation", "If you miss the final assessment, you will be given an INC if there is a strong reason for missing it (generally a serious medical issue verified by a VIF).", "This course includes the independent development and practice of specific skills, such as designing information systems.", "Library for research-based assignments", "Physical and Mental Health", "See https://uwaterloo.ca/campus-wellness/ for a list of on-campus supports and workshops.", "In particular:", "Intellectual property includes items such as:"]}, {"course_id": 15, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 16, "course_code": "MATH 247", "course_name": "MATH247 - Calculus 3 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Topology on RN: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. (~3 weeks)", "Differentiation: partial differentiability, differentiability, chain rule, [midterm likely here], Taylor polynomials, extreme value problems. (~4 weeks)", "Integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. (~3 weeks)", "Local properties of continuously differentiable functions:  open mapping theorem, inverse function theorem, implicit function theorem. (~2 weeks)", "11:30AM - 12:20PM QNC 2501", "Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem.", "Topology of real n-dimensional space: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. Differential calculus on multivariable functions: partial differentiability, differentiability, chain rule, Taylor polynomials, extreme value problems. Riemann integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem."]}, {"course_id": 17, "course_code": "MATH 239", "course_name": "MATH239 - Introduction to Combinatorics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics Winter 2025", "11:30AM - 12:20PM MC 4059", "09:30AM - 10:20AM MC 4021", "P. Nelson", "08:30AM - 09:20AM QNC 1502", "S. Pfannerer-Mittas", "10:30AM - 11:20AM MC 4058", "11:30AM - 12:20PM MC 4058", "09:30AM - 10:20AM MC 4042", "02:30PM - 03:20PM", "10:30AM - 11:20AM PHY 150", "04:30PM - 05:20PM", "You should have no reason to contact them directly, but you can find their email addresses through Learn.", "First name Last name", "Guilherme Zeus Dantas E Moura", "Theodore Morrison", "Matthew Kroeker", "Introduction to graph theory: colourings, matchings, connectivity, planarity.", "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.", "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 18, "course_code": "MATH 249", "course_name": "MATH249 - Introduction to Combinatorics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics (Advanced Level)", "09:30AM - 10:20AM MC 2017", "For graph theory, while we will focus on the same topics covered in MATH 239 (planarity and bipartite matching), our coverage of those topics will differ substantially in depth and in the techniques that we employ; in particular, we will see striking applications of algebra.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 19, "course_code": "CS 234", "course_name": "CS234 - Data Types and Structures (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Data Types and Structures Fall 2024", "MarkUs problems Email IAs at the course account", "Microsoft Teams problems Email ISG Coordinator Scott King", "Missed assignment or quiz Email ISG Coordinator Scott King", "Extenuating circumstances Email ISG Coordinator Scott King", "Error in mark entry Email IAs at the course account", "ISG Coordinator", "Introduction to commonly used data types, including lists, sets, mappings, and trees.", "This course introduces widely used and effective methods of data organization, focusing on data structures, their algorithms, and the performance of these algorithms.", "Students who successfully complete the course can use these tools to design and develop efficient programs for a wide variety of applications.", "Audience", "Students wishing to understand how choices made in program design can significantly affect performance and how to make these choices", "Highly recommended for students in Information Management and similar fields and for those in the Mathematics/Teaching plan", "The initial topics in CS 234 will present some material new to those coming out of CS 116 (but covered in CS 136) and some material new to those coming out of CS 136 (but covered in CS 116).", "Co-requisites: None", "Rance D. Neśaise, Data Structures and Algorithms Using Python, Wiley, 2010", "Describe basic quadratic sorting algorithms, such as Selection Sort or Insertion Sort.", "Given a simple, well-specified computational task, write a program in a high-level imperative language (e.g., Python, C, or Java) and generate appropriate test cases.", "Use as appropriate simple types, built-in compound types and control idioms, such as selection, iteration, and recursion.", "Explain the benefits of using abstract data types (ADTs) and data structures, and more generally, the concepts of modularity and data hiding, in solving problems in a wide variety of application areas.", "Understand the differing points of view of the user and provider of an ADT and the use of an interface to communicate between views.", "Explain and use the concepts of asymptotic running time, order notation, worst-case, average-case, and best-case complexity, and lower and upper bounds.", "Given a simple algorithm written in pseudocode, determine and informally justify its asymptotic running time, as expressed in order notation.", "Explain the basic structure of memory, including the distinction between external and internal memory and the concept of paging.", "Explain the complexity of some common implementations of these ADTs.", "Given a well-specified computational problem, determine which (if any) ADTs would be suitable.", "Explain how specialized data structures can lead to efficient solutions to specific real-world problems.", "Topics: User and provider viewpoints, planning and coding stages, abstract data types, modularity and data hiding, ADT Multiset, pseudocode, memory model", "Topics: Best, worst, and average-case running times, order notation, algorithm analysis", "Topics: Graph terminology, ADT Undirected Graph, ADT Directed Graph, implementations, depth-first search, breadth-first search", "Topics: Average-case analysis, interpolation search, heuristics, hashing, bucket sort, radix sort", "Notice of Recording", "Should problems occur, your early drafts serve as backups in case of computer problems, and provide evidence of your having attempted to submit work before the deadline.", "Re-mark requests", "The subject should be \"Ax re-mark request\" for x the number of the assignment.", "In the body of the email, include the rationale for the re-mark and the parts of the question that need atttention.", "Exam policies and missed examinations", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 20, "course_code": "STAT 331", "course_name": "STAT331 - Applied Linear Models (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Applied Linear Models Winter 2025", "08:30AM - 09:50AM MC 4020", "02:30PM - 03:20PM", "RCH 101", "Thursdays from 3:00-4:00pm in M3 3021", "Modelling the relationship between a response variable and several explanatory variables (an output-input system) via regression models.", "Model diagnostics and improvement.", "Algorithms for variable selection.", "Review of basic Normal theory, t, chi-squared, and F distributions.", "Simple linear regression.", "Analysis of variance.", "Multiple linear regression, variable selection techniques, indicator variables, diagnostics.", "Brief introduction to non-linear regression, factorial experimentation.", "Registered students can enroll in the class discussion board through Piazza.", "Search for your question first before posting.", "Do not expect a full solution to your question.", "To help maintain a safe, respectful, and productive community in which we – students and teaching team alike – can take risks in our learning/teaching, tackle challenging concepts, and ultimately grow as learners, we should endeavor to follow these mutual expectations:", "Explain the main concepts of linear regression models.", "Understand the methods of least squares and maximum likelihood estimation for model parameters.", "Interpret the model and its parameters (e.g., regression coefficients) in the context of any application.", "Draw inferences from a fitted model about the parameters of interest and make predictions.", "Apply the previous two outcomes when fitting linear models to real data using R.", "Assess model quality by diagnosing violations in underlying model assumptions (and identify strategies for improvement).", "Evaluate competing fitted models built using various model selection methods (and choose between them).", "Introduction", "The Straight Line Model", "Model formulation and interpretation", "Least squares estimation", "Mean response and residual variance estimation", "Introduction to R/RStudio", "Maximum likelihood estimation", "Estimators and their properties", "Important distributions", "Distributions of estimators", "Confidence intervals", "O - Ch. 2-4", "Straight Line Model in R", "Prediction intervals", "Intervals in R", "Hypothesis testing", "O - Ch. 4-5", "ANOVA and F test", "Model limits", "Data transformations", "O - Ch. 4-6", "O - Ch. 7", "A1 and Q1 Solutions", "Multivariate normal distribution", "The Linear Model", "Examples", "O - Ch. 8-9", "Estimation", "Estimators and their properties", "Distributions of estimators", "O - Ch. 9, 11, 12", "ANOVA and F test", "Significance tests", "General linear hypothesis", "O - Ch. 9, 11, 12", "A2 and Midterm Solutions", "Case Study: South African heart disease", "Nested models", "Additional sum of squares", "O - Ch. 12", "Outliers", "O - Ch. 13-14", "Influence", "O - Ch. 14-15", "A3 and Q2 Solutions", "One-variable-at-a-time selection methods", "Criteria-based selection methods", "O - Ch. 16", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solve exercises from the textbook on your own.", "Introduction to Regression Modeling by Abraham and Ledolter This textbook is an optional reference book (available for free on LEARN).", "R and R-Studio Free software.", "To serve as an opportunity to demonstrate your understanding, application, and integration of the course material, including practical application of the skills/concepts with the statistical software, R.", "Missed Assignment: The time window to complete these assessments are generous and, in general, a sickness lasting a couple of days will not be enough of a reason to ask for alternative accommodations and/or extension.", "Tips for Success", "Students should critically compare their work with available solutions and against the solutions of fellow classmates.", "Notice of Recording", "To help you decide if you should isolate, you can use the provincial self-assessment tool.", "In the scenario where we must transition back online the following contingencies will be used:", "These materials are made available for the personal use of students registered in the current offering of this course.", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical proofs and the fitting, interpretation, and assessment of linear models in real applications.", "Library for research-based assignments"]}, {"course_id": 21, "course_code": "STAT 333", "course_name": "STAT333 - Stochastic Processes 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM DC 1350", "04:00PM - 05:20PM", "Erik Hintz: Fridays, 2:00pm - 3:00pm, in M3-2106", "Requests must be emailed to: sasugradadv@uwaterloo.ca", "Topics cover generating functions, conditional probability distributions and conditional expectation, discrete-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, applications including the random walk, the gambler's ruin problem, and the Galton-Watson branching process, an introduction to counting processes, connections between the exponential distribution and Poisson process, and non-homogeneous and compound Poisson processes.", "use moment generating functions as a tool to determine expected values and identify probability distributions of random variables;", "use the law of total expectation to calculate expected values and probabilities through the principle of conditioning;", "specify a discrete-time Markov chain (DTMC), in terms of its transition probability matrix and initial conditions, and calculate various transition probabilities;", "classify the states of a DTMC;", "define fundamental DTMC concepts including irreducibility, periodicity, and recurrence/transience;", "find limiting/stationary probability distributions for certain DTMCs through the use of the Basic Limit Theorem;", "calculate absorption probabilities and expected absorption times for DTMCs using the principle of conditioning with respect to the first transition;", "Week 11 March 24 - March 28 Chap 4: Exponential Distribution & Poisson Processes Tutorial Assignment 2", "Week 12 March 31 - April 4 Chap 4: Exponential Distribution & Poisson Processes Tutorial Test 3", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solving exercises from the Course Notes on your own.", "Introduction to Probability Models by Sheldon M. Ross (2019)"]}, {"course_id": 22, "course_code": "AFM 102", "course_name": "AFM102 - Introduction to Managerial Accounting (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Managerial Accounting Winter 2025", "AFM 102", "AFM 102 081", "Your instructor checks email and the Ask the Instructor discussion topics frequently and will make every effort to reply to your questions within 24–48 hours, Monday to Friday.", "AFM 102:", "This course is an introduction to the preparation and use of accounting information for management decision-making and reporting.", "Cost behaviour, cost accumulation systems, and short- and long-term decision models are discussed.", "View requirements for AFM 102", "We will be learning how to perform internal analysis including cost-volume-profit analysis, profitability analysis, performance analysis, and capital budgeting analysis.", "Distinguish between various cost classifications and analyze a company’s cost structure to facilitate internal decision-making.", "Apply cost-volume-profit (CVP) analysis to recommend the best course of action given different “what-if” scenarios.", "Explain the budgeting process and prepare components of master and flexible budgets.", "Week 1: Introduction to Managerial Accounting", "Week 2: Cost Terms and Concepts", "Week 4: Cost-Volume-Profit Analysis", "Week 9: Standard Costs and Over Analysis", "Week 11: Relevant Costs and Benefits for Decision-Making", "Week 12: Capital Budgeting Decisions", "Optional No $99 (e-book & Connect Access Code)", "Re-Grading", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 23, "course_code": "ECON 102", "course_name": "ECON102 - Introduction to Macroeconomics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Macroeconomics Winter 2025", "ECON 102", "04:00PM - 05:20PM", "View requirements for ECON 102", "Describe important macroeconomic questions and goals, and explain how monetary and fiscal policy may influence economic outcomes.", "Explain and solve simple models and problems.", "Identify strengths and weaknesses of macroeconomic data, models and theories.", "I. Introduction", "Measurement, Accounting and Data", "Gross Domestic Product and the System of National Accounts.", "Inflation and Price Indices.", "Economic Frameworks", "Modelling Concepts and Model Evaluation.", "Concept of Aggregate Demand in the Goods Market.", "Trends, Cycles and Inequality", "Inequality and Poverty concepts and issues.", "Money and Inflation", "Monetary System and role of money.", "Cost of Inflation", "International Economic Concepts, Exchange Rates and Balance of Payments", "The lecture slides cover a variety of standard macroeconomic topics.", "CAUTION: the notation and even the macroeconomic models presented can vary subtly across textbooks.", "Differences in approach and thought can also help to better understand the benefits and drawbacks of different economic theory and methods.", "The format of the mid-term will be multiple-part short-answer questions.", "All deferred Final Exam requests for Economics courses are administered by the Economics Undergraduate Office.", "In order to achieve a healthy balance between work hours and personal life, there will be a finite amount of time I can dedicate to appointments and emails.", "Also know that I am here to support your learning goals, whether they be to understand a subset of the econometric tools, to pass the course, or to achieve a high grade.", "Applications for Accommodation", "Economics Department Deferred Final Exam Policy", "On campus supports", "Other on-campus supports", "Please see WUSA main web page for these and other services and clubs which may provide more specific and personalized support for specific needs.", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 24, "course_code": "MSE 311", "course_name": "MSE311 - Organizational Design and Technology (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Organizational Design and Technology Winter 2025", "MSE 311", "The instructor Kenneth McKay can be reached via email kmckay@uwaterloo.", "The focus of this course is on the procedures and variables involved in the design and redesign of organizations.", "View requirements for MSE 311", "understand underlying concepts and models which help to explain the impact of technology on organizational design decisions and how these choices can impact organizational performance, short and long term", "understand organizational design in practice", "apply organizational design concepts to student situations", "understand organizational design in the current context", "Knowledge base (D) - 1d - demonstrate understanding of specialized knowledge needed to understand and design organizational structures", "Design (D) - 4a - follow an engineering design methodogy suitable for designing organizational structures", "Use of engineering tools (D) - 5a, 5b, 5c - select, modify, use suitable tools and models for designing organizational structures", "Ethics and equity (D) - 10a - identify ethical and unethical behaviour in the organizational design and use of technology such as AI", "Overview and introduction", "Organizational evolution and design dimensions", "Drivers, criteria for design decisions", "Design constraints and limitations", "Governance and oversight", "Start-ups, small organizations", "Risk management considerations", "The major concepts outlined below illustrate the strategy being used and it is expected that the final assessment scheme will be close to the descriptions below.", "The requirements and process for self-assessment will be shared in the first week.", "The specific AI usage guidelines and requirements will be shared in the first week.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 25, "course_code": "MSE 432", "course_name": "MSE432 - Production and Service Operations Management (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Production and Service Operations Management Winter 2025", "Introduction to management, planning, and control decisions in manufacturing and service settings using quantitative approaches.", "Students are exposed to a number of examples and case studies, and work on a project that involves analysis and discussion of improved designs.", "Develop understanding of the impact of services and production operations in organizations [PA]", "Employ decision-making tools used by operations managers [", "Impact]", "Introduction to OM and Demand Forecasting (I)", "Demand Forecasting (II) and Product Design", "Capacity Planning and Process Design/Facility Layout", "Chapters 11", "Aggregate Operation Planning", "Just-in-Time Production and Project Management", "Demand Forecasting", "Capacity Planning and Process Design/Facility Layout", "Aggregate Operations Planning", "JIT & Project Management"]}, {"course_id": 26, "course_code": "AMATH 250", "course_name": "AMATH250 - Introduction to Differential Equations (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Differential Equations Winter 2025", "Solving linear differential equations: first- and second-order scalar equations and first-order vector equations.", "The main purpose of the course is to explore how first and second order differential equations (DEs) are used to model physical systems and predict their behaviour.", "first order linear DE models of compartment problems, atomic decay, and bodies in motion;", "first order separable DE models of population growth;", "a first order exact DE model of the electric dipole;", "second order linear DE models for oscillatory systems such as mass-spring-damper systems and electrical circuits;", "second order nonlinear DE models for suspended cables and rocket motion;", "linear vector DE models of multiple compartment problems and species interactions.", "Both analytical solution techniques and qualitative methods (direction field analysis, dimensional analysis, and phase portraits) will be presented as ways to gain information about system behaviour.", "We will investigate conditions for existence, uniqueness, and continuity of solutions of both first and second order initial value problems, and for systems in the plane.", "Maple will be used to generate numerical and graphical solutions, to illustrate concepts graphically, and to explore model behaviour.", "increase your comprehension of some of the many ways that differential equations can help us understand the real world;", "develop your ability to understand a mathematical model for a specific situation;", "explore analytical and qualitative solution methods for first and second order differential equations, and the use of Maple; and", "Please choose only one of the two options below.", "Submission Instructions", "Copyright Notice", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as solving differential equations.", "Library for research-based assignments"]}, {"course_id": 27, "course_code": "AMATH 251", "course_name": "AMATH251 - Introduction to Differential Equations (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Introduction to Differential Equations (Advanced Level)", "Email: cbauch@uwaterloo.ca", "Email: apunnavajhala@uwaterloo.ca", "This course offers a more theoretical treatment of differential equations and solution methods.", "In addition, emphasis will be placed on computational analysis of differential equations and on applications in science and engineering.", "Newton's enthusiasm was due to his success in using differential equations to give the first mathematical description of planetary orbits.", "Can you imagine what his reaction would be to the present widespread use of differential equations, with applications ranging from the space shuttle guidance system to epidemic models and neural networks?", "learn how to solve simple differential equations", "understand how differential equations can be applied in various fields", "We will cover portions of the following chapters from Boyce & DiPrima, in order:", "Chapter 1: Introduction to DEs", "Chapter 2: First-order differential equations", "Chapter 3: Second-order differential equations", "Chapter 7: Systems of linear equations", "Chapter 8: Numerical methods", "Chapter 9: Nonlinear differential equations and stability", "Elementary Differential Equations and Boundary Value problems.", "Assignments are to be brought to the start of lecture as a hard copy.", "Notice of Recording", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 28, "course_code": "CO 487", "course_name": "CO487 - Applied Cryptography (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Instructor: Samuel Jaques", "Email: sejaques@uwaterloo.ca", "Timothy Miller", "Nicolas Swanson", "A broad introduction to modern cryptography, highlighting the tools and techniques used to secure internet and messaging applications.", "It is one of the core technologies for securing the emerging information infrastructure.", "This course is a comprehensive introduction to modern cryptography that is aimed primarily at those interested in applications.", "In the area of public-key cryptography, topics will include an overview of specific systems (Diffie–Hellman, RSA, DSA, etc.) and a few advanced protocols.", "The security of these schemes and the use of public-key techniques for generating digital signatures will be described.", "Linear and differential cryptanalysis of ciphers.", "Define the main information security goals of confidentiality, integrity, authentication, and availability", "Explain the intended security properties of each cryptographic primitive and analyze relationships between security properties", "Explain mathematical techniques underlying standardized cryptographic algorithms", "Identify flaws in uses of cryptographic algorithms", "Determine which cryptographic algorithms can be used and combined to build systems with desired functionality and security", "Understand and contextualize the cryptography and security around them in daily life", "0 1 (Jan 6-8) Introduction", "Symmetric Encryption", "3.6 9 Elliptic Curve Cryptography 4 Yes", "4   Applications", "Understanding Cryptography: From Established Symmetric and Asymmetric Ciphers to Post-Quantum Algorithms, 2nd edition, Springer, 2024 Primary reference.", "A1: January 23", "A4: March 20", "This will be clearly indicated for each such question.", "In that case you are required to work independently.", "These questions will test your ability to identify the important concepts introduced in lectures, and your understanding of them.", "In particular:", "Please inform us of these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 29, "course_code": "CS 338", "course_name": "CS338 - Computer Applications in Business: Databases (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Computer Applications in Business: Databases Winter 2025", "A user-oriented approach to the management of large collections of data.", "Design relational databases", "Construct SQL queries for data retrieval", "Develop strategies for data storage and backup", "Introduction and Terminology", "Relational Data Model", "Relational Algebra", "SQL: Aggregation and Grouping", "SQL: Data and Schema Modifications", "SQL: Null Values", "ER Models", "EER Model", "EER to Relation Mapping", "DBMS Concepts and Architecture", "Transaction Processing", "Database Recovery", "Database Security", "Distributed Databases", "Business Analytics", "We highly recommend thoroughly understanding and verifying your assignment solutions to set yourselves up for success in this course since  exams in CS 338 will be closed-book, and without a strong understanding of the assignments, you may find the exams challenging."]}, {"course_id": 30, "course_code": "CS 430", "course_name": "CS430 - Applications Software Engineering (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Applications Software Engineering Fall 2024", "Email: nasif.ahmed@uwaterloo.ca", "An investigation into the role and function of software engineering practice in the construction of computer based systems.", "Topics include: requirements and specification; documentation techniques; analysis and design; implementation; testing and maintenance; management issues.", "Object-Oriented & Classical Software Engineering 8th ed., by by S.R. Schach QA76.758.S318 2011 No", "This means that you must decide whether to exercise your option to submit late before the deadline, and refrain from making a partial submission in this case.", "This course includes the independent development and practice of specific skills, such as selecting which life-cycle model, team organization, testing strategy, etc. would be most appropriate in a given situation, then justifying your choice using the concepts presented during the lectures.", "Library for research-based assignments"]}, {"course_id": 31, "course_code": "STAT 332", "course_name": "STAT332 - Sampling and Experimental Design (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Sampling and Experimental Design Winter 2025", "Email: schonlau@uwaterloo.ca", "Designing sample surveys.", "Analysis of variance.", "Designing for comparison of groups.", "Sampling: explain the effect of the finite population correction", "Sampling: Design and analyze a stratified random sample", "Experimental: Explain factorial design", "Experimental: Compare and contrast experimental design and observational studies", "5 2025-01-21 6 regress A1 out", "15 2025-03-04 4 Anova/F-test", "Slides Online in learn Yes 0", "Slides:  I am reworking some slides and will post them one-by-one into learn before class.", "data collection) 2%", "Activities supporting in-class analysis: The in-class analysis will require data collection (and possibly other activities).", "All team members must meaningfully contribute to the analysis and to coding.", "Projects must not use data sets that one of the team members has used for similar projects in previous courses.", "You must write up solutions using your own words and write your own programs.", "Give a clear explanation as to why you think you deserve a different mark."]}, {"course_id": 32, "course_code": "STAT 433", "course_name": "STAT433 - Stochastic Processes 2 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["10:00AM - 11:20AM PHY 313", "Email: jnegrea@uwaterloo.ca", "This course provides further ideas and methods in stochastic modelling, with an emphasis on continuous-time stochastic processes.", "Other topics may include continuous phase-type distributions, renewal theory and limit theorems for regenerative processes, and phase-type renewal processes.", "This course develops a broad understanding of several areas in stochastic processes.", "Recall, understand, and apply definitions related to stochastic processes", "Recall, understand, and prove key theoretical results", "Apply their knowledge of stochastic processes to study phenomena in select subject areas", "~13-17; Renewal theory; 1,2,5", "Springer books can be accessed for free via the library.", "Bookmark the following “magic link”", "1,2 are pretty standard undergrad courses in stochastic processes.", "3,4 are typical content for a graduate probability course, but we will be distilling some of the core ideas from them to develop the content we cover at a deeper level.", "6 is a comprehensive reference text on probability theory and covers a broader range of topics than this course.", "These are opportunities to develop your understanding of each of the topics and to demonstrate your mastery of the material.", "Students are allowed (even encouraged) to discuss course material with each other, including solution strategies for the assigned problems and what resources may be useful in solving the problem sets."]}, {"course_id": 33, "course_code": "STAT 435", "course_name": "STAT435 - Statistical Methods for Process Improvements (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Statistical Methods for Process Improvements Winter 2025", "11:30AM - 12:20PM", "Statistical methods for improving processes based on observational data.", "Clue generation techniques for determining the sources of variability.", "Reducing variation can lower overall cost and simultaneously improve customer satisfaction.", "This course is structured around a systematic algorithm for reducing process variation and thus improving existing manufacturing and assembly processes.", "understand the seven generic variation reduction approaches and have some experience in choosing an appropriate approach for a given application.", "be able to draw appropriate conclusions – graphically and analytically – from data arising from the above-mentioned investigations and be able to present these conclusions to a “non-statistical” audience.", "appreciate the sequential (or iterative) nature of process improvement and understand how current process knowledge influences the choice and design of subsequent investigations.", "A suggested timeline follows:", "Method of Elimination, Investigations to Compare Two Families of Variation, Searching for a Dominant Cause in Watfactory", "Verifying a Dominant Cause and Verifying a Dominant Cause in Watfactory", "Desensitizing a Process to Variation in a Dominant Cause, Making a Process Robust, Looking for a Desensitizer in Watfactory", "Monday – discussion of assigned videos/chapters and reports returned", "Monday", "Assigned Videos and Discussion", "Friday", "Teams Presenting", "Managing Teams", "videos C6a, C6b & W1", "Study Break Week", "Search for Cause III", "Search for Solution", "March 24", "Search for Solution II", "Testing Solution", "Electronic copies are freely available.", "Paper Review - Individually write a review of a case study or research paper published or submitted for publication that you choose or I will provide.", "You can make multiple appointments throughout the term."]}, {"course_id": 34, "course_code": "STAT 443", "course_name": "STAT443 - Forecasting (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Forecasting Spring 2024", "04:00PM - 05:20PM", "Email: jeremy.vanderdoes@uwaterloo.ca", "This course is an introduction to statistical forecasting.", "This includes considerations of forecasts and uncertainty.", "Speciﬁc topics include:", "Linear time series models: AR, MA, ARMA, ARIMA, SARIMA", "Forecasting: Principles and Practice, 3rd edition free online at https://otexts.com/fpp3/", "Time Series Analysis and Its Applications, 4th edition free online in library or at https://www.stat.pitt.edu/stoffer/tsa4/ Yes", "Introduction to Time Series and Forecasting free online in library Yes"]}, {"course_id": 35, "course_code": "CO 351", "course_name": "CO351 - Network Flow Theory (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["In case of (medical or other) emergencies, or private issues, send E-mail to the instructor.", "Network simplex and primal-dual algorithms.", "Applications to problems of transportation, distribution, job assignments, and critical-path planning.", "The course covers mathematical models for optimization problems on networks.", "The max-flow-min-cut theorem has many applications including its implication of the Menger theorem in graph theory.", "Additionally, the course presents several algorithms for solving optimization problems on networks.", "Linear programming and LP duality are central to the design and analysis of some of the algorithms.", "- maximum flows and minimum cuts (max-flow/min-cut theorem, preflow-push algorithm);", "- applications to problems in transportation, distribution, job assignments, and critical-path planning, etc.", "1 Sep. 4-6 Review linear programming and graph theory", "4 Sep. 23-27 Shortest di-paths problem A1", "11 Nov. 18-22 Minimum cost flow A4", "\"Network Flow Algorithms\" (grad-level book) by D.P.Williamson http://www.networkflowalgs.com/ No", "This is a closed-book exam.", "This is a closed-book exam.", "Students are advised to invest in a reliable internet connection and a reliable device (for a fraction of the cost of UW tuition).", "The answer to most common issues as well as how-to videos can be found at"]}, {"course_id": 36, "course_code": "CO 353", "course_name": "CO353 - Computational Discrete Optimization (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Computational Discrete Optimization Winter 2025", "08:30AM - 09:50AM E2 1732", "Formulations of combinatorial optimization problems, greedy algorithms, dynamic programming, branch-and-bound, cutting plane algorithms, decomposition techniques in integer programming, approximation algorithms.", "A discrete optimization problem, broadly speaking, involves a discrete set of feasible solutions and a real-valued objective function that assigns a value to each solution.", "Discrete optimization problems are of immense practical importance, are solved every day (sometimes each hour or more frequently) by many Fortune 500 companies;  well-known problems in the class include", "This course provides an introduction to the broad field of discrete optimization and covers several classes of commonly used techniques for the design of algorithms, including:", "Dynamic programming,", "We will discuss algorithmic efficiency and introduce the basics of complexity theory.", "For NP-hard problems, we will explore the field of approximation algorithms, which provides efficient methods for computing solutions with guaranteed quality.", "Students will complete two practical projects as part of the course, where they will develop, implement, and test algorithms for specific discrete optimization problems.", "formulate discrete optimization problems;", "identify and apply algorithms that can be used to solve selected discrete optimization problems;", "prove correctness of above algorithms and results related to the structures of discrete optimization problems.", "\"The Design of Approximation Algorithms\" by David Williamson, David Shmoys No", "\"Approximation Algorithms\" by Vijay Vazirani No", "\"The Design of Approximation Algorithm\" by David Williamson, David Shmoys;", "\"Approximation Algorithms\" by Vijay Vazirani.", "Each collaboration and resource used to prepare the submission should be appropriately acknowledged in the submission.", "Projects are to be done in groups of two-three.", "Submissions not following the specified format might be assessed based only on their performance and correctness of their output without providing feedback.", "In case you are not able to participate in some of the assessments please visit this webpage to submit the required information.", "Notice of Recording", "If due to changes in regulations and guidelines, it becomes impossible for us to hold in-person lectures and office hours, the lectures and office hours will be held over Zoom."]}, {"course_id": 38, "course_code": "CO 452", "course_name": "CO452 - Integer Programming (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Formulation of problems as integer linear programs.", "Solution by branch-and-bound and cutting plane algorithms.", "Introduction to the theory of valid inequalities and polyhedral combinatorics.", "Integer Programming is a mathematical program that can be seen as a linear program with the additional requirement that some (or all) of the variables are required to take on integer values.", "While linear programming is already very useful in modeling problems and can be solved well using either interior point methods or the simplex method, {\\bf Integer programs, or IPs} have a much broader range of applications.", "In this course we will explore an upper-level undergraduate/basic graduate introduction to the topic of Integer Programming.", "Understand basic theory and algorithms behind integer programming approaches", "Basic geometric definitions: Convex/affine/linear combinations.", "Basic polyhedral theory: Faces, facets, extreme points.", "Integral polyhedra and Total Dual Integrality.", "Union of polyhedra and representability.", "Equivalence of optimization and separation.", "Gomory cuts and other cutting planes.", "Rank and closures.", "Branch-and-bound: Basic ideas and extensions.", "Theoretical and computational results.", "This includes technical problems in your submission, like power outage, no internet access, etc.", "Collaboration", "Re-marking policies", "Note that your solution will be very carefully examined during a re-mark.", "In addition such student needs to be in good standing.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as undertanding theory and algorithms for some classes of optimization models.", "Library for research-based assignments"]}, {"course_id": 39, "course_code": "CO 454", "course_name": "CO454 - Scheduling (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Scheduling Spring 2024", "10:00AM - 11:20AM DWE 3517", "E-mail : nikhil.kumar2@uwaterloo.ca", "An overview of practical optimization problems that can be posed as scheduling problems.", "Simple and efficient combinatorial algorithms for easy problems.", "Scheduling problems form a large part of resource allocation problems where sparse resources have to be assigned over time to complete tasks and optimize over one or multiple objectives.", "The course will also contain a brief overview of computational complexity and various techniques for the design of efficient exact and approximate algorithms.", "Scheduling problems: Modeling and notations", "Single-machine Models, Optimal schedules, Exact algorithms", "Computational complexity - P, NP, NP-completeness.", "Multiple-machine models, approximation algorithms.", "Dynamic Programming and its application to scheduling", "Linear and Integer Programming techniques", "Scheduling: Theory, Algorithms, and Systems Author: Michael Pinedo No", "Algorithm Design Authors: Jon Kleinberg and Eva Tardos No"]}, {"course_id": 40, "course_code": "CO 456", "course_name": "CO456 - Introduction to Game Theory (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Game Theory Fall 2024", "A broad introduction to game theory and its applications to the modeling of competition and cooperation in business, economics, and society.", "Classical game theory studies the competitive and cooperative behaviour of rational and self‐interested individuals in strategic environments.", "It speciﬁcally develops beautiful analytic tools to analyze and model situations in which a person’s welfare is a function not only of their own actions, but also those of others.", "This course is meant to be a broad and mathematical introduction to game theory and its appications.", "We will attempt to cover these topics:", "This class is meant to be a broad and mathematical introduction to game theory and its applications.", "Game Theory Basics, Bernhard von Stengel http://www.maths.lse.ac.uk/personal/stengel/lectnotes1-7.pdf No", "An Introduction to Game Theory, Martin J. Osborne https://www.economics.utoronto.ca/osborne/igt/ No", "Mechanism Design and Approximation, Jason D. Hartline http://jasonhartline.com/MDnA/ No", "As the title implies, a basic introduction to various topics in game theory.", "An introduction to game theory and equilibria from a computer science perspective.", "An Introduction to Game Theory, Martin J. Osborne.", "The text contains a section on game theory, and some chapters about matching games.", "Mechanism Design and Approximation, Jason D. Hartline.", "These notes were written for a graduate class, and cover mechanism design from an advanced perspective.", "Your submission must be clear and legible, and in the correct orientation.", "You are expected to work on the assignment problems and submit them well ahead of the deadline, in case of technical difficulty.", "You must write up your own solutions without seeking help from anyone, and list the names of your collaborators in each of the assignment problems involved.", "This is a closed-book exam, no aids are allowed.", "A missed test will be treated the same as a mark of zero.", "This is a closed-book exam, no aids are allowed.", "Re-marking policies", "Note that your solution will be very carefully examined during a re-mark.", "In case of serious illness during the final exam, you may be granted a grade of INC provided that", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as finding Nash equilibria and applying game theory to real life applications.", "Library for research-based assignments"]}, {"course_id": 42, "course_code": "CO 463", "course_name": "CO463 - Convex Optimization and Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Convex Optimization and Analysis Winter 2024", "An introduction to the modern theory of convex programming, its extensions and applications.", "Structure of convex sets, separation and support, subgradient calculus for convex functions, Fenchel conjugacy and duality, Lagrange multipliers.", "Ellipsoid method for convex optimization.", "Determine whether sets and functions are convex and supply a proof", "Compute conjugates and subdifferentials of convex functions and duals of norms", "Determine Lagrange duals and necessary and sufficient conditions for convex optimization problems", "Recognize standard forms of convex programming", "Implement some convex optimization algorithms and use a convex optimization modeling language", "Convex sets", "Convex functions", "Characterization in terms of first and second derivative", "Conjugacy", "Norms and sublinear functions", "Convex optimization", "Standard forms of convex programming", "Basics of monotone operator theory", "First-order methods", "H. Bauschke and P. Combettes, Convex analysis and monotone operator theory in Hilbert spaces, 2017.", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 44, "course_code": "CO 471", "course_name": "CO471 - Semidefinite Optimization (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Semidefinite Optimization Spring 2023", "04:00PM - 05:20PM", "Optimization over convex sets described as the intersection of the set of symmetric, positive semidefinite matrices with affine spaces.", "Theoretical and practical consequences of these formulations.", "Duality theory and algorithms.", "Optimization over convex sets described as the intersections of the set of symmetric, positive semidefinite matrices with affine spaces.", "Formulations of problems from combinatorial optimization, graph theory, number theory, probability and statistics, engineering design and control theory.", "Theoretical and practical consequences of these formulations.", "Duality theory and algorithms.", "Topics Include: Optimization over convex sets described as the intersection of the set of symmetric, positive semideﬁnite matrices with aﬃne spaces: Semideﬁnite optimization vastly generalizes linear programming where variable vectors may be replaced with matrix variables and, in addition to linear equations and inequalities, one may utilize constraints requiring some of the matrix variables to be symmetric and positive semideﬁnite.", "duality theory for semideﬁnite optimization,", "algorithms for semideﬁnite optimization: ellipsoid method, ﬁrst‐order methods and primal‐dual interior‐point methods for semideﬁnite optimization, and approximation algorithms based on semideﬁnite optimization,", "formulations of problems from combinatorial optimization, graph theory, number theory, probability and statistics, complexity analysis of algorithms, engineering design and control theory, theoretical and practical consequences of these formulations,", "Polyhedral and Semidefinite Programming Methods in Combinatorial Optimization"]}, {"course_id": 0, "course_code": "AMATH 231", "course_name": "AMATH231 - Calculus 4 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "02:30PM - 03:20PM", "Vector integral calculus-line integrals, surface integrals and vector fields, Green's theorem, the Divergence theorem, and Stokes' theorem.", "Applications include conservation laws, fluid flow and electromagnetic fields.", "An introduction to Fourier analysis.", "Frequency analysis of signals.", "Notice of Recording"]}, {"course_id": 1, "course_code": "AMATH 271", "course_name": "AMATH271 - Introduction to Theoretical Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Theoretical Mechanics Fall 2024", "08:30AM - 09:20AM", "The course is an introduction to classical mechanics, including Newtonian mechanics and the formulations of Lagrange and Hamilton.", "Solve mechanics problems using laws of conservation of momentum, angular momentum, and energy", "Identify conservative forces and find their potential", "Analyze orbits of two bodies under the influence of gravity", "1 Sep 4-6 Introduction Taylor, 1.1-1.7", "4 Sep 23-27 Energy Taylor, 4.1-4.5, 4.8-4.10", "Oct 14-18 Thanksgiving and reading week", "Here are some general instructions for using Crowdmark:", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as formulating equations that describe problems in mechanics and solving them.", "Library for research-based assignments"]}, {"course_id": 2, "course_code": "AMATH 351", "course_name": "AMATH351 - Ordinary Differential Equations (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Ordinary Differential Equations Fall 2024", "Linear differential equations with non-constant coefficients, Sturm comparison, oscillation and separation theorems, series solutions and special functions.", "Linear systems in Rn, an introduction to dynamical systems.", "Laplace transforms applied to linear systems, transfer functions, the convolution theorem.", "An introduction to dynamical systems and stability.", "Perturbation methods for differential equations.", "Create and understand scientific models in the language of ODEs.", "Know and derive properties of some special functions", "Find solutions to inhomogeneous, first-order ODEs in terms of the fundamental matrix (exponential matrix)", "Understand the existence and uniqueness theorems of ODEs and apply them to systems.", "Apply perturbation methods to find approximate solutions to systems of ODEs.", "September", "Chapter 1: Theory of Second-Order Linear ODEs", "1.1: Introduction to Modelling", "1.2: Classification of DEs", "1.3: 2nd-order linear ODEs", "September", "1.4: Existence and uniqueness", "1.5: General solutions of 2nd-order DEs", "1.7: Examples of 2nd-order DEs with non-constant coefficients", "1.8: Wave equation in a vibrating membrane", "1.10: Method of variation of parameters", "September", "1.11: Qualitative Analysis of DEs", "2.2: Series solutions of first-order equations", "September", "2.3: 2nd-order equations: ordinary points", "-", "2.5 Extended method of Frobenius", "2.6 Bessel functions", "Chapter 2b: Special Functions of mathematical physics", "Bessel functions and the gamma function and properties", "Bessel functions and the gamma function and properties (continued)", "Chapter 3: System of 1st-order equataions", "3.1: Introduction to linear systems", "-", "3.2: Existence-Uniqueness of IVPs", "3.2: Existence-Uniqueness of IVPs, Proof", "3.3 Linear systems and the fundamental matrix", "3.5: Exponential matrix", "3.4 Finding solutions using eigenvalues", "Chapter 7: Perturbation methods", "7.1: Algebraic equations", "7.2: Definitions of the order symbols", "7.3: Duffing's Equation", "7.4: Regular perturbation expansion", "7.5 Poincare Method", "5.2: An example of a BVP", "December", "Differential Equations and Boundary Value Problems, Edwards and Penny No", "Differential Equations with Applications and Historical Notes, Simmons No"]}, {"course_id": 3, "course_code": "AMATH 353", "course_name": "AMATH353 - Partial Differential Equations 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Partial Differential Equations 1 Winter 2025", "08:30AM - 09:20AM", "08:30AM - 09:50AM MC 4063", "Second order linear partial differential equations - the diffusion equation, wave equation, and Laplace's equation.", "Methods of solution - separation of variables and eigenfunction expansions, the Fourier transform.", "Physical interpretation of solutions in terms of diffusion, waves, and steady states.", "First order non-linear partial differential equations and the method of characteristics.", "Develop a mathematical model to explain a scientific principle in the language of Partial Differential Equations (PDEs)", "Determine what analytical method is appropriate to solve a given PDE", "Apply analytical methods to solve PDEs", "Physically interpret solutions of PDEs", "Feb 17-21 Family Day and reading week", "Applied Partial Differential Equations: with Fourier Series and Boundary Value Problems by R Haberman On reserve in DC No $158", "Here are some general instructions for using Crowdmark:", "This course includes the independent development and practice of specific skills, such as solving PDEs.", "Library for research-based assignments"]}, {"course_id": 4, "course_code": "AMATH 361", "course_name": "AMATH361 - Continuum Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Equations of continuity, motion and energy, constitutive equations.", "Basic equations of elasticity.", "Continuum mechanics is the study of motion and forces in solids and fluids.", "These materials are treated as continua and described in the language of vector calculus.", "We will derive the basic partial differential equations for solid and fluid mechanics and apply them to a variety of physical problems.", "This course provides a strong basis for further study in a number of different areas of application, including meteorology, oceanography, astrophysics, building ventilation, aerodynamics, seismology, structural engineering, etc.", "develop proficiency in using Cartesian tensors", "model fluids at rest: pressure and hydrostatic balance", "model fluids in motion: ideal, incompressible and compressible flows", "model Newtonian fluids subject to viscosity", "model rotating fluids", "model solids at rest: stress and strain", "model a magnetohydrodynamic fluid", "6.1 The transformation rule for first-order tensors", "6.2 The transformation rule for second-order tensors", "6.4 Contractions and tensor products", "6.5 Symmetric and antisymmetric tensors", "2.1 Eulerian and Lagrangian descriptions of flows", "2.3 Material volumes", "Ch 3: Derivation of the governing equations I", "3.1 Conservation of mass: the continuity equation", "3.2 Conservation of linear momentum", "3.3 Simple examples of surface forces in fluids", "4.1 Conservation of linear momentum: the momentum equations", "4.2 Symmetry of the stress tensor", "Ch 14: Introduction to elasticity theory", "14.2 Linear elasticity theory", "February 24 - 28", "Ch 7: Strain rate tensor and rotation tensor", "7.1 Relative motion near a point", "Ch 8: Constitutive equations for a Newtonian fluid", "8.1 The momentum equations for a Newtonain fluid", "8.2 Energy equation for a Newtonian fluid", "Ch 9: Simple Newtonian flows for a fluid of constant density", "Circulation", "Maxwell's equations", "Equations of MHD", "Analyzing the equations of MHD", "Waves in MHD", "But you are also welcome to email the instructor for whatever question you might have about the course.", "Policy on late/missed assignments: You are expected to complete the assignments on time but if you need an extension please ask me and I will consider each situation on a case by case basis.", "Some of these problems will be included in the assignments.", "Please consider indicating your pronouns in Quest and your chosen name in WatIAM.", "Notice of Recording"]}, {"course_id": 5, "course_code": "AMATH 373", "course_name": "AMATH373 - Quantum Theory 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Basic concepts of quantum mechanics: observables, wavefunctions, Hamiltonians, and the Schroedinger equation.", "Simple applications to finite and extended one-dimensional systems, harmonic oscillator, rigid rotor, and hydrogen atom.", "Explain how the mathematical formalism of quantum theory an be applied to describe elementary quantum systems.", "Introduction to Quantum Mechanics, 3rd Edition, David Griffiths and Darrell Schroeter Yes 87.00"]}, {"course_id": 6, "course_code": "PHYS 121", "course_name": "PHYS121 - Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["An introductory course in physics for students intending to concentrate their future studies in the physical sciences, optometry, or mathematics; includes vectors (dot and cross products), particle kinematics and dynamics, forces in nature, work and energy, conservation of energy and linear momentum, rotational kinematics and dynamics, and conservation of angular momentum.", "Doing Physics - quantities, dimensions, units", "Point Dynamics - force, motion, Newton's laws", "Conservation of Energy - work and energy, conservative systems", "Conservation of linear Momentum - momentum and systems of particles", "Understand the following concepts:", "- Linear kinematics: the relationship between distance, velocity and acceleration.", "- Linear dynamics: a consequence of forces and momentum, and how they interrelate.", "- Kinetic energy, potential energy, work, and their interrelationships.", "We will also re-examine these concepts in a rotating coordinate frame using angular kinematic variables along with torque and angular momentum.", "6 Module 06:  Kinetic and Potential Energy", "7 Module 06:  Kinetic and Potential Energy", "8 Module 07:  Linear Momentum", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- eText + Student Access Code", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- Print Format + Student Access Code"]}, {"course_id": 7, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 8, "course_code": "PHYS 234", "course_name": "PHYS234 - Quantum Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM DC 1351", "K. Islam", "Introduction to formalism of quantum physics.", "Introduction to operators.", "Background: understanding why we need a quantum theory", "Learning the building blocks of a quantum theory: state vectors and operator", "Jan 06, 08, 10 Introduction to Quantum Physics, Stern-Gerlach experiments 1", "Jan 20, 22, 24 Matrix notation, general quantum systems, operators 2", "Mar 10, 12, 14 Continuous quantum systems – formalism, infinite potential well,", "Mar 17, 19, 21 Continuous quantum systems – infinite potential well (continued), finite potential well 5", "Mar 24, 26, 28 Continuous quantum systems – quantum harmonic oscillator 9", "Mar 31, Apr 02, 04 Continuous quantum systems (continued), Review", "Students should start checking for posted exam dates:", "Everyone needs a support system.", "Every student in PHYS 234 is expected to treat their peers and their instructor with kindness, fairness, tolerance, and respect.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 9, "course_code": "PHYS 242", "course_name": "PHYS242 - Electricity and Magnetism 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["10:30AM - 11:20AM RCH 301", "calculate electric fields and potentials for charged systems such as a collection of point charges and charge-carrying rods/surfaces/spheres.", "calculate the interactions between a charge and a conductor and understand the electric properties of conductors.", "calculate electric potentials by solving Laplace's equations for various geometries.", "calculate magnetic fields of current-carrying wires/planes and other geometries.", "calculate the magnetic vector potentials of current-carrying wires and solenoids.", "•Electromagnetic induction: Chapter 7", "Introduction to Electrodynamics, 4th or 5th Etd.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 10, "course_code": "AMATH 242", "course_name": "AMATH242 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 11, "course_code": "CS 371", "course_name": "CS371 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 12, "course_code": "AMATH 250", "course_name": "AMATH250 - Introduction to Differential Equations (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Differential Equations Winter 2025", "Solving linear differential equations: first- and second-order scalar equations and first-order vector equations.", "The main purpose of the course is to explore how first and second order differential equations (DEs) are used to model physical systems and predict their behaviour.", "first order linear DE models of compartment problems, atomic decay, and bodies in motion;", "first order separable DE models of population growth;", "a first order exact DE model of the electric dipole;", "second order linear DE models for oscillatory systems such as mass-spring-damper systems and electrical circuits;", "second order nonlinear DE models for suspended cables and rocket motion;", "linear vector DE models of multiple compartment problems and species interactions.", "Both analytical solution techniques and qualitative methods (direction field analysis, dimensional analysis, and phase portraits) will be presented as ways to gain information about system behaviour.", "We will investigate conditions for existence, uniqueness, and continuity of solutions of both first and second order initial value problems, and for systems in the plane.", "Maple will be used to generate numerical and graphical solutions, to illustrate concepts graphically, and to explore model behaviour.", "increase your comprehension of some of the many ways that differential equations can help us understand the real world;", "develop your ability to understand a mathematical model for a specific situation;", "explore analytical and qualitative solution methods for first and second order differential equations, and the use of Maple; and", "Please choose only one of the two options below.", "Submission Instructions", "Copyright Notice", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as solving differential equations.", "Library for research-based assignments"]}, {"course_id": 13, "course_code": "AMATH 251", "course_name": "AMATH251 - Introduction to Differential Equations (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Introduction to Differential Equations (Advanced Level)", "Email: cbauch@uwaterloo.ca", "Email: apunnavajhala@uwaterloo.ca", "This course offers a more theoretical treatment of differential equations and solution methods.", "In addition, emphasis will be placed on computational analysis of differential equations and on applications in science and engineering.", "Newton's enthusiasm was due to his success in using differential equations to give the first mathematical description of planetary orbits.", "Can you imagine what his reaction would be to the present widespread use of differential equations, with applications ranging from the space shuttle guidance system to epidemic models and neural networks?", "learn how to solve simple differential equations", "understand how differential equations can be applied in various fields", "We will cover portions of the following chapters from Boyce & DiPrima, in order:", "Chapter 1: Introduction to DEs", "Chapter 2: First-order differential equations", "Chapter 3: Second-order differential equations", "Chapter 7: Systems of linear equations", "Chapter 8: Numerical methods", "Chapter 9: Nonlinear differential equations and stability", "Elementary Differential Equations and Boundary Value problems.", "Assignments are to be brought to the start of lecture as a hard copy.", "Notice of Recording", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 14, "course_code": "AMATH 331", "course_name": "AMATH331 - Applied Real Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["04:00PM - 05:20PM", "henry.shum@uwaterloo.ca", "Email: henry.shum@uwaterloo.ca", "Give mathematical definitions of limits for sequences of real numbers, vectors, and functions.", "Define open, closed, bounded, compact, and complete sets, and distinguish these concepts.", "Determine whether a vector-valued function is continuous or discontinuous .", "2.6-2.7", "Jan 27-31 Euclidean space, sequences and convergence in Rn, closed sets  1.2, 4.1-4.3 Assign 1", "Feb 24-28 Uniform continuity, normed vector spaces 5.1, 5.5, 6.1, 7.1  Midterm", "Mar 3 - 7 Normed and inner product spaces, sequences of functions 7.1, 7.2, 7.4, 8.1, 8.2", "Mar 31-Apr 4 Finite-dimensional spaces, series of functions 7.3, 7.5, 7.6, 8.4 Assign 4", "Real Analysis and Applications: Theory in Practice Available online: https://proxy.lib.uwaterloo.ca/login?url=http://dx.doi.org/10.1007/978-0-387-98098-0 No 0", "Principles of Mathematical Analysis.", "Topics covered in each assignment will be those of roughly the two weeks up to and including Monday of the week before the deadline.", "The final exam will be registrar-scheduled and in-person, if possible, with a duration of 150 minutes.", "Re-mark Request Policy", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 15, "course_code": "PMATH 331", "course_name": "PMATH331 - Applied Real Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["04:00PM - 05:20PM", "henry.shum@uwaterloo.ca", "Email: henry.shum@uwaterloo.ca", "Give mathematical definitions of limits for sequences of real numbers, vectors, and functions.", "Define open, closed, bounded, compact, and complete sets, and distinguish these concepts.", "Determine whether a vector-valued function is continuous or discontinuous .", "2.6-2.7", "Jan 27-31 Euclidean space, sequences and convergence in Rn, closed sets  1.2, 4.1-4.3 Assign 1", "Feb 24-28 Uniform continuity, normed vector spaces 5.1, 5.5, 6.1, 7.1  Midterm", "Mar 3 - 7 Normed and inner product spaces, sequences of functions 7.1, 7.2, 7.4, 8.1, 8.2", "Mar 31-Apr 4 Finite-dimensional spaces, series of functions 7.3, 7.5, 7.6, 8.4 Assign 4", "Real Analysis and Applications: Theory in Practice Available online: https://proxy.lib.uwaterloo.ca/login?url=http://dx.doi.org/10.1007/978-0-387-98098-0 No 0", "Principles of Mathematical Analysis.", "Topics covered in each assignment will be those of roughly the two weeks up to and including Monday of the week before the deadline.", "The final exam will be registrar-scheduled and in-person, if possible, with a duration of 150 minutes.", "Re-mark Request Policy", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 16, "course_code": "PMATH 333", "course_name": "PMATH333 - Introduction to Real Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Real Analysis Fall 2024", "11:30AM - 12:20PM RCH 112", "Topics discussed include the completeness properties of the reals; the density of the rationals; the topology of real n-dimensional space: open and closed sets, connectedness, compactness (by open covers), the Heine-Borel theorem, completeness; sequences in real n-dimensional space: convergence, Cauchy sequences, subsequences, the Bolzano-Weierstrass theorem; multivariable functions: limits, point-wise and uniform continuity, the extreme value theorem, uniform convergence of sequences of functions, Taylor's theorem, term-by-term differentiation of power series; integration in real n-dimensional space: Riemann integrability, Fubini's theorem for continuous functions on rectangles, term-by-term integration of power series.", "Ordered Fields", "The Riemann Integral", "Chapter 4. Sequences and Series of Functions", "Topology in Euclidean Space", "Differentiation in Euclidean Space", "Chapter 7. Jordan Content and Integration in Euclidean Space", "Course materials can be found at http://www.math.uwaterloo.ca/~snew/", "A suggested text is An Introduction to Analysis, by William Wade."]}, {"course_id": 17, "course_code": "PMATH 351", "course_name": "PMATH351 - Real Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Real Analysis Winter 2025", "09:30AM - 10:20AM RCH 301", "Email: kghare@uwaterloo.ca", "Email: nmrslavitch@uwaterloo.ca", "Email: s352lee@uwaterloo.ca", "Normed and metric spaces, open sets, continuous mappings, sequence and function spaces, completeness, contraction mappings, compactness of metric spaces, finite-dimensional normed spaces, Arzela-Ascoli theorem, existence of solutions of differential equations, Stone-Weierstrass theorem.", "Week 7: February 24 - 28 Section 3.1 - 3.2 Midterm February 28,", "Please note, you will be responsible for all material on assignments for midterms and final exams.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 18, "course_code": "AMATH 332", "course_name": "AMATH332 - Applied Complex Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Applied Complex Analysis Winter 2025", "02:30PM - 03:20PM", "Complex numbers, Cauchy-Riemann equations, analytic functions, conformal maps and applications to the solution of Laplace's equation, contour integrals, Cauchy integral formula, Taylor and Laurent expansions, residue calculus and applications.", "In the case of illness, a VIF will be required.", "If the midterm is missed, after your instructor has verified you have valid reasons for it, and has received a VIF in case of illness, the weight will be shifted to the final exam.", "If the final exam is missed, and valid reasons are found for it, together with a VIF in case of illness, a grade of INC will be given to the student as long as assignments and midterms have seen a good performance.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 19, "course_code": "PMATH 332", "course_name": "PMATH332 - Applied Complex Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Applied Complex Analysis Winter 2025", "02:30PM - 03:20PM", "Complex numbers, Cauchy-Riemann equations, analytic functions, conformal maps and applications to the solution of Laplace's equation, contour integrals, Cauchy integral formula, Taylor and Laurent expansions, residue calculus and applications.", "In the case of illness, a VIF will be required.", "If the midterm is missed, after your instructor has verified you have valid reasons for it, and has received a VIF in case of illness, the weight will be shifted to the final exam.", "If the final exam is missed, and valid reasons are found for it, together with a VIF in case of illness, a grade of INC will be given to the student as long as assignments and midterms have seen a good performance.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 20, "course_code": "PMATH 352", "course_name": "PMATH352 - Complex Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Complex Analysis Winter 2025", "Complex numbers provide the natural setting in which to study differentiable functions.", "Cauchy's theorem plays a central role in this subject, and many important results follow from it: Cauchy's integral formula, the theory of Taylor and Laurent series, Cauchy's residue theorem, the argument principle, the fundamental theorem of algebra, the maximum modulus theorem, Mittag-Lefler expansions, and Weierstrass products.", "We’ll start the course with a basic review of complex numbers, and the complex exponential and logarithm, complex analytic functions, and make our way towards Cauchy's theorem and its wonderful consequences.", "My lectures will draw on a number of books and sources, but I recommend Knopp's Elements of the Theory of Functions, and his Theory of Functions Parts I and II.", "Another reference is Marsden and Hoffman's Basic Complex Analysis.", "3) analytic functions, Cauchy Riemann equations", "6) complex integration", "8) Cauchy's Integral Formulas"]}, {"course_id": 23, "course_code": "AMATH 475", "course_name": "AMATH475 - Introduction to General Relativity (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to General Relativity Winter 2025", "04:00PM - 05:20PM", "E. Martin-Martinez", "E. Martin-Martinez", "Curved space-time and the Einstein field equations.", "The Friedmann-Robertson-Walker cosmological models.", "Curved space-time and the Einstein field equations.", "The Friedmann-Robertson-Walker cosmological models.", "Block 0: Foundations of Tensor Analysis", "• Introduction to index notation.", "Block 2: Introduction to Differential Geometry", "• Metric manifolds and pseudo-Riemannian manifolds.", "• Isometries and Killing vector fields.", "• The stress-energy tensor and energy conditions.", "Bernard Schtuz A First Course in General Relativity, Second Edition, Cambridge University press (2009).", "Self-Declared Absence and VIF policy", "Please be proactive in contacting the TAs if you find yourself in any of these situations so they can properly document your absence and ensure the weight adjustment is applied.", "Acknoledgements and collaboration policy"]}, {"course_id": 24, "course_code": "PHYS 476", "course_name": "PHYS476 - Introduction to General Relativity (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to General Relativity Winter 2025", "04:00PM - 05:20PM", "E. Martin-Martinez", "E. Martin-Martinez", "Curved space-time and the Einstein field equations.", "The Friedmann-Robertson-Walker cosmological models.", "Curved space-time and the Einstein field equations.", "The Friedmann-Robertson-Walker cosmological models.", "Block 0: Foundations of Tensor Analysis", "• Introduction to index notation.", "Block 2: Introduction to Differential Geometry", "• Metric manifolds and pseudo-Riemannian manifolds.", "• Isometries and Killing vector fields.", "• The stress-energy tensor and energy conditions.", "Bernard Schtuz A First Course in General Relativity, Second Edition, Cambridge University press (2009).", "Self-Declared Absence and VIF policy", "Please be proactive in contacting the TAs if you find yourself in any of these situations so they can properly document your absence and ensure the weight adjustment is applied.", "Acknoledgements and collaboration policy"]}, {"course_id": 25, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 26, "course_code": "MATH 247", "course_name": "MATH247 - Calculus 3 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Topology on RN: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. (~3 weeks)", "Differentiation: partial differentiability, differentiability, chain rule, [midterm likely here], Taylor polynomials, extreme value problems. (~4 weeks)", "Integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. (~3 weeks)", "Local properties of continuously differentiable functions:  open mapping theorem, inverse function theorem, implicit function theorem. (~2 weeks)", "11:30AM - 12:20PM QNC 2501", "Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem.", "Topology of real n-dimensional space: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. Differential calculus on multivariable functions: partial differentiability, differentiability, chain rule, Taylor polynomials, extreme value problems. Riemann integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem."]}, {"course_id": 28, "course_code": "PHYS 342", "course_name": "PHYS342 - Electricity and Magnetism 2 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM QNC 2502", "Electric and magnetic fields in media, auxiliary fields, Maxwell's equations, electromagnetic waves, electric and magnetic properties of matter.", "Electrodynamics", "Review of Vector Analysis", "Ability to calculate electrostatic fields in vacuum with various geometries.", "Ability to calculate potential fields in vacuum with various geometries", "Ability to calculate electrostatic fields in matter with various geometries using auxiliary fields", "Ability to calculate magnetostatic fields in vacuum with various geometries.", "Ability to calculate magnetostatic fields in matter with various geometries using auxiliary fields", "Understanding of the coupling of time-dependant magnetic and electric fields, Maxwell's equations", "Ability to calculate wave solutions to Maxwell's equations in media.", "3 Electric Potential 2.3-5", "5 Electric Fields in Matter 4", "7 Magnetic Fields in Matter 6  midterm", "8 Electrodynamics 7.1-2", "9 Maxwell's Equations 7.3", "11 Absorption & Dispersion 9.3-4", "Introduction to Electrodynamics, David J. Griffiths any edition Yes", "Completing this book report should prepare you for the final and most interesting topics of this course: Maxwell's equations and their wave solutions.", "Each consists of reading the textbook material covering the upcoming week's material.", "Each of these are meant to be formative.", "Library for research-based assignments", "Notice of Recording", "In the event of a longer-term cancellation of in-person meetings, whether for this particular course or University-wide, class will be held synchronously at the usual time using WebEx, Teams, or Zoom."]}, {"course_id": 29, "course_code": "PHYS 358", "course_name": "PHYS358 - Thermal Physics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Monday, Friday -", "08:30AM - 09:20AM", "08:30AM - 09:20AM", "Name E-mail", "Name E-mail", "Dyuman Bhattacharya", "Kinetic theory of gases.", "Basic probability theory.", "Thermodynamic Functions and Maxwell's relations.", "Kinetic theory of gases.", "Basic probability theory.", "Thermodynamic Functions and Maxwell's relations.", "Describe the role of energy in thermal physics.", "Explain the Second Law of Thermodynamics and how it affects simple systems.", "Describe heat engines and refrigerators as types of thermodynamic systems.", "Calculate the free energy of simple systems and describe the relationship between free energy and other thermodynamic quantities.", "Parts of Blundell and Blundell's Concepts in Thermal Physics will complement Schroeder.", "The relevant sections of Blundell and Blundell will be announced on LEARN before class.", "1.1 Thermal Equilibrium", "Microscopic Model of an Ideal Gas", "1.4 Heat and Work", "1.3 & 1.6", "1.3 Equipartition of Energy", "1.7 & 2.1 – 2.3", "2.1 Two-State Systems", "The Two-State Paramagnet", "2.2 The Einstein Model of a Solid", "2.3 Interacting Systems", "2.4 – 2.6", "2.4 Large Systems", "Multiplicity of a Large Einstein Solid;", "Sharpness of the Multiplicity Function", "2.6 Entropy", "Reversible and Irreversible Processes", "A Silly Analogy; Real-World Examples", "3.2 Entropy and Heat", "4.1 Heat Engines", "4.2 Refrigerators", "Notation and Microscopic Physics; Numerical Solution; Analytic Solution", "3.4 Mechanical Equilibrium and Pressure", "3.5 Diffusive Equilibrium and Chemical Potential", "3.6 Summary and a Look Ahead", "Internal Combustion Engines; The Steam Engine", "5.1 Free Energy as Available Work", "5.2 Free Energy as a Force toward Equilibrium", "Extensive and Intensive Quantities; Gibbs Free Energy and Chemical Potential", "5.3 Phase Transformations of Pure Substances", "5.4 Phase Transformations of Mixtures", "Free Energy of a Mixture; Phase Changes of a Miscible Mixture;", "Phase Changes of a Eutectic System", "I will consider more real-life examples of thermodynamics applications in some sessions.", "Daniel V. Schroeder, An Introduction to Thermal Physics An online version of the textbook can be freely accessed through the University of Waterloo library.", "Stephen J. Blundell and Katherine M. Blundell, Concepts in Thermal Physics An online version of the textbook can be freely accessed through the University of Waterloo library.", "Yunus Cengel and Michael Boles, Thermodynamics An Engineering Approach No", "Here are the sections which are from references No2 (Blundell & Blundell) that will be covered in this course:", "1 Introduction                                                                       2", "2.1 A definition of heat                                                           13", "4 Temperature and the Boltzmann factor                          32", "4.1 Thermal equilibrium                                                         32", "4.2 Thermometers                                                                   33", "4.3 The microstates and macrostates                                      35", "4.4 A statistical definition of temperature                              36", "6.1 Molecular distributions                                                    57", "9.2 Thermal conductivity                                                       81", "9.3 Diffusion                                                                           83", "11 Energy                                                                               108", "11.1 Some definitions                                                            108", "11.2 The first law of thermodynamics                                   110", "13.6 Heat engines running backwards                                    133"]}, {"course_id": 30, "course_code": "PHYS 359", "course_name": "PHYS359 - Statistical Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Statistical Mechanics Winter 2025", "10:00AM - 11:20AM MC 4020", "04:30PM - 05:20PM", "02:30PM - 03:20PM", "Prof. Alan Jamison", "Wed 3:30-4:30pm in QNC 4114", "Friday 10:00-11:00am in QNC 4114", "Addison Okell", "Applications to specific heat of solids, classical and quantum gases, electrons in metals, Planck's law of radiation, and Bose-Einstein condensation.", "Make meaningful approximations and justify their validity", "Use statistical ideas to derive probability distributions for observables of large systems", "Apply statistical mechanics to problems from a variety of fields", "Understand how quantum mechanics modifies statistical mechanics and when this is relevant", "Find properties of interacting systems using mean-field theory", "2024-01-20 Continuous degrees of freedom and the Maxwell-Boltzmann distribution (6.3, 6.4) PS2", "2024-02-03 Quantum theory of bosons and fermions (6.7, 7.2) PS4", "2024-03-17 The Debye model and massive bosons (7.5, 7.6) PS8", "Study period", "An Introduction to Thermal Physics by Daniel V. Schroeder Same text as you used for PHYS 358 Yes 58.00", "If you fail to turn in a problem set for any reason, its weight will be shifted to the final exam.", "This course includes the independent development and practice of specific perspectives and methods of rigorous thought.", "Library for research-based assignments"]}, {"course_id": 31, "course_code": "PHYS 363", "course_name": "PHYS363 - Intermediate Classical Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Intermediate Classical Mechanics Fall 2024", "Rigid body mechanics", "Set up Lagrangians and Hamiltonians for a wide range of physical systems", "Find and solve equations of motion using Lagrangian and Hamiltonian mechanics", "Work in noninertial reference frames to solve problems and recognize the consequences of fictitious forces", "Find equations of motion for coupled oscillators and solve linearized equations", "Calculate the inertia tensor of objects and understand the physics of rotating rigid bodies", "Identify conserved quantities using cyclic coordinates, Noether's theorem, and Poisson brackets", "Lagrangian formulation of mechanics and applications (TM Ch 7)", "Hamiltonian formulation of mechanics and applications (TM Ch 7)", "Classical Dynamics of Particles and Systems 5th edition, Thornton and Marion Same text as PHYS 263 Yes", "Python, including several common packages Yes", "A good all round upper-year undergraduate mechanics text.", "Widely used as a graduate level classical mechanics text.", "Introduction to Classical Mechanics: Morin.", "Assignment marks: The mark for each assignment will be based on answers to a subset, possibly all, of the Marked Problems.", "The lowest assignment grade will be removed for calculating the assignment mark.", "Those that require numerical calculations must be worked out using Python.", "These programs are not a substitute for thinking; they should be used sparingly and judiciously as they can become a crutch and will not be available on the midterm or final exams, which account for most of the marks in the course.", "Electronic distractions:  If you can't refrain from using electronics in a distracting way, please show consideration to your peers and sit at the back of the room.", "The assignment weight for the final grade will be reduced and the final exam weight will be increased commensurately for the course grade."]}, {"course_id": 0, "course_code": "AMATH 231", "course_name": "AMATH231 - Calculus 4 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "02:30PM - 03:20PM", "Vector integral calculus-line integrals, surface integrals and vector fields, Green's theorem, the Divergence theorem, and Stokes' theorem.", "Applications include conservation laws, fluid flow and electromagnetic fields.", "An introduction to Fourier analysis.", "Frequency analysis of signals.", "Notice of Recording"]}, {"course_id": 1, "course_code": "AMATH 250", "course_name": "AMATH250 - Introduction to Differential Equations (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Introduction to Differential Equations Winter 2025", "Solving linear differential equations: first- and second-order scalar equations and first-order vector equations.", "The main purpose of the course is to explore how first and second order differential equations (DEs) are used to model physical systems and predict their behaviour.", "first order linear DE models of compartment problems, atomic decay, and bodies in motion;", "first order separable DE models of population growth;", "a first order exact DE model of the electric dipole;", "second order linear DE models for oscillatory systems such as mass-spring-damper systems and electrical circuits;", "second order nonlinear DE models for suspended cables and rocket motion;", "linear vector DE models of multiple compartment problems and species interactions.", "Both analytical solution techniques and qualitative methods (direction field analysis, dimensional analysis, and phase portraits) will be presented as ways to gain information about system behaviour.", "We will investigate conditions for existence, uniqueness, and continuity of solutions of both first and second order initial value problems, and for systems in the plane.", "Maple will be used to generate numerical and graphical solutions, to illustrate concepts graphically, and to explore model behaviour.", "increase your comprehension of some of the many ways that differential equations can help us understand the real world;", "develop your ability to understand a mathematical model for a specific situation;", "explore analytical and qualitative solution methods for first and second order differential equations, and the use of Maple; and", "Please choose only one of the two options below.", "Submission Instructions", "Copyright Notice", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as solving differential equations.", "Library for research-based assignments"]}, {"course_id": 2, "course_code": "AMATH 351", "course_name": "AMATH351 - Ordinary Differential Equations (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Ordinary Differential Equations Fall 2024", "Linear differential equations with non-constant coefficients, Sturm comparison, oscillation and separation theorems, series solutions and special functions.", "Linear systems in Rn, an introduction to dynamical systems.", "Laplace transforms applied to linear systems, transfer functions, the convolution theorem.", "An introduction to dynamical systems and stability.", "Perturbation methods for differential equations.", "Create and understand scientific models in the language of ODEs.", "Know and derive properties of some special functions", "Find solutions to inhomogeneous, first-order ODEs in terms of the fundamental matrix (exponential matrix)", "Understand the existence and uniqueness theorems of ODEs and apply them to systems.", "Apply perturbation methods to find approximate solutions to systems of ODEs.", "September", "Chapter 1: Theory of Second-Order Linear ODEs", "1.1: Introduction to Modelling", "1.2: Classification of DEs", "1.3: 2nd-order linear ODEs", "September", "1.4: Existence and uniqueness", "1.5: General solutions of 2nd-order DEs", "1.7: Examples of 2nd-order DEs with non-constant coefficients", "1.8: Wave equation in a vibrating membrane", "1.10: Method of variation of parameters", "September", "1.11: Qualitative Analysis of DEs", "2.2: Series solutions of first-order equations", "September", "2.3: 2nd-order equations: ordinary points", "-", "2.5 Extended method of Frobenius", "2.6 Bessel functions", "Chapter 2b: Special Functions of mathematical physics", "Bessel functions and the gamma function and properties", "Bessel functions and the gamma function and properties (continued)", "Chapter 3: System of 1st-order equataions", "3.1: Introduction to linear systems", "-", "3.2: Existence-Uniqueness of IVPs", "3.2: Existence-Uniqueness of IVPs, Proof", "3.3 Linear systems and the fundamental matrix", "3.5: Exponential matrix", "3.4 Finding solutions using eigenvalues", "Chapter 7: Perturbation methods", "7.1: Algebraic equations", "7.2: Definitions of the order symbols", "7.3: Duffing's Equation", "7.4: Regular perturbation expansion", "7.5 Poincare Method", "5.2: An example of a BVP", "December", "Differential Equations and Boundary Value Problems, Edwards and Penny No", "Differential Equations with Applications and Historical Notes, Simmons No"]}, {"course_id": 3, "course_code": "AMATH 353", "course_name": "AMATH353 - Partial Differential Equations 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Partial Differential Equations 1 Winter 2025", "08:30AM - 09:20AM", "08:30AM - 09:50AM MC 4063", "Second order linear partial differential equations - the diffusion equation, wave equation, and Laplace's equation.", "Methods of solution - separation of variables and eigenfunction expansions, the Fourier transform.", "Physical interpretation of solutions in terms of diffusion, waves, and steady states.", "First order non-linear partial differential equations and the method of characteristics.", "Develop a mathematical model to explain a scientific principle in the language of Partial Differential Equations (PDEs)", "Determine what analytical method is appropriate to solve a given PDE", "Apply analytical methods to solve PDEs", "Physically interpret solutions of PDEs", "Feb 17-21 Family Day and reading week", "Applied Partial Differential Equations: with Fourier Series and Boundary Value Problems by R Haberman On reserve in DC No $158", "Here are some general instructions for using Crowdmark:", "This course includes the independent development and practice of specific skills, such as solving PDEs.", "Library for research-based assignments"]}, {"course_id": 4, "course_code": "CS 114", "course_name": "CS114 - Principles of Computing for Science (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Principles of Computing for Science Winter 2025", "08:30AM - 09:50AM MC 4059", "Monday -", "Monday", "07:00PM - 08:50PM", "10:30AM - 11:20AM MC 4063", "Coordinator", "Student who make use of office hours usually get better grades; use them!", "Introduction to basic imperative programming principles; programming concepts including functions, flow control, lists, arrays; numerical accuracy and efficiency; data analysis and general-purpose algorithms.", "Introduction to object-oriented programming concepts.", "Describe the basic memory model for mutation of basic types, lists, and objects in Python.", "Identify situations where recursion is an appropriate tool, and use it.", "6 Feb 6-11 M4: Strings and Lists", "7 Feb 13-25 M5: Sorting and Dictionaries", "If both exams are held in person", "If in-person exams cannot be held then they will be held online (if possible).", "Students have the option of self-declaring a short-term absence, as described here: https://uwaterloo.ca/registrar/current-students/undergraduate-student-short-term-absences", "Students should check their basic tests email to ensure that the code meets the specification exactly.", "If ill, please complete a complete a Verification of Illness Form and contact the course coordinator to discuss alternate arrangements.", "Generative AI: This course includes the independent development and practice of specific skills, such as writing and reading code, tracing, and algorithm design.", "Library for research-based assignments"]}, {"course_id": 5, "course_code": "MATH 136", "course_name": "MATH136 - Linear Algebra 1 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Linear Algebra 1 for Honours Mathematics Winter 2025", "08:30AM - 09:20AM MC 4061", "09:30AM - 10:20AM MC 4061", "10:30AM - 11:20AM QNC 2502", "11:30AM - 12:20PM MC 2065", "02:30PM - 03:20PM", "03:30PM - 04:20PM QNC 2502", "11:30AM - 12:20PM MC 4061", "10:30AM - 11:20AM B1 271", "Systems of linear equations, matrix algebra, elementary matrices, computational issues.", "Real n-space, vector spaces and subspaces, basis and dimension, rank of a matrix, linear transformations, and matrix representations.", "Master computational aspects of linear algebra, including matrix and vectors operations", "Solve systems of m linear equations in n unknowns", "Evaluate the inverse of a square matrix, when it exists", "Obtain the matrix representation of a linear transformation", "Evaluate the determinant of a square matrix", "Change co-ordinates and bases, and understand the effect on matrix representations", "Become familiar with operations and properties of abstract vector spaces", "While collaboration in understanding the material is encouraged, the work submitted must be your own, written independently.", "For example, submitting 60 minutes late will result in a maximum possible score of 40%, assuming a perfect score.", "Accommodation Requests", "Notice of Recording", "Allocate time appropriately towards the completion of the assignment which reduces the procrastination and cramming cycle", "Appreciate the importance of reviewing marked assignments", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as reading and writing proofs.", "Library for research-based assignments"]}, {"course_id": 6, "course_code": "MATH 137", "course_name": "MATH137 - Calculus 1 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:30AM - 11:20AM MC 4059", "Monday -", "Monday", "07:00PM - 08:50PM", "Absolute values and inequalities.", "Sequences and their limits.", "Introduction to series.", "Limits of functions and continuity.", "Applications of the Mean Value theorem, Taylor polynomials and Taylor's theorem, Big-O notation.", "We will study these ideas as they relate to sequences and functions.", "First, we will examine sequences and what it means for one to converge.", "Next, we will use our knowledge of sequences to discuss functions, including limits and derivatives.", "Write clear and well-organized mathematical solutions and proofs.", "Solve problems in Calculus through logical thinking and careful analysis.", "Determine if a recursively-defined sequence converges and prove it using mathematical induction.", "Compute the limits of various functions using both the formal definition of the limit, arithmetic rules for limits,and l'Hopital's Rule.", "Find solutions to optimization and related rates problems.", "Sketch curves by first analyzing a given function and its derivatives.", "4: Jan 27 - 31 2.1 - 2.2 Functions and their Limits, Sequential Characterization of Functions, Squeeze Theorem Quiz 3", "7: Mar 3 - 7 3.5 -  3.7 Linear Approximation, Newton's Method, IFT Quiz 6", "8: Mar 10 - 14 3.8 - 4.2 Implicit and Logarithmic Differentiation, Related Rates, Local & Global Extrema, EVT Quiz 7", "9: Mar 17 - 21 ‡ 4.3 - 4.6 MVT and its Applications, Shape of a Function via 1st and 2nd Derivatives Quiz 8", "FE: Mar 31 - Apr 4 4.9 - 4.10 Curve Sketching, Optimization Quiz 10", "Notice of Recording", "Phone: 519-884-0000 extension 213", "Please let us", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 7, "course_code": "MATH 138", "course_name": "MATH138 - Calculus 2 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:20AM", "09:30AM - 10:20AM MC 4059", "10:30AM - 11:20AM MC 4061", "E. Bembenek", "11:30AM - 12:20PM MC 4021", "cpthowel@uwaterloo.ca", "E. Yalcin", "02:30PM - 03:20PM", "08:30AM - 09:20AM QNC 2502", "Introduction to the Riemann integral and approximations.", "Antiderivatives and the fundamental theorem of calculus.", "Applications of the integral.", "Improper integrals.", "Linear and separable differential equations and applications.", "Binomial series, functions defined as power series and Taylor series.", "The goal of this course is to further expand your knowledge of calculus and its applications for one-variable functions.", "First, we will explore areas under curves and the Fundamental Theorem of Calculus, integration techniques, and applications of integration including finding the area between two curves, volumes of solids of revolution, and the average value of a function.", "We will study how to solve separable differential equations and linear differential equations as well as their applications to population growth and Newton's Law of Cooling.", "Write clear and well-organized mathematical solutions and proofs.", "Solve problems in Calculus through logical thinking and careful analysis.", "Set up and evaluate Riemann integrals for simple functions", "Apply various integration techniques including change of variable, integration by parts, trigonometric substitution, and partial fractions.", "Solve separable and first-order linear differential equations.", "Compute the radius and interval of convergence for power series.", "Compute Taylor Polynomials and Taylor series for many elementary functions.", "1: Jan 6 - 10 1.1 - 1.3 Riemann Sums, Definite Integrals, Average Value", "5: Feb 3 - 7 2.1 - 2.2.2, 2.3 Intro to DEs, Direction Fields, Separable and First-Order Linear DEs Quiz 4", "8: Mar 10 - 14 4.1 - 4.3 Intro to Power Series, Differentiation & Integration of Power Series Quiz 7", "FE: Mar 31 - Apr 4 4.8 Big-O Notation Quiz 10", "Notice of Recording", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 8, "course_code": "MATH 235", "course_name": "MATH235 - Linear Algebra 2 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Linear Algebra 2 for Honours Mathematics Winter 2025", "Understand the definition of an abstract vector space and prove theorems about all vector spaces using the axioms.", "In the context of abstract vector spaces, understand and use the concepts of linear independence, spanning sets, bases, and dimension.", "Understand the definition of a linear transformation, and be able to prove whether or not a function is a linear transformation.", "Prove and apply the rank-nullity theorem.", "Understand and use the relationship between abstract linear transformations and matrices.", "Understand the axioms of an inner product, and use them to prove basic results about inner product spaces.", "Unitarily diagonalize a normal matrix.", "See schedule on Learn for a week-by-week breakdown of topics.", "Abstract Vector Spaces", "The definition of a vector space", "Subspaces", "Bases and dimension", "Linear Transformations", "Linear transformations between abstract vector spaces", "Rank and nullity", "Linear maps as matrices", "Change of coordinates", "Isomorphisms of vector spaces", "Eigenvectors", "Diagonalization", "Powers of matrices", "Inner product spaces", "Inner products", "Orthogonality and norm", "Orthonormal bases", "Projections", "Inner products and Gram matrices", "Singular value decomposition", "Singular values and singular vectors", "Singular value decomposition of matrices", "Singular value decomposition of linear maps", "You may complete these in groups of up to 3 students.", "You should be striving each week to understand the material on the assignments and the posted solutions.", "This will be a closed book exam, with no calculators permitted.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as writings proofs and communicating mathematical ideas.", "Library for research-based assignments"]}, {"course_id": 9, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 10, "course_code": "PHYS 121", "course_name": "PHYS121 - Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["An introductory course in physics for students intending to concentrate their future studies in the physical sciences, optometry, or mathematics; includes vectors (dot and cross products), particle kinematics and dynamics, forces in nature, work and energy, conservation of energy and linear momentum, rotational kinematics and dynamics, and conservation of angular momentum.", "Doing Physics - quantities, dimensions, units", "Point Dynamics - force, motion, Newton's laws", "Conservation of Energy - work and energy, conservative systems", "Conservation of linear Momentum - momentum and systems of particles", "Understand the following concepts:", "- Linear kinematics: the relationship between distance, velocity and acceleration.", "- Linear dynamics: a consequence of forces and momentum, and how they interrelate.", "- Kinetic energy, potential energy, work, and their interrelationships.", "We will also re-examine these concepts in a rotating coordinate frame using angular kinematic variables along with torque and angular momentum.", "6 Module 06:  Kinetic and Potential Energy", "7 Module 06:  Kinetic and Potential Energy", "8 Module 07:  Linear Momentum", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- eText + Student Access Code", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- Print Format + Student Access Code"]}, {"course_id": 11, "course_code": "PHYS 121L", "course_name": "PHYS121L - Mechanics Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Mechanics Laboratory Fall 2024", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "Julian Meunier", "Soorna Choheili", "Reza Asadi", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "complete introductory surveys", "complete introductory surveys,", "Complete end-of-term surveys", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 12, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 13, "course_code": "PHYS 122L", "course_name": "PHYS122L - Waves, Electricity and Magnetism Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 2 - Circuits", "Experiment 5 - Magnetic Fields of a Coil", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 14, "course_code": "PHYS 124", "course_name": "PHYS124 - Modern Physics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Songmin Xu s83xu@uwaterloo.ca", "Mastering Physics technical support: https://support.pearson.com/getsupport/s/", "This is a fast-paced survey course (covering about one textbook chapter per week) introducing a wide range of topics in modern physics.", "The intention is four-fold: (1) to make first-year physics more interesting; (2) to provide important, intuitive understanding of key modern physics concepts before your more mathematically rigorous courses in second year; (3) to help you decide which areas of physics you may wish to explore in more depth in upper-year electives; and (4) to have at least a brief introduction to important branches of physics you may not explore further in your degree.", "Apply Newton's second law and Newton's law of universal gravitation to solve basic problems in gravitational physics.", "Understand, distinguish between and correctly use the concepts of weight, weightlessness, and apparent weight.", "Solve simple problems in orbital motion and apply Kepler's three laws.", "Properly understand Einstein's two postulates and logically derive from them, and apply, the concepts of time dilation, length contraction, Doppler shift, velocity composition, relativity of simultaneity, and understand why special relativity works for both wave-in-ether and particle-in-vacuum models of light..", "Articulate the basic, intuitive ideas of how Einstein's geometrical model of gravity works (equivalence principle and curved spacetime).", "Appreciate that classical physics cannot explain the single or double slit experiments.", "Understand and predict basic properties of the quantum hydrogen atom based on only the de Broglie relation and classical properties of electron orbits.", "Understand the basic idea of a complex number, and in particular, a complex exponential wave, and use it to \"derive\" the Schrodinger equation.", "Use classical and quantum physics to understand/calculate ionic bonds, covalent bonds, van der Waals bonds, and basic molecular spectra.", "Use classical and quantum physics to understand/calculate the basic features of atomic nuclei, including nuclear binding energy, nuclear models, nuclear stability and radioactivity, nuclear reactions, nuclear fission, and nuclear fusion.", "Use classical and quantum physics to understand/calculate some basic aspects of collider physics, including the concept of available energy, and an introduction to the Standard Model of particle physics.", "Feb 24 Wave Functions Wave Functions", "Mar 17 Nuclear Nuclear", "Mastering Physics:", "Every student in PHYS 124 is expected to treat their peers and their instructor with kindness, fairness, tolerance, and respect.", "This extends to welcoming the opinions of others and being considerate of their lived experiences.", "Library for research-based assignments"]}, {"course_id": 15, "course_code": "PHYS 234", "course_name": "PHYS234 - Quantum Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["11:30AM - 12:20PM DC 1351", "K. Islam", "Introduction to formalism of quantum physics.", "Introduction to operators.", "Background: understanding why we need a quantum theory", "Learning the building blocks of a quantum theory: state vectors and operator", "Jan 06, 08, 10 Introduction to Quantum Physics, Stern-Gerlach experiments 1", "Jan 20, 22, 24 Matrix notation, general quantum systems, operators 2", "Mar 10, 12, 14 Continuous quantum systems – formalism, infinite potential well,", "Mar 17, 19, 21 Continuous quantum systems – infinite potential well (continued), finite potential well 5", "Mar 24, 26, 28 Continuous quantum systems – quantum harmonic oscillator 9", "Mar 31, Apr 02, 04 Continuous quantum systems (continued), Review", "Students should start checking for posted exam dates:", "Everyone needs a support system.", "Every student in PHYS 234 is expected to treat their peers and their instructor with kindness, fairness, tolerance, and respect.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 16, "course_code": "PHYS 242", "course_name": "PHYS242 - Electricity and Magnetism 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["10:30AM - 11:20AM RCH 301", "calculate electric fields and potentials for charged systems such as a collection of point charges and charge-carrying rods/surfaces/spheres.", "calculate the interactions between a charge and a conductor and understand the electric properties of conductors.", "calculate electric potentials by solving Laplace's equations for various geometries.", "calculate magnetic fields of current-carrying wires/planes and other geometries.", "calculate the magnetic vector potentials of current-carrying wires and solenoids.", "•Electromagnetic induction: Chapter 7", "Introduction to Electrodynamics, 4th or 5th Etd.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 17, "course_code": "PHYS 249", "course_name": "PHYS249 - Computational Physics and Linear Algebra (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Computational Physics and Linear Algebra Fall 2024", "10:30AM - 12:20PM DC 1350", "Email: brenda.lee@uwaterloo.ca", "Computational techniques; numerical accuracy and speed; Python libraries and implementation; algorithms for numerical integration; matrix operations.", "Computational approach to vectors in 2- and 3-space; linear equations, matrices, determinants; eigenvalues and diagonalization.", "Resource Details", "These will not be recorded and consist primarily of board work.", "Understand and apply the basic concepts of vectors, matrices and linear transformations", "Interpret the geometric meaning of vector spaces, subspaces, linear independence, basis and dimension", "Perform matrix operations including addition, multiplication, transposition and inversion both manually and using Python libraries such as NumPy", "Solve systems of linear equations manually and computationally using LU decomposition and Gaussian elimination", "Calculate eigenvalues and eigenvectors of matrices manually and computationally; and interpret their significance in physics applications", "Apply diagonalization techniques to solve differential equations relevant to physics problems", "Understand inner product spaces and concepts of length and orthogonality in both theoretical and computational settings", "Describe and represent linear transformations using matrices; and their contribution to geometric objects and physical systems", "Develop iterative and computational skillsets through Python to model and simulate physical systems with the help of linear algebra concepts", "Identify and articulate transferable skills from their science courses and connect these to the Future Ready Talent Framework", "Create accomplishment statements that effectively communicate these skills on their resumes", "Thursdays Tutorial and Skills Identification & Articulation Workshop @ 10:30am - 12:20pm", "Not all topics may be covered in their entirety, but the core topics from the course calendar description will.", "Topic 1: Intro to Course, Linear Algebra & Python Programming", "2 Sep 9-13 Topic 3: Spanning and Linear Independence", "Topic 5: Projections and Applications", "Skills Identification & Articulation Worksheet 0", "Topic 6: Visualization and Solving of Vector Operations using Python", "Topic 7: Systems of Linear Equations, Gaussian Elimination and Back-Substitution", "Topic 9: Applications of Systems of Linear Equations with Computational Methods and Visualization with Python", "Topic 10: Matrix Addition and Multiplication", "Topic 11: Transpose, Identity and Inverse of a Matrix", "Skills Identification & Articulation Worksheet 1", "Topic 12: Matrix Factorizations", "Topic 13: Computational Methods in Matrix Algebra", "Topic 14: Vector Spaces and Subspaces", "Topic 16: Visualization of Vector Spaces through Computational Methods Skills Identification & Articulation Worksheet 2", "Topic 18: Computational Methods using Determinants", "Topic 19: Eigenvalues and Eigenvectors with Matrix Diagonalization", "Topic 22: Least Squares Approximations Skills Identification & Articulation Worksheet 3", "Topic 23: Numerical Approximation Methods", "UNIT 8 | COMPLEX VALUES & COMPUTATIONAL APPLICATIONS", "Topic 24: Complex Numbers & Computational Applications", "Jan 21: Standing decisions and official grades available in Quest", "Instructions and installation guidance will be provided at the beginning of the term on LEARN Yes", "An Introduction to Linear Algebra for Science and Engineering Excellent book that we will be using in this course; highly recommend getting this if you can No", "Linear Algebra: A Modern Introduction, 4th Edition, David Poole Good elementary book which has suitable problems for scientists No", "Computational Physics, 2nd Edition, Mark Newman Great for beginners to computational physics with Python No", "Introduction to Linear Algebra, 6th Edition, Gilbert Strange (MIT) Excellent mixture of linear algebra and optimization / data science but no physics applications No", "You are encouraged to explore the topics of linear algebra and computational physics / numerical methods of analysis through these recommended textbooks and materials above for your own benefit and enhanced learning experience.", "HOMEWORK (15% Completion Grade): I'm giving you free marks to practice, practice, practice and show you've put in the time to do some linear algebra!", "Level of Collaboration Allowed: Not Monitored", "Do them by the end of the next week to get grades.", "Level of Collaboration Allowed: None - Screening for Plagiarism Active - Debugging Support on Discord is Allowed", "Frequency: Once in the Middle of the Term", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Level of Collaboration Allowed: Groupwork Allowed", "Grading: Based on completion and suitability of responses", "The written content will primarily be code and Jupyter Notebook files.", "Code plagiarism includes moderate to significant reproduction of other's work (source code from available resources, code from classmate submissions, fragments of original code, etc.)", "Notice of Recording", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}]