[{"course_id": 70, "course_code": "NE 452", "course_name": "NE452 - Special Topics in Nanoscale Simulations (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Special Topics in Nanoscale Simulations Winter 2025", "Dr. Subha Kalyaanamoorthy", "Email: subhak@uwaterloo.ca", "Topics in this theme area may include: an overview of modern computational methods and algorithms in nanoscale materials, such as steered molecular dynamics, ab initio molecular dynamics, multiscale modelling, dissipative particle dynamics, transition path sampling, phase-field modelling, quantum simulations using Feynman path integral techniques, condensed-phase spectroscopy, linking of simulations to experiment, simulations and their practical applications.", "*********************************************************************************************************************", "This course provides a comprehensive introduction to molecular simulations, emphasizing their application in bionanotechnology.", "Students will explore the fundamental concepts of biomolecular structure, gaining insights into proteins, lipid membranes, and other biomolecules relevant to nanoengineering.", "The course delves into molecular simulation techniques, focusing on molecular dynamics (MD) simulations as a core method for studying biomolecular interactions, dynamics, and properties.", "Advanced topics include enhanced sampling techniques such as umbrella sampling and metadynamics, which address challenges in exploring complex energy landscapes and rare events.", "Real-world examples from bionanotechnology applications will highlight the role of molecular simulations in solving engineering challenges, such as understanding nanoparticle-biomolecule interactions, studying transport phenomena through lipid membranes, and designing nanostructures for drug delivery and biosensing.", "Through lectures, hands-on practicals, and case studies, students will develop the skills to apply molecular simulations to analyze and innovate within the field of bionanotechnology.", "************************************************************************************************************************", "Describe the structural and functional properties of biomolecules such as proteins, lipid membranes, and polymers, emphasizing their relevance in nanoengineering applications.", "Gain hands-on experience on different software programs such as Visual Molecular Dynamics, Chimera, Pymol that can be used for structure and simulation analyses", "Perform molecular dynamics simulations of different types of molecules and investigate complex free energy landscapes and rare molecular events", "Examine molecular transport through lipid membranes and nanopores, applying simulations to understand key properties and mechanisms.", "Model and interpret the interactions between nanoparticles and biomolecules, understanding their implications for bionanotechnology applications such as drug delivery", "Week 1-2 : Introduction to Biomolecular structure and interactions", "Week 7-8 : Molecular simulations and Molecular dynamics [", "Week 10-12 : MD simulations for bionanotechnology", "Notice of Recording"]}, {"course_id": 71, "course_code": "PHYS 359", "course_name": "PHYS359 - Statistical Mechanics (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Statistical Mechanics Winter 2025", "10:00AM - 11:20AM MC 4020", "04:30PM - 05:20PM", "02:30PM - 03:20PM", "Prof. Alan Jamison", "Wed 3:30-4:30pm in QNC 4114", "Friday 10:00-11:00am in QNC 4114", "Addison Okell", "Applications to specific heat of solids, classical and quantum gases, electrons in metals, Planck's law of radiation, and Bose-Einstein condensation.", "Make meaningful approximations and justify their validity", "Use statistical ideas to derive probability distributions for observables of large systems", "Apply statistical mechanics to problems from a variety of fields", "Understand how quantum mechanics modifies statistical mechanics and when this is relevant", "Find properties of interacting systems using mean-field theory", "2024-01-20 Continuous degrees of freedom and the Maxwell-Boltzmann distribution (6.3, 6.4) PS2", "2024-02-03 Quantum theory of bosons and fermions (6.7, 7.2) PS4", "2024-03-17 The Debye model and massive bosons (7.5, 7.6) PS8", "Study period", "An Introduction to Thermal Physics by Daniel V. Schroeder Same text as you used for PHYS 358 Yes 58.00", "If you fail to turn in a problem set for any reason, its weight will be shifted to the final exam.", "This course includes the independent development and practice of specific perspectives and methods of rigorous thought.", "Library for research-based assignments"]}, {"course_id": 0, "course_code": "AE 405", "course_name": "AE405 - Building Performance Measurement Lab (0.50)", "term_name": "Required Courses", "program_name": "Civil Engineering", "program_id": 29, "major_id": 1, "major_name": "Building Science Specialization", "topics": ["Assistant Professor | Civil and Environmental Engineering", "Email: herry.chen@uwaterloo.ca", "Introduction to the techniques and utility of measuring building performance both during construction, during operation, and before retrofit.", "Introduction to the framework and techniques for measuring the performance of buildings during construction, commissioning, and occupancy.", "Assessment methods and testing standards for topics such as structural damage, stiffness and vibration, rain penetration, air leakage, hygrothermal performance, HVAC system performance, indoor environmental quality, and energy performance will be discussed.", "Explain the importance of building performance measurement", "Identify the relevant codes, standards, and guidelines for building performance", "Compare the strengths and limitations of measurement methods and tools", "Evaluate findings from field audit and measurements", "Recommend mitigation strategies to improve building performance", "Communicate effectively in written and oral formats using professional language", "Deliverables*", "Course Introduction Motivation and definitions Self-guided tour of building failures around campus", "Lab and mock-up testing", "Air leakage testing standards and tools", "Blower door lab", "Interpreting blower door test Methods and planning for IEQ assessment", "IEQ instrument distribution;", "Blower door lab due", "IEQ lab Introduction to IAQ Work time for the final project", "Strategies to improve IAQ Structure damage and health monitoring  Work time for IAQ lab", "Building parameters analysis Building energy submetering  Work time for the final Project", "HVAC and BAS system Building commissioning and POE Work time for the final Project Final project optional first draft (Jul 28)", "*We will provide notice in advance in case of due date changes.", "The final project is due on Aug 8th at 10:00 pm, but this date may change in case of conflicts with other final exams.", "Selected chapters from the Vital Signs Curriculum Material Project posted on LEARN.", "Marks for this course will be distributed over a number of deliverables throughout the term.", "These handouts will contain a breakdown of expectations and individual versus group marks, as well as specific instructions for submission.", "We will review your concerns and respond in a timely manner.", "Please ensure to communicate and coordinate with your group members in advance.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 1, "course_code": "AE 450", "course_name": "AE450 - Building Service Systems (0.50)", "term_name": "Required Courses", "program_name": "Civil Engineering", "program_id": 29, "major_id": 1, "major_name": "Building Science Specialization", "topics": ["Building Service Systems Spring 2024", "The interaction of systems, especially the environmental control systems, with the enclosures and structural systems in design and construction will be specifically considered.", "Prior study of thermodynamic fundamentals (including basic energy balances and basic heat and mass transfer) will be helpful.", "Understand the required functions of building service systems", "Understand how each system interacts with the structure, finish, and performance of the building as a whole", "Be able to help guide the selection of service systems that meet the overall building goal", "Demonstrate understanding of specialized engineering knowledge", "Select appropriate engineering tools6, considering their limitations", "Describe the importance of codes, standards, best practices, laws, and regulations within engineering", "Timing", "Introduction to Active Environmental Systems", "Active Climate Control Systems", "Role of services in modern buildings", "Ventilation and Indoor Air Quality", "Potable and Waste Water Systems", "Hydronic Heating and Cooling Systems", "Fire Suppression Systems", "NFPA 13: Standard for Installation of Sprinkler Systems", "ED1", "Electrical Distribution", "Ontario Electrical Code, 2021", "Electrical Lighting Design", "FE1", "Fire and Egress Modeling and Risk", "Vertical Transportation systems", "Several quizzes will be held during the term.", "Please consider that the personal traits and habits that you develop during your education are carried forward into your career.", "Those who find ways to justify “taking short-cuts” as they pursue their education may be unintentionally training themselves do the same in their careers.", "Unfortunately, engineers who have “taken short-cuts” have been responsible for many disasters and failures."]}, {"course_id": 2, "course_code": "AE 572", "course_name": "AE572 - Building Energy Analysis (0.50)", "term_name": "Required Courses", "program_name": "Civil Engineering", "program_id": 29, "major_id": 1, "major_name": "Building Science Specialization", "topics": ["Building Energy Analysis Fall 2024", "Introduction to whole-building energy analysis.", "Energy auditing, benchmarking, and simulation.", "Review of relevant concepts in heat transfer and thermodynamics, including introductory psychrometrics.", "Economic and environmental impacts of building energy use.", "The course is intended to help students develop knowledge and skills that will be useful in analyzing and diagnosing the energy use of buildings, with the general objectives of reducing environmental, economic, and social impacts of energy use.", "Topics will be presented from a multi-disciplinary perspective, as the design, construction, and operation & maintenance of buildings are all multi-disciplinary endeavors.", "Relevant concepts in thermodynamics and heat transfer will be reviewed.", "Selected building systems and components will be studied, including aspects of building envelope, lighting, and HVAC systems.", "Apply basic energy calculations to a variety of components and systems impacting building energy use.", "2. Apply simple analysis techniques in building energy auditing and simulation.", "Apply basic calculations to assess impacts of building energy use (e.g. economic cost, GHG emissions).", "Criteria for accreditation include expectations that graduating students will be generally capable of demonstrating certain attributes.", "Indicator", "Knowledge Base (1c) Demonstrate understanding of specialized engineering knowledge.", "D", "D", "D", "D", "D", "D", "D", "Impact of Engineering (9b) Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "D", "Introduction & Fundamentals", "Energy Analysis Fundamentals", "Energy Auditing, Benchmarking, & Re-tuning", "Simple Heating System: Design & Analysis", "Load Duration Curve", "2. Building Components & Systems", "Interior Lighting Systems", "Aspects of 1-D Heat Transfer", "Building Envelope", "Aspects of Simple HVAC Components & Systems", "3. Aspects of Building Energy Simulation", "Aspects of Whole-Building Energy Simulation", "Application of Simulation Results in Design", "Careful review of the course notes and completion of the practice problems should be viewed as key activities to help you develop understanding of the course material and prepare for tests/exams.", "Some projects may be completed in small groups.", "P1 Small Building Re-Tuning", "P2 Lighting System Analysis", "P3 Building Envelope Analysis", "P4 Whole-Building Energy Simulation", "eQUEST", "Please consider that the personal traits and habits that you develop during your education are carried forward into your career.", "Those who find ways to justify “taking short-cuts” as they pursue their education may be unintentionally training themselves do the same in their careers.", "Unfortunately, engineers who have “taken short-cuts” have been responsible for many disasters and failures."]}, {"course_id": 3, "course_code": "AE 573", "course_name": "AE573 - HVAC Systems, Equipment, and Energy Efficiency (0.50)", "term_name": "Required Courses", "program_name": "Civil Engineering", "program_id": 29, "major_id": 1, "major_name": "Building Science Specialization", "topics": ["Notice of Recording", "HVAC Systems, Equipment, and Energy Efficiency Winter 2025", "Selected topics in HVAC systems design with focus on energy-efficiency and environmental-sustainability.", "Heating and cooling distribution using air-, water-, and refrigerant-based systems.", "Constant- and variable-flow systems.", "Heat- and energy-recovery systems.", "Vapour-compression refrigeration and heat-pump systems (including air- and geothermal-source heat pumps).", "Selected topics in HVAC systems design, with focus on energy-efficiency and environmental-sustainability: heating and cooling distribution using air-, water-, and refrigerant-based systems; constant- and variable-flow systems; heat- and energy-recovery systems; vapor-compression heat-pump systems, including air-and geothermal-source heat pumps.", "Course Overview: Achieving significant reductions in building energy consumption will be important in efforts to deal with the environmental and socioeconomic impacts of energy use.", "The energy used by heating, ventilating, and air-conditioning (HVAC) systems represents a large portion of the energy consumption of most commercial, institutional, and residential buildings.", "This course will introduce selected topics in HVAC systems design, with focus on energy-efficiency and environmental-sustainability: heating and cooling distribution using air-, water-, and refrigerant-based systems; constant- and variable-flow systems; heat- and energy-recovery systems; vapor-compression heat-pump systems, including air- and geothermal-source heat pumps.", "Recommended Preparation: It is strongly recommended that students have engaged in prior study of introductory concepts in thermodynamics, heat transfer, and fluid mechanics, including analysis of refrigeration cycles and basic psychrometrics.", "Students without this background are expected to undertake additional study to acquire sufficient competency in each topic.", "Perform simple thermodynamic calculations for selected HVAC components and systems.", "2. Explain operational characteristics of selected energy-saving strategies for HVAC systems.", "3. Assess the potential for selected energy-saving strategies to operate effectively for a variety of operating conditions and applications.", "Criteria for accreditation include expectations that graduating students will be generally capable of demonstrating certain attributes.", "Indicator", "Knowledge Base (1c) Demonstrate understanding of engineering fundamentals.", "D", "(1d) Demonstrate understanding of specialized engineering knowledge.", "D", "D", "D", "D", "D", "Impact of Engineering (9b) Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "D", "Section", "Introduction", "Review of selected fundamental concepts.", "Considerations for equipment selection.", "3. Variable-Flow Hydronic Systems", "Closed-loop hydronic systems.", "Constant- and variable-flow systems.", "4. Aspects of Ventilation Systems", "Air-to-air energy recovery systems.", "4. Aspects of Ventilation Systems (cont'd)", "System considerations with AAER equipment.", "Heat-Pump Systems and Equipment", "Simple and modified refrigerant cycles.", "Air- and water-source systems.", "Simultaneous heating/cooling systems.", "Useful References:  i) the ASHRAE Handbooks can be accessed through the university library via the Knovel database; ii) the CIBSE applications manual “AM17 Heat Pump Installations for Large Non-Domestic Buildings (2022)” (free pdf) is an excellent reference for many concepts covered by this course; iii) for a textbook covering general aspects of HVAC design & analysis, consider: “Heating and Cooling of Buildings: Principles and Practice of Energy Efficient Design (Third Edition)”, by T.A. Reddy et al.. CRC Press, 2016.", "Notice of Recording", "Please consider that the personal traits and habits that you develop during your education are carried forward into your career.", "Those who find ways to justify “taking short-cuts” as they pursue their education may be unintentionally training themselves do the same in their careers.", "Unfortunately, engineers who have “taken short-cuts” have been responsible for many disasters and failures."]}, {"course_id": 4, "course_code": "CIVE 507", "course_name": "CIVE507 - Building Science and Technology (0.50)", "term_name": "Required Courses", "program_name": "Civil Engineering", "program_id": 29, "major_id": 1, "major_name": "Building Science Specialization", "topics": ["Notice of Recording", "Energy related considerations.", "describe the build up of some common enclosure assemblies and what the layers do", "understand some of the factors that influence the design of the buildings and their envelope elements, especially energy, moisture & durability, risk, reliability, constructability, sustainability, and circularity.", "demonstrate the design skills developed in the course applying the knowledge and analysis methods", "Formulate a problem statement; develop models to solve engineering problems including identifying approximations, assumptions and constraints; critically evaluate solutions of engineering problems; select appropriate engineering tools, considering their limitations; describe the importance of codes, standards, best practices, laws, and regulations within engineering.", "1 06-Jan-25 09-Jan-25 Introduction", "5 03-Feb-25 06-Feb-25 Moisture Intro", "6 10-Feb-25 13-Feb-25 Moisture Diffusion", "17-Feb-25 20-Feb-25 Reading Week", "7 24-Feb-25 27-Feb-25 Air Flow 1", "9 10-Mar-25 13-Mar-25 Moisture & Materials", "11 24-Mar-25 27-Mar-25 Applications", "Notice of Recording"]}, {"course_id": 5, "course_code": "ENVE 277", "course_name": "ENVE277 - Air Quality Engineering (0.50)", "term_name": "Required Courses", "program_name": "Civil Engineering", "program_id": 29, "major_id": 1, "major_name": "Building Science Specialization", "topics": ["Basic atmospheric science and meteorology to support the fate and transport of air pollutants.", "Overview of control and treatment methods.", "Indoor air exposure estimates and the function of the HVAC components.", "Understand the basics of current and emerging atmospheric issues", "Be familiar with control and treatment methods and perform simple designs to mitigate air quality issues", "3 Sep 23-27 Atmospheric Issues 3 2/3 A1 (Ch.1-3)", "Introduction to Atmospheric Chemistry, Daniel J. Jacob, Princeton University Press, 2000.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 6, "course_code": "ENVE 279", "course_name": "ENVE279 - Energy and the Environment (0.50)", "term_name": "Required Courses", "program_name": "Civil Engineering", "program_id": 29, "major_id": 1, "major_name": "Building Science Specialization", "topics": ["Energy and the Environment Fall 2024", "11:30AM - 12:20PM RCH 306", "03:30PM - 04:20PM DWE 3518", "Drop-in Hours: TBD in E2 2315; online (MSTeams) by request", "Conservation of energy, energy balances on closed systems.", "Phase change in natural environmental systems; The basics of heat engines, refrigerators, and heat pumps.", "Problems of thermodynamics and energy are regularly encountered by environmental engineering professionals.", "Basic knowledge of thermodynamics, the science of energy, is required to solve and understand many problems in water resources, wastewater treatment, air pollution, and energy harvesting.", "We are likewise tasked with dealing with the air, water, and soil pollution that are a common by-product of energy extraction and utilization.", "The objective of this course is to introduce you to theoretical and practical aspects of energy transport and work in both natural and manmade systems, and learn how to estimate heat/energy transfer and energy consumption in these systems.", "Develop basic mass and energy balances for closed systems", "Be familiar with critical concepts in thermodynamics: energy, enthalpy, mechanical and electrical work, specific heat, entropy", "Estimate magnitudes of conductive, convective, and radiative heat transfer in natural and engineered systems", "Calculate energy required for phase change in environmental systems", "Understand the basic functioning of a range of renewable and non-renewable energy technologies (e.g., photovoltaics, wind & water turbines, geothermal systems, nuclear power plants, biofuel, etc.).", "Be able to perform simple calculations to estimate the efficiency of heat engines, refrigerators, and heat pumps.", "Apply simplified design approaches to select renewable energy technologies", "Understand the issues with, and be able to compare, energy technologies in terms of their environmental impact and energy costs", "Be familiar with the basic issues of energy policy", "Forms of energy; temperature", "Energy of a system; Energy transfer by heat and work", "First law of thermodynamics", "Conservation of energy", "Energy balances on closed systems", "Energy balances with phase change; Enthalpy", "Week 6 Steam Tables, Air-water systems", "Energy balances on open systems", "Heat transfer problems", "Second law of thermodynamics; Entropy", "Energy technologies overview", "Energy generation;", "Energy storage", "Renewable energy policy", "Comparing and evaluating technologies", "Solar energy resources", "Correct answers without clear and concise justification will be awarded minimal marks.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Attendance at co-operative work-term employment interviews is not considered to be a valid reason to miss a test"]}, {"course_id": 7, "course_code": "ME 452", "course_name": "ME452 - HVAC Load Analysis and Design Fundamentals (0.50)", "term_name": "Required Courses", "program_name": "Civil Engineering", "program_id": 29, "major_id": 1, "major_name": "Building Science Specialization", "topics": ["Notice of Recording", "HVAC Load Analysis and Design Fundamentals Winter 2025", "11:30AM - 12:20PM RCH 305", "Email: hasan.habib@uwaterloo.ca", "Duct design and fan selection.", "Heating and cooling load calculations.", "Infiltration and exfiltration.", "B. Be able to fully design an air conditioning and ventilation system", "C. Be able to perform heating and cooling load, and preliminary energy use calculations for buildings", "D. Have developed the ability to apply their knowledge in a real-world setting (practical experience)", "E. Be capable of communicating effectively with industry professionals and clients", "F. Have developed the skills to research and interpret information needed to remain current in the field", "Module 1: Introduction to HVAC:  History, ASHRAE, Unit Systems (chap.", "Module 2: Air Conditioning and Ventilation: Fundamental Concepts of HVAC/Air Conditioning Systems (chap.", "3), Fans and Air Distribution Systems (chap. 16).", "A tentative checklist of material to be reviewed each week will be posted in Learn.", "Midterm Exam: will be held in two parts during scheduled lecture time.", "You can also present case studies of interesting buildings or even a biographical review of someone who made an impact to HVAC.", "A) Develop an appreciation and understanding for the various codes, standards, and guidelines that determine HVAC design practices X    X", "B) Fully specify and design an air conditioning and ventilation system   X", "C) Perform heating and cooling load, and preliminary energy use calculations for buildings     X", "F) Develop the skills to research and interpret information needed to remain current in the field X", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 8, "course_code": "ME 572", "course_name": "ME572 - Building Energy Analysis (0.50)", "term_name": "Required Courses", "program_name": "Civil Engineering", "program_id": 29, "major_id": 1, "major_name": "Building Science Specialization", "topics": ["Building Energy Analysis Fall 2024", "Introduction to whole-building energy analysis.", "Energy auditing, benchmarking, and simulation.", "Review of relevant concepts in heat transfer and thermodynamics, including introductory psychrometrics.", "Economic and environmental impacts of building energy use.", "The course is intended to help students develop knowledge and skills that will be useful in analyzing and diagnosing the energy use of buildings, with the general objectives of reducing environmental, economic, and social impacts of energy use.", "Topics will be presented from a multi-disciplinary perspective, as the design, construction, and operation & maintenance of buildings are all multi-disciplinary endeavors.", "Relevant concepts in thermodynamics and heat transfer will be reviewed.", "Selected building systems and components will be studied, including aspects of building envelope, lighting, and HVAC systems.", "Apply basic energy calculations to a variety of components and systems impacting building energy use.", "2. Apply simple analysis techniques in building energy auditing and simulation.", "Apply basic calculations to assess impacts of building energy use (e.g. economic cost, GHG emissions).", "Criteria for accreditation include expectations that graduating students will be generally capable of demonstrating certain attributes.", "Indicator", "Knowledge Base (1c) Demonstrate understanding of specialized engineering knowledge.", "D", "D", "D", "D", "D", "D", "D", "Impact of Engineering (9b) Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "D", "Introduction & Fundamentals", "Energy Analysis Fundamentals", "Energy Auditing, Benchmarking, & Re-tuning", "Simple Heating System: Design & Analysis", "Load Duration Curve", "2. Building Components & Systems", "Interior Lighting Systems", "Aspects of 1-D Heat Transfer", "Building Envelope", "Aspects of Simple HVAC Components & Systems", "3. Aspects of Building Energy Simulation", "Aspects of Whole-Building Energy Simulation", "Application of Simulation Results in Design", "Careful review of the course notes and completion of the practice problems should be viewed as key activities to help you develop understanding of the course material and prepare for tests/exams.", "Some projects may be completed in small groups.", "P1 Small Building Re-Tuning", "P2 Lighting System Analysis", "P3 Building Envelope Analysis", "P4 Whole-Building Energy Simulation", "eQUEST", "Please consider that the personal traits and habits that you develop during your education are carried forward into your career.", "Those who find ways to justify “taking short-cuts” as they pursue their education may be unintentionally training themselves do the same in their careers.", "Unfortunately, engineers who have “taken short-cuts” have been responsible for many disasters and failures."]}, {"course_id": 9, "course_code": "ME 573", "course_name": "ME573 - HVAC Systems, Equipment, and Energy Efficiency (0.50)", "term_name": "Required Courses", "program_name": "Civil Engineering", "program_id": 29, "major_id": 1, "major_name": "Building Science Specialization", "topics": ["Notice of Recording", "HVAC Systems, Equipment, and Energy Efficiency Winter 2025", "Selected topics in HVAC systems design with focus on energy-efficiency and environmental-sustainability.", "Heating and cooling distribution using air-, water-, and refrigerant-based systems.", "Constant- and variable-flow systems.", "Heat- and energy-recovery systems.", "Vapour-compression refrigeration and heat-pump systems (including air- and geothermal-source heat pumps).", "Selected topics in HVAC systems design, with focus on energy-efficiency and environmental-sustainability: heating and cooling distribution using air-, water-, and refrigerant-based systems; constant- and variable-flow systems; heat- and energy-recovery systems; vapor-compression heat-pump systems, including air-and geothermal-source heat pumps.", "Course Overview: Achieving significant reductions in building energy consumption will be important in efforts to deal with the environmental and socioeconomic impacts of energy use.", "The energy used by heating, ventilating, and air-conditioning (HVAC) systems represents a large portion of the energy consumption of most commercial, institutional, and residential buildings.", "This course will introduce selected topics in HVAC systems design, with focus on energy-efficiency and environmental-sustainability: heating and cooling distribution using air-, water-, and refrigerant-based systems; constant- and variable-flow systems; heat- and energy-recovery systems; vapor-compression heat-pump systems, including air- and geothermal-source heat pumps.", "Recommended Preparation: It is strongly recommended that students have engaged in prior study of introductory concepts in thermodynamics, heat transfer, and fluid mechanics, including analysis of refrigeration cycles and basic psychrometrics.", "Students without this background are expected to undertake additional study to acquire sufficient competency in each topic.", "Perform simple thermodynamic calculations for selected HVAC components and systems.", "2. Explain operational characteristics of selected energy-saving strategies for HVAC systems.", "3. Assess the potential for selected energy-saving strategies to operate effectively for a variety of operating conditions and applications.", "Criteria for accreditation include expectations that graduating students will be generally capable of demonstrating certain attributes.", "Indicator", "Knowledge Base (1c) Demonstrate understanding of engineering fundamentals.", "D", "(1d) Demonstrate understanding of specialized engineering knowledge.", "D", "D", "D", "D", "D", "Impact of Engineering (9b) Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "D", "Section", "Introduction", "Review of selected fundamental concepts.", "Considerations for equipment selection.", "3. Variable-Flow Hydronic Systems", "Closed-loop hydronic systems.", "Constant- and variable-flow systems.", "4. Aspects of Ventilation Systems", "Air-to-air energy recovery systems.", "4. Aspects of Ventilation Systems (cont'd)", "System considerations with AAER equipment.", "Heat-Pump Systems and Equipment", "Simple and modified refrigerant cycles.", "Air- and water-source systems.", "Simultaneous heating/cooling systems.", "Useful References:  i) the ASHRAE Handbooks can be accessed through the university library via the Knovel database; ii) the CIBSE applications manual “AM17 Heat Pump Installations for Large Non-Domestic Buildings (2022)” (free pdf) is an excellent reference for many concepts covered by this course; iii) for a textbook covering general aspects of HVAC design & analysis, consider: “Heating and Cooling of Buildings: Principles and Practice of Energy Efficient Design (Third Edition)”, by T.A. Reddy et al.. CRC Press, 2016.", "Notice of Recording", "Please consider that the personal traits and habits that you develop during your education are carried forward into your career.", "Those who find ways to justify “taking short-cuts” as they pursue their education may be unintentionally training themselves do the same in their careers.", "Unfortunately, engineers who have “taken short-cuts” have been responsible for many disasters and failures."]}, {"course_id": 0, "course_code": "CHE 102", "course_name": "CHE102 - Chemistry for Engineers (0.50)", "term_name": "1A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Chemistry for Engineers Winter 2025", "CHE 102", "E. Boghaert", "Eline Boghaert (eline.boghaert@uwaterloo.ca)", "While this course can be completed asynchronously online, synchronous online sessions will be held on Wednesday from 11:30 AM - 12:30 PM and Friday from 12:30 PM - 1:30 PM to review key concepts, demonstrate problem solving and answer questions.", "Stoichiometric calculations, properties of gases, properties of liquids and solutions, gas phase chemical equilibrium, ionic equilibrium in aqueous solution, oxidation-reduction reactions, chemical kinetics.", "View requirements for CHE 102", "Explain the behavior of ideal systems (including different states of matter, physical and chemical equilibrium and reaction kinetics) in terms of the molecular nature of matter.", "Write balanced chemical reactions and perform stoichiometric calculations.", "Identify which principles of physical chemistry are relevant to the analysis of problems involving physical and chemical equilibrium and rates of reaction.", "Select and apply an appropriate law to solve problems involving physical and chemical equilibrium and rates of reaction.", "Apply course concepts to identify and analyze concerns regarding the safety and/or sustainability of a chemical process.", "Unit 1: Introduction and Stoichiometry Week 1", "Introduction Lesson 1: Introduction to Significant Digits, Line Calculations and Unit Conversions (1.4, 1.5, 1.7)", "Lesson 5.1: Chemical Equilibrium and Equilibrium Constants (15.1-15.4)", "Unit 6: Equilibrium in Electrochemical Systems Week 11", "Lesson participation grades for each lesson are evenly weighted in the total lesson participation grade.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 1, "course_code": "CIVE 104", "course_name": "CIVE104 - Mechanics 1 (0.25)", "term_name": "1A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["11:30AM - 12:20PM RCH 302", "10:00AM - 11:20AM STC 0060", "Monday -", "Monday", "07:00PM - 08:50PM", "11:30AM - 12:20PM RCH 305", "02:30PM - 03:20PM", "RCH 204", "03:30PM - 04:20PM", "RCH 204", "02:30PM - 03:20PM", "08:30AM - 09:50AM CPH 3604", "Monday -", "Monday", "07:00PM - 08:50PM", "09:00AM - 09:50AM CPH 3604", "Force systems; vectors, forces and moments; equilibrium and free body diagrams.", "Solve 2-D equilibrium on a particle", "Solve 2-D equilibrium in a rigid body", "Demonstrate required engineering skills", "Statics and Mechanics of Materials sixtyh edition by R.C. Hibbeler, Pearson Prentice-Hall, 2022 No", "Mechanics I handout available on LEARN Yes", "Identify forces and loads applied on structures (30%)", "ILO 2: Solve 2-D equilibrium in a rigid body (30%)", "Calculate net forces and moments on rigid bodies (30%)", "Solve forces using equilibrium equations (35%)", "Identify ethical and unethical behavior in professional situations (10%)", "Identify gaps in your knowledge, skills and abilities (15%)"]}, {"course_id": 2, "course_code": "MATH 116", "course_name": "MATH116 - Calculus 1 for Engineering (0.50)", "term_name": "1A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["03:30PM - 04:20PM", "RCH 301", "RCH 301", "08:30AM - 09:20AM", "03:30PM - 04:20PM", "Monday, Friday -", "11:30AM - 12:20PM", "02:30PM - 03:20PM", "09:30AM - 10:20AM RCH 103", "11:30AM - 12:20PM RCH 103", "11:30AM - 12:20PM STC 0060", "02:30PM - 03:20PM", "02:30PM - 03:20PM", "10:30AM - 11:20AM RCH 101", "09:30AM - 10:20AM RCH 110", "03:30PM - 04:20PM", "07:00PM - 08:50PM", "RCH 204", "DWE 3516", "PHY 313", "02:30PM - 04:20PM DWE 3518", "08:30AM - 10:20AM RCH 204", "08:30AM - 10:20AM MC 4063", "08:30AM - 10:20AM MC 4060", "08:30AM - 10:20AM MC 4058", "02:30PM - 04:20PM MC 4060", "DWE 1515", "DWE 3522A", "Applications of the integral.", "Use trigonometric, exponential, and logarithmic functions to solve a variety of problems.", "Use differentiation to solve a variety of application problems including curve sketching, related rates, and optimization problems.", "Introduction and Review of Functions (Domain, Range, etc.)", "Compositions of Functions", "Inverses of Functions", "Odd and Even Functions, Transformations", "Piecewise and Heaviside Function", "Trigonometric and \"Inverse\" Trigonometric Functions", "Exponential and Logarithmic Functions", "Hyperbolic Trig Functions", "Limits", "Continuity", "§ 2.1-2.4", "Differentiation", "Implicit and Logarithmic Differentiation", "Curve Sketching Techniques", "Optimization Problems", "§ 4.2-4.8", "Linear Approximation, Differentials", "The Definite Integral", "Indefinite Integrals", "Integration by Substitution", "Integration by Parts", "In particular:"]}, {"course_id": 3, "course_code": "CIVE 115", "course_name": "CIVE115 - Linear Algebra (0.25)", "term_name": "1A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Linear Algebra Fall 2024", "10:00AM - 11:20AM STC 0060", "03:30PM - 04:20PM", "10:00AM - 11:20AM RCH 105", "11:30AM - 12:20PM RCH 103", "10:00AM - 11:20AM RCH 105", "11:30AM - 12:20PM RCH 103", "02:30PM - 03:20PM", "08:30AM - 09:50AM CPH 3604", "11:30AM - 12:20PM", "WEEF TAs are also available but students are strongly encouraged to seek help first from a member of the teaching team.", "Linear systems of equations, matrices, and determinants.", "Introduction to the eigenvalue problem.", "This course introduces fundamental linear algebra concepts such as linear systems of equations, matrices, vector spaces, and the eigenvalue problem with emphasis on applications used by civil, environmental, geological, and architectural engineers.", "Construct and systematically solve systems of linear equations.", "Predict the solution properties given the properties of the system.", "Construct vectors and perform vector operations (e.g., length, dot, and cross products) by hand.", "Identify and solve basic eigenvalue and eigenvector problems.", "Linear systems of two and three variables, substitution, elimination, graphical solutions; ordered lists, vectors, parameters; Systems of equations as matrices and vectors, elementary row operations, reduced row echelon form, Gaussian elimination, rank, independent and dependent equations, solution sets; homogeneous systems and solutions", "Matrices: general, vectors, zero, transpose, square, diagonal, triangular, identity, symmetric; rank, independent and dependent rows and columns; Matrix arithmetic: equality, addition, scalar multiplication, matrix multiplication; Inverse matrix: procedure, properties, inverse method of solving a system; Elementary matrices", "Vectors in Rn: standard and geometric, addition and scalar multiplication, length, unit vectors; vector equations of lines, planes and hyperplanes; dot product, projections, cross and box product in 3D; linear independence, linear dependence, span, basis, change of basis", "Matrix-vector multiplication as a linear transformation;", "Eigenvalues and eigenvectors: definition, procedure, interpretation;", "A First Course in Linear Algebra: an Open Text, by Lyryx Learning, Version 2017 Revision A, based on original text by K. Kuttler, 2012.", "The use of a basic scientific calculator is allowed in this course.", "Each student is responsible for verifying their calculator meets these restrictions.", "Axle Fulcrum Gear Helix Lever Multi-Media Pulley Wedge WEEF Wheel", "Exams", "Both will be individual closed-book tests.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 4, "course_code": "ENVE 115", "course_name": "ENVE115 - Linear Algebra (0.25)", "term_name": "1A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Linear Algebra Fall 2024", "10:00AM - 11:20AM STC 0060", "03:30PM - 04:20PM", "10:00AM - 11:20AM RCH 105", "11:30AM - 12:20PM RCH 103", "10:00AM - 11:20AM RCH 105", "11:30AM - 12:20PM RCH 103", "02:30PM - 03:20PM", "08:30AM - 09:50AM CPH 3604", "11:30AM - 12:20PM", "WEEF TAs are also available but students are strongly encouraged to seek help first from a member of the teaching team.", "Linear systems of equations, matrices, and determinants.", "Introduction to the eigenvalue problem.", "This course introduces fundamental linear algebra concepts such as linear systems of equations, matrices, vector spaces, and the eigenvalue problem with emphasis on applications used by civil, environmental, geological, and architectural engineers.", "Construct and systematically solve systems of linear equations.", "Predict the solution properties given the properties of the system.", "Construct vectors and perform vector operations (e.g., length, dot, and cross products) by hand.", "Identify and solve basic eigenvalue and eigenvector problems.", "Linear systems of two and three variables, substitution, elimination, graphical solutions; ordered lists, vectors, parameters; Systems of equations as matrices and vectors, elementary row operations, reduced row echelon form, Gaussian elimination, rank, independent and dependent equations, solution sets; homogeneous systems and solutions", "Matrices: general, vectors, zero, transpose, square, diagonal, triangular, identity, symmetric; rank, independent and dependent rows and columns; Matrix arithmetic: equality, addition, scalar multiplication, matrix multiplication; Inverse matrix: procedure, properties, inverse method of solving a system; Elementary matrices", "Vectors in Rn: standard and geometric, addition and scalar multiplication, length, unit vectors; vector equations of lines, planes and hyperplanes; dot product, projections, cross and box product in 3D; linear independence, linear dependence, span, basis, change of basis", "Matrix-vector multiplication as a linear transformation;", "Eigenvalues and eigenvectors: definition, procedure, interpretation;", "A First Course in Linear Algebra: an Open Text, by Lyryx Learning, Version 2017 Revision A, based on original text by K. Kuttler, 2012.", "The use of a basic scientific calculator is allowed in this course.", "Each student is responsible for verifying their calculator meets these restrictions.", "Axle Fulcrum Gear Helix Lever Multi-Media Pulley Wedge WEEF Wheel", "Exams", "Both will be individual closed-book tests.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 5, "course_code": "GEOE 115", "course_name": "GEOE115 - Linear Algebra (0.25)", "term_name": "1A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Linear Algebra Fall 2024", "10:00AM - 11:20AM STC 0060", "03:30PM - 04:20PM", "10:00AM - 11:20AM RCH 105", "11:30AM - 12:20PM RCH 103", "10:00AM - 11:20AM RCH 105", "11:30AM - 12:20PM RCH 103", "02:30PM - 03:20PM", "08:30AM - 09:50AM CPH 3604", "11:30AM - 12:20PM", "WEEF TAs are also available but students are strongly encouraged to seek help first from a member of the teaching team.", "Linear systems of equations, matrices, and determinants.", "Introduction to the eigenvalue problem.", "This course introduces fundamental linear algebra concepts such as linear systems of equations, matrices, vector spaces, and the eigenvalue problem with emphasis on applications used by civil, environmental, geological, and architectural engineers.", "Construct and systematically solve systems of linear equations.", "Predict the solution properties given the properties of the system.", "Construct vectors and perform vector operations (e.g., length, dot, and cross products) by hand.", "Identify and solve basic eigenvalue and eigenvector problems.", "Linear systems of two and three variables, substitution, elimination, graphical solutions; ordered lists, vectors, parameters; Systems of equations as matrices and vectors, elementary row operations, reduced row echelon form, Gaussian elimination, rank, independent and dependent equations, solution sets; homogeneous systems and solutions", "Matrices: general, vectors, zero, transpose, square, diagonal, triangular, identity, symmetric; rank, independent and dependent rows and columns; Matrix arithmetic: equality, addition, scalar multiplication, matrix multiplication; Inverse matrix: procedure, properties, inverse method of solving a system; Elementary matrices", "Vectors in Rn: standard and geometric, addition and scalar multiplication, length, unit vectors; vector equations of lines, planes and hyperplanes; dot product, projections, cross and box product in 3D; linear independence, linear dependence, span, basis, change of basis", "Matrix-vector multiplication as a linear transformation;", "Eigenvalues and eigenvectors: definition, procedure, interpretation;", "A First Course in Linear Algebra: an Open Text, by Lyryx Learning, Version 2017 Revision A, based on original text by K. Kuttler, 2012.", "The use of a basic scientific calculator is allowed in this course.", "Each student is responsible for verifying their calculator meets these restrictions.", "Axle Fulcrum Gear Helix Lever Multi-Media Pulley Wedge WEEF Wheel", "Exams", "Both will be individual closed-book tests.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 6, "course_code": "COMMST 191", "course_name": "COMMST191 - Communication in the Engineering Profession (AE, CIVE, ENVE, GEOE) (0.50)", "term_name": "1A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["jclausen@uwaterloo.ca (please do not use the D2L email system)", "I monitor my email M-F, 9:00 am - 5:00 pm.", "I am teaching multiple communication courses, and especially early in the sememster, I cannot always quickly know whch course you are referring to just from your email.", "In this course students in Architectural, Civil, Environmental, and Geological Engineering will enhance oral and written communication competencies in contexts relevant to the engineering profession.", "In this course, you will work to enhance your written and oral technical communication competencies in contexts relevant to the engineering profession as well as to your future career.", "More generally, in this course, you should anticipate learning what professional norms of technical communication and dominant forms of sharing knowledge prevail within and across the fields of engineering.", "Yet this course also attempts to impart awareness and appreciation for how these communicative forms are matters of social context and sites of negotiation and contestation.", "By extension, this progression also encourages you to find a place and voice in the conversations within your fields of study and to reflect upon the meaning and shape of available forums for technical communication.", "I perceive our classroom as a co-constructed space, in which readings and discussions may frequently challenge your attitudes, your unconsciously held beliefs, or your positions on current issues.", "To ensure a safe and open space in which all can converse and learn productively, it is vital that we conduct our relationships with respect and an ethic of care.", "Describe and apply conventions, genres, norms, and values of communication in an engineering discipline;", "Compose persuasive, audience-specific technical arguments;", "Analyze and summarice technical content in clear and concise ways;", "Deliver effective oral presentations; and", "Appraise and reflect on their own compositions, and those of their peers, to strategically revise and edit documents and presentations", "Objectives for Students of Communication Studies", "You (students) will understand the complexity of communication as a human process of shared meaning-making in the context of power, history, and culture.", "You will increase your capacity to recognize and enhance yours and others’ agency – the ability to make a difference in the world for yourself and others – and understand the implications of your communication behaviors for yourself and others.", "Recognize diverse linguistic practices and modes of communication as resources for writers and speakers.", "You will understand communication as a practice, and improve your critical and creative communication competencies by developing your ability to use writing, speaking, and other media of communication to create effective and engaging artifacts.", "Your will reflect on your role in fostering the public good (the multifaceted well-being of individuals and groups), begin to imagine a better future, and make decisions in your communication that can transform the communities to which you belong.", "Introduction to Communication/What is this course about?", "Audience Analysis", "Demographics and Professional Audiences", "Researching and Describing Technical Subjects", "Chapter 11: Technical Definitions and Descriptions", "In-class Oral Proposals", "Document Design and Models of Communication", "Feb 15-21  R    E    A    D    I    N    G      W    E    E    K", "March 4: Research Abstract", "Stakeholder Analysis and Persuasion", "“Identifying and Analyzing Stakeholders and Their Interests” (Online)", "Nov. 14:  Stakeholder Analysis In-class Activity", "Ethics", "Joy Buolamwini, “How I’m Fighting Bias in Algorithms,” TED (Video)", "Engagement and contribution is demonstrated in a number of ways.", "At the end of the term you will have a chance to make the case for what grade you believe you should receive with a self-assessment.", "Did I contribute something for each of the activities (if any) listed for that week?", "Did I make my contributions available to my peers in a timely manner that they can respond and engage with it?", "In this assignment, you will choose a specific topic related to civil engineering and identify an overarching problem to produce a project proposal.", "In this assignment you will creating a proposal in response to an imagined request for proposals (RFP) from a contractor in the industry, and presenting that proposal in a short three-minute pitch for your classmates, who will consider the persuasiveness of your proposal.", "Failures of retaining walls", "Failures of suspension bridges", "Importance and justification of arches", "Role of surveying in engineering", "In groups of 2 or 3, you will provide a technical summary of that element for a public, non-specialist audience.", "You will present a summary of the project element as a poster presentation on a standard 24x36 inch poster board using a combination of written and graphic communication.", "We may be involved in a public displaying of the posters we create, alongside students from other sections of Engineering Communication on evening in February over in one of the Engineering buildings.", "Part 2: Research Abstract", "The abstract should provide information relevant to solutions to the problem you articulated in your proposal and continue to advocate for a particular solution/recommendations.", "For the final project you will create a policy brief aimed at a clear stakeholder audience.", "Instructions", "A formal policy brief includes the following sections:", "Executive summary", "Explanation of results", "identify and address a specific policy-making audience", "explain the current research on this topic in clear, non-technical language", "highlight the features of the research most relevant for policy makers and stakeholders", "make one or two recommendations based on your synthesis of the research", "Natural Resource Development", "Climate Change Impact", "Mass Transportation Design", "Communicative competencies will play a significant role in distinguishing the most successful engineers from others who are equally skilled technicians but who lack the ability to communicate effectively.", "You will hand-in a 200 word individual reflection on the process of translating engineering concepts for a public non-expert audience.", "You should reflect on what skills, competencies and concepts you used in creating your final project.", "What do you think are your strengths and weaknesses in communicative competencies?", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 7, "course_code": "ENGL 191", "course_name": "ENGL191 - Communication in the Engineering Profession (AE, CIVE, ENVE, GEOE) (0.50)", "term_name": "1A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["e-mail: cgiannak@uwaterloo.ca", "In this course students in Architectural, Civil, Environmental, and Geological Engineering will enhance oral and written communication competencies in contexts relevant to the engineering profession.", "View requirements for ENGL 191", "Students will enhance their critical-thinking skills and creative competencies to better understand meaning-making, perception, and responsibility.", "Explain the role of reports, the press, advertising, video and other communications media in engineering [", "Demonstrate command of appropriate writing skills and style [", "Construct a persuasive technical argument [", "Week 1: Professional Communication in Engineering", "- Introduction to Course; Writing Email/Letters for the Workplace; Loss Control Bulletin/Saving Email; Intro to Assignment 1: Pitch Email", "Week 2: Communicating Problems in Engineering", "- Swales CARS model of Engineering Articles; Info-Seeking Module; Proposal Pre-Research Exercise; Bibliographies", "- Engineering Case Studies; Cases: Responding and Reporting; Usability Testing; Introduction to Assignment 3: Engineering Proposal; Week 6 Check-In", "- Introduction to Engineering Proposals; Writing Winning Proposals; Charts & Budgets", "- Audience and Appeals; Applying rhetorical and persuasive techniques; Applying Swales CARS to the proposal genre; Introduce Assignment 4: Reflection", "Week 9: Designing Documents & Layouts", "Writing in the Technical Fields: A Practical Guide.", "You will be able to access and complete key components of the course at a week-to-week pace online.", "Content for each week will be delivered in the form of modules.", "The main assignments in the course function as parts of a whole: the pitch, progress report, proposal, and reflection form a course-long project whose theme and structure you should consider from the start of the term.", "The proposal, in addition to being a well-conceived, clearly structured, and persuasive document, is intended to communicate an engineering idea you wish to pursue, an idea you will first present through the pitch email.", "We will discuss how to do this in our first weeks together.", "Assessment & Accommodation", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 8, "course_code": "MATH 118", "course_name": "MATH118 - Calculus 2 for Engineering (0.50)", "term_name": "1B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:30AM - 11:20AM RCH 110", "02:30PM - 03:20PM", "RCH 306", "09:30AM - 10:20AM RCH 105", "RCH 306", "10:30AM - 11:20AM RCH 103", "RCH 204", "02:30PM - 03:20PM", "02:30PM - 04:20PM MC 4060", "Monday -", "Monday", "Linear and separable first order differential equations, applications.", "Parametric curves and polar coordinates, arc length and area.", "Get experience in writing well-organized and readable mathematical solutions, so that you will be able to communicate mathematical or technical ideas.", "Select an appropriate integration technique and apply it to solve indefinite or definite integrals.", "Find a power series representation of a function and find a closed form for a function represented by a power series.", "Understand the formal definition of the limit of a sequence and use it to prove basic limits.", "Understand the principle of mathematical induction and use it to prove some mathematical statements.", "Integration by substitution (review)", "Integration by parts (review)", "Trigonometric integrals", "Trigonometric substitution and completing the square", "Partial fractions", "Numerical integration", "Error bounds for numerical integration", "Improper integrals", "First make up lecture occurs", "Separable DEs, linear first-order DEs", "Applications of DEs", "Sequences, limits of sequences", "Recursively-defined sequences, mathematical induction", "Appendix A", "Integral test, p-series", "Comparison tests", "Second make up lecture occurs", "-", "Winter reading week", "-", "Absolute vs. conditional convergence", "Ratio and root tests", "Estimating sums", "Power series", "Taylor and Maclaurin series", "Sums of power series", "Applications of series", "Parametric equations", "Polar coordinates, polar curves", "Area and arc length of polar curves", "In particular:"]}, {"course_id": 9, "course_code": "AE 123", "course_name": "AE123 - Electrical Circuits and Instrumentation (0.50)", "term_name": "1B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electrical Circuits and Instrumentation Spring 2024", "Friday -", "Friday", "10:30AM - 12:20PM", "Duty", "E-mail", "Meagan Alexandra Yerxa LAB Coordinator E2-1786 mayerxa@uwaterloo.ca", "Function and characteristics of basic electrical transducers.", "Basics of data acquisition.", "Identify main components in measurement systems.", "Design a basic measurement system.", "1 May 06-10 Introduction to sensors, measurement and data acquisition  First week, no Lab", "2 May 13-17 Current, Voltage, Power, Energy, Circuit Elements, KCL, KVL,  Lab 1: Introduction to circuit and measurement", "3 May 20-24 Introduction to Circuits Resistances in Series & Parallel, Equivalent Resistance Analysis, Voltage Divider & Current Divider  Lab 2: Circuit building", "13 Jul 29 – 30 Introduction to smart homes NO LAB", "Electrical Engineering: Principles and Applications, A.R. Hambley, 7th edition No", "Demos for circuit basics: https://youtube.com/playlist?list=PLDkq31epwdjxzg5AHIOsDk0dry4lAW5Sl"]}, {"course_id": 10, "course_code": "CIVE 123", "course_name": "CIVE123 - Electrical Circuits and Instrumentation (0.50)", "term_name": "1B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electrical Circuits and Instrumentation Winter 2025", "Monday, Friday -", "10:00AM - 11:20AM RCH 302", "Duty", "E-mail", "Function and characteristics of basic electrical transducers.", "Basics of data acquisition.", "Demos for circuit basics: https://youtube.com/playlist?list=PLDkq31epwdjxzg5AHIOsDk0dry4lAW5Sl", "3 1&2 Current, Voltage, Power and Energy,", "4 2&3 Basic resistive circuit techniques", "9 6 Operational Amplifiers", "10 7 Capacitors and inductors", "12 9 AC Circuit Analysis - I"]}, {"course_id": 11, "course_code": "ENVE 123", "course_name": "ENVE123 - Electrical Circuits and Instrumentation (0.50)", "term_name": "1B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Electrical Circuits and Instrumentation Spring 2024", "11:30AM - 12:20PM E2 1732", "08:30AM - 09:20AM E2 1732", "Friday -", "Friday", "10:30AM - 12:20PM", "E-mail", "QNC 2609/ Microsoft Teams", "Duty", "E-mail", "Basharat Mehmood", "First Year Tutors and WEEF Lab Tas", "E2-1719B", "E2-1786", "Function and characteristics of basic electrical transducers.", "Basics of data acquisition.", "Function and characteristics of basic electrical transducers.", "Basics of data acquisition.", "Apply knowledge of engineering to the analysis and design of electrical circuits,", "Identify and solve engineering problems in the circuits’ area,", "Design electric systems, components for different required applications.", "Identify the fundamental tools of linear circuit analysis that will be useful to all engineers (learning the “alphabet” of circuits), Apply basic laws: Ohms law, KVL, KCL and power calculations, Measure resistive networks’ and simplify complicated networks, Analyze different circuit analysis techniques, Analyze and design different circuits using ideal op-amps, Examine circuits containing energy storage elements, Examine phasor frequency domain analysis, State and understand the fundamental of electrical transducers.", "Identify the fundamental tools of linear circuit analysis that will be useful to all engineers (learning the “alphabet” of circuits),", "Apply basic laws: Ohms law, KVL, KCL and power calculations,", "Analyze and design different circuits using ideal op-amps,", "Examine circuits containing energy storage elements,", "Examine phasor frequency domain analysis,", "State and understand the fundamental of electrical transducers.", "1 May 06-10 Introduction to Measurement System First week, no Lab", "2 May 13-17 Introduction to Basic concepts Current, Voltage, Power, Energy, and Circuit Elements,  Lab 1 activity", "3 May 20-24 Introduction to Ohm’s law, KCL, KVL, Circuits Resistances in Series & Parallel, Voltage Divider & Current Divider  Lab 2 activity", "8 June 24-28 Operational and Instrumentational Amplifiers  Lab 5 activity", "12 July 22-26 AC Circuit Analysis - II Lab Project", "13 July 29-30 Introduction to smart homes No Activity", "It is very important for students to attempt solving the problems on their own regularly to reinforce their comprehension of the concepts and analysis techniques presented throughout the term, and for after-exams happiness.", "KVL and KCL", "Circuits Resistances, Voltage Divider & Current Divider", "Midterms Week", "8 June 24-28", "Operational Amplifiers", "Capacitors and inductors", "AC Circuit Analysis", "Room Number", "TBD", "TBD", "Basharat Mehmood", "TBD", "E2-1786", "We will closely follow “Electrical Engineering: Principles & Applications” 7/E by Hambley, Pearson", "First, students will use theory to create a high-quality design for a sensor system, then they will test and validate their design.", "Notice of Recording", "EnveGeoe123 course include the independent development and practice of specific skills as mentioned above."]}, {"course_id": 12, "course_code": "GEOE 123", "course_name": "GEOE123 - Electrical Circuits and Instrumentation (0.50)", "term_name": "1B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Electrical Circuits and Instrumentation Spring 2024", "11:30AM - 12:20PM E2 1732", "08:30AM - 09:20AM E2 1732", "Friday -", "Friday", "10:30AM - 12:20PM", "E-mail", "QNC 2609/ Microsoft Teams", "Duty", "E-mail", "Basharat Mehmood", "First Year Tutors and WEEF Lab Tas", "E2-1719B", "E2-1786", "Function and characteristics of basic electrical transducers.", "Basics of data acquisition.", "Function and characteristics of basic electrical transducers.", "Basics of data acquisition.", "Apply knowledge of engineering to the analysis and design of electrical circuits,", "Identify and solve engineering problems in the circuits’ area,", "Design electric systems, components for different required applications.", "Identify the fundamental tools of linear circuit analysis that will be useful to all engineers (learning the “alphabet” of circuits), Apply basic laws: Ohms law, KVL, KCL and power calculations, Measure resistive networks’ and simplify complicated networks, Analyze different circuit analysis techniques, Analyze and design different circuits using ideal op-amps, Examine circuits containing energy storage elements, Examine phasor frequency domain analysis, State and understand the fundamental of electrical transducers.", "Identify the fundamental tools of linear circuit analysis that will be useful to all engineers (learning the “alphabet” of circuits),", "Apply basic laws: Ohms law, KVL, KCL and power calculations,", "Analyze and design different circuits using ideal op-amps,", "Examine circuits containing energy storage elements,", "Examine phasor frequency domain analysis,", "State and understand the fundamental of electrical transducers.", "1 May 06-10 Introduction to Measurement System First week, no Lab", "2 May 13-17 Introduction to Basic concepts Current, Voltage, Power, Energy, and Circuit Elements,  Lab 1 activity", "3 May 20-24 Introduction to Ohm’s law, KCL, KVL, Circuits Resistances in Series & Parallel, Voltage Divider & Current Divider  Lab 2 activity", "8 June 24-28 Operational and Instrumentational Amplifiers  Lab 5 activity", "12 July 22-26 AC Circuit Analysis - II Lab Project", "13 July 29-30 Introduction to smart homes No Activity", "It is very important for students to attempt solving the problems on their own regularly to reinforce their comprehension of the concepts and analysis techniques presented throughout the term, and for after-exams happiness.", "KVL and KCL", "Circuits Resistances, Voltage Divider & Current Divider", "Midterms Week", "8 June 24-28", "Operational Amplifiers", "Capacitors and inductors", "AC Circuit Analysis", "Room Number", "TBD", "TBD", "Basharat Mehmood", "TBD", "E2-1786", "We will closely follow “Electrical Engineering: Principles & Applications” 7/E by Hambley, Pearson", "First, students will use theory to create a high-quality design for a sensor system, then they will test and validate their design.", "Notice of Recording", "EnveGeoe123 course include the independent development and practice of specific skills as mentioned above."]}, {"course_id": 13, "course_code": "CIVE 121", "course_name": "CIVE121 - Computational Methods (0.50)", "term_name": "1B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Computational Methods Winter 2025", "08:30AM - 09:50AM RCH 302", "Introduction to computer programming, examples of efficient numerical algorithms for basic scientific computations.", "Programming and problem solving concepts introduced in the course will be incorporated into group projects involving civil, environmental, or geological engineering applications.", "MATLAB is an easy and readable programming language and is an excellent choice for those who are learning programming for the first time.", "Students who complete this course will gain a fundamental understanding of computer programming techniques and be able to operate, analyze, and visualize all types of data for future engineering studies.", "It is an introductory programming course that utilizes MATLAB to illustrate general concepts in computer programming.", "Compose working, efficient, and readable MATLAB scripts in various ways.", "Debug your code to identify and fix programming errors.", "Identify suitable keywords to search for code snippets on the web."]}, {"course_id": 14, "course_code": "ENVE 121", "course_name": "ENVE121 - Computational Methods (0.50)", "term_name": "1B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Computational Methods Spring 2024", "08:30AM - 09:20AM", "03:30PM - 04:20PM", "08:30AM - 09:20AM E2 1732", "03:30PM -", "Introduction to computer programming, examples of efficient numerical algorithms for basic scientific computations.", "Programming and problem-solving concepts introduced in the course will be incorporated into projects involving architectural engineering applications.", "Introduction to computer programming, examples of efficient numerical algorithms for basic scientific computations.", "Programming and problem solving concepts introduced in the course will be incorporated into group projects involving civil, environmental, or geological engineering applications.", "MATLAB is an easy and readable programming language and is an excellent choice for those who are learning programming for the first time.", "Students who complete this course will gain a fundamental understanding of computer programming techniques and be able to operate, analyze, and visualize all types of data for future engineering studies.", "It is an introductory programming course that utilizes MATLAB to illustrate general concepts in computer programming.", "\"Linear algebra\" (AE/CIVE/ENVE/GEOE 115) is a prerequisite for this course, which you already learned in the 1A term.", "Folders", "Kahoot", "Compose working, efficient, and readable MATLAB scripts in various ways.", "Debug your code to identify and fix programming errors.", "Identify suitable keywords to search for code snippets on the web.", "Type and run all scripts of sample solutions in the course material and tutorial videos.", "Module 01 Basic MATLAB Programming N/A", "Module 05 Built-in Functions May 29", "Lectures are to deliver fundamental knowledge and information in each module and are not to give a direction on how to solve your homework assignments or quizzes.", "\"MATLAB-A Practical Introduction to Programming and Problem Solving,\" Elsevier, 2018.", "\"MATLAB for Engineers,\" Pearson, 2017.", "To encourage participation, when students ask at least one question each month in LEARN, they will receive 1 point of an engagement extra points each month.", "Please be respectful of your peers, instructor, and others in your posts and comments.", "It is a compilation of frequently asked questions for each Module.", "Students receive 1.5 point if they simply join ALL kahoot sessions in the corresponding module.", "Step 1: Go to the Kahoot!", "The instructor will show the pin number in each game.", "You are ready for joining the game", "For example, updating programming logic or shortening the scripts will be greatly helpful that you can employ such code in your future script.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Experience has shown that the students who copy friend's solutions do not know how to make them different and tend to not bother to change their friends' code."]}, {"course_id": 15, "course_code": "GEOE 121", "course_name": "GEOE121 - Computational Methods (0.50)", "term_name": "1B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Computational Methods Spring 2024", "08:30AM - 09:20AM", "03:30PM - 04:20PM", "08:30AM - 09:20AM E2 1732", "03:30PM -", "Introduction to computer programming, examples of efficient numerical algorithms for basic scientific computations.", "Programming and problem-solving concepts introduced in the course will be incorporated into projects involving architectural engineering applications.", "Introduction to computer programming, examples of efficient numerical algorithms for basic scientific computations.", "Programming and problem solving concepts introduced in the course will be incorporated into group projects involving civil, environmental, or geological engineering applications.", "MATLAB is an easy and readable programming language and is an excellent choice for those who are learning programming for the first time.", "Students who complete this course will gain a fundamental understanding of computer programming techniques and be able to operate, analyze, and visualize all types of data for future engineering studies.", "It is an introductory programming course that utilizes MATLAB to illustrate general concepts in computer programming.", "\"Linear algebra\" (AE/CIVE/ENVE/GEOE 115) is a prerequisite for this course, which you already learned in the 1A term.", "Folders", "Kahoot", "Compose working, efficient, and readable MATLAB scripts in various ways.", "Debug your code to identify and fix programming errors.", "Identify suitable keywords to search for code snippets on the web.", "Type and run all scripts of sample solutions in the course material and tutorial videos.", "Module 01 Basic MATLAB Programming N/A", "Module 05 Built-in Functions May 29", "Lectures are to deliver fundamental knowledge and information in each module and are not to give a direction on how to solve your homework assignments or quizzes.", "\"MATLAB-A Practical Introduction to Programming and Problem Solving,\" Elsevier, 2018.", "\"MATLAB for Engineers,\" Pearson, 2017.", "To encourage participation, when students ask at least one question each month in LEARN, they will receive 1 point of an engagement extra points each month.", "Please be respectful of your peers, instructor, and others in your posts and comments.", "It is a compilation of frequently asked questions for each Module.", "Students receive 1.5 point if they simply join ALL kahoot sessions in the corresponding module.", "Step 1: Go to the Kahoot!", "The instructor will show the pin number in each game.", "You are ready for joining the game", "For example, updating programming logic or shortening the scripts will be greatly helpful that you can employ such code in your future script.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Experience has shown that the students who copy friend's solutions do not know how to make them different and tend to not bother to change their friends' code."]}, {"course_id": 16, "course_code": "CIVE 153", "course_name": "CIVE153 - Earth Engineering (0.50)", "term_name": "1B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Earth Engineering Winter 2025", "Monday, Friday -", "08:30AM - 09:50AM RCH 302", "10:30AM - 11:20AM RCH 302", "10:30AM - 11:20AM RCH 305", "Keith Delaney", "Email: keith.delaney@uwaterloo.ca", "Email: anne.allen@uwaterloo.ca", "Email: jen.parks@uwaterloo.ca", "Azi Zebarjadian - a2zebarj@uwaterloo.ca", "The course develops a geological knowledge for applications to any physical environment and provides an appreciation of the impact of engineering work on the environment.", "Topics include mineral and rock identification, the rock cycle, structural geology and tectonics, geology of Canada, effects of water, ice and wind.", "Students are also introduced to the concept of geologic time, topographic and geologic maps, and the basic principles and tools used to determine geologic history.", "Gain insight into why engineers are continually challenged by the science behind a complex and changing earth.", "Understand and apply engineering design principles in the context of a changing earth.", "Gain basic experience in identifying earth materials and in earth material testing.", "Establish the academic background required to take advanced earth sciences and geotechnical engineering courses.", "Geology and Soils Labs: This course includes seven laboratory sessions that will be held during the term.", "Students need to self-organize into case study groups, with the same number of students in each group.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 17, "course_code": "ENVE 153", "course_name": "ENVE153 - Earth Engineering (0.50)", "term_name": "1B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Earth Engineering Spring 2024", "Monday, Friday -", "10:00AM - 11:20AM E2 1732", "03:30PM - 04:20PM E2 1732", "The course develops a geological knowledge for applications to any physical environment and provides an appreciation of the impact of engineering work on the environment.", "Topics include mineral and rock identification, the rock cycle, structural geology and tectonics, geology of Canada, effects of water, ice and wind.", "Students are also introduced to the concept of geologic time, topographic and geologic maps, and the basic principles and tools used to determine geologic history.", "Gain insight into why engineers are continually challenged by the science behind a complex and changing earth.", "Understand and apply engineering design principles in the context of a changing earth.", "Gain basic experience in identifying earth materials and in earth material testing.", "Establish the academic background required to take advanced earth sciences and geotechnical engineering courses.", "Lecture & Deliverables Schedule:", "of", "4 May 26 L9: Earth systems L10: Earth systems L11: Igneous rocks", "of", "Lab Groups 201 & 203 Lab Groups 202 & 204", "4 May 26 Soils: Atterberg Limit – 201 & 203  Soils: Atterberg Limit – 202 & 204", "6 June 9 Geology: Minerals – 201 & 203  Geology: Minerals – 202 & 204", "8 June 23 Geology: Igneous Rocks – 201 & 203  Geology: Igneous Rocks – 202 & 204", "9 June 30 Geology: Sedimentary & Metamorphic Rocks – 201 & 203  Geology: Sedimentary & Metamorphic Rocks – 202 & 204", "10 July 7 Geology: Geological Maps – 201 & 203  Geology: Geological Maps – 202 & 204", "Soils labs are in DWE 1427", "Geology labs are in EIT 1013", "of", "Monday", "Friday", "(Design Day)", "Soils Report – Introduction"]}, {"course_id": 18, "course_code": "GEOE 153", "course_name": "GEOE153 - Earth Engineering (0.50)", "term_name": "1B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Earth Engineering Spring 2024", "Monday, Friday -", "10:00AM - 11:20AM E2 1732", "03:30PM - 04:20PM E2 1732", "The course develops a geological knowledge for applications to any physical environment and provides an appreciation of the impact of engineering work on the environment.", "Topics include mineral and rock identification, the rock cycle, structural geology and tectonics, geology of Canada, effects of water, ice and wind.", "Students are also introduced to the concept of geologic time, topographic and geologic maps, and the basic principles and tools used to determine geologic history.", "Gain insight into why engineers are continually challenged by the science behind a complex and changing earth.", "Understand and apply engineering design principles in the context of a changing earth.", "Gain basic experience in identifying earth materials and in earth material testing.", "Establish the academic background required to take advanced earth sciences and geotechnical engineering courses.", "Lecture & Deliverables Schedule:", "of", "4 May 26 L9: Earth systems L10: Earth systems L11: Igneous rocks", "of", "Lab Groups 201 & 203 Lab Groups 202 & 204", "4 May 26 Soils: Atterberg Limit – 201 & 203  Soils: Atterberg Limit – 202 & 204", "6 June 9 Geology: Minerals – 201 & 203  Geology: Minerals – 202 & 204", "8 June 23 Geology: Igneous Rocks – 201 & 203  Geology: Igneous Rocks – 202 & 204", "9 June 30 Geology: Sedimentary & Metamorphic Rocks – 201 & 203  Geology: Sedimentary & Metamorphic Rocks – 202 & 204", "10 July 7 Geology: Geological Maps – 201 & 203  Geology: Geological Maps – 202 & 204", "Soils labs are in DWE 1427", "Geology labs are in EIT 1013", "of", "Monday", "Friday", "(Design Day)", "Soils Report – Introduction"]}, {"course_id": 19, "course_code": "CIVE 204", "course_name": "CIVE204 - Solid Mechanics 1 (0.50)", "term_name": "2A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 09:50AM DWE 1501", "08:30AM - 10:20AM DWE 1501", "Compound stress and stress transformations.", "Design concepts.", "View requirements for CIVE 204", "The Statics portion of the course mainly involves three-dimensional force system analysis and the Solid Mechanics course content is focused on examining material response (i.e., stress and strain conditions) in different sections/members under external loads.", "Specific topics include transverse shear, torsion of shafts, treatment of compound stresses, and the introduction of beam deflections and basic design concepts.", "The primary objective of this course is to provide students with conceptual knowledge to analyse simple structural systems and to evaluate the mechanical response of the structural components comprising these systems.", "Calculate distributions and magnitudes of stresses in elements subjected to shear, torsion, bending, and combinations thereof", "Construct axial force, shear force, and bending moment diagrams for beams and frame elements", "Determine deflected beam shapes and compute the magnitudes of deflections at key locations", "Design simple beams to satisfy strength and/or service criteria", "Section", "Study Problems", "Systems of Forces: 3-D", "2.5", "Cartesian Vectors", "Addition of Cartesian Vectors", "Position Vectors", "2.8", "Force Vector Directed Along a Line", "3.3", "Moment of a Force-Vector Formulation", "3.4", "Principle of Moments", "3.5", "Moment of a Force About a Specified Axis", "Equilibrium: 3-D", "4.5", "Free-Body Diagrams", "4.6", "Equations of Equilibrium", "Solid Mechanics:", "Section", "Study Problems", "Shear", "Shear in Straight Members", "The Shear Formula", "Shear Flow in Built-Up Members", "Statically Indeterminate Torque-Loaded Members", "Thin-walled closed sections", "Unsymmetric Bending", "Inelastic bending", "Deflection of Beams", "The Elastic Curve", "Method of Superposition", "Design Concepts", "Prismatic Beam Design", "There will be two in-person tests over the course of the semester, each worth 20 % of the course grade.", "Tests will be roughly 100-minutes long and will be written during the tutorial periods.", "A comprehensive in-person final examination will be scheduled by the Registrar.", "In-Class Example Problems:", "Success in this course requires an understanding of the concepts and practice solving problems.", "Example problems will be solved during the lectures and tutorials to support the concepts presented.", "Example problems will be worked during lecture periods to demonstrate concepts.", "A booklet of the in-class problems may be downloaded from Waterloo LEARN.", "Supplemental Study Problems:", "The study/practice problems are not to be handed in, but completion of the problems will be essential for developing understanding of the course material and for success on the tests and final examination.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 20, "course_code": "CIVE 224", "course_name": "CIVE224 - Probability and Statistics (0.50)", "term_name": "2A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["04:00PM - 05:20PM", "02:30PM - 03:20PM", "TBD", "Role of probability in engineering and decision-making under uncertainty.", "Basic probability concepts.", "Introduction to risk.", "CIVE224 Probability and Statistics course introduces the basic concepts of probability and statistics to Civil and Environmental Engineering students.", "The course discusses the role of probability in engineering and decision-making under uncertainty.", "Basic probability concepts.", "Introduction to risk.", "Concepts introduced in this course include, but are not limited to:", "Probability, including basic concepts and Combination of events", "6. Regression Analysis, including Linear, Curvilinear, and Multiple regression", "Calculate and analyze basic descriptive statistics", "Master the normal and t-distributions, be aware of their shapes and properties and how to calculate associated probabilities.", "Comprehend the notion of a sampling distribution and know the sampling distribution of the sample mean, and sample variance under various circumstances.", "Construct a confidence interval and carry out a hypothesis test on a mean, proportion, variance (or differences of two populations of these).", "Construct a confidence interval and carry out a hypothesis test on a mean, proportion, variance (or differences of two populations of these).", "Have a basic understanding of how statistics can be used in risk and reliability assessment.", "Probability and Statistics for Engineers and Scientists.", "Quiz 3 includes questions related to Probability and Quality Control (Acceptance Sampling) or normal distribution, Confidence Intervals and Sample Size Determination (Estimation Theory and Confidence Intervals), and Hypothesis Testing (Simple Linear Regression and Inference in Linear Regression).", "You are responsible for solving these problems on your own to ensure the solution is correct.", "These problems are critical for you to do well in the exams."]}, {"course_id": 21, "course_code": "CIVE 241", "course_name": "CIVE241 - Transport Principles and Applications (0.50)", "term_name": "2A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Transport Principles and Applications Fall 2024", "P. Tavassoti-Kheiry", "08:30AM - 09:20AM", "DWE 1501", "P. Tavassoti-Kheiry", "Application of scientific principles to the planning, design, maintenance and management of transportation systems.", "The basic principles of transportation engineering for contemporary urban transportation modes; auto, transit, cycling and walking, and intercity modes; rail and air.", "The objective of the course is to introduce you to the basic principles and key elements of transportation systems; that is, the framework for safe design of vertical and horizontal alignments, characterizing highway capacity and traffic volume, good pavement design, pavement materials characterization, and general design and planning of airports.", "A fuller treatment of the overall areas of transportation principles and applications is given in the course notes and optional references.", "Understand the major components and modes of transport systems and their importance", "Apply numerical/mathematical methods as well as fundamental physics principles to solve problems about vertical and horizontal highway alignments, clear zones, and SSSD", "Apply proper methods to determine the Level of Service for different road classes, evaluate highway capacity, and identify traffic volume and characteristics", "Be familiar with the general history of pavements and evolution of structural design methods", "Understand the key concepts of pavement materials and their characterization", "Be able to apply AASHTO 1993 design method for flexible pavements", "Understand the major failure mechanisms for flexible and rigid pavements and distresses", "Understand the basics of Airport Planning and Design, naming of runways, and types of aircrafts", "Quantify the Environmental Impacts of the Airport with a focus on Noise Levels", "Apply the geometric design concepts to design a simple project for the engineering design days", "Design (Recorded-Online) Chapter 4", "Happy Thanksgiving!", "12 18 - Nov L - 18 Environmental Impacts of Airports Chapter 2", "No classes for CIVE Design Days", "Design Days Report", "You need to know how to use these information and be familiar with the parameters in the equations yourself.", "The course notes can be purchased from W. Printing through BookLook and PDF copies of the individual chapters will be shared on LEARN Yes", "The course notes can be purchased from W. Printing through BookLook and PDF copies of the individual chapters will be shared on LEARN.", "Transportation Association of Canada Geometric Design Guide, Transportation Association of Canada, Ottawa, 2005", "Pavement Asset Design and Management Guide, Tighe S. (Editor), Publications of the Transportation Association of Canada, 2013, 460 p.", "Chap 1: Introduction to Transportation Planning and Engineering", "Chap 2: Airport Planning and Design", "Chap 5: Pavements Structural Design", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as problem solving skills, engineering design principles, engineering judgment development, and critical thinking.", "Library for research-based assignments"]}, {"course_id": 22, "course_code": "CIVE 265", "course_name": "CIVE265 - Structure and Properties of Materials (0.50)", "term_name": "2A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Structure and Properties of Materials Fall 2024", "10:00AM - 11:20AM STC 0020", "A basic course in structure, behaviour, and uses of engineering materials.", "Topics include monotonic and cyclic stress-strain behaviour of metals.", "Metallurgy and mechanical properties of irons and steels.", "Structure and mechanical properties of wood, cements, and concrete.", "know the materials commonly used in civil engineering applications", "understand how materials fail and how failure can be prevented and detected", "8 Equilibrium phase diagrams", "10 Thermal processing of metals", "19 Polymers -", "Materials for Civil and Construction Engineers 4th Edition”, J.P. Zaniewski and M.S. Mamlouk, Pearson Education Yes", "Materials Science and Engineering: An Introduction 10th Edition, Kindle Edition; William D. Callister Jr. and David G. Rethwisch No", "Deliverable Submission and Late Submission Policy:", "These standards include neat, legible printing, use of a straight edge for straight lines, and use of an eraser to correct mistakes."]}, {"course_id": 23, "course_code": "CIVE 221", "course_name": "CIVE221 - Advanced Calculus (0.50)", "term_name": "2A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Advanced Calculus Fall 2024", "10:00AM - 11:20AM STC 0020", "Email: spotapenko@uwaterloo.ca", "Differentiation; partial derivatives of implicit and explicit functions, applications including optimizations.", "Integration; multiple integrals in various co-ordinate systems with applications.", "Vector calculus; vector fields, line integrals, surface integrals, and applications.", "Numerical integration and differentiation.", "Differential Calculus of Multivariable Functions", "Multiple Integrals", "Introduction to Vector Calculus", "develop skills in differential and integral calculus of multivariable functions at the level sufficient to study upper level engineering courses", "analyze the behaviour of multivariable functions", "evaluate typical multiple and line integrals", "apply major theorems of vector calculus to physical problems", "Chapter 12: Differential calculus of multivariable functions", "Multivariable functions, 799 (D. Trim, Calculus for Engineers, 4th edition)", "Limits and continuity, 803", "Relative maxima and minima, 851", "Absolute maxima and minima, 860", "Fluid pressure, 911", "Centers of mass and moments of inertia, 916", "Surface area, 925", "Double iterated integrals in polar coordinates, 930", "Centers of mass and moments of inertia, 950", "Triple iterated integrals in cylindrical coordinates", "Triple iterated integrals in spherical coordinates, 959", "General transformations in multiple integrals, 965", "Vector fields, 983", "Line integrals involving vector functions, 998", "Energy and conservative force fields, 1012", "Surface integrals involving vector fields, 1027", "Relative and absolute maxima and minima", "Lagrange multipliers", "Double iterated integrals", "Applications of double integrals, polar coordinates", "Triple integrals and applications; cylindrical and spherical coordinates", "Vector fields, line integrals of vector functions, independence of integration path", "In case if students disagree with their mark, within one week after the date on which the tests had been returned to the students, they should send the instructor a written request in which they should mention specifically the parts of the test they want to be re-evaluated.", "Please note that the provisions of the marking scheme cannot be challenged and no verbal requests to re-evaluate test papers will be considered.", "Correct answers without clear and concise justification will be awarded minimal marks", "Covid‐19 Emergency Self‐Isolation", "They will review your case and coordinate a reasonable and fair plan in consultation with the instructors and appropriate others (e.g., Engineering Undergraduate Office, AccessAbility Services, Engineering Counselling services, Registrar's Office"]}, {"course_id": 24, "course_code": "GEOE 221", "course_name": "GEOE221 - Advanced Calculus (0.50)", "term_name": "2A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Advanced Calculus Fall 2024", "10:00AM - 11:20AM STC 0020", "Email: spotapenko@uwaterloo.ca", "Differentiation; partial derivatives of implicit and explicit functions, applications including optimizations.", "Integration; multiple integrals in various co-ordinate systems with applications.", "Vector calculus; vector fields, line integrals, surface integrals, and applications.", "Numerical integration and differentiation.", "Differential Calculus of Multivariable Functions", "Multiple Integrals", "Introduction to Vector Calculus", "develop skills in differential and integral calculus of multivariable functions at the level sufficient to study upper level engineering courses", "analyze the behaviour of multivariable functions", "evaluate typical multiple and line integrals", "apply major theorems of vector calculus to physical problems", "Chapter 12: Differential calculus of multivariable functions", "Multivariable functions, 799 (D. Trim, Calculus for Engineers, 4th edition)", "Limits and continuity, 803", "Relative maxima and minima, 851", "Absolute maxima and minima, 860", "Fluid pressure, 911", "Centers of mass and moments of inertia, 916", "Surface area, 925", "Double iterated integrals in polar coordinates, 930", "Centers of mass and moments of inertia, 950", "Triple iterated integrals in cylindrical coordinates", "Triple iterated integrals in spherical coordinates, 959", "General transformations in multiple integrals, 965", "Vector fields, 983", "Line integrals involving vector functions, 998", "Energy and conservative force fields, 1012", "Surface integrals involving vector fields, 1027", "Relative and absolute maxima and minima", "Lagrange multipliers", "Double iterated integrals", "Applications of double integrals, polar coordinates", "Triple integrals and applications; cylindrical and spherical coordinates", "Vector fields, line integrals of vector functions, independence of integration path", "In case if students disagree with their mark, within one week after the date on which the tests had been returned to the students, they should send the instructor a written request in which they should mention specifically the parts of the test they want to be re-evaluated.", "Please note that the provisions of the marking scheme cannot be challenged and no verbal requests to re-evaluate test papers will be considered.", "Correct answers without clear and concise justification will be awarded minimal marks", "Covid‐19 Emergency Self‐Isolation", "They will review your case and coordinate a reasonable and fair plan in consultation with the instructors and appropriate others (e.g., Engineering Undergraduate Office, AccessAbility Services, Engineering Counselling services, Registrar's Office"]}, {"course_id": 25, "course_code": "CIVE 205", "course_name": "CIVE205 - Solid Mechanics 2 (0.50)", "term_name": "2B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Solid Mechanics 2 Spring 2024", "Email: spotapenko@uwaterloo.ca", "Energy methods.", "Moment Area Theorems", "Analysis of Stress", "Analysis of Strain", "Strain Energy", "Energy Methods", "The Principle of Virtual Work", "understand basic concepts of mechanics of solids", "understand the behaviour of indeterminate structures", "understand introductory principles of continuum mechanics", "solve basic stability problems", "understand introductory energy methods for structural analysis", "Deflection and Rotation of Beams by Moment Area Method", "Deflection and Rotation of Beams by Castigliano Theorem.", "Deflection and Rotation of Statically Determinate Structures by Virtual Work Method.", "Other Applications of the Principle of Virtual Work and Deflections of Statically Indeterminate Structures.", "If you would like to get a second opinion on the topics presented in the lectures, below is a comprehensive reading list of suggested literature.", "At the end of each chapter of the lecture notes, references to particular sections of interest in the textbooks are provided.", "The date of the “make-up” exam will be firm and cannot be negotiated.", "Correct answers without clear and concise justification will be awarded minimal marks.", "Covid‐19 Emergency Self‐Isolation", "They will review your case and coordinate a reasonable and fair plan in consultation with the instructors and appropriate others (e.g., Engineering Undergraduate Office, AccessAbility Services, Engineering Counselling services, Registrar's Office"]}, {"course_id": 26, "course_code": "CIVE 222", "course_name": "CIVE222 - Differential Equations (0.50)", "term_name": "2B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Differential Equations Spring 2024", "10:00AM - 11:20AM STC 0010", "An introduction to linear and partial differential equations.", "Standard methods of solution, applications to physical and engineering problems, linear equations with constant coefficients, basic systems of differential equations, partial differential equations.", "2. Problem Analysis: Formulate problem statement; Rehearse Problem Solving skills; Solve moderately complex problems", "Introduction, p.1", "1.2         General Concepts and Definitions, p.6", "First-Order and Simple Higher-Order Differential Equations, p.16", "2.3         Exact Differential Equations and Integrating Factors, p.31", "2.3.1      Exact Differential Equations, p.32", "2.4         Linear First-Order Equation, p.55", "2.4.1      Linear First-Order Equations, p.55", "2.6         Simple Higher-Order Differential Equations, p.68", "Applications of First-Order Differential Equations, p.87", "3.2         Motion of a Particle in a Resisting Medium, p.91", "3.3.2      Cable under Self-Weight, p.102", "Linear Differential Equations, p.140", "4.1         General Linear Ordinary Differential Equations, p.140", "4.2         Complementary Solutions, p.143", "Applications of Linear Differential Equations, p.188", "5.1         Vibration of a Single Degree-of-Freedom System, p.188", "5.1.2       Response of a Single Degree-of-Freedom System, p.193", "Systems of Linear Differential Equations, p.300", "Applications of Systems of Linear Differential Equations, p.357", "Partial Differential Equations, p.457", "11.1       Simple Partial Differential Equations, p.457", "Wei-Chau Xie, 2010, Differential Equations for Engineers, Cambridge University Press, ISBN 978-0-521-19424-2, TA347.D45X54 2010"]}, {"course_id": 27, "course_code": "CIVE 230", "course_name": "CIVE230 - Engineering and Sustainable Development (0.50)", "term_name": "2B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering and Sustainable Development Spring 2024", "10:00AM - 11:20AM RCH 301", "nadine.ibrahim@uwaterloo.ca", "nadine.ibrahim@uwaterloo.ca", "This course introduces the concept of sustainability and how it applies to decision-making in civil engineering.", "The course begins by defining sustainability, both practically and technically, and describing the concepts of systems, and systems interactions.", "Economic concepts and their applicability to sustainability are described for both developed and developing countries.", "Sustainability concepts covering the triple bottom line are presented, and their applicability to sustainability are described.", "First, the qualitative concepts and background information is presented.", "I’ll be teaching sustainable development and its connection to engineering using both a qualitative and quantitative understanding of sustainability.", "Qualitatively, this involves describing sustainability objectives, trends, current conditions and future projections, and to have a technical and public understanding of sustainability challenges.", "Quantitatively, this involves modeling environmental parameters using linear programming, differential equations, regression and extrapolation, and understanding the metrics used for sustainability assessments.", "I believe students have different strengths, where the diversity of coursework will leverage individual strengths and give everybody a chance to shine!", "I encourage you to read the announcements on a regular basis and stay up to date.", "IDENTIFY: Identify implications of human activities on the three dimensions of sustainability", "QUANTIFY: Quantify sustainability indicators to assess trade-offs", "DEMONSTRATE: Demonstrate course concepts to assess sustainability in global cities", "Relate course concepts to everyday activities and living experiences", "TBD", "Introduction to Engineering and the Environment.", "Introduction to Environmental Engineering and Science 3rd Edition, Prentice Hall.", "Some situations can warrant exceptions - speak to your instructor about these, and I’ll do my best to accommodate extenuating circumstances.", "Lecture topics will be presented in multiple formats to provide flexibility for different users and learning preferences.", "A knowledge survey on your thoughts and experiences with sustainability concepts and practices", "This will be open in the first and last weeks of term.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 28, "course_code": "CIVE 280", "course_name": "CIVE280 - Fluid Mechanics (0.50)", "term_name": "2B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Fluid Mechanics Spring 2024", "02:30PM - 04:20PM E3 2103", "02:30PM - 04:20PM E3 2103", "02:30PM - 04:20PM E3 2103", "john.quilty", "lmarquez", "An introduction to fluid mechanics.", "Fluid properties.", "The momentum equation and applications.", "Pump systems.", "This course introduces and reviews the subject of fluid mechanics including topics such as pressure and forces in static fluids, buoyancy, laminar and turbulent flow regimes, continuity, energy and momentum conservation, steady pipe flow and energy losses, and simple pump systems.", "Characterize fluids and fluid systems based on their properties and system variables", "Analyze static fluid systems to calculate pressures, forces and moments acting on submerged surfaces and objects, and floating objects", "Use and judge mathematical models of simple dynamic fluid systems using the principles of mass, energy, and force/momentum conservation", "Analyze simple pipe and pump systems for viscous liquids", "Communicate laboratory findings effectively", "Introduction – Dimensions and Systems of Units; Fluid properties: measures of mass, weight, compressibility, viscosity, surface tension and vapour pressure 1.1-1.9", "Fluid Statics – Pressure: pressure at a point; spatial variation; Absolute and gauge pressure, manometers; Pressure forces: forces & moments on planar and curved surfaces; Buoyancy and stability 2.1-2.11", "Mass and Energy Conservation –  Control volumes and surfaces, stream tubes, uniform & non-uniform flow; Mass conservation: continuity equation; Energy conservation: Bernoulli & energy equations, real fluids, energy losses and gains 5.1, 5.3.3", "Viscous Flow in Pipes – Reynolds number; Steady uniform flow and flow resistance: force and energy balance; Laminar and turbulent flow in pipes: flow equations, frictional losses, Moody diagram, single pipe flow solution methods; Minor losses in pipes: changes in pipe diameter or geometry, flow control devices;", "Pipes in series and parallel", "Pipe Networks – Hardy-Cross method", "Momentum Conservation – Linear momentum equation, applications 5.2.1-2", "These are individual closed-book quizzes where the only allowable aids are a basic scientific calculator and formula sheet (as provided by the teaching team).", "The midterm exam is an individual closed-book exam where the only allowable aids are a basic scientific calculator and formula sheet (as provided by the teaching team).", "The final exam is an individual closed-book exam where the only allowable aids are a basic scientific calculator and formula sheet (as provided by the teaching team).", "Lab 1 – Drag & Viscosity", "E3-2103", "TBA", "TBA", "Lab 2 – Energy Losses through Pipes & Bends", "E3-2103", "TBA", "E3-2103", "*Monday", "In particular the page on Academic Integrity for students provides various examples as well as a tutorial on the subject.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Intellectual property includes items such as:"]}, {"course_id": 29, "course_code": "AE 392", "course_name": "AE392 - Economics and Life Cycle Cost Analysis (0.50)", "term_name": "2B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Economics and Life Cycle Cost Analysis Winter 2025", "AE 392", "09:30AM - 10:50AM ARC 1101", "Email:    bruce.hellinga@uwaterloo.ca", "Sorour Yekeh", "Project financing, life-cycle cost analysis, time value of money, sensitivity analyses, tax, financial implications of infrastructure projects, quantitative decision-making, financial aspects of a business plan.", "View requirements for AE 392", "Appraise and compare the financial implications of potential infrastructure projects", "Judge the attractiveness of public sector infrastructure projects and monetize non-monetary costs and benefits if necessary", "Construct a cash flow diagram to summarize the timing and magnitude of cash flows over time Determine and compare the present worth, future worth, annual worth, internal rate of return, payback period, and benefit-cost ratio of alternative projects", "Implement sensitivity analysis to consider uncertainty in decision making", "Introduction & Engineering Decision Making", "2. Time Value of Money & Depreciation", "3. Cash Flow Analysis", "6. Financial Accounting and Business Plans", "Inflation", "Public Sector Decision Making", "This course includes the independent development and practice of specific skills, such as engineering economic evaluation and decision making.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 30, "course_code": "CIVE 392", "course_name": "CIVE392 - Economics and Life Cycle Cost Analysis (0.50)", "term_name": "2B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Economics and Life Cycle Cost Analysis Spring 2024", "08:30AM - 09:50AM DC 1350", "Email:  chris.bachmann@uwaterloo.ca", "Email: cglehmannskelton@uwaterloo.ca", "Marley Dowling", "Email: mkldowling@uwaterloo.ca", "Nastaran Mosavari Nezamabad", "Email: nastaran.mosavari.nezamabad@uwaterloo.ca", "Email: enkichiy@uwaterloo.ca", "Project financing, life-cycle cost analysis, time value of money, sensitivity analyses, tax, financial implications of infrastructure projects, quantitative decision-making, financial aspects of a business plan.", "Appraise and compare the financial profitability of potential infrastructure projects", "3. Judge the attractiveness of public sector infrastructure projects and monetize non-monetary costs and benefits if necessary", "4. Construct a cash flow diagram to summarize the timing and magnitude of cash flows over time", "Identify sources of capital for governments and businesses, and calculate the associated cost of capital for financing their projects", "Exam Period", "Cash Flow Analysis", "Comparison Methods", "Public Sector Decision Making", "Inflation", "Public Sector Decision Making, Taxes, Inflation", "Engineering economics: Financial decision making for engineers (5th ed.)."]}, {"course_id": 31, "course_code": "ENVE 392", "course_name": "ENVE392 - Economics and Life Cycle Cost Analysis (0.50)", "term_name": "2B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Economics and Life Cycle Cost Analysis Spring 2024", "08:30AM - 09:50AM DC 1350", "Email:  chris.bachmann@uwaterloo.ca", "Email: cglehmannskelton@uwaterloo.ca", "Marley Dowling", "Email: mkldowling@uwaterloo.ca", "Nastaran Mosavari Nezamabad", "Email: nastaran.mosavari.nezamabad@uwaterloo.ca", "Email: enkichiy@uwaterloo.ca", "Project financing, life-cycle cost analysis, time value of money, sensitivity analyses, tax, financial implications of infrastructure projects, quantitative decision-making, financial aspects of a business plan.", "Appraise and compare the financial profitability of potential infrastructure projects", "3. Judge the attractiveness of public sector infrastructure projects and monetize non-monetary costs and benefits if necessary", "4. Construct a cash flow diagram to summarize the timing and magnitude of cash flows over time", "Identify sources of capital for governments and businesses, and calculate the associated cost of capital for financing their projects", "Exam Period", "Cash Flow Analysis", "Comparison Methods", "Public Sector Decision Making", "Inflation", "Public Sector Decision Making, Taxes, Inflation", "Engineering economics: Financial decision making for engineers (5th ed.)."]}, {"course_id": 32, "course_code": "GEOE 392", "course_name": "GEOE392 - Economics and Life Cycle Cost Analysis (0.50)", "term_name": "2B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Economics and Life Cycle Cost Analysis Spring 2024", "08:30AM - 09:50AM DC 1350", "Email:  chris.bachmann@uwaterloo.ca", "Email: cglehmannskelton@uwaterloo.ca", "Marley Dowling", "Email: mkldowling@uwaterloo.ca", "Nastaran Mosavari Nezamabad", "Email: nastaran.mosavari.nezamabad@uwaterloo.ca", "Email: enkichiy@uwaterloo.ca", "Project financing, life-cycle cost analysis, time value of money, sensitivity analyses, tax, financial implications of infrastructure projects, quantitative decision-making, financial aspects of a business plan.", "Appraise and compare the financial profitability of potential infrastructure projects", "3. Judge the attractiveness of public sector infrastructure projects and monetize non-monetary costs and benefits if necessary", "4. Construct a cash flow diagram to summarize the timing and magnitude of cash flows over time", "Identify sources of capital for governments and businesses, and calculate the associated cost of capital for financing their projects", "Exam Period", "Cash Flow Analysis", "Comparison Methods", "Public Sector Decision Making", "Inflation", "Public Sector Decision Making, Taxes, Inflation", "Engineering economics: Financial decision making for engineers (5th ed.)."]}, {"course_id": 33, "course_code": "CIVE 303", "course_name": "CIVE303 - Structural Analysis (0.50)", "term_name": "3A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Structural Analysis Winter 2025", "08:30AM - 09:50AM DC 1350", "Analysis of statically indeterminate structures using force and displacement methods.", "Influence lines for indeterminate structures.", "Introduction to the matrix stiffness method.", "Sketch the deflected shape of determinate and indeterminate structures, and calculate deflections due to various loads.", "Identify and quantify structural redundancy and stability.", "Analyze complex indeterminate structures using both flexibility(displacement) and stiffness methods", "Determine where to place a moveable load to produce the maximum effect at a point in a structure (Influence Lines)", "Develop competency in the use of MATLAB to perform structural analysis using the Stiffness Matrix Method", "Develop competency in the use of a commercial structural analysis program.", "Part 1: Analysis of Frames and Indeterminant Structures", "Fundamentals of Structural Analysis.", "It is expected that each member of the group will make a full effort to complete and contribute to all parts of each assignment.", "To be completed in groups of 4.", "The focus of the project is on the application and use of commercial structural analysis software, in this case SAP2000.", "The message should include a list of the names and student number of each group member.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 34, "course_code": "CIVE 332", "course_name": "CIVE332 - Civil Systems and Project Management (0.50)", "term_name": "3A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Civil Systems and Project Management Winter 2025", "10:00AM - 11:20AM MC 2066", "INSTRUCTOR:    Muhammad Bilal, E2-3328 m25bilal@uwaterloo.ca", "E2-3328", "E2-3321", "Introduction to conceptual planning, construction, management, optimization, and life-cycle performance assessment of civil engineering systems including capital projects.", "Fundamentals of decision theory including concepts of risk, uncertainty, utility, probability, value of information, and game theory.", "Tools for supporting decision-making process, including linear and integer programming, network models, optimization, and Monte Carlo simulation.", "Risk- and cost-benefit analysis of public projects and their impact on sustainability, and quality of life.", "Design, model and analyze some civil engineering systems and understand their complexity;", "Choose and effectively apply tools and methods to improve civil engineering systems performance;", "Apply fundamentals of decision analysis, utility and game theory to assess and quantify risk, uncertainty, and expected utility used in decision-support systems;", "Demonstrate the use of project management tools and methods to applications in planning, scheduling, and estimating on engineering projects; and", "Mathematically and numerically formulate, structure and solve optimization problems (single/multiple/linear/integer/non-linear) using multi-criteria decision-making methods, including assessing sensitivity of decisions.", "PART 1 – Systems Theory: Design Methodology", "PART 1 – Systems Theory: Complex Systems + Review", "Linear Programming Intro", "PART 4 – Optimization: Linear Programming", "Multi-objective programming", "Linear programming models of network flow", "Linear programming models of network flow", "Integer and Mixed Integer Programming"]}, {"course_id": 35, "course_code": "CIVE 341", "course_name": "CIVE341 - Transportation Engineering Applications (0.50)", "term_name": "3A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Transportation Engineering Applications Winter 2025", "Email:  chris.bachmann@uwaterloo.ca", "Email: hfhailu@uwaterloo.ca", "Email: ht5lam@uwaterloo.ca", "Email: adrian.lau@uwaterloo.ca", "Evaluation, design and management of urban transport systems through advanced traffic control techniques.", "Quantitative methods for evaluating investments in transportation infrastructure or operational changes.", "Calibrating fundamental diagrams (Greenshields and Greenberg)", "Conservation/continuity equation", "“Stimulus response models” (General Motors)", "Microscopic and macroscopic equivalence and comparison", "Shock Wave Analysis", "Determining shock wave speeds", "Pre-timed signal design (Webster method)", "Semi- and fully-actuated signal design", "Traffic signal coordination", "p. 281 - 322", "User equilibrium", "System optimal", "Section 1.1", "Section 1.3", "Network models", "User equilibrium and system optimal as mathematical programs", "Section 1.2", "Section 3.5", "-", "Cross classification", "Linear regression", "Trip Distribution", "Origin- and destination-constrained gravity models", "Doubly-constrained gravity models", "Growth factor models", "Introduction to utility theory", "Derivation and application of logit models", "Nested logit models", "In The economic theory of the location of railways (pp.", "Urban transportation networks: Equilibrium analysis with mathematical programming methods.", "West Sussex, England: John Wiley & Sons, Ltd.", "Define macroscopic traffic flow elements (flow, density, speed), discuss their fundamental relationships, and implement a simple macroscopic traffic flow model", "3. Define microscopic traffic flow elements (position, speed, acceleration), discuss their interactions, and implement a simple microscopic car-following model", "4. Design and evaluate traffic control techniques for signalized intersections (pre-timed, actuated, coordinated)", "7. Discuss relevant underlying modelling assumptions and limitations, as well as their influence on model results", "Introduction and overview", "Unit I: Traffic Engineering", "Shockwave Analysis A1: Fri. Jan. 31st", "Unit II: Network Modelling", "Unit III: Travel Forecasting", "Shockwaves & Traffic Control", "Trip Generation and Distribution", "Unit I: Traffic Engineering", "Unit II: Network Modelling", "Unit III: Travel Forecasting", "Disclaimer", "Accommodations for late assignments and missed quizzes (due approved absences) will be made on a case-by-case basis due to the unique circumstances of each student and situation.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 36, "course_code": "CIVE 353", "course_name": "CIVE353 - Geotechnical Engineering 1 (0.50)", "term_name": "3A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 11:20AM STC 0010", "An introduction to geologic processes.", "Weight-volume relationships.", "Apply the knowledge of soil mechanics in geotechnical designs of foundations, slopes, and retaining structures.", "Stress and Strain", "3. Seepage in Soil", "4. Effective Stress in Soil", "5.Consolidation of Soil", "Shear Strength of Soil"]}, {"course_id": 38, "course_code": "CIVE 382", "course_name": "CIVE382 - Hydrology and Open Channel Flow (0.50)", "term_name": "3A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["RCH 301", "RCH 301", "Introduction to the water cycle, flood frequency analysis, design storms.", "Analysis of hydrographs and rainfall-runoff response mechanisms in urban and natural systems.", "Dynamic forces on submerged structures and low/scour beneath bridges.", "Water is an essential resource for human civilizations and the natural world.", "To do so, we need to understand and model the processes by which water moves through the environment and in engineered systems.", "Climate and biodiversity crises also mean that we need to consider how water resources can be used for mitigation and adaptation in a world where the future will be unlike the past.", "Explain the physics of key hydrologic processes", "Design synthetic rainfall hyetographs and streamflow hydrographs", "Predict streamflow given rainfall and watershed characteristics", "Calculate critical, alternate, and sequent depths in channels", "Calculate forces on objects submerged in flowing water", "Design simple hydraulic structures such as weirs and gates", "Jan 7, 9 Introduction and Water Balances Chin 9.1", "Jan 21, 23 Abstractions and Infiltration 9.3,14.2", "Feb 24, 25 Channels and rivers supplemental", "T6", "Exam Period", "A problem set will be posted to Learn each week.", "Submissions must be well-organized, neat, and legible.", "Lab reports must be well-organized, neat, and legible.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 39, "course_code": "ENVE 382", "course_name": "ENVE382 - Hydrology and Open Channel Flow (0.50)", "term_name": "3A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["RCH 301", "RCH 301", "Introduction to the water cycle, flood frequency analysis, design storms.", "Analysis of hydrographs and rainfall-runoff response mechanisms in urban and natural systems.", "Dynamic forces on submerged structures and low/scour beneath bridges.", "Water is an essential resource for human civilizations and the natural world.", "To do so, we need to understand and model the processes by which water moves through the environment and in engineered systems.", "Climate and biodiversity crises also mean that we need to consider how water resources can be used for mitigation and adaptation in a world where the future will be unlike the past.", "Explain the physics of key hydrologic processes", "Design synthetic rainfall hyetographs and streamflow hydrographs", "Predict streamflow given rainfall and watershed characteristics", "Calculate critical, alternate, and sequent depths in channels", "Calculate forces on objects submerged in flowing water", "Design simple hydraulic structures such as weirs and gates", "Jan 7, 9 Introduction and Water Balances Chin 9.1", "Jan 21, 23 Abstractions and Infiltration 9.3,14.2", "Feb 24, 25 Channels and rivers supplemental", "T6", "Exam Period", "A problem set will be posted to Learn each week.", "Submissions must be well-organized, neat, and legible.", "Lab reports must be well-organized, neat, and legible.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 40, "course_code": "CIVE 375", "course_name": "CIVE375 - Environmental Engineering Principles (0.50)", "term_name": "3B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Environmental Engineering Principles Fall 2024", "DWE 1501", "02:30PM - 03:20PM", "08:30AM - 11:20AM DWE 1407", "08:30AM - 11:20AM DWE 1407", "08:30AM - 11:20AM DWE 1407", "08:30AM - 11:20AM DWE 1407", "08:30AM - 11:20AM DWE 1407", "Water quality, air pollution, fate and transport of contaminants in natural and engineered systems, and pollution prevention.", "Water and wastewater treatment systems and design principles.", "Explain the importance of water and air quality in natural and engineered systems", "Qualify and quantify transformation and transport phenomena", "Formulate material balances for fluid systems", "Use and judge mathematical models for predicting water quality, including in rivers and lakes", "1-3 Overview of environmental engineering", "8 Modelling transport and transformation", "Piazza – primary way to get & give text-based help (https://piazza.com/uwaterloo.ca/fall2024/cive375)", "Students are very welcome and encouraged to meet with the teaching team in scheduled office hours.", "This course includes the independent development and practice of specific skills, such as problem solving and communication skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 41, "course_code": "CIVE 400", "course_name": "CIVE400 - Civil Engineering Design Project 1 (0.50)", "term_name": "4A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Civil Engineering Design Project 1 Spring 2024", "11:30AM -", "nadine.ibrahim@uwaterloo.ca", "Instructors will also provide critical comments and motivate students to do the best job they can.", "Approve design project topics and technical advisors,", "Technical Advisor Roles and Responsibilities", "Be available for at least 3 hours of consultation with the design team over the term", "A basic requirement of the proposed solution is that it must be compatible with the principles of sustainability.", "These stages might span CIVE 400 and CIVE 401, where CIVE 401 might involve the detailed design stage for the best alternative identified at the end of CIVE 400.", "Sustainability considerations must be central to the proposed project.", "While research (i.e., discovery of new knowledge) may be an important component of engineering design, research-only projects are not appropriate for Engineering Capstone Design Projects.", "Each design team will choose an appropriate civil engineering problem that reflects the interests of the team members.", "Teams must select a challenging design problem.", "Teams must be innovative such that they approach their project in a way that goes beyond standard industry practice.", "Teams must demonstrate that a range of design alternatives were considered.", "Teams must quantitatively evaluate multiple alternatives and multiple design objectives/constraints (e.g., engineering analysis and decision making).", "Project managers are not exempt from participating in the technical aspects of the project, but their time commitment to these aspects will be reduced.", "The project manager responsibilities include:", "keeping their team on track and constructively motivate other team members,", "Identify, conceptualize and communicate a civil engineering problem or opportunity,", "Design a civil engineering system, product and/or process,", "Work effectively and efficiently as a member of a team, and", "Introduction", "Design Process", "Alternative Evaluation", "Progress Meeting Expectations", "However, the team must sign-up by selecting a timeslot, and it will be on a first-come, first-served basis.", "Team Membership and Coordination", "Deliverable 2: Design problem description", "10 - -", "Design problem description 5%", "MTE Capstone Design Pitch Award", "$3000 for the first place team", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 42, "course_code": "CIVE 491", "course_name": "CIVE491 - Engineering Law and Ethics (0.50)", "term_name": "4A Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["G. Smeijers", "email", "The objective of the course is to introduce you to basic principles of law and ethics relevant to the practice of civil engineering.", "Understand the basic structure of Canada’s legal system.", "Understand the basics of Canada’s environmental and health/safety regulatory systems.", "Be able to review a fact pattern and identify concerns related to all of the above.", "We will cover a topic each week of the term as set-out below.", "1              Introduction to Law and Regulation", "As such, any of the following are absolutely inappropriate in the context of this course and will be handled accordingly:"]}, {"course_id": 43, "course_code": "CIVE 401", "course_name": "CIVE401 - Civil Engineering Design Project 2 (0.50)", "term_name": "4B Term", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Civil Engineering Design Project 2 Winter 2025", "11:30AM -", "nadine.ibrahim@uwaterloo.ca", "The final design of the major civil engineering project proposed in CIVE400 will be undertaken.", "Navigate the Design Process to determine a solution to an open-ended design problem", "Design an appropriate solution in detail for an identified problem", "Document and communicate the solution in a professional and comprehensive manner", "Work effectively and efficiently as a member of a team", "Present and defend design decisions to peers and experts", "Date Activity/Deliverable Submission", "February 6 Deliverable 2 - Symposium abstract & team photo due Due: 6pm on D2L LEARN", "March 18 CEE Capstone Design Symposium All day event", "Abstract & Team Photo: project abstract and team picture for the Capstone Design Symposium.", "Presentation at Capstone Symposium: presentation to peers and experts.", "Deliverable 6a", "Expenses", "The Department of Civil & Environmental Engineering will contribute, up to a maximum of $60 per group, for capstone project-related expenses, during 4B, if needed.", "To seek additional funding you will need to provide a rationale and discuss your funding needs with your instructor.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 44, "course_code": "BIOL 130", "course_name": "BIOL130 - Introductory Cell Biology (0.50)", "term_name": "Natural Science List", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["S. Ruffell", "An introduction to the concepts of cell biology with emphasis on (1) the structural organization of the cell and (2) the function of critical molecular processes that are characteristic of living organisms.", "Explain the fundamental elements of cells, the chemistry of life, and the major classes of biological macromolecules.", "Describe metabolism, the role of enzymes in chemical reactions, and how cells can capture, and utilize, energy.", "Explain how cells respond to signals and form cellular communities.", "Module 1 - Introduction to Cell Biology & The Cell Theory", "Module 2 - Molecules of Life", "2 Module 3 - Cells and Membranes  In-class case study", "3 Module 4 - Nucleic Acids & Information Flow", "4 Module 5 - Protein Structure, Function & Synthesis  In-class case study", "6 Module 7 - Cellular Respiration In-class case study", "In-class case study", "9 Module 9 - Cell Signalling", "10 Module 10 - Cell & Tissue Form", "and In-class case study", "11 Module 11 - DNA Replication & Cell Division Case study due", "12 Module 11 - DNA Replication & Cell Division  Term Test 1", "Official Grades and Course Access", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each module for the achieve assignments and term tests.", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines", "Library for research-based assignments"]}, {"course_id": 45, "course_code": "BIOL 150", "course_name": "BIOL150 - Organismal and Evolutionary Ecology (0.50)", "term_name": "Natural Science List", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Organismal and Evolutionary Ecology Fall 2023", "11:30AM - 12:20PM RCH 101", "Learn Discussion Board", "Email and Appointment Requests", "Coverage includes hypothesis testing and the nature of scientific inquiry, basic population genetics, physiological ecology, life histories, dispersal, basic population and community ecology, macroevolution, systematics and classification, as well as functional morphology.", "The theory of evolution unites the whole of biology and all living organisms into a coherent body of knowledge, allowing comparisons across all forms of life.", "Ecology describes how organisms interact with their environment and each other to create interdependent systems from microscopic to global scales.", "These disciplines are fundamentally tied together: evolution is the primary mechanism by which species adapt to their environment; ecological interactions and environmental variability drive natural selection.", "You will also carry out simulated lab assignments to test the principles of evolution, design ecological experiments to test alternate hypotheses about the conservation of species and manipulate demographic parameters to test their influence on population growth.", "Understand the principles of scientific methodology", "Define ecological and evolutionary terms, such as the niche, adaptation, and altruism", "Illustrate these mechanisms in the context of course examples", "Explain how ecological interactions and evolution are interconnected", "Sign code of conduct and upload to LEARN.", "2) Sept 8 Evolution for Ecology Section 1: Evolution and Ecology are Intertwined", "4) Sept 13 Evolution for Ecology", "5) Sept 15 Evolution for Ecology Section 3: Genetics and Evolution", "6) Sept 18 Evolution for Ecology Section 4: Managing the Evolution of Resistance", "9) Sep 25 Physiological Ecology Section 1: Trade-offs and Species Distributions", "15) Oct 9-13 Holiday – No classes Understanding Experimental Design Simulation due by Oct 16, 11:59 pm", "16) Oct 16 Empiricism in Ecology Understanding Experimental Design Simulation due by 11:59 pm (best 2/3 for 10%)", "It is important that you review the information below before you subscribe to the SimUText for Organismal Ecology and Evolution - Chapters at University of Waterloo.", "SimUText Application Installers", "SimUText Application Installers", "At the end of every unit, you will work individually to develop a concept map using Cmap Cloud to visually display the relationships among what you consider the key concepts in the unit.", "These should represent your personal comprehension of how the concepts relate to each other, and no two should be identical.", "Also, class will entail a lot of discussion that won’t be represented in PPT slides.", "The simulations include one on Evolution in Ecology, one on Experimental Design in Ecology and one on Population Growth.", "The learning outcome for the unit tests is to demonstrate your recall and comprehension of the material covered in the units and to incentivize keeping up with the readings and attending lectures and reviewing for the final exam.", "The learning outcome is to demonstrate recall, synthesis and integration of material learned during the course.", "The final exam will consist of multiple-choice, T/F, solve the equation type of questions and integration questions that are designed to test your basic and deeper understanding of the course concepts.", "Important note regarding tests and exams", "Unit tests will be completed for the first 4 units of the course.", "Ensure you have a reliable internet connection and functional computer to complete them – technical challenges encountered during remote completion are not an excuse for missed tests.", "I will have a limited number of printed back-ups for students in class who experience technical difficulties.", "You will need to have a reliable internet connection and functional computer to complete the exams.", "Emails can be received 24 hours per day.", "If you miss a make-up exam for any reason, you will be given a DNW, and must petition the Associate Dean of Science if you feel you missed it for a valid reason.", "At the discretion of the instructor, you may be permitted to write a make-up exam.", "The timing will be conveyed to you via e-mail if you are eligible for a make-up.", "If you follow these steps,", "I will consider granting an extension", "Students are responsible for their own behavior and should be mindful of the impact that their actions have on the wellbeing of others.", "Act in a respectful and open manner when listening to the views and ideas of others.", "Participate fully in the discussion boards: make sure your answers are to the best of your ability and that you respond to others’ posts.", "Signature"]}, {"course_id": 46, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "Natural Science List", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}, {"course_id": 47, "course_code": "BIOL 273", "course_name": "BIOL273 - Principles of Human Physiology 1 (0.50)", "term_name": "Natural Science List", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM M3 1006", "M. Bording-Jorgensen", "Dr. Vivian Dayeh - Tuesdays 11:30 am -12:30pm in B1-277.", "The physiology of major organ systems of the human body.", "Topics include neurophysiology and peripheral nervous system, muscle, the cardiovascular system, the components of blood, respiratory system, and immune system.", "The combination of BIOL273 and BIOL373 covers all of the major topics of human physiology.", "Identify the components/structures of the following organ systems: nervous, muscular, cardiovascular, respiratory, and immune.", "Describe how these five organ systems are organized in the human body.", "Explain the function of each of these five organ systems.", "Demonstrate the integration of these five organ systems in maintaining homeostasis.", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Official Grades and Course Access", "Corresponding Silverthorn textbook chapters in parentheses for each unit.", "This unit serves as an introduction to the study of the function of the five organ systems examined in this course (nervous, muscular, cardiovascular, respiratory, and immune).", "Unit 1 will introduce how the organ systems work together to maintain homeostasis within the body.", "The organization of the nervous system will be explored in this unit.", "The types of cells found in the central and peripheral nervous system serve as a starting point to discuss their function within the nervous system.", "Initially gross structure of skeletal muscle including the structure of a muscle fibre and myofibrils will be examined.", "An exploration into the muscle contraction mechanism via excitation-contraction coupling will be examined to explain how muscles work.", "This unit will start with an introduction into the heart and components of the cardiovascular system, which will be followed by cardiac muscle contraction mechanism.", "In this unit we will examine the structure and function of the respiratory system, incorporating gas laws and ventilation.", "Pulmonary function through lung compliance and elastance as well as the control of ventilation will be examined.", "This unit will start with the general function of immune system and introduction to the types of pathogens that infect the body.", "The anatomy of the immune system will be discussed returning to the role of haematopoiesis.", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each unit for the assignments and term tests.", "Required for the Mastering A&P Online Assignments and Dynamic Study Modules.", "Course website Waterloo Learn https://learn.uwaterloo.ca - includes general course information, language of physiology online assignment, review sheets for each unit, and links to the Mastering A&P Online Assignments.", "Emails can be received 24 hours per day.", "Students should carefully consider the wisdom of missing a test or assignment.", "Mastering A&P assignments handed in late will receive a deduction of 5%/day for the first five late days after which a grade of zero (0) will be recorded.", "Notice of Recording", "Don’t waste your time with these requests!", "Expectations for Change", "This course includes the independent development and practice of specific skills, such as multiple choice question creation.", "Library for research-based assignments", "Disability-related Policies"]}, {"course_id": 48, "course_code": "CHE 161", "course_name": "CHE161 - Engineering Biology (0.50)", "term_name": "Natural Science List", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["09:30AM - 10:20AM RCH 110", "08:30AM - 09:20AM", "Friday -", "Friday", "10:30AM - 12:20PM", "•Chemical Engineering", "•Office hours: 2.30 pm-3.30 pm Mondays, can also be scheduled upon email request", "Introduction to basic concepts of biochemistry and cell biology.", "Properties and functions of biopolymers.", "Elements of cell structure and diversity, and relationship of biochemistry with cell metabolism.", "View requirements for CHE 161", "1) Demonstrate a basic understanding of biochemistry, cell biology and molecular biology (1b)", "2) Converse at a fundamental level with scientist and engineers that use biology and biotechnology (1b)", "5) Identify societal, safety and ethical concerns surrounding biotechnology.", "Biomolecules", "1.1 Sugar and Polysaccharides", "1.2 Fatty acids and derived polymers", "1.3 Amino acid and Proteins", "1.4 Nucleotides and Nucleic acids", "2.1 Life definition and classification", "2.2 Cell structure and reproduction", "2.3 Bioproduction", "3.2 Sugar metabolism", "3.3 Fatty acid metabolism", "3.4 Protein metabolism", "3.5 Enzyme kinetics", "4.1 Central Dogma"]}, {"course_id": 49, "course_code": "CHEM 209", "course_name": "CHEM209 - Introductory Spectroscopy and Structure (0.50)", "term_name": "Natural Science List", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introductory Spectroscopy and Structure Fall 2024", "11:30AM - 12:20PM RCH 309", "Email: afkennywilby@uwaterloo.ca", "The nature of electromagnetic radiation and an elementary outline of quantum mechanics in one dimension.", "For each of microwave, infrared, Raman, electronic, photoelectron, and nuclear magnetic resonance spectroscopy, the nature of the molecular energy levels involved and the type of molecular information that can be obtained using it are examined.", "Understand the electromagnetic spectrum and the energies, frequencies and wavelengths that characterize it; understand and apply the wave-particle duality of light and the concept of photons", "Recognize the various types of quantized energy in atomic and molecular systems and know their origins", "Understand basic molecular orbital theory for simple molecules, and the descriptions of symmetry applied to them", "Understand and apply the concepts of spectroscopy as an interaction between light and matter, including the Bohr resonance condition; Interpret atomic spectra in terms of the underlying structure of atoms in modern quantum theory", "Assign, interpret and predict the spectra arising from molecules interacting with electromagnetic radiation ranging from microwaves for molecular rotations, infrared for molecular vibrations, visible-ultraviolet for electronic transitions, to X-rays for photoelectronic transitions from molecular core orbitals", "Introduction to Spectroscopy (4 weeks): The electromagnetic spectrum, photon theory of light, interaction of light and molecules.", "Review of molecular orbital theory and electronic structure.", "Spectroscopy involving those levels.", "Combination of rotation and vibration in diatomics.", "Ionization of core electrons.", "7. Nuclear magnetic resonance (NMR) spectroscopy (1 week): Basic theory and practical applications of NMR for simple molecules.", "An Introduction to Spectroscopy and Quantum Structure, by W. Scott Hopkins (Cambridge Scholars Publishing, 2023) Recommended reading material No", "Physical Chemistry: A Molecular Approach by Donald A. McQuarrie and John D. Simon", "They are mostly meant to keep you follow the material and understand fundamental concepts.", "Homework assignments are a longer and more involving set of problems and will be given after we finish a given course unit (or midway through for longer units).", "If missed, a weighted final exam grade will be used for a mid-term grade."]}, {"course_id": 50, "course_code": "CHEM 262", "course_name": "CHEM262 - Organic Chemistry for Engineering (0.50)", "term_name": "Natural Science List", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "10:30AM - 12:20PM RCH 207", "10:30AM - 11:20AM RCH 207", "Bonding, structure, and nomenclature in organic chemistry.", "Be familiar with the language of organic chemistry including pushing electrons, conformational analysis and stereochemical nomenclature", "Have a good understanding of reactivity in organic chemistry with emphasis on structure-reactivity relationships", "Understand and predict specific reactivity patterns of some classes of organic compounds", "To appreciate the inherent logic in organic chemistry", "Week 3            Module 4: Acids and Bases", "Week 9            Module 11: Substitution-Elimination: Discerning the Differences", "Week 12          Modules 14 and 15: Alcohols and Oxiranes and Ethers", "Go to tophat.com and join course code 917480", "Course grade:your final grade will be the highest of the following grade calculations:", "Notice of Recording", "The VIF will be used to decide whether a student had a legitimate reason for missing the exam."]}, {"course_id": 51, "course_code": "EARTH 221", "course_name": "EARTH221 - Introductory Geochemistry (0.50)", "term_name": "Natural Science List", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "EARTH 221", "EARTH 221 001", "EARTH 221 101", "RCH 306", "My PhD was completed in 2014 in nitrogen cycling and use of stable isotopes to understand N cycling in the Grand River, Ontario.", "EARTH 221:", "Introduction to environmental isotope geochemistry and radiometric dating.", "Basic aqueous geochemistry: pH, carbonate equilibrium, and common ions in natural waters.", "View requirements for EARTH 221", "Calculate basic geochemical parameters and create associated diagrams", "Identify applications of geochemistry for environmental problems/studies", "Present and discuss geochemical scientific literature", "Please read slides for Intro, element abundances, isotopes, chart of the nuclides, nucleosynthetic processes", "Highlights of Origin of Elements", "Periodic Table/Earth Formation", "Solar System geochemistry and planetary formation, composition of meteorites", "Chemistry of bulk Earth, atmosphere, oceans, crust, mantle, and core   A2 Misra p. 296 – 313, 326-344, 354-362", "Equilibrium constants, introduction to phase diagrams, basics of kinetics", "Basic concepts, laws of thermodynamics, Gibb's free energy.", "Igneous rock geochemistry", "A4 Misra p. 226 –  240, 310-313", "Introduction to Geochemistry.", "This grade includes:", "In groups of 4, you will present the findings of a recent scientific paper that includes some geochemistry.", "It is a closed book test.", "Typical question types may be multiple choice, interpreting diagrams, explaining concepts, and doing calculations (equations provided).", "Equations are provided and you should definitely bring a calculator.", "Notice of Recording", "Extensions and Accommodations", "Extensions and other accommodations will only be considered on a case-by-case basis.", "You are taking full responsibility for AI-generated materials as if you had produced them yourself: ideas must be attributed and facts must be true.", "In reference list:", "URL of the platform where the conversation took place]."]}, {"course_id": 52, "course_code": "EARTH 270", "course_name": "EARTH270 - Disasters and Natural Hazards (0.50)", "term_name": "Natural Science List", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Disasters and Natural Hazards Winter 2025", "The course will introduce the basic principles of Geo-Risk management and its applications in natural hazards engineering, in the development of mitigation strategies and in the re-insurance industry.", "View requirements for EARTH 270", "Explain the geological and/or hydrological systems involved in the most common natural hazard events.", "Describe secondary impacts from the common natural hazards as well as possible mitigation techniques.", "Week 2: Introduction to Disasters and Natural Hazards", "Week 6: Atmospheric Processes and Severe Weather Systems", "This textbook can be a good resource for students continuing in Earth and Environmental Sciences, who are interested in natural hazards and disasters.", "Notice of Recording", "This online course involves viewing, reading, and discussing natural hazard processes and disasters that may directly or indirectly impact humans in a negative way.", "Please note emails can be received 24 hours per day", "Situation where VIFs are not Appropriate", "Learning Support: the Student Success offers a wide range of online and in-person learning supports to help you reach your goals."]}, {"course_id": 54, "course_code": "ENVS 200", "course_name": "ENVS200 - Field Ecology (0.50)", "term_name": "Natural Science List", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Field Ecology Winter 2025", "**We aim to respond to forum posts and necessary emails within general workday hours (8:30 AM – 4:30 PM) and within 24hrs, except over weekends and holidays.", "Introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "View requirements for ENVS 200", "Such knowledge, called ecoliteracy, will provide a critical basis for your engagement in the 21st century, the “century of the environment”—not least because so many of the environmental issues we face derive in part from a limited understanding of how we are embedded within and dependent upon ecological systems.", "Field ecology necessarily harbours an ethical component both because of our natural affinity for life (or ‘biophilia’) and because questions of ecological ‘impact’ and 'quality’ are necessarily value-laden.", "In summary, this course introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "By the end of this course, you should be on a path to life-long learning as an ecologically-literate citizen.", "Demonstrate how these principles apply to real-world situations (in context of lab activities, assignments, and labs), including human interactions with the natural world.", "Articulate the elements of scientific inquiry as they apply to ecology/", "These course learning outcomes will not only prepare you to be an informed citizen and member of the community of life on earth, but also provide the basis for knowledge, humility, and wisdom in your dealings with ecological problems in your daily life and eventual career.", "Week Number", "Introduction and indicator species: Bird identification Lab 1:  Survey completed and submitted in lab (2%)", "3. Jan 21 *Conditions and Resources; Climate and Biomes", "You should review the course “reading guide” in LEARN before reading because you are not responsible for all textbook sections and vocabulary.", "demonstrate how these principles apply to real-world situations, including human interactions with the natural world Readings, Labs, Discussion board Weekly lecture quizzes and activities, exams, lab activities, discussion forums", "These experiences are intended to help you apply ecological concepts in real-world contexts while building valuable field skills.", "Simply missing a deadline and later mentioning registration with Accessibility Services will not be considered sufficient.", "Appeals and grievance", "Availability for exams", "These slides are meant to be a template for your note-taking: they will not replace careful attention, note-taking and participation.", "Along with the University of Waterloo and the Faculty of Environment and its Departments, I consider your well-being to be extremely important.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "However, there may be instances during lectures where AI usage is allowed after receiving clear verbal permission from the professor.", "Students are responsible for following these guidelines and seeking clarification when needed.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 55, "course_code": "GEOG 357", "course_name": "GEOG357 - River Management (0.50)", "term_name": "Natural Science List", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:50AM RCH 205", "Human society was born along the world's greatest rivers and we have depended on rivers for agriculture, drinking water, transportation, and recreation for millennia.", "This course also compares geomorphic, ecologic, and social functioning of rivers in pre- and post-alteration systems.", "What does human alteration of river systems mean for the current and future state of river ecology, morphology, and hydrology?", "Can we find a way for rivers to provide functionality that satisfies the needs of both society and nature?", "Students will be able to critically assess potential impacts of straightening, damming, and polluting rivers on the environment, yet will also understand the complex and dynamic nature of attempts to restore and remove human impacts on rivers.", "12-06-24 Naturalization strategies", "Week 8 24-06-24 Finding a balance", "26-06-24", "24-07-24 Project presentation", "Notice of Recording", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 56, "course_code": "SCI 206", "course_name": "SCI206 - The Physics of How Things Work (0.50)", "term_name": "Natural Science List", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["S. Idziak", "Email: idziak@uwaterloo.ca", "A practical introduction to everyday technology, this course will look at the physics behind common devices used in consumer products and industry.", "Week 9 Alternate Energy", "Week 10 Rockets and Nuclear Energy", "Week 11 Medical Imaging", "Six copies of the first edition are available in reserve at the library (UWD 1520) (call numbers are tentative)", "Lectures are in person and will not be streamed.", "Midterms", "The midterms will be multiple choice and will be given during regularly scheduled class time.", "Recorded lectures from when courses were online are available on Learn in case of missed lectures.", "Emails can be received 24 hours per day."]}, {"course_id": 57, "course_code": "SCI 207", "course_name": "SCI207 - Physics, the Universe, and Everything (0.50)", "term_name": "Natural Science List", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["SCI 207", "10:00AM - 11:20AM DC 1350", "How can it even exist?", "View requirements for SCI 207", "We will explore some of the big-picture questions pertinent to each section, which are some of the most important driving forces behind all of science.", "Some of the main questions in each section are:", "Is there life elsewhere in the Universe?", "(Introduction to relativity and quantum theory)", "Is there a theory of everything?", "Midterm Test: In-class multiple-choice test based mainly on the Life section of the lecture content.", "Endterm Test: In-class multiple-choice test based mainly on the Universe and Everything sections of the lecture content.", "Research & reflection: Through personal research, deepen your understanding of the science behind topics that especially interest you, and reflect on how this impacts your perspective on big questions.", "Sharing & broadening: Through small-group tutorial work, share your newfound knowledge and reflections, and learn about others’ interests and perspectives on these questions.", "Research Reports & Tutorial Schedule", "It should be easy to read, with a clear and logical flow of ideas.", "Aim for good spelling and grammar.", "Critical Thinking", "These groups will be randomly self-selected, and may be different from week to week.", "Basic idea: Have fun with this; generate some lively and stimulating discussions and debates!", "Try to make the most of these sessions for your self-learning!", "* Submit to Research Report drop box on LEARN", "There will be two multiple-choice tests, one after the first section of the course (Life), and the second after the Universe and Everything sections.", "How is the nature and evolution of the Universe intimately connected to life on Earth?", "Everything:", "Might there exist a unique, simple, mathematical, all-encompassing “theory of everything”?", "Take a stance and construct an argument to support your position; you can also describe alternative stances and why you feel these are less plausible.", "I’m looking forward to a fun and rewarding course!", "Because of the significant increase in numbers of VIFs and self-declared absences, which presents an undue administrative load on the course instructional team, these rules will be in effect in SCI 207:", "your name and student number;", "Don’t become one of them!", "Don’t become one of them!", "Every student in SCI 207 is expected to treat their peers and their instructor with kindness, fairness, tolerance, and respect.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 58, "course_code": "SCI 238", "course_name": "SCI238 - Introductory Astronomy (0.50)", "term_name": "Natural Science List", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["SCI 238", "SCI 238 001", "Discussions:", "Lecture slides can be found here.", "SCI 238:", "View requirements for SCI 238", "All are welcome!", "5 Tuesday, Jan 21st Light and Matter Chapter 5     Spectral tubes and spectrometers", "Science of \"Interstellar\"", "Order Mastering Astronomy", "No exceptions to these requirements will generally be made in cases where students miss classes or do not complete assignments.", "Library for research-based assignments"]}, {"course_id": 59, "course_code": "SCI 250", "course_name": "SCI250 - Environmental Geology (0.50)", "term_name": "Natural Science List", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Environmental Geology Winter 2024", "Include Earth 221 in the subject line and your full name and student ID# in the text.", "An introduction to geological concepts; the influence of geological factors on the natural environment; Earth processes and natural hazards; Earth resources, including water, energy and mineral resources; waste disposal and pollution; global climatic and environmental change.", "Environmental Geology refers to how geologic processes interact with and influence human activities and vice versa.", "The goal is to introduce you to basic geologic concepts in order to better understand your natural physical surroundings, such as earthquakes, volcanoes, surface water and glacial processes.", "You will also learn about resource availability such as groundwater and fossil fuels and how we impact the environment via waste disposal and other forms of pollution.", "As the population of the Earth grows, there is increased demand for limited supplies of natural resources, a growing release of pollutants, and increased development in geologically unstable parts of the world.", "These issues result in a variety of hazards and potential problems that societies need to understand and deal with in ways that are beneficial for the Earth and local populations.", "Explain the geologic/earth science connections to certain environmental issues", "Use geologic terminology and concepts when describing environmental issues", "Critique the use of scientific information in the public domain (e.g., media) regarding geologically-related environmental issues", "6 13-Feb Ice & Glaciers; Wind & Deserts Ch 9    15-Feb Climate Ch 10   Q5 (Ch 9,10)", "Older print versions could also be used but there may be some slight differences with the newest version, particularly for case studies or specific events.", "Exams will be a mix of multiple choice, fill in the blank, and written questions.", "Start checking for posted exam dates in the middle of February", "Extensions and other accommodations", "Extensions and other accommodations will only be considered on a case-by-case basis."]}, {"course_id": 60, "course_code": "KIN 100", "course_name": "KIN100 - Regional Human Anatomy (0.50)", "term_name": "Natural Science List", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["KIN 100", "KIN 100 001", "08:30AM - 09:20AM", "Email Address: tamara.maciel@uwaterloo.ca*", "I have set aside the following times each week throughout the term.", "I want to create a safe space for all students.", "· Anatomy and physiology in general", "· Other concerns", "KIN 100:", "Regional anatomy of the limbs and trunk, including a brief introduction to the anatomy of the central nervous and cardiovascular systems.", "View requirements for KIN 100", "Identify bony landmarks of the limbs and vertebral column.", "Identify attachment sites and nerve supply for muscles of the limbs and trunk.", "Draw and label the brachial plexus.", "Wednesday, January 8th Skeletal and Muscular Systems", "Friday, January 17th Axio-Appendicular Muscles", "Axio-Appendicular and Scapulohumeral Muscles", "Axilla and Brachial Plexus", "Friday, February 7th Muscles of the Anterior Forearm", "Monday, February 10th Muscles of the Posterior Forearm", "Anterior and Posterior Forearm", "Wednesday, March 5th Femoral Triangle and Vessels of the Lower Limb", "Wednesday, March 19th Bones and Joints of the Ankle and Foot", "Muscles of the Leg and Foot", "Introduction to Neuroanatomy", "Introduction to Neuroanatomy", "This price includes access to digital textbooks for both KIN100 and KIN100L Yes $55.00 + HST", "Click \"Search by the school\" and input the name of our school", "Important!", "You cannot create a Top Hat account using the mobile application, please first sign-up (using your school issued email address) and enroll into your course using a web browser.", "Top Hat Access Key: A unique code issued by Top Hat to redeem on your account for a specific product such as an eTextbook (purchased through an external vendor only).", "My Response wasn't recorded:", "My grades are not showing in the Top Hat Gradebook", "Attendance was already taken - confirm the start time of your class", "I have been marked as absent:", "To identify concepts that might need additional review by the instructor", "To assess knowledge gained in “flipped classroom” activities", "Multiple choice", "Fill-in-the-blank", "Diagram labelling", "Exams are in-person and closed book.", "Absenteeism will be excused in the case of illness."]}, {"course_id": 61, "course_code": "KIN 100L", "course_name": "KIN100L - Regional Human Anatomy Laboratory (0.25)", "term_name": "Natural Science List", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:30AM - 12:20PM EXP 3683", "jeremy.roth@uwaterloo.ca", "01:30PM - 03:20PM", "jeremy.roth@uwaterloo.ca", "09:30AM - 11:20AM EXP 3683", "jeremy.roth@uwaterloo.ca", "jeremy.roth@uwaterloo.ca", "09:30AM - 11:20AM EXP 3683", "jeremy.roth@uwaterloo.ca", "jeremy.roth@uwaterloo.ca", "09:30AM - 11:20AM EXP 3683", "jeremy.roth@uwaterloo.ca", "jeremy.roth@uwaterloo.ca", "09:30AM - 11:20AM EXP 3683", "jeremy.roth@uwaterloo.ca", "jeremy.roth@uwaterloo.ca", "Instructor: Jeremy Roth & Siyavash Izadi", "Email: jeremy.roth@uwaterloo.ca", "Regional gross anatomy of the limbs and trunk, including a brief introduction to the central nervous and cardiovascular systems.", "View requirements for KIN 100L", "Identify the function of a muscle based on its attachments and fibre direction.", "Describe the basic structure of the heart and the great vessels", "Identify anatomical structures seen in cadaveric specimens and images.", "Lab 2: Axio-Appendicular and Scapulohumeral Muscles", "12 Mar 31st to Apr 4th Lab 11: Introduction to Neuroanatomy", "This price includes access to digital textbooks for both KIN100 and KIN100L Yes $55 + HST", "Click \"Search by the school\" and input the name of our school", "Important!", "You cannot create a Top Hat account using the mobile application, please first sign-up (using your school issued email address) and enroll into your course using a web browser.", "Join Code / JC : 628462 - The unique 6 digit code specific to your course.", "Top Hat Access Key: A unique code issued by Top Hat to redeem on your account for a specific product such as an eTextbook (purchased through an external vendor only).", "My Response wasn't recorded:", "My grades are not showing in the Top Hat Gradebook", "Attendance was already taken - confirm the start time of your class", "I have been marked as absent:", "You will need to bring a clean white lab coat to each KIN 100L lab.", "The questions are mostly in the form of Image Matching and Fill-in-the-Blank.", "To avoid unnecessary hassle, please ensure that you are at a secure and reliable internet connection when you complete your assessment.", "A) Subclavian", "D) Deep Brachial", "This is not a multiple choice exam.", "Some valid reasons for missing lab include:", "Varsity sports", "Death in the family (see below)", "Some non-valid reasons form missing a lab:", "Absenteeism will be excused in the case of illness.", "Illness and Documentation", "Self-declaration of influenza-like illness", "Self-declaration of short-term absence", "Academic Regulations and Accommodations", "Death of a family member: a copy of the death certificate, a copy of the obituary or a link to the online obituary.", "Co-op Interviews", "You can submit an Interview Conflict form by following these steps:", "Select the sub-category based on your current situation.", "Interview location accommodation required - interview at UW interview site other than my home campus (for Architectural Engineering and Architecture students)", "You may experience stressors that can impact your personal well-being and academic experience, but there are multiple supports and resources available to you on and off-campus."]}, {"course_id": 62, "course_code": "AE 572", "course_name": "AE572 - Building Energy Analysis (0.50)", "term_name": "List 1", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Building Energy Analysis Fall 2024", "Introduction to whole-building energy analysis.", "Energy auditing, benchmarking, and simulation.", "Review of relevant concepts in heat transfer and thermodynamics, including introductory psychrometrics.", "Economic and environmental impacts of building energy use.", "The course is intended to help students develop knowledge and skills that will be useful in analyzing and diagnosing the energy use of buildings, with the general objectives of reducing environmental, economic, and social impacts of energy use.", "Topics will be presented from a multi-disciplinary perspective, as the design, construction, and operation & maintenance of buildings are all multi-disciplinary endeavors.", "Relevant concepts in thermodynamics and heat transfer will be reviewed.", "Selected building systems and components will be studied, including aspects of building envelope, lighting, and HVAC systems.", "Apply basic energy calculations to a variety of components and systems impacting building energy use.", "2. Apply simple analysis techniques in building energy auditing and simulation.", "Apply basic calculations to assess impacts of building energy use (e.g. economic cost, GHG emissions).", "Criteria for accreditation include expectations that graduating students will be generally capable of demonstrating certain attributes.", "Indicator", "Knowledge Base (1c) Demonstrate understanding of specialized engineering knowledge.", "D", "D", "D", "D", "D", "D", "D", "Impact of Engineering (9b) Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "D", "Introduction & Fundamentals", "Energy Analysis Fundamentals", "Energy Auditing, Benchmarking, & Re-tuning", "Simple Heating System: Design & Analysis", "Load Duration Curve", "2. Building Components & Systems", "Interior Lighting Systems", "Aspects of 1-D Heat Transfer", "Building Envelope", "Aspects of Simple HVAC Components & Systems", "3. Aspects of Building Energy Simulation", "Aspects of Whole-Building Energy Simulation", "Application of Simulation Results in Design", "Careful review of the course notes and completion of the practice problems should be viewed as key activities to help you develop understanding of the course material and prepare for tests/exams.", "Some projects may be completed in small groups.", "P1 Small Building Re-Tuning", "P2 Lighting System Analysis", "P3 Building Envelope Analysis", "P4 Whole-Building Energy Simulation", "eQUEST", "Please consider that the personal traits and habits that you develop during your education are carried forward into your career.", "Those who find ways to justify “taking short-cuts” as they pursue their education may be unintentionally training themselves do the same in their careers.", "Unfortunately, engineers who have “taken short-cuts” have been responsible for many disasters and failures."]}, {"course_id": 63, "course_code": "AE 573", "course_name": "AE573 - HVAC Systems, Equipment, and Energy Efficiency (0.50)", "term_name": "List 1", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "HVAC Systems, Equipment, and Energy Efficiency Winter 2025", "Selected topics in HVAC systems design with focus on energy-efficiency and environmental-sustainability.", "Heating and cooling distribution using air-, water-, and refrigerant-based systems.", "Constant- and variable-flow systems.", "Heat- and energy-recovery systems.", "Vapour-compression refrigeration and heat-pump systems (including air- and geothermal-source heat pumps).", "Selected topics in HVAC systems design, with focus on energy-efficiency and environmental-sustainability: heating and cooling distribution using air-, water-, and refrigerant-based systems; constant- and variable-flow systems; heat- and energy-recovery systems; vapor-compression heat-pump systems, including air-and geothermal-source heat pumps.", "Course Overview: Achieving significant reductions in building energy consumption will be important in efforts to deal with the environmental and socioeconomic impacts of energy use.", "The energy used by heating, ventilating, and air-conditioning (HVAC) systems represents a large portion of the energy consumption of most commercial, institutional, and residential buildings.", "This course will introduce selected topics in HVAC systems design, with focus on energy-efficiency and environmental-sustainability: heating and cooling distribution using air-, water-, and refrigerant-based systems; constant- and variable-flow systems; heat- and energy-recovery systems; vapor-compression heat-pump systems, including air- and geothermal-source heat pumps.", "Recommended Preparation: It is strongly recommended that students have engaged in prior study of introductory concepts in thermodynamics, heat transfer, and fluid mechanics, including analysis of refrigeration cycles and basic psychrometrics.", "Students without this background are expected to undertake additional study to acquire sufficient competency in each topic.", "Perform simple thermodynamic calculations for selected HVAC components and systems.", "2. Explain operational characteristics of selected energy-saving strategies for HVAC systems.", "3. Assess the potential for selected energy-saving strategies to operate effectively for a variety of operating conditions and applications.", "Criteria for accreditation include expectations that graduating students will be generally capable of demonstrating certain attributes.", "Indicator", "Knowledge Base (1c) Demonstrate understanding of engineering fundamentals.", "D", "(1d) Demonstrate understanding of specialized engineering knowledge.", "D", "D", "D", "D", "D", "Impact of Engineering (9b) Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "D", "Section", "Introduction", "Review of selected fundamental concepts.", "Considerations for equipment selection.", "3. Variable-Flow Hydronic Systems", "Closed-loop hydronic systems.", "Constant- and variable-flow systems.", "4. Aspects of Ventilation Systems", "Air-to-air energy recovery systems.", "4. Aspects of Ventilation Systems (cont'd)", "System considerations with AAER equipment.", "Heat-Pump Systems and Equipment", "Simple and modified refrigerant cycles.", "Air- and water-source systems.", "Simultaneous heating/cooling systems.", "Useful References:  i) the ASHRAE Handbooks can be accessed through the university library via the Knovel database; ii) the CIBSE applications manual “AM17 Heat Pump Installations for Large Non-Domestic Buildings (2022)” (free pdf) is an excellent reference for many concepts covered by this course; iii) for a textbook covering general aspects of HVAC design & analysis, consider: “Heating and Cooling of Buildings: Principles and Practice of Energy Efficient Design (Third Edition)”, by T.A. Reddy et al.. CRC Press, 2016.", "Notice of Recording", "Please consider that the personal traits and habits that you develop during your education are carried forward into your career.", "Those who find ways to justify “taking short-cuts” as they pursue their education may be unintentionally training themselves do the same in their careers.", "Unfortunately, engineers who have “taken short-cuts” have been responsible for many disasters and failures."]}, {"course_id": 64, "course_code": "CIVE 343", "course_name": "CIVE343 - Traffic Simulation Modelling and Applications (0.50)", "term_name": "List 1", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Traffic Simulation Modelling and Applications Fall 2024", "RCH 306", "Email: reza.aminghafouri@uwaterloo.ca", "Calibration and validation of simulation models, and interpretation and analysis of simulation output.", "Applications of state-of-the-art computer simulation software packages for solving real traffic engineering problems, involving scenario analysis, prediction, and optimization.", "This is an introductory course to traffic engineering, traffic simulation and the processes and tools used to model transportation systems.", "It covers a variety of topics related to simulation modelling of a traffic system and its applications, such as the collection and use of field data, application of statistics to data analysis, alternative traffic modelling techniques such as traffic stream theory, queueing theory, gap acceptance, and car-following and lane-changing models.", "Learn various field data collection technologies and data analysis techniques to support traffic engineering studies.", "1.1", "Introduction", "Traffic engineering", "Model and simulation", "Assignment #1: Data Collection and Analysis", "2.1", "2.2", "Dynamic and stochastic nature of traffic", "Data Analysis", "3.2", "Miovision Smart City and Advanced Traffic Monitoring Solutions", "4.1", "4.2", "4. Traffic Analysis – Macroscopic Models", "Types of traffic models", "Traffic stream models", "Queueing models", "Shockwave theory", "Assignment #2: Simulation Modelling and Analysis", "Simulation modelling", "Simulation runs", "Analysis of simulation results", "- Gap acceptance behaviour and model", "- Lane changing models", "7.1", "7.2", "Modelling lane changing behaviour", "Car following models", "8.1", "Modelling Routing Behaviour", "Trip Generation and Routing", "Connected Vehicles and Applications", "9.2", "9.4", "Signalised Intersections", "Signal controllers, types of signalised intersections", "Theoretical method – signal timing", "Simulation of signalised intersections", "Assignment #5: Network Traffic Analysis", "Modelling of vehicle emissions", "Adaptive signal control", "AI models for traffic control"]}, {"course_id": 65, "course_code": "CIVE 354", "course_name": "CIVE354 - Geotechnical Engineering 2 (0.50)", "term_name": "List 1", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["RCH 211", "Method of Instruction", "Calculate the basic parameters describing soil state", "Calculate stresses in soil", "Calculate shear strength of soil", "Calculate foundation settlements in soil", "Design shallow foundations", "Analyze safety of slopes", "Design retaining walls", "Foundation Engineering Overview: Introduction, Scope, Geotechnical Engineering Pratice, and Design Philosophies", "Review of Soil Mechanics: Soil as a Granular Material; Stress Calculations; Mohr-Coulomb Failure Criterion; Shear Strengths of Sand and Clay, Critical State", "Slope Stability Analysis: Infinite and Finite Slopes; Limit Equilibrium Methods – Ordinary Method of Slices, Bishop’s Simplified Method, Swedish Circle Method", "Soil Exploration: Soil Boring; CPT; SPT; Vane Shear Test; Undisturbed Sampling", "An Introduction to Geotechnical Engineering by R. D. Holtz, W. D. Kovacs and T. C. Sheahan, Pearson Education, Inc., 2nd Edition, 2011.", "You are responsible for solving these problems on your own.", "These problems are important for you to do well in the exams.", "The project will entail the use of a geotechnical software package.", "You are required to attend these outside of regular scheduled classes as well.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 66, "course_code": "CIVE 413", "course_name": "CIVE413 - Structural Steel Design (0.50)", "term_name": "List 1", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Structural Steel Design Spring 2024", "Advanced coverage of design of structural steel members and connections, building on CIVE 310.", "Design of laterally-unsupported beams, compression members and beam-columns.", "Special topics in design of structural steel or other metals.", "The primary objective of the course is to provide students an introduction and a solid background in the principles of limit states design for structural steel.", "Emphasis will be placed on behaviour and design of steel members for buildings.", "Bases of the criteria given in the CSA S16-2019 will be studied.", "Analyse and design structural steel beams, columns and tension members for considering both strength and serviceability requirements", "Analyse and design members subjected to combined bending and axial forces, including second-order effects", "Design simple plate girder elements", "Analyse and design simple connections using welds or bolts", "Introduction, Structural Safety and Loads", "Introduction, load effect vs. resistance, calibration and f factors, load combinations and limit states", "Material Properties of Structural Steel", "Hot-rolled vs. cold formed, ductility, toughness, steel types, and structural steel shapes", "Tension Members", "Beams", "laterally-unsupported; introduction to plastic design and other criteria for beams: shearing, deflection, web crippling, web overall buckling and                    bearing plates", "Plate Girders", "Design for bending: flange selection, design for shear: web selection and stiffener requirements", "Beam-Columns", "cross-section, member in-plane buckling and member out-of-plan buckling.", "Limit States Design in Structural Steel by Kulak and Grondin, 11th Edition, CISC. further reading No", "Students can place the order on the following link https://steelstore.cisc-icca.ca/collections/cisc-publications-for-nbcc-2020-series- codes/products/limit-states-design-in-structural-steel-11th-edition-2021", "https://steelstore.cisc-icca.ca/collections/cisc-publications-for-nbcc-2020-series-codes/products/handbook-of- steel-construction-12th-edition-2nd-printing-2023", "Email address: only school email address accepted", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}]