[{"course_id": 9, "course_code": "CHEM 266L", "course_name": "CHEM266L - Organic Chemistry Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["CHEM 266L", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "CHEM 266L 006", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Answers can be expected within 24 hours.", "Piazza is available for clarification questions but I will only provide quick answers as I prefer having longer conversations in person.", "View requirements for CHEM 266L", "Topics include acid-base chemistry, substitution reactions, Grignard reactions, liquid-liquid extraction, product isolation and purification.", "Be proficient with basic organic laboratory techniques including selecting proper glassware, measuring small and large quantities of solids and liquids, designing the setup required for simple synthetic reactions, filtration, and basic characterization.", "Understand and be able to design and execute a liquid-liquid extraction processes for the separation of ionizable acidic, ionizable basic, and non-ionizable (neutral) substances.", "Demonstrate independent thinking by answering questions in your own words, showing critical reflection beyond the initial description of observations and facts.", "Laboratory performance marks will be given by the Teaching Assistants and Lab Instructor and averaged for each in-person lab period.", "This is not directly the case; we do expect students to need a lot of clarifications when working in the lab for the first time.", "Laboratory Worksheets and Reports", "Questions similar to the pre-laboratory quizzes and reports will be used, but may be modified to be multiple choice.", "Human rights must be centered in our pedagogical practice to ensure students feel safe and respected into our instructional spaces.", "We also acknowledge that speaking of underrepresented groups in Science is a misnomer and we should speak of historically excluded persons as Black, Indigenous, Queer and Persons of Colour have contributed to chemical research since the inception of the field.", "Scheduling issues", "General Policies", "Aside from LEARN, we will use various software to facilitate the delivery of the laboratory.", "Important note: Since the manual is printed months before delivery of the lab, we may need to make corrections during the term.", "Expectation of Academic Integrity", "Be especially careful with sharing diagrams and mechanisms, as we often detect excessive collaboration when students share images.", "None-the-less all violations of academic misconduct will be dealt with be taken seriously and dealt with according to the consequences outlines in Policy 71."]}, {"course_id": 10, "course_code": "CS 114", "course_name": "CS114 - Principles of Computing for Science (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Principles of Computing for Science Winter 2025", "08:30AM - 09:50AM MC 4059", "Monday -", "Monday", "07:00PM - 08:50PM", "10:30AM - 11:20AM MC 4063", "Coordinator", "Student who make use of office hours usually get better grades; use them!", "Introduction to basic imperative programming principles; programming concepts including functions, flow control, lists, arrays; numerical accuracy and efficiency; data analysis and general-purpose algorithms.", "Introduction to object-oriented programming concepts.", "Describe the basic memory model for mutation of basic types, lists, and objects in Python.", "Identify situations where recursion is an appropriate tool, and use it.", "6 Feb 6-11 M4: Strings and Lists", "7 Feb 13-25 M5: Sorting and Dictionaries", "If both exams are held in person", "If in-person exams cannot be held then they will be held online (if possible).", "Students have the option of self-declaring a short-term absence, as described here: https://uwaterloo.ca/registrar/current-students/undergraduate-student-short-term-absences", "Students should check their basic tests email to ensure that the code meets the specification exactly.", "If ill, please complete a complete a Verification of Illness Form and contact the course coordinator to discuss alternate arrangements.", "Generative AI: This course includes the independent development and practice of specific skills, such as writing and reading code, tracing, and algorithm design.", "Library for research-based assignments"]}, {"course_id": 11, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 12, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 13, "course_code": "MATH 227", "course_name": "MATH227 - Calculus 3 for Honours Physics (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Email: pmcgrath@uwaterloo.ca", "Directional derivative and the chain rule for multivariable functions.", "Double and triple integrals on simple domains; transformations and Jacobians; change of variable in multiple integrals.", "Vector fields, divergence and curl.", "Vector integral calculus: Line and surface integrals, Green's Theorem, Stokes' Theorem, Gauss' Theorem, conservative vector fields.", "Work in and convert between Cartesian and polar coordinates in two-dimensions or Cartesian, cylindrical, and spherical coordinates in three-dimensions.", "Plot and describe the behaviour of a vector field.", "Determine using a variety of tests if a vector field is conservative.", "Understand the fundamental differences between conservative and non-conservative vector fields.", "Determine the extreme values of a function of multiple variables.", "This course covers a selection of topics from multivariable vector calculus.", "In particular, we will aim to cover one item per week from the following list:", "Arc length and line integrals.", "Quadric surfaces and coordinate systems.", "Extrema of multivariable functions and Lagrange multipliers.", "A previous course in linear algebra is strongly recommended.", "I will also share short videos each week in which I work through examples and/or discuss particularly important concepts.", "I will also post problem sets with full solutions each week so that you have plenty of practice problems to work through.", "Discussion", "You can join our Piazza forum at", "To be clear - such websites are not allowed to be used for the completion of any assessment in MATH 227."]}, {"course_id": 14, "course_code": "MATH 228", "course_name": "MATH228 - Differential Equations for Physics and Chemistry (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Differential Equations for Physics and Chemistry Winter 2025", "First-order equations, second-order linear equations with constant coefficients, series solutions and special functions, the Laplace transform method.", "Applications in physics and chemistry are emphasized.", "Differential equations capture how some variable of interest, such as the position of a planet, changes as a function of some independent variable, such as time.", "Differential equations are very widely used in the sciences because of the broad range of real-world phenomena they can describe in a mathematical framework.", "In this course, students will be introduced to the universe of differential equations, including first-order equations, second-order linear equations, series solutions, the Laplace transform method, and both exact and numerical methods for solving differential equations.", "Applications in physics and chemistry will be emphasized.", "understand how differential equations can be used to model physical systems,", "know how to classify differential equations,", "know how to solve various classes of differential equations using numerical methods and exact methods, and", "Unit 2 - First-Order Differential Equations (Weeks 2 - 3)", "Unit 3 - Second-Order Linear Equations (Weeks 4 - 5)", "Unit 4 - Mechanical and Electrical Vibrations (Week 6)", "Unit 5 - Series Solutions of Second-Order Linear Equations (Weeks 7 - 8)", "Unit 8 - Systems of Differential Equations (Weeks 11 - 12)", "In particular, it includes lots of helpful practice problems.", "To be clear - such websites are not allowed to be used for the completion of any assessment in MATH 228.", "Email a scanned copy of the Verification of Illness Form to your instructor."]}, {"course_id": 15, "course_code": "PHYS 121", "course_name": "PHYS121 - Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["An introductory course in physics for students intending to concentrate their future studies in the physical sciences, optometry, or mathematics; includes vectors (dot and cross products), particle kinematics and dynamics, forces in nature, work and energy, conservation of energy and linear momentum, rotational kinematics and dynamics, and conservation of angular momentum.", "Doing Physics - quantities, dimensions, units", "Point Dynamics - force, motion, Newton's laws", "Conservation of Energy - work and energy, conservative systems", "Conservation of linear Momentum - momentum and systems of particles", "Understand the following concepts:", "- Linear kinematics: the relationship between distance, velocity and acceleration.", "- Linear dynamics: a consequence of forces and momentum, and how they interrelate.", "- Kinetic energy, potential energy, work, and their interrelationships.", "We will also re-examine these concepts in a rotating coordinate frame using angular kinematic variables along with torque and angular momentum.", "6 Module 06:  Kinetic and Potential Energy", "7 Module 06:  Kinetic and Potential Energy", "8 Module 07:  Linear Momentum", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- eText + Student Access Code", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- Print Format + Student Access Code"]}, {"course_id": 16, "course_code": "PHYS 121L", "course_name": "PHYS121L - Mechanics Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Mechanics Laboratory Fall 2024", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "Julian Meunier", "Soorna Choheili", "Reza Asadi", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "complete introductory surveys", "complete introductory surveys,", "Complete end-of-term surveys", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 17, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 18, "course_code": "PHYS 122L", "course_name": "PHYS122L - Waves, Electricity and Magnetism Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 2 - Circuits", "Experiment 5 - Magnetic Fields of a Coil", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 19, "course_code": "PHYS 225", "course_name": "PHYS225 - Modeling Biological Physics (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Modeling Biological Physics Fall 2024", "Introduction to modelling living systems and their components.", "Statistical methods in data analysis, curve fitting, including p values.", "Fourier series and transforms, structural analysis, including nearest neighbour distributions in biomedical applications.", "Introduction to methods for analysis of transport properties in biological systems.", "Use of computers in these areas.", "This course will equip students with basic tools/concepts for analyzing and interpreting data as well as for statistical inference (e.g., p-values).", "Molecular diffusion and related equations will be introduced; the ‘Nernst potential’ will be discussed as an example.", "Students will learn how ‘Fourier’ methods can be used in experimental biophysics (e.g., spectroscopy).", "Lecture 8: statistics & curve fitting (Oct 7, 9)", "Mathematical Methods in the Physical Sciences 3rd Edt.", "Mathematics for Biological Scientists 3rd Edt.", "Mathematical Methods in the Physical Sciences 3rd Edt.", "Modeling biological elasticity.pdf", "Fourier series and transforms can be found in", "Mathematical Methods in the Physical Sciences 3rd Edt.", "These will be combined into lecture notes in a coherent and self-contained manner."]}, {"course_id": 20, "course_code": "PHYS 242", "course_name": "PHYS242 - Electricity and Magnetism 1 (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["10:30AM - 11:20AM RCH 301", "calculate electric fields and potentials for charged systems such as a collection of point charges and charge-carrying rods/surfaces/spheres.", "calculate the interactions between a charge and a conductor and understand the electric properties of conductors.", "calculate electric potentials by solving Laplace's equations for various geometries.", "calculate magnetic fields of current-carrying wires/planes and other geometries.", "calculate the magnetic vector potentials of current-carrying wires and solenoids.", "•Electromagnetic induction: Chapter 7", "Introduction to Electrodynamics, 4th or 5th Etd.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 21, "course_code": "PHYS 256", "course_name": "PHYS256 - Geometrical and Physical Optics (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Geometrical and Physical Optics Fall 2024", "09:30AM - 10:20AM DC 1350", "Email: kfelefel@uwaterloo.ca", "Email: jspodek@uwaterloo.ca", "Email: tlismer@uwaterloo.ca", "Geometrical optics: image formation, ray tracing through multiple optical components, dispersion by prisms, optical fibers, optical instruments - eyes, telescopes, microscopes, and cameras, introduction to aberrations; physical optics: interference and interferometers, diffraction, imaging resolution, diffraction gratings and their use in spectroscopy; wave-particle duality; introduction to the electromagnetic nature of light and polarization.", "Have a clear understanding of physics behind imaging (such as mirrors and lens)", "Visualize and draw diagrams demonstrating the optical properties of light and interactions with materials and optical components", "Be familiar with common optical instruments", "Distinguish and explain the optic and photonic concepts of reflection, refraction, diffraction, interference etc.", "Understand the wave-particle duality of light and link it to the theories and equations related to electromagnetism", "Solve optics problems", "Introduction to optics, Reflection and refraction, Fermat’s Principle", "No tutorial in the first week", "Dispersion through prism", "Introduction to the physical properties of light", "Scattering and adsorption", "Diffraction", "You may work with other people, but should specify the names of your collaborators in your submissions, and your write-up should be yours alone.", "Exams", "In particular, in case of sickness, a VIF must be filled in."]}, {"course_id": 23, "course_code": "PHYS 358", "course_name": "PHYS358 - Thermal Physics (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Monday, Friday -", "08:30AM - 09:20AM", "08:30AM - 09:20AM", "Name E-mail", "Name E-mail", "Dyuman Bhattacharya", "Kinetic theory of gases.", "Basic probability theory.", "Thermodynamic Functions and Maxwell's relations.", "Kinetic theory of gases.", "Basic probability theory.", "Thermodynamic Functions and Maxwell's relations.", "Describe the role of energy in thermal physics.", "Explain the Second Law of Thermodynamics and how it affects simple systems.", "Describe heat engines and refrigerators as types of thermodynamic systems.", "Calculate the free energy of simple systems and describe the relationship between free energy and other thermodynamic quantities.", "Parts of Blundell and Blundell's Concepts in Thermal Physics will complement Schroeder.", "The relevant sections of Blundell and Blundell will be announced on LEARN before class.", "1.1 Thermal Equilibrium", "Microscopic Model of an Ideal Gas", "1.4 Heat and Work", "1.3 & 1.6", "1.3 Equipartition of Energy", "1.7 & 2.1 – 2.3", "2.1 Two-State Systems", "The Two-State Paramagnet", "2.2 The Einstein Model of a Solid", "2.3 Interacting Systems", "2.4 – 2.6", "2.4 Large Systems", "Multiplicity of a Large Einstein Solid;", "Sharpness of the Multiplicity Function", "2.6 Entropy", "Reversible and Irreversible Processes", "A Silly Analogy; Real-World Examples", "3.2 Entropy and Heat", "4.1 Heat Engines", "4.2 Refrigerators", "Notation and Microscopic Physics; Numerical Solution; Analytic Solution", "3.4 Mechanical Equilibrium and Pressure", "3.5 Diffusive Equilibrium and Chemical Potential", "3.6 Summary and a Look Ahead", "Internal Combustion Engines; The Steam Engine", "5.1 Free Energy as Available Work", "5.2 Free Energy as a Force toward Equilibrium", "Extensive and Intensive Quantities; Gibbs Free Energy and Chemical Potential", "5.3 Phase Transformations of Pure Substances", "5.4 Phase Transformations of Mixtures", "Free Energy of a Mixture; Phase Changes of a Miscible Mixture;", "Phase Changes of a Eutectic System", "I will consider more real-life examples of thermodynamics applications in some sessions.", "Daniel V. Schroeder, An Introduction to Thermal Physics An online version of the textbook can be freely accessed through the University of Waterloo library.", "Stephen J. Blundell and Katherine M. Blundell, Concepts in Thermal Physics An online version of the textbook can be freely accessed through the University of Waterloo library.", "Yunus Cengel and Michael Boles, Thermodynamics An Engineering Approach No", "Here are the sections which are from references No2 (Blundell & Blundell) that will be covered in this course:", "1 Introduction                                                                       2", "2.1 A definition of heat                                                           13", "4 Temperature and the Boltzmann factor                          32", "4.1 Thermal equilibrium                                                         32", "4.2 Thermometers                                                                   33", "4.3 The microstates and macrostates                                      35", "4.4 A statistical definition of temperature                              36", "6.1 Molecular distributions                                                    57", "9.2 Thermal conductivity                                                       81", "9.3 Diffusion                                                                           83", "11 Energy                                                                               108", "11.1 Some definitions                                                            108", "11.2 The first law of thermodynamics                                   110", "13.6 Heat engines running backwards                                    133"]}, {"course_id": 24, "course_code": "PHYS 380", "course_name": "PHYS380 - Molecular and Cellular Biophysics (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Molecular and Cellular Biophysics Fall 2024", "10:00AM - 11:20AM DWE 3518", "Email: qblu@uwaterloo.ca", "Email: olya.changizi@uwaterloo.ca", "Cell structure and molecular composition; intermolecular interactions and hydration; protein structure and function; cytoskeletal filaments; DNA structure, packing and chromosomes; rate equations and biological dynamics (e.g., cytoskeletal polymerization); self-assembly; cell membranes; action potentials and biological electricity; molecular motors; cell motility.", "The course is intended to provide students with basic understanding of the physical principles governing intermolecular interactions, the process of self-assembly, molecular and cellular motion in biological tissue.", "Sections", "Section I", "INTRODUCTION", "What is biophysics; molecular/cellular level", "Mastering", "Mastering", "Organization of the cell", "Mastering", "Mastering", "Biological complexity and modeling; e.g., random walk model of a DNA molecule", "Mastering", "Chance in Biology", "Mastering", "Mastering", "Entropy", "Mastering", "Mastering", "Mastering", "Mastering", "Hydrogen bonds in water", "Mastering", "Section III", "Hydrophobic effect; hydrophobicity analyzed in terms of multiplicity and entropy; hydrophobic force", "Mastering", "PROTEIN STRUCTURE AND FUNCTION", "Mastering", "Mastering", "Mastering", "Probability of specific HC … sequences; partition function", "Mastering", "HP model; probabilities for collapsed, unique native state", "Mastering", "Examples of structural proteins and globular proteins (structure-function for each)", "Mastering", "Mastering", "Section V", "ENERGY, ENTROPY AND FREE ENERGY", "Discussion on minimum free energy- most probable state by considering two 2-level systems in thermal contact", "Mastering", "Mastering", "Gibbs free energy in reaction", "Mastering", "Basic reaction rate equations; Arrhenius relation", "Mastering", "Enzyme catalysis/kinetics", "Mastering", "Mastering", "Section VII", "DNA STRUCTURE, PACKING, CHROMOSOMES", "Components of DNA and RNA", "Mastering", "DNA as a polymer; structural aspects", "Mastering", "Mastering", "Genetic code", "Mastering", "Mastering", "SELF-ASSEMBLY OF COMPONENTS OF A CELL", "Thermodynamics of self-assembly", "Mastering", "Formation of bilayer", "Mastering", "Formation of filaments", "Mastering", "Dynamic instability", "Mastering"]}, {"course_id": 25, "course_code": "PHYS 383", "course_name": "PHYS383 - Medical Physics (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["PHYS 383 - Medical Physics Winter 2025", "DWE 3517", "ernest.osei@uwaterloo.ca", "Name & contact information of primary instructor:", "Names and contact information of other faculty members:", "Monday-Friday 9am-5pm", "Medical Physics Department", "Applications of physics in medicine.", "The course will address basic concepts of medical imaging, nuclear medicine and radiation isotopes, radiation therapy and biomedical laser applications.", "Nuclear structure and binding energy.", "Extended Course Description: This course is an introduction to physics in medicine and is intended to introduce students to various techniques and concepts in medical physics, including ionizing radiation, used in medicine particularly in oncology, for diagnosis and treatments of diseases.", "The course has been designed to follow the basic curriculum of a Medical Physics training program where students will gain insight to the importance of radiological physics in medicine and issues associated.", "The course is aimed at students with a career interest in medical physics and who may pursue graduate studies in medical physics.", "Physical concepts covered include: Nuclear structure and nuclear decays, radioactivity and nuclear reactions.", "Day", "Radiological Physics and Dosimetry I", "Atomic and Nuclear Structure", "Exponential Attenuation", "Quantities and Units Used for Describing Radiation Fields", "Quantities and Units Used for Describing the Interaction of Ionizing Radiation with Matter", "Radiological Physics and Dosimetry II", "Radiological Physics and Dosimetry III", "Charged Particle and Radiation Equilibrium", "Radiation Dosimetry", "Calorimetric Dosimetry", "Ionization Chambers", "Relative Dosimetry Techniques", "Films", "TLD", "Calibration of Photon and Electron Beams with Ionization Chambers", "Dosimetry and Phantoms", "X-Ray Production", "Energizing and Controlling the X-Ray Tube", "X-Ray Tube Heating and Cooling", "X-Ray Image Formation and Contrast", "Scattered Radiation and Contrast", "The Photographic Process and Film Sensitivity", "Film Contrast Characteristics", "Radiographic Density Control", "Radiographic Detail", "Image Noise", "Fluoroscopic Imaging Systems", "Dose and Dose Reduction Issues", "Digital X-Ray Imaging Systems and Image processing", "Computed Tomography image formation", "Computed Tomography Image Quality", "Principles of Ultrasound Imaging", "Portal Imaging", "Radiobiology I", "Radiation Injury to DNA", "Repair of DNA Damage", "Radiation-Induced Chromosome Damage and Repair", "Survival Curve Theory", "Cellular Recovery Processes", "Modifiers of Radiation Response—Sensitizers and Protectors", "Radiation Therapy I", "Radiation oncology", "Overview of Clinical Radiation Oncology", "Radiobiological Basis of Radiation Therapy", "Clinical Photon Beams: Basic Clinical Dosimetry", "Clinical Electron Beams", "Special Photon and Electron Beams", "Photon Beams: Dose Modeling and Treatment Planning", "Clinical Electron Beams: Dose Modeling and Treatment Planning", "Radiobiology I continues", "Radiation Injury to DNA", "Repair of DNA Damage", "Radiation-Induced Chromosome Damage and Repair", "Survival Curve Theory", "Cellular Recovery Processes", "Modifiers of Radiation Response—Sensitizers and Protectors", "Radiation Therapy I continue", "Radiation oncology", "Overview of Clinical Radiation Oncology", "Radiobiological Basis of Radiation Therapy", "Clinical Photon Beams: Basic Clinical Dosimetry", "Clinical Electron Beams", "Special Photon and Electron Beams", "Photon Beams: Dose Modeling and Treatment Planning", "Clinical Electron Beams: Dose Modeling and Treatment Planning", "Professional Ethics/Conflict of Interest/Scientific Misconduct", "Publications and Presentations", "Linear Accelerator (Linac)", "CyberKnife", "Machine Acquisition", "Phantom Systems and Water Tanks", "Cell Kinetics", "Radiation Genetics: Radiation Effects of Fertility and Mutagenesis", "Molecular Mechanisms", "Drug Radiation Interactions", "Linear Accelerator (Linac)", "CyberKnife", "Machine Acquisition", "Phantom Systems and Water Tanks", "Cell Kinetics", "Radiation Genetics: Radiation Effects of Fertility and Mutagenesis", "Molecular Mechanisms", "Drug Radiation Interactions", "Special Techniques in Radiotherapy", "Protons", "Brachytherapy: Basic Physical Characteristics", "Stereotactic Radiosurgery", "Total skin electron irradiation (TSEI)", "Principles of radioisotope imaging", "Production of radioisotopes", "Biological uptake", "Physical and biological half life", "PET imaging", "Structural Shielding of Treatment Installations", "Radiation Protection and Radiation Safety", "Introductions and Historical Perspective", "Interaction Physics as Applied to Radiation Protection", "Operational Dosimetry", "Radiation Detection Instrumentation", "Shielding: Properties and Design", "Statistics", "Radiation Monitoring of Personnel", "Environmental Dispersion", "Biological Effects", "Special Techniques in Radiotherapy", "Protons", "Brachytherapy: Basic Physical Characteristics", "Stereotactic Radiosurgery", "Total skin electron irradiation (TSEI)", "Principles of radioisotope imaging", "Production of radioisotopes", "Biological uptake", "Physical and biological half life", "PET imaging", "Structural Shielding of Treatment Installations", "Radiation Protection and Radiation Safety continues", "Introductions and Historical Perspective", "Interaction Physics as Applied to Radiation Protection", "Operational Dosimetry", "Radiation Detection Instrumentation", "Shielding: Properties and Design", "Statistics", "Radiation Monitoring of Personnel", "Environmental Dispersion", "Biological Effects", "Radiation Oncology Physics Radiation Oncology Physics: A Handbook for Teachers and Students, Podgorsak, E., editor, International Atomic Energy Agency, Educational Reports Series, Vienna, Austria (2003).", "Radiobiology for the Radiologist, Eric J. Hall and Amato J Giaccia Lippincott Williams & Wilkins", "Dates and deadlines for each assessment tool", "Students should bring their VIFs to the Science Undergraduate Office for verification and filing and then to Dr. Osei.", "Exam Period Policies", "STUDENTS WITH DISABILITIES"]}, {"course_id": 27, "course_code": "PHYS 396", "course_name": "PHYS396 - Biophysics of Imaging (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM RCH 204", "Email: brenda.lee@uwaterloo.ca", "Email: s2pattar@uwaterloo.ca", "Introduction to imaging concepts in biophysics with emphasis on the interrelationship between the physics principles of an imaging modality and the associated image reconstruction; methods for imaging at macroscopic to microscopic scales; computed tomography, magnetic resonance imaging, ultrasound, PET, optical imaging, optical and fluorescence microscopy, scanning probe microscopy (AFM, STM), optical tweezers, electron microscopy.", "Explain the fundamental physical principles underlying key medical imaging modalities, including radiography, computed tomography, nuclear medicine, ultrasound, magnetic resonance, and optical imaging.", "Interpret mathematical representations of imaging processes, such as Fourier transforms and convolution, and relate them to practical imaging applications", "Compare the capabilities, limitations, and applications of different medical imaging techniques in clinical and research contexts", "Conduct a comprehensive literature review on a specific imaging topic, synthesizing current research to identify trends and gaps", "Prepare and submit a structured and concise abstract for a mock scientific conference to meet professional standards", "Design and present a visually engaging and scientifically accurate conference poster summarizing research findings from an existing paper", "Apply critical thinking to interpret and discuss the biological and clinical implications of imaging technologies", "Not all topics may be covered in their entirety, but the core topics from the course calendar description will.", "1 Jan 6-10 Topic 1: Introduction & Overview of Medical Imaging", "2 Jan 13-17 Topic 2: Signals and Systems", "Topic 15: Optical Imaging Techniques in Biophysics", "12 Mar 24-28 Topic 16: Scanning Probe Microscopy & Advanced Methods in Biophysics Project Milestone #5: Conference Posters (PPT/PDF)", "Apr 9: Final examination period begins", "May 20: Standing decisions and official grades available in Quest", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Introduction: a short review of the specified medical condition", "Methods: a discussion of how at least three medical imaging and/or biophysical technologies reviewed in this course can apply to the specific medical condition, and what diagnostic information can be obtained through the use of different imaging technologies", "Results: a summary of how some of the methods chosen have been used to study the medical condition; at least 2-3 studies must be reviewed here", "Conclusion: a summary of which methods are best suited to provide the most diagnostically relevant and detailed information about the medical condition", "Notice of Recording", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 28, "course_code": "BIOL 280", "course_name": "BIOL280 - Introduction to Biophysics (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introduction to Biophysics Winter 2025", "08:30AM - 09:50AM RCH 301", "Email: brenda.lee@uwaterloo.ca", "Email: ibukhteeva@uwaterloo.ca", "Email: jglasier@uwaterloo.ca", "Introduction to a physical understanding of biological systems at macro and molecular scales.", "The course is intended for second-year science and engineering students and will cover a broad spectrum of topics in biophysics, as well as an introduction to neurobiology, nanotechnology, and biotechnology.", "Explain fundamental physical principles as they relate to biological systems at the macro and molecular scales", "Apply mathematical and physical models to describe and predict biological phenomena, including respiration, membrane transport, and energy transformation", "Demonstrate a systemic approach to problem-solving in applying physical concepts to solve questions related to biological systems", "Explore the structural and functional properties of biomolecules (proteins, nucleic acids, lipids, carbohydrates) and their role in cellular and molecular systems", "Evaluate the role of physical laws in physiological processes, such as neuronal signal propagation and blood flow dynamics", "Demonstrate knowledge of a wide range of biophysical and experimental methods (e.g. microscopy, spectroscopy, light scattering techniques) and their applications in research and medicine", "Critically assess biophysical methods used in research and medical applications and highlight their benefits, limitations, potential", "Develop scientific communication skills through the creation of written reports and problem-solving assignments related to biophysical concepts", "Not all topics may be covered in their entirety, but the core topics from the course calendar description will.", "1 Jan 6-10 Topic 1: Introduction to Biophysics", "Topic 7: Introduction to Cellular & Molecular Biophysics", "Topic 9: Biophysics of Nucleic Acid and DNA", "Topic 14: Introduction to Bionanotechnology", "Topic 16: Advanced Methods in Biophysics", "Topic 17: Methods in Medical Physics", "Apr 9: Final examination period begins", "May 20: Standing decisions and official grades available in Quest", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "A detailed set of instructions will be provided on LEARN, but the general grading scheme will follow these key requirements:", "Biological explanation of 1 application (e.g. medical disease, cellular/molecular mechanism or interactions, biological phenomena)", "Physical explanation of 2 methods that can be used to study this biological application", "Pros and cons of each method presented", "Comparison of methods to see which one is more suitable under certain conditions", "Grading: Based on accuracy and depth of information in paper, and organization of content; a grading rubric will be provided prior to submission", "Notice of Recording", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 29, "course_code": "PHYS 280", "course_name": "PHYS280 - Introduction to Biophysics (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introduction to Biophysics Winter 2025", "08:30AM - 09:50AM RCH 301", "Email: brenda.lee@uwaterloo.ca", "Email: ibukhteeva@uwaterloo.ca", "Email: jglasier@uwaterloo.ca", "Introduction to a physical understanding of biological systems at macro and molecular scales.", "The course is intended for second-year science and engineering students and will cover a broad spectrum of topics in biophysics, as well as an introduction to neurobiology, nanotechnology, and biotechnology.", "Explain fundamental physical principles as they relate to biological systems at the macro and molecular scales", "Apply mathematical and physical models to describe and predict biological phenomena, including respiration, membrane transport, and energy transformation", "Demonstrate a systemic approach to problem-solving in applying physical concepts to solve questions related to biological systems", "Explore the structural and functional properties of biomolecules (proteins, nucleic acids, lipids, carbohydrates) and their role in cellular and molecular systems", "Evaluate the role of physical laws in physiological processes, such as neuronal signal propagation and blood flow dynamics", "Demonstrate knowledge of a wide range of biophysical and experimental methods (e.g. microscopy, spectroscopy, light scattering techniques) and their applications in research and medicine", "Critically assess biophysical methods used in research and medical applications and highlight their benefits, limitations, potential", "Develop scientific communication skills through the creation of written reports and problem-solving assignments related to biophysical concepts", "Not all topics may be covered in their entirety, but the core topics from the course calendar description will.", "1 Jan 6-10 Topic 1: Introduction to Biophysics", "Topic 7: Introduction to Cellular & Molecular Biophysics", "Topic 9: Biophysics of Nucleic Acid and DNA", "Topic 14: Introduction to Bionanotechnology", "Topic 16: Advanced Methods in Biophysics", "Topic 17: Methods in Medical Physics", "Apr 9: Final examination period begins", "May 20: Standing decisions and official grades available in Quest", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "A detailed set of instructions will be provided on LEARN, but the general grading scheme will follow these key requirements:", "Biological explanation of 1 application (e.g. medical disease, cellular/molecular mechanism or interactions, biological phenomena)", "Physical explanation of 2 methods that can be used to study this biological application", "Pros and cons of each method presented", "Comparison of methods to see which one is more suitable under certain conditions", "Grading: Based on accuracy and depth of information in paper, and organization of content; a grading rubric will be provided prior to submission", "Notice of Recording", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 31, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 32, "course_code": "PHYS 233", "course_name": "PHYS233 - Introduction to Quantum Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Introduction to Quantum Mechanics Winter 2025", "Email: rbudakian@uwaterloo.ca", "Email: pppritampriyadarsi@uwaterloo.ca", "Introduction to quantization, wave-particle duality and the uncertainty principle The Schroedinger equation and solvable examples.", "Introduction to approximation methods including time-independent perturbation theory.", "Background: understanding why we need a quantum theory", "Learning the building blocks of a quantum theory: state vectors and operators", "Learning how to use quantum mechanics to compute probabilities for outcomes of measurements", "Competency with the following mathematical concepts:", "Complex numbers", "Basic probability", "Linear algebra", "Differential equations", "Classical description of a magnetic moment", "Stern-Gerlach Experiment I", "The quantum state vector", "Representation of the quantum state vector", "Generalized quantum systems", "Representation of S = 1/2 angular momentum operators", "Projection operators", "Expectation value of operators", "Time evolution of superposition of eigenstates", "Quantum mechanics in the position basis", "Infinite square well potential", "Quantum harmonic oscillator I", "Hydrogen atom I", "The remaining 2/3 will be spent answering questions related to the lectures and getting into small groups and problem solving."]}, {"course_id": 33, "course_code": "PHYS 234", "course_name": "PHYS234 - Quantum Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["11:30AM - 12:20PM DC 1351", "K. Islam", "Introduction to formalism of quantum physics.", "Introduction to operators.", "Background: understanding why we need a quantum theory", "Learning the building blocks of a quantum theory: state vectors and operator", "Jan 06, 08, 10 Introduction to Quantum Physics, Stern-Gerlach experiments 1", "Jan 20, 22, 24 Matrix notation, general quantum systems, operators 2", "Mar 10, 12, 14 Continuous quantum systems – formalism, infinite potential well,", "Mar 17, 19, 21 Continuous quantum systems – infinite potential well (continued), finite potential well 5", "Mar 24, 26, 28 Continuous quantum systems – quantum harmonic oscillator 9", "Mar 31, Apr 02, 04 Continuous quantum systems (continued), Review", "Students should start checking for posted exam dates:", "Everyone needs a support system.", "Every student in PHYS 234 is expected to treat their peers and their instructor with kindness, fairness, tolerance, and respect.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 34, "course_code": "PHYS 124", "course_name": "PHYS124 - Modern Physics (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Songmin Xu s83xu@uwaterloo.ca", "Mastering Physics technical support: https://support.pearson.com/getsupport/s/", "This is a fast-paced survey course (covering about one textbook chapter per week) introducing a wide range of topics in modern physics.", "The intention is four-fold: (1) to make first-year physics more interesting; (2) to provide important, intuitive understanding of key modern physics concepts before your more mathematically rigorous courses in second year; (3) to help you decide which areas of physics you may wish to explore in more depth in upper-year electives; and (4) to have at least a brief introduction to important branches of physics you may not explore further in your degree.", "Apply Newton's second law and Newton's law of universal gravitation to solve basic problems in gravitational physics.", "Understand, distinguish between and correctly use the concepts of weight, weightlessness, and apparent weight.", "Solve simple problems in orbital motion and apply Kepler's three laws.", "Properly understand Einstein's two postulates and logically derive from them, and apply, the concepts of time dilation, length contraction, Doppler shift, velocity composition, relativity of simultaneity, and understand why special relativity works for both wave-in-ether and particle-in-vacuum models of light..", "Articulate the basic, intuitive ideas of how Einstein's geometrical model of gravity works (equivalence principle and curved spacetime).", "Appreciate that classical physics cannot explain the single or double slit experiments.", "Understand and predict basic properties of the quantum hydrogen atom based on only the de Broglie relation and classical properties of electron orbits.", "Understand the basic idea of a complex number, and in particular, a complex exponential wave, and use it to \"derive\" the Schrodinger equation.", "Use classical and quantum physics to understand/calculate ionic bonds, covalent bonds, van der Waals bonds, and basic molecular spectra.", "Use classical and quantum physics to understand/calculate the basic features of atomic nuclei, including nuclear binding energy, nuclear models, nuclear stability and radioactivity, nuclear reactions, nuclear fission, and nuclear fusion.", "Use classical and quantum physics to understand/calculate some basic aspects of collider physics, including the concept of available energy, and an introduction to the Standard Model of particle physics.", "Feb 24 Wave Functions Wave Functions", "Mar 17 Nuclear Nuclear", "Mastering Physics:", "Every student in PHYS 124 is expected to treat their peers and their instructor with kindness, fairness, tolerance, and respect.", "This extends to welcoming the opinions of others and being considerate of their lived experiences.", "Library for research-based assignments"]}, {"course_id": 35, "course_code": "PHYS 249", "course_name": "PHYS249 - Computational Physics and Linear Algebra (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Computational Physics and Linear Algebra Fall 2024", "10:30AM - 12:20PM DC 1350", "Email: brenda.lee@uwaterloo.ca", "Computational techniques; numerical accuracy and speed; Python libraries and implementation; algorithms for numerical integration; matrix operations.", "Computational approach to vectors in 2- and 3-space; linear equations, matrices, determinants; eigenvalues and diagonalization.", "Resource Details", "These will not be recorded and consist primarily of board work.", "Understand and apply the basic concepts of vectors, matrices and linear transformations", "Interpret the geometric meaning of vector spaces, subspaces, linear independence, basis and dimension", "Perform matrix operations including addition, multiplication, transposition and inversion both manually and using Python libraries such as NumPy", "Solve systems of linear equations manually and computationally using LU decomposition and Gaussian elimination", "Calculate eigenvalues and eigenvectors of matrices manually and computationally; and interpret their significance in physics applications", "Apply diagonalization techniques to solve differential equations relevant to physics problems", "Understand inner product spaces and concepts of length and orthogonality in both theoretical and computational settings", "Describe and represent linear transformations using matrices; and their contribution to geometric objects and physical systems", "Develop iterative and computational skillsets through Python to model and simulate physical systems with the help of linear algebra concepts", "Identify and articulate transferable skills from their science courses and connect these to the Future Ready Talent Framework", "Create accomplishment statements that effectively communicate these skills on their resumes", "Thursdays Tutorial and Skills Identification & Articulation Workshop @ 10:30am - 12:20pm", "Not all topics may be covered in their entirety, but the core topics from the course calendar description will.", "Topic 1: Intro to Course, Linear Algebra & Python Programming", "2 Sep 9-13 Topic 3: Spanning and Linear Independence", "Topic 5: Projections and Applications", "Skills Identification & Articulation Worksheet 0", "Topic 6: Visualization and Solving of Vector Operations using Python", "Topic 7: Systems of Linear Equations, Gaussian Elimination and Back-Substitution", "Topic 9: Applications of Systems of Linear Equations with Computational Methods and Visualization with Python", "Topic 10: Matrix Addition and Multiplication", "Topic 11: Transpose, Identity and Inverse of a Matrix", "Skills Identification & Articulation Worksheet 1", "Topic 12: Matrix Factorizations", "Topic 13: Computational Methods in Matrix Algebra", "Topic 14: Vector Spaces and Subspaces", "Topic 16: Visualization of Vector Spaces through Computational Methods Skills Identification & Articulation Worksheet 2", "Topic 18: Computational Methods using Determinants", "Topic 19: Eigenvalues and Eigenvectors with Matrix Diagonalization", "Topic 22: Least Squares Approximations Skills Identification & Articulation Worksheet 3", "Topic 23: Numerical Approximation Methods", "UNIT 8 | COMPLEX VALUES & COMPUTATIONAL APPLICATIONS", "Topic 24: Complex Numbers & Computational Applications", "Jan 21: Standing decisions and official grades available in Quest", "Instructions and installation guidance will be provided at the beginning of the term on LEARN Yes", "An Introduction to Linear Algebra for Science and Engineering Excellent book that we will be using in this course; highly recommend getting this if you can No", "Linear Algebra: A Modern Introduction, 4th Edition, David Poole Good elementary book which has suitable problems for scientists No", "Computational Physics, 2nd Edition, Mark Newman Great for beginners to computational physics with Python No", "Introduction to Linear Algebra, 6th Edition, Gilbert Strange (MIT) Excellent mixture of linear algebra and optimization / data science but no physics applications No", "You are encouraged to explore the topics of linear algebra and computational physics / numerical methods of analysis through these recommended textbooks and materials above for your own benefit and enhanced learning experience.", "HOMEWORK (15% Completion Grade): I'm giving you free marks to practice, practice, practice and show you've put in the time to do some linear algebra!", "Level of Collaboration Allowed: Not Monitored", "Do them by the end of the next week to get grades.", "Level of Collaboration Allowed: None - Screening for Plagiarism Active - Debugging Support on Discord is Allowed", "Frequency: Once in the Middle of the Term", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Level of Collaboration Allowed: Groupwork Allowed", "Grading: Based on completion and suitability of responses", "The written content will primarily be code and Jupyter Notebook files.", "Code plagiarism includes moderate to significant reproduction of other's work (source code from available resources, code from classmate submissions, fragments of original code, etc.)", "Notice of Recording", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 36, "course_code": "PHYS 263", "course_name": "PHYS263 - Classical Mechanics and Special Relativity (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Classical Mechanics and Special Relativity Winter 2025", "08:30AM - 09:20AM", "Newtonian dynamics of particles and systems of particles.", "You will be expected to become fluent in solving the problems covered in this course using a variety of approaches (e.g. forces, torques, and energy conservation).", "Classical Dynamics of Particles and Systems (5th edition)", "Notice of Recording"]}, {"course_id": 37, "course_code": "PHYS 267", "course_name": "PHYS267 - Probability, Statistics, and Data Analysis for Physics and Astronomy (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["The True Logic for this World (aka Probability, Statistics and Data Analysis for Physics and Astronomy)", "I love this material and I hope that my interest and enthusiasm will be contagious!", "\"We shall not cease from exploration And the end of all our exploring Will be to arrive where we started And know the place for the first time.\"", "Rationale behind selection of book by Spiegel: This book does not have any information specific to physics, nor is it particularly interesting, but it does cover the basic mechanics of probability and statistics quite well.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 38, "course_code": "PHYS 334", "course_name": "PHYS334 - Quantum Physics 2 (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "04:30PM - 05:20PM", "Formalism of quantum mechanics.", "Identical particles.", "Applications in atomic and molecular physics.", "Physically predict, and mathematically model, the outcome(s) after measuring a quantum system", "Understand and model the difference between a single measurement outcome and an ensemble average", "Predict the time dependence of a quantum system, given its initial state and Hamiltonian", "Use commutator identities to check commutation relations for operators", "Write the position and momentum operators in terms of the harmonic oscillator ladder operators, and vice versa", "State the commutation relations that define a set of angular momentum operators", "State the spectrum (allowed eigenvalues) of the angular momentum operators 𝐽^2 and 𝐽_𝑧, in terms of quantum numbers 𝑗 and 𝑚", "State the restrictions on the 𝐽^2 and 𝐽_𝑧 eigenvalues, in terms of restrictions on their associated quantum numbers 𝑗 and 𝑚", "State the effect of all angular momentum operators on the joint eigenstates of 𝐽^2 and 𝐽_𝑧", "Compute the matrix representations of the angular momentum operators for a given 𝑗, in the joint eigenbasis of 𝐽^2 and 𝐽_𝑧", "Describe the eigenfunctions of orbital angular momentum (spherical harmonics) in the position basis", "For systems with “central” potentials (those that depend only on a radial coordinate), describe the decomposition of the energy eigenfunctions into their angular and radial components", "Describe the energies and eigenstates of the hydrogen atom", "Describe the degeneracy of different energy eigenstates of the hydrogen atom", "State two possible complete sets of mutually commuting operators (CSCOs) whose eigenstates can be used as bases to describe a set of two angular momenta", "State the eigenvalues of the CSCOs used to describe a set of two angular momenta", "State the selection rules for the Clebsch-Gordan coefficients that relate the coupled and uncoupled bases of a system with two angular momenta", "Calculate perturbative energy shifts and wavefunction changes for nondegenerate systems", "Calculate perturbative energy shifts for degenerate systems, selecting an appropriate basis for the calculation", "Use the variational method to estimate the ground-state energies of simple one-dimensional problems, given a suitable trial function", "State the definition of a boson and a fermion, in terms of the spin of the particles", "State the symmetry properties of bosonic and fermionic wavefunctions", "Exams", "There will be two in-class exams given during the lecture period in our usual classroom.", "Exam 2: Wed. Mar 19 (covers material up through and including nondegenerate perturbation theory)", "HW1 - formalism and postulates - due Jan 24", "HW2 - quantum harmonic oscillator and angular momentum - due Feb 7", "HW3 - spherical harmonics and hydrogen atom - due Feb 28", "HW4 - addition of angular momentum and nondegenerate perturbation theory - due Mar 12", "Week 1 - Intro to class and mathematical formalism of quantum mechanics", "Week 4 - Angular momentum", "Week 5 - Spherical harmonics and central potentials", "Week 8 - Nondegenerate perturbation theory", "Week 9 - Degenerate perturbation theory, fine structure, Zeeman effect", "Quantum Mechanics: A Paradigms Approach, David H. McIntyre", "Introduction to Quantum Mechanics, David Griffiths", "Zettili shines in its extensive collection of worked examples and practice problems.", "Some assignment problems may be graded on a multiple choice basis.", "Notice of Recording"]}, {"course_id": 39, "course_code": "PHYS 335", "course_name": "PHYS335 - Condensed Matter Physics (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Classical elastic theory of the crystalline state.", "Electrons in a periodic potential, Band structure and Fermi surface.", "• Reciprocal lattice, Fourier analysis and X-ray diﬀraction.", "• Basics of the theory of transport, Boltzmann equation.", "• Basics of semiconductor physics, semiconductor devices.", "• Reciprocal lattice, Fourier analysis and X-ray diﬀraction.", "• Basics of the theory of transport, Boltzmann equation.", "• Basics of semiconductor physics, semiconductor devices.", "Introduction to Solid State Physics No 237.95"]}, {"course_id": 40, "course_code": "PHYS 342", "course_name": "PHYS342 - Electricity and Magnetism 2 (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM QNC 2502", "Electric and magnetic fields in media, auxiliary fields, Maxwell's equations, electromagnetic waves, electric and magnetic properties of matter.", "Electrodynamics", "Review of Vector Analysis", "Ability to calculate electrostatic fields in vacuum with various geometries.", "Ability to calculate potential fields in vacuum with various geometries", "Ability to calculate electrostatic fields in matter with various geometries using auxiliary fields", "Ability to calculate magnetostatic fields in vacuum with various geometries.", "Ability to calculate magnetostatic fields in matter with various geometries using auxiliary fields", "Understanding of the coupling of time-dependant magnetic and electric fields, Maxwell's equations", "Ability to calculate wave solutions to Maxwell's equations in media.", "3 Electric Potential 2.3-5", "5 Electric Fields in Matter 4", "7 Magnetic Fields in Matter 6  midterm", "8 Electrodynamics 7.1-2", "9 Maxwell's Equations 7.3", "11 Absorption & Dispersion 9.3-4", "Introduction to Electrodynamics, David J. Griffiths any edition Yes", "Completing this book report should prepare you for the final and most interesting topics of this course: Maxwell's equations and their wave solutions.", "Each consists of reading the textbook material covering the upcoming week's material.", "Each of these are meant to be formative.", "Library for research-based assignments", "Notice of Recording", "In the event of a longer-term cancellation of in-person meetings, whether for this particular course or University-wide, class will be held synchronously at the usual time using WebEx, Teams, or Zoom."]}, {"course_id": 41, "course_code": "PHYS 349", "course_name": "PHYS349 - Advanced Computational Physics (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Advanced Computational Physics Winter 2025", "PHYS 349", "Additional information regarding submission procedures can be found below.", "Algorithms for solving differential equations; Monte Carlo techniques; Fourier transforms; programming and computational techniques using Python, applied to physical problems such as astrophysics, electricity and magnetism, classical and quantum mechanics; introduction to machine learning and artificial intelligence.", "View requirements for PHYS 349", "After discussing object-oriented programming and foundational computer science concepts within the Python framework, numerical algorithms for diverse areas of engineering and physics will be discussed.", "1) Ability to write and analyze at a functional level scientific programs in Python", "2) Ability to apply standard object-oriented techniques in Python to scientific program design.", "4) Ability to apply simple programming environments and graphics tools to scientific programming.", "7) Ability to write and understand basic neural network programs", "Electromagnetism, Quantum Mechanics (Partial Differential Equations)", "Chapters 23-24", "A Short Course in Computational Science and Engineering: C++, Java and Octave Numerical Programming with Free Software Tools David Yevick, ISBN: 978-0521116817 No $40", "Fundamental Math and Physics for Scientists and Engineers David Yevick, Hannah Yevick, ISBN: 978-0470407844 No $40 - 70", "The first of the two above textbooks, although written C++ and MATLAB, contains detailed explanations of a large fraction of the material covered in the course.", "These files should include both your code and the program output."]}, {"course_id": 42, "course_code": "PHYS 359", "course_name": "PHYS359 - Statistical Mechanics (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Statistical Mechanics Winter 2025", "10:00AM - 11:20AM MC 4020", "04:30PM - 05:20PM", "02:30PM - 03:20PM", "Prof. Alan Jamison", "Wed 3:30-4:30pm in QNC 4114", "Friday 10:00-11:00am in QNC 4114", "Addison Okell", "Applications to specific heat of solids, classical and quantum gases, electrons in metals, Planck's law of radiation, and Bose-Einstein condensation.", "Make meaningful approximations and justify their validity", "Use statistical ideas to derive probability distributions for observables of large systems", "Apply statistical mechanics to problems from a variety of fields", "Understand how quantum mechanics modifies statistical mechanics and when this is relevant", "Find properties of interacting systems using mean-field theory", "2024-01-20 Continuous degrees of freedom and the Maxwell-Boltzmann distribution (6.3, 6.4) PS2", "2024-02-03 Quantum theory of bosons and fermions (6.7, 7.2) PS4", "2024-03-17 The Debye model and massive bosons (7.5, 7.6) PS8", "Study period", "An Introduction to Thermal Physics by Daniel V. Schroeder Same text as you used for PHYS 358 Yes 58.00", "If you fail to turn in a problem set for any reason, its weight will be shifted to the final exam.", "This course includes the independent development and practice of specific perspectives and methods of rigorous thought.", "Library for research-based assignments"]}, {"course_id": 43, "course_code": "PHYS 461", "course_name": "PHYS461 - Nanophysics (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Email: alupascu@uwaterloo.ca", "Email", "Applications of nanotechnology in biology and medicine.", "This course addresses the new physical phenomena arising when the dimensions of physical systems are reduced to micrometers or nanometers.", "These systems are called mesoscopic, a word meant to indicate behavior that is distinct from that of both macroscopic and microscopic systems.", "These principles will be applied to a discussion of the field effect transistor, a widely spread device.", "The following topics in mesoscopic transport will be considered: the Landauer formula of quantized transport, the Landauer-Büttiker formalism for multiterminal conductors, the quantum Hall effect, phase coherent transport, Coulomb blockade, quantum dots, coherent transport in superconducting systems, carbon-based devices (graphene and carbon nanotubes), resonant tunneling.", "A few applications of nanophysics based tools in biology and medicine will be discussed and a brief overview of ethical and regulatory aspects of nanoscience will be given as well.", "The students will learn the principles that govern electronic transport at the nanoscale.", "The field of mescoscopic electronic transport is a rich playground where concepts learned in courses including thermodynamics, electricity and magnetism, quantum mechanics, and solid-state physics can be applied and further understood.", "The discussion of applications in biology and medicine is meant to serve as an illustration of the potential of nanosystems in these areas.", "Introduction to nanophysics", "Review of solid-state physics", "The field effect transistor – the building block of classical electronics", "Mesoscopic transport: transport modes, Landauer formula, Landauer - Büttiker formalism", "The quantum Hall effect", "Graphene and carbon nanotubes", "Fabrication methods in nanoscience", "Applications of nanoscience in biology and medicine", "Nanoscience and society", "A list of the topics and relevant material with a timeline for study will be kept on LEARN.", "a courseware package", "The courseware package contains sections from the following sources:", "Supriyo Datta, Electronic Transport in Mesoscopic Systems, Cambridge University Press, 1997.", "Introduction to Nanoscale Science and Technology, Kluwer, 2004.", "Stroscio, Michael A. and Dutta, Mitra (Eds.), Biological Nanostructures and Applications of Nanostructures in Biology : Electrical, Mechanical, and Optical Properties, 2004.", "Weekends and holidays do not count towards the penalty."]}, {"course_id": 44, "course_code": "PHYS 483", "course_name": "PHYS483 - Advanced Therapeutic Concepts in Oncology and Medical Physics (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["PHYS 483 - Advanced Therapeutic Concepts in Oncology and Medical Physics Winter 2025", "ernest.osei@uwaterloo.ca", "Name & contact information of primary instructor:", "Names and contact information of other faculty members:", "Monday-Friday 9am-5pm", "Medical Physics Department", "Topics include a comprehensive review of cancer epidemiology and pathophysiology, therapeutic agents used in the oncology setting, management of cancer therapy toxicities, and treatment and palliation of cancer symptoms.", "Physics methods in radiation therapy and the medical physicist's role in cancer treatment will be addressed.", "Topics include a comprehensive review of cancer epidemiology and pathophysiology, therapeutic agents used in the oncology setting, management of cancer therapy toxicities, and treatment and palliation of cancer symptoms.", "Physics methods in radiation therapy and the Medical Physicist's role in cancer treatment will be addressed.", "Day", "Introduction", "The human body", "Risk Factors and Reducing your Risks", "Choroidal Melanoma", "Margins Surgical operations for staging the cancer", "Risks and benefits", "Margins Surgical operations for staging the cancer", "Risks and benefits", "Margins Surgical operations for staging the cancer", "Risks and benefits", "Ethics, Professionalism and Leadership in Medical Physics", "Review of Medical Physicist's role in oncology", "Innovations in Cancer Care", "Cancer in Canada An Epidemiologic Overview, A report based on the Cancer Incidence Atlas-Volume 2, 2000–2006", "Radiobiology for the Radiologist, Eric J. Hall and Amato J Giaccia Lippincott Williams & Wilkins", "The final examination will consist of 100 True or False and multiple choice questions", "Dates and deadlines for each assessment tool", "Students should bring their VIFs to the Science Undergraduate Office for verification and filing and then to Dr. Osei.", "Exam Period Policies", "STUDENTS WITH DISABILITIES"]}, {"course_id": 45, "course_code": "STAT 202", "course_name": "STAT202 - Introductory Statistics for Scientists (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Introductory Statistics for Scientists Winter 2025", "R. Metzger", "R. Metzger", "jenny.tieu@uwaterloo.ca", "02:30PM - 03:20PM", "jenny.tieu@uwaterloo.ca", "R. Metzger", "02:30PM - 03:20PM", "PHY 313", "jenny.tieu@uwaterloo.ca", "R. Metzger", "Methods for data summary and presentation.", "Estimation, hypothesis testing, two-sample techniques and paired comparisons, regression, correlation.", "Evaluate the strengths and weaknesses of a simple sampling technique.", "Given a set of data:", "Build a simple linear model for a dataset.", "Perform simple statistical test to determine whether:", "A population mean and proportion differs from a particular value.", "A simple linear regression model parameter is significant.", "Probability Functions (PF) and Cumulative Distribution Functions (CDF):", "Differentiate between a Binomial and Poisson experiment.", "Define simple sample spaces and calculate simple probabilities.", "Calculate the sample mean and sample variance of a linear combination.", "Linear Relationships (Covariance and Correlation), Time Series, Scatterplots, Linear Regression", "Instructor(s) will go over a problem set.", "Regression analysis", "Sample design", "Poisson Distribution, Normal Distribution", "Instructor(s) will go over a problem set.", "Inference", "Instructor(s) will go over a problem set.", "Inference", "Inference", "- location TBD", "≥50", "No considerations are given for individual technical issues.", "This is a cumulative test that will cover the entire course.", "Late Tests will be given a zero mark.", "Note for your circumstance to be deemed valid you must have been incapacitated for a significant portion of the assessment window.", "A circumstance that incapacitates a student for a month or longer is unlikely to be accommodated – in such a case we ask that you please speak to your academic advisor and consider dropping the course.", "In the past some of the issues below have cropped up in my courses:", "Make sure you start online quizzes early, hand in assignments early, etc in case of unforeseen technical issues!", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 46, "course_code": "AMATH 382", "course_name": "AMATH382 - Computational Modelling of Cellular Systems (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Computational Modelling of Cellular Systems Winter 2024", "08:30AM - 09:50AM MC 4061", "B. Ingalls", "An introduction to dynamic mathematical modeling of cellular processes.", "The emphasis is on using computational tools to investigate differential equation-based models.", "This course provides an introduction to dynamic mathematical modeling of cellular processes.", "The emphasis will be on using computational tools to investigate models of cellular phenomena.", "The course then addresses models in four biological domains: metabolic networks, signal transduction pathways, gene regulatory networks and electrophysiology.", "Intended Audience: Third and fourth year students interested in dynamic modelling in molecular cell biology.", "Software: We will be making heavy use of packages for numerical simulation of differential equations.", "Appendix C of the course notes consists of tutorials on MATLAB and XPPAUT, which is a GUI-based package for dynamical systems analysis.", "Design and simulate ordinary differential equation models of chemical reaction networks", "Investigate differential equation models using phase plane analysis, sensitivity analysis, and bifurcation analysis", "Develop and interpret differential equation models of biomolecular networks in the context of cellular metabolism, signal transduction, gene regulation, and electrophysiology", "Design and simulate stochastic models of gene regulatory networks", "Provide critical analysis of kinetic models of intracellular networks in the scientific literature and communicate their potential and limitations", "Kinetic Modelling of Biochemical Networks", "Module 3. Dynamics and Stability", "Mathematical Modeling of Systems Biology posted: https://www.math.uwaterloo.ca/~bingalls/MMSB/ Yes", "Term project will be completed in groups of two.", "Oral presentations will be in person during 20-minute time-slots scheduled during the last week of lectures (45% of project grade)", "Notice of Recording"]}, {"course_id": 47, "course_code": "BIOL 201", "course_name": "BIOL201 - Human Anatomy (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["09:30AM - 10:20AM STC 1012", "Email messages not adhering to these conditions will not be read and will be deleted.", "This course takes a systems approach to study the structure of the human body and its relationship to function.", "Structural features of organ systems will be explored through lectures and laboratory exercises.", "Note that these recordings are NOT guaranteed nor are these recordings meant to be a replacement for in-person learning.", "Develop a vocabulary to effectively communicate anatomical concepts", "Recognize and identify the anatomical structures of all of the organ systems of the human body", "Demonstrate an understanding of anatomical structures through laboratory sessions", "Week 1 Introduction to Human Anatomy & the Integumentary System", "Week 3 Bones and the Skeleton - part 2 & Skeletal Muscle", "Week 8 Endocrine System & Circulatory System - part 1", "Week 10 Respiratory System & Digestive System", "Official Grades and Course Access", "This will be followed by an exploration into the appendages of the skin.", "Initially basic structure, location, and classification of bones will be explored.", "This will be followed by an examination of select major skeletal muscles of the body.", "The basic divisions of the nervous system will be introduced in the unit.", "A gross overview of the nervous system anatomy will precede further discussion on the anatomy of the central nervous system (CNS) and peripheral nervous system (PNS).", "Unit 6 – Endocrine System (Chapter 17)", "This will be followed by an examination of the major endocrine organs and other structures associated with the endocrine system of the body.", "The circulatory system will be discussed in this unit.", "The anatomy of the respiratory system will be examined in this unit.", "This will be followed by the anatomy of the upper and lower respiratory components.", "The anatomy of the digestive system will first be examined in this unit.", "This will be followed by the anatomy of the urinary system will be examined including the kidneys followed by the ureters and the urinary bladder.", "Expectations for Change"]}, {"course_id": 48, "course_code": "BIOL 239", "course_name": "BIOL239 - Genetics (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["11:30AM - 12:20PM", "10:30AM - 11:20AM STC 1012", "You can!", "Chromosomal mechanisms in mitosis and meiosis.", "Natural selection and the evolution of genetic systems.", "Describe the fundamentals of gene structure, function and transmission in prokaryotic and eukaryotic cells and organisms.", "Describe the various ways mutations can arise and how mutations may affect gene expression and phenotypic outcomes.", "Describe recombinant DNA technology in bacteria and its role in biotechnology.", "Effectively work with others, discussing, evaluating, and communicating genetics concepts and synthesizing ideas in a group.", "Readings", "textbook 1.1-1.2", "Mendelian genetics and probability", "Modification of Mendelian ratios", "textbook 3.2-3.3, 4.2-4.4, 15.1", "Mitosis, meiosis, and chromosome numbers", "DNA and the genetic code", "textbook 9.2-9.3", "T4: Mitosis and meiosis", "DNA cloning", "T5: Testing genetic ratios", "Cancer genetics", "T9: Population genetics", "Exam period", "- write the final exam and achieve a grade of at least 50% on the cumulative test and exam section", "Online learning activities: These activities are designed to test your knowledge of several important concepts explained by the lecture presentations in this course, and should be completed after the portion of the course when they are covered in lecture.", "They are all due toward the end of the term but can be completed as many times as you like to help you work on these concepts.", "Read the instructions carefully before attempting these as a completion quiz (in the quiz section) must also be completed to obtain credit.", "In this case, the weight of the missed submission will be transferred to the final exam.", "The dates affected and degree of incapacitation will be used to determine follow-up action."]}, {"course_id": 49, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}, {"course_id": 50, "course_code": "BIOL 240L", "course_name": "BIOL240L - Microbiology Laboratory (0.25)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["BIOL 240L", "BIOL 240L 001", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 002", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 003", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 005", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 006", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 007", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 008", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 010", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 012", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 013", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 014", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 015", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 017", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 018", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 021", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "Email: cduxbury@uwaterloo.ca", "View requirements for BIOL 240L", "Main Objective Obtain a a good understanding of the basic techniques used in a microbiology lab to study and handle microorganisms safely.", "Apply staining techniques to differentiate and observe types of bacteria", "Appreciate proper aseptic technique while handling microorganisms in the lab and inoculating media", "Properly prepare slides for examination under the microscope", "Prepare and use dilutions to isolate pure cultures and to enumerate the number of organisms in a culture", "Exp 3: Basic Bacterial Shapes", "Exp 12: Pour-Plate Method", "Exp 14: Aseptic Technique in Pipette Handling", "Exp 15: Standard Plate Count Method", "Exp 17: Bacterial Flagella Stain", "Exp 19: Miniprep of Plasmid DNA", "Exp 20: Analysis of Plasmid and Genomic DNA", "Exp 21: Metabolic Activities of Bacteria", "Exp 30: Evaluation of Chemical Antimicrobial Agents", "Exp 31: Antibiotic Sensitivity Testing", "Exp 32: Isolation of Bacterial Mutants", "TBA", "Extra precautions must be taken to ensure the safety of yourself and those around us!", "Always be prepared for a quiz; they could be given at any time and they are cumulative!", "To make this happen, a flowchart for each experiment is required.", "The flowchart is similar to a \"map\" of your experiment and should be sufficiently detailed and include the most important information about the experimental steps and possible time management.", "The flowchart should NOT be a reiteration of the \"METHODS\" section in your manual.", "Please see Flowchart Help Sheet for a flowchart example.", "Your professionalism mark will be assigned by your TAs and will be assessed on the basis of your performance in the laboratory, attendance, and your degree of skill in microbiological techniques.", "More information will be given closer to date.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 51, "course_code": "BIOL 266", "course_name": "BIOL266 - Introduction to Computational Biology (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Introduction to Computational Biology Fall 2022", "Instructor: Prof. Andrew Doxey", "This course provides an introduction to computational methods in biology, including exploration of bioinformatics databases and tools, analysis of protein and DNA sequences, and computer-aided modelling of biological systems.", "Explore online bioinformatic databases to interact with DNA, protein, gene expression, structural, and systems biology data", "Compute optimal alignments between pairs of sequences using dynamic programming algorithms", "Perform multiple sequence alignments", "Perform 3D structural modelling and visualization of proteins", "Examine and analyze gene expression data from microarrays and RNA-seq experiments", "Understand the fundamentals of systems biology including network analysis and visualization of interactomes", "Data Type", "Introduction   None", "Molecular evolution I Trees Lab #4 - Phylogenetics I 2.2%", "Molecular evolution II Trees MIDTERM 30%", "Molecular evolution III Trees Lab #5 - Phylogenetics II 2.2%", "Structural modelling and biophysics Structures Lab #6 - Structural Modeling 2.2%", "Networks and Systems Biology Networks Lab #9 - Exploring the STRING database 2.2%"]}, {"course_id": 52, "course_code": "BIOL 273", "course_name": "BIOL273 - Principles of Human Physiology 1 (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM M3 1006", "M. Bording-Jorgensen", "Dr. Vivian Dayeh - Tuesdays 11:30 am -12:30pm in B1-277.", "The physiology of major organ systems of the human body.", "Topics include neurophysiology and peripheral nervous system, muscle, the cardiovascular system, the components of blood, respiratory system, and immune system.", "The combination of BIOL273 and BIOL373 covers all of the major topics of human physiology.", "Identify the components/structures of the following organ systems: nervous, muscular, cardiovascular, respiratory, and immune.", "Describe how these five organ systems are organized in the human body.", "Explain the function of each of these five organ systems.", "Demonstrate the integration of these five organ systems in maintaining homeostasis.", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Official Grades and Course Access", "Corresponding Silverthorn textbook chapters in parentheses for each unit.", "This unit serves as an introduction to the study of the function of the five organ systems examined in this course (nervous, muscular, cardiovascular, respiratory, and immune).", "Unit 1 will introduce how the organ systems work together to maintain homeostasis within the body.", "The organization of the nervous system will be explored in this unit.", "The types of cells found in the central and peripheral nervous system serve as a starting point to discuss their function within the nervous system.", "Initially gross structure of skeletal muscle including the structure of a muscle fibre and myofibrils will be examined.", "An exploration into the muscle contraction mechanism via excitation-contraction coupling will be examined to explain how muscles work.", "This unit will start with an introduction into the heart and components of the cardiovascular system, which will be followed by cardiac muscle contraction mechanism.", "In this unit we will examine the structure and function of the respiratory system, incorporating gas laws and ventilation.", "Pulmonary function through lung compliance and elastance as well as the control of ventilation will be examined.", "This unit will start with the general function of immune system and introduction to the types of pathogens that infect the body.", "The anatomy of the immune system will be discussed returning to the role of haematopoiesis.", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each unit for the assignments and term tests.", "Required for the Mastering A&P Online Assignments and Dynamic Study Modules.", "Course website Waterloo Learn https://learn.uwaterloo.ca - includes general course information, language of physiology online assignment, review sheets for each unit, and links to the Mastering A&P Online Assignments.", "Emails can be received 24 hours per day.", "Students should carefully consider the wisdom of missing a test or assignment.", "Mastering A&P assignments handed in late will receive a deduction of 5%/day for the first five late days after which a grade of zero (0) will be recorded.", "Notice of Recording", "Don’t waste your time with these requests!", "Expectations for Change", "This course includes the independent development and practice of specific skills, such as multiple choice question creation.", "Library for research-based assignments", "Disability-related Policies"]}, {"course_id": 53, "course_code": "BIOL 308", "course_name": "BIOL308 - Principles of Molecular Biology (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Principles of Molecular Biology Spring 2024", "Prokaryote and eukaryote genome structure and replication; mechanisms of gene expression and regulation.", "BIOL 308 is recommended for those wishing a general understanding in molecular biology.", "Identify and explain the basic structure and function of DNA and RNA and proteins", "Illustrate prokaryotic and eukaryotic genome organization (or structure), replication and repair", "Explain mechanisms of gene expression and illustrate different levels of its regulation", "Introduction – approach to molecular biology and history", "functions of DNA; Central Dogma of molecular biology", "Eukaryotic chromatin structure", "Cell cycle and cell division", "DNA replication machinery (general)", "initiation of replication", "prokaryotic and eukaryotic replication machineries", "DNA repair mechanisms", "DNA Recombination and DNA rearrangements", "use of DNA repair mechanisms", "How/why do we asses transcription rate and level of gene expression", "How do we look for the transcription start site and why", "Nucleic acid – protein interactions and their importance", "E. coli polymerase and its promoters", "regulation of the lac, ara and trp operons", "regulation of transcriptional initiation", "prokaryotic DNA binding proteins", "molecular mechanisms of eukaryotic initiation of transcription", "RNA processing and post-transcriptional control of gene expression", "termination of prokaryotic transcripts and attenuation", "splicing of primary transcripts", "capping and polyadenylation", "post-transcriptional control of gene expression", "general overview of translation (include codons and tRNA)", "translation initiation", "chain elongation and termination", "post-translational modification", "Specific readings from the text will not be identified – it is expected that students can determine appropriate chapters for study, since textbook chapter titles closely follow the course outline.", "Other good molecular biology books:  Cell and Molecular Biology by Karp 9th ed, 2019 (Biol 130 textbook)", "Concepts Pre-test*  Not Graded", "The questions asked should be \"core knowledge\" to someone with the necessary background to do well in Biol 308 Principles of Molecular Biology, so your score should be a signal to you about how well prepared you are for this course.", "Those who score below 50% should seriously consider reviewing basic Genetics and Cell Biology concepts to avoid falling behind in Biol 308 lectures.", "Your mark on the pre-test WILL NOT be a part of your final course grade."]}, {"course_id": 54, "course_code": "BIOL 373", "course_name": "BIOL373 - Principles of Human Physiology 2 (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Heidi Engelhardt", "The physiology of major organ systems of the human body.", "Topics include the central nervous system, the sense organs, the digestive system, the endocrine system, the reproductive system, and the excretory system.", "View requirements for BIOL 373", "This course explores the physiology of several major organ systems of the human body.", "Topics include the central nervous system, sensory physiology, endocrine regulatory mechanisms, renal function, digestion, the endocrine control of metabolism and growth, and reproduction.", "The combination of BIOL 273 and BIOL 373 covers all the major physiological systems.", "The course is designed for students with a basic understanding of the structures of the biologically relevant macromolecules and cell biology (as provided by the BIOL 130 prerequisite).", "Fundamental concepts of cell-cell communication, synaptic transmission and homeostasis from BIOL 273 will also be assumed, and reviewed only briefly.", "Unit quizzes and 'teach-a-classmate' assignments are online (in Learn and Kritik, respectively).", "These sessions will not be recorded.", "identify the functional anatomy and microanatomy", "explain the processes that these systems carry out", "describe how these systems are regulated", "explain how these systems interact to mediate reflexes and maintain homeostasis of physiological parameters including blood pressure, volume, osmolarity, glucose and potassium concentrations", "communicate selected course concepts orally, via 5 minute recorded 'teach-a-classmate' assignments", "Negative & positive feedback", "Expectations in a blended model", "Unit 2 - Central Nervous System", "Developmental aspects, Organization; Blood-brain barrier; Spinal cord, brain", "Unit 3a - Sensory Physiology", "General properties of sensory systems, Somatic senses", "Unit 3b - Special Senses", "Chemoreception - smell and taste; Hearing and equilibrium, Vision", "Unit 3b - Special senses", "Anatomy, Overview of kidney function - Filtration, Reabsorption, Secretion", "Pre-midterm Q & A", "Unit 4cd - Fluid and Electrolyte Homeostasis", "Water balance, homeostasis of Na+, K+; Regulation of ECF volume and osmolarity; Acid-base balance", "Unit 4cd - begins", "Unit 5 - Endocrine Regulatory Systems  Unit 4cd - continued Kritik #4 (Unit 4cd topics)", "Unit 6a - Gastrointestinal Function", "Motility & Secretion; Digestion & Absorption", "Unit 6b - Regulation of GI Function Pre-midterm Q & A", "Unit 7 - Energy balance and metabolism, Fed- and Fasted-states", "Endocrine control of metabolism", "Notifications can be set for this platform so that you can get a digest by email, at the interval you choose.", "Email:", "All exams will be multiple choice format, written in-person.", "Closing times are indicated in the Course Schedule and in the Tasks page for each unit (in Content).", "Teach-a-Classmate (Kritik) assignments:", "Be smart and plan to submit ALL assignments in case you become ill or hit with a personal disaster during the term.", "Library for research-based assignments"]}, {"course_id": 55, "course_code": "BIOL 373L", "course_name": "BIOL373L - Human Physiology Laboratory (0.25)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Mohammad Moradi                      m5moradi@uwaterloo.ca", "Section 2- Monday Evening-630pm-920pm", "TBA", "Ally Miners                                     adminers@uwaterloo.ca", "Ally Miners                                     adminers@uwaterloo.ca", "Mohammad Moradi                      m5moradi@uwaterloo.ca", "Laboratory exercises to study the principles of human physiology.", "The laboratory exercises in this course are designed to illustrate the physiological principles described in Biology 273 and Biology 373 lecture courses.", "In this course, you will have the opportunity to gain first-hand experience conducting and creating experiments in human physiology.", "Lab 1: A) To investigate some properties of the special senses and the somatic senses B) To elicit some reflexes C) To illustrate fine motor control", "Lab 2: A) To record a human nerve reflex impulse, and to determine its speed", "Lab 3: A) To measure and investigate the activity of the medial and lateral rectus muscles during eye movement (saccades, pursuit, vestibular ocular reflex and vergence)", "The investigation of heart sounds and their correlation to cardiac cycle events B) The determination of blood pressure under resting and exercising conditions C) The observation of an electrocardiogram (ECG) under resting and exercising conditions D)", "The investigation of the induction of bradycardia by facial immersion E)", "The study of some aspects of circulation", "Lab 7: A) To begin the development of a physiology lab exercise with lab partners", "Lab #7:    Mar 3-7                Physiology Experimental Design I", "Lab #8:    Mar 10-14          Physiology Experimental Design II", "Mar 24-28          Reserved for make-up labs if needed", "The marking scheme for reports can be found at the end of the lab manual (see page 107).", "For a description of your responsibilities in preparing written reports and the rules concerning academic misconduct, please see p. 108", "There will be TWO Turnitin® Dropboxes: a DRAFT Dropbox and a FINAL SUBMISSION Dropbox for each of the lab reports required in this course.", "Lab reports can be submitted for a draft review for Turnitin® in the DRAFT Dropbox.", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as working in a lab and writing lab reports.", "Library for research-based assignments"]}, {"course_id": 56, "course_code": "BIOL 382", "course_name": "BIOL382 - Computational Modelling of Cellular Systems (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Computational Modelling of Cellular Systems Winter 2024", "08:30AM - 09:50AM MC 4061", "B. Ingalls", "An introduction to dynamic mathematical modeling of cellular processes.", "The emphasis is on using computational tools to investigate differential equation-based models.", "This course provides an introduction to dynamic mathematical modeling of cellular processes.", "The emphasis will be on using computational tools to investigate models of cellular phenomena.", "The course then addresses models in four biological domains: metabolic networks, signal transduction pathways, gene regulatory networks and electrophysiology.", "Intended Audience: Third and fourth year students interested in dynamic modelling in molecular cell biology.", "Software: We will be making heavy use of packages for numerical simulation of differential equations.", "Appendix C of the course notes consists of tutorials on MATLAB and XPPAUT, which is a GUI-based package for dynamical systems analysis.", "Design and simulate ordinary differential equation models of chemical reaction networks", "Investigate differential equation models using phase plane analysis, sensitivity analysis, and bifurcation analysis", "Develop and interpret differential equation models of biomolecular networks in the context of cellular metabolism, signal transduction, gene regulation, and electrophysiology", "Design and simulate stochastic models of gene regulatory networks", "Provide critical analysis of kinetic models of intracellular networks in the scientific literature and communicate their potential and limitations", "Kinetic Modelling of Biochemical Networks", "Module 3. Dynamics and Stability", "Mathematical Modeling of Systems Biology posted: https://www.math.uwaterloo.ca/~bingalls/MMSB/ Yes", "Term project will be completed in groups of two.", "Oral presentations will be in person during 20-minute time-slots scheduled during the last week of lectures (45% of project grade)", "Notice of Recording"]}, {"course_id": 57, "course_code": "CHEM 267", "course_name": "CHEM267 - Basic Organic Chemistry 2 (0.50)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["A continuation of the concepts of CHEM266, including material on amines, aromatics, enols and enolates, and nucleophilic addition and substitution at the carbonyl group.", "Introduction to nuclear magnetic resonance and infrared spectroscopy.", "CHEM 267 is a continuation of the study of fundamental aspects of organic chemistry begun in CHEM 266.", "The emphasis of the course is on the development of problem solving skills in the context of reaction mechanisms, structure-reactivity relationships and structure elucidation.", "The course will require you to understand why some molecular features lead to certain reactivity patterns and use that knowledge to make sound predictions in different but related systems.", "Topics include a description of chemical and physical properties of carbonyl, aromatic, and nitrogen compounds and an introduction to spectroscopic methods for the identification of organic molecules.", "Identify reagents and reaction conditions for the preparation of simple organic molecules.", "Explain synthetic pathways and devise simple synthetic strategies for the preparation of organic compounds", "Analyze IR and NMR spectra to identify simple organic compounds", "Introduction", "Conjugated p systems", "Reaction of Aromatic compounds", "Reaction of Aromatic compounds", "- Amines", "- Reaction of Aromatic compounds - Amines", "- Aldehydes and ketones", "CH 21.4.6 & 21.4.7", "Aldehydes and ketones", "Condensations and Alpha Substitutions of Carbonyl Compounds", "Condensations and Alpha Substitutions of Carbonyl Compounds", "- Condensation", "- Amines", "When you sign into the Textbook, you will see the chapter models in the left window.", "Purchase online or entering an access code purchased at your campus bookstore**", "Solving problems–making connections–and recognizing patterns are key steps to succeeding in this Course.", "Drop one midterm", "(closed-book)", "Comprehensive Final Examination: There will be a 2.5-hour exam held during the exam period and scheduled by the Registrar's Office.", "The final is a closed-book exam.", "If you become ill while away from the University and miss a test or an exam as a result of that illness, then you may supply a Doctor’s certificate covering the precise period of absence, provided the certificate includes a classification of the illness as slight, moderate, or severe.", "Students should carefully consider the wisdom of missing a test or exam."]}, {"course_id": 58, "course_code": "CHEM 267L", "course_name": "CHEM267L - Organic Chemistry Laboratory (0.25)", "term_name": "Elective Courses", "program_name": "Biological and Medical Physics", "program_id": 14, "major_id": 1, "major_name": "Biological and Medical Physics (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Answers can be expected within 24 hours.", "Experiments include the reduction of vanillin; an electrophilic aromatic substitution; the synthesis of a fragrant ester using Fischer esterification and preparation of a fluorescent laser dye, 3-acetyl-7-(diethylamino)-2H-1-benzopyran-2-one.", "The organic chemistry laboratory provides students with opportunities to carry out some of the organic synthesis reactions encountered in CHEM 267 in a real-world experience.", "Additionally, students will become versed in several basic organic chemistry laboratory techniques including: liquid-liquid extraction, distillation, one and two solvent recrystallization and melting point determination, to name a few.", "Be proficient with basic organic laboratory techniques including selecting proper glassware, measuring small and large quantities of solids and liquids, designing the setup required for simple synthetic reactions, filtration, and basic characterization.", "Understand and be able to design and execute a liquid-liquid extraction processes for the separation of ionizable acidic, ionizable basic, and non-ionizable (neutral) substances.", "Scheduling issues", "Fillable form online for Möbius support", "Laboratory performance marks will be given by the Teaching Assistants and Lab Instructor and averaged for each in-person lab period.", "To receive 10/10 in performance this term you must show self-sufficiency by either replacing empty acetone bottles at the sink, refilling the DI water, letting your TA know the bottles at your workstation need a top-up and cleaning shared areas beyond your own.", "This is not directly the case; we do expect students to need a lot of clarifications when working in the lab for the first time.", "Laboratory Worksheets and Reports", "General Policies", "Aside from LEARN, we will use various software to facilitate the delivery of the laboratory.", "Important note: Since the manual is printed months before delivery of the lab, we may need to make corrections during the term."]}, {"course_id": 0, "course_code": "BIOL 110", "course_name": "BIOL110 - Biodiversity, Biomes, and Evolution (0.50)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Labs begin the week of **Sept. 9**", "(Any issues in laboratory should contact Dr. Wolff)", "Monitor LEARN for important information", "A survey of organisms that inhabit a range of aquatic and terrestrial ecosystems (e.g., coral reefs, lakes, forests).", "Evolutionary and ecological frameworks will be used to explore how organisms diversify and are considered distinct species.", "The laboratory for this course is integrated with the lecture (unlike some of your other first year courses) - you will need to be sure to read the lab exercises before attending, and come prepared for our outdoor labs where appropriate shoes and clothing are necessary for the weather.", "I teach courses in ecology, evolution and genetics.", "I have been teaching evolution and ecology at the University of Waterloo for 7 years, and I hope to share with students my enthusiasm for phylogenetics.", "List themes and characteristics that differentiate the major groups of eukaryotes.", "Identify specific animals that facilitate and/or endanger human society.", "Construct and evaluate phylogenetic trees using parsimony", "Introduction", "Phylogeny and the modern view of biological relatedness", "Ecosystems and Resource Flux", "**Oct. 28  Midterm**", "Concepts in Diversity", "Activities will include using microscopes and drawing what you see, dissections of preserved animals, and collecting benthic invertebrates from the local stream and identifying them using pictoral keys.", "Note: You can also choose to do neither and forego the bonus mark altogether, as this is voluntary.", "Participation in Research Study", "Reminder, as participation in this study is voluntary, and it is a bonus mark, students may also decide to not do either activity and forego the bonus mark altogether.", "Notice of Recording", "In the case of an unwritten final exam, your course mark will be entered as DNW (32% for calculation of overall average)."]}, {"course_id": 1, "course_code": "BIOL 130", "course_name": "BIOL130 - Introductory Cell Biology (0.50)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "An introduction to the concepts of cell biology with emphasis on (1) the structural organization of the cell and (2) the function of critical molecular processes that are characteristic of living organisms.", "Explain the fundamental elements of cells, the chemistry of life, and the major classes of biological macromolecules.", "Describe metabolism, the role of enzymes in chemical reactions, and how cells can capture, and utilize, energy.", "Explain how cells respond to signals and form cellular communities.", "Module 1 - Introduction to Cell Biology & The Cell Theory", "Module 2 - Molecules of Life", "2 Module 3 - Cells and Membranes  In-class case study", "3 Module 4 - Nucleic Acids & Information Flow", "4 Module 5 - Protein Structure, Function & Synthesis  In-class case study", "6 Module 7 - Cellular Respiration In-class case study", "In-class case study", "9 Module 9 - Cell Signalling", "10 Module 10 - Cell & Tissue Form", "and In-class case study", "11 Module 11 - DNA Replication & Cell Division Case study due", "12 Module 11 - DNA Replication & Cell Division  Term Test 1", "Official Grades and Course Access", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each module for the achieve assignments and term tests.", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines", "Library for research-based assignments"]}, {"course_id": 2, "course_code": "BIOL 130L", "course_name": "BIOL130L - Cell Biology Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "STC 4018", "02:30PM - 05:20PM", "STC 4018", "However, we do run multiple labs at the same time which means we may not always be in the office.", "Situation", "Please email Dr. Gurska directly at jola.gurska@uwaterloo.ca", "What does it mean to be a cell biologist?", "One group of scientists might explore growing tissues in a laboratory to one day produce artificial skin or organs.", "No matter what their question, cell biologists use a similar set of laboratory skills that allow them to peek inside the tiniest of biological units that make up the diversity of organisms we see around us.", "Although fundamental techniques like microscopy have hugely advanced since the invention of the light microscope, every cell biologist needs to learn how to properly use a microscope to see cells reliably.", "These can be very tricky to use properly but doing so could be the difference between a world-changing discovery and an experiment that no one can replicate.", "These and other methods that are integral to working in the cell biology field will be introduced in this laboratory and it is my hope that you will leave confident in these fundamental techniques.", "Maintain a well-organized and comprehensive lab book.", "Identify elements of a well-structured laboratory report and write some elements of a lab report.", "Assignment 3 Model Organisms and Experimental Design 3%", "I welcome any inquiries regarding AccessAbility accommodations.", "Some examples of what will be noted includes the following:", "did you complete the bioskills exercises during the first lab?", "did you behave in a respectful and professional manner in the lab?", "Using a micropipette without a tip,", "Holding a micropipette upside down with liquid in the micropipette tip,", "Setting a micropipette precariously close to the edge of the bench so that it may fall on the floor,", "Forcing the pipettes past their minimum and maximum calibrated ranges", "Keeping a thorough lab book is a critical skill learned in a biology laboratory to document key observations and procedures.", "Some reagents will already be set up to use at your bench, while others will be in dispensing bottles on the side bench or in the fume hoods, in which case the liquid must be dispensed directly from the bottles.", "These can be purchased at the W Store Essentials in the STC.", "Since many standard laboratory reagents are volatile, please consider not wearing contact lenses in the laboratory.", "When not in use, stools should be tucked away under-bench and personal items stowed underneath in cupboards.", "Finally, please remember that safety should be a collective concern.", "They will be reviewed at the end of the term for statistical purposes only.", "The goal of the draft submissions is to teach you the capabilities of Turn-it-in analysis and to encourage you to use the software to improve your paraphrasing and referencing.", "Details on how to interpret Turn-it-in reports and use the draft Dropboxes can be found under Content on LEARN.", "As outlined under Quizzes section above, please note that the BIOL 130L online multiple-choice quizzes are designed to be completed in half the time you are given.", "Expectation of Academic Integrity", "This course includes the independent development and practice of specific skills, such as scientific writing and communication.", "Poorly paraphrased information without in-text citation 5 marks off for each", "Poorly paraphrased information with in-text citation 3 marks off for each", "Well paraphrased information without in-text citation 3 marks off for each", "Lab Manual is cited in Results and/or Discussion 1 mark off for each citation", "A reference in the reference list does not have corresponding in-text citations 5 marks off for each", "An in-text citation is not in the reference list 5 marks off for each", "Misconduct; student’s name will be sent to the Associate Dean to check if this is the first misconduct"]}, {"course_id": 3, "course_code": "BIOL 239", "course_name": "BIOL239 - Genetics (0.50)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["11:30AM - 12:20PM", "10:30AM - 11:20AM STC 1012", "You can!", "Chromosomal mechanisms in mitosis and meiosis.", "Natural selection and the evolution of genetic systems.", "Describe the fundamentals of gene structure, function and transmission in prokaryotic and eukaryotic cells and organisms.", "Describe the various ways mutations can arise and how mutations may affect gene expression and phenotypic outcomes.", "Describe recombinant DNA technology in bacteria and its role in biotechnology.", "Effectively work with others, discussing, evaluating, and communicating genetics concepts and synthesizing ideas in a group.", "Readings", "textbook 1.1-1.2", "Mendelian genetics and probability", "Modification of Mendelian ratios", "textbook 3.2-3.3, 4.2-4.4, 15.1", "Mitosis, meiosis, and chromosome numbers", "DNA and the genetic code", "textbook 9.2-9.3", "T4: Mitosis and meiosis", "DNA cloning", "T5: Testing genetic ratios", "Cancer genetics", "T9: Population genetics", "Exam period", "- write the final exam and achieve a grade of at least 50% on the cumulative test and exam section", "Online learning activities: These activities are designed to test your knowledge of several important concepts explained by the lecture presentations in this course, and should be completed after the portion of the course when they are covered in lecture.", "They are all due toward the end of the term but can be completed as many times as you like to help you work on these concepts.", "Read the instructions carefully before attempting these as a completion quiz (in the quiz section) must also be completed to obtain credit.", "In this case, the weight of the missed submission will be transferred to the final exam.", "The dates affected and degree of incapacitation will be used to determine follow-up action."]}, {"course_id": 4, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}, {"course_id": 5, "course_code": "BIOL 240L", "course_name": "BIOL240L - Microbiology Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["BIOL 240L", "BIOL 240L 001", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 002", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 003", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 005", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 006", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 007", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 008", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 010", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 012", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 013", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 014", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 015", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 017", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 018", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 021", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "Email: cduxbury@uwaterloo.ca", "View requirements for BIOL 240L", "Main Objective Obtain a a good understanding of the basic techniques used in a microbiology lab to study and handle microorganisms safely.", "Apply staining techniques to differentiate and observe types of bacteria", "Appreciate proper aseptic technique while handling microorganisms in the lab and inoculating media", "Properly prepare slides for examination under the microscope", "Prepare and use dilutions to isolate pure cultures and to enumerate the number of organisms in a culture", "Exp 3: Basic Bacterial Shapes", "Exp 12: Pour-Plate Method", "Exp 14: Aseptic Technique in Pipette Handling", "Exp 15: Standard Plate Count Method", "Exp 17: Bacterial Flagella Stain", "Exp 19: Miniprep of Plasmid DNA", "Exp 20: Analysis of Plasmid and Genomic DNA", "Exp 21: Metabolic Activities of Bacteria", "Exp 30: Evaluation of Chemical Antimicrobial Agents", "Exp 31: Antibiotic Sensitivity Testing", "Exp 32: Isolation of Bacterial Mutants", "TBA", "Extra precautions must be taken to ensure the safety of yourself and those around us!", "Always be prepared for a quiz; they could be given at any time and they are cumulative!", "To make this happen, a flowchart for each experiment is required.", "The flowchart is similar to a \"map\" of your experiment and should be sufficiently detailed and include the most important information about the experimental steps and possible time management.", "The flowchart should NOT be a reiteration of the \"METHODS\" section in your manual.", "Please see Flowchart Help Sheet for a flowchart example.", "Your professionalism mark will be assigned by your TAs and will be assessed on the basis of your performance in the laboratory, attendance, and your degree of skill in microbiological techniques.", "More information will be given closer to date.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 6, "course_code": "BIOL 273", "course_name": "BIOL273 - Principles of Human Physiology 1 (0.50)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM M3 1006", "M. Bording-Jorgensen", "Dr. Vivian Dayeh - Tuesdays 11:30 am -12:30pm in B1-277.", "The physiology of major organ systems of the human body.", "Topics include neurophysiology and peripheral nervous system, muscle, the cardiovascular system, the components of blood, respiratory system, and immune system.", "The combination of BIOL273 and BIOL373 covers all of the major topics of human physiology.", "Identify the components/structures of the following organ systems: nervous, muscular, cardiovascular, respiratory, and immune.", "Describe how these five organ systems are organized in the human body.", "Explain the function of each of these five organ systems.", "Demonstrate the integration of these five organ systems in maintaining homeostasis.", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Official Grades and Course Access", "Corresponding Silverthorn textbook chapters in parentheses for each unit.", "This unit serves as an introduction to the study of the function of the five organ systems examined in this course (nervous, muscular, cardiovascular, respiratory, and immune).", "Unit 1 will introduce how the organ systems work together to maintain homeostasis within the body.", "The organization of the nervous system will be explored in this unit.", "The types of cells found in the central and peripheral nervous system serve as a starting point to discuss their function within the nervous system.", "Initially gross structure of skeletal muscle including the structure of a muscle fibre and myofibrils will be examined.", "An exploration into the muscle contraction mechanism via excitation-contraction coupling will be examined to explain how muscles work.", "This unit will start with an introduction into the heart and components of the cardiovascular system, which will be followed by cardiac muscle contraction mechanism.", "In this unit we will examine the structure and function of the respiratory system, incorporating gas laws and ventilation.", "Pulmonary function through lung compliance and elastance as well as the control of ventilation will be examined.", "This unit will start with the general function of immune system and introduction to the types of pathogens that infect the body.", "The anatomy of the immune system will be discussed returning to the role of haematopoiesis.", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each unit for the assignments and term tests.", "Required for the Mastering A&P Online Assignments and Dynamic Study Modules.", "Course website Waterloo Learn https://learn.uwaterloo.ca - includes general course information, language of physiology online assignment, review sheets for each unit, and links to the Mastering A&P Online Assignments.", "Emails can be received 24 hours per day.", "Students should carefully consider the wisdom of missing a test or assignment.", "Mastering A&P assignments handed in late will receive a deduction of 5%/day for the first five late days after which a grade of zero (0) will be recorded.", "Notice of Recording", "Don’t waste your time with these requests!", "Expectations for Change", "This course includes the independent development and practice of specific skills, such as multiple choice question creation.", "Library for research-based assignments", "Disability-related Policies"]}, {"course_id": 7, "course_code": "BIOL 308", "course_name": "BIOL308 - Principles of Molecular Biology (0.50)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["Principles of Molecular Biology Spring 2024", "Prokaryote and eukaryote genome structure and replication; mechanisms of gene expression and regulation.", "BIOL 308 is recommended for those wishing a general understanding in molecular biology.", "Identify and explain the basic structure and function of DNA and RNA and proteins", "Illustrate prokaryotic and eukaryotic genome organization (or structure), replication and repair", "Explain mechanisms of gene expression and illustrate different levels of its regulation", "Introduction – approach to molecular biology and history", "functions of DNA; Central Dogma of molecular biology", "Eukaryotic chromatin structure", "Cell cycle and cell division", "DNA replication machinery (general)", "initiation of replication", "prokaryotic and eukaryotic replication machineries", "DNA repair mechanisms", "DNA Recombination and DNA rearrangements", "use of DNA repair mechanisms", "How/why do we asses transcription rate and level of gene expression", "How do we look for the transcription start site and why", "Nucleic acid – protein interactions and their importance", "E. coli polymerase and its promoters", "regulation of the lac, ara and trp operons", "regulation of transcriptional initiation", "prokaryotic DNA binding proteins", "molecular mechanisms of eukaryotic initiation of transcription", "RNA processing and post-transcriptional control of gene expression", "termination of prokaryotic transcripts and attenuation", "splicing of primary transcripts", "capping and polyadenylation", "post-transcriptional control of gene expression", "general overview of translation (include codons and tRNA)", "translation initiation", "chain elongation and termination", "post-translational modification", "Specific readings from the text will not be identified – it is expected that students can determine appropriate chapters for study, since textbook chapter titles closely follow the course outline.", "Other good molecular biology books:  Cell and Molecular Biology by Karp 9th ed, 2019 (Biol 130 textbook)", "Concepts Pre-test*  Not Graded", "The questions asked should be \"core knowledge\" to someone with the necessary background to do well in Biol 308 Principles of Molecular Biology, so your score should be a signal to you about how well prepared you are for this course.", "Those who score below 50% should seriously consider reviewing basic Genetics and Cell Biology concepts to avoid falling behind in Biol 308 lectures.", "Your mark on the pre-test WILL NOT be a part of your final course grade."]}, {"course_id": 8, "course_code": "BIOL 359", "course_name": "BIOL359 - Evolution 1: Mechanisms (0.50)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["A study of the processes of evolution; the differentiation of populations and the origin of new forms of life.", "Describe and explain the various agents of evolution", "Demonstrate how these processes may result in adaptation, speciation and extinction", "Analyze and interpret cases of evolution", "Apply evolutionary concepts of conservation biology", "Evidence for Evolution", "Natural Selection", "Variation", "Mendelian Genetics- selection and mutation", "Mendelian Genetics- gene flow, genetic drift and non-random mating", "Adaptation", "Evolution of Sex", "8.3", "Sexual Selection", "Evolution of Social Behavior", "Speciation"]}, {"course_id": 9, "course_code": "CHEM 120", "course_name": "CHEM120 - General Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["General Chemistry 1 Winter 2025", "RCH 101", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "The second part of this course is concerned with explaining periodicity and trends in chemical reactivity in terms of the electronic structure of atoms and molecules.", "Topics covered in this part of the course include the quantum theory of the hydrogen atom; electron configurations in multi-electron atoms; ionic and covalent bonding; Lewis structures, valence shell electron repulsion theory and molecular geometry; quantum mechanical bonding theories, including valence bond theory and molecular orbital theory.", "Additional topics may include an introduction to electron-transfer reactions, including the assignment of oxidation states and the balancing of oxidation-reduction reactions.", "assess the greenness of a chemical reaction using Atom Economy and E-Factor metrics.", "describe the electronic structure of atoms in terms of quantum theory using atomic orbitals and quantum numbers.", "justify the organization of the periodic table and predict trends in the properties of the elements.", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and explain molecular shape and stability in terms of electron count.", "describe the interactions of molecules in solids, liquids, and gases to compare physical and reactive properties.", "Course Structure and Continuity Plans", "No extensions will be granted for Participation Challenges, but each student can drop one participation challenge from their overall grade.", "Printed spiral bound copies of the course notes can be purchased online from the UW bookstore https://wstore.uwaterloo.ca/", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare pandemic-related illnesses on Quest (Information at this link)", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 10, "course_code": "CHEM 120L", "course_name": "CHEM120L - General Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 1 Fall 2024", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Be sure to record their name and contact information in your lab manual.", "Skillfully perform basic procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "1,3,5,7,9,11", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Sept 19 - 24", "1,3,5,7,9,11", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "1,3,5,7,9,11", "- studying cis and trans isomers", "Oct 24-29", "1,3,5,7,9,11", "Titration as an Analysis Tool", "- identify an unknown solid acid", "1,3,5,7,9,11", "Introduction to Chromatography", "- quantify a cation using ion exchange", "1,3,5,7,9,11", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 11, "course_code": "CHEM 123", "course_name": "CHEM123 - General Chemistry 2 (0.50)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["General Chemistry 2 Winter 2025", "09:30AM - 10:20AM STC 1012", "Introduction to chemical equilibria.", "Describe the energy and entropy changes that accompany physical and chemical changes.", "Calculate the equilibrium constant for a reaction using the standard thermodynamic properties of reactants and products.", "Predict the direction of spontaneous change for a given set of initial conditions for a variety of chemical systems.", "Apply equilibrium principles to a variety of chemical reaction types including gas-phase reactions, acid-base reactions, precipitation reactions, complexation reactions and redox reactions.", "Analyze oxidation-reduction reactions and identify species being oxidized and reduced.", "Explain the basic construction of, uses of, and the differences between galvanic and electrolytic cells.", "CHEM 120 and CHEM 123 comprise a full-year course in introductory chemistry.", "Course Structure and Continuity Plans", "Chemistry Study Hall:  Starting the 2nd week of classes, there will be a first-year study hall on Tuesdays and Thursdays at 5:30 pm - 6:50 pm in STC 1012.", "You can attend as many Study Hall Sessions as you would like - grab your friends and connect with your TAs!", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 12, "course_code": "CHEM 123L", "course_name": "CHEM123L - General Chemistry Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 2 Winter 2025", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- a real life analysis", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 13, "course_code": "CHEM 237", "course_name": "CHEM237 - Introductory Biochemistry (0.50)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:20AM", "RCH 101", "10:30AM - 11:20AM RCH 101", "ESC 227", "Structure and properties of proteins and enzymes.", "develop a molecular level understanding of biological processes to achieve this the following learning outcomes will be", "in both qualitative and quantitative examples", "evaluate unknown thermodynamic parameters from given values of others.", "I equilibrium constants from standard free energy changes.", "qualitatively describe the composition of solutions of a weak acid or base as a function of pH.", "calculate the precise", "recognize the 20 amino acids that are commonly found in proteins and identify compounds derived from them", "calculate the charge on an amino acid side chain as a function of pH", "know the 4 levels of protein structure and the covalent and non covalent interactions that stabilize them", "explain how to purify proteins using the physical and chemical properties of the proteins", "determine the primary sequence of a protein given the appropriate data", "understand basic chemical kinetics and the application to biological systems", "determine the mechanism of inhibition of an enzyme using", "the structure of fatty acids and membrane lipids", "the structures of cell membranes and how the fatty acid composition of those membranes affects membrane structure and fluidity", "the structure of simple sugars and polysaccharides and the chemistry of the reactions in which they participate", "Suggested supplementary reading in \"Biochemistry Free for All\".", "Biochemistry free for all: Introduction Water and Buffers, pages 34-49", "VVP chapters 3 and 4.1", "Biochemistry free for all pages 53-70", "Appendix A.1 and A.2", "Chapter 4.2 and 4.3", "Biochemistry free for all.", "pp 74-108", "Week 6  Protein folding and Introduction to hemoglobin", "Chapter 4 - Biochemistry in focus", "Biochemistry free for all pages 128-141", "first kinetics Chapter 10 then mechanisms Chapter 9", "Biochemistry free for all pages 337-362", "Biochemistry free for all pp 190-217", "Biochemistry free for all pp 222-233", "Biochemistry free for all pp 287 - 312", "Notice of Recording"]}, {"course_id": 14, "course_code": "CHEM 237L", "course_name": "CHEM237L - Introductory Biochemistry Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Natasha Evans", "ESC 238", "natasha.evans@uwaterloo.ca", "Introductions are planned during the first week.", "Dawson McLachlan a3mclachlan@uwaterloo.ca", "Ethan Piercey ekpiercey@uwaterloo.ca", "Lindsey Shivers lshivers@uwaterloo.ca", "Nicholas Williams n28williams@uwaterloo.ca", "Sean McDonald s24mcdonald@uwaterloo.ca", "Students will be guided through the process of collecting data and further proper analysis of it.", "The lab manual includes the experimental procedures, pre-lab exercises and reporting information, whereas the content on LEARN includes information related to the relative concepts being used, procedural videos and videos informing how to use the instruments in the lab.", "- Plan and recite proper biochemical techniques for (i) making biochemical solutions and (ii) separating, identifying and quantifying biochemical molecules in solution", "- Analyze and report findings from biochemistry data", "Date Experiments (for other half of the lab -Room 146-C-lockers)", "Clothing covering entirety of your legs Yes", "During your first week of labs you will be performing the first experiment of the term.", "It is preferred that you complete these quizzes PRIOR to the first week of experiments.", "In the case of a legitimate single missed laboratory period (confirmed by a VIF and approved by the instructor), the course weighting of the missed grade elements will be added to the final lab test.", "*", "Reports will be penalized a deduction of 20% for being one day late unless there is a valid reason; e.g., instructor-accepted valid VIF.", "Notice of Recording", "These meetings will be recorded and released to the students in the course.", "Students who wish to opt out of submitting electronic versions of their reports to Turnitin must notify the instructor at the beginning of the term."]}, {"course_id": 15, "course_code": "CHEM 266", "course_name": "CHEM266 - Basic Organic Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "11:30AM -", "Structure, nomenclature, and reactions of important classes of organic compounds.", "Stereochemistry and its role in reaction mechanisms.", "Name basic organic molecules", "Draw resonance structures and identify major and minor contributors", "Identify and describe the acidity and basicity of various molecules", "Draw organic molecules in three dimensions and identify the lowest and highest energy conformations", "Describe the stereochemical relationship between different molecules", "Explain chemical reactions using energy diagrams", "Understand the reactivity of a variety of molecules containing a variety of functional groups", "Molecular Modelling Kit No", "Notice of Recording"]}, {"course_id": 16, "course_code": "CHEM 266L", "course_name": "CHEM266L - Organic Chemistry Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["CHEM 266L", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "CHEM 266L 006", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Answers can be expected within 24 hours.", "Piazza is available for clarification questions but I will only provide quick answers as I prefer having longer conversations in person.", "View requirements for CHEM 266L", "Topics include acid-base chemistry, substitution reactions, Grignard reactions, liquid-liquid extraction, product isolation and purification.", "Be proficient with basic organic laboratory techniques including selecting proper glassware, measuring small and large quantities of solids and liquids, designing the setup required for simple synthetic reactions, filtration, and basic characterization.", "Understand and be able to design and execute a liquid-liquid extraction processes for the separation of ionizable acidic, ionizable basic, and non-ionizable (neutral) substances.", "Demonstrate independent thinking by answering questions in your own words, showing critical reflection beyond the initial description of observations and facts.", "Laboratory performance marks will be given by the Teaching Assistants and Lab Instructor and averaged for each in-person lab period.", "This is not directly the case; we do expect students to need a lot of clarifications when working in the lab for the first time.", "Laboratory Worksheets and Reports", "Questions similar to the pre-laboratory quizzes and reports will be used, but may be modified to be multiple choice.", "Human rights must be centered in our pedagogical practice to ensure students feel safe and respected into our instructional spaces.", "We also acknowledge that speaking of underrepresented groups in Science is a misnomer and we should speak of historically excluded persons as Black, Indigenous, Queer and Persons of Colour have contributed to chemical research since the inception of the field.", "Scheduling issues", "General Policies", "Aside from LEARN, we will use various software to facilitate the delivery of the laboratory.", "Important note: Since the manual is printed months before delivery of the lab, we may need to make corrections during the term.", "Expectation of Academic Integrity", "Be especially careful with sharing diagrams and mechanisms, as we often detect excessive collaboration when students share images.", "None-the-less all violations of academic misconduct will be dealt with be taken seriously and dealt with according to the consequences outlines in Policy 71."]}, {"course_id": 17, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 18, "course_code": "STAT 202", "course_name": "STAT202 - Introductory Statistics for Scientists (0.50)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["Introductory Statistics for Scientists Winter 2025", "R. Metzger", "R. Metzger", "jenny.tieu@uwaterloo.ca", "02:30PM - 03:20PM", "jenny.tieu@uwaterloo.ca", "R. Metzger", "02:30PM - 03:20PM", "PHY 313", "jenny.tieu@uwaterloo.ca", "R. Metzger", "Methods for data summary and presentation.", "Estimation, hypothesis testing, two-sample techniques and paired comparisons, regression, correlation.", "Evaluate the strengths and weaknesses of a simple sampling technique.", "Given a set of data:", "Build a simple linear model for a dataset.", "Perform simple statistical test to determine whether:", "A population mean and proportion differs from a particular value.", "A simple linear regression model parameter is significant.", "Probability Functions (PF) and Cumulative Distribution Functions (CDF):", "Differentiate between a Binomial and Poisson experiment.", "Define simple sample spaces and calculate simple probabilities.", "Calculate the sample mean and sample variance of a linear combination.", "Linear Relationships (Covariance and Correlation), Time Series, Scatterplots, Linear Regression", "Instructor(s) will go over a problem set.", "Regression analysis", "Sample design", "Poisson Distribution, Normal Distribution", "Instructor(s) will go over a problem set.", "Inference", "Instructor(s) will go over a problem set.", "Inference", "Inference", "- location TBD", "≥50", "No considerations are given for individual technical issues.", "This is a cumulative test that will cover the entire course.", "Late Tests will be given a zero mark.", "Note for your circumstance to be deemed valid you must have been incapacitated for a significant portion of the assessment window.", "A circumstance that incapacitates a student for a month or longer is unlikely to be accommodated – in such a case we ask that you please speak to your academic advisor and consider dropping the course.", "In the past some of the issues below have cropped up in my courses:", "Make sure you start online quizzes early, hand in assignments early, etc in case of unforeseen technical issues!", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 19, "course_code": "PHYS 111", "course_name": "PHYS111 - Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["An introduction to physics for students intending to concentrate their further studies in biology, dentistry, medicine and paramedicine; includes particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.", "The main physics principles and laws covered in PHYS 111 include: “Particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.”", "PHYS 111 focuses on basic physics principles and laws, on conceptual understanding and problem-solving skills, and an appreciation for the power of physics in explaining how nature works, in the contexts of both the physical and life sciences.", "Physics Principles and Laws: By the end of the course, students will be able to construct scientifically sound explanations of a variety of basic physical phenomena by applying basic physics principles/laws.", "define linear momentum, and calculate and compare momenta of various real-life objects;", "define and calculate impulse, and establish the conditions for conservation of linear momentum; and", "apply the laws of conservation of momentum and energy to collisions.", "Problem-Solving Skills and Strategies: By the end of the course, students will be able to creatively apply a variety of structured problem-solving strategies:", "interpret, visualize and convert the problem into a physical model (e.g., draw a free body diagram);", "evaluate the result — does it make sense?", "These problem-solving skills are useful in the students’ own disciplines and beyond.", "More detailed information about the course elements which contribute to the final grade will be given in the learn sight and in future outline updates", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 20, "course_code": "PHYS 121", "course_name": "PHYS121 - Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["An introductory course in physics for students intending to concentrate their future studies in the physical sciences, optometry, or mathematics; includes vectors (dot and cross products), particle kinematics and dynamics, forces in nature, work and energy, conservation of energy and linear momentum, rotational kinematics and dynamics, and conservation of angular momentum.", "Doing Physics - quantities, dimensions, units", "Point Dynamics - force, motion, Newton's laws", "Conservation of Energy - work and energy, conservative systems", "Conservation of linear Momentum - momentum and systems of particles", "Understand the following concepts:", "- Linear kinematics: the relationship between distance, velocity and acceleration.", "- Linear dynamics: a consequence of forces and momentum, and how they interrelate.", "- Kinetic energy, potential energy, work, and their interrelationships.", "We will also re-examine these concepts in a rotating coordinate frame using angular kinematic variables along with torque and angular momentum.", "6 Module 06:  Kinetic and Potential Energy", "7 Module 06:  Kinetic and Potential Energy", "8 Module 07:  Linear Momentum", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- eText + Student Access Code", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- Print Format + Student Access Code"]}, {"course_id": 22, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Biology", "program_id": 15, "major_id": 1, "major_name": "Biology (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 0, "course_code": "BME 101", "course_name": "BME101 - Communications in Biomedical Engineering-Written and Oral (0.25)", "term_name": "1A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Communications in Biomedical Engineering-Written and Oral Fall 2024", "08:30AM - 10:20AM DWE 3519", "kate.mercer@uwaterloo.ca", "kate.mercer@uwaterloo.ca", "08:30AM - 10:20AM E5 6004", "kate.mercer@uwaterloo.ca", "Email: kmercer@uwaterloo.ca", "This course introduces first-year students to biomedical engineering with a focus on the engineering profession and technical communication skills.", "Through in-class and independent activities leading to formative and summative assessments, students will consider and reflect on communication intention, audience, content, medium, format, and tone to demonstrate and improve upon their listening, written and oral communication skills for academic, engineering, and professional context.", "(1) Use reliable sources of information and use it to fill in knowledge gaps", "(4) Distinguish ethical and equitable vs. unethical and inequitable situations applied in the engineering profession", "ILO", "Course Introduction", "Misinformation", "Talking to Stakeholders", "Report Writing Introduction", "Email a Professor", "Ways of Knowing", "TBD", "Guest Lecturers: Naomi Paul & Leslie Wexler", "Engineering Standards", "Abstracts & Summaries", "Communicating Complex Information", "Interdisciplinary communication", "Ethics & Professionalism", "So you think you know how to make a sandwich?    1.", "Design Showcase 2 - Report Due: December 3 by 11:59 E.T.", "Partnering with our colleagues in the Centre for Career Action and the department of Co-operative Education, Co-op Fundamentals for Engineering (CFE) has been designed as a suite of co-op supports just for Engineering students.", "Your active participation in CFE activities has the potential to make a real impact on your first co-op experience.", "This is a degree milestone", "Notice of Recording", "Sign your email with your first and last name and your student number.", "Any in-person deliverables (e.g., design presentations) will be delayed on a case-by-case basis.", "There could be a need to make alternate arrangements for in-person course activities.", "This alternate arrangement could be for a short period of time (e.g., one week) or a more sustained disruption to in-person course activities.", "Impacted in-person deliverables (e.g., team presentations) will be handled on a case-by-case basis with notification provided as soon as possible.", "If there is a sustained disruption to in-person course activities there will be modifications to allow for virtual completion and any association submission instructions will be revised to align with these changes.", "They will review your case and coordinate a reasonable and fair plan in consultation with appropriate others.", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.", "A.A.S. also offers learning strategy supports to all students that can be accessed through:", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 1, "course_code": "BME 101L", "course_name": "BME101L - Communications in Biomedical Engineering-Visualization (0.25)", "term_name": "1A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Communications in Biomedical Engineering-Visualization Fall 2024", "This laboratory course introduces students to visual communication methods relevant to engineering analysis and design.", "Through in-class and independent activities leading to formative and summative assessments, students will consider and reflect on communication intention, audience, content, medium, format, and level of detail to demonstrate and improve upon their skills in graphing, freehand sketching, technical drawing, and computer-aided design (CAD).", "(1) Create technical drawings of objects using hand-sketching", "(3) Create solid models and assemblies using CAD tools", "(6) Apply appropriate graphical techniques to develop a design solution within a set of constraints (4)", "(7) Communicate information graphically from initial ideation through prototype fabrication and documentation for a potential end-user (7b,c)", "1c Demonstrate understanding of engineering fundamentals 1, 2", "4 Design: Compare, generate and refine solutions; Refine, validate, and communicate solution 6", "13-Sep Introduction to Solid Modeling (Part: Hello World) 3 CAD/Solid modelling", "11-Oct Solid Modeling - Global Variables and Assembly  3 CAD/Solid modelling", "Discussion of Test", "18-Nov Sprint 4 - Data analysis and plotting 5 Data Plotting Software", "Knaflic, Cole Nussbaumer: “Storytelling with data: a data visualization guide for business professionals” (available online from the UWaterloo library)", "A total of seven assignments will be given during the term and the value of each assignment varies, ranging from 4%-10% each.", "• 1% for concept sketches", "To start, each group will create sketches that communicate their concept.", "Test", "The most likely accommodation for a student with a valid reason for missing the test is writing a make-up test at a different time.", "Part of the final mark in BME101L will be based on the technical and style aspects of these design sketches.", "Evaluation", "Any group issues related to non-participating group members should be brought to the attention of the instructor as soon as possible.", "Notice of Recording", "Course and Departmental expectations", "Compassionate and respectful communication", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "SYDE-BME Compassionate Accommodation", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 2, "course_code": "BME 121", "course_name": "BME121 - Digital Computation (0.50)", "term_name": "1A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["First year tutor + TAs:", "Avraiem Iskandar", "Soomin Shin soomin.shin@uwaterloo.ca M 4:30-5:30", "The key skills necessary to develop software solutions to solve biomedical engineering problems.", "The topics will be reinforced in the context of practical biomedical software systems such as physiological monitoring systems and clinical support systems.", "Instruct computers to carry out operational tasks using the C++ language (CEAB Grad Attribute 1)", "Explain various syntax rules and data types in the C++ language (CEAB Grad Attribute 1)", "Demonstrate ability to perform both procedural programming and object-oriented programming (CEAB Grad Attribute 1)", "Formulate code solutions that invoke multiple syntax rules to solve biomedical engineering problems using a computer (CEAB Grad Attribute 4)", "Graduate Attribute Definition", "Knowledge Base Demonstrated competence in university-level mathematics natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "4. Design An ability to design solutions for complex, open-ended engineering problems and to design systems, components, or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, and economic, environmental, cultural, and societal considerations.", "Oct 2 - 8 I/O Streams, Arrays 6, 7 1, 2, 3, 4", "Separate compilation and Namespaces,", "Pointers and linked lists 11.3, 11.4,", "Problem Solving with C++, 10th edition; Savitch & Mock; Pearson ISBN 9780134448282 Yes", "Sept 24", "The purposes are: (i) for you to get a feel for what the final exam will be like, and, (ii) identify for yourself gaps you may have in your understanding of the material on which you can focus your prep for the final exam.", "Such software includes Turnitin, iThenticate and Moss."]}, {"course_id": 3, "course_code": "BME 161", "course_name": "BME161 - Introduction to Biomedical Design (0.50)", "term_name": "1A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Introduction to Biomedical Design Fall 2024", "Email: maud.gorbet@uwaterloo.ca", "Email: sormeh.mehri@uwaterloo.ca", "Email policy", "If your question or concern requires a complex answer or warrants a discussion, we may suggest a face-to-face meeting", "Topics related to biomedical design will be covered: multidisciplinary system design, design process, problem definition, life-cycle design, design specification, function analysis, design evaluation and decision-making, introduction to mechanical design, prototyping, experimentation, safety and responsibility in engineering design, design for society and environment, and design documentation.", "Knowledge Base - Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "Problem Analysis - An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "Investigation - An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "Design - An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, and economic, environmental, cultural and societal considerations.", "Communication Skills - An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the abilityto comprehend and write effectivereports and design documentation, and to give and effectively respond to clear instructions.", "Professionalism - An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Impact of Engineering - An ability to analyze social and environmental aspects of engineering activities.", "Such ability includes an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society, the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Lifelong Learning - An ability to identify and to address their own educational needs in a changing world in ways sufficient to maintain their competence and to allow them to contribute to the advancement of knowledge.", "Intro to BME and Engineering Design", "CATME Survey", "Design Case study", "Team Dynamics", "First team meeting & contract discussion", "Situation of concern & Statement", "SOC Chart", "Personas, Ethics & Standards", "Needs Sprint", "Problem - 1 Requirements & Constraints", "Define Sprint", "Needs & Define Sprints", "Specifications", "Define Sprint", "Functions & Means", "DHF", "Individual Design Activity 1", "** Thursday 11h30-12h20pm **", "Engineering Analysis", "Analysis Sprint", "Special Topic 1: Life Cycle Design", "Design Showcase 1 Report", "Modeling", "Life Cycle Design", "Tools for Prototyping", "Prototype and testing Sprint", "DHF", "Low/medium fidelity prototyping,", "Designing within the healthcare ecosystem -1  Designing within the healthcare ecosystem - 2", "Prototype and testing plan", "Design for X", "Failure and Risks in BME design", "Design Symposium – Final presentations  No class", "Design Showcase 2 – Report", "DHF", "DHF: Design History File/Team \"logbook\"", "J. Tranquillo, J. Goldberg, R. Allen, “Biomedical Engineering Design”, Elsevier, London, UK, 2023 An electronic version of this textbook is freely available in the library No", "Individual Design Activity 1 15 or 20% of course grade**", "***There are two large individual deliverables: Individual Design Activity 1 and Individual Design Activity 2.", "**", "Design Project Deliverables that do not include “Individual” in the title are team submissions related to the design project.", "Design Project Work", "Notice of Recording", "Laptops, Tablets, and Electronic Devices", "Any in-person deliverables (e.g., design presentations) will be delayed on a case-by-case basis.", "There could be a need to make alternate arrangements for in-person course activities.", "This alternate arrangement could be for a short period of time (e.g., one week) or a more sustained disruption to in-person course activities.", "Impacted in-person deliverables (e.g., team presentations) will be handled on a case-by-case basis with notification provided as soon as possible.", "If there is a sustained disruption to in-person course activities that occurs before the ‘Prototyping’ and ‘Testing’ workshop sessions, these workshops will be modified to allow for virtual completion and the associated Design Showcase 2 submission instructions will be revised to align with these changes.", "They will review your case and coordinate a reasonable and fair plan in consultation with appropriate others.", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate [", "A.A.S. also offers learning strategy supports to all students that can be accessed through:", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "They will review your case and coordinate a reasonable and fair plan in consultation with appropriate others (for example: instructors, Chair, AccessAbility Services, Engineering Counselling services, Registrar's Office)."]}, {"course_id": 4, "course_code": "BME 181", "course_name": "BME181 - Physics 1: Statics (0.50)", "term_name": "1A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "10:30AM - 11:20AM B1 271", "09:00AM - 09:50AM E5 6006", "10:30AM - 11:20AM B1 271", "09:00AM - 09:50AM E5 6004", "Associate Professor, Biomedical Engineering Program", "Systems Design Engineering", "E-mail: thomas.willett@uwaterloo.ca", "* If you require guidance outside of class, tutorials, and office hours, please email Prof. Willett.", "Introduction to the basic theory and principles of mechanics of static systems.", "Applications of mechanical principles to musculoskeletal systems will be presented.", "Basic concepts of mechanics, vectors.", "Analysis of trusses and frames.", "Distributed forces, centroids, and moments of inertia.", "Engineering mechanics involves the combination of physics and mathematics to develop models of physical world and solve problems in the physical world.", "In this course, you will acquire knowledge of the theory and principles of engineering mechanics of static systems and become proficient in problem solving in this area.", "You will acquire skills in analysing a problem, developing a plan to solve the problem including creating a mechanics-based model of the system, and proceeding to solve the problem with full understanding of the fundamentals and approach, not by memorization.", "Examples of the application of statics to mechanics of materials and musculoskeletal biomechanics will be discussed.", "A) Conduct vector mathematics operations (addition, subtraction, vector products)", "B) Calculate moments, centres of mass, and forces for particular structures.", "C) Describe position, forces, and moments in terms of vector in appropriate reference frames in two and three dimensions.", "E) Simplify systems of forces and moments to equivalent systems.", "F) Draw complete free-body diagrams and write appropriate equilibrium equations from the free-body diagram, including the support reactions on a structure.", "H) Determine the internal forces in a structure.", "a) Demonstrate understanding of concepts in mathematics A, B, C  All", "b) Demonstrate understanding of concepts in natural science B, C, D, E, F, G, H  All", "c) Demonstrate understanding of engineering fundamentals F, G, H, I  All", "a) Generate appropriate documentation to communicate within the profession and to society at large F, I, J  All", "CEAB Attribute Definitions", "Knowledge base for engineering: Demonstrate competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "2. Problem analysis: Demonstrate ability to use appropriate knowledge and skills to identify, formulate, analyse, and solve complex engineering problems in order to reach substantiated conclusions.", "7. Communication skills: Demonstrate ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Course Introduction during lecture period on Friday.", "Vector Math AC", "1/5 - 1/8", "Math and Forces ABC", "2/4-2/5", "2D Force Systems, Resultants, Moments, Couples ABCDEJ", "Equilibrium in 2D DEFGJ", "2/7-2/9", "2/7-2/9", "4/1-4/2", "Static Equilibrium in 3D, Conditions", "4/3", "4/4-4/5", "Methods of Joints", "Methods of Sections", "4/6", "4/6", "Distributed Forces, Centre of Mass,", "B", "5/6-5/7", "5/6-5/7", "6/1-6/3", "Fluid Statics", "Friction", "Design Dayz :-)   PS1", "14 December 2nd", "***NOTE:", "**", "Deliverables and Assessments:", "Each test will consist of one problem to test the competency of the student.", "The final exam will be held during the official examination period after the end of term.", "Notice of Recording", "To facilitate communication, we will use these three electronic means of communication: • Email • LEARN •", "Email:", "• Sign your email with your first and last name, and your student number.", "• Assume 24-48 hours for a response to your email.", "• Email should be used for brief questions that can be answered quickly.", "*", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "They will review your case and coordinate a reasonable and fair plan in consultation with appropriate others (for example: instructors, Chair, AccessAbility Services, Engineering Counselling services, Registrar's Office).", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, such as solving statics problems.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 5, "course_code": "SYDE 111", "course_name": "SYDE111 - Calculus 1 (0.50)", "term_name": "1A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["RCH 301", "RCH 301", "RCH 301", "02:30PM - 03:20PM", "02:30PM - 03:20PM", "10:30AM - 11:20AM RCH 105", "Simple numerical methods.", "Introduction to integration, indefinite and definite integral, techniques of integration.", "2. understand the key concepts of limit and derivative from a mathematically rigorous perspective (1a, 2a)", "a. Demonstrate understanding of concepts in mathematics", "2. Problem Analysis", "4 Sept. 23-27 limits of functions: precise definition, limit laws,", "6 Oct. 7-11 linear approximation; Newton’s method;  indeterminate forms;", "12 Nov. 25-29 fundamental theorem of calculus; areas; indefinite integrals;", "functions M9 7", "E-TEXT", "Roughly each week there will be a problem set posted for you to work on.", "There's also a built-in formula editor that ultimately pastes the LaTex code.", "These will typically be open for approximately a week with a deadline of Fridays at 11:59 p.m.", "Quizzes: There will be five quizzes which will be held during the TUT 101/102 time slots in the weeks indicated in the schedule above.", "Course Conduct: I am committed to creating a learning environment where diverse perspectives are recognized and valued as a source of strength.", "Phone: 519-884-0000 extension 213", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 6, "course_code": "SYDE 113", "course_name": "SYDE113 - Elementary Engineering Mathematics (0.25)", "term_name": "1A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Elementary Engineering Mathematics Fall 2024", "01:30PM - 03:20PM", "08:30AM - 10:20AM DWE 3522", "Email: chrystopher.nehaniv@uwaterloo.ca", "Mathematical notation and proof techniques.", "Introduction to numerical computation: binary and floating point numbers and arithmetic, accuracy and sources of error.", "Use mathematical notation and proof techniques (including logic and mathematical induction, proof by contradiction, recursion, etc.)", "2. Understand and use basic set-theoretic operations, various finite and infinite number systems, and their notations (1a)", "Work with vectors and basic vector operations, linear mappings, lines, planes, and hyperplanes in finite-dimensional spaces, as well as with conic sections (1a, 2)", "Understand the geometry and algebra of complex numbers and carry out basic manipulations using them.", "Assignment 1 - Numbers and Sets    Sept 6", "Coordinate systems & Number systems.", "Notation: Summation & Products.", "Complex Numbers I.", "Mathematical Induction & Recursion", "Algebra & Geometry of Complex Numbers II: Roots and Factors of Polynomials.", "Fundamental Theorem of Algebra", "Lectures 12 & 13", "Operations in Vector Spaces.", "Geometry of the Dot Product.", "A Little Bit of Linear Algebra", "Lectures 18 & 19", "Lectures 20 & 21", "Fixed- and Floating-Point Number Systems Arithmetic", "Note: 10th edition includes metric spaces.)", "Students are expected to read the sections of the textbooks and supplementary readings assigned in each week before the corresponding lectures and tutorials.", "Although no grade is assigned to these problem sets,students are expected to solve these problems as part of their study habits and exam preparation.", "The MatLab exercises introduce a widespread numerical computational programming environment supporting the application of numerical computation techniques.", "**", "In that case, these will be recorded.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "Compassionate Accommodation:", "They will review your case and coordinate a reasonable and fair plan in consultationwith appropriate others (for example: instructors, Department Undergraduate Studies Committee, Chair, AccessAbility Services, Engineering Counselling services, Registrar's Office)."]}, {"course_id": 7, "course_code": "BME 122", "course_name": "BME122 - Data Structures and Algorithms (0.50)", "term_name": "1B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Data Structures and Algorithms Winter 2025", "02:30PM - 03:20PM", "Topics of structured software design, data structures, abstract data types, recursive algorithms, algorithm and data structure analysis and design from both computational and memory perspectives, lists, stacks, queues, trees, graphs, sorting and searching, hashing, and problem-solving strategies.", "Embedded programming in health monitoring systems and healthcare management systems.", "recursive algorithms", "Performing rigorous complexity analyses of simple algorithms and data structures.", "Comparing different data-structuring techniques from the point of view of time and memory requirements.(1a, 1c)", "Determining a suitable data structure to solve a specific algorithmic problem.", "Implementing data structures correctly and efficiently in one or more high-level programming languages, such as C/C++.", "Week 2 (Jan 13 – Jan 19) Pointers and Dynamic Memory Allocation Mini-Assignment", "Textbook Data Structures and Algorithms in a Nutshell” by A. Wong et al (sku 281120120157B).", "Groups can have a maximum of 2 persons."]}]