[{"course_id": 31, "course_code": "ARBUS 301", "course_name": "ARBUS301 - International Business (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "AFM 333 / ARBUS 301", "AFM 333 001", "10:00AM - 11:20AM ONLN - Online", "10:00AM - 11:20AM HH 1101", "AFM 333 002", "11:30AM -", "AFM 333 003", "10:00AM - 11:20AM ONLN - Online", "10:00AM - 11:20AM HH 1101", "11:30AM -", "AFM 333 / ARBUS 301:", "AFM 333: View requirements for AFM 333", "Analyze the impact of various events in the global business and political environment", "Research and review information about the business, social and political culture of various countries", "Apply case analysis techniques to solving real world business problems by identifying symptoms and root causes, analyzing alternatives, and making recommendations backed up by persuasive evidence", "Define and discuss relevant international business concepts including globalization, comparative advantage, supply chains, and international marketing, HR and financial management", "There is a scheduled online and in class section each week.", "In general you will prepare the online lectures ahead of class.", "Your online textbook and the online lectures you will complete each week are in place of a second in person lecture.", "(Please check your spam folder first)", "The following is a guideline of how your assessment will be consolidated with the instructor’s evaluation of your “in class” contribution and will map to a range of contribution grades assigned at the end of term:", "TopHat Learning Resource & Quizzes", "(please check your spam folder first)", "These will be randomly assigned in week two and will generally include a mix both AFM and ARBUS students.", "Using your preferred online collaboration tool, your student team will prepare a 3 minute audio and/or video recording along with support PowerPoint slides which summarizes a current event article related to globalization, international business, or a core topic of the course.", "This submission should discuss the impacts or implications of the article including how it may relate to key concepts covered in the course as well as your team’s analysis and opinion on the topic.", "Teams should escalate quickly to Faculty if they need help resolving critical team issues.", "A final case examination covering all material in the course, will be scheduled during the exam period (timing TBD) and will be released and available for completion within a 24 hour period.", "Both exams are designed to be completable within a 2-3 hour period during the 24 hour window.", "Notice of Recording", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 32, "course_code": "ARBUS 302", "course_name": "ARBUS302 - Principles of Marketing (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Students will gain an understanding of how organizations identify the needs of potential consumers and create and deliver value to these consumers through the marketing process.", "Certain concepts from business and economics including market responsiveness, decision-making process, willingness to purchase, product differentiation, and advertising will be incorporated into the development of a strategic marketing plan.", "In addition to teaching central concepts and models from both marketing and economic theory, students will be placed in a forum where they can apply these concepts in a 'real world' marketing situation.", "Describe the basic principles of marketing, the marketing process, and its economic foundation.", "Demonstrate how marketing discovers and satisfies consumer needs and wants.", "Analyze internal and external factors contributing to the current state of organizations.", "Demonstrate the use of marketing tools including branding, positioning, and segmentation.", "Integrate the marketing mix elements into a strategic marketing plan.", "Missing a Discussion Posting", "If a student has an ongoing medical issue over the long run that would cause missing more than two discussion boards, the student should bring official documentation stating their condition at the beginning of the term.", "In the case of contribution issues, non-contributor's marks will be penalized based on their peer evaluation scores.", "In the case of illness or emergencies, students are responsible for contacting their group members ahead of deadlines and arranging for re-distribution of their responsibilities.", "This course includes the development and practice of specific skills, such as collecting, synthesizing and analyzing information, creating recommendations and practicing writing skills.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 33, "course_code": "ARBUS 303", "course_name": "ARBUS303 - Marketing Strategy (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["S. Villers", "Sheila Patterson", "Email: s6patterson@uwaterloo.ca", "Building on the fundamentals introduced in Principles of Marketing, students are given an opportunity to apply these concepts to real world situations in an interactive learning environment.", "Using cases and simulated markets, students make strategic decisions, defend their decisions, and see the repercussions in real time.", "Apply the marketing concepts taught in ARBUS 302 / MGMT 244;", "2. Develop skills in the areas of marketing analysis, marketing decisions, and strategy formation;", "January 6* Introduction: Syllabus, Marketing Fundamentals Chapter 1 In-Person", "January 20* Marketing Mix: Product Chapters 7-8 In-Person", "March 3* Consumer Behaviour Chapter 3 In-person", "Manual recording will be used for in-person classes.", "In appreciation of the fact that some people are introverted, there will be multiple recorders and multiple notetakers per class.", "Notetakers will supply recorders with class notes via email – the email must be received to count for a participation mark.", "Groups must notify the team member and the instructor of this termination.", "The work is expected to be completed professionally and on time every week – even if that means working beyond the 80 minutes of class time provided.", "Students must complete each course assessment by the due date specified above.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "A held-with course will also only count towards program and breadth requirements of the subject code under which it is taken, unless it is cross-listed with the subject code of its’ held-with course.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 34, "course_code": "ARCH 510", "course_name": "ARCH510 - Special Topics in Visual and Digital Media (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Urban Analysis and Simulation Fall 2024", "A range of special topics within visual and digital media that include course offerings in parametric design and scripting, advanced visualization, interaction design, and digital fabrication.", "The urban realm is a complex territory.", "In urban realms, we are often forces to ask ourselves what our priorities are, a question that become more and more relevant as populations move to urban centers, and our understanding of the role cities play in broader contexts grows.", "With competing agendas, budding ideas, and critical decisions all at play, designers are turning to data, analysis, and simulation to make more informed decisions and test new ideas.", "This course will introduce students to tools, methodologies, and concepts that will allow them to pursue analysis informed investigations of topics of interest relating to the expanded urban realm.", "The course will begin at a broader scale looking at regional data driven mapping using GIS, before moving towards site-finding exercises and scenario testing using simulation, analysis, and optimization in a grasshopper environment.", "Apply analysis and simulation to investigate urban issues", "Align data and methodology with design goals", "Approach parametrically driven site-finding and scenario testing", "Create maps and run basic analysis in GIS", "Create Basic Grasshopper Scripts", "Conceive of and execute a simple parametric optimization workflow", "Display soft skills such as metacognition/autodidacticism; computational thinking; digital file organization, hygiene, and habits; Translation of concepts and techniques between different design problems", "W02 11-Sep Data GIS intro & Data Collection   Log02 Log01 (Wed 6pm) Set up base map and gather data", "W03 18-Sep Analysis Analysis Pt 1& Exports   Log03 Log02 (Wed 6pm) Plottings, test graphics", "Break", "W07 23-Oct Transition   GH Analysis I Presentations & Discussion Log04   Grasshopper exercise", "W08 30-Oct Unit 2: 3D Intervention Simulation and Analysis Massing Analysis GH Analysis II   Log05 Log04 (Wed 6pm) Test analysis plug ins", "W09 6-Nov Optimization & Artificial Intelligence Evolutionary Solver   Log06 Log05 (Wed 6pm) Apply evolutionary solver to script", "This will be an important touch point to make sure everyone is on the same page regarding key concepts, approaches and expectations.", "Evaluation", "Completion of the deliverables", "Organization and clarity of the submission", "Independent inquiry, exploration and development", "Grades will be assigned based on the following standard:", "Submissions", "Outside of the late pass, only in the case of a justified medical or personal reason will these penalties be waived, and only if these have been officially submitted to the Undergraduate Student Services Co-Ordinator (archundergradoffice@uwaterloo.ca) and accepted by the Undergraduate Office.", "When asking for support regarding digital files, please follow these guidelines:", "Notice of Recording", "Course Delivery Platforms & Communication", "Messaging for informal chats and questions", "Email:", "Formal announcements and communications", "Progress log submissions", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 35, "course_code": "ARCH 520", "course_name": "ARCH520 - Special Topics in Urbanism and Landscape (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Cultivated Landscapes in World Cinema Fall 2024", "09:30AM -", "A range of special topics courses within urbanism and landscape.", "The idea of the landscape develops in history, but also in the individual, through the effects of time and space joined together in the rhythm of lines and surfaces that human beings know how to compose almost instinctively”.", "Let us remember that the first civilizations arose on the banks of rivers, and that in the ancient world the river was not only the source of fertile land and nourishment, and the place of gathering, but also the artery of movement and transport, and that water’s symbolic role in the origin and ritual renewal of life originates in the ecology of the river.", "We view diverse films in which natural and cultural landscapes play a major, decisive role in the situations and scenarios experienced by the characters.", "We then interpret, and discuss to reflect the real world that underlies these artworks, facilitate raising questions, and uncover issues pertinent to our cultural and natural worlds.", "Then, I give a slide lecture introduction to watching the next film, to give you a sense of what to look for and introduce connected themes.", "Cultural history and landscape cinema", "In this course, we study films to analyze landscape’s coding of cultural meaning and symbolism.", "Just as we project our minds into our situations, and reflect our environments, we explore how cultures embed values in landscapes and spatial depths.", "In the fiction films and readings for this course, landscape and its cultural coding plays a significant role in the drama.", "The lab-style, workshop core of this course involves building up visual and textual literacy, practice intended to foster and refine skills in analysis of cultural artifacts, researching with both primary and secondary sources, and written expression and communication.", "Geographer Donald Meinig (1976) described landscape as the union of the physical and the psychological: “composed not only of what lies before our eyes but what lies within our heads.”", "It reflects prior experience as well as prevailing cultural, social, and economic values.", "Landscapes express, in addition to their own biophysical makeup, the character of a society as it has evolved over an extended period of time.", "The course viewings expose the cultural contents of landscapes via dramatizations of processes, movement, conflict and enactments in movies and related media, space-time artifacts.", "These complex materials facilitate our discussion of contemporary ideas and issues, relating people and other living things to places and geological and atmospheric realities, topics including colonialism and social power, war, modernity, indigeneity and identity, sacred sites and religious practices, environmentalism, wilderness and the sublime, the journey, subjectivism, nationalism, sense of place, encounter, strangeness and surreality, fate and destiny, utopias/dystopias, the noble savage, representation, horror and formlessness, etc.", "As a workshop course in research and writing to create and refine skills in analysis of cultural artifacts and written communication, your learning process requires initiative and critical thinking, and is self-directed, resourceful, responsive, and iterative.", "One class (Troll Hunter) will be devoted to examining the idea of sustainability through a cultural and social lens, and the role that architecture, the arts, and landscape might play.", "Conceptual vocabulary list — highlight words in your notes", "Each of you will choose one of our class films as an inspirational model, and visually tell a story for a place-based or site-based story in the landscape of your choice, assembled with elements that provide evidence of your understanding of landscapes as material, symbolic, temporal, spatial, and complex, and the course materials.", "Your basic practice involves building these study habits:", "Note thematic keywords on your “conceptual vocabulary” list to test and use in your Boolean (multi-word) searches.", "Each person will verbally communicate their insights.", "What elements in the film caught your eye / interest while watching?", "How can you make a link between your observation of the film as a primary source to your secondary sources?", "What feeling(s) did the film elicit in you?", "Make an effort to respond to someone else’s comments and then create a link to your own ideas, rather than everyone starting their own isolated topic.", "In this course, a few short readings in PDF format will be posted in the “Files” of our Teams channel.", "Topics & Schedule", "Grasp the cultural meanings of landscapes", "Perceive how makers introduce complex meanings into artifacts like film, art, and architecture", "Evaluate and synthesize your academic research", "Analyze cultural artifacts from different perspectives", "Develop oral and written communications skills", "Co-create complex knowledge in a group of peers by bringing together diverse research perspectives", "Present a research seminar", "Read films as dramatized philosophical positions, and as texts concerned with landscape, as a model for architectural design and landscape and garden design", "Sketch out a story in time-based media", "Appreciate sustainability in both socio-cultural and natural aspects of landscape", "This course has a trigger warning for harsh scenarios such as violence, cannibalism, suicide, rape, murder, genocide, trauma, and cruelty.", "Messages in Teams are preferred to emails, as they take form as a conversation, easier to go back through and locate specific communications than by searching in email folders.", "Remote Course Delivery Platforms & Communication", "Students added to course team in first week of class.", "Notice of Recording", "These conditions include disclosure and documentation in a process-based appendix.", "Disclosure", "Sample General Citation", "Generative AI Tool Name], a model developed by [", "Provide a raw copy of the AI tool’s generated material.", "Include captions for each part of the generated material identifying the particular material, indicating source and date."]}, {"course_id": 36, "course_code": "ARCH 540", "course_name": "ARCH540 - Special Topics in Architectural History and Theory (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["06:00PM -", "A range of special topics courses within cultural and architectural history, theory, and criticism.", "Gieseking argues for the fundamental impacts of spatial imagery and mapping on the creation of perceived, conceived and lived experiences of space.", "The straightening and assimilation of queer culture into more mainstream heteronormative society illustrates the significance of formulating spatial narratives of past, present, and future to protect the histories of resiliency that the community has overcome through the production of queer space.", "Drawing inspiration from the concept of geographical imagination, whether imagined or real, these narratives demonstrate the potential to validate one’s characterization of space and how it may also shape practices, behaviors, and social structures.", "Forms of cartographic documentation, drawing, and writing will be tools to recount and illustrate new and old narratives to form a constellation of (non)fictions across the City of Toronto.", "By the end of the semester, digital narratives will archive, present, and hypothesize the nuances of individual queer experiences to reveal collective queer resilience as it pertains to the socio-cultural-economic structures within the City.", "The seminars will allow groups to specialize in specific themes that encompass socio-cultural-spatial research through text and drawing.", "D", "Course Introduction", "Readings", "Readings", "Readings", "Readings Readings will be assigned as per groupings and themes as determined from P.2", "5 M Oct 7 6:00pm-9:00pm: GIS & StoryMaps Workshop", "Readings Readings will be assigned as per groupings and themes as determined from P.2", "Oct 14-18 Reading Week - No classes", "Readings Readings will be assigned as per groupings and themes as determined from P.2", "Readings Readings will be assigned as per groupings and themes as determined from P.2", "Readings Readings will be assigned as per groupings and themes as determined from P.2", "Readings Readings will be assigned as per groupings and themes as determined from P.2", "Readings Readings will be assigned as per groupings and themes as determined from P.2", "Readings Readings will be assigned as per groupings and themes as determined from P.2", "Readings", "William Morrow & Co.; 1997.", "First edition.", "Disidentifications: Queers of Color and the Performance of Politics", "P.2 - Memory Mapping - Workshop 10%", "P.3: Story mapping: A repository of Queer ["]}, {"course_id": 39, "course_code": "ARTS 450", "course_name": "ARTS450 - Global Engagement Seminar (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "07:00PM - 09:50PM", "D. Peers", "In this interdisciplinary topics course, students collaborate with each other and with instructors and outside experts to develop imaginative but possible solutions to vexatious contemporary global problems.", "Past topics include global populism and democratic futures, artificial intelligence, the future of nature, and pandemic.", "While many organizations consider housing a fundamental human right, many people in Canada are living with inadequate housing.", "Demonstrate expertise in concepts related to housing, health and humanity", "Demonstrate expertise in interdisciplinary collaboration and knowledge mobilization", "Design and create a public-facing group project deliverable in collaborative, interdisciplinary teams using iterative design.", "Integrate ideas and concepts from government, industry, and civil society perspectives into the design of group projects", "Introduction to the course, and discussion of course organization", "History of the City – Dr. Douglas Peers", "Introduction to the Future Cities Institute", "Project development and build time", "By dissecting current modes of production and examining practical strategies, this talk illuminates how to reinfuse identity, belonging and empathy into our cities, fostering spaces that inspire and nurture connection to place and one another.", "Title: Challenges and Innovation in the high arctic", "Description: What are the challenges of building in Nunavut?", "Generative and Parametric Design Tools", "Harnessing quantitative methods and optimization in the planning of built environment", "The need for robust economic feasibility modelling in municipal decision making", "Advanced manufacturing as a productivity solution for the construction sector", "Title: The Urban Determinants of Health", "Using Toronto as a case study and drawing on my own work at The Local, I will discuss the social determinants of health within the context of a dense urban setting.", "Notice of Recording", "Intellectual property includes items such as:", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 40, "course_code": "AVIA 100", "course_name": "AVIA100 - Introduction to Aviation (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Aviation Fall 2024", "S. Kearns", "03:30PM - 04:20PM", "S. Kearns", "10:30AM - 11:20AM EV1 350", "S. Kearns", "04:30PM - 05:20PM", "S. Kearns", "10:30AM - 11:20AM EV3 4408", "S. Kearns", "Instructor: Dr. Suzanne Kearns", "Email: suzanne.kearns@uwaterloo.ca", "The nature and impact of each of these topics is explored through a combination of lecture, class discussion and activities, and student presentations.", "View requirements for AVIA 100", "• Demonstrate their understanding of key elements critical to the aviation industry in Canada and Internationally.", "• Describe a range of professional and safety issues, give examples of domestic and international regulatory and labour issues, and examine environmental concerns associated with aviation.", "October 21 Navigation", "However, the library's license limits the number of simultaneous users.", "There is no exception to this and make-up grades are not available as completing quizzes during their assigned window is an element of professionalism within the course.", "You are expected to prepare a single slide for your element of the presentation, and combine them into a single presentation file for your entire group.", "Quizzes are in multiple-choice format.", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 41, "course_code": "BET 100", "course_name": "BET100 - Foundations of Entrepreneurial Practice (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["BET 100 introduces you to the principles underlying successful entrepreneurial behaviour and equips you with an understanding of tools, knowledge and models used by entrepreneurs and entrepreneurial employees.", "Understand key concepts around entrepreneurship;", "Identify your own entrepreneurial behaviours and orientation; and", "Identify and research problems of scale and importance (i.e., BIG problems); and", "Create Business Model Canvas versions to analyze and evaluate solutions; and", "Module Four: Creative Problem Solving and Design Thinking", "Module Five: Business Models", "Module Seven: Channels and Customer Relationships", "Value proposition design: How to create products and services customers want.", "Value Proposition Design - Print Version", "Business Model Generation - Print Version", "Citation", "In case of illness, appropriate documentation must be submitted.", "Re-Grade Policy", "Exceptions to this are the creative process in Your Challenge 3 and the business model canvas in Your Challenge 5.", "The word limits stated for each relevant Challenge are a requirement and not a suggestion.", "The business model canvas must follow the format prescribed in the course content."]}, {"course_id": 42, "course_code": "BET 210", "course_name": "BET210 - Business Technology and Infrastructure (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Business Technology and Infrastructure Winter 2025", "Modern organizations increasingly rely on a technological infrastructure that informs what can be accomplished, the prospects for long-term growth, and its overall competitiveness.", "In this course, students will learn about underlying technologies, gain insights into planning for new technologies, evaluate existing systems, and understand the various roles and issues related to corporate information systems management.", "Identify and describe business operations and business processes.", "Apply software development management concepts to assess case examples.", "Describe IT operations concepts in the context of different types of businesses.", "Identify challenges in a DevOps environment and propose potential solutions.", "Demonstrate critical thinking in a DevOps environment.", "This course includes the independent development and practice of specific skills.", "Requests to Re-grade", "An email request must be submitted that indicates your reasons for believing that a question was improperly graded."]}, {"course_id": 43, "course_code": "BET 300", "course_name": "BET300 - Foundations of Venture Creation (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Associate Professor, Teaching Stream and Enterprise Co-op Coordinator", "Conrad School of Entrepreneurship and Business", "Email: whchang@uwaterloo.ca", "The theoretical knowledge and practical skills needed to create a successful small entrepreneurial enterprise are developed.", "Topics include definition and evaluation of entrepreneurial opportunities, business planning, funding strategies and early-stage revenue models, legal issues, and intellectual property protection.", "View requirements for BET 300", "They will gain specific knowledge and develop process skills to help them make critical decisions during the earliest stages of planning and launching their venture.", "The evidence of learning progressions will be in the form of regular weekly documentation of active experimentation and reflective observations, group workshop session summaries, presentations, reports and final assignment workbook with source references and citations demonstrating integrative learning and iterative cycles of learning progressions.", "2.Become familiar with the typical components of an entrepreneurial ecosystem, and the specific actors at U. Waterloo and in the Waterloo Region who assist start-ups.", "3.Craft a clear value proposition.", "6.Develop understanding of Problem-Solution fit and Product-Market fit.", "7.Gain experience evaluating opportunities and understanding customer needs.", "8.Identify core components of a business model, e.g. Strategyzer 9 components of Business Model Canvas", "Research and Analysis – understanding context of venture idea", "Application of Skills – identifying and applying existing relevant skills", "Mindset – developing specific mindsets", "working definitions", "peers’ cold intro’s", "Startup Ecosystem", "Think-Pair-Share", "Group workshop session BMC for YVI", "Value proposition current version", "Strategyzer template poster Business Model Canvas", "Think-Pair-Share", "Testing your Business Model & Test Cards", "Crowdsource new Test Cards", "Crowdsource new SCAMPER", "Jenni.AI user testing in the course", "Book – Business Model Generation", "Strategyzer Reference Guide called Testing your Business Model and Test Cards", "Think-Pair-Share", "Invited alumni speaker // Startup Pitch competition winners", "Assignment due Problem space research for YVI", "Startup pitch presentations structures formats", "Think-Pair-Share", "SLICC proposal & guide template", "Minimum Viable Product (MVP)", "Apple iPhone", "Apple Vision Pro", "BMC worked examples to cross-reference and create YVI BMC draft", "Think-Pair-Share", "GreenHouse Social Impact Incubator", "BMC & Social Impact Canvases", "Product-Market Fit (PMF) Framework", "YVI BMC & Impact Canvas contrast", "Think-Pair-Share", "Velocity Innovation Arena", "YVI startup pitch presentation draft", "YVI BMC testing", "YVI MVP draft attributes descriptions", "MVP Validation Guide & 24 Experiments", "YVI BMC testing", "Think-Pair-Share", "Design Sprint", "YVI BMC & MVP testing", "Think-Pair-Share", "health tech & startup network EC's", "YVI BMC & MVP testing", "Think-Pair-Share", "Worked examples SLICC final assignment Workbook & Reflection", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 44, "course_code": "BET 320", "course_name": "BET320 - Entrepreneurial Strategy (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Course content includes the importance of strategic partnerships, understanding the bases of competition, conducting industry and market level analyses, evaluating innovative ideas for commercial potential, business planning in a corporate context, intellectual property strategy, and strategic tools needed for launching new ideas.", "understand the importance of innovation in established firms.", "apply creativity to identifying core business problems and developing effective solutions.", "understand the unique challenges of successfully leading change and launching new ideas in a corporate environmnt.", "Course overview and introduction to key concepts 1.", "Introduction to strategy", "The need for innovation and reinvention", "****QUIZ TODAY*", "***", "Understanding customers", "February 26 Business Models and Business Model Innovation", "3. Osterwalder & Pigneur, “Business Model Generation”, Free 72 page preview available at http://businessmodelgeneration.com/book?_ga=1.40125858.1462723115.1417101876", "March 5 Leading change and launching new ideas in a corporate environment", "3. Anthony & Putz, “How Leaders Delude Themselves About Disruption MIT Sloan Management Review, Spring 2020, 56-63", "“The Basics of Intellectual Property”, Canadian Intellectual Property Office, http://www.cipo.ic.gc.ca/eic/site/cipointernet-internetopic.nsf/eng/wr03585.html?Open&wt_src=cipo-ip-main", "Guest speaker reflection", "Total", "Class Contribution Self-Assessments", "There are also a number of ways that you can engage with your classmates, outside of the classroom.", "Put all four reviews in a single WORD document.", "This reflection will be marked as follows:", "0/5 – No reflection submitted", "Notice of Recording", "We will be recording presentations by our guest speakers during the March 12 and March 26 classes.", "The videos will focus on the guest speakers and not on students in the class.", "This course includes the independent development and practice of specific skills, such as understanding business concepts and applying them to real life situations.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 45, "course_code": "BET 340", "course_name": "BET340 - Essentials of Entrepreneurial Planning and Execution (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["BET 340", "Entrepreneurial success starts with finding a solution to a problem and then creating the right strategy to bring it to market.", "A broad range of skills are required to do this including understanding founder and team dynamics, hiring and firing, cash flow management, project management, developing suitable equity structures and compensation, pitching, fundraising, internal and external communications, and people skills.", "View requirements for BET 340", "But in addition to validating their business model (i.e., how they intend to create, deliver, and capture value), entrepreneurs must develop a strategy to bring this solution to market.", "It recognizes that successful execution calls for exceptional judgments and decision-making involving challenging tasks—such as building a founding team; hiring, motivating, and firing employees; pitching to investors; managing cash flow; communicating with internal and external stakeholders; acquiring and onboarding customers; negotiating with industry partners; and managing multiple projects.", "3. Pinpoint equity distribution's short-term and long-term implications while maintaining a productive working relationship with your co-founders.", "7. Critically evaluate the role and importance of investors to new ventures and create and deliver a compelling pitch to raise external capital.", "Recognize when a pivot is needed and the type that might be most useful for any given circumstance.", "Manage multiple projects using the appropriate methodology to support the venture’s dynamic strategy.", "Lead and motivate employees to work towards a shared goal with the support of appropriate strategies for managing people.", "1 Jan 8 Pre-Simulation Class: Course Roadmap & Marketplace Simulation", "3 Jan 22 Pre-Simulation Class:    Co-Founders", "In-class group co-founder exercises", "7 Feb 26 Marketplace Simulation: How to raise capital and invest in your business", "Personal business plans and course-related matters", "Business Titan Tournament: Factile Business Jeopardy and Marketplace Simulations", "The other platform is Marketplace, a comprehensive new venture simulation.", "Items", "Understand how to craft a compelling story targeted towards a specific audience (e.g., investors, customers, employees)", "Pinpoint equity distribution's short-term and long-term implications while maintaining a productive working relationship with co-founders", "Lesson 4b (“Sales & Negotiations”)", "Critically evaluate the role and importance of investors to new ventures and create and deliver a compelling pitch", "Recognize when a pivot is needed and the type that might be most useful for any given circumstance", "Manage multiple projects using the appropriate methodology to support the venture’s dynamic strategy", "Lead and motivate employees to work towards a shared goal with the support of appropriate strategies for managing people", "I will facilitate this by allowing you to submit your best work for only four of these seven possible mini-assignments:", "Discuss whether Brooks should give Tyler half of his stake in Erbe.", "The written response should be a maximum of 600 words.", "Whether you reach an agreement or not, you are expected to submit a 600-word (maximum) journal report that covers these three areas in a clear, precise, compelling, and coherent way:", "More generally, there should be a clear and logical chain of reasoning, arguments or storytelling that precisely connects the strategy and tactics deployed to the anticipated negotiation outcomes.", "In other words, how differently would you engage in negotiation planning?", "The word limit is a maximum of 600 words.", "As a venture grows, so will the resources to hire a CFO, but at the start, each founder should understand the basics of cash flow.", "Bank loan?", "Line-of-credit?", "Other questions: Evaluate the financial affairs of the business", "Are there concerning patterns in this cash flow statement?", "What are the key takeaway lessons regarding sources of cash, cash flow, and financial discipline?", "The written response should be a maximum of 600 words.", "For this assignment, you will get hands-on experience searching for patents, and you will be able to demonstrate your knowledge of creating complex search strategies and identifying effective classification codes.", "Discuss one pivot that could be beneficial for the venture in the future.", "Lastly, what kind of pivot should this venture consider?", "Your response should be a maximum of 600 words.", "A strong submission incorporates information from the weekly lesson (posted in lesson 8) and includes compelling reasons for making a pivot and why the proposed pivot is appropriate.", "Criteria used to evaluate the core elements of an outstanding assignment:", "Writing Mechanisms (10%): Extremely well-written assignment; sentences are well-formed and appropriately varied in length and style; few, if any, spelling or grammatical errors.", "But Marketplace makes up for this in essential ways.", "Through computer simulation, you will start and run a virtual company with your classmates for one-and-a-half years of compressed business life cycle (i.e., from the startup stage to development, growth and eventually, near maturity)—which amounts to six weeks of decision-making rounds in class.", "Your Marketplace grades will come from these two sources:", "This form of report must cover these core areas in a clear, compelling, and coherent way:", "Perspective (up to 650 words): You must comprehensively explain and substantiate why and how your specific competitive strategy and tactics were effective or ineffective in your changing business situations, taking your competitors’ strategies and tactics, among other situational factors (i.e., changing operational and financial performance and customer needs), into account.", "In other words, how differently would you engage in venture planning and execution?", "You could make your work even more outstanding by integrating relevant concepts and perspectives from course material and external (cited) research.", "You will self-enrol in groups to write and present a paper on a relevant venture planning and execution topic.", "If you don’t, I strongly recommend choosing a general topic instead.", "Carefully read the extended guidance and relevant rubric below.", "Carefully read the extended guidance and relevant rubric below.", "Your written paper should be a maximum of 1500 words.", "Instructor-Group Meetings: As a first step, please arrange to meet with me to discuss and confirm your research topic and question before proceeding.", "But note that I will primarily consider these questions when evaluating your topic and question: What exactly will I learn from you that could help me gain a deeper understanding of venture planning and execution (i.e., how to formulate and execute venture strategies and operations) and how to get better performance outcomes?", "Whether you plan to focus on a topic connected to a founder or a general topic, recognize that you can develop an outstanding paper by addressing a specific venture planning and execution topic and related question in a focused, clear, deep, compelling, and coherent way.", "This includes sharing novel and profound insights from course material and external research.", "Ultimately, you should help them learn something new and exciting about venture planning and execution.", "For a topic inspired by a founder, it is essential to first frame and position your topic and question in the relevant course, practitioner, or academic work.", "Afterwards, you can clarify why and how you will use relevant aspects of the founder’s life and business venture to address them.", "For a general topic, it is similarly critical to start with a solid opening paragraph that frames and positions your topic and question in the relevant course, practitioner, or academic work and, ultimately, sets the stage for your follow-on discussion—which should be carefully developed with appropriate arguments, evidence and cited work over several well-connected paragraphs.", "Instead, frame and position your crucial topic and question upfront and selectively use relevant background and information to develop and share compelling and insightful ideas that build on what we already know--by appropriately combining insights from case analysis (i.e., specific information about the deal in question), course content, and external research.", "Based on the rubric below, this component of your work falls under “Analysis and Applications,” which accounts for a relatively large proportion of your marks.", "Appropriately frame and position the topic in relevant background work.", "Next, make a case for your paper by clarifying what is missing from this background work or inadequately understood, why it is essential to address this gap and state the question you will answer to do so.", "Appropriate examples or cases are used to illustrate the key concepts meaningfully.", "Extremely well-written reports are expected: sentences are well-formed and appropriately varied in length and style; there are few spelling or grammatical errors.", "However, you can add audio/video narration to these slides if you'd like (i.e., submit an MP4 file).", "Group presentation rubric: For your group presentations, I will use the following similar set of criteria to mark them:", "Appropriately frame and position the topic in relevant background work.", "Next, make a case for your paper by clarifying what is missing from this background work or inadequately understood, why it is crucial to address this gap and state the question you will answer to do so.", "Relevant concepts are communicated and correctly interpreted.", "Appropriate examples or cases are used to illustrate the key concepts meaningfully.", "Strong evidence of teamwork in the delivery of the presentation."]}, {"course_id": 46, "course_code": "BET 350", "course_name": "BET350 - Customer Experience Design (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Customer Experience Design Winter 2025", "BET 350", "Slack link will be shared in the first week of the semester.", "Not only will students develop a conceptual understanding of user experience and user-centered design, they will also learn how to deeply understand the needs of the customer and develop engaging and innovative products and services.", "View requirements for BET 350", "Apply a range of research methodologies and prototyping techniques to design products and services with the customer in mind", "Demonstrate how the role of the customer, their behaviour, perceptions, attitude, and expectations impact the overall business strategy", "Create effective customer journey maps and digital prototypes", "Make compelling presentations outlining the research and steps involved in creating a final prototype", "Part one covers topics such as designing for behaviour change, mapping out the customer journey, what design means in the context of business, service- and product design, how to measure a successful customer experience and visual design principles and is taking place in the first part of the course, followed by a 4-stage Design Sprint (Understand - Ideate - Build - Validate) where the learnings from the first part will be put into practice."]}, {"course_id": 47, "course_code": "BET 400", "course_name": "BET400 - Marketing Foundations for Early-Stage Ventures (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Marketing Foundations for Early-Stage Ventures Winter 2025", "This course develops the theoretical knowledge and practical skills needed to develop a marketing strategy for early-stage ventures.", "Topics include managing product development, marketing and brand development, segmentation and targeting, competitor analysis, and positioning.", "Attain a keen grasp of key marketing concepts and strategies (e.g., customer insight, market segmentation, targeting, positioning, and customer adoption of innovations) with focus on the challenges faced by new ventures.", "Gain proficiency in marketing mix strategies and tactics and understand how to use them to achieve strategic objectives.", "Create a comprehensive and actionable marketing plan for a startup or entrepreneurial idea based on thoughtful market analysis.", "In-Class Activity", "Customer Insight & Marketing Research Exercise: Discovering the customer journey through marketing research", "Segmentation & Targeting  Exercise: Creating and understanding customer segments", "Product Strategy Case: M-PESA", "Pricing Strategy & Distribution Strategy TBD", "Communications & Promotions Strategy Assessment 2", "Brand Strategy Exercise: Building a strong brand", "In-Class Participation", "The venture can be in the planning stages or already launched.", "The proposal should provide the situational analysis of the market in which your new venture will compete and explain what gap in the market your venture will serve.", "A description of the existing ‘industry’", "The nature of customers, their buying behaviour and the segments that exist, including those segments that are not well-served, i.e., what are the gaps in the market?", "You also need to include anticipated results over a 3-year timeframe, including market share and financial analysis (projected revenues, expenses, profits, break-even).", "60 minutes each) based on applications of marketing concepts.", "You will be given a number of short case scenarios about situations and/or decisions facing new businesses and then asked to use marketing concepts discussed in the course to provide recommendations or analysis for the business.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 49, "course_code": "BET 420", "course_name": "BET420 - Entrepreneurship for Social Impact (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Entrepreneurship for Social Impact Fall 2024", "This course explores how innovative approaches can address social problems, create organizations that make positive change, have significant social impact, and be sustainable and economically viable.", "Students develop skills and tools for refining and implementing their ideas as well as measuring the success and value of mission-driven organizations.", "Through case studies, lectures, and workshops, students also develop skills in strategic thinking with a socially conscious business mindset to create high-impact ventures.", "Together, we will explore Social Entrepreneurship from multiple sides: studying key topics using readings and research; employing design thinking to consider complex systemic problems; and working to propose the early stages of a model for a social venture, through insights gained throughout the term including interviewing experts for a group podcast project.", "In this course, we are interested in ventures that create social impact while being financially sustainable.", "The course will employ a blend of short lecture videos, in-person classes on most Wednesdays this term from 6:30pm-9:20pm, a design sprint, engagement via the LEARN platform, virtual check-ins with myself during online group work weeks, and a guest speaker panel.", "Apply methods of design thinking, systems thinking and research skills to address a social problem", "Social enterprise mini-case presentation 10%", "Group assessment: Impact gaps canvas submission 15%", "This course includes the independent development and practice of specific critical thinking skills, such as;", "Library for research-based assignments"]}, {"course_id": 50, "course_code": "BET 430", "course_name": "BET430 - Sales Fundamentals (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Coursework examines key sales technologies, networking techniques, the use of marketing in sales, the sales process, and assessing the value of a particular sale from both the perspective of customer impact and the financial and strategic impact on the organization.", "introduce the key sales concepts that are required for a sales career or business success", "develop knowledge of the key elements of the sales process, the basic components of customer relationships, and the need for a defined sales methodology to create repeatable and scalable businesses", "understand how the sales relationship can drive customer buying decisions built on strong value cases", "understand how customer experience facilitates the development and maintenance of these customer relationships", "Monday 6:30pm - 9:20pm", "Sales Knowledge", "Turning Customers into Fans", "Weekly Class are held Monday evening in Room E6 2024", "Each Quiz consist of randomized multiple-choice questions designed to evaluate your learning on a week-to-week basis.", "You are responsible for completing these graded components in the time frame allotted so please be sure you have access to a stable Internet connection and a properly configured computer or device.", "An in-class term test consisting of up to 25 randomized multiple-choice questions will be held during the 2nd last class of the course.", "You are responsible for completing these graded components in the time frame allotted so please be sure you have access to a stable Internet connection and a properly configured computer or device.", "Your group will be randomly generated and then assigned to work with  a current start-up company to produce a Sales Playbook.", "This course is designed to examine topics in human decision making, communication and behaviour and requires regular and ongoing participation in the class by each student.", "These classes will also review the various assignments and provide Q & A sessions.", "Participation and attendance will be recorded each week."]}, {"course_id": 51, "course_code": "BET 450", "course_name": "BET450 - Leadership (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "My goal is to respond within 24 - 48 hours and I expect the same from each student.", "Leaders make things happen.", "Leaders make things possible.", "Course topics will be enriched through a critical study of leadership exemplars in popular media.", "Awareness, Behaviours, and Choices and how these impact our decisions.", "DEVELOPMENT ACTIVITY", "Leadership: Vision & Values     Take-home 1: Leadership Statement", "Mindset     Take-home 2: Comfort Zone", "Change Leadership: Envision & Inspire     Take-home 3: Leadership Statement", "Culture: Design & Impact     Take-home 6: Leadership Song", "Share & Tell", "Self-Evaluation 50%", "Self-Evaluation:", "Team Member Evaluations:", "Receiving feedback from your peers can help to develop your level of personal awareness on how you impact others and your work environment.", "This course includes the independent development and practice of specific skills.", "Notice of Recording"]}, {"course_id": 52, "course_code": "BET 460", "course_name": "BET460 - Business Negotiations (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Business Negotiations Winter 2025", "E-mail: horatio.morgan@uwaterloo.ca", "It is a craft that must hold co-operation and competition in creative tension, and even the most experienced negotiators often fall prey to common biases and errors in judgment.", "Yet, they often find themselves at a disadvantage and unprepared to close these deals.", "Even experienced negotiators sometimes struggle to get this right because biases, errors in judgment, and ethical dilemmas get in the way.", "This course integrates theory and practice by intensively using realistic negotiation exercises that can improve your negotiation skills.", "7. Become more aware of common biases, errors in judgment and ethical dilemmas that can undermine business negotiations.", "Module 1: Foundations for a Strategic Negotiation Plan in Business Negotiations", "1 Jan 6 Fundamentals of negotiation: Basic nature of business negotiation and key concepts (including negotiation strategies, tactics, and styles)", "Negotiation planning documents & exercises", "Role-play exercise: Negotiate Atalanta(DRRC)", "7 Feb 24 Negotiating deals with co-founders", "Case-study exercise in groups: UpDown (HBP)", "Case-study exercise in groups: Sarah Talley and Frey Farms Produce: Negotiating with Wal-Mart (A) (HBP)", "Role-play exercise: Negotiate D-Loyal (DRRC)", "Personal negotiation profile and progress", "Other course-related matters", "This is essential for clarifying and reinforcing their key learning points.", "This online negotiation platform manages the core negotiation exercises.", "Items", "Ideally first class", "The start of each class involves a negotiation exercise", "A “high-quality” contribution to a debate is associated with one or more of these characteristics:", "Shares a unique and relevant perspective.", "Each completed document should be a maximum of 600 words.", "To make the gains comparable across negotiators (i.e., control for differences in bargaining power across negotiation partners), I will separate the gains by role (e.g., gains for buyers only versus sellers).", "Z-score: Your calculated z-score tells us how many standard deviations away from (below or above) the average same-role gain your gain lies.", "I will ensure that your negotiation skills predominantly determine your negotiation performance by using iDG to assign you to negotiation roles and groups randomly.", "Assume that iPhone sellers have made a gain of $450 on average.", "Meanwhile, the standard deviation of sellers’ gains is $350.", "Your z-score would be:", "This z-score indicates that your raw gain of $700 is 0.71 standard deviations above the average gain for sellers.", "The grade chart below shows this would be a strong negotiation performance!", "Step 3/3: Calculate your adjusted z-score and convert it into the grade weight for your negotiation planning and role preparation", "Adequacy ratio threshold and z-score adjustment: If the adequacy ratio is below 5/7, I will revise your adjusted z-score downward to account for unsatisfactory negotiation planning and role preparation.", "Each written journal report should be a maximum of 600 words.", "Specifically, you are expected to prepare a report that covers these three core areas in a clear, precise, compelling, and coherent way:", "More generally, there should be a clear and logical chain of reasoning, arguments, or storytelling that precisely connects the strategy and tactics deployed to the negotiation outcomes that materialize.", "In other words, how differently would you engage in negotiation planning?", "You could make your work (especially the perspective section) even more outstanding by integrating relevant concepts and perspectives from course material and external (cited) research.", "You may choose 2 of these four negotiations: Zephyr, Atalanta, Aerospace Investment and D-Loyal.", "During a specified period, you can self-enrol in groups for group projects featuring a written paper and presentation on negotiation-related topics.", "Your written paper should be a maximum of 1500 words.", "Instructor-Group Meetings: As a first step, please arrange to meet with me to discuss and confirm your research topic and question before proceeding.", "But note that I will primarily consider these questions when evaluating your topic and question: What exactly will I learn from you that could help me gain a deeper understanding of how business negotiations work (i.e., how to formulate and execute negotiation strategies and tactics) and how to get better results?", "Whether you plan to focus on a topic connected to a business negotiation case or a general topic, recognize that you could develop an outstanding paper by addressing a specific negotiation topic and related question in a focused, clear, deep, compelling, and coherent way.", "This includes sharing novel and profound insights from course material and external research.", "After deciding on the critical question, consider how you will structure your work to help readers quickly navigate it and eventually learn something new and exciting about formulating and executing business negotiation strategies.", "For a business case, it is essential to initially develop a brief upfront description of the negotiation situation.", "You can then progressively draw on relevant case information to create focused, nuanced, deep insights into your core issue or question.", "For a general topic, it is similarly critical to start with a solid opening paragraph that frames the relevant subject and sets the stage for your discussion—which should be carefully developed with appropriate arguments, evidence, and cited work over several well-connected paragraphs.", "It can result in more efficient and effective negotiation strategies and tactics.", "This is especially critical when explaining why and how specific strategic and tactical factors account for the negotiation outcomes addressed.", "Start by introducing the topic and conveying why it is relevant to the formulation and execution of a strategic negotiation plan in a business context.", "Appropriately frame and position the topic in relevant background work.", "Relevant concepts are communicated and correctly interpreted.", "Appropriate examples or cases are used to illustrate the key concepts meaningfully.", "In other words, your presentation should primarily convey a convincing perspective that provides logical and substantiated explanations for the negotiation outcomes: why and how specific negotiation factors, strategies, and tactics influenced your negotiation experiences or outcomes.", "Extremely well-written papers are expected: sentences are well-formed and appropriately varied in length and style; there are few spelling or grammatical errors.", "Group paper presentation rubric: For your group presentations, I will use the following similar set of criteria to mark them:", "Start by introducing the topic and conveying why it is relevant to the formulation and execution of a strategic negotiation plan in a business context.", "Appropriately frame and position the topic in relevant background work.", "Next, make a case for your paper by clarifying what is missing from this background work or inadequately understood, why it is crucial to address this gap and state the question you will answer to do so.", "Relevant concepts are communicated and correctly interpreted.", "Appropriate examples or cases are used to illustrate the key concepts meaningfully.", "In other words, your presentation should primarily convey a convincing perspective that provides logical and substantiated explanations for the negotiation outcomes: why and how specific negotiation factors, strategies, and tactics influenced your negotiation experiences or outcomes.", "Strong evidence of teamwork in the delivery of the presentation.", "The instructor must also arrange logistics and pairings before each negotiation exercise.", "Honour Code", "A strict honour code applies to this class as follows:", "You may not make up facts that materially change the power distribution or a negotiation exercise (e.g., your family just bought the company you are currently negotiating, or state that you can’t grant a request because it is illegal when this isn’t the case)."]}, {"course_id": 54, "course_code": "BET 580", "course_name": "BET580 - Consulting (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["BET 580", "View requirements for BET 580", "The knowledge you develop in this course will be critical if you become a consultant for a traditional management consulting firm, a business analyst at a technology firm, an independent consultant, or an “internal consultant” in a large company.", "In general, one half of each class will be used to discuss concepts and the other half will be dedicated to discussions, guest speakers or group exercises.", "Identify the root cause of a business problem so it can be logically addressed in a consulting project.", "Become familiar with the consulting industry and the typical activities of management consultants at strategy firms, Big 4 accounting firms and systems integration firms, as well as independent consultants and internal consultants.", "Guest Speakers", "Defining and structuring problems", "GPS", "Tools & Methodologies", "GPS", "Teamwork & Facilitation", "Fermi Problems and", "Ch10.2 Project & Financial Planning", "Design Thinking", "Ethics & Professionalism", "GPS", "Business Model Innovation", "Business Strategy Consulting", "March 25*", "GPS", "Ch 10: Sell the Solution – Core Message and Storyline", "Consulting Careers", "This is usually comprised of some textbook readings and a fictitious (and often pretty entertaining) “case study” featuring a consulting situation.", "We’ll talk about each case study in detail during class.", "One of the core skills for many consultants is the ability to bring structure to chaotic business problems by breaking them into parts that can be analyzed using various techniques.", "It is only to break the problem into smaller components so it can be tackled in a methodical way by a consultant.", "As with the Business Problem Analysis, you must clearly identify the problem faced by the company and break it into components before doing the research and proposing solutions to the CEO.", "Like your individual Business Problem Analysis (above), the proposal should be built around a structured break-down of a problem."]}, {"course_id": 57, "course_code": "BLKST 103", "course_name": "BLKST103 - Combating Racisms (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["11:30AM -", "This happened in conjunction with the kidnapping and forced, stolen labor of enslaved Africans who suffered the horrors of the transatlantic slave trade.", "Students will learn methods of communicating and pursuing anti-racism in culture, society, and in personal and professional interracial relationships.", "Students will be challenged to apply course material to real issues of racisms in local contexts and communities.", "Students will become familiar with key terms and concepts in race, racism, and white supremacy.", "Define racism and reconize its many forms.", "Define anti-racism and recognize its many forms (tactical and strategic).", "Describe and explain key ideas and concepts concerning the social construction of race and ethnicity.", "Identify historical and current structures of power, privilege, and inequality that are rooted in racism.", "Articulate and critically examine personal beliefs and opinions about race, antiracism and anti-Blackness and describe the weight these beliefs and opinions carry.", "The class will spend time learning about and practicing introspection into their own self identities as a means of grounding oneself to engage in conversations about race.", "This section will also explore the construction of race as opposed to the idea of race as a fixed biological trait.", "The second module will look at the history of racism in Canada and the U.S.", "Module 3: Engaging and challenging racism", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Anti-racism statement", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 73, "course_code": "BME 381", "course_name": "BME381 - Biomedical Engineering Ethics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Biomedical Engineering Ethics Winter 2025", "09:30AM - 10:50AM E7 4417", "I can also be reached by Teams for all virtual meetings.", "This course explores ethical issues in biomedical engineering practice, including professional ethics, medical ethics, the ethics of human and animal subject use in biomedical research, and the impact of biomedical engineering solutions on society and the environment.", "This course aims to guide students in understanding the complex relationships between design, biomedical technologies and society and to appreciate how such an understanding can improve design outcomes from the user, community, national, and global perspectives.", "Identify and evaluate considerations that influence ethical decisions regarding design, modification, and use of biomedical technologies, and the ethical concepts and arguments relevant to these practices (6 a, b, c; 7 a, b; 10 a, b, c);", "Create rational solutions to ethical situations of concern related to biomedical engineering (6, 7);", "Demonstrate an understanding of the social responsibilities of biomedical engineers (8 a, b);", "Describe the importance of social factors affecting development, uptake, and impact of biomedical technologies on society in both developed and developing countries (7, 8).", "This course will focus on and primarily measure your aptitude in the following graduate attributes:", "Demonstrate knowledge of effective team attributes and processes", "Communication skills  An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Can present information, arguments and analyses accurately and reliably within the profession and to society at large using appropriate documentation and vocabulary", "Professionalism  An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Describe the importance of codes, standards, best practices, laws, and biomedical regulations within engineering.", "Identify ethical and unethical behaviour in professional situations (including the use of biomedical technologies).", "in engineering projects.", "Identify equitable and inequitable situations or behaviours", "1 January 7th, 9th Course overview: Why study biomedical engineering ethics?", "Introduction to ethics Save the Last Word:  Introduce Yourself   Enrol as initiators and responders in Online Discussion Roles Schedule by January 10th.", "Consequentialism", "Virtue Ethics and the Ethics of Care", "Metaethics and applied ethics", "The social contract", "Non-maleficence and beneficence", "Value of life and quality of life", "The ‘professional’ and biomedical engineering; Codes of Ethics", "Safety, risk, and reliability in design", "Research on animals: ethical considerations", "The (biomedical) ethics of artificially intelligent systems and Robotics", "Human-technology interfacing and medical devices", "Public and private goods and the engineer", "Product life-cycle and sustainable design", "ESOC Critical Analysis due April 3rd", "Proposal: Critical Analysis of Ethical Situation of Concern (due Feb. 28th) 2%", "Final Paper: Critical Analysis of Ethical Situation of Concern (Due April 3rd) 23%", "7.5% of the final grade for the course will be based on participation in multiple-choice polls connected to the course lectures.", "When answering a poll, select a multiple-choice answer (a, b, c, etc.).", "Tutorial workshop: Analysis of an ethical situation of concern", "The midterm will consist of a series of multiple choice questions testing your knowledge of the material covered up to and including the class of Thursday, February 6th.", "Critical Analysis of a Biomedical Ethical Situation of Concern", "The topic of the paper will be the description, analysis, and critique of a biomedical or other ethical situation of concern you have experienced; it could be a situation encountered during a co-op work term, by a close family member, or by a friend.", "The exam will consist of a mix of multiple-choice questions similar to the midterm but weighted toward material covered after the reading week, and an 'ethical situation of concern' (ESOC), similar to those in the tutorials.", "I completed my PhD in the philosophy of physics (specializing in foundations of quantum mechanics) at Western University, and completed a post-doc in the School of Environment and Resource Studies at UW.", "My research focusses on the nature of scientific knowledge, its bearing on climate change governance and other social policies, and problems of social coordination and game theory in what ecologists call the 'Anthropocene'.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 74, "course_code": "BME 530", "course_name": "BME530 - The Healthcare System (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "The Healthcare System Fall 2024", "03:30PM - 05:20PM", "03:30PM - 04:20PM", "04:30PM - 05:20PM", "A broad introduction to the Canadian healthcare system, with emphasis on factors related to biomedical engineering.", "Explain the organization and function of the Canadian Healthcare System (CHS)", "Explore and describe specific patient pathways in the CHS", "Identify opportunities and barriers related to innovation in CHS", "Analyze and identify limitations and barriers in the CHS performance", "Topics Deliverables", "Introduction and logistics Kritik on-boarding", "Healthcare providers Writing A1; Quiz 2", "Healthcare infrastructure Feedback A1; Quiz 3", "End-of-life", "Healthcare system assessment Writing A3", "Medical Devices Feedback A3", "AI & Healthcare system Feedback A4", "Marchildon, Allin & Merkur, Canada: Health System Review 2020, North American Observatory on Health Systems and Policies Available online Yes", "Hopp & Lovejoy, 2013, Hospital Operations: Principles of High-Efficiency Healthcare Optional (North American Observatory on Health Systems and Policies from UW Library)", "Kritik learning tool", "To register, an email invitation will be sent to your school email account that contains information on how to register for a Kritik account and enroll in the course.", "Waivers will be available for those in need.", "Each writing assignment will describe a patient's experience interacting with the Canadian healthcare system, and analyze the key strengths and weaknesses.", "The project should address the historical context of the condition and its treatment in Canada, roles of various organizations, information flow, key bottlenecks and/or limitations in care, and potential barriers to their implementation.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 75, "course_code": "CI 100", "course_name": "CI100 - Cultural Identities Today (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["In this course students examine a wide range of cultural representations (such as images, ads, short films) and encounter various modes of cultural analysis, thereby developing their ability to reflect on, and understand, the ways in which we form cultural identities in the world today.", "Students discuss topics such as nation and culture; cultural appropriation; difference and race; stereotypes; Orientalism; gender and identity.", "This course examines the influence of cultural background and affiliations on personal identity.", "Students gain fundamental skills in understanding, analyzing, and interpreting the role that culture plays in the world today, with special attention paid to the Canadian context.", "define different concepts of culture and identity,", "recognize various ways of understanding culture and identity,", "examine the role of representation in the formation of cultural identities, and", "reflect on your own cultural and identitary biases.", "Module 12: Language and Disability; the Medical and Social Models of Disability Module 12 Discussions", "Regular Deadlines", "Bask in the satisfaction of completing a task on time.", "Sometimes life gets in the way of your studies.", "This course includes the independent development and practice of specific skills, such as critically engaging with concepts of culture and identity, reflecting on your own biases and ways of seeing the world, being able to engage and analyze media portrayals of culture and identity, and developing your writing skills.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 76, "course_code": "CI 200", "course_name": "CI200 - Transcultural Studies (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Prof. James Skidmore", "This term we’ll be exploring transculturality in two ways: we’ll examine different aspects of transcultural theory on their own terms, and we’ll use these ideas to analyze some fictional narratives about migration and cultural interaction.", "describe the key concepts of transcultural studies.", "analyze complex cultural issues with greater precision and insight.", "I HAVE QUESTIONS!", "I HAVE ANSWERS!", "Cross-listed courses", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 80, "course_code": "CIVE 491", "course_name": "CIVE491 - Engineering Law and Ethics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["G. Smeijers", "email", "The objective of the course is to introduce you to basic principles of law and ethics relevant to the practice of civil engineering.", "Understand the basic structure of Canada’s legal system.", "Understand the basics of Canada’s environmental and health/safety regulatory systems.", "Be able to review a fact pattern and identify concerns related to all of the above.", "We will cover a topic each week of the term as set-out below.", "1              Introduction to Law and Regulation", "As such, any of the following are absolutely inappropriate in the context of this course and will be handled accordingly:"]}, {"course_id": 81, "course_code": "CMW 363", "course_name": "CMW363 - The Church's Song (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Students will practice methods of song analysis, assess musical meaning, value and effects in various cultural contexts, and reflect on written and oral transmission of music.", "recall the major figures and movements in church history that contribute to contemporary hymns and songs", "articulate the benefits of singing for the life of a church community", "analyze hymns and songs for form and style", "connect cultural movements in Christian history with hymn and song styles", "utilize research tools for context and interpretation of individual hymns and songs", "Readings", "xxv-xlvii;", "“‘Do It Again’: Chart-Topping Worship Songs and the Churches Behind Them.”", "Christian Doctrine in the Hymn", "Biblical Interpretation", "Song-writing Workshop: Dr. Karen Sunabacka", "Melody and Identity", "Songs for Song Analysis", "Evangelism", "Intimacy", "Song Analysis Preparation Worksheet", "Song Analysis March 18 30%", "Local", "vis a vis “Where should our song be going?:", "New Songs of Celebration Render: Congregational Song in the Twenty-First Century.", "Available in the UWaterloo Bookstore", "Songs for Song Analysis 5", "Song Analysis Preparation Worksheet 15", "Song Analysis 15", "Memorize a song: choose a song (at least eight lines long) not discussed in class to memorize and present to the class.", "The Songs for Song Analysis and Preparation Worksheet are preparatory pieces for this paper.", "Term Paper: A research paper examining the hymn repertory of a particular congregation.", "Each student will choose a song to introduce and then sing together.", "This course includes the independent development and practice of specific skills, such as analyzing text and music, and applying contextual study to song interpretation and performance.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 82, "course_code": "CMW 364", "course_name": "CMW364 - Worship and its Music (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["02:30PM - 05:20PM", "Email: ksteiner@uwaterloo.ca", "Field trips to services of various traditions.", "CMW 364: View requirements for CMW 364", "The first part of the course examines Christian worship as a public ritual and the ritual functions of music in Christian worship with an emphasis on Indigenous and Black perspectives.", "The second part of the course gives a brief introduction to worship in Christian history, focusing on specific cultural issues.", "Students will integrate history and ritual study into observation and analysis of two Christian worship services, and practice identifying the ritual functions of music through the creation of a worship playlist.", "Describe relationships between ritual, belief, and life", "2. Identify functions of music in Christian worship", "1 Jan 10 Introduction to Worship", "4 Jan 31 Ritual language and culture", "Articles and Chapters", "Teresa Berger, “Ecology and Worship,” in Theological Foundations of Worship: Biblical, Systematic, and Practical Perspectives, ed.", "J-Glenn Murray, \"The Liturgy of the Roman Rite and African American Worship\" Readings in Afrcan American Church Music, vol.", "“This Is My Daily Bread: Toward a Sacramental Theology of Evangelical Praise and Worship.”", "Major Worship Analysis and Presentation 35%", "This course includes the independent development and practice of specific skills, such as observation and analysis of rituals and music.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 84, "course_code": "COMM 400", "course_name": "COMM400 - Entrepreneurship, Technology and the Emerging Information Economy (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["05:00PM - 07:50PM MC 4058", "A study of the spirit of entrepreneurship in the technology industry, opportunities emerging in the new information economy, and the implementation issues associated with starting an entrepreneurial venture in today's rapidly changing environment.", "Many of the concepts covered will also be applicable to careers in the technology industry or in information-based companies, where \"intrapreneurship\" is an emerging theme.", "The Changing Technology Environment – How is it disrupting business models and entire companies and industries?", "Understand the Entrepreneurial Process -- What issues are involved in starting a business and managing it through the various stages of its life cycle?", "Better understand Corporate Innovation -- How are entrepreneurial skills and approaches increasingly important to all careers?", "W. Chan Kim & Renee Mauborne, “Blue Ocean Strategy” No", "These team assignments will be made online at the end of the first week of classes.", "Your team will be responsible for submitting a reflection on your assigned guest entrepreneur.", "Each chapter typically includes five (5) or more assigned multiple choice questions and some occasional free form reflection questions.", "Speaker Sessions", "Pandemic contingency planning:", "Similar content pre-recorded sessions can be shared."]}, {"course_id": 109, "course_code": "CS 492", "course_name": "CS492 - The Social Implications of Computing (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["The Social Implications of Computing Winter 2025", "08:30AM - 11:20AM AL 124", "Students learn how to make informed judgements about the social and ethical consequences of deploying computer technologies and how to foster critical thought and professional responsibility.", "Identify important social implications of computerization;", "Combine their opinions with information from existing research in both written and oral formats;", "Identify where their knowledge of computer science provides a valuable contribution to the overall dialogue about the social and ethical implications of computing.", "Proactively identify potential ethical issues related to data and new technologies and applications;", "Evaluate the potential risks and benefits of different courses of action that could be taken with respect to data and new technologies and applications;", "Succinctly and confidently articulate and justify your views on ethical issues related to data and new technologies and applications;", "for CS 492 Section 003 in particular", "That said, please do not attend class if you are sick and should be in self-isolation; just let your instructor and TAs know you are ill and unable to attend class.", "A link to join the Slack channel may be found here: https://join.slack.com/t/cs492section003w25/shared_invite/zt-2wl26b5p3-pxMv5Z6mRjbOoNybeKXSwA.", "Evaluation in this course will be comprised of the following three components:", "A note on the use of large language models (“LLMs”) and generative AI systems: While it is my strong preference that students not use these systems and prepare their journal entries entirely on their own, students are permitted to use such systems to improve the technical quality of their writing, but they may not use them to do their writing for them.", "If you do use one of these systems, you must inform us that you have done so and how you used it.", "Unlike the weekly commentaries or position papers, students are encouraged to experiment with LLMs and generative AI systems and to incorporate them as part of their small-group projects!", "A five-minute video tour of the project and its findings.", "This should be rare since overall grades can easily be improved by submitting an additional written assignment.", "EMPOWER ME in China", "In particular:", "IP includes items such as:", "In particular, in this Ethics Workshop, we will discuss bias and discrimination in data and algorithms, and how new technologies and applications can contribute to and ameliorate these problems."]}, {"course_id": 113, "course_code": "DUTCH 271", "course_name": "DUTCH271 - Dutch Culture and Society (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Instructor: Margreet de Rooij-Mohle", "The course explores key concepts informing Dutch cultural identities.", "Have acquired skills and experience to critically examine cultural expressions and manifestations.", "Have a general understanding of the current organization (political, economical, social, and geographical) of the Netherlands.", "Have discovered and discussed multiple cultural expressions through art, literature, and architecture.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 114, "course_code": "ENBUS 102", "course_name": "ENBUS102 - Introduction to Environment and Business (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Environment and Business Fall 2024", "Come by and introduce yourself :)", "Introduction of ways in which business has and is responding to environmental and business issues; business and sustainable development; issues of corporate/business greening.", "The central objective of this course is to explore the genesis of sustainability through a survey of the history and development of the ever-changing interface between business, society, and the environment.", "2. Understand why firms have sought to look beyond shareholders in how they understand and build value", "3. Discuss the practices firms engage in and how those practices have changed over time", "Sep 24 Linear to Systems Thinking", "Westley, F. What is a system?", "Systems thinking - The new approach for sustainable and profitable businesses.", "Weak versus Strong Sustainability", "Environmental Economics versus Ecological Economics", "UN Sustainable Development", "Oct 1 Evolution of Business Sustainability", "Oct 3 From Shareholders to Stakeholders to Social License", "Network for Business Sustainability", "Oct 8 Regulations and Command and Control", "Li, S. The business case for ESG: Why Companies Adopt Environmental Value Beyond Social Responsibility.", "Thriving at Waterloo Avoiding Plagiarism: Citations and Referencing", "Graber-Stiehl, I. How bogus 'eco-friendly' products trick you.", "Thriving at Waterloo Avoiding Unauthorized Collaboration", "Sustainable Finance", "Weber, O., & Feltmate, B.  Introduction to Sustainable Finance (pp 3-24), In Sustainable Banking and Finance: Managing the Social and Environmental Impact of Financial Institutions.", "Li, S. The business case for ESG: Why Companies Adopt Environmental Value Beyond Social Responsibility.", "The exam will include a combination of multiple-choice and short-answer questions.", "You must specify the sections you want addressed and a rationale for why it deserves consideration, with specific reference to the rubric and assessment criteria.", "Only in exceptional cases will this penalty be waived!", "Intellectual property includes items such as:", "Anti-racism Statement", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 115, "course_code": "ENBUS 112", "course_name": "ENBUS112 - Operationalizing Sustainable Development within Business (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "10:30AM - 12:20PM", "RCH 211", "04:30PM - 05:20PM", "04:30PM - 05:20PM", "TA: These TAs will be facilitating the tutorial sessions and helping grade assessment items.", "Karen Chen karen.chen@uwaterloo.ca", "A variety of guest speakers will demonstrate how the greening of industry has affected organizational structure in different business sectors.", "This course includes a review of business case studies where environmental management changes have resulted.", "Understand the role of business in sustainable development;", "Articulate what motivates business to embrace sustainable development;", "Explain the value-add that sustainable development brings to business;", "Apply concepts around sustainable development in business case studies.", "Introduction: Course Overview (No Tutorial First week)", "Fraud Triangle – regulations v. consumer demands; rapidly changing sector Volkswagen", "Branding", "Cultural appropriation", "Nike Sports Hijab", "Coffee Supply chains & certification Transcend Coffee", "Meat and Meat Alternatives", "Shifting consumer behaviour", "Beyond Meat", "Module 4. Resource Allocation and Conservation", "Impact Investments", "Inclusion", "Impact through Real Estate", "You are required to purchase and use the Course Pack Ivey Publishing for case studies.", "Every effort has been made to reduce this cost, including looking for free case studies, and SEED faculty developing their own (no cost) cases.", "Notice of Recording", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "This course includes the independent development and practice of specific skills, such as understanding sustainability concepts and frameworks, application of sustainable development tools in businesses, academic writing, and critical-thinking.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 116, "course_code": "ENBUS 203", "course_name": "ENBUS203 - Green Entrepreneurship (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["B. Wylie-Toal", "Email: bwylieto@uwaterloo.ca", "This course uses the case study method to examine the challenges of starting, funding and operating an early-stage social change venture in a developing country.", "Students explore the complexities of managing and sustaining growth, the role of governing boards, and the role of private sector partnerships and resources.", "Environmental issues, including climate change, are some of the most pressing concerns of the 21st Century.", "The first investigates the concept of green entrepreneurship.", "The second part of this course explores the role of strategy and business models in helping to create financial value for the entrepreneur while simultaneously redressing the environmental problem at the core of the business.", "Understand the central concepts of entrepreneurship in general, and green entrepreneurship more specifically", "Apply that knowledge and gain experience in entrepreneurship by identifying, developing and proposing a concept for a new green venture", "Recognize the challenges of navigating ambiguity and gain experience in self-managing your learning", "Course Overview and Introduction to Entrepreneurship", "Foundations: Systems Change, Social Innovation, and Green Entrepreneurship", "Foundations: New venture life cycles and managing venture development", "Milestones: The importance of problems and opportunity recognition", "Milestones: Business strategy and business models", "Milestones: Perceived legitimacy and the start-up pitch", "Five of these activities will be for final grades and will be pass-fail.", "As a class, we will use a stage-gate process to track and manage the progress of each start-up team, giving the whole class visibility into the pace of progress and lessons learned by you and your peers.", "As part of the challenge, each team will complete a problem and solution brief, an overview of the strategy and logic behind the business, as well a business model for the new enterprise.", "In addition to summarizing these details in a final report, each team will pitch their business to the class at the end of the term.", "However, the team contract is due in September and the Pitch is due November 29th.", "Approved Self-Declared Absence Exception to Late Submission Policy:", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 117, "course_code": "ENBUS 211", "course_name": "ENBUS211 - Principles of Marketing for Sustainability Professionals (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["PHY 313", "Zachary Folger-Laronde", "Email: zfolgerlaronde@uwaterloo.ca", "Name Amaryah DeGroot Sabrina Zaman", "Email a9degroot@uwaterloo.ca sabrina.zaman@uwaterloo.ca", "Topics that will be explored include green consumerism; greenwashing, the incorporation of environmental considerations into successful products and services; the role of social marketing, government regulations, and other incentives related to green marketing.", "Understand and explain core marketing concepts and issues, particularly the \"marketing mix\"", "Describe current and past green/sustainable marketing trends", "Explain key strategies for motivating and targeting consumers towards sustainable options", "Apply strategies and tools that can be used to address green/sustainable marketing trends", "Analyze application of course concepts to a specific organization (brand and product line)", "Evaluate marketing strategies (i.e., through case studies and other examples)", "Introduction to ENBUS211, Overview of Sustainable Marketing, Marketing Mix Introduction", "Sustainability-based Strategic Planning", "Sustainability & Ethical Decision-Making", "Discovering Value via Market Analysis", "Communicating Value via Integrated Marketing Programs", "Providing Value via Sustainable Product Strategies", "Providing Value in Sustainable Supply Chains", "Delivering Value in Retailing", "Peer-evaluation – July 30th by 11:55PM", "The posted lecture slides will focus on the key concepts and theories from the required text.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 118, "course_code": "ENBUS 302", "course_name": "ENBUS302 - Strategies for Environment and Business (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Strategies for Environment and Business Winter 2025", "Case studies will be reviewed to identify barriers to adopting environmental priorities and the processes which proved successful in overcoming these obstacles.", "Following a typical strategic management cycle (or process), we review managerial decisions related to environmental scanning, strategy formulation, strategy implementation, and evaluation and control.", "We use recent business reports and case studies to apply these concepts.", "We will illustrate where relevant using the successes and failures of businesses which have attempted to adopt sustainability principles in their strategies and practices.", "Describe and assess the connections between fundamental strategic motivations of business and sustainability", "Introduction to Strategy and Strategic Management", "Evaluating the External Environment", "Strategy Formulation Basics", "Selecting Business-Level Strategies", "Innovation Strategies", "Reading Week - no classes", "Selecting Corporate-Level Strategies", "Hart & Milstein (2003)", "Competing in International Markets", "Executing Strategy through Organizational Design", "March 24 and March 26", "Strategy Project - Part 2: Environmental Scan & Current Strategy Orientation 15%", "A grade day provides a 24-hour extension on the individual submission.", "Please keep these in case there is a situation we have to refer to them.", "This course will have students working in small groups in the Strategy Assignment.", "No group work will be permitted during midterms and the final exam.", "Missing the midterm for a valid reason", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "This offer stands only for the first student to complete this task.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 119, "course_code": "ENBUS 309", "course_name": "ENBUS309 - Behaviour Change and Sustainability (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Behaviour Change and Sustainability Fall 2024", "08:30AM - 11:20AM EV3 4408", "Social psychology and social marketing concepts will be explored such as community-based social marketing, diffusion of innovations and theory of planned behaviour.", "2. Consider behaviour change through a systems lens (i.e. identifying the interplay between actors, infrastructure, technology, policy and culture)..", "3. Contemplate ethical issues related to behaviour change campaigns", "4. Critically evaluate behaviour change campaigns (e.g. strategies, message framing and communication techniques)", "5. Identify and explain various behaviour change principles that are commonly used in the development of social marketing strategies", "Apply the Community-based Social Marketing framework to a specific behaviour related to sustainability", "Activity: Warm-up activities in small groups", "The complexity of behaviour change", "Case study: 150 years later, electric vehicles are still struggling to become mainstream", "The ethical issues of behaviour change", "Case study: US Election, Climate change communication & misinformation", "Do scare tactics work?", "What is the role of information in the behaviour change equation?", "Case study: How Canadians Respond to Information About the Risks of Eating Meat; The Green Cooking Show", "Principles of change: Harnessing the power of social norms and social diffusion", "Harnessing the power of social norms and diffusion", "Introducing Community-Based Social Marketing (Step 1 & selecting target audience)", "Identifying barriers and benefits", "CBSM Step 3: Developing strategies and communications", "Linking barrier and benefit research to strategy and communication tools (i.e. to reduce barriers and increase benefits of the behaviour you are trying to encourage)", "Toronto’s Electric Vehicle Discovery Centre / Home Energy Retrofits", "Fostering sustainable behaviour: An introduction to community-based social marketing (3rd edition).", "This book can be accessed for no cost at the following URL: https://login.proxy.lib.uwaterloo.ca/login?url=https://search.ebscohost.com/login.aspx?direct=true&AuthType=cookie,ip,uid&db=nlebk&AN=462013&site=ehost-live&scope=site Yes", "Environmental messaging critique/comparison (Individual assignment) 25%", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 120, "course_code": "ENBUS 310", "course_name": "ENBUS310 - Introduction to Sustainable Finance (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Sustainable Finance Winter 2025", "10:00AM - 11:20AM RCH 306", "Email: tingting.wu@uwaterloo.ca", "Email: j3graham@uwaterloo.ca", "Identify and Explain Concepts and Investment tools in Sustainable Finance", "Apply critical thinking skills to discuss the contribution and limitations of concepts and tools in promoting sustainable finance", "Examine topic(s) in sustainable finance by analyzing empirical evidence using quantitative methods", "Develop business analytical skills focusing on ESG", "Communicate topics in sustainable finance to both professional and general audiences with enthusiasm", "Financial Theories", "Week 2 (Jan. 16th) Introduction of Concepts in Finance", "Introduction to Financial and ESG data", "Week 4 (Jan. 28th & 30th) Introduction to Financial, ESG, and Environmental database; A review of quantitative methods.", "and Emissions database", "ESG Ratings", "ESG Rating Agencies for the same company", "Sustainable Finance and Corporate Finance", "Impact and Responsible Investing", "Comparing Characteristics of ESG funds and Investor Decisions", "Sustainable Finance & Banking", "Value-based approaches", "Risk-based approaches", "Big Six Chartered Banks in Canada and their approach to sustainable Finance(Value-based vs. Risk-based)", "Carbon Pricing Impacts on housing;", "ESG risks impacts on REITS (Commercial real-estate funds)", "Central banks' contribution towards sustainable economy across the globe", "Creating shared value: Redefining capitalism and the role of the corporation in society.", "Task Force on Climate-related Financial Disclosures  (2017).", "Recommendations of the Task Force on Climate-related Financial Disclosures.", "The effects of climate change-related risks on banks: a literature review.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 121, "course_code": "ENBUS 315", "course_name": "ENBUS315 - Fashion, Consumption, and Sustainability (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Develop recommendations related to your own sustainable consumption patterns, with a specific emphasis on fashion", "Explore Explore a specific issue related to sustainable fashion/consumption", "6 June 12 Textiles and their impacts", "10 July 10 Alternative models to curb consumption", "Zero Waste Fashion Design by Timo Rissanen and Holly McQuillan, Bloomsbury Visual Arts, 2018.", "Fashion Takes Action - Creating a Conscious Fashion Future", "Home - Fashion Revolution : Fashion Revolution", "Kate Fletcher", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 122, "course_code": "ENBUS 405", "course_name": "ENBUS405 - Introduction to Life Cycle Assessment (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Life Cycle Assessment ENBUS 405/Susm 675 Winter 2025", "11:30AM -", "This course builds students' technical competencies in life cycle assessment (LCA) and in critical analysis of products' environmental impacts through an understanding of life cycle management.", "Course content covers the International Organization for Standardization (ISO) life-cycle assessment framework, how to conduct technical LCA (including applying quantitative approaches using LCA software and databases, as available and appropriate), challenges of application of LCA to a range of product systems, limitations of LCA, and product life cycle management concepts for business and policy decisions.", "Describe and explain the 4 phases in doing an LCA study and explain the limitations in applying the framework", "Apply the technical skills required to conduct an ISO-compliant LCA", "4. Understand and articulate the appropriate use and limitations of LCA as a tool for sustainability assessment", "1 Introduction to course, case study and Major LCA Project Jan. 7", "Introduction to LCA AND ISO Framework Jan. 9", "3 Phase 2: LCI -Part 1: Quantitative methods for LCA- Estimations and assumptions Jan. 21 ICE 3- Estimations and Assumptions", "Phase 2: LCI -Part 4: Co-product treatment Feb. 30 ICE 6- Allocation calculations", "7 Test review and excel best practice for project calculations Feb. 25", "Case- LCA of Hand-Drying Systems Available on Learn under Content/Readings as additional support to lectures and for doing your own LCA Yes", "ICE3 Estimations and Assumptions Exercise 2", "ICE6 Allocation Calculations 2", "Life Cycle Impact Analysis Exercise 8", "Part 2: openLCA model structure 10", "Only in exceptional cases will this penalty be waived!", "In the email, you must specify the sections you want addressed, a rationale for why it deserves consideration, with specific reference to the rubric and assessment criteria.", "Policy on Use of Electronics and Electronic Media in Class", "Laptop use in-class", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "This course includes the independent development and practice of specific skills, such as problem-solving, critical thinking, data analysis and interpretation, and communication skills.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 123, "course_code": "ENBUS 408", "course_name": "ENBUS408 - Policy Instruments for Sustainability (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["RCH 204", "Understand basic types of environmental policy instruments and the reasons for their use", "Apply foundational economic concepts to environmental policy creation", "Understand basic market functions and their relationship to efficiency in the context of environmental regulation", "Understand the role of innovation in environmental policy and the role of policy in promoting innovation", "Identify emerging forms of environmental governance and policy instruments", "Week 1 (September 4) –Introduction to Course and key concepts", "Readings", "Introduction to the Course", "Week 2 (September 9) - The Costs and Benefits of Environmental Protection", "Readings", "Keohane and Olmstead, cc.2-3", "S. Kelman, (1981) “Cost-Benefit Analysis: An Ethical Critique” AEI Journal on Government and Society Regulation, 5", "Economic Efficiency and the Environment", "Cost Benefit Analysis", "Discounting", "Week 3 (September 16) - Markets and Efficiency", "Readings", "Readings", "N. Ashford and C. Caldert, (2008) Excerpt, “Economic Efficiency and the Technological Dynamic”, in Environmental Law, Policy and Economics, MIT Press", "Edward Rubin, “Innovation and Climate Change”  in Innovation: Perspectives for the 21st Century” (BBVA, 2011) (skim)", "Implications of Using Market Instruments", "Week 5 (September 30) - Introduction to Policy Briefs", "Readings", "Readings", "Keohane and Olmstead, c.10", "(2007), “Designing payment for ecosystem services: Lessons from previous experience with incentive-based mechanisms”, Proceedings of the National Academy of Sciences (PNAS) (skim)", "Examples of Market Instruments", "Readings", "The Way Forward for Ontario: Design Principles for Ontario’s New Cap-and- Trade System", "Environment and Climate Change Canada, “Carbon Pollution Pricing: Options for a Federal GHG Offset System” (2019)", "Carbon market design considerations", "Readings", "Carbon Emission Reduction Strategy Assignment Due", "Information as Regulation", "Readings", "Readings", "Readings", "Readings", "**AVAILABLE ONLINE THROUGH THE LIBRARY:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 124, "course_code": "ENBUS 411", "course_name": "ENBUS411 - Corporate Social Responsibility in Practice (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["02:30PM - 05:20PM", "E-mail:  sean.geobey@uwaterloo.ca", "E-mail :  h7bashir@uwaterloo.ca", "The course will consider methods of creating a culture of integrity; examine and evaluate methods such as due-diligence processes, risk assessment, sustainability assessment to integrate responsibility into day-to-day business positions; and evaluate social and sustainability reports; evaluate methods to determine the link between responsibility and increased profitability and benchmark responsibility in different business sectors including non-profit organizations.", "This course is an examination of Corporate Social Responsibility (CSR) in theory and practice.", "Students will investigate the ways in which global – but also local – ‘firms’ pursue business processes in socially and environmentally responsible ways.", "The course adopts an applied, forward-looking, and solutions-oriented perspective, and aims to equip upper-level students with the critical thinking and reflective management practice skills necessary to respond effectively to the widespread CSR challenges facing managers today.", "Given the breadth of material encompassed within the scope of CSR, students will initially be exposed to a subset of CSR topics through a series of traditional lectures as well as guest speakers, peer learning, and self-led learning.", "Describe how global environmental, social, and economic trends are shaping the context for management practice", "Demonstrate familiarity with a range of CSR concepts, models, practices, and measures", "Comprehensively evaluate current CSR efforts within organizations across different functional areas", "Explore course concepts for a ‘real world’ application to enhance learning", "System Map 40", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 125, "course_code": "ENVE 391", "course_name": "ENVE391 - Law and Ethics for Environmental and Geological Engineers (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Law and Ethics for Environmental and Geological Engineers Winter 2025", "G. Smeijers", "email", "Rachael Trillium Messenger-Lehmann", "1              Introduction to Law and Regulation", "We will cover a topic each week of the term as set-out below.", "1              Introduction to Law and Regulation", "Student Responsibilities and Conduct Expectations", "As such, any of the following are absolutely inappropriate in the context of this course and will be handled accordingly:"]}, {"course_id": 126, "course_code": "ERS 100", "course_name": "ERS100 - Foundations: Environment, Resources and Sustainability (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["ERS 100", "08:30AM - 10:20AM EV2 2002", "Introduces analytical approaches for problem definition and problem solving that are appropriate for a wide range of environment and resource issues.", "Also examines alternative approaches that recognize the broader context and underlying roots in ethical positions and ecological, economic, and institutional systems.", "View requirements for ERS 100", "This course provides foundations for studying in the School of Environment, Resources and Sustainability.", "The course emphasizes the need to understand how we can use social, natural and physical sciences to understand and solve environmental and resource problems in sustainable ways.", "We will learn how to recognize the broader context around environment and resource issues and examine the roots of our problems within and ecological, political, social, and economic systems.", "This course is structured in a semi-flipped way.", "The lecture portion of the course will explore key concepts and ideas further, while the activity will help you engage with the material in a student-centered approach to learning.", "Define foundational concepts for studying in SERS, including systems and sustainability", "Identify links between the social and ecological aspects of environmental problems, locally and globally", "Evaluate sources of information, including mainstream media sources and peer reviewed journals, to develop information literacy and critical thinking skills", "Identify the strengths of different kinds of data collection and analytical approaches for environmental problem solving", "Examine and evaluate research about complex environmental problems", "Course Introduction", "- A deeper look at the SERS diplomas and pathways", "Sustainability:  Diverging and Competing Understanding", "Systems Assignment – Group Formation and Discussion on Assignment Expectations", "Wicked and Complex Problems: Systems and Resilience Thinking", "Systems Assignment – Research Session", "Sept 27th @11:55 p.m. EST", "Knowledge Systems and World Views (Indigenous and Western)", "Systems Assignment – Two-Slide Presentations", "Systems Assignment – Group Discussion of Systems Maps", "In Tutorial: Systems Assignment 2 - Systems Map Group Presentation/Discussion (5%)", "Research Questions, Data Collection, Evaluation and Communication of Data", "Systems Assignment – Presentations", "Social Systems and the Environment: Constraints, Transformations and Resilience", "Systems Assignment – Presentations", "Ecological Systems: Conservation and Resilience", "Systems Assignment 2: Systems Map Group Discussion (In Tutorial: Week 6) 5%", "Systems Assignment 3: Final Group Presentations (In Tutorial: Weeks 7 & 8) 10%", "(similar to A and A+ in the previous system)", "(Similar to B+ and A- in the previous system)", "(Similar to B- and B in the previous system)", "(Similar to D-, D and D+ in the previous system)", "(Similar to F and F+ in the previous system)", "**", "Mental health, creating a community of inclusion, being a global citizen and participating as a citizen scientist, is an important part of your SERS journey.", "Systems Assignment", "In this course, we delve into analytical approaches for defining and solving environmental and resource issues, emphasizing the importance of understanding these problems within their broader contexts.", "This assignment is designed to enhance your grasp of systems thinking—a crucial skill for addressing complex environmental challenges.", "By engaging with a case study, you will explore the intricate web of factors that contribute to environmental issues, identify key nodes within these systems, and develop a systems map to visualize these connections.", "Defining foundational concepts: You will apply systems thinking and sustainability principles to real-world environmental problems.", "Identifying links between social and ecological aspects: Your case study will highlight the interconnectedness of social and ecological factors, both locally and globally.", "Examining and evaluating research: You will critically analyze complex environmental problems through your case study, enhancing your research skills.", "Evaluating sources of information: By sourcing information from mainstream media and peer-reviewed journals, you will develop information literacy and critical thinking skills.", "Four smaller, scaffolded assignments make up this larger Systems Assignment.", "According to the authors of Skoden \"The purpose of this text is to offer support to individuals and institutions working towards understanding the colonial history of Canada and its ongoing impact on people who are First Nations, Métis, and Inuit.", "Skoden is designed to offer opportunities for reflection on what this truth means for each of us personally and professionally\" (pp.", "However, many of these ideas will be seen and discussed as you move on in your academic careers.", "A reflection written by each group member based on their role and experience in the discussion will be submitted individually for marking by Nov. 22nd @ 11:55 p.m. on LEARN.", "It will empower you to be more in control of your thoughts and feelings so that you can make better decisions, be happier, and navigate challenging conversations more effectively.", "Please complete the following lessons:", "To begin using Perspectives, please follow these steps:", "Create a username and password - Please use your last name and the last four digits of your student number.", "We will work to address these concerns.", "Excuses are not accepted in the case of crashed computer and lost or misplaced work.", "Create sub-headings for each of the main sub-sections (you can remove these or keep these later…they are intended as a guide to writing to ensure you address each sub-section!).", "*", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 127, "course_code": "ERS 215", "course_name": "ERS215 - Environmental and Sustainability Assessment 1 (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Environmental and Sustainability Assessment 1 Winter 2025", "Instructor: Felicitas Egunyu felicitas.egunyu@uwaterloo.ca", "An introduction to processes and techniques for incorporating environmental considerations in planning and evaluating proposals for future undertakings that may have significant social and biophysical effects.", "The course provides an overview of methodologies for, and controversies surrounding, the design and conduct of biophysical and socioeconomic impact studies, and the testing of reported findings.", "View requirements for ERS 215", "Key topics and themes will be elaborated on through videos and by regular attention to case studies.", "Assigned readings throughout the semester are critical for providing additional depth and breadth.", "Group reading discussion and assignments provide an opportunity for integrating key topics and themes, as well as for linking them with the broader scholarly literature on environmental assessment.", "From this course you will develop a key understanding of what an EA should be and therefore, you can apply this knowledge and understanding to any assessment act.", "Define the aims and objectives of environmental/impact assessments, as well as key terms and concepts in EA/IA", "Identify the roles and relevance of EA/IA as a potential venue that can contribute to sustainability", "Describe the different steps and components of an EA/IA process in Canada", "Apply EA/IA principles for best practices to case studies and critically analyze the strengths and weaknesses of environmental assessment", "Introduction to Environmental Impact Assessment: A Guide to Principles and Practice, 4th Edition.", "Introduction to Environmental Impact Assessment: A Guide to Principles and Practice, 4th Edition.", "Introduction to Environmental Impact Assessment: A Guide to Principles and Practice, 4th Edition.", "(Similar to A and A+ in the previous system)", "(Similar to B+ and A- in the previous system)", "(Similar to B- and B in the previous system)", "(Similar to D-, D and D+ in the previous system)", "(Similar to F and F+ in the previous system)", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 128, "course_code": "ERS 222", "course_name": "ERS222 - War and the Environment (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "02:30PM - 05:20PM", "This course examines environmental security and the political ecology of violence.", "War, colonialism, and other forms of social conflict are discussed as both drivers and consequences of environmental change including the extraction, consumption, and depletion of resources.", "Topics may include nuclear war and emerging technologies as existential threats to humanity; (neo) environmental determinism; eco-fascism and totalitarianism; and eco-terrorism.", "Hopeful insights for transitioning towards sustainability are drawn from rapid societal mobilization and transformation during wartimes and the role of the environment and environmentalism in peacebuilding.", "To develop an analysis of war and violence as a central socio-ecological process (i.e., violence and socio-ecological change as a dialectical relationship).", "To apprentice our social, emotional and analytical skills as learners and civic participants both inside and outside the classroom (e.g., as critically informed discussants, inquisitive and generous listeners, and civically-engaged inhabitants who are reflexive of the power relations inherent in any communicative space).", "List the socio-ecological impacts of militaries and violent conflict including direct and indirect costs as well as opportunity costs;", "Describe how militaries use and transform the environment strategically and how environmental politics and environmental change shape militaries and military strategy;", "Evaluate critiques of colonialism and capitalism as inherently violent socio-ecological processes;", "Compare and critique dominant theoretical paradigms for understanding the relationship between environmental change and violent conflict (i.e., neo-Malthusian scarcity hypotheses; neoclassical abundance or “resource curse” hypotheses; and political-ecological distributional and contextual hypotheses);", "and for states of nature and human nature;", "Critically analyze “eco-terrorism” as a political-legal construction and activist strategy (i.e., direct action);", "Appraise past rapid societal transformations during wartime to inspire policies for addressing today’s pressing socio-ecological crises;", "Facilitate small group meetings and discussions and strengthen a sense of collective responsibility;", "Improve skills for critical synthesis and efficient reading of academic texts.", "Readings", "Environmental Consequences of Warfare", "The Industrial Ecology and Geography of Warfare", "Biological & Environmental Determinism", "Environmental Security", "The Political Ecology of Violence", "Ecological Imperialism & Colonialism as a Socio-Ecological Process[JN1]", "Film: Invasion", "Pasternak S, Dafnos T. How does a settler state secure the circuitry of capital?", "Environment and planning D, Society & space.", "and Environmentalism of the Poor", "Read pp.1-22 and 39-44", "Environmental concerns of the Israeli-Palestinian Conflict", "Readings TBA", "& the Existential Threat", "Eco-Terrorism", "Environmental Peace-building and Hopeful Lessons from", "Environmental peacebuilding: Towards a theoretical framework.", "Is wartime mobilisation a suitable policy model for rapid national climate mitigation?", "Finding a space and frame of mind to conduct reading and deep thinking is always tough.", "So the first task will be to schedule a reading time for yourself and then reflect on how this is working for you (this is the “Reading Log” portion of the Weekly Notes for the first few weeks).", "Lecture & Discussion Notes", "Required Texts & Readings", "Active participation means being conscious of the space you are taking up in the classroom and making efforts to include everyone in the discussion.", "Late Assignment Policy & Accommodations", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 129, "course_code": "ERS 225", "course_name": "ERS225 - Gendering Environmental Politics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Gendering Environmental Politics Fall 2023", "04:00PM - 05:20PM", "Email: andrea.collins@uwaterloo.ca", "This course also examines how governance, policy, and politics can be used to create social and environmental change.", "This course also examines how governance, policy, and politics can be used to create social and environmental change.", "Define key concepts related to the analysis of gender, race, and class", "Understand how gender is a critical variable in decision-making processes", "Identify gendered power relations, including within environmental governance and policy", "Analyze environmental issues and politics with attention to gender and other social identities", "Week 1 – Wed. Sept. 6 – INTRODUCTION & CORE CONCEPTS", "Introduction to the course – expectations and assignments", "Core Concepts for Feminist Research", "The Emergence of Ecofeminism and Key Debates", "The Push and Pull of Environmental Politics & Protest", "Gender and Environmental Justice", "Understanding Gender and Patterns of Consumption", "How can we consume differently?", "Energy, Resource Extraction and Gender: Canada and Abroad", "Privilege and Safety in the City: Urban Planning", "Gender and Disaster Risk Planning", "Each week will also begin with a “News Briefing”, which is a chance for anyone to share anything related to gender politics and/or environmental politics over the past week.", "If you attend class but do not actively participate in discussion, you should consider other ways you can stay engaged with the course.", "For this assignment, students will use what they have learned about gender and other forms of social inequality to examine a contemporary issue in environmental politics that they have researched independently throughout the term.", "Final Exam – 30% – Held in-person during the Final Exam Period in December", "Notice of Recording", "Library for research-based assignments", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 130, "course_code": "ERS 253", "course_name": "ERS253 - Communities and Sustainability (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["ERS 253", "10:30AM -", "10:30AM - 11:20AM EV2 2006", "Course TA: Chelsea Nankisore - cnankiso@uwaterloo.ca", "His research focuses on community engagement in ecological restoration and conservation projects.", "He is currently communications manager with Reep Green Solutions, an environmental charity in Kitchener.", "Chelsea has an HBA from the University of Toronto where I double majored in Human & Environmental Geography with a focus in Planning and Urban Geography.", "Chelsea's course work encompasses: globalization and its influence on urbanization, modern urban planning techniques and practices, planning in defining urban landscapes, housing and community development, environmental law, sustainability in complex socio-ecological systems, built environment and health, and lastly, environmental problems and its influence on various communities.", "Chelsea is currently furthering my studies in the social and ecological program as a MES candidate.", "Up-to-date course information", "Everything in this syllabus (especially guest speakers) is tentative and subject to change.", "Exploration of the interconnected roles that communities at various scales", "can play in a transition towards sustainability.", "Examination of structures, options, initiatives, and decision-making processes involving a wide range of concerns, opportunities, and applications.", "It is the knowledge that people have of each other, their concern for each other, their trust in each other, the freedom with which they come and go among themselves.”", "ERS 253 explores communities and sustainability as a useful pairing of ideas and practices.", "This will involve applying a broad and critically advanced approach to community and sustainability (plus a few closely related concepts, including complexity and engagement in governance and decision making, as key factors for attention); and aiming to identify the practical implications, including for particular undertakings that aim to contribute to lasting wellbeing at the community scale.", "There are cultural, occupational, ideological and interest-based communities, among others.", "The course work will include development and application of tools to build an integrated understanding of communities, sustainability and engagement and to expand this understanding in discussions about issues and actions in a variety of particular areas of concern and opportunity (food systems, growth, decline, economic greening, ecosystems, etc.).", "Perhaps most importantly, each participant will integrate the broad insights, specify them for the particular context of a community of her or his choice, and apply the results in the conception and evaluation of a sustainability-enhancing undertaking in that community.", "The latter half is focused on application – we will return to many of the concepts in our readings and apply them to real-world cases with exciting guest speakers.", "How do we know it?", "TransformWR Strategy", "January 23 Frameworks for Change", "Asset-Based Community Development (ABCD) at a glance by Tamarack", "A Primer in", "Community-based", "Fostering collective action through participation in natural resource and environmental management: An integrative and interpretative narrative review using the IAD, NAS and SES frameworks Ortiz-Riomalo et al 2023", "A Ladder of Citizen Participation - Arnstein 1969", "consultation!’’: The colonial antipolitics of Indigenous", "consultation in Jasper", "“Convivial Futures?", "(skim) THE SECOND CONVIVIALIST MANIFESTO: Towards a Post-Neoliberal", "World", "February 27       Institutions and organizations", "University of Waterloo’s Environmental Sustainability Strategy", "March 5 Ecosystems and nature", "A Review of Design Principles for Community-based Natural Resource", "January 23 - Team charter", "March 26 - Final deliverable for the case project (2,000 words max)", "There is no grace period for reflections in tutorial.", "Each entry should be about 300 words and can include material from the previous two weeks.", "If you require the use of a keyboard for accessibility reasons, you may use your computer to type these and email them in during the tutorial time.", "You must include some personal reflection in each journal entry.", "Sustainability initiative deep dive", "This assignment is a critical assessment and investigation of a sustainability initiative.", "***IMPORTANT:", "*", "**", "How is this program trying to shift society towards a sustainable future?", "Is it working?", "Are there financial barriers, other barriers, and is there (or could there be) any attempt to help overcome those barriers?", "Groups will be assigned during the first week of classes.", "This initiative should be targeted towards a real community.", "It should be both environmentally and financially sustainable.", "You should identify barriers and discuss attempts to overcome them.", "Your sustainability initiative should address a specific and well-researched problem grounded in the community you choose.", "Your success metrics should be some kind of real, verifiable change in the world.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 133, "course_code": "ERS 315", "course_name": "ERS315 - Environmental and Sustainability Assessment 2 (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Environmental and Sustainability Assessment 2 Fall 2024", "Instructor: Dr. Felicitas Egunyu; Office EV2-2036; felicitas.egunyu@uwaterloo.ca", "Continuing from concepts developed in ERS215, this course places more emphasis on case studies and projects by students.", "The course provides a synthesis of ecological, physical, economic, socio-cultural, and institutional concerns, as well as experience in the use of impact assessment methodologies and approaches, as a key element in achieving more informed and responsible decision making.", "View requirements for ERS 315", "Tutorial work will be semi-directed and self-guided.", "The concepts introduced in ERS 215 and 315 are applied to a broader range of pursuits in ERS 415, the next course in the assessment series.", "Recommend and implement tools and frameworks for managing impacts.", "Quntify impact magnitude and significance before and after impact management.", "Over the past half century Environmental and Sustainability Assessment has evolved from seeking to minimize the short-term and localized negative biophysical impacts of certain development projects to considerations of net benefit to both the environment and the people that it supports including future generations.", "As such, the exercise of EA brings you face to face with questions of the sustainability of our actions including cumulative effects, trade-offs and appropriate temporal, spatial and contextual considerations.", "Outcome 2: Define and articulate core skills and areas of knowledge relating to SERS’ areas of strength", "Environmental and sustainability assessment are explicitly listed as areas in which we seek to develop skills and depth of understanding in SERS students.", "Outcome 3: Understand and work within, between and across disciplines and ways of knowing Environmental and sustainability assessment are by their very nature inter- and transdisciplinary pursuits because they require the engagement of a broad range of disciplinary expertise and must by law engage all parties that might be impacted by a development and explicitly including Indigenous Peoples and ways of knowing.", "Outcome 4: Mobilize skills and knowledge to contribute to better understandings, diagnoses and solutions for environmental and sustainability challenges and opportunities", "Ways of establishing the condition of the environment and how it is changing (i.e., monitoring), making predictions about how a new development will impact the environment including its peoples and managing those impacts to reduce them if they are negative and maximize them if they are positive are all aspects of environmental and sustainability assessment that we discuss in this course.", "Outcome 5: Work collaboratively and effectively with people and organizations affected by orresponsible for addressing environmental and sustainability challenges and opportunities Collaboration is an essential skill to master in environmental and sustainability assessment work.", "For this reason this course brings in working professionals to discuss their experiences in particular EA case studies.", "The ability to write and speak clearly about complex and often emotionally charged issues is an essential skill in EA work.", "Through readings and the guest speakers who share their knowledge in this course you will be exposed to some great communication in the area of environmental and sustainability assessment.", "First hour", "Second hour", "Planning & Public", "Consultation &", "Vegetation", "Introduction to Individual essay assignment", "Baseline", "Biomonitoring", "Predicting &", "Impacts", "Wildlife sampling", "Introduction to Group", "Aquatic Environmental", "Cumulative Effects", "Review for first in class test", "2012 - SIA;  Hjorth & Bagheri 2006 – systems)", "Lecture First hour", "Second hour", "Intro to second half of the course  Systems thinking & Social Impacts Assessment", "Socio-Economic Impact Assessment David Schaaf, Principal -  Nichols Applied Management Inc., Edmonton", "Final in-class test", "Introduction to Environmental Assessment: A Guide to Principles and Practice, Fourth Edition.", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 134, "course_code": "ERS 320", "course_name": "ERS320 - Economics and Sustainability (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Economics and Sustainability Winter 2025", "DWE 1515", "03:30PM - 04:20PM", "In the case of inclement weather, course lectures may shift online.", "View requirements for ERS 320", "We cover multiple perspectives in economics and trace the evolution of key drivers, debates, and policy approaches before turning to new frontiers of research and practice.", "The course format combines interactive lectures with exercises to build skills in economic and policy analysis, technical writing (policy briefings) for specialized audiences, and data analysis and visualization.", "The term will culminate in a poster session on sustainable economic futures with a focus on water, climate, and biodiversity - three areas where economists have prepared major reviews in the last 15 years.", "Describe and compare different economic perspectives on sustainability and development", "Identify trends and debates on the economics of sustainability from a systems perspective;", "Evaluate the strengths and weaknesses of economic methodologies for policy analysis;", "Integrate economic ideas and methods with other disciplinary perspectives in the humanities, natural sciences, engineering sciences and social sciences", "Introduction", "Why economics matters for sustainability", "The evolution of economic ideas about sustainability", "Sustainability economics", "Markets and the commons", "Why and how markets fail; coordination problems; property rights", "Valuing nature", "Frameworks and methods for valuing the environment", "How institutions and incentives shape behaviour and policy", "Defining and applying key concepts", "The Economics of Safe Drinking Water", "Atlas of Water Markets: East Africa and Latin America", "Natural Monopolies & Negative Externalities", "Atlas of Water Markets: South Asia, Southern Europe & North Africa", "The Economics of Biodiversity and Climate Adaptation", "Atlas of Water Markets: Western USA and Australia", "New frontiers of economic thinking about sustainability", "Summit", "Students are expected to attend each class and participate in three ways: critical reading; active engagement in class discussions and debates; and completion of practical exercises during tutorials.", "The mid-term exam, held Feb 26th, will be an in-class exam assessing understanding of core concepts and debates.", "The format will include multiple choice and short essays.", "Each student will be tasked with completing a policy briefing that applies economic concepts and methods to identify the causes of a water sustainability challenge and outline potential solutions.", "Notice of Recording", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 136, "course_code": "ERS 361", "course_name": "ERS361 - Food Systems and Sustainability (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Food Systems and Sustainability Spring 2024", "S. Scott", "sdscott@uwaterloo.ca", "Instructor: Steffanie Scott", "sdscott@uwaterloo.ca", "Specific themes covered in the course include technological and genetic change in food production, resource depletion and wider environmental impacts of the industrial food system, and policy, market-oriented, and civil society initiatives to bring about change in the food system, including organic production and localizing food systems.", "No other human activity has a greater ecological impact than our food system.", "Socio-cultural, economic, and political dimensions also shape the sustainability and resilience of our food system.", "Understanding many sides of an issue places you in a stronger position to determine and defend your own ideas.", "Food system change is a topic fraught with debate, particularly in relation to balancing socio-economic and ecological considerations.", "Explain the historical development of the contemporary food system, and associated main concepts and models (e.g., community-based/regional versus globalized/industrial food systems), and", "Specifications grading scheme & grade pathway requirements", "You can always move to a lower-level grade pathway.", "Grade A Pathway Grade B Pathway Grade C Pathway Grade D Pathway Re-submissions allowed?", "*only one of the Assignment 3 options can be used", "Re-submissions", "Extensions and Late Submissions", "We will follow these instructions and automatically assess your late penalty upon grading.", "Please anticipate technical problems and leave yourself at least a 1-2 hour buffer before the deadline in case something happens when you try to submit your work.", "Save multiple versions of your work as you write in case you accidentally overwrite your file.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "This course includes the independent development and practice of specific skills, such as food systems analysis.", "Library for research-based assignments", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 137, "course_code": "ERS 365", "course_name": "ERS365 - Water Governance (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["ERS 365", "11:30AM -", "A profound, world-wide shift in the nature of water governance is occurring because governments can no longer be the primary source of decision-making authority regarding water.", "Instead, through mechanisms that range from markets to co-management arrangements, citizens, non-government organizations, and corporations are now playing key roles in water governance.", "View requirements for ERS 365", "Lectures are designed to provide an overview of key concepts and highlight important ideas from the readings.", "Seminars are designed for greater depth into course concepts and will involve discussions, in-class activities, and workshopped case study examples.", "I hope you participate actively in these seminars, as they enhance your learning of water governance.", "Apply strategies for governance to water challenges in real-world case examples.", "Develop skills in perspective-taking, systems thinking, and collaboration.", "Week 1: September 5 Introduction Course introduction & review course outline", "Week 2a: September 10 Global Water Systems", "Water governance in Canada: Innovation and fragmentation.", "Environmental governance and its implications for conservation practice.", "The role of governance modes and meta-governance in the transformation towards sustainable water governance.", "Environmental science & policy, 91, 6-16.", "Principles of food-energy-water nexus governance.", "Renewable and Sustainable Energy Reviews, 155, 111937.", "Day zero and the infrastructures of climate change: Water governance, inequality, and infrastructural politics in Cape Town's water crisis.", "Video in Drought Response Learning Initiative. https://www.drought-response-learning-initiative.org/", "Exposing the myths of household water insecurity in the global North: A critical review.", "Week 8a: October 29 Guest Lecture Nat Bergbusch (guest lecture) - Collaborative governance of environmental and cultural waters", "Transboundary water governance scholarship: a critical review.", "Hybrid governance, environmental justice, and hydropower development in the Mekong transboundary commons.", "Layers of regulation in transboundary water governance: exploring the role of third states in the Lancang–Mekong.", "A comprehensive sustainability appraisal of water governance in Phoenix, AZ.", "I understand that we are each unique with complex identities and diverse responsibilities that we bring into the classroom.", "I will do my best to respond to your email within 48 business hours, though I limit my email responses to Monday-Friday from 9am-5pm.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 139, "course_code": "ERS 372", "course_name": "ERS372 - First Nations and the Environment (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["First Nations and the Environment Winter 2024", "ERS 372", "02:30PM - 05:20PM", "EV2 2006", "First Nation environmental issues are often complex and require a holistic approach where the lines between different disciplines (e.g. natural, physical, health, and social sciences) are often obscured.", "This unique course, co-taught with Traditional Knowledge Holder/Anishinaabe Elder Peter Schuler from the Mississauga’s of the New Credit First Nation, will provide upper-year undergraduate and graduate students, in the Faculty of Environment and across the university, an introduction to First Nations issues in Canada and to Anishinaabe Traditional Knowledge and Practice.", "2) Through weekly readings and online discussions: (i) Introduce students to some relevant academic literature on First Nations issues in Canada and appropriate/respectful research approaches such as critical Indigenous methodologies and decolonizing methodologies, and; (ii) Discuss these in a small group setting with insights from Peter and Dan", "Sand Talk, The Porcupine, the Paleo-mind and the Grand Design, The Albino Boy and Lemonade for Headaches", "Other Readings TBD", "Decolonization: Indigeneity, Education & Society, 1(1): 86-101.", "#1c - Reflecting on the material discussed in class (Peter's teachings, weekly readings and discussions, weekly critical reflections), and, based on existing evidence and relevant literature, envision a quasi-realistic future in which we are appropriately addressing complex issues such as climate change, social and environmental injustice, armed conflict, biodiversity loss etc.", "Explore what can be learned from this type of reflection and what are the first steps that can be taken towards that potential future?", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 140, "course_code": "ERS 404", "course_name": "ERS404 - Global Environmental Governance (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["02:30PM - 05:20PM", "Email Address: andrea.collins@uwaterloo.ca", "The history of international environmental politics will be reviewed, specific organizations and other actors involved in global environmental governance will be examined and the management of particular global environmental challenges investigated.", "ERS 404: View requirements for ERS 404", "Though efforts are made at all levels of society to address environmental issues, many of the challenges we face require transboundary coordination and governance.", "Students will learn about conventional sites of state-based governance, international organizations and agencies as well as emerging forms of governance, including private governance and the role of non-state actors.", "Students will develop a sense of the various political interests that influence global environmental governance and the challenges to enacting effective governance.", "Define and apply key concepts in contemporary global governance", "Describe the different kinds of global governance actors and their roles", "Understand global environmental issues and the presence or absence of appropriate governance mechanisms", "Analyze different forms of global environmental governance and assess their effectiveness", "Communicate key political challenges through both writing and public presentation", "+ A Short History of Grappling with Global Environmental Problems", "This week will introduce students to the overarching theme of the course – specifically that ‘governance’ is a flexible and contested term – and introduce some core ideas about global governance.", "“Responsibilities in Transition: Emerging Powers in the Climate Change Negotiations.”", "China as a ‘Partial’ Environmental Great Power.", "“Big Brand Sustainability: Governance Prospects and Environmental Limits.”", "Week 5 – Feb. 5 – Non-Governmental Organizations, Social Movements, Experts, and Civil Society & Modes of Non-state Governance", "“Is the Power of Brand-Focused Activism Rising?", "The Convention on International Trade in Endangered Species of Wild Fauna and Flora (CITES)", "Thematic Focus: North-South relations in global environmental governance", "Week 9 – March 12 – Ecosystems & Change: Deforestation and Land Degradation", "Thematic Focus: Role of non-state actors in global environmental governance.", "“Agency Shifts in Agricultural Land Governance and Their Implications for Land Degradation Neutrality.”", "muse.jhu.edu/article/168279", "Thematic Focus: Environmental justice and/or North-South relations", "Thematic Focus: fragmentation of environmental governance", "Morin, Jean-Frédéric & Orsini, Amandine.", "It contains short descriptions of key concepts that you may refer to in your reading for further clarification.", "Mid-term Test - Held in-person 25%", "Write a short 300-word original reflection of your thoughts about ideas/concepts in the weekly readings and emailing it to me before the next week begins (i.e. by Monday morning at 9 a.m.).", "Peer- Evaluation and Self-Assessment:", "I will provide resources to help you and your research partner(s) to communicate and collaborate, but you are ultimately responsible for resolving issues and solving problems.", "In addition, this document must also include a 100–150 word peer-evaluation of each research partner(s)’s performance and the nature of your collaboration this term.", "A clear description of your research topic: the issue and/or global agreements you have been assigned.", "Be well-organized and memorable with a clear learning outcome (i.e. what is the one thing you want the class to remember from your lesson).", "Each lesson should be 30 - 40 minutes in length.", "Additional time will be allotted for follow-up questions from the class and the instructor, so your entire time in front of the class may be up to 75 minutes.", "Instead, your analysis will demonstrate your understanding of the various actors and dynamics in global environmental governance.", "Please include a separate references page.", "Your references pages do not count towards the overall word count.", "Be sure that your research encompasses the study of global politics and governance and not just the scientific literature about your research area.", "The whole team will also need to attend an in-person meeting with me to discuss your research findings and contributions to the paper in the week before the end of the term.", "The exam will be held in-person during the exam period.", "Please be sure to refer to these when you are preparing your Team's lectures and when participating in class discussions.", "Engage in healthy debate:", "Don't interrupt when someone is speaking", "An engaged facilitator", "Prompts for discussion", "Opportunity to write ideas first", "Space for people to explore/explain ideas using their own experience and knowledge", "Organized slides", "clear headings", "summaries", "Late take-home exams will not be accepted after the grace period ends and will earn a grade of zero.", "Life happens and often interrupts our best laid plans for the term.", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Cross-listed courses", "This course includes the independent development and practice of specific skills, such as reading and analysis.", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 142, "course_code": "ERS 454", "course_name": "ERS454 - Parks and Protected Areas: Issues and Trends (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["ERS 454", "ERS 454 001", "02:30PM - 05:20PM", "EV2 2006", "ERS 454:", "View requirements for ERS 454", "This course explores the critical roles parks and protected areas play in the sustainability of human societies and the natural world.", "Parks and protected areas, both nationally and internationally, are set aside to achieve a range of public policy outcomes including the conservation of biodiversity, ecological integrity, sustainable ecosystems, social well being and economic benefits.", "The International Union for the Conservation of Nature (IUCN) classification system and conservation guidelines will be used as the basis for comparative analysis and the identification of policy objectives related to protected lands and waters.", "The relationship of parks and protected areas to environmental trends such as climate change, water and food security, economic development and biological diversity will be examined in the Canadian and international contexts.", "In addition, the role of parks and protected areas as an element of Canadian identity will be considered based on shifting public priorities related to environmental protection and socio-economic well being.", "Government decisions to set aside lands and waters for conservation are policy choices to conserve rather than develop or degrade ecological and natural resources.", "These decisions create socio-ecological systems and are often controversial, calling into question societal values and valuation related to the natural world.", "The course considers the societal values associated with conservation and will use case studies to examine how and why natural resources are protected through establishment processes.", "The question of whether there is a fundamentally irreconcilable tension between policies of protection and use of parks and protected areas will be considered, as well as the influence that political priorities and preferences play in the policy emphasis affecting management of conservation lands and waters.", "The role of shifting demographics related to government decisions to establish parks and protected areas, and the types of programs, services and opportunities for conservation and public use will be considered in the context of past, current and emerging trends and public policy choices.", "•Understand and evaluate the diverse and complex public policy dynamics related to the establishment of parks and protected areas, and the management of parks and protected areas systems in Canada, and internationally.", "•Explore key issues and trends related to parks and protected areas to, and be able to assess the effectiveness of legislation, public policy and strategies to address the long-term sustainability of systems protected lands and waters.", "•Understand and apply knowledge of the roles and benefits of parks and protected areas in the broader context of environmental sustainability at the national and international scales and understand the role of parks and protected areas in achieving a range of public policy outcomes.", "ERS 454 - Undergraduate", "Preparation for in-class activities and completion of readings,", "Participation in discussions and seminar breakouts", "To achieve success for this aspect of the overall student assessment, students will provide answers to the questions that demonstrate comprehension of the course content, evidence of completion of assigned readings, the capacity to apply and integrate concepts and principles when addressing an issue related to parks and protected areas.", "Validity of information and concepts:              10", "To achieve success for this aspect of the overall student assessment, students will demonstrate comprehension of the course content, evidence of completion of assigned readings, completion of research related to the topic, the capacity to apply and integrate concepts and principles when addressing an issue related to parks and protected areas.", "Evidence and strength of research:                                  20", "Internal logic and validity of argument                            25", "ERS 654 - Graduate", "Preparation for in-class activities and completion of readings,", "To achieve success for this aspect of the overall student assessment, students will provide answers to the questions that demonstrate comprehension of the course content, evidence of completion of assigned readings, the capacity to apply and integrate concepts and principles when addressing an issue related to parks and protected areas.", "Validity of information and concepts:              10", "Research Project and Paper and in-class Presentation", "To achieve success for this aspect of the overall student assessment, students will demonstrate comprehension of the course content, evidence of completion of assigned readings, completion of research related to the topic, the capacity to apply and integrate concepts and principles when addressing an issue related to parks and protected areas.", "In preparation, readings for the class can be identified in advance to facilitate seminar discussion.", "Internal logic and validity of arguments                          20", "This course includes the independent development and practice of specific skills, such as research, analysis, information integration and thinking.", "If the development of your research proposal consists of research that involves humans as participants, please contact the course instructor for guidance and www.research.uwaterloo.ca/ethics/human/.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 143, "course_code": "ERS 460", "course_name": "ERS460 - Sustainable Food: Regional Case Study (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["08:30AM - 09:50AM B2 350", "S. Scott", "sdscott@uwaterloo.ca", "Socio-cultural, economic, and political dimensions also shape the sustainability and resilience of our global and local food systems.", "Who are the key players?", "Improved skills in systems thinking, critical reflection, diverse ways of knowing, practical application, multi-context communication, teamwork, collective action, and advocacy for sustainable food systems", "Knowledge of the evolution and contemporary characteristics of Waterloo Region’s food system, its resources, demographic and economic shifts, governance approaches, and key challenges and opportunities", "An appreciation of the legacy of colonialism on Indigenous foodways and on our ecosystem and system of food production", "An understanding of contemporary principles and approaches to sustainable food systems, and how they apply to the case study region", "Tabitha Robin, Sarah Rotz & Adrianne Xavier. 2023.", "Indigenous Food Sovereignty in Ontario: A Study of Exclusion at the Ministry of Agriculture, Food & Rural Affairs.", "If people’s needs are met in compassionate and simple ways, the environment surrounding them will prosper.", "Self-reliance becomes more feasible when we focus on non-material well-being, taking care of ourselves and others without producing or consuming unnecessary material resources.", "Also prepare a short reflection based on this video:", "à This week we will also determine groups & topics for term projects", "Exploring experiences of the food environment among immigrants living in the Region of Waterloo, Ontario.", "Life stories of food agency, health, and resilience in a rapidly gentrifying urban centre: Building a multidimensional concept of food access.", "Michel Desjardins and Ellen Desjardins. 2009.", "Earth Care can be taken to mean caring for the living soil.", "The state of the soil is often the best measure for the health and well-being of society.", "By reducing our consumption of ‘stuff’, we reduce our impact on the environment, which is the best way to care for all living things", "From cultural genocide and ecocide to food sovereignty", "National Film Board & Gary Farmer (director).", "This documentary examines the role of corn in the lives of Indigenous peoples in the Americas.", "It was respected and revered as a critical part of creation.", "Dollars & Sense: Opportunities to Strengthen Southern Ontario's Food System.", "Key findings include:", "The report makes the case for investing in the development of regional food systems and providing the supportive regulatory environment, infrastructure, and distribution networks required for these systems to flourish.", "A Call to Action for Resilient Seed Systems in Canada.", "An Exploration of the Local & Organic Food System in Perth-Waterloo-Wellington.", "Nikola Barsoum & Jodi Koberinski.", "Gardening in a Changing Climate: Understanding the Impacts of a Changing Climate in and Around the Greenbelt.", "MODULE 3 - FAIR SHARE (Set limits and redistribute surplus)", "The growth in human consumption and the accelerating extinction of species make clear the impossibility of continuous growth.", "Sometimes we need to make hard decisions and consider what enough is.", "Farmers Breakfast Panel: Discussion with Ontario Mennonites in Agriculture.", "Gardens for Healthy Schools: A Scan of School Gardens in Waterloo Region.", "-- See section with Chef Thompson Tran (of The Wooden Boat Food Company) and Court Desautels (of The Neighbourhood Group & Borealis restaurant) (the last two speakers in this panel; 0:49:19 to 1:23:28).", "Generating change: multisectoral perspectives of key facilitators and barriers to food system policy making.", "Journal of Hunger & Environmental Nutrition, 7(2-3), pp.137-148.", "Carbon footprint of dietary patterns in Ontario, Canada: A case study based on actual food consumption.", "Incorporating policies for a healthy food system into land use planning: The case of Waterloo Region, Canada.", "Assessment & Specifications Grading", "The rationale for specifications grading is five-fold:", "Re-submission opportunities encourages risk-taking, creativity, and \"outside the box\" thinking.", "Specifications grading is typically preferred by students over the traditional grading systems due to these factors:", "it feels more like coaching, and", "Earning a high mark in this course means that you demonstrated competency across multiple learning outcomes and objectives.", "Re-submissions", "Term project: If any parts of your term project submissions do not receive a \"credit\" the first time, you will be given one chance (for each part) to resubmit without penalty.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 144, "course_code": "ERS 462", "course_name": "ERS462 - Global Food and Agricultural Politics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["04:00PM - 05:20PM", "Email: cmmcglad@uwaterloo.ca", "Demonstrate a working knowledge of the history of the industrialization of food and agriculture.", "Demonstrate knowledge of the main features of the issues and actors in global food politics from production to consumption.", "Identify the main features and scales of food security and food sovereignty and explain how they are changing with reference to global politics and governance processes.", "Assess the significance of global actors, and their impacts within specific issue-areas", "Facing the Food Systems Summit - Panel Recording; found here: https://www.youtube.com/watch?v=9uE_AdSB5qk", "“Sustainably Sourced Junk Food?", "Agriculture and Human Values 33 (3): 537-48.", "“The Dynamics of the Contemporary Governance of the World’s Food Supply and the Challenges of Policy Redirection.", "Global Environmental Politics", "Toward Indigenous visions of nature-based solutions: an exploration into Canadian federal climate policy.", "identified the key elements of the review; and", "A class reflection of food systems transformation and global food politics.", "No Assigned Readings", "Assigned readings should be read before the relevant classes.", "CFS and Issue Analysis Report 25", "A weekly summary involves outlining the following components for each article or chapter assigned for that week’s readings.", "A list of key concepts and terms with definitions (five to seven in total).", "A summary of the author’s main argument(s) (four sentences maximum) stated in your own words (for each reading that week).", "Critical analysis of the readings will follow in class during discussions.", "Summaries should be roughly 500 words in total, with a maximum of 750 words.", "This may involve describing unique aspects of the papers, simplifying any technical elements of the papers and asking questions to spark discussion.", "As the discussion unfolds, the discussants will be responsible for synthesizing points made by their peers and steering the discussion in a fruitful manner.", "The report should be between 2000 – 2500 words and should include works cited in APA format.", "This assignment should be approximately 2500-3000 words in length (excluding references).", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments consider students' well-being to be extremely important.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 145, "course_code": "ENVS 105", "course_name": "ENVS105 - Environmental Sustainability and Ethics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Environmental Sustainability and Ethics Fall 2024", "08:30AM - 09:50AM UTD 105", "Your instructor checks email and the Ask the Instructor discussion topic* frequently and will make every effort to reply to your questions within 24 hours, Monday to Friday.", "Concepts and activities by which stakeholders describe and debate this compatibility will be discussed.", "What is the role of the individual, the public, and private sector actors in steering social systems toward sustainability?", "How should we respond to climate change?", "How do we reconcile planetary boundaries with human development?", "These and other 'wicked questions' will be examined throughout the course with an eye toward improving our facility and confidence in approaching these defining questions in the 21st century.", "Apply ethical decision-making “tools” to environmental problem contexts;", "Identify the reasons and causes of ethical disagreement and collective action problems with respect to environmental issues", "Demonstrate knowledge of the many environmental themes of the Faculty of Environment and an introduction to some of the key challenges facing environmental governance research and action.", "1 September 5th Ethics and Environmentalism in the Anthropocene Environmental Ethics for Canadians: Introduction: Four Normative Theories  Save the Last Word:  Introduce Yourself", "Environmental Ethics for Canadians: Introduction: Four Normative Theories (continued);", "Ethics of Care in Environmental Ethics-Feminist and Indigenous Perspectives;Untenable Origins: The Mystery of Reconciliation in Canada;Confucian Thought and China's Environmental Dilemmas", "Enrol as initiators and responders with your group in the Online Discussion Roles Schedule", "3 Sept. 17th, 19th Consideration and Moral Standing for Humans and Non-Humans All Animals are Equal;Animal Liberation and Environmental Ethics: Bad Marriage, Quick Divorce;The battle for the soul of biodiversity;Kill all the Mosquitos?!", "4 Sept. 24th, 26th Values and Priorities: A Challenge to the 'Management Paradigm' In his own words: Captain Paul Watson;Headaches and Heartaches: The Elephant Management Dilemma;Natural Enemies: An Anatomy of Environmental Conflict Save the Last Word: Discussion 2", "First in-class quiz Sept. 26th", "7 Oct. 22nd, 24th Ecological v. Environmental Economics, Planetary Boundaries and Ecomodernism Cost-Benefit Analysis: An Ethical Critique;A Place for Cost-Benefit Analysis;The Value of the World’s Ecosystem Services and Natural Capital Assignment 2 Due;Save the Last Word: Discussion 3 Reflection Paper Proposal  is due on Thursday October 24th, by 11:59 PM", "8 Oct. 29th, 31st Ecological v. Environmental Economics, Planetary Boundaries and Ecomodernism Can the Supply of Natural Resources Really be Infinite? Yes!;Steady State Economics: A New Paradigm;Dambisa Moyo: 'Economic Growth has Stalled.", "9 Nov. 5th, 7th Ecological v. Environmental Economics, Planetary Boundaries and Ecomodernism Ecosystems and Human Wellbeing: Summary for Decision Makers;Excerpts from Enlightenment Now: ‘The Environment’; A De-growth Response to an Ecomodernist manifesto Save the Last Word: Discussion 4 Third in-class quiz Nov. 7th", "10 Nov. 12th, 14th Politics and the environment: essential tensions Environmental Political Activism; Local Ecocentric Democracy and Fossil Fuel Divestment;Excerpts from Zuboff, S. ‘The Age of Surveillance Capitalism'; A View from Everywhere, All the Time;Advancing Environmental Justice with AI?", "11 Nov. 19th, 21st Politics and the environment: essential tensions An Anthropocene Journey;Radical American Environmentalism and Wilderness Preservation: A Third-World Critique;Ecoterrorism- A Critical Analysis of the Vilification of Radical Environmental Activists as Terrorists;Newspaper article: ‘Troops will be needed to get Transmountain built’ Save the Last Word: Discussion 5 (end of discussion activity)Reflection", "December 6–19 December Examination Period", "When answering a poll, select a multiple-choice answer (a, b, c, etc.).", "You will be expected to complete four in-class multiple-choice quizzes over the course of the term.", "Each quiz will consist of 10 multiple-choice questions.", "Your proposal should clearly state the thesis you wish to defend, and give a general outline of your strategy for defending it.", "Your reflection will be graded both for demonstration of relevant knowledge of content, as well as for the quality of your argument and how well you present and defend your thesis, e.g., 'I will argue that climate change is first and foremost a human development problem'.", "The exam will consist of a mix of multiple choice questions similar to those in the quizzes, plus a list of short answer questions.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 146, "course_code": "ENVS 195", "course_name": "ENVS195 - Introduction to Environmental Studies (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Environmental Studies Winter 2025", "04:00PM - 05:20PM", "RCH 301", "E-mail: erin.oconnell@uwaterloo.ca", "Office hours are held on a drop-in basis in EV1-331", "The course provides an overview of human ecological aspects of environmental studies from an inter-cultural and global perspective, and offers an integrative framework for understanding them.", "This first-year course introduces the field of environmental studies, exploring the relationships and interactions between humans and their natural, social, and built environments.", "Explore the variety of demographic, economic, and socio-cultural/ethical processes underlying human interaction with the natural world;", "Develop an understanding of the planetary systems and processes that have been disturbed by human activity and contribute to the environmental challenges that we face today;", "These environmental challenges will be studied at the global, national and local levels, and the complexity and interconnectedness of these various challenges are examined; and", "Examine key planning and management approaches, concepts, and frameworks that may be useful for responding to environmental challenges.", "The course promotes acquisition of core environmental knowledge (concepts, principles, practices) from the perspectives of social sciences, environmental sciences, and management.", "Articulate key perspectives on the demographic, economic, and socio-cultural/ethical processes that have influenced human interactions with the environment.", "Situate their own values and perspectives of key drivers of environmental degradation within the context of other perspectives.", "Comprehend the process of biodiversity, the movement of energy through ecosystems and the impacts of disruptions on ecosystems.", "Explain the key storage pools and movements between storage pools for identified biogeochemical cycles and the impact of disruptions to these cycles.", "Appreciate the causes and implications of key environmental challenges, including climate change and air pollution, agriculture, waste management, energy, and oceans and fisheries.", "Identify and assess the pros and cons of potential solutions to key environmental challenges.", "Apply planning and management concepts and frameworks to key environmental issues.", "Utilize basic terminology and concepts as applied in the field of environmental studies.", "Application skills: Through applying concepts, approaches, and frameworks to various case studies.", "Readings & Assignments", "Course Introduction & Overview", "No reading quiz this week", "Part I: Environmental Value Systems", "Drivers of Environmental Degradation", "Drivers of Environmental Degradation", "Drivers of Environmental Degradation", "Ch. 3: Introduction; Energy; Energy Flows in Ecological Systems; Ecosystem Structure, pp.", "68-93 (includes Box 3.4 and Vision from the Field)", "Ecosystems: Energy Flows, Natural Change, and Biodiversity", "Part I: Energy Flows", "Ecosystems: Energy Flows, Natural Change, and Biodiversity", "Ecosystems: Energy Flows, Natural Change, and Biodiversity", "Part I: Introduction and Carbon Cycle", "R E A D I N G   W E E K !", "Climate Change", "Climate Change", "Forests & Natural Hazards", "330-332", "486-488", "Forests & Natural Hazards", "Environmental Planning and Management", "Part I: Environmental Assessment", "Environmental Planning and Management", "Environmental Planning and Management", "Part III: Protected Areas and Reintroductions", "51-56", "Moving Forward Sustainably", "The text has many references to further reading in both printed sources and electronic web sites at the end of each chapter.", "Quizzes contain ten multiple choice questions, with 30 minutes to complete each quiz.", "These quizzes should be considered as practice and preparation for the final exam.", "Direct quotations should be used whenever five or more words in a row are copied directly; however, you may use terminology related to concepts and processes without needing to quote directly (e.g., the term phenological mismatch does not need to be in quotation marks).", "Nature: Perspectives, Values and Rights - Part I: Environmental Value Systems  [", "When citing lectures in-text, you can just cite the title of the lecture: (Environmental Value Systems, 2025).", "Other valid reasons beyond the control of the student (to be approved on a case-by-case basis at the discretion of the instructor).", "This essentially removes the need for a short-term absence declaration, since a longer, three-day grace period has already been applied.", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 147, "course_code": "ENVS 201", "course_name": "ENVS201 - Introduction to Canadian Environmental Law (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Canadian Environmental Law Fall 2024", "08:30AM - 10:20AM RCH 101", "02:30PM - 03:20PM", "09:30AM - 10:20AM EV1 350", "04:30PM - 05:20PM", "Introduction to the basic legal framework that regulates the natural environment in Canada.", "The course provides students with an understanding of the foundational legal institutions in Canada and their respective roles in environmental regulation.", "The course includes both public and private law approaches to environmental regulation, and covers the principal regulatory tools used to protect the environment.", "View requirements for ENVS 201", "In particular, students will be able to identify and describe the basic structural features of the Canadian legal system and their relationship to the environment; to differentiate and apply legal causes of action that provide remedies to those impacted from environmental harm caused by others; and to describe and apply the legal basis for regulatory and criminal action against polluters.", "By the end of the course students should be able identify and classify legal issues within increasingly complex fact patterns; interpret cases and legislation, with an emphasis on identifying rules and principles; and to apply abstract legal rules/principles to factual situations to generate legal conclusions.", "As clear, objective communication is a crucial skill to providing legal and policy advice, students will engage in a number of written exercises oriented towards improving professional written communication skills.", "identify and classify legal issues within increasingly complex fact patterns", "interpret cases and legislation, with an emphasis on identifying rules and principles", "identify and describe the basic structural features of the Canadian legal system and their relationship to the environment", "differentiate and apply legal causes of action that provide remedies to those impacted from environmental harm caused by others", "apply knowledge in the context of providing written legal opinions in legal memoranda", "yes", "An Introduction to Environmental Law and Policy in Canada, 3d.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 148, "course_code": "ENVS 205", "course_name": "ENVS205 - Sustainability: The Future We Want (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Your instructor checks email and the Ask the Instructor discussion topic frequently and will make every effort to reply to your questions within 24–48 hours, Monday to Friday.", "The course is designed to get you thinking about and applying key concepts in the course.", "The modules also include applied Examples, that help to demonstrate concepts and Definition boxes, that help clarify words that all students may not be familiar with.", "In addition to these core resources, you'll find lots of Optional Resources in the course.", "Describe the current socio-ecological crisis and summarize key trends.", "Identify the basic goals, principles, and multi-scalar practices of sustainability.", "Classify socio-ecological problems and solutions according to the United Nations’ seventeen Sustainable Development Goals (SDGs), and understand some of the interconnections between these goals.", "Define and detect four of the key values that underlie sustainability: the “good life”; democracy; social justice; and efficiency.", "Situate one’s own well-being in relationship to multi-scalar socio-ecological processes (e.g., the well-being or suffering of other human beings in other places in the world, past, present and future).", "Critically examine an organization and activity on campus, in your workplace or in your community in relation to the SDGs, approaches to sustainability and values underlying sustainability.", "Choose one of the following topics:", "Exam Period", "Do not email the instructor until you have read and completed the following.", "Please be sure to read the rubric before starting your assignment.", "Be sure to includes all of the following information:", "your name and student number;", "**Please note that your mark can be raised, lowered, or remain the same through a re-grade**", "*", "*", "* Please submit your paper for consideration by email to the instructor no later than one week following your receipt of the decision by the TA.", "Include a formal business letter that includes the following information:", "your name and student number;", "Intellectual property includes items such as:", "Note: Cutting and pasting even a partial sentence without proper quotations and referencing IS considered plagiarism.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 149, "course_code": "ENVS 210", "course_name": "ENVS210 - Future Studies (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["02:30PM - 05:20PM", "02:30PM - 05:20PM ONLN - Online", "in person sessions", "The course is structured into two parts: the first concentrates on representations of the future ranging from utopian to dystopian visions including their influence on collective perceptions and policy-making; the second centres on methods relied upon to anticipate the future.", "In this introduction to Futures Thinking, students will learn to apply robust methods for understanding emerging shifts impacting our volatile world and explore possible alternative outcomes of those changes.", "• Demonstrate skill in gathering information from diverse sources and developing patterns of emerging social, environmental, technical and economic trends relevant to the topic area", "• Deploy methods for creation and comparison of alternative future explorations that are possible, plausible and provocative", "Finding patterns – making sense of the information you gather", "Assignment 2 launched (Scenario development – group project)", "How to structure scenarios to ensure plausibility – systems and coherence", "Seeing the future across multiple horizons", "In class exercise - delivered online", "Evaluating scenarios for strategic impact, risks and opportunities", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 150, "course_code": "ENVS 220", "course_name": "ENVS220 - Ecological Economics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Ecological Economics Winter 2025", "08:30AM - 10:20AM EV3 1408", "The links between economics, systems and the natural environment will be explored and future directions examined.", "View requirements for ENVS 220", "This course provides an engaging introduction to ecological economics, framed through the lens of Doughnut Economics by Kate Raworth.", "Together, we will explore how ecological economics challenges the assumptions of conventional economics and expands its scope to address the pressing challenges of sustainability, equity, and planetary boundaries.", "Using the Doughnut model as a central guide, we will examine the concept of a “safe and just space for humanity” and the interplay between social foundations and ecological ceilings.", "Rethinking Growth: Investigating the limits of economic growth, the role of natural resources, and critiquing growth-centric paradigms.", "Redefining Progress: We will compare conventional measures like GDP with alternative metrics such as ecological footprints, planetary boundaries, and well-being and indices of human to assess their relevance in shaping policy and decision-making.", "Special attention will be given to the intersection of ecological economics with issues like climate justice, social equity, and intergenerational ethics.", "Globalization and Local Action: Understanding the environmental implications of globalization and the role of local communities in driving sustainable change.", "Understand and Differentiate: Explain the foundational principles of ecological economics and how they contrast with conventional economic theories and environmental/resource economics.", "Articulate the core concepts of the Doughnut Economics framework, including social foundations and ecological ceilings.", "Critique growth-centric economic models from ecological, social, and ethical perspectives.", "Apply Analytical Tools: Analyze policy options like taxes, subsidies, quotas, and emissions trading through both economic and ecological lenses, considering their potential impacts on sustainability and equity.", "Use systems-thinking approaches to apply Doughnut Economics principles to real-world challenges in areas such as energy, food systems, or urban planning.", "Discuss the ethical dimensions of economic policies, including intergenerational equity and climate justice.", "Feb 24 Design to distribute R: Ch 5", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 151, "course_code": "ENVS 310", "course_name": "ENVS310 - Future Cities: Integrating Future Thinking into Urban Decisions (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Future Cities: Integrating Future Thinking into Urban Decisions Fall 2024", "B2 350", "View requirements for ENVS 310", "Concepts like eco-cities—centers of sustainability that prioritize green spaces, renewable energy, and eco-friendly architecture such as green roofs and vertical farms—offer hopeful visions of a sustainable tomorrow.", "Meanwhile, smart cities promise a future where interconnected sensors and advanced data analytics streamline everything from traffic flow to energy consumption, turning urban living into an optimized, efficient ecosystem.", "In this module, we will critically examine how these ideas are shaped by specific political, cultural, and economic interests, reflecting particular values and worldviews.", "Understanding the forces behind these visions will empower you to engage with them more critically and think more deeply about the kind of future you want to help shape.", "2. Analyze the reciprocal relationship between future visions and city development processes, and how each shapes the other;", "3. Examine the inequalities present in the creation and representation of urban imaginaries;", "Apply tools and methods to actively participate in the co-creation of equitable and sustainable future cities", "Expectations", "Approaches to futures and foresight", "History of futures", "The Namesake: Futures; futures studies; futurology; futuristic; foresight—What's in a name?", "Introduction to urban imaginaries", "Introduction: Urban imaginaries in theory and practice.", "373-386).", "Modelling and forecasting", "Limits to modelling approaches", "Smart cities", "Scenario planning tools", "Socio-technical imaginaries", "Scenario types and techniques: towards a user's guide.", "Using feminist utopias in creating a more inclusive vision of the future city.", "“Sultana's Dream” By Rokeya Sakhawat Hossain", "Spiral to the stars: Mvskoke tools of futurity.", "“Métis in Space” by Molly Swain & Chelsea Vowel is a podcast offering critical analysis of science fiction from a feminist, Métis perspective.", "Imagination and transformations to sustainable and just futures.", "Frontiers in Ecology and the Environment, 14(8), 441-448.", "Analysis of city vision (pairs) 20", "Deliverable: A well-structured 2,000-word essay that critically examines the dominant imaginaries within the city’s vision.", "Your analysis should explore the reasons these particular imaginaries prevail, considering broader political, historical, and environmental contexts.", "It can be simple, or complicated, it can be based on a pre-existing game, or it can be brand new.", "Before launching into the games, each group will deliver a short presentation explaining the rationale of their game and how it moves us to think about the future.", "Be sure to reference the readings where relevant and connect them to the broader course themes.", "I hope we can foster a safe and engaging space for thinking critically, and I will be relying on all of you to help create that space.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 152, "course_code": "ENVS 401", "course_name": "ENVS401 - Canadian Law, Indigenous Peoples, and Natural Resource Development (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["08:30AM - 09:50AM HH 2107", "ncraik@uwaterloo.ca", "Contact Information             ncraik@uwaterloo.ca", "The course examines the historical development of the constitutional relationship between the Crown (the Canadian and provincial governments) and Indigenous Peoples, and the current impact of this constitutional relationship on the development of resources in Canada.", "The course examines the historical development of the constitutional relationship between the Crown (the Canadian and provincial governments) and Aboriginal peoples, and its current impact on the development of resources in Canada.", "Particular focus will be paid to the judicial development of Aboriginal rights and Aboriginal title, the duty to consult and accommodate Aboriginal peoples in the context of resource development and the future trajectory of the relationship between the Crown, Aboriginal peoples, and resource developers.", "Pre-constitutional status of treaties", "The modern treaty and land claims process", "the division of powers over Aboriginal peoples;", "The impact of Aboriginal rights and the duty to consult on resource development", "Impact and benefit agreements", "Historic Context: Pre contact and First Contact", "March 4/6", "Accommmodation", "Implementing the DTC: EIAs and Impact and Benefit Agreements", "Background Papers and Position Sheet Due", "prior preparation;", "in-class and on-line contributions to peer learning;", "Expectations", "able to initiate and facilitate the development of ideas", "comments and questions demonstrate some critical analysis", "raises occasional clarifying questions and comments", "comments often not of a critical nature and do not demonstrate integration of material", "no consistent contribution", "little evidence of integrated learning", "Students will be required to prepare a short paper or case comment on a topic of their choice.", "Students may either synthesize an area of Aboriginal law and provide some critical assessment or they may identify a suitable Aboriginal law case (not covered in class) and provide a critical summary of the case, including a discussion of the case’s significance for the area of law.", "I will provide examples of short papers and case comments during term.", "Few or no technical errors (typos, spelling, grammar); clarity in writing style; coherent structure and flow; a degree of true originality; demonstration of very strong understanding of underlying substantive content; appropriate reference to source materials; paper presents a coherent and persuasive point of view", "80 -90% Very good (15 to 25%)Few technical errors; strong understanding of underlying content; appropriate reference to source material; some attempt at originality; perhaps a few unreferenced points; paper well structured", "65 to 72% Adequate (10 to 20 %); some technical errors; demonstrates a basic understanding of material; some structure", "During the last two weeks of term, we will engage in a negotiation exercise that will require students to represent different participants in a resource development negotiation scenario.", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 153, "course_code": "FINE 101", "course_name": "FINE101 - Art History and Visual Culture (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["This course takes a case study approach to examining the role of the art object as a means of communication within the history of visual culture.", "We might think of the themes as case studies.", "We will also focus with equal intensity on the properties of visuality, i.e. how do images and objects communicate effectively?", "The primary goals of the course are to recognize the significant role visual culture plays in human history and human societies AND to develop the analytical skills and vocabulary to discuss images and objects within that context.", "Be introduced to, and develop basic research skills, for the study of visual images and objects by: using a range of resources and recognizing the parameters and properties of each (websites, newspapers, academic texts, interviews, films, etc.), and learning to access resources through the UW Library and other providers and platforms", "Become aware of, and actively engage with modes of decolonization by: becoming aware of power dynamics of forms of visual culture, recognizing the function/role of various forms of visual culture within various cultures, recognizing and understanding that there are multiple ways of knowing, and recognizing and understanding that multiple ways of knowing are communicated in various modes of visual culture and by various forms of analysis", "Late Work and Notes for Submissions of Assignments", "Many things can happen to students over the course of the semester, especially in these unusual times.", "This course includes the independent development and practice of specific skills, as described in the ‘Course Description’ and ‘Learning Outcomes’ above and in each of the Assessment descriptions, instructions, and rubrics.", "Please note: I am a member of UW’s Copyright Advisory Committee and am thus well-versed in copyright issues.", "Library for research-based assignments", "Fine Arts and Plagiarism and Copyright", "For example, making a drawing in pencil based on a photograph that you find in a magazine may constitute plagiarism and be an infringement of copyright.", "A note on copyright-free and Creative Commons:", "In this case, the authors decide how you can use their images."]}, {"course_id": 154, "course_code": "FINE 102", "course_name": "FINE102 - World Cinema and Visual Culture (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Prof. James Skidmore", "Introduction to film analysis via national cinemas and their worldwide reception, taking into account the role of new technologies.", "identify formal and stylistic elements of film", "interpret film with greater nuance and precision", "develop an appreciation for the cultural and contextual factors that influence film", "Identify formal and stylistic elements of film Lectures; Lecture Review Activities; Analysis Activities", "Develop an appreciation for the cultural and contextual factors that influence film All of the above", "Textbook and Online Software", "An Introduction to Moving Pictures Available online, free of charge.", "An Introduction to Moving Pictures - is available online, free of charge.", "Analysis Activities 25%", "simplified grading scheme emphasizes good faith over accuracy", "grade based on average of best seven", "done in class and uploaded to Crowdmark", "Analysis Activity", "Doing these activities prepares you for the Interpretation Activity and the Film Commentary Activity.", "Interpretation Activity", "In addition to the nine films being studied in class, you will watch a tenth film and prepare a five-minute video commentary on the film.", "if you wish, you can make a joint submission with one other person from the course (the submission must demonstrate that you’re both equally involved in the submission)", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses"]}, {"course_id": 168, "course_code": "FINE 252", "course_name": "FINE252 - Religion in Popular Film (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Religion in Popular Film Fall 2024", "This course examines how religion has been a central concern and inspiration for filmmakers and how popular films have informed and shaped our understanding of religion.", "FINE 252: View requirements for FINE 252", "Religion reflects both humankind's search for meaning and its attempts to maintain particular meanings in the face of cultural challenge and social pressure.", "We use them as ways of establishing shared interests and in-groups, as well as exploring questions both mundane and momentous.", "As our culture passes relentlessly from literacy to visuality, discerning how the various dimensions of religious belief and practice are reflected and refracted in film and television is an important element in understanding the nature of religion in late modern society.", "Engage in critical dialogue with these texts and experiences, with scholars who have contributed to their interpretation, and with each other;", "Improve communication skills through written assignments and class participation; and continue to foster skills in critical thinking and analysis.", "Saved!", "Internet Movie Database", "Journal of Religion and Film", "Discussion Etiquette", "Cross-listed Courses"]}, {"course_id": 170, "course_code": "FINE 257", "course_name": "FINE257 - Video, New Media and the Digital Turn (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["10:00AM - 11:20AM ECH 1219", "In acknowledging the land and water, we express gratitude to those whose territory we reside on and remind ourselves of our connections and responsibilities to care for the land and water, and to respect each other who live on the land and water.", "Land acknowledgment goes beyond words and requires ongoing learning about the territory and actions to support indigenous communities.", "For further learning, resources can be found at https://www.whose.land/ & https://native-land.ca/.", "View requirements for FINE 257", "Tracing the histories, aesthetics and politics of digital art, students will critically examine the emergence of digital technologies, and their roles in transforming artistic practices, modes of production, and integration across media disciplines.", "Through both chronological and thematic approaches, students will engage with theoretical readings, analyze historical and contemporary case studies in art and digital spaces in everyday life, and create studio-based projects that respond to or critique digital and mediated cultures.", "By the end of the course, students will have developed both a historical understanding and practical fluency in the ways digital art shapes, and is shaped by, cultural and technological transformations.", "Digital &", "Post-digital", "reading week", "Themes in Digital", "Contribution & Development 20%", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 174, "course_code": "FINE 275", "course_name": "FINE275 - Calligraphy to Conceptual Art: Text as an Image in Islamic and East Asian Visual Arts (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Calligraphy to Conceptual Art: Text as an Image in Islamic and East Asian Visual Arts Winter 2025", "02:30PM - 05:20PM", "S. Sheikh", "02:30PM - 05:20PM", "S. Sheikh", "Email: s26sheik@uwaterloo.ca", "Exploring the history of Islamic and East Asian calligraphic arts and the study of Eastern and Western artists, this course examines multiple ways in which writing and other forms of visible language are incorporated into visual arts.", "SI 231R: View requirements for SI 231R", "EASIA 231R: View requirements for EASIA 231R", "FINE 275: View requirements for FINE 275", "Open to Fine Arts graduate students only.", "View requirements for FINE 695", "Lectures, readings and discussions provide an introduction to history of Islamic and East Asian calligraphic arts as well as an overview of text-based art in Western art.", "The course provides an opportunity for creating calligraphy-based projects using traditional Asian and Islamic calligraphy techniques.", "A broad understanding of historical and contemporary issues relevant to calligraphic and text-based art, including an interdisciplinary perspective enabling the student to see how these disciplines may be combined in their work.", "Demonstrate perceptual, visual, and conceptual skills through artmaking and as a critical viewer.", "Feb 12 – 16 Introduction to East Asian Scripts Ascending the Heron Tower (YouTube).", "“The Asian Dimensions of Postwar Abstract Art: Calligraphy and Metaphysics.”", "Cross-listed courses", "Intellectual property includes items such as:", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 177, "course_code": "FINE 319", "course_name": "FINE319 - Contemporary Art (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["FINE 319", "Readings in contemporary criticism and gallery visits are an integral part of the course.", "View requirements for FINE 319", "Through critical analysis of contemporary movements and artworks, texts, exhibitions, and films, we will be looking at the ways in which contemporary artists and critics across the globe have challenged ideas of modernity, post-modernism, and what it means to be contemporary in an uncertain age.", "Identify key theoretical frameworks to explain developments in contemporary art in social, political, formal, conceptual and aesthetic contexts.", "Appraise, compare and construct critical arguments & analyses of contemporary art in written and oral form through written tests, presentations, text analysis, and group discussions)", "Late Assignments and Make-Up Tests", "Electronic Device Policy", "The presence of laptops in a lecture hall can be distracting for some students.", "Please be considerate and courteous to those around you.", "Intellectual property includes items such as:", "Library for research-based assignments", "The Department of Fine Arts strongly values anti-racism, decolonization, equity, diversity, and inclusion, and considers our commitment to these values to be an essential part of our community.", "We are committed to creating and maintaining inclusive environments that centre the voices and experiences of equity-deserving groups, including, but not limited to Black and Indigenous individuals, people of colour, women-identifying individuals, non-binary, agender,", "and gender-nonconforming individuals; 2SLGBTQ+ individuals; persons with disabilities; individuals experiencing class or economic barriers; individuals experiencing houselessness; and people from other racialized, marginalized, and under-represented communities.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 186, "course_code": "FR 276", "course_name": "FR276 - Introduction to Literature: Quebec and French Canada (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Literature: Quebec and French Canada Winter 2025", "08:30AM - 09:50AM ML 354", "Sélectionner des informations pertinentes à travers différentes sources critiques", "La chasse-galerie Introduction aux études littéraires", "La chasse-galerie Réalisme et surnaturel; La représentation de la marginalité", "Méthodologie: Analyser un conte traditionnel", "La poésie entre terroir et exotisme La querelle des régionalistes et des exotiques", "Méthodologie: Analyser un poème - le commentaire de texte", "Méthodologie: La dissertation littéraire", "Cohérence et fragmentation dans les récits contemporains Dissertation littéraire", "La professeure les reverra brièvement, puis les étudiant.e.s auront quelques jours pour terminer leur devoir à la maison.", "La dissertation littéraire", "Remise des travaux", "An INC grade may not be used to complete the entire course.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 189, "course_code": "FR 296", "course_name": "FR296 - French Culture & Literature: Origins to 1715 (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["A survey of French culture and literature from their origins to 1715.", "The course structure is chronological with an emphasis the socio-cultural contexts surrounding literary texts.", "Le cours FR 296 a trois objectifs généraux:", "Module 1: Introduction", "Détail des notes", "In the case of multiple submissions by the same student, your instructor will mark only the final submission uploaded, so make sure your final submission is the correct one.", "All cheating and plagiarism will be brought to the attention of the Department Chair of French Studies and the Associate Dean of the Faculty of Arts and penalized accordingly.", "Certificates and Programs in French", "Diplomas in French language", "Programs", "Reconnaisance du territoire traditionnel", "Nous tenons à souligner que nous nous trouvons sur le territoire traditionnel des peuples attawandaron (Neutres), anishinabé et haudenosaunee."]}, {"course_id": 190, "course_code": "FR 297", "course_name": "FR297 - French Culture & Literature: 1715 to the Present (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["04:00PM - 05:20PM", "V. Dusaillant-Fernandes", "vcdusaillantfernandes@uwaterloo.ca", "A survey of French culture and literature from 1715 to the present.", "Analyser des œuvres littéraires de la période étudiée à travers une explication de texte et une dissertation;", "Perfectionner les interactions orales en classe par des discussions en classe et des échanges fructueux sur la composition et les thèmes des oeuvres à l’étude", "Introduction au cours", "Introduction à Voltaire et à Micromégas", "24-26 février", "Introduction à Flaubert", "Étude de Un cœur simple", ": Quiz de lecture 1 sur Un cœur simple", "La Belle époque", "17-19 mars La Deuxième Guerre mondiale", "24-26 mars Introduction à Annie Ernaux Étude de La Place   24 mars : Rendre la dissertation", "Une dissertation", "Policy allowing use of generative AI under certain conditions", "Excessive use of a translator and the use of artificial intelligence may be sanctioned in the rubric concerning the quality of language and expression and reported to the faculty's Associate Dean of Undergraduate Studies for academic sanction.", "Library for research-based assignments", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 202, "course_code": "FR 473", "course_name": "FR473 - Aspects of French Canada (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["A presentation of traditional and contemporary French Canada in the fields of the arts, literature, music, politics, and society.", "Ce cours en études culturelles propose une théorisation du concept de minorité culturelle, à travers les exemples des différentes communautés francophones du Canada.", "Entreprendre une réflexion théorique sur le concept de minorité culturelle et linguistique;", "Comprendre et appliquer, à l’oral et à l’écrit, des concepts théoriques dans des études de cas issues de la vie courante et dans des récits issus des expériences des étudiant.e.s;", "Les contacts inter-linguistiques", "Histoire des migrations", "Lire la presse franco-ontarienne", "Article sur le travail en milieu bilingue Défense et illustration des langues minorisées", "Tables rondes sur les enquêtes culturelles  Partage Enquête culturelle 2 (3 éléments)", "L’Enquête culturelle", "L’Enquête culturelle est un devoir préparé à la maison.", "La présentation orale", "Les rapports métacognitifs", "Remise des travaux", "An INC grade may not be used to complete the entire course.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 204, "course_code": "FR 485", "course_name": "FR485 - French Women Writers (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["V. Dusaillant-Fernandes", "vcdusaillantfernandes@uwaterloo.ca", "A study of selected works by women writers in France from the Middle Ages to the 21st-century.", "The course will focus on the literary features of these works and on their value as reflections of the position of women in French society throughout the period.", "À travers l'analyse, la discussion, l'évaluation en classe et les travaux écrits sur des œuvres sélectionnées, ce cours approfondira les connaissances des étudiant.e.s sur les différents genres et les introduira aux concepts théoriques pertinents pour élucider ces œuvres.", "Introduction au cours", "La passion maternelle", "La Révolution française et son impact sur les auteures", "Introduction à Olympes de Gouges et étude de texte", "24-26 février", "Introduction à Françoise Sagan", "Le mouvement #Metoo et son impact sur l’écriture des femmes : écrire les abus", "La dissertation", "Deux sujets seront présentés; il faudra en choisir un.", "De plus amples informations ainsi que des techniques pour écrire une dissertation seront fournies avant l’échéance de ce travail.", "Policy allowing use of generative AI under certain conditions", "Excessive use of a translator and the use of artificial intelligence may be sanctioned in the rubric concerning the quality of language and expression and reported to the faculty's Associate Dean of Undergraduate Studies for academic sanction.", "Library for research-based assignments", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 207, "course_code": "GEOE 391", "course_name": "GEOE391 - Law and Ethics for Environmental and Geological Engineers (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Law and Ethics for Environmental and Geological Engineers Winter 2025", "G. Smeijers", "email", "Rachael Trillium Messenger-Lehmann", "1              Introduction to Law and Regulation", "We will cover a topic each week of the term as set-out below.", "1              Introduction to Law and Regulation", "Student Responsibilities and Conduct Expectations", "As such, any of the following are absolutely inappropriate in the context of this course and will be handled accordingly:"]}]