[{"course_id": 50, "course_code": "NE 455A", "course_name": "NE455A - Nano-Electronics Laboratory 2 (0.25)", "term_name": "4B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 02:20PM QNC 2611", "08:30AM - 02:20PM QNC 2611", "08:30AM - 02:20PM QNC 2611", "08:30AM - 02:20PM QNC 2611", "08:30AM - 02:20PM QNC 2611", "08:30AM - 02:20PM QNC 2611", "Term and year of offering:", "QNC 2611/ QNC 2614", "Application of experimental tools and techniques in nano-electronics.", "Experimental exercises to complete the design cycle involve printed circuit board (PCB) assembly and soldering, measurement of the formation of a nonanethiol self- assembled monolayer, determination of the partition coefficient for a solvent vapour into a monolayer-protected-cluster film deposited on a quartz crystal microbalance (QCM), and the use of various characterization methods.", "These exercises also stress the safe handling of chemicals in the process.", "Formulate and communicate a plan to create prototype oscillator circuit,", "Assemble and troubleshoot oscillator circuit design,", "Test and evaluate prototype performance according to customer requirements,", "Summarize status of project/prototype and recommend possible solutions", "Design Review Presentation", "Total", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 51, "course_code": "NE 455B", "course_name": "NE455B - Nano-Instrumentation Laboratory 2 (0.25)", "term_name": "4B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Nano-Instrumentation Laboratory 2 Winter 2025", "Application of experimental tools and techniques employed in nanotechnology.", "Experimental exercises may involve microfabrication (photolithography, film deposition, and etching) and testing of micro-electro-mechanical-system (MEMS) devices based on the design from NE454B. These exercises also stress working safely in a clean-room environment.", "The NE 455B (nano-instrumentation) laboratory course is a continuation of NE 454B and consists of three lab periods, each of six hours in duration.", "NE 455B experimental exercises include microfabrication processes (photolithography, thin film deposition, and etching) and characterization of fabricated microelectro-mechanical-system (MEMS) devices, which were designed in NE 454B. Student groups for this course are normally those already assigned for NE 454B.", "Upon completion of NE 455B, you will have demonstrated competence in the use of standard engineering tools in applications representative of nanotechnology engineering areas that can be found typically in modern industrial or academic facilities:", "Know safety procedures for work in a cleanroom laboratory", "Be able to work effectively in a team to fabricate MEMS devices", "Be able to operate a precision IC prober and associated electronics systems to test fabricated MEMS devices", "Analyze the results and create a report to complete a typical design cycle", "Topics to be covered in the laboratory sessions:", "Although laboratory exercises are performed in groups, marks are allocated in each laboratory session for in-laboratory performance individually.", "There are pre-laboratory safety quizzes prior to each of the first two NE455B labs.", "• Students who submit a short-term absence that results in missing a lab will need to reach out to the instructor to request a make-up date.", "Accommodation"]}, {"course_id": 52, "course_code": "NE 455C", "course_name": "NE455C - Nanobiosystems Laboratory 2 (0.25)", "term_name": "4B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Nanobiosystems Laboratory 2 Winter 2025", "08:30AM - 02:20PM QNC 2506", "08:30AM - 02:20PM QNC 2506", "08:30AM - 02:20PM QNC 2506", "08:30AM - 02:20PM QNC 2506", "08:30AM - 02:20PM QNC 2506", "08:30AM - 02:20PM QNC 2506", "Application of experimental tools and techniques employed in nanobiotechnology.", "These exercises also stress the need for safe handling of micro-organisms and biomaterials.", "Protein which is produced during the first section will be purified using techniques such as metal affinity columns.", "During the third section nano-gold particles (AuNP) will be made and characterized and the protein will be assembled on the AuNP.", "Demonstrate competence in the use of some standard engineering tools in Nanobiotechnology Engineering applications.", "Characterize nanoparticle sizes using dynamic light scattering and UV-Vis spectroscopy.", "Perform a gel electrophoresis method for DNA and also for protein.", "Perform cell purification as well as protein purification and characterization.", "Carry out the synthesis of gold nanoparticles through chemical reduction of gold salts.", "In addition, the students should bring the original pre-lab report and a hard copy of it to the laboratory; The original copy of the pre-lab report should be handed-in to the instructor in the beginning of the laboratory period for marking and the hard copy of it should be used by the student during the laboratory period.", "In-lab Performance", "Late arrival for any laboratory session will result in a performance grade deduction (25% deduction for every 5 min) for that session; students who arrive for a laboratory session following completion of the introductory presentation will not be allowed to participate in that session, and will receive a zero grade for it.", "Although most laboratory exercises are performed in groups, marks are allocated in each laboratory session for in-laboratory performance and laboratory notebook record keeping.", "Students are expected to participate in laboratory sessions in a safe manner at all times, thereby ensuring not only their own personal safety, but also that of their classmates and the Teaching Assistants.", "safety training must be completed in order to participate in laboratory sessions.", "Safety quizzes that stress the particular hazards for each laboratory experiment or exercise must also be completed in order to participate in specific laboratory sessions.", "Students who submit a short-term absence that results in missing a lab will need to reach out to the instructor to request a make-up date.", "It is possible that a make-up date cannot be found especially later in the term."]}, {"course_id": 53, "course_code": "NE 455D", "course_name": "NE455D - Nanostructured Materials Laboratory 2 (0.25)", "term_name": "4B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 02:20PM QNC 2614", "08:30AM - 02:20PM QNC 2614", "08:30AM - 02:20PM QNC 2614", "08:30AM - 02:20PM QNC 2614", "08:30AM - 02:20PM QNC 2614", "08:30AM - 02:20PM QNC 2614", "Application of experimental tools and techniques employed in nanomaterials.", "Experimental exercises may investigate and design the production and performance of electronic double layer capacitors (EDLC) for battery applications through the use of dispersion and mixing protocols to prepare carbon materials.", "Performance of the materials may be quantified using defined testing methods for measurement of electrical storage metrics.", "The overall aim of this laboratory is to prepare and test carbon based composite mats suitable for electrodes used in supercapacitors (SC).", "A known composition is used first and different electrolytes are compared by studying electrode material performance.", "Students will then be asked to design and prepare a SC to meet a set of requirements.", "The laboratory exercise will give the students: an understanding of components of SC, how to make simple SC cells, key methods for testing performance and the variables that affect performance.", "Use techniques to prepare carbon based composite mats and two electrode coin cells.", "Design a new coin cell composition including a new electrode for improved performance.", "Analyze results from SC testing and compare effects of different electrolytes.", "Communicate clearly and effectively in oral, written and/or visual form through working in a lab team and writing technical reports.", "Measuring key performance metrics by cyclic voltammetry, constant current charge/discharge methods and electrical impedance spectroscopy.", "Although most laboratory exercises are performed in pairs, marks are allocated in each laboratory session for in-laboratory performance and laboratory notebook record keeping for each individual student.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 54, "course_code": "NE 335", "course_name": "NE335 - Soft Nanomaterials (0.50)", "term_name": "List 1", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Monday, Friday -", "10:00AM - 11:20AM MC 4064", "H. Shahsavan", "Prof. Hamed Shahsavan", "E-mail: hshahsav@uwaterloo.ca", "Sahar Kalani", "Introduction to the applications of macromolecules in nanotechnology.", "Block copolymers and self-assembled polymerization.", "Dendrimers and molecular brushes.", "Applications in the manufacturing of nanostructured materials and nanoscale devices.", "Identify the role Soft Matter plays in nanotechnology, nanoscience, and their applications", "Identify different subclasses of soft matter", "Correlate/quantify those phenomena using physical chemistry and thermodynamics", "Identify the best characterization techniques to describe the properties of soft matter", "Recognize the importance and contribution of subclasses of soft matter in real-world technologies and daily life", "Survey the literature about a certain topic of interest in soft matter", "Effectively communicate their knowledge in common academic formats such as presentations, videos, and written reports", "Effectively work on projects in a team", "Week Sessions Other", "1 Session 1 - Introduction", "Session 2 - Introduction", "Session 3 - Introduction", "Session 4 - Introduction", "Session 10 - Polymers", "Session 12 - Polymers", "Session 13 - Polymers", "Session 14 - Polymers", "Session 15 - Polymers", "Session 19 - Medical Microrobots", "Session 21 - Advanced Liquid Crystals", "Introduction to Soft Matter Introduction to Soft Matter, Ian W. Hamley No", "Intermolecular and Surface Forces Intermolecular and Surface Forces, Jacob N. Israelachvili No", "Introduction to Colloid and Surface Chemistry Introduction to Colloid and Surface Chemistry, Duncan J. Shaw No", "Introduction to Polymers Introduction to Polymers, Robert J. Young and Peter A. Lovell No", "Polymer Blends Polymer Blends:", "Introduction to Liquid Crystals: Chemistry and Physics Introduction to Liquid Crystals: Chemistry and Physics, Peter J. Collings, and John W. Goodby No", "There will be two categories of topics to choose from, on a first-come-first-serve basis:", "All instructions, expectations, and templates for delivering these reports will be provided in UW-LEARN.", "The deadline for uploading the presentation slides to UW-LEARN is November 24th.", "The deadline for uploading the written report to UW-LEARN is December 3rd", "The tentative time slot for the oral presentation can be found in the course calendar.", "Students can bring one page of cheatsheet (back and front).", "Questions in these pop quizzes will be conceptual and descriptive."]}, {"course_id": 55, "course_code": "NE 344", "course_name": "NE344 - Electronic Circuits (0.50)", "term_name": "List 1", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electronic Circuits Fall 2024", "11:30AM - 12:20PM MC 4060", "E-mail", "Duty", "E-mail", "Division", "Metal-oxide-semiconductor field-effect transistor (MOSFET), circuit biasing and load-line analysis.", "Small-signal equivalent circuits and single stage amplifier configurations.", "Differential and multistage MOSFET amplifiers.", "The cascode configuration, current mirror and active loads.", "Oscillators, waveform shaping circuits and delay analysis.", "Introduction to digital circuits, the transistor switch, inverter circuits and complementary metal-oxide-semiconductor (CMOS) logic circuits.", "Signals, amplifiers concepts and nonlinear circuit analysis.", "Metal-oxide-semiconductor field-effect transistors (MOSFETs).", "Differential and multistage MOSFET amplifiers.", "Feedback circuit configurations and stability,", "Oscillators, waveform shaping circuits and delay analysis,", "Introduction to digital circuits, the transistor switch, CMOS inverter circuit and digital logic circuits,", "Function and characteristics of basic electrical transducers.", "Basics of data acquisition.", "Apply knowledge of engineering to the analysis and design of electronic circuits.", "Identify and solve engineering problems in the circuits’ area.", "F", "We will follow closely Microelectronic Circuits, Sedra & Smith, 8th edition textbook.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 56, "course_code": "NE 345", "course_name": "NE345 - Photonic Materials and Devices (0.50)", "term_name": "List 1", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Monday, Friday -", "08:30AM - 09:50AM DWE 3518", "E-mail", "Wave nature of light, refractive index and dispersion, group velocity, irradiance and Poynting vector, Snell's law, Fresnel's Equation, antireflection coatings, absorption of light, temporal and spatial coherence, dielectric waveguides and optical fibers, planar waveguides, dispersion in waveguides; light emitting diodes (LED), pn junction, LED materials, stimulated emission, lasers, photodetectors, photovoltaic devices, solar cells.", "Light waves in a homogeneous medium", "Poynting vector", "Fresnel’s equations", "Multiple interference and optical resonators", "Chapter 2: Dielectric waveguides and optical fibers (~2 weeks)", "Symmetric planar dielectric slab waveguide", "Modal and waveguide dispersion", "Dispersion in single mode fibers", "Attenuation in optical fibers", "Review of semiconductor concepts and energy bands", "Direct and indirect bandgap semiconductors", "pn junction principles", "The pn junction band diagram", "LED characteristics", "Stimulated emission rate and Einstein coefficients", "Laser oscillation conditions", "Principle of the laser diode", "Heterostructure laser diode", "Elementary laser diode characteristics", "Steady state semiconductor rate equation", "Quantum well devices", "Principe of the pn junction photodiode", "Absorption coefficient and photodiode materials", "Quantum efficiency and responsivity", "Noise in photodetectors", "Solar energy spectrum", "pn junction photovoltaic I-V characteristics", "Optoelectronics and Photonics: Principles and Practices S. O. Kasap “Optoelectronics and photonics: principles and practices”, 2nd edition."]}, {"course_id": 57, "course_code": "NE 353", "course_name": "NE353 - Nanoprobing and Lithography (0.50)", "term_name": "List 1", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 11:20AM RCH 305", "Theory and application of nanoprobing based on scanning probe microscopy (scanning tunneling microscopy, atomic force microscopy, scanning near-field optical microscopy).", "Nanolithographic techniques (extreme-UV lithography, X-ray lithography, e-beam lithography, focused ion beam lithography, nano-imprint lithography and soft lithography).", "It covers photon and electron based exposure-develop lithography, and direct writing/imprinting types of lithography.", "Resolution enhancement techniques for photolithography", "Other types of photon-based lithography", "X-ray lithography", "Electron beam lithography", "Focused ion beam lithography", "Nanoimprint lithography", "Scanning probe microscopy and lithography", "Soft lithography and other patterning techniques", "Nanofabrication: Fundamentals and Applications by Ampere A Tseng, World Scientific, 2008 No", "Micro-nanofabrication: Technologies and Applications by Zheng Cui, Springer, 2013 No", "This course includes the independent development and practice of specific skills, such as the understanding of various fabrication techniques and the choice for suitable tasks.", "Library for research-based assignments"]}, {"course_id": 58, "course_code": "NE 381", "course_name": "NE381 - Introduction to Nanoscale Biosystems (0.50)", "term_name": "List 1", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Nanoscale Biosystems Fall 2024", "Email: aghavami@uwaterloo.ca", "Specific aspects of biosystems required for the engineering of nanobiotechnological applications: topics to be covered may include surface and bulk science concepts needed for the development of lab-on-chip systems and those aspects of molecular biology of the cell necessary for application to medical diagnostics.", "Elements of design required for the development of modern instrumentation may also be covered, thereby providing a solid foundation for more advanced topics and applications.", "Molecular biology and biochemistry required for the engineering of nanobiotechnological", "Structure and characterization of DNA, RNA, cproteins, lipids; introduction to labon-", "chip systems and microfluidic devices.", "Application to medical diagnostics, protein and nucleic", "Elements of design required for the development", "of modern instrumentation and biosensors", "Understand the structure and functions of nucleic acids, proteins, lipids, carbohydrates", "Understand the design and fabrication processes of PCR", "• Understand the blotting techniques and their applications", "• Understand microfluidic systems and design a simple microfluidic channel", "• Apply these principles to nanobiotechnology applications", "Week#2&3: Lipids and carbohydrates & their application", "Weel#4: Protein structure & their tools", "Nucleic Acid structure & their tools", "Week#7: Fundamentals of microfluidics, Micro-scale fluidic mechanics", "actuators and other components"]}, {"course_id": 59, "course_code": "NE 451", "course_name": "NE451 - Simulation Methods (0.50)", "term_name": "List 1", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Simulation Methods Fall 2024", "10:00AM - 11:20AM RCH 105", "08:30AM - 09:50AM DWE 3518", "This course provides an introduction to and an overview of computational methods that are currently employed for the simulation of structural and bulk properties of matter, particularly as applied to physical and biological systems at the nanometer scale.", "Topics to be covered in this course include energy functions and force fields, geometry optimization, normal mode analysis, and reaction--path techniques at the molecular level, and an introduction to the simulation of static and dynamic properties of substances via both Monte Carlo and molecular dynamics (MD) methodologies.", "Simulation Methods is a comprehensive course that covers a wide range of computational techniques used to simulate the structural and bulk properties of materials in physical and biological systems at the nanometer scale.", "By mastering these techniques, students can contribute to advancements in materials science and engineering, enabling them to tackle complex challenges in nanoscale materials research.", "In addition to theoretical concepts, each module includes a lab component where students gain hands-on experience with different software, practical simulation applications, and coding examples.", "This practical approach helps students apply the learned concepts to real-world material systems and build their computational skills", "Analyze and articulate the benefits and drawbacks of different computational methods", "Use High-performance computing for materials design", "Choose suitable computational approaches for addressing specific material properties and processing challenges", "Critically assess scientific literature that employs computational techniques", "Foundations and Theorems of DFT: Including the Hohenberg-Kohn Theorems.", "Kohn-Sham Method and Cycle: Understanding the Kohn-Sham approach and its practical applications.", "Exchange-Correlation Approximations: Various methods for approximating exchange-correlation.", "Basis Sets and Pseudopotentials: Gaussian and plane wave basis sets, and the theory of pseudopotentials.", "Module 2: Molecular Dynamics Simulation", "Newtonian Dynamics and Interaction Potentials: Basic principles and types of potentials (e.g., pair, Tersoff, ionic).", "MD Simulation Algorithms: Various algorithms such as Verlet, leapfrog, and Beeman's algorithms.", "Thermodynamic Equilibrium and Ensemble Averages: Concepts of equilibrium, ensemble averages, and thermostat methods.", "Boundary Conditions and Pressure Control: Handling boundary conditions and controlling pressure in simulations.", "Module 3: Introduction to Monte Carlo Method in Science and Engineering", "Basic Principles of Monte Carlo Methods: Introduction and foundational concepts.", "Metropolis-Hastings Algorithm: Including the simulation of the Ising model.", "Kinetic Monte Carlo Simulations: Basic principles and specific problems.", "Introduction to Graph Neural Networks (GNNs): Basics and importance in materials science.", "Structure and Function of GNN Layers: Including message passing and aggregation techniques.", "hands-on  Lab 3: Molecular Dynamics Simulations", "Internet connection Yes", "Linux Basic Commands", "Statistical Thermodynamics", "Required Software and Tools", "conda", "Quantum ESPRESSO", "LAMMPS Molecular Dynamics Simulator", "These assignments are designed to assess your ability to apply the skills and knowledge gained during the lab, reinforcing key concepts and contributing to your overall course grade", "Below are the key components of our assignment screening process:", "Identical submissions (whether it be", "This collaborative approach promotes a deeper understanding of the subject matter and nurtures critical evaluation skills among students.", "These tools allow students to run and test their programs efficiently, facilitating accurate assessments of their coding skills and simulation results."]}, {"course_id": 60, "course_code": "NE 452", "course_name": "NE452 - Special Topics in Nanoscale Simulations (0.50)", "term_name": "List 1", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Special Topics in Nanoscale Simulations Winter 2025", "Dr. Subha Kalyaanamoorthy", "Email: subhak@uwaterloo.ca", "Topics in this theme area may include: an overview of modern computational methods and algorithms in nanoscale materials, such as steered molecular dynamics, ab initio molecular dynamics, multiscale modelling, dissipative particle dynamics, transition path sampling, phase-field modelling, quantum simulations using Feynman path integral techniques, condensed-phase spectroscopy, linking of simulations to experiment, simulations and their practical applications.", "*********************************************************************************************************************", "This course provides a comprehensive introduction to molecular simulations, emphasizing their application in bionanotechnology.", "Students will explore the fundamental concepts of biomolecular structure, gaining insights into proteins, lipid membranes, and other biomolecules relevant to nanoengineering.", "The course delves into molecular simulation techniques, focusing on molecular dynamics (MD) simulations as a core method for studying biomolecular interactions, dynamics, and properties.", "Advanced topics include enhanced sampling techniques such as umbrella sampling and metadynamics, which address challenges in exploring complex energy landscapes and rare events.", "Real-world examples from bionanotechnology applications will highlight the role of molecular simulations in solving engineering challenges, such as understanding nanoparticle-biomolecule interactions, studying transport phenomena through lipid membranes, and designing nanostructures for drug delivery and biosensing.", "Through lectures, hands-on practicals, and case studies, students will develop the skills to apply molecular simulations to analyze and innovate within the field of bionanotechnology.", "************************************************************************************************************************", "Describe the structural and functional properties of biomolecules such as proteins, lipid membranes, and polymers, emphasizing their relevance in nanoengineering applications.", "Gain hands-on experience on different software programs such as Visual Molecular Dynamics, Chimera, Pymol that can be used for structure and simulation analyses", "Perform molecular dynamics simulations of different types of molecules and investigate complex free energy landscapes and rare molecular events", "Examine molecular transport through lipid membranes and nanopores, applying simulations to understand key properties and mechanisms.", "Model and interpret the interactions between nanoparticles and biomolecules, understanding their implications for bionanotechnology applications such as drug delivery", "Week 1-2 : Introduction to Biomolecular structure and interactions", "Week 7-8 : Molecular simulations and Molecular dynamics [", "Week 10-12 : MD simulations for bionanotechnology", "Notice of Recording"]}, {"course_id": 62, "course_code": "NE 459", "course_name": "NE459 - Nanotechnology Engineering Research Project (0.50)", "term_name": "List 1", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Email: youngki.yoon@uwaterloo.ca", "Recognize and articulate a research challenge within the domain of nanotechnology", "Develop innovative engineering solutions to address the identified problem", "Produce a thorough and well-structured report encompassing background information, problem statement, methodology, findings, conclusions, and a reference section", "The co-reader should be a faculty member in a related research area, and will be chosen by the supervisor and the student.", "The report must contain at least the following; a) a dated title page; b) a summary of the report; c) a table of contents; d) the body of the report, suitably subdivided into sections; f) conclusions and recommendations; and g) references.", "quality of project and experimental design; adequate amount of design-related activities in project; clarity of design choices in report", "clear problem definition; accurate theoretical analysis/simulation; clear experimental process description; in-depth and precise data analysis; proper conclusion drawing", "proper title, abstract, introduction, conclusion, and references; scientific writing; organization of the report; grammatical errors; quality of figures and tables", "difficulty of the problem; length of the report; quality of solution; research performance; critical thinking, overall merit", "This course includes the independent development and practice of specific skills related to nanotechnology engineering research and academic writing.", "Library for research-based assignments"]}, {"course_id": 64, "course_code": "NE 466", "course_name": "NE466 - Tactile Sensors and Transducers (0.50)", "term_name": "List 1", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 09:50AM MC 4058", "Principles of transduction including capacitive, piezoelectric, piezoresistive, percolation, and tunneling-based sensing.", "Designing bendable and stretchable sensors, and self-powered sensors.", "Applications including robotics, electronic skin, biometrics, and bio-vitals.", "Understand basic principles of tactile sensing in skin.", "Ability to identify and evaluate key performance parameters for tactile sensors and make design choices based on it.", "Understand non-core concepts related to tactile sensing such as flexible devices.", "Design simple flexible devices based on the use of passive architecture.", "Overview of human skin and its tactile capabilities", "(Basic structure of skin, different types of tactile receptors, Their location, density and basics of nerve impulse generation and encoding)", "Current methods for tactile sensing", "(Some common methods for tactile sensing and their basic physics, Capacitive, piezoelectric, peizoresistive, percolation, tunneling)", "(A hierarchical nanostructures and FET based sensing)", "Self-powered/Energy harvesting sensors/TENG based sensor", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 65, "course_code": "NE 471", "course_name": "NE471 - Nano-Electronics (0.50)", "term_name": "List 1", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Nano-Electronics Fall 2024", "11:30AM -", "Deposition and patterning techniques.", "Describe the quantum nature of electrons based on the Schrödinger equation", "Understand the band theory of solids and the effect of quantum confinement in nanomaterials", "Describe carrier transport in nanoscale devices", "Identify and solve appropriate equations for nanoelectronic devices", "Perform simulations using engineering tools to properly design nanoscale materials and devices", "Introduction", "Overview of Conventional Semiconductor Devices", "Ch. 3. Basics of Quantum Mechanics", "Density of States", "Particle Statistics", "Carrier Transport in Nanoscale Devices", "Ballistic and Diffusive Transport", "This course includes the independent development and practice of specific problem-solving skills related to nanoelectronics.", "Library for research-based assignments"]}, {"course_id": 66, "course_code": "NE 476", "course_name": "NE476 - Organic Electronics (0.50)", "term_name": "List 1", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 11:20AM RCH 305", "08:30AM - 09:50AM RCH 305", "Electronic structure of conjugated molecules.", "Electronic conduction in organic solids, band and hopping transport, morphological disorder and traps.", "Introduction to the main types of organic electronic devices, such as light-emitting devices, solar cells, field-effect transistors, photodetectors and imaging devices.", "It begins with a review of electronic structure of single organic molecules as a guide to the electronic behaviour of organic aggregates.Various relevant material phenomena are reviewed; including topics from photophysics (absorption and emission of light, excited states, radiative and non-radiative transitions), intermolecular charge transport mechanisms (hopping, disorder), charge injection and transport models, and energy transfer processes.", "Their", "View requirements for ECE 634", "Acquire a general background in the field of organic electronics and optoelectronics, basic theory, applications, challenges, recent developments, etc.", "Know and understand relevant fundamental scientific theory (qualitatively), and its relationship to organic semiconductor material and device design concepts.", "Become familiar with relevant terminology, and be able to read and understand scientific literature in the field", "NE476 only: Become familiar with basic device design parameters and implement a simple design of a certain organic electronic device.", "ECE634 only: Become able to survey and analyze research papers on certain relevant topics in the field", "Course Introduction", "Introduction to OLED", "Electronic Structure of Organic Molecules", "Photophysics of Organic Molecules", "Electronic Conduction in Organic Solids", "Organic Electronic Materials & OTFTs", "Organic Electronic Materials & OTFTs", "NE 476 Design Assignment due", "ECE 634 Oral Presentations & Written Critiques", "Introduction to OLEDs:", "General comparison of inorganic versus organic devices", "Electronic Structure of Organic Molecules", "Photophysics of Organic Molecules", "The Solid State: (Bonding, states of matter, amorphous & crystalline states), Excitons, Forester and Dexter energy transfer, Exciton quenching processes", "Electronic Conduction in Organic Solids", "Aspects of OLED Physics and Technology", "Organic Light Harvesting Devices", "Molecular design rules for mobility and chemical stability.", "Electronic Processes of Organic Crystals and Polymers “Electronic Processes of Organic Crystals and Polymers” , Pope & Swenberg, Oxford University press, 2nd edition (1999).", "Essentials of Molecular Photochemistry “Essentials of Molecular Photochemistry” , Gilbert & Baggott, CRC Press, 1991.", "Electrical Transport in Solids “Electrical transport in solids : with particular reference to organic semiconductors”, Kao, Pergamon Press; 1st edition (1981).", "Design Assignment 20%", "ECE 634", "Different marking schemes will be used for ECE634 and NE476:", "Students will be given the assignment to design a specific organic electronic device that will meet certain performance and/or fabrication method requirements.", "Students will conduct a literature review on a certain relevant topic of a fundamental scientific nature.", "In addition to satisfying ECE minimum grade requirements for passing graduate courses, ECE634 students must also obtain a total of at least 45/75 in the quiz, midterm and final exam combined in order to pass this course.", "NE 476 DESIGN", "Design Elements:", "c. the thicknesses of each layer", "In making the above design choices for the various layers of the devices, the fundamental material properties that are relevant for the function of the specific layer or layers should be considered.", "The following are examples of some of the fundamental properties that should be considered in making choices about the material, layer sequence and layer thickness selection:", "i. the mobility of holes and/or electrons in the material (for all layers with a charge transporting role)", "the quantum yield and exciton relaxation efficiency of the material (for layers with light emission functionalities)", "the exciton diffusion length (for layers where the diffusion of excitons can play an important role on its functionality)", "The write-up should include the following info in separate sections using the subtitles provided in italics and numbered with the same numbers 1-7):", "The first paragraph will outline the main objectives of the design and the set of performance and/or fabrication requirements that the device needs to satisfy.", "This second paragraph will serve to articulate your proposed solution to the problem outlined in the first paragraph,", "For each organic or organometallic semiconductor material selected in your design, i) show the molecular structure in a schematic diagram that also includes the full chemical name of the material plus any acronyms used for this material in your document, and ii) a brief explanation of how the molecular structure enables or supports the properties you desire from this material (this info can be found in research or review papers; make sure to cite all papers properly!).", "In general, layers of semiconductor materials should be as thin as possible (to minimize ohmic losses across layers as well as material utilization and cost since these materials can be expensive) but thick enough to ensure the layers", "Conclusion (0.5-1 page): In this section provide a conclusive summary of your design (which can be similar to the second paragraph of the Executive Summary)", "that conducting this design assignment has helped them learn or expand their knowledge in.", "3) In general, in order to be acceptable, each selected paper must meet the following conditions:", "a. Must be a peer-reviewed research article on a topic in the field of organic electronic materials and devices", "The following file name format must be used for the PDFs: YourLastName_FirstAuthorLastName_YearPublished.pdf", "The following file name format must be used for your slides file:", "i. Background: This part should give some introduction to the general topic that the selected papers represent.", "This part can be for all papers combined, or divided to serve as a separate background for each paper, as may be appropriate", "Results & Discussion: A brief outline of the important results or findings in each paper", "Conclusions: A summary of the main conclusions of each paper", "d. Marking: The following general and approximate marking scheme will be used:"]}, {"course_id": 67, "course_code": "NE 481", "course_name": "NE481 - Nanomedicine and Nanobiotechnology (0.50)", "term_name": "List 1", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 09:50AM E6 2024", "11:30AM -", "Email:  eyim@uwaterloo.ca", "Overview of biomedical engineering principles.", "Formulation and manufacturing processes for production of nanoparticles for medical applications.", "Route of administration and controlled delivery strategies.", "Formulation and manufacturing process for drug delivery in the biotechnology and pharmaceutical industries.", "CHE 560: View requirements for CHE 560", "Overview of biomedical engineering principles.", "Formulation and manufacturing processes for production of nanoparticles for medical applications.", "Route of administration and controlled delivery strategies.", "Formulation and manufacturing process for drug delivery in the biotechnology and pharmaceutical industries.", "4. Design scalable formulations and manufacturing processes to produce nanomedicine for biomedical applications.", "Week 1:  (Topic 1) Course overview: Introduction to biomaterials and nanomedicine", "Introduction to biomaterials and biointerface", "Micro / nanoparticle formulation strategies", "Emulsion", "Introduction to HLB", "Suspension", "Introduction to tablet and tablet manufacturing process", "Overview of physiology system related to oral drug administration: neural, cardiovascular, renal, gastrointestinal systems", "Pharmacokinetics", "Adsorption", "Distribution", "Metabolism", "Elimination", "Introduction to controlled release", "Overview of administration of nanomaterials and tissue response", "Examples of alternative administration, controlled release in body systems, targeted delivery", "Sterilization", "Introduction to regulatory approval process for drugs", "Preclinical and clinical trials", "Biomaterials Science: An Introduction to Materials in Medicine, 3rd edition.", "Design Projects 30%", "Online quizzes and Dropbox folders for projects will be access via Learn.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 68, "course_code": "NE 486", "course_name": "NE486 - Biosensors (0.50)", "term_name": "List 1", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to biosensors.", "Chemical, optical, and pattern recognition-based sensing.", "DNA aptamer-based sensors and devices.", "Applications in drug screening and diagnostics.", "View requirements for NE 486", "Introduction to biosensors: fundamentals and applications.", "Biosensor structure", "Principle of operation", "Implementation methods", "Applications in drug screening and diagnostics", "Gain a broad view of biosensor designs", "Understand the general principles of operation", "Describe sensor performance", "Understand common implementation methods", "Be aware of current state-of-the-art biosensor technologies", "Design biosensors for example applications conceptually", "Introduction", "Biological components, Surface Chemistry, Modes of recognition & Theory", "Enzyme", "Optical", "Electrochemical", "Others"]}, {"course_id": 69, "course_code": "NE 487", "course_name": "NE487 - Microfluidic and Nanobiotechnological Systems (0.50)", "term_name": "List 1", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Microfluidic and Nanobiotechnological Systems Winter 2025", "04:00PM - 05:20PM QNC 2502", "Email: mahla.poudineh@uwaterloo.ca", "Principles, design, and fabrication methods for biomedical devices.", "Techniques for disease diagnosis, including enzyme-linked immunosorbent assays, current state-of-the-art technologies, lab-on-a-chip devices and biosensors.", "In this course, an introduction to the field of biosensors and an in-depth and quantitative view of device design and performance analysis will be given.", "Students will be introduced to different biosensing techniques, such as electrical biosensors and electrochemical biosensors with an emphasis on biomedical and environmental applications.", "Student will be familiarized with some of the conventional techniques used in the clinic for disease diagnosis such as ELISA (enzyme-linked immunosorbent assay) and then with the current state-of-the-art technologies and lab-on-a-chip devices and biosensors developed to simplify and improve molecular and cellular diagnostic approaches.", "Students will learn about microfluidic systems which have been developed rapidly in recent years and emerge as a powerful tool in the field of biomedical engineering.", "During first two weeks of the course, students will be briefly introduced to the basic molecular biology, such as DNA, RNA and protein and their role in biosensor.", "Additional background reading is supplied providing information on basic concepts in chemistry, thermodynamics and cell biology.", "Introduction to molecular biology", "Biosensor elements", "Calibration curves, the method of standard addition, and sensitivity", "They will learn about common methods of deriving the calibration curve and determining the limit of detection (LOD) and limit of quantification of biosensors (LOQ).", "Electrochemical biosensors", "Electrochemical biosensors are a class of electrical sensors and usually consist of three main electrodes: working electrode, reference electrode, and counter electrode.", "Enzyme-based biosensors, e.g., the blood glucose sensor", "Enzyme-based biosensors uses enzymes as the recognition elements and combines it with a transducer to produce a signal which is proportional to target analyte concentration.", "Students will learn about this class of biosensor, specifically via introduction of continuous glucose monitoring (CGM) devices as a well-known enzyme-based sensor.", "In this topic, students will be also introduced to the recent progress in the field of real-time monitoring.", "Microfluidic biosensors and devices", "• Introductory Bioelectronics: for Engineers and Physical Scientists, R. Pethig and S. Smith, Wiley, 2012, ISBN: 978-1119970873", "This course includes the independent development and practice of specific skills, such as writing.", "Library for research-based assignments"]}, {"course_id": 70, "course_code": "NE 488", "course_name": "NE488 - Biomaterials and Tissue Engineering (0.50)", "term_name": "List 1", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Biomaterials and Tissue Engineering Winter 2025", "Assistant Professor in the Department of Chemical Engineering and member of the Waterloo Institute for Nanotechnology", "The course provides an overview of the recent advances in medicine and nano-technologies for development of tissue engineering and regenerative medicine.", "Strategies and technologies for designing, testing, and manufacturing of biomaterials and tissue-engineering products will be introduced.", "The biological and clinical applications will be discussed.", "The unmet medical needs, challenges in manufacturing, regulatory approval and commercialization for tissue engineering applications will also be discussed.", "CHE 561: View requirements for CHE 561", "The course provides an overview of the recent advances in medicine and nano-technologies for development of tissue engineering and regenerative medicine.", "Strategies and technologies for designing, testing, and manufacturing of biomaterials and tissue-engineering products will be introduced.", "The biological and clinical applications will be discussed.", "The unmet medical needs, challenges in manufacturing, regulatory approval and commercialization for tissue engineering applications will also be discussed.", "Apply fundamentals of fabrication technology for tissue engineering applications", "Integrate fundamentals of materials science to solve biomedical unmet needs", "Understand the fundamentals of biocompatibility and physiology for tissue engineering applications", "Design tissue engineering solutions to solve health-care problems", "Communicate through reports and presentations", "-Introduction to tissue engineering", "-Scale in biological systems", "-Introduction biomaterials and nanotechnologies for biomedical engineering", "Biomaterials design and properties", "Drug and gene delivery", "-Key components of tissue engineering", "Biomaterials: engineering biological structures", "Protein interactions with biomaterials", "Molecular and cellular processes with living environment, blood-materials interaction, short and long term reactions to the body.Cell interactions with biomaterials", "Immune response and wound healing", "Growth factors, controlled release and gene delivery", "Cells and Stem cells", "Neural repair and regeneration", "Diabetes / bone tissue engineering", "Assessment of biomedical products", "Regulatory and commercialization", "Design project presentations", "Design project 40%", "Design project is to be done in groups of 3-4.", "Design Project Outline Friday, February 7 at 11:59 PM 10%", "Design Project peer and self-evaluations Friday, April 4, 11:59 PM 10%", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 71, "course_code": "NE 491", "course_name": "NE491 - Nanostructured Materials (0.50)", "term_name": "List 1", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 11:20AM DWE 3518", "Instructor: Prof. Aiping Yu", "Synthesis and processing techniques for inorganic nanomaterials and the devices that use them.", "Specific topics to be discussed include production methods and devices utilizing various zero, one, two- and three-dimensional inorganic nanomaterials.", "Understand general synthesis and fabrication techniques for nanostructured materials and their applications (1, 3) *.", "Qualitatively describe how the nano-sized dimension of nanostructured materials can affect their morphology, crystal structure, reactivity, and different properties (1, 2, 3, 4).", "Describe several synthesis methods for fabrication of zero-dimensional (nanoparticles, quantum dots), one-dimensional (nanotubes, nanorods, nanowires), and two-dimensional (graphene, M-Xene, thin films), and three-dimensional (zeolites, metal organic frames) nanostructures, and also could describe how these methods can be used for making nanostructures (1, 2, 3, 4).", "Use fundamental knowledge of surface chemistry, kinetics, and thermodynamics to perform surface energy calculations, particle size, size distribution, chemical composition of synthesized nanomaterials, and simple chemical calculations related to synthesis (1, 2, 3).", "Use the acquired knowledge to evaluate which synthesis methods that can be best suited for fabricating nanostructured materials of various inorganic compounds and constructions of these for specific applications (1, 2, 3, 4, 5).", "Learn new perspectives and approaches in synthesizing nanostructured materials' synthesis techniques and applications from guest lecturers invited from academia and industry (7, 8, 12).", "Consider the basic ethical, health-related and environment-related concerns encountered with respect to nanomaterials in general (4, 8, 9, 10).", "The numbers in parentheses in the abovementioned learning objectives refer to the graduate attributes that graduating students are expected to possess, defined by the Canadian Engineering Accreditation Board (CEAB).", "All parts of the topics may not be covered and not in order due to guest lecturer availability", "Benefits of 0D nanomaterials", "Synthesis methods for 0D nanomaterials", "Kinetically confined synthesis", "Epitaxial core-shell", "Select nanoparticles and their applications", "Carbon nanoparticles (carbon blacks, fullerenes, nano-onions)", "Benefits of 1D nanomaterials", "Synthesis methods for 1D nanomaterials", "Evaporation-condensation growth (Dissolution-condensation growth)", "Vapor-liquid-solid growth (Solution-liquid-solid growth)", "Stress-induced recrystallization", "Template-based synthesis", "Electrospinning", "Benefits of 2D nanomaterials", "Synthesis methods for 2D nanomaterials", "Exfoliation of layered materials", "Chemical vapor deposition", "Graphene-based materials – Transparent electrodes, membranes, field-effect transistors, supercapacitors, batteries, high strength fillers", "Benefits of 3D nanomaterials", "Synthesis methods for 3D nanomaterials", "It is a 20-min lecture for all the groups to educate the class and enrich our knowledge on these cutting-edge materials."]}, {"course_id": 72, "course_code": "NE 496", "course_name": "NE496 - Nanomaterials for Electrochemical Energy Systems (0.50)", "term_name": "List 1", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Nanomaterials for Electrochemical Energy Systems Winter 2025", "Nanomaterials in electrochemical energy systems, electrochemical reactions, and cell potentials.", "Electrode kinetics and mass transport.", "Design aspects of energy systems.", "Applications in hybrid and electric vehicles.", "Extend chemical thermodynamics to electrochemical systems.", "Use thermodynamics to predict when a reaction can happen and to describe the activation overpotential of electrokinetic processes.", "Design electrochemical cells and reactors for electrolysis and galvanic processes under given conditions.", "Design and assess corrosion mitigation strategy to extend the lifetime of materials/parts.", "cells, Faraday's law ,current efficiency and electrochemical CSTRs 5-7", "10   8 Current and next-generation battery technologies 19-20", "There final quiz will be during the examination period (April 8th to 25th)", "The most useful textbook in the context of learning fundamental electrochemistry is Bard & Faulkner, Electrochemical Methods: Fundamentals and Applications and also, Electrochemical Science and Technology by Oldham, Myland and Bond was used as a reference for part of the lecture material.", "IMPORTANT:   You cannot fail quiz component and still be given a passing mark in the course.", "Intellectual property includes items such as:", "Graduate Attribute Program Indicators", "A knowledge base for engineering: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "1a Demonstrate understanding of concepts in mathematics.", "1b Demonstrate understanding of concepts in natural science.", "1c Demonstrate understanding of engineering fundamentals.", "1d Demonstrate understanding of specialized engineering knowledge.", "2. Problem Analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "3a Create investigative studies of complex engineering problems.", "3b Gather information from relevant sources to address complex engineering problems.", "4. Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "4a Define design requirements and specifications for complex, open-ended engineering problems.", "4b Critically evaluate and compare design choices.", "7. Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "8a Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Impact of Engineering: An ability to analyze social and environmental aspects of engineering activities.", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "10a Identify ethical and unethical behavior in professional situations.", "10b Identify how an engineer is accountable to multiple stakeholders in engineering practice.", "Life-long Learning: An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge.", "12a Identify gaps in their knowledge, skills and abilities."]}, {"course_id": 73, "course_code": "AMATH 456", "course_name": "AMATH456 - Calculus of Variations (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["02:30PM - 03:20PM", "The solution of problems using variational methods - the Euler-Lagrange equations.", "Applications include an introduction to Hamilton's principle and optimal control.", "The solution of problems using variational methods - the Euler-", "Applications include an introduction to Hamilton's principle and optimal control.", "Calculus of variations, sometimes called variational calculus, is a powerful mathematical technique developed to solve the brachistochrone problem in the late 1600's that continues to be used today in fields as varied as robotics and theoretical physics.", "Briefly, calculus is extended to problems of finding stationary points of a cost where the cost depends on a families of functions.", "Master calculus on linear spaces", "Handle optimization problems with constraints", "Formulate a given problem in terms of Optimal Control", "Solve a Linear Quadratic Control problem", "- Optimization and Convexity in ℝ^n", "- Calculus on linear spaces", "- Euler–Lagrange Equations", "- Introduction to Optimal Control", "- Pontryagin’s Maximum Principle", "- Linear Quadratic Control"]}, {"course_id": 74, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}, {"course_id": 75, "course_code": "CHE 225", "course_name": "CHE225 - Strategies for Process Improvement and Product Development (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Strategies for Process Improvement and Product Development Fall 2024", "08:30AM - 10:20AM RCH 101", "02:30PM - 03:20PM", "RCH 307", "03:30PM - 04:20PM", "RCH 307", "Material includes regression analysis for linear and nonlinear models, analysis of variance, statistical inference, single and multiple comparisons, and an introduction to the design of experiments including single factor designs, multifactor designs, response surface methods, d-optimality (with empirical and mechanistic models), and the analysis of undesigned data.", "Applications to process improvement, product development, and research problems will be explored.", "Use of statistical analysis software to apply these techniques.", "CHE 225: View requirements for CHE 225", "CHE 425: View requirements for CHE 425", "The course will discuss the role of statistical design of experiments (and subsequent data analysis) for process/recipe improvement and product development (modeling, process troubleshooting and steps towards optimization).", "Estimate confidence and prediction intervals and construct ANOVA tables (variance decomposition) in both regression and design of experiments situations.", "Be fluent with advanced linear regression situations (correlation, prediction, analysis of residuals, model comparisons, model diagnostic checks); joint confidence regions to describe parameter uncertainty, design of experiments using D-optimality and other related optimal measures.", "Design single factor experiments: data analysis, multiple comparisons, comparison-wise vs experiment-wise error, with and without blocking of (lurking) stochastic variables.", "Design multifactor experiments: emphasis on 2-level full and fractional factorial designs, assessing significance of factor and factor interaction effects, confounding of effects, benefits of orthogonal designs, estimation of process error, selection of best design fraction, screening designs to generate process information.", "Weeks 1, 2 Review of confidence Intervals and hypothesis testing", "Week 3 Linear regression with matrix calculus; analysis of variance and analysis of residuals; emphasis on regression diagnostics Assignment 1 is due Sept. 18", "Design and analysis of single factor experiments", "Randomization; replication; multiple comparisons", "Design and analysis of single factor experiments with blocking", "Emphasis on blocking (variance reduction techniques); paired comparisons; multiple comparisons; special metrics", "Two-level full factorial experiments and related models", "Design and Analysis of Experiments (8th, 9th or 10th edition), Wiley optional No", "How to Succeed: The first step in doing well in this course is to realize that statistics is not a subfield of mathematics but is a distinct discipline.", "Statistics evolved from the need to systematically combine concepts from philosophy, the sciences, and mathematics in order to construct a coherent methodology for describing phenomena in the presence of random variation.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 76, "course_code": "CHE 425", "course_name": "CHE425 - Strategies for Process Improvement and Product Development (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Strategies for Process Improvement and Product Development Fall 2024", "08:30AM - 10:20AM RCH 101", "02:30PM - 03:20PM", "RCH 307", "03:30PM - 04:20PM", "RCH 307", "Material includes regression analysis for linear and nonlinear models, analysis of variance, statistical inference, single and multiple comparisons, and an introduction to the design of experiments including single factor designs, multifactor designs, response surface methods, d-optimality (with empirical and mechanistic models), and the analysis of undesigned data.", "Applications to process improvement, product development, and research problems will be explored.", "Use of statistical analysis software to apply these techniques.", "CHE 225: View requirements for CHE 225", "CHE 425: View requirements for CHE 425", "The course will discuss the role of statistical design of experiments (and subsequent data analysis) for process/recipe improvement and product development (modeling, process troubleshooting and steps towards optimization).", "Estimate confidence and prediction intervals and construct ANOVA tables (variance decomposition) in both regression and design of experiments situations.", "Be fluent with advanced linear regression situations (correlation, prediction, analysis of residuals, model comparisons, model diagnostic checks); joint confidence regions to describe parameter uncertainty, design of experiments using D-optimality and other related optimal measures.", "Design single factor experiments: data analysis, multiple comparisons, comparison-wise vs experiment-wise error, with and without blocking of (lurking) stochastic variables.", "Design multifactor experiments: emphasis on 2-level full and fractional factorial designs, assessing significance of factor and factor interaction effects, confounding of effects, benefits of orthogonal designs, estimation of process error, selection of best design fraction, screening designs to generate process information.", "Weeks 1, 2 Review of confidence Intervals and hypothesis testing", "Week 3 Linear regression with matrix calculus; analysis of variance and analysis of residuals; emphasis on regression diagnostics Assignment 1 is due Sept. 18", "Design and analysis of single factor experiments", "Randomization; replication; multiple comparisons", "Design and analysis of single factor experiments with blocking", "Emphasis on blocking (variance reduction techniques); paired comparisons; multiple comparisons; special metrics", "Two-level full factorial experiments and related models", "Design and Analysis of Experiments (8th, 9th or 10th edition), Wiley optional No", "How to Succeed: The first step in doing well in this course is to realize that statistics is not a subfield of mathematics but is a distinct discipline.", "Statistics evolved from the need to systematically combine concepts from philosophy, the sciences, and mathematics in order to construct a coherent methodology for describing phenomena in the presence of random variation.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 77, "course_code": "CIVE 204", "course_name": "CIVE204 - Solid Mechanics 1 (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 09:50AM DWE 1501", "08:30AM - 10:20AM DWE 1501", "Compound stress and stress transformations.", "Design concepts.", "View requirements for CIVE 204", "The Statics portion of the course mainly involves three-dimensional force system analysis and the Solid Mechanics course content is focused on examining material response (i.e., stress and strain conditions) in different sections/members under external loads.", "Specific topics include transverse shear, torsion of shafts, treatment of compound stresses, and the introduction of beam deflections and basic design concepts.", "The primary objective of this course is to provide students with conceptual knowledge to analyse simple structural systems and to evaluate the mechanical response of the structural components comprising these systems.", "Calculate distributions and magnitudes of stresses in elements subjected to shear, torsion, bending, and combinations thereof", "Construct axial force, shear force, and bending moment diagrams for beams and frame elements", "Determine deflected beam shapes and compute the magnitudes of deflections at key locations", "Design simple beams to satisfy strength and/or service criteria", "Section", "Study Problems", "Systems of Forces: 3-D", "2.5", "Cartesian Vectors", "Addition of Cartesian Vectors", "Position Vectors", "2.8", "Force Vector Directed Along a Line", "3.3", "Moment of a Force-Vector Formulation", "3.4", "Principle of Moments", "3.5", "Moment of a Force About a Specified Axis", "Equilibrium: 3-D", "4.5", "Free-Body Diagrams", "4.6", "Equations of Equilibrium", "Solid Mechanics:", "Section", "Study Problems", "Shear", "Shear in Straight Members", "The Shear Formula", "Shear Flow in Built-Up Members", "Statically Indeterminate Torque-Loaded Members", "Thin-walled closed sections", "Unsymmetric Bending", "Inelastic bending", "Deflection of Beams", "The Elastic Curve", "Method of Superposition", "Design Concepts", "Prismatic Beam Design", "There will be two in-person tests over the course of the semester, each worth 20 % of the course grade.", "Tests will be roughly 100-minutes long and will be written during the tutorial periods.", "A comprehensive in-person final examination will be scheduled by the Registrar.", "In-Class Example Problems:", "Success in this course requires an understanding of the concepts and practice solving problems.", "Example problems will be solved during the lectures and tutorials to support the concepts presented.", "Example problems will be worked during lecture periods to demonstrate concepts.", "A booklet of the in-class problems may be downloaded from Waterloo LEARN.", "Supplemental Study Problems:", "The study/practice problems are not to be handed in, but completion of the problems will be essential for developing understanding of the course material and for success on the tests and final examination.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 78, "course_code": "CIVE 230", "course_name": "CIVE230 - Engineering and Sustainable Development (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering and Sustainable Development Spring 2024", "10:00AM - 11:20AM RCH 301", "nadine.ibrahim@uwaterloo.ca", "nadine.ibrahim@uwaterloo.ca", "This course introduces the concept of sustainability and how it applies to decision-making in civil engineering.", "The course begins by defining sustainability, both practically and technically, and describing the concepts of systems, and systems interactions.", "Economic concepts and their applicability to sustainability are described for both developed and developing countries.", "Sustainability concepts covering the triple bottom line are presented, and their applicability to sustainability are described.", "First, the qualitative concepts and background information is presented.", "I’ll be teaching sustainable development and its connection to engineering using both a qualitative and quantitative understanding of sustainability.", "Qualitatively, this involves describing sustainability objectives, trends, current conditions and future projections, and to have a technical and public understanding of sustainability challenges.", "Quantitatively, this involves modeling environmental parameters using linear programming, differential equations, regression and extrapolation, and understanding the metrics used for sustainability assessments.", "I believe students have different strengths, where the diversity of coursework will leverage individual strengths and give everybody a chance to shine!", "I encourage you to read the announcements on a regular basis and stay up to date.", "IDENTIFY: Identify implications of human activities on the three dimensions of sustainability", "QUANTIFY: Quantify sustainability indicators to assess trade-offs", "DEMONSTRATE: Demonstrate course concepts to assess sustainability in global cities", "Relate course concepts to everyday activities and living experiences", "TBD", "Introduction to Engineering and the Environment.", "Introduction to Environmental Engineering and Science 3rd Edition, Prentice Hall.", "Some situations can warrant exceptions - speak to your instructor about these, and I’ll do my best to accommodate extenuating circumstances.", "Lecture topics will be presented in multiple formats to provide flexibility for different users and learning preferences.", "A knowledge survey on your thoughts and experiences with sustainability concepts and practices", "This will be open in the first and last weeks of term.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 79, "course_code": "CO 487", "course_name": "CO487 - Applied Cryptography (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Instructor: Samuel Jaques", "Email: sejaques@uwaterloo.ca", "Timothy Miller", "Nicolas Swanson", "A broad introduction to modern cryptography, highlighting the tools and techniques used to secure internet and messaging applications.", "It is one of the core technologies for securing the emerging information infrastructure.", "This course is a comprehensive introduction to modern cryptography that is aimed primarily at those interested in applications.", "In the area of public-key cryptography, topics will include an overview of specific systems (Diffie–Hellman, RSA, DSA, etc.) and a few advanced protocols.", "The security of these schemes and the use of public-key techniques for generating digital signatures will be described.", "Linear and differential cryptanalysis of ciphers.", "Define the main information security goals of confidentiality, integrity, authentication, and availability", "Explain the intended security properties of each cryptographic primitive and analyze relationships between security properties", "Explain mathematical techniques underlying standardized cryptographic algorithms", "Identify flaws in uses of cryptographic algorithms", "Determine which cryptographic algorithms can be used and combined to build systems with desired functionality and security", "Understand and contextualize the cryptography and security around them in daily life", "0 1 (Jan 6-8) Introduction", "Symmetric Encryption", "3.6 9 Elliptic Curve Cryptography 4 Yes", "4   Applications", "Understanding Cryptography: From Established Symmetric and Asymmetric Ciphers to Post-Quantum Algorithms, 2nd edition, Springer, 2024 Primary reference.", "A1: January 23", "A4: March 20", "This will be clearly indicated for each such question.", "In that case you are required to work independently.", "These questions will test your ability to identify the important concepts introduced in lectures, and your understanding of them.", "In particular:", "Please inform us of these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 80, "course_code": "ECE 222", "course_name": "ECE222 - Digital Computers (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Digital Computers Winter 2025", "08:30AM - 09:20AM E7 4043", "10:30AM - 11:20AM E7 4043", "02:30PM - 03:20PM", "E7 4043", "03:30PM - 04:20PM E7 4043", "03:30PM - 04:20PM E7 4043", "Julius Olajos <jnjolajos@uwaterloo.ca>", "The schedule below shows who covers each topic.", "Memory units, control units, I/O operations.", "Computer case studies.", "View requirements for ECE 222", "Number systems review", "RISC-V instruction set, addressing modes, subroutine linkage", "Memory-mapped I/O, polling, interrupts, DMA", "Design computer programs using RISC-V assembly language", "Understand and program input-output operations", "Describe the parts of a computer, the internal structure of a processor, and steps for instruction execution in a processor", "Develop control units for a simple processor", "Describe a basic pipelined processor’s operations and implications for performance", "Understand the memory hierarchy including the role and operation of main memory, cache memories, and virtual memory", "- classes and tutorials are cancelled during midterm week", "Computer Organization and Design RISC-V Edition: The Hardware Software Interface (2nd ed), Patterson and Hennessy, 2020.", "Computer Organization and Design RISC-V Edition: The Hardware Software Interface (2nd ed), Patterson and Hennessy, 2020 E-text: https://uwaterloo-store.vitalsource.com/products/computer-organization-and-design-risc-v-edition-david-a-patterson-john-l-v9780128245583 No $99.99", "Lab 3 - Input/Output Interfacing 25%", "They are used to reinforce lecture concepts and to aid in preparation for tests."]}, {"course_id": 81, "course_code": "ECE 224", "course_name": "ECE224 - Embedded Microprocessor Systems (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Embedded Microprocessor Systems Fall 2024", "ECE 224", "ECE 224 001", "Monday, Friday -", "E7 4043", "ECE 224 002", "Monday, Friday -", "08:30AM - 09:50AM E7 4043", "11:30AM - 12:20PM E7 4043", "Rabiul Islam r25islam@uwaterloo.ca", "Emon Sarkar esarkar@uwaterloo.ca", "View requirements for ECE 224", "Course introduction: In this course, you will explore the design of embedded systems and computer interfaces.", "How should data be organized?", "When should data be exchanged?", "What conditions must be satisfied to reliably exchange data?", "Identify system realities (such as noise, jitter, metastability, and transmission line effects) and select suitable approaches for managing these realities in an embedded computer system.", "Compare and critically assess design tradeoffs in an embedded computer system.", "Analyze the effects of synchronization mechanisms on the operational characteristics of an embedded computer system.", "Design hardware and software components to reliably connect devices to an embedded computer system.", "Course Introduction", "An introduction to the teaching team, course expectations, deliverables, marking scheme, and a very brief introduction to interfacing concepts.", "Embedded Systems", "A review of the fundamentals of embedded systems and the terminology associated with embedded systems.", "Interfacing Software, Device Drivers and Synchronization", "A review of embedded software design concepts, followed by a discussion of synchronization concepts and analysis.", "A detailed examination of the design and behavior of drivers for shared and transmission lines, including considerations of signal integrity.", "Buses and Interconnections", "A comparison of the functional behavior and timing behavior of synchronous, asynchronous, partially interlocked asynchronous, semi-synchronous, and split cycle bus systems.", "Arbitration", "A detailed examination of alternatives for interconnection arbitration including both centralized and distributed arbitration techniques.", "Parallel Interfacing", "This includes an examination of the role of the interface in matching bus timing and signaling characteristics with a device's timing and signaling characteristics.", "Serial Interfacing", "This includes a comparison of asynchronous communication techniques and synchronous techniques as well as the protocols for serial communication.", "Error Detection and Correction", "An introduction to error detection and error correction including a discussion of error types, differences in detection and correction, and one example of an error correcting code (the Hamming code).", "Analog Interfacing", "An introduction to digital-to-analog interfacing, analog-to-digital interfacing, and sample-and-hold circuitry.", "This includes a discussion of static and dynamic errors.", "Examples", "You may use these exams to assess your preparation for the exams in the course.", "Assessment Estimated Completion Time Completion Date", "Lab studies: Lab studies are to be completed in groups of two.", "Students then write C software using the Intel Nios II Software Build Tools to control their embedded system to achieve a specified design goal.", "Lab Study 0: This is an introductory lab study that examines the design of a system-on-a-programmable chip (SOPC) design.", "In this lab, students design, build, and test a 32-bit microprocessor system based on the Nios II processor core.", "The hardware design and the board support package serve as a starting point for both Lab Study 1 and Lab Study 2.", "In this lab study, students design a software system that uses pushbuttons, LEDs, 7-segment displays, timers, polling loops, and multiple interrupt handlers to conduct an experiment into servicing a device.", "In this lab study, students design a software system to read a pre-recorded audio file from an SD card, process the audio data, and play it back on a speaker using a DAC.", "Students are given broad latitude to design the system.", "When a lab study builds upon previous submissions, comments such as \"In the previous submission, concerns were expressed related to the number of sample points in the experiment.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm and those who support others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 82, "course_code": "ECE 250", "course_name": "ECE250 - Algorithms and Data Structures (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Algorithms and Data Structures Winter 2025", "ECE 250", "09:30AM - 10:20AM E7 4043", "11:30AM - 12:20PM E7 4043", "02:30PM - 03:20PM", "E7 4043", "E7 4043", "View requirements for ECE 250", "Design efficient algorithms and select appropriate data structures for specific tasks.", "Recognize problems suitable for different algorithm design paradigms such as divide and conquer, greedy algorithms and dynamic programming.", "Develop practical programming skills through hands-on implementation of data structures and algorithms in a programming language.", "Mar 10 Sorting Algorithms", "Mar 17 Introduction to Graphs, Graph Traversals", "Mar 24 Graph Algorithms", "Mar 31 Algorithm Design Paradigms", "Data Structures and Algorithm Analysis in C++, 4th Ed Optional No 64.99 (ebook)", "Introduction to Algorithms, 2nd Ed Optional No 92.99 (ebook)", "Laptop/Computer access to LEARN and other general learning materials Supplies and laptop recommendations | Engineering | University of Waterloo:https://uwaterloo.ca/engineering/undergraduate-students/supplies-and-laptop-recommendations No"]}, {"course_id": 83, "course_code": "ECE 252", "course_name": "ECE252 - Systems Programming and Concurrency (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Systems Programming and Concurrency Fall 2024", "ECE 252", "ECE 252 001", "Monday, Friday -", "11:30AM -", "E7 4043", "Monday, Friday -", "10:00AM - 11:20AM E7 4043", "M. Cooper-Stachowsky", "11:30AM - 12:20PM E7 4043", "ECE 252 101", "E7 4043", "ECE 252 102", "04:30PM - 05:20PM", "ECE 252 201", "08:30AM - 11:20AM E2 3346", "ECE 252 202", "ECE 252 204", "08:30AM - 11:20AM E2 3346", "Mike Cooper-Stachowsky (Section 2): Mike came to the university of Waterloo in 2014 where he worked in the first year office helping new students transition into university.", "He is particularly interested in operating systems and systems programming, and learned a lot by writing his own kernel for the x86.", "Manavjit Singh Dhindsa -- ms2dhind@uwaterloo.ca", "Sheikh Abrar Tahmid -- sa2tahmi@uwaterloo.ca", "ECE 252:", "Performance and correctness of concurrent systems.", "Deadlock detection and recovery; file systems.", "View requirements for ECE 252", "This course assumes you are comfortable programming in a low level programming language (likely C++ from your Algorithms and Data Structures course).", "Apply standard concurrency scenarios such as producer-consumer, readers-writers, dining philosophers, as well as deadlock and starvation.", "Interact with the Linux operating system through the command-line interface and the C language API.", "Use inter-process communication such as shared memory and message queues.", "Do you need a textbook?", "To request that a question be re-marked, you will need to submit your request in writing via e-mail to the instructor.", "Collaboration and Group Work.", "Please bring this situation to the attention of the course staff as soon as possible so that can be resolved quickly.", "However, each group must submit their own, independently-developed code for each lab.", "Similarly, each person must submit their own, independently-developed code for each assignment.", "I suggest you avoid looking at other people’s code entirely, but if you do, then you should not be doing that anywhere you might be writing your own code.", "The temptation to write your code just like what you see is simply too high.", "However, penalties may be more severe for repeat offenders (see below for information on Academic Integrity).", "All of the above applies to multiple instances — a student caught in several incidents of academic dishonesty will be subject to the above penalties for each of the incidents.", "Laptop and Device Policy: The human visual system has evolved to perceive saber-toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text-mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "Piazza is a great tool for collaboration and it allows rapid but asynchronous exchange of infor mation.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be difficult to interpret on a discussion forum.", "In either case, we will cancel all the in-person lectures and in-class exercises during the relevant period and try to have some online synchronous video lectures during that period.", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, Chat- GPT) and how such tools can be used to write and test code.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 84, "course_code": "ECE 260", "course_name": "ECE260 - Electromechanical Energy Conversion (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electromechanical Energy Conversion Fall 2024", "Monday, Friday -", "08:30AM - 09:50AM E7 4433", "E7 4043", "Role Name Room Email", "Power systems and their fundamental components and models.", "Introduction to the principles of electromechanical energy conversion, including transformers and rotating machines, in particular (direct current) dc, induction and synchronous machines.", "View requirements for ECE 260", "Understand the basic operating principles of transformers, DC and AC electric machines.", "Develop steady state models using their respective equivalent circuits for motors, transformers and generators.", "Understand how to evaluate the performance of motors in terms of their torque-speed characteristics, speed regulation, power losses, and efficiency.", "Select a suitable electric machine for a given application.", "Understand how to evaluate the performance of transformers and generators in terms of voltage regulation, power losses, and efficiency.", "Basics of Electric Circuits", "3. Three-phase AC circuits: General introduction, why and where three-phase AC is required, Circuit connections, Wye and Delta configurations, Phasor diagrams, Line/phase voltages and currents, Power in three-phase circuits", "4. Electromagnetism: Magnetic field concepts; Magnetic circuits; Laws of electromagnetism ⎯ Faraday’s Law and Lorentz Law, Hysteresis and Eddy currents.", "Fundamentals of Electricity and Magnetism", "4. Electromagnetism: Magnetic field concepts; Magnetic circuits; Laws of electromagnetism ⎯ Faraday’s Law and Lorentz Law,", "Energy Conversion and Transformers", "Speed - torque characteristics, motor starters, speed control and power flow diagrams.", "Transformers: Ideal transformers; Induced voltages and currents, practical transformers; open and short circuit tests; equivalent circuits, voltage regulation; efficiency; concepts of three-phase transformers.", "Induction Motors:", "Three-phase Induction Motors: Rotating magnetic field, slip and rotor speed, equivalent circuits and phasor diagrams, starting of induction motors, selection and application of three-phase induction motors, speed control and speed regulation.", "Single-phase and special motors: Revolving magnetic field theory of single-phase induction motors, staring of single-phase motors, their applications."]}, {"course_id": 85, "course_code": "ECON 371", "course_name": "ECON371 - Business Finance 1 (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECON 371", "ECON 371 001", "Office hours will be both in person and through MS Teams on a first-come-first-serve basis.", "Email: prajsic@uwaterloo.ca", "“ECON 371” must appear in the subject line and the message must include your full name and student ID number.", "The course develops both the conceptual framework and the tools required for these decisions.", "View requirements for ECON 371", "It describes major players and types of financial instruments in financial markets, and it offers the general framework of financial landscape.", "This course will describe the basics of how firms and individuals make investment decisions and how they finance their investments.", "The goal is to understand financial markets and investment strategies.", "The understanding of the most important financial problems leads to strategic planning and analytical understanding of possible solutions.", "Today’s financial decisions are critical for the successes of the businesses in the future.", "This course will help students develop skills applicable to financial decision-making processes within businesses as well as in their personal lives.", "understand the need for firms and individuals to make financial decisions and together work towards overcoming the universal problem of scarcity;", "appreciate the relevance of finance in a changing world;", "Explain why maximizing market value is the logical financial goal of the corporation", "Calculate and interpret some key measures of firm performance", "Interpret price-earnings ratios", "Calculate present and future values of streams of cash payments", "Define and understand the fundamental features and elements of stocks and bonds", "Use financial models to evaluate stocks and bonds", "Interpret the relationships between financial markets and information", "Perform interest rate conversions from APR to effective rates and vice versa", "Develop loan amortization schedules using loan terms", "Explain what a yield curve is and why short-term interest rates affect its shape", "Identify the cash flows properly attributable to a proposed new project", "Use sensitivity, scenario, and break-even analysis to evaluate the financial impact of forecasting errors", "Introduction to Business Finance:", "Corporate Finance and the Financial Manager", "Corporate Finance and the Financial Manager", "Introduction to Business Finance:", "Financial Statement Analysis", "Introduction to Business Finance:", "Financial Statement Analysis", "The Valuation Principle: The Foundation of Financial decision Making", "The Valuation Principle: The Foundation of Financial decision Making", "Bonds", "Bonds", "Fundamentals of Capital Budgeting", "Fundamentals of Capital Budgeting", "In that case, the quiz will be a mix of questions from all the chapters we covered so far.", "I will set constant weights for each student of 25% for the first midterm and 30% for the second midterm in Learn, but I will be adjusting those weights individually in my Excel sheet when calculating final grades at the end of the semester.", "The purpose of the review quizzes is to help students identify and understand key concepts covered in the lectures and in the textbook.", "Under the Training & Support tab, you will find helpful information including technical support.", "Midterms and Final Exam", "The format for midterms and the final exam will be a mix of multiple-choice questions, numerical calculation questions, and written problems.", "Missing a Midterm Due to Self-Isolation", "Please carefully read the Economics Department policy on deferred final exams for instructions.", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "Economics Department Deferred Final Exam Policy", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 86, "course_code": "KIN 255", "course_name": "KIN255 - Fundamentals of Neuroscience (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "KIN 255", "KIN 255 001", "08:30AM - 09:20AM", "KIN 255:", "An introduction to the principles of the nervous system control of movement, cognition, and learning.", "The course will introduce the basic structure and function of the nervous system as it relates to understanding the control of movement and behaviour.", "View requirements for KIN 255", "Define key terminology related to human neuroscience and neural control of movement.", "2. Explain fundamental concepts associated with control of movement from molecular, cellular, systems and behavioural levels.", "3. Explain fundamental relationships between sensory/cognitive processing and motor control in the typically functioning nervous system.", "4. Discuss key methods and approaches used in modern neuroscience to assess neural function and the brain-behaviour relationship.", "Week 1  (Sept 4-6) Introduction to the nervous system; Neuroanatomy", "Week 2 (Sept 9-13) Sensory systems - Receptors and Pathways", "No Class – Monday, October 7; Quiz 2 - October 9; Voluntary movements & motor programs", "On-campus exams end December 20, 2024", "Quizzes may consist of a combination of multiple choice, true/false, fill in-the-blank, matching and ordering questions.", "The midterm may consist of multiple choice, true/false, fill-in-the-blank, matching, ordering questions and written responses.", "The final may consist of multiple choice, true/false, fill-in-the-blank, matching, ordering questions and written responses.", "Notice of Recording", "In rare circumstances, it may be possible for students to attend lectures virtually to accommodate a specific request (e.g., prolonged self-isolation).", "Requests for virtual attendance will only be considered on a case-by-case basis and may not be granted if appropriate recording equipment is not available – ie the lecture hall does not have recording equipment available for us to stream lectures.", "The resource is intended as a contingency in case of a switch to remote learning.", "Please inform the instructor if you must miss multiple lectures due to self-isolation.", "You may experience stressors that can impact your personal well-being and academic experience, but there are multiple supports and resources available to you on and off-campus.", "Office of Indigenous Relations                      Office of Equity, Diversity, Inclusion and Anti-racism", "Only one short-term absence can be self-declared per academic term.", "Students can self-declare one Covid-19-related absence in an academic term.", "Academic Regulations and Accommodations", "Death of a family member: a copy of the death certificate, a copy of the obituary or a link to the online obituary.", "Co-op Interviews"]}, {"course_id": 87, "course_code": "KIN 340", "course_name": "KIN340 - Musculoskeletal Injuries in Sport and Activity (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Musculoskeletal Injuries in Sport and Activity Fall 2024", "KIN 340", "KIN 340 001", "I am a Clinical Instructor in the Department.", "I am a Certified Athletic Therapist and Strength and Conditioning Specialist for over 25 years working in a field setting with teams and in a clinical setting.", "I have been teaching in the Department for a long time on a part time basis while working in UW Athletics for 19 years as the Head Athletic Therapist.", "I have been in my current role as a full time clinical instructor for the past 5 years.", "I completed my Undergraduate Degree in Physical Education at the University of Western Ontario, a Diploma in Sports Injury Management- Athletic Therapy at Sheridan College and a Master of Exercise Science and Health Promotion Degree at California University of Pennsylvania, now Penn West University.", "I believe that the most impactful and memorable learning occurs via practical application of concepts in novel, diverse and real-world situations.", "If you do, please stop and say hello- unless I'm mid-rep!", "I have a yoga instructor wife and 2 university aged children-", "I know I look too young to have adult kids! 😂", "Please include KIN 340 question in the subject line of your email communications.", "Sadie Finch-sfinch@uwaterloo.ca", "KIN 340:", "View requirements for KIN 340", "Understand normal tissue mechanics and the inflammatory/healing process.", "Appreciate the basic principles of MSK assessment to the following body areas: Shoulder, arm, elbow, forearm, wrist, hand/fingers/thumb, hip, groin, pelvis, knee, lower leg, ankle/foot, cervical, thoracic, and lumbar spine", "Analyze case scenarios and synthesize the information provided to determine possible conditions presented", "Consider enrolling in KIN 351 to review these aspects.", "Evaluations", "Quiz 2- Shoulder-Elbow", "T spine", "Important Dates for Co-operative Education - https://uwaterloo.ca/co-operative-education/important-dates", "Specific chapters matching our content will be identified in class and in LEARN.", "Discussions", "Title : 180-DAY E-TEXT FOR PRINCIPLES OF ATHLETIC TRAINING 18TH ISE", "To order the access code and receive it instantly, please follow the first link below.", "*We are no longer offering in store shopping for textbooks.", "Copyright Information", "Respect the copyright of others and abide by all copyright notices and regulations when using the computing facilities provided for your course of study by the University of Waterloo.", "Evaluations", "These will be held during our lecture time so please make sure you have a device to complete the quiz on in LEARN.", "The term tests will be delivered in person synchronously during the lecture time.", "Official Grades", "There will be set dates/times for make-up tests.", "It is your responsibility to ensure that you have a reliable internet connection when completing the online quizzes.", "Manage and plan your own time", "Notice of Recording", "Wednesday - 4:30 p.m. - 7:30 p.m. for pre-booked appointments", "Only one short-term absence can be self-declared per academic term.", "Students can self-declare one Covid-19-related absence in an academic term.", "Co-op Interviews", "You can submit an Interview Conflict form by following these steps:", "Select the sub-category based on your current situation.", "Interview location accommodation required - interview at UW interview site other than my home campus (for Architectural Engineering and Architecture students)", "This course includes the independent development and practice of specific skills, such as manual techniques and testing and evaluations.", "Library for research-based assignments"]}, {"course_id": 88, "course_code": "ME 262", "course_name": "ME262 - Introduction to Microprocessors and Digital Logic (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "02:30PM - 03:20PM", "Number systems, logic gates, Boolean algebra.", "Karnaugh maps and combinational logic design.", "Sequential logic and state machines.", "Microcomputer structure and operation, I/O and interfacing.", "A calendar change to make the updates official is currently being processed:", "Number systems, logic gates, Boolean algebra.", "Karnaugh maps and combinational logic design.", "Sequential logic and state machines.", "Microcontroller I/O and interfacing.", "Use logic gates and common circuit blocks to build and analyze combinational logic circuits", "Explain different number systems and convert between bases, in particular decimal and binary and decimal and hexadecimal, which are commonly used in digital systems", "Manipulate and simplify circuits using Boolean algebra and Karnaugh maps", "Build control circuits using relays and basic electronic components", "Implement digital logic using industry grade tools such as Programmable Logic Controllers (PLC) and system simulations", "Develop and use state machines to implement and analyze sequential circuits", "9/4", "Introduction, Basic gates", "9/9", "Boolean algebra", "9/16", "Karnaugh maps, Number systems", "9/30", "Encoders and decoders, midterm review", "10/28", "Sequential logic", "Sensors and sensor technology", "Microcontrollers", "While a cell phone can be used, a device with a larger screen will give you a better experience.", "Exercises are not handed in; however, completion of these problems will allow you to regularly test and reinforce your comprehension of the concepts and analysis techniques presented throughout the term.", "In the case of an emergency, you must contact the instructor as soon as possible after the emergency has been dealt with.", "Can I reuse material from previous lab submissions?", "No, you must start with a blank page and redo the labs as though you are completing them for the first time.", "Exams", "The weight of the examination will not be changed", "**", "Notice of Recording", "In case of shutdown of in-person activities, the following arrangements will take place:", "Discussions and questions", "This course includes the independent development and practice of specific skills, such as using digital logic to solve problems and PLC implementations.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 89, "course_code": "MSE 240", "course_name": "MSE240 - Algorithms and Data Structures (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Algorithms and Data Structures Fall 2024", "11:30AM - 12:20PM", "Design and analysis of data structures and algorithms with an emphasis on further development of computer programming skills.", "Solutions to common engineering problems in computer science using algorithms and data structures.", "Introduction to mathematical analysis of space and time complexity with a focus on designing solutions that can scale to large input sizes.", "Implement both array-based and link/pointer based data structures [KB]", "Analyze algorithms and predict their ability to scale with increasing input sizes [PA]", "Design programs with appropriate data structures and algorithms that consider space/time/other trade-offs [", "] maps to Investigation", "PA] maps to Problem Analysis", "Des] maps to Design", "Week 10: Stacks and Queues", "Data Structures & Algorithms in Python, 1st edition.", "Grokking Algorithms Online version available at https://lib.uwaterloo.ca No", "All referenced work in reports and presentations must be appropriately cited, to include websites, as well as figures and graphs in presentations.", "Talking about problems with others and helping others debug their code can be a great way to learn material better and faster.", "Examples", "Copying even one line of source code.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 91, "course_code": "MTE 241", "course_name": "MTE241 - Introduction to Computer Structures and Real-Time Systems (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Computer Structures and Real-Time Systems Fall 2024", "08:30AM - 09:20AM E7 3343", "08:30AM - 10:20AM E7 3343", "M. Cooper-Stachowsky", "MTE 241 202", "M. Cooper-Stachowsky", "M. Cooper-Stachowsky", "11:30AM -", "12:20PM E7 3343", "All software and also the law and ethics course one time -- let's discuss contract law if you're up for it?", "Mike Cooper-Stachowsky -- mstachowsky@uwaterloo.ca", "Introduction to computer organization, basic real-time concepts, process management, interprocess communication and synchronization, memory management, resource management, interrupt handling, concurrent programming, file systems.", "View requirements for MTE 241", "Describe the basic components of a computer system [KB(I)]*", "Perform Memory-Mapped I/O [KB(D)]", "Program a real-time application with multiple coordinated tasks [Des(D),Tools(D)]", "STM32F401RE Nucleo Board A microcontroller board for the labs.", "A Practical Introduction to Real-Time Systems For Undergraduate Engineering It's the textbook, available free in PDF form: https://ece.uwaterloo.ca/~dwharder/icsrts/Lecture_materials/A_practical_introduction_to_real-time_systems_for_undergraduate_engineering.pdf No", "Available for free in PDF form: https://github.com/jzarnett/mte241/ Yes", "You should purchase this board well in advance of the first lab and install the STM32CubeIDE software to test that it works.", "A small number of lab computers will have the software installed for your use.", "You will use the STM32F401RE microcontroller board and the STM32CubeIDE to write a real-time operating system in the C language.", "The questions are designed to test your understanding of the concepts you should have learned in the lab.", "Exams are in-person, closed-book.", "This paper must be a standard letter size.", "Laptop and Device Policy: The human visual system has evolved to perceive saber-toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text-mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "In either case, we will cancel all the in-person lectures and in-class exercises during the relevant period and try to have some online synchronous video lectures during that period.", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, Chat- GPT) and how such tools can be used to write and test code.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 92, "course_code": "MTE 262", "course_name": "MTE262 - Introduction to Digital Logic (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Introduction to Digital Logic Winter 2025", "02:30PM - 03:20PM", "E7 3343", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "Number systems, logic gates, Boolean algebra.", "Karnaugh maps, and", "Implementation of combinational and sequential logic circuits on Field Programmable Gate Arrays (FPGA) boards.", "Sequential logic and state machines.", "Use logic gates and common circuit blocks to build and analyze combinational logic circuits", "Explain different number systems and convert between bases, in particular decimal and binary and decimal and hexadecimal, which are commonly used in digital systems", "Manipulate and simplify circuits using Boolean algebra and Karnaugh maps", "Implement digital logic using industry grade tools such as Field Programmable Gate Arrays (FPGAs), Programmable Logic Controllers (PLC) and system simulations", "Develop and use state machines to implement and analyze sequential circuits", "1 Introduction to Digital Logic", "3 Introduction to VHDL", "5 Boolean Algebra", "7 Number Systems", "9 Sequential Circuits", "W11 (Mar-25) PLC Introduction + Simulation", "While a cell phone can be used, a device with a larger screen will give you a better experience.", "The only exception to this rule is under extenuating circumstances, accommodations and submission of VIF (in case of illness).", "The only exception to this rule is under extenuating circumstances, accommodations and submission of VIF (in case of illness).", "There will be a total of 5 labs, where you will work in groups and will take place in-person in E7 – 3419.", "No extensions are allowed in submission of labs except under extenuating circumstances, accommodations and in case of approval of Verification of Illness.", "Exams", "**", "Do I have to do the labs again?", "Can I reuse material from previous lab submissions?", "No, you must start with a blank page and redo the labs as though you are completing them for the first time.", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as manipulating digital logic and programming devices such as PLCs.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 93, "course_code": "STAT 341", "course_name": "STAT341 - Computational Statistics and Data Analysis (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Computational Statistics and Data Analysis Winter 2025", "04:00PM - 05:20PM", "10:00AM - 11:20AM EIT 1015", "04:30PM - 05:20PM", "Megan French", "Daniel Zhang", "While personal matters can be communicated via email, Piazza should be the primary platform for Q&A outside of class.", "A computationally focused approach to statistical reasoning in the context of real data.", "Functional programming in R and algorithms will be used to define interesting attributes of finite populations and their sampling characteristics.", "Understand the fundamentals of population-based statistical analyses, as well as implicitly/explicitly defined population attributes", "Understand the basics of sampling and the underlying ideas/mechanisms of probability sampling and related issues", "Understand the basics of inductive inference including target and study populations, measurements, comparing subpopulations, random intervals and coverage probabilities, and resampling methods such as bootstrap", "Generate high-quality visualization and inferential statistics R output for the topics above", "Prepare reports that communicate your statistical analyses using LaTeX and R Markdown.", "Jan. 6 Introduction to the course", "location and scale invariance/equivariance", "Power transformations and linear relationships", "Implicitly defined Attributes", "Solving system of equations Assignment #1", "Iteratively re-weighted least-squares", "Sampling mechanisms and inclusion probabilities", "Sampling design", "9. Mar. 3 Anatomy of tests of significance", "A t-like discrepancy measure  Assignment #2", "Mar. 10 Multiple testing", "Student-t-based intervals", "Mar. 17  Introduction to resampling methods", "Bootstrap in regression", "Multiple samples and prediction", "Decomposition of APSE, bias-variance trade-off", "Training and Test sets", "K-fold cross validation Assignment #3", "Each folder will contain five files, e.g. for section 2.1-", "There will be a 2.5-hour, closed book, cumulative final exam during the Final Examination Period: April 9 – April 25.", "An INC grade is rarely granted and will be considered on a case-by-case basis, with decisions based largely on your performance throughout the semester.", "Self-Declared COVID-19 Related Absences: You may self-declare one absence per term during the formal lecture period for influenza-like illnesses.", "Course Software: R is a language and a free statistical computing and graphics software that we will use extensively throughout the course.", "The only time you may run into trouble is if you call a function from a package to handle a task you have been asked to code out explicitly.", "For example, if you are asked to code a function that calculates the mean of a vector in R, and your solution is to just call the function mean(), then you will not receive any marks.", "Communication: When you email your instructor, make sure you include the following information in your email:", "Including non-English characters in your email (sometimes imposed by installing a non-English operating system) prompts UW servers to spam your emails for the instructor.", "These characters most often appear in (not exclusively) the subject line, From, To, and Date/Time portions of previous communications if you reply to an email.", "You must use the web-based email platform if you suspect that you have non-English characters in your emails imposed by your computer, phone, tablet, etc.", "This course includes the independent development and practice of specific skills related to computational statistics and data analysis.", "Phone: 519-884-0000 extension 213"]}, {"course_id": 94, "course_code": "SYDE 223", "course_name": "SYDE223 - Data Structures and Algorithms (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Data Structures and Algorithms Spring 2024", "03:30PM - 04:20PM", "03:30PM - 05:20PM", "Email: shi.cao@uwaterloo.ca", "Seyed Mohammad Amin Mirjalili <smamirja@uwaterloo.ca>, Online MS Teams communication and Q&A.", "Algorithms and Data Structures emphasizes the following topics: structured software design, data structures, abstract data types, recursive algorithms, algorithm analysis and design, sorting and searching, hashing, problem-solving strategies and NP-completeness.", "Prereq: Level at least 1B Systems Design Engineering or Computer Engineering Option.", "This course covers the fundamentals of computer programming concepts and methods, including the following topics: data structures, abstract data types, recursive algorithms, algorithm analysis and design, sorting, searching, hashing, and problem-solving strategies.", "These concepts and methods are used ubiquitously in software programming.", "Knowledge and skills learned in this course will allow students to develop basic computer programs and build the foundation for learning more advanced programming courses.", "As computer programming is involved in almost all engineering projects and scientific research, data structures and algorithms are becoming essential and even mandatory for engineers and researchers.", "The course also increases students' interest in programming and prepares them for their co-op and future career.", "Students will learn to analyze, implement, and use various data structures and data-management techniques in a variety of applications.", "This includes:", "Performing rigorous complexity analyses of simple algorithms and data structures (2c)", "Comparing different data-structuring techniques from the point of view of time and memory requirements (4c)", "Determining a suitable data structure to solve a specific algorithmic problem (4b)", "Implementing data structures correctly and efficiently in a high-level programming language, such as C/C++ (4b, 5c).", "2c: Critically evaluate solutions of engineering problems", "4b: Generate and refine potential solutions to complex, open-ended design problems", "4c: Critically evaluate and compare design choices", "Topics and Deliverable", "Introduction and Review of Programming Fundamentals", "Pointers and Dynamic Memory Allocation", "Algorithmic Analysis", "Stacks and Queues", "E5 6004 and E5 6006", "Sorting", "Platform and Software Usage", "Learn Slides and other learning materials", "Students should use original variable names and comment their code thoroughly with explanation to demonstrate originality.", "Students should save copies of their work on their computers and online file systems as backup in case of any problem.", "Closed-book exams are used to test students’ understanding of the basic knowledge learned in this course and the abilities/skills to apply the knowledge to problem solving and engineering analysis.", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows UW’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "This course includes the independent development and practice of specific skills, such as computer programming.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 95, "course_code": "BIOL 487", "course_name": "BIOL487 - Computational Neuroscience (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["SYDE 552 / BIOL 487 - Computational Neuroscience Winter 2025", "04:30PM - 05:20PM E7 4417", "04:30PM - 05:20PM E7 4417", "Instructors Email Meeting Times", "TA Email Meeting Times", "Introduction to modelling and analysis of neurophysiological systems.", "Prerequisites: At least 3B Systems Design Engineering OR at least 3B in the Faculty of Science and one of CS (115, 135, 200) and a 200-level STAT course.", "Course Objectives: There are far more topics in computational neuroscience than can be covered in a single course.", "Throughout the course, we will emphasize the relationship between computational models and biological structure.", "Simulate and manipulate a variety of neuron models, from LIF to Hodgkin-Huxley", "Describe the organization of the primate visual system and compare it to convolutional networks", "Describe the organization of the hippocampus and its role in cognition", "Describe the organization of the basal ganglia and compare it to modern reinforcement learning techniques", "It should be noted that the last hour of the Wednesday session is meant to be a Tutorial, which will be run mostly as a free-form discussion about the topics brought up in the course materials", "Introduction", "Neuron Models", "3. Simple Neuron Models", "Synapses", "Perceptrons and Regression", "Intermediate and High-level Visual Processing", "Backpropagation and Convolutional Neural Networks", "Role in Cognition", "Modelling memory", "Modelling spatial navigation", "Role in Cognition", "Models of BG - Functional", "Models of BG - Anatomical", "Ongoing Research Topics", "• Biophysics of Drugs and Disorders (?)", "MIT Press https://www.deeplearningbook.org/", "Late work may be submitted via email for reduced credit."]}, {"course_id": 96, "course_code": "BME 384", "course_name": "BME384 - Biomedical Transport: Biofluids and Mass Transfer (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Biomedical Transport: Biofluids and Mass Transfer Fall 2024", "10:00AM - 11:20AM E5 6006", "E. Boghaert", "11:30AM - 12:20PM", "E. Boghaert", "Eline Boghaert (eline.boghaert@uwaterloo.ca)", "Fundamental concepts in systems involving fluid flow.", "Basic treatment of statics, kinematics, and dynamics of fluids.", "Mass transfer, conservation of mass, momentum and energy for a control volume.", "Discussion of flow in pipes and channels and brief introduction to boundary layers, lift and drag, ideal and compressible flow will be specifically covered in the context of the cardiovascular system (macrocirculation and microcirculation).", "View requirements for BME 384", "Apply fundamental concepts to calculate key variables (force/pressure/surface tension) in fluid statics problems.", "3. Determine the velocity profile and shear-stress profile of a fluid by applying a differential mass and momentum balance.", "5. Determine dimensionless parameters and complete scaling analysis for a given problem.", "Apply the integral form of the conservation of mass, Newton’s 2nd law of motion and the conservation of energy equation to a control volume to determine quantities of interest in fluid dynamics (average velocity, pressure drop, etc.).", "Develop and solve one-dimensional steady-state mass transfer models.", "Textbook References", "1 Introduction to Transport & Fundamental Concepts [", "1] W 2.1 - 2.3 & 1.6, T 2.4", "3 1D Mass and Momentum Balances on a Differential Fluid Element [", "5 Navier-Stokes Equations [", "6 Dimensional Analysis and Similitude [", "9 Conservation of Energy [", "11 Pressure Drop due to Friction in Closed Conduits", "12 Introduction to Mass Transfer [", "5th & 6th edition are very similar.", "Truskey, Yuan & Katz (2009) Transport Phenomena in Biological Systems, 2nd Edition, Pearson Prentice Hall On reserve at the Davis Centre Library.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 97, "course_code": "BME 386", "course_name": "BME386 - The Physics of Medical Imaging (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["The Physics of Medical Imaging Fall 2024", "10:00AM - 11:50AM E5 6006", "09:30AM - 10:20AM E5 6006", "08:30AM - 09:20AM", "Email: phajireza@uwaterloo.ca | Office: E7-6416", "2- TBD", "The fundamental laws of electricity, magnetism, and optics will be taught through the introduction to basic concepts of medical imaging: radiation for imaging, x-ray, computed tomography (CT), magnetic resonance imaging (MRI), ultrasound or sonography imaging, electric impedance tomography, confocal microscopy, fluoroscopy.", "Understand and describe the fundamental laws of electricity, magnetism, and optics (1c)", "Understand and describe the fundamental laws of light-matter interactions (1b,c)", "Describe the physical mechanisms governing X-ray, MRI, ultrasound and optical imaging techniques (1c,d)", "Apply fundamental physics concepts to the general design of imaging systems (1b,c, 2)", "Randall D. Knight: Physics for Scientists and Engineers: A Strategic Approach with Modern Physics (4th Edition).", "Please make sure no inappropriate comments will be shared during the lectures.", "A student who is found to be disruptive during lectures will be given only one verbal warning for the term.", "This course includes the independent development and practice of specific skills.", "• Library for research-based assignments", "Compassionate Accommodation:", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Compassionate and respectful communication:", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 98, "course_code": "BME 393", "course_name": "BME393 - Digital Systems (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Digital Systems Winter 2025", "11:00AM - 12:20PM E7 4417", "omar.alburaiki@uwaterloo.ca", "Email omar.alburaiki@uwaterloo.ca", "Topics will be reinforced in the context of biomedical microcontrollers and sensors used in physiological monitoring and clinical support systems.", "Topics will be reinforced in the context of biomedical microcontrollers and sensors used in physiological monitoring and clinical support systems.", "Analyze internal components of digital systems and their technical details", "2. Explain the importance of digital systems and computer architecture for biomedical applications", "4. Use biomedical controllers and sensors to design digital systems", "5. Design digital systems that are reliable (observed behavior matches specifications), safe (avoid putting human lives in danger even in presence of errors and failures), and robust (ability to handle unspecified inputs and state)", "Week6# Sequential Circuits and Sequential Logic Design", "Week7# More on Sequential Circuits and Sequential Logic Design", "Week8# Microcontroller Architecture and Interfacing, Timers/Counters", "Week10# Microprocessor Architecture, Datapath Design", "Week12# Microprocessor Pipelined Design", "Week13# More on Microprocessor Pipelined Design", "Harris and Harris: “Digital Design and Computer Architecture”.", "Each of these assignments may include analytical, numerical (using Falstad) and explanatory components exploring fundamental aspects of the material covered in the course."]}, {"course_id": 99, "course_code": "BME 544", "course_name": "BME544 - Biomedical Measurement and Signal Processing (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Biomedical Measurement and Signal Processing Winter 2025", "Signal processing techniques will be discussed in the context of extraction and application of useful biomedical signals.", "(3) Understand and apply digital signal processing concepts and techniques to biomedical signals", "(4) Develop a signal processing system to reliably extract features from biomedical signals for a particular application and justify the approaches/choices made", "1 Knowledge Base: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "4b Critically evaluate and compare design choices 4", "17-Jan Power Spectra and Spectrograms 3", "31-Jan Sampling in Embedded Systems 2", "14-Feb Correlation Analysis 2,3", "24-Feb Parametric Signal Processing 3", "28-Feb Speech Processing and Applications 2,3", "07-Mar Electrodes and coupling to the environment 2", "21-Mar Brain Anatomy and EEG 1", "24-Mar EEG Processing 2,3", "Biomedical Signal Analysis, 3rd Edition.", "A total of 6 assignments will be given during the term.", "Data Collection", "One is for students to gain experience in recording measurements of different biomedical signals.", "The second is to provide a set of recordings for students to use to test and evaluate signal processing approaches.", "It is anticipated the four sets of data collection will be conducted during the term.", "The project is an individual Students will identify an application involving a biomedical signal.", "Based on the application, they will develop and evaluate a signal processing system to reliably extract features from biomedical signals for that application and justify the approaches/choices made.", "Notice of Recording", "Course and Departmental expectations", "Compassionate and respectful communication", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "SYDE-BME Compassionate Accommodation", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 102, "course_code": "CHE 314", "course_name": "CHE314 - Chemical Reaction Engineering (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["CHE 314", "CHE 314 001", "03:30PM - 05:20PM", "03:30PM - 04:20PM", "CHE 314 101", "04:30PM - 05:20PM", "Multiple reactions in reactor networks.", "View requirements for CHE 314", "This course applies the concepts of reaction stoichiometry and rate laws combined with the concepts of mass and energy balances to the analysis of chemical reactors.", "This includes derivation of rate expressions and design of chemical reactors via synthesis of chemical kinetics with mass and energy balances.", "Demonstrate competence in the fundamental concepts of Chemical Reaction Engineering.", "Apply these concepts to design and analysis of basic isothermal and non-isothermal reactors.", "Design and analyze chemical reactors under steady state and transient operation.", "Week 1: Introduction, Basic Principles & Reaction Kinetics", "Course structure, basic principles, rate laws, and catalytic reactions", "Week 2: Ideal Reactors & Multiple Reactors", "Week 3: Stoichiometry & Isothermal Reactor Design", "Rate expressions in terms of conversion.", "Week 4: Pressure drop & Transient Reactor Design", "Batch reactor & CSTR startup.", "Week 5: Non-Isothermal Reactor Design", "General energy balance.", "Week 6: Non-Adiabatic Reactor Design", "Boundary layer diffusion & external resistance.", "Literature survey, reactor design, and model definition", "Numerical solution & parameter sensitivity analysis.", "Final report preparation & submission", "Deadlines & Examination Dates:"]}, {"course_id": 103, "course_code": "CHE 331", "course_name": "CHE331 - Electrochemical Engineering (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electrochemical Engineering Winter 2025", "CHE 331", "01:30PM - 03:20PM", "CHE 331 101", "Topics and applications of electrochemistry and electrochemical engineering.", "Thermodynamic and kinetic aspects of corrosion.", "Electrochemical energy conversion and storage.", "View requirements for CHE 331", "Extend chemical thermodynamics to electrochemical systems.", "Use thermodynamics to predict when a reaction can happen and to describe the activation overpotential of electrokinetic processes.", "Design electrochemical cells and reactors for electrolysis and galvanic processes under given conditions.", "Design and assess corrosion mitigation strategy to extend the lifetime of materials/parts.", "cells, Faraday's law ,current efficiency and electrochemical CSTRs 5-7", "10   8 Current and next-generation battery technologies 19-20", "There final quiz will be during the examination period (April 8th to 25th)", "The most useful textbook in the context of learning fundamental electrochemistry is Bard & Faulkner, Electrochemical Methods: Fundamentals and Applications and also, Electrochemical Science and Technology by Oldham, Myland and Bond was used as a reference for part of the lecture material.", "IMPORTANT:   You cannot fail quiz component and still be given a passing mark in the course.", "Intellectual property includes items such as:", "Graduate Attribute Program Indicators", "A knowledge base for engineering: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "1a Demonstrate understanding of concepts in mathematics.", "1b Demonstrate understanding of concepts in natural science.", "1c Demonstrate understanding of engineering fundamentals.", "1d Demonstrate understanding of specialized engineering knowledge.", "2. Problem Analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "3a Create investigative studies of complex engineering problems.", "3b Gather information from relevant sources to address complex engineering problems.", "4. Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "4a Define design requirements and specifications for complex, open-ended engineering problems.", "4b Critically evaluate and compare design choices.", "7. Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "8a Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Impact of Engineering: An ability to analyze social and environmental aspects of engineering activities.", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "10a Identify ethical and unethical behavior in professional situations.", "10b Identify how an engineer is accountable to multiple stakeholders in engineering practice.", "Life-long Learning: An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge.", "12a Identify gaps in their knowledge, skills and abilities."]}, {"course_id": 104, "course_code": "CHE 361", "course_name": "CHE361 - Bioprocess Engineering (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["03:30PM - 05:20PM", "03:30PM - 04:20PM", "04:30PM - 05:20PM", "Introduction of biological systems for the production of commercial goods and services, e.g., foods, pharmaceuticals, chemicals, fuels, diagnostics, waste treatment, and biomaterials.", "Introduction to design of bioprocess systems, including biosafety and sustainability.", "Development of reaction kinetics associated with biological systems.", "Development of material balances for key constituents in bioreactors operated in different modes, e.g., batch, fed-batch, continuous stirred-tank reactor (CSTR), perfusion, recycle.", "Introduction to mass and heat transfer considerations for bioreactors.", "Dynamic simulation of cultures defined by ordinary differential equations.", "Introduction of downstream processes associated with biological systems and recovery of biological products.", "View requirements for CHE 361", "Understand enzyme kinetics and derive enzyme kinetic equations based on associated biological information", "Model bioreactor for enzymatic reactions", "Understand how cells replicate with bioproduct formation", "Model bioreactor for cell cultivation and bioproduct formation", "Demonstrate competence in the fundamental concepts of biological sciences and biochemical/bioprocess engineering, including biomolecules, biocatalysts, metabolic pathways, enzyme functions/kinetics, cell behaviors and growth kinetics, bioreactor systems for enzymatic reactions and cell cultivation.", "Apply biological and chemical engineering concepts to design and analysis of bioreactor systems, including mass balance, bioreactor types, bioreactor configurations, bioreactor operation, bioreactor control, bioreactor modeling, bioreactor optimization etc. (2a; 2b; 2c; 4a; 5a; 11b)", "•Week 1: Bioprocess introduction and biological background review", "•Week 2: Enzyme kinetics introduction", "•Week 3: Enzyme kinetics modeling", "•Week 4: Bioreactor modeling for enzymatic reaction", "•Week 6: Enzyme inhibition kinetics", "•Week 7: Enzyme inhibition kinetics (continued) and other enzyme kinetics", "•Week 8: Cell growth biology and cell cultivation", "•Week 9: Cell growth kinetics", "•Week 10: Bioreactor (batch) modeling for cell cultivation and bioproduction", "•Week 11: Bioreactor (CSTR) modeling for cell cultivation and bioproduction", "•Week 12: Stoichiometric modeling of cell cultivation and bioproduction", "Bioprocess Engineering (Basic Concepts) No 173.59"]}, {"course_id": 105, "course_code": "CHE 480", "course_name": "CHE480 - Process Analysis and Design (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Process Analysis and Design Fall 2024", "CHE 480", "10:30AM - 12:20PM MC 4020", "peter.angelo@uwaterloo.ca", "peter.angelo@uwaterloo.ca", "CHE 480 102", "10:30AM - 12:20PM E2 1792", "peter.angelo@uwaterloo.ca", "Sogol Shaghaghi Afzali", "Development and analysis of process flowsheets and chemical product design.", "Design and selection of common process equipment such as heat exchangers, pumps, piping, staged separations.", "Incorporation of pollution prevention and inherently safer design principles.", "Equipment and project cost estimation.", "View requirements for CHE 480", "Interpret and create common chemical engineering flowsheets, including process flow diagrams (PFDs) and piping and instrumentation diagrams (P&IDs)", "Select process units and instrumentation according to design, safety, and economic specifications and constraints [", "Identify suitable build configurations, materials, sizes, of key pieces of equipment to meet physical and chemical requirements of a process [1d, 3b, 8b, 10b, 11b]", "Justify design choices in process units and instrumentation using design equations, heuristics, industry standards/regulations, and engineering judgement [1c, 4b, 4c, 5a]", "Prioritize safety risks and evaluate reasonable mitigation strategies using structured frameworks, such as HAZOP [", "Introduction to Process Design", "Piping and instrumentation diagrams", "Process control basics", "Piping and Instrumentation", "Pipe materials and sizing conventions", "Pump types and components", "Compressor sizing and peripheral instrumentation", "Heat Exchangers", "Types of heat exchangers", "Internals and materials of construction", "Networks and integration", "Vessels and Reactors", "Vessel types and features", "Column body and internal design", "Fault and failure analysis", "Economics", "Capital costs", "Operating costs", "Towler, G.; Sinnott, R. Chemical Engineering Design: Principles, Practice and Economics of Plant and Process Design.", "Assignment 3 (Reactor and Separator Design)", "Students are welcomed and encouraged to complete any additional modules as well for their own professional development."]}, {"course_id": 106, "course_code": "CHE 514", "course_name": "CHE514 - Fundamentals of Petroleum Production (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["09:00AM - 10:20AM E6 4022", "Darcy's law and modelling of steady-state and transient incompressible and compressible single-phase flow through porous media.", "Introduction to enhanced oil recovery.", "View requirements for CHE 514", "Understand fundamental concepts of multiphase flow in porous media relevant to petroleum production.", "1 Introduction to Petroleum Engineering", "4 Basic Concepts in Reservoir Engineering HA#1", "5 PVT Analysis for Oil", "8 Description of Fluid Flow in Oil Reservoirs", "10 Fundamentals of Oilwell Testing - Presentation Checkpoint", "11 Multiphase Flow of Immiscible Fluids in Oil Reservoirs", "12 Multiphase Flow of Immiscible Fluids in Oil Reservoirs HA#4", "I will be looking for the following:", "• Clear exposition of intermediate steps in calculations and derivations", "What was right and what wrong in your solution and why?", "Does it make sense to you?", "Quiz: The quiz is a summative test of your understanding of fundamental concepts and is not calculation heavy.", "Case Study: This is a term-long individual project that integrates knowledge from all modules to demonstrate competencies in well-log interpretation, reserves estimation, reservoir fluid characterization, primary production and oil well testing.", "Presentation: In this term-long individual project, you will prepare and deliver a presentation on a reservoir engineering topic chosen from a list provided.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 107, "course_code": "CHE 516", "course_name": "CHE516 - Energy Systems Engineering (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Energy Systems Engineering Winter 2025", "peter.angelo@uwaterloo.ca", "11:30AM -", "Energy systems in society.", "Transportation fuels and alternative fuels; the design of hybrid power trains, fuel cells and batteries.", "Design considerations of carbon-free energy generation and carbon-neutral technologies, including nuclear, wind, solar and bio-energy.", "Design of energy storage on a 'utility scale' and portable power sources.", "Applications of thermodynamics in the design of energy systems, including the Rankin and Brayton cycles.", "Other energy system topics as appropriate.", "View requirements for CHE 516", "Define the common thermodynamic cycles behind energy generation methods, comparing ideal conditions to practical conditions.", "Describe the extraction, processing, and delivery processes for common fuels and their associated energy sources.", "Differentiate between energy sources by their comparative practical and economic advantages and limitations.", "Identify sociopolitical and socioeconomic concerns associated with existing and emerging energy generation methods.", "Systems and Cycles", "Energy definitions and terminology", "Carnot, Otto, and Diesel cycles", "Energy Supply Systems", "Battery, capacitor, and hydrogen storage", "Turbine and generator design principles", "Electrical and piping distribution networks", "Carbon-Based Energy", "Coal, oil and gas usage and reserves", "Extraction and processing methods", "Nuclear Energy", "Review of nuclear chemistry, fission, and fusion", "Transitioning to renewable energy systems", "Debate (Nuclear Energy Expansion) 15%", "Design Project 2 (Hybrid Renewable Facility) 25%", "Design Project 1 Friday, February 7", "Debate", "In person", "Design Project 2 Friday, March 28", "Pitch Meeting", "In person", "Design Projects", "Design Projects comprise a summary report of a process, product, or facility that students will design based on the previous Module.", "Each project will require submission of a report containing sections specified by an appropriate rubric.", "In the case of Design Project 2, each group member will be responsible for specific sections of the report and presentation as specified in its rubric, and will be graded individually on those sections.", "The Case Study involves the examination of an operating process and its contextualization within the broader socioeconomic environment.", "Debate", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 108, "course_code": "CHE 521", "course_name": "CHE521 - Process Optimization (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Process Optimization Fall 2024", "Email: pulsipher@uwaterloo.ca", "An introduction to chemical process optimization.", "Model development and classification of optimization problems.", "Linear programming techniques, simplex algorithm, goal programming and barrier method, parametric sensitivity analysis and duality theory.", "Convex optimization, necessary and sufficient conditions for optimality for unconstrained and constrained problems.", "Applications include optimization of heat exchanger networks, multistage separation processes, batch operations, process scheduling and chemical reactor networks.", "View requirements for CHE 521", "Formulate well-posed optimization models given a problem statement [", "Classify optimization problems based on the optimization modelling features [", "Formulate and solve linear programming (LP) problems using conventional linear optimization techniques such as graphical and simplex methods [", "Understand the basic concepts in duality theory for linear and nonlinear programming (NLP)", "Understand the importance of convexity in optimization and classify the convexity of simple feasible regions [", "Derive and understand optimality conditions for LPs and NLPs", "Understand the basic concepts behind barrier methods to solve linear and nonlinear programs [", "Formulate and solve simple convex mixed-integer programming (MIP) problems using conventional algorithms, e.g., branch-and-bound [", "Formulate simple trajectory (e.g., ODE-constrained) optimization problems [", "Use optimization software to solve LP, NLP, MIP, and trajectory optimization problems that emerge in chemical engineering applications [", "Introduction to Process Optimization", "Optimization in chemical engineering", "Classification of optimization problems", "Development of well-posed optimization models", "Linear Programming", "Standard form and modelling", "Graphical method", "Duality theory & sensitivity analysis", "Optimality Conditions and Characterization", "Necessary and sufficient conditions for optimality", "Nonlinear Programming", "Standard form and modelling", "Duality theory", "Mixed-Integer Programming", "Introduction to convex mixed-integer optimization", "Branch-and-bound method", "Trajectory Optimization", "Modelling ODE-constrained optimization problems (e.g., optimal control)", "Direct transcription approach", "iClicker Account Free of charge for the 2024/2025 school year Yes", "Grossmann, I., Advanced Optimization for Process Systems Engineering, Cambridge: Cambridge University Press, 2021 Suggested Reference No", "Winston, W., Operations Research: Applications and Algorithms, Thomson, Fourth Edition, 2004 Suggested Reference No", "iClicker Account", "APMonitor design optimization course", "Julia-centric optimization textbook", "Introduction to optimization course notes (note that the code snippets are out-of-date)", "Optimization education resource list", "During each class live polling questions administered via iClicker will be integrated into the lecture material.", "Exams", "This course includes the independent development and practice of specific skills for modelling and solving mathematical programming problems.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 109, "course_code": "CHE 543", "course_name": "CHE543 - Polymer Production: Polymer Reaction Engineering (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["E5 3102", "For in-person meetings: Please set up via e-mail message", "Overview of polymer production technology and polymer reaction engineering analysis tools.", "Calculations and mathematical models for rate, copolymer composition, molecular weight and sequence length characteristics, for polymer reactor design/optimization of polymer productivity and quality variables.", "View requirements for CHE 543", "Be fluent with Polymer Reaction Engineering (PRE) tools (mathematical modelling and reaction engineering tools for understanding/designing/troubleshooting/optimizing polymerization reactors, and for controlling polymer product properties); optimization and control strategies in order to deliver desirable properties for final applications (3b, 3c, 4c, 4c, 5b, 5c)", "Understand basic polymer characterization or sensing techniques to monitor polymer properties; bridge between Polymer Science/Chemistry and Polymer Processing/ Modification/Rheology) (3b, 3c, 4c, 4c, 5b, 5c, 9a)", "Understand basics of Polymerization Production processes and how they relate to product design and properties (multicomponent polymer products, branched vs linear vs crosslinked molecules; emulsion/suspension vs bulk/solution; chain growth vs step growth vs ionic/coordinated systems with a catalyst vs controlled free radical or other specialty cases, etc.)", "The idea is to become fluent with polymer reactor aspects and the basic tools of PRE from mathematical modelling in aid of polymerization process (and polymer product) understanding, operation troubleshooting and, finally, optimization/control.", "CH 0:  Introduction (to polymerization and polymeric materials)", "CH 1:  Basic Concepts/Definitions", "CH 2:  General Introduction; Polymerization Process Information", "Anything else?", "Do not delay and do not postpone!", "Many references will be given in the beginning of the course; there is no such thing as one comprehensive and all-inclusive book that covers this material.", "Anything else?", "Do not delay and do not postpone!", "Intellectual property includes items such as:", "Outcome Definition", "A knowledge base for engineering Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "2. Problem analysis An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "4. Design", "An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "7. Communication skills An ability to communicate complex engineering concepts within the profession and with society at large.", "An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Impact of engineering on society and the environment", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Ethics and equity", "Life-long learning", "An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge."]}, {"course_id": 110, "course_code": "CHE 562", "course_name": "CHE562 - Advanced Bioprocess Engineering (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Advanced Bioprocess Engineering Winter 2025", "View requirements for CHE 562", "•Bioreaction topics: enzyme kinetics; growth kinetics; homogeneous (i.e., enzymatic reaction and cell cultivation) vs. heterogeneous (immobilized) biocatalysts; bioreaction vs. mass transfer in immobilized biocatalysts; bioreactor modeling and design (BR, CSTR, PFR)", "Understand how immobilized biocatalysts are designed and made", "Model bioreactor systems with bioreactions catalyzed by both non-porous or porous immibilized enzymes", "Model bioreactor systems with bioreactions catalyzed by both active and passive immibilized cells", "Demonstrate competence in the fundamental concepts of biological sciences and biochemical/bioprocess engineering, including biomolecules, biocatalysts, metabolic pathways, enzyme functions/kinetics, cell behaviors and growth kinetics, bioreactor systems for enzymatic reactions and cell cultivation.", "Apply biological and chemical engineering concepts to design and analysis of bioreactor systems, including mass balance, bioreactor types, bioreactor configurations, bioreactor operation, bioreactor control, bioreactor modeling, bioreactor optimization etc. (2a; 2b; 2c; 4a; 5a; 11b)", "•Week 1: Bioprocess and biological background review: Immobilized biocatalyst introduction", "•Week 3: Non-porous IE system modeling", "•Week 4: Porous IE system introduction", "•Week 6: Porous IE system and bioreactor modeling", "•Week 7: Porous IE system/bioreactor modeling and immobilized cell (IC) system introduction", "•Week 8: Active IC system modeling", "•Week 9: Passive IC/slab system modeling", "•Week 10: Passive IC/slab system and bioreactor modeling", "•Week 11: Passive IC/spheric system modeling", "•Week 12: Passive IC/spheric system and bioreactor modeling", "Bioprocess Engineering, 3rd Edition No 173.59"]}, {"course_id": 111, "course_code": "CHE 571", "course_name": "CHE571 - Industrial Ecology (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Industrial Ecology Fall 2024", "04:00PM - 05:20PM", "Industrial ecology is a rapidly growing field that systematically examines local, regional, and global uses and flows of materials and energy in products, processes, industrial sectors, and economies.", "It focuses on the potential role of industry in reducing environmental burdens throughout the product life cycle from the extraction of raw materials to the production of goods, to the use of those goods and to the management of the resulting wastes.", "This course will review the environmental issues associated with chemical industries and the roles of engineers to manage these issues.", "The principles and philosophy of green chemistry will be addressed including pollution prevention in unit operations.", "The concepts and practices of environmental life cycle analysis and accounting will be addressed in detail, together with the basics of risk assessment, management and communication.", "View requirements for CHE 571", "Introduction to sustainability and industrial ecology", "Brief overview of the scientific evidence for climate change", "Environmental Law in Canada; due diligence as a defence", "Climate legislation in Canada; carbon trading", "Describe the key principles of industrial ecology, sustainable development and sustainability engineering [1d,8a,9a].", "Explain the science of global warming and climate change [", "Apply carbon accounting standards to develop greenhouse gas emission and reduction estimates for inventories and reduction projects [", "Describe key environmental legislation in Ontario and Canada [8b,9a]", "Basics of sustainability and industrial ecology.", "Introduction to greenhouse gas (GHG) accounting.", "Week 5 GHG accounting - offset systems.", "A timed multiple-choice component.", "3.0 points - solutions are complete, correct and well-presented.", "2.0-2.5 points - solutions are mostly complete and well-presented but have minor errors, missing information.", "Intellectual property includes items such as:", "Graduate Attribute Program Indicators", "A knowledge base for engineering: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "1a Demonstrate understanding of concepts in mathematics.", "1b Demonstrate understanding of concepts in natural science.", "1c Demonstrate understanding of engineering fundamentals.", "1d Demonstrate understanding of specialized engineering knowledge.", "2. Problem Analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "3a Create investigative studies of complex engineering problems.", "3b Gather information from relevant sources to address complex engineering problems.", "4. Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "4a Define design requirements and specifications for complex, open-ended engineering problems.", "4b Critically evaluate and compare design choices.", "7. Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "8a Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Impact of Engineering: An ability to analyze social and environmental aspects of engineering activities.", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "10a Identify ethical and unethical behavior in professional situations.", "10b Identify how an engineer is accountable to multiple stakeholders in engineering practice.", "Life-long Learning: An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge.", "12a Identify gaps in their knowledge, skills and abilities.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 112, "course_code": "CHE 572", "course_name": "CHE572 - Air Pollution Control (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["CHE 572", "CHE 572 001", "CHE 572:", "Design of industrial particulate capture systems using cyclones, electrostatic precipitators, filters, scrubbers.", "Design of organic compound emissions control using incineration, biofiltration, adsorption and absorption.", "View requirements for CHE 572", "Recognize air emission and air quality issues and impacts, and the rationale for their regulation and control.", "Model simple air dispersion problem scenarios and evaluate the significance of the results.", "Identify, rank and select appropriate emission control technologies for a variety of scenarios.", "Perform preliminary process design and cost estimation for a variety of common emission control technologies, and recommend next steps.", "Recognize and recommend mitigation strategies for environmental and safety issues associated with air pollution control.", "Assess indoor air quality concerns and identify potentially useful mitigation techniques.", "Introduction, structure & composition of the atmospheres.", "Indoor air quality & investigations.", "Infection transmission control methods.", "The notes will be required for use in design calculations in almost every class, and exams.", "Comparing answers and discussing reasons for differences", "The following levels of collaboration are not acceptable:", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 113, "course_code": "CHE 574", "course_name": "CHE574 - Industrial Wastewater Pollution Control (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["S. Meunier", "sarah.meunier@uwaterloo.ca", "Dr. Sarah Meunier", "sarah.meunier@uwaterloo.ca", "Sarah Rezaei", "E6-1102", "Principles and design of treatment methods: chemical treatment, precipitation, coagulation and flocculation, ion exchange and membrane separation.", "View requirements for CHE 574", "4. Propose techniques to reduce and treat waste in a variety of industrial processes [1d,2a,2b,3a,3b,6a,6b,7a,7b,7c].", "Assignment 4 5% Topics 6 & 7 - Membrane Separations & Ion Exchange April 4", "Examinations", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 114, "course_code": "CIVE 460", "course_name": "CIVE460 - Engineering Biomechanics (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Biomechanics Winter 2025", "02:30PM - 05:20PM", "RCH 301", "Introduction to engineering technologies applicable to the field of biomechanics.", "Specific topics covered may include biological growth, form and function; biomaterials; kinematics and neurology of gait; biotribology; joint anatomy, function and repair; occupational biomechanics; trauma prevention.", "The course will provide a general overview of engineering biomechanics for civil, mechanical and biomedical engineering students.", "2. Conduct gait analysis and calculate forces applied at joints and foot reactions", "Introduction", "Evolution of Biomechanics", "Applications (medical and engineering)", "Musculoskeletal System", "Introduction,", "Anatomical positions & movements,", "System components,", "Gait Biomechanics", "Introduction;", "Muscles forces,", "Bone & Cartilage Biomechanics", "Introduction (highlights & progress),", "Bone mechanical properties & applications;", "Cartilage structure and mechanics", "Tendon & Ligament biomechanics", "Mechanical behaviour", "Biotribology & Joint Replacement", "Biotribology subfields,", "Cancer Biomechanics", "Introduction: cancer stages,", "Mechanical characteristics of cancer cells,", "Biomechanics and cancer treatment,", "Cardiovascular biomechanics, and", "Biomechanics in Radiotherapy", "“Orthopaedic Biomechanics: Mechanics and Design in Musculoskeletal Systems,” Pearson Prentice Hall.", "Biomechanics and motor control of human movement.", "Biomechanics and motor contAl-Mayah, A. (Ed.)"]}, {"course_id": 115, "course_code": "CIVE 512", "course_name": "CIVE512 - Rehabilitation of Structures (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Topics include damage mechanisms, instrumentation and non-destructive test methods, conventional repair techniques, innovative repair and strengthening techniques with composites.", "The laboratory portion involves test methods used to evaluate repair and strengthening measures.", "Instruments for Monitoring Structures", "Metal Corrosion and Fatigue", "Evaluation and Inspection of Steel Structures", "Rehabilitation of Steel Structures", "Evaluation and Inspection of Reinforced Concrete Structures", "Masonry and Wood Rehabilitation", "Be familiar with state-of-the-art techniques that can be used for assessment, rehabilitation, and strengthening of structures.", "Be able to perform some basic analysis and design calculations related to the assessment and strengthening of structures.", "Understand how structural rehabilitation fits within the broader topic of infrastructure management.", "Remaining topics", "Assessment instrumentation demo", "TBD", "Concrete beam FRP strengthening", "TBD", "Concrete beam FRP testing", "TBD", "TBD", "Working in the CEE structural testing laboratory in ~1-hour sessions during the lab weeks, students will repair and strengthen several reinforced concrete beams.", "Deliverable Submission and Late Submission Policy:", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Library for research-based assignments"]}, {"course_id": 116, "course_code": "ECE 327", "course_name": "ECE327 - Digital Hardware Systems (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Digital Hardware Systems Winter 2025", "ECE 327 / ECE 627", "10:00AM - 11:20AM E7 4053", "11:30AM -", "ECE 327 101", "ECE 327 201", "04:30PM - 05:20PM E7 4053", "04:30PM - 05:20PM", "04:30PM - 05:20PM E7 4053", "Maran Ma: E2-3354A Wednesday 1:30-2:30pm", "Design and modelling of digital hardware systems using a hardware description language.", "Power analysis and optimization.", "View requirements for ECE 327", "ECE 627:", "Introduction to power analysis and optimization.", "Introduction to faults and testing.", "View requirements for ECE 627", "The design and engineering of computing chips is an exciting, and valuable skill that spans multiple engineering disciplines including software engineering, parallel programming, verification and reasoning, compilation techniques, down to physical/analog/electrical effects.", "This course will help open the door to careers in the richly-rewarding chip design industry in a variety of roles such as RTL developers, verification engineers, system-level developers, and future leaders and managers.", "ECE327 will be vital to navigate these exciting times.", "We must think about and understand concurrent operations at a cycle-by-cycle level of abstraction.", "There are commonly used paradigms, and design patterns that we must known when organizing the RTL code.", "We will learn how to break down a complex design into these components, and learn how to reason about correctness, and understand their translation to hardware primitives.", "Most digital design are constrained to fit specific cost targets, and the analysis tools help guide the design process with appropriate feedback.", "These compilation iterations are fundamental to digital design and a good designer knows how to direct the tools, rewrite Verilog code, and generate the desired hardware.", "A class project will be used to tie together all the key design lessons we learn in this course.", "We will be developing a large-language model (LLM) solution involving a matrix multiplier as part of the project.", "Describe hardware components at the RTL-level in Verilog, verify these designs through simulation, and map these design to an FPGA fabric.", "Introduction - Introduction to hardware design, quick look at concurrency, debugging, synthesis and entire hardware design flow.", "Reasoning about parallelism in Verilog and drawing timing waveforms/diagrams from the code and vice versa.", "State Machines - Sequential logic design in the form of controllers (or state machines).", "Retiming - Automating pipelining of feed-forward datapaths.", "Strategies and ideas for retiming steps.", "Static Scheduling - Time-shared reuse of hardware resources.", "Construction of static scheduling tables based on resource constraints.", "Design of state machine controllers, and datapaths building blocks.", "Dynamic Scheduling - Dynamic scheduling of resource shared datapaths.", "Timing Analysis - Understanding clock frequency and algorithms for timing analysis.", "Elmore Delay - Simplified high-level model of wire delays.", "Power - Power/energy analysis of hardware components.", "Analytical expressions for power and energy.", "ECE627-only] FPGAs - FPGA Logic, Interconnect, and Architecture, Introduction to reconfigurable hardware/FPGAs, understanding logic design, interconnect and overall composition.", "For relevant labs, the course uses the AMD/Xilinx Pynq FPGA boards available in E2-2356A.", "FPGA board deployment will be done as part of some of the labs, and you will get a chance to rectify errors should this fail.", "Remember, the final exam covers the entire course!", "Precise determination will be done on a case-by-case basis.", "- For any missed graded item, we offer the option of taking a final if you miss it for a legitimate reason as per university guidelines.", "Plagiarism in ECE327 will likely manifest in the form of copying RTL code, scripts, bitstreams as-is or recast with minor modifications.", "We have a MOSS configuration to check code plagiarism and we take this seriously.", "We understand that these circumstances can be troubling, and you may need to speak with someone for emotional support."]}, {"course_id": 117, "course_code": "ECE 340", "course_name": "ECE340 - Electronic Circuits 2 (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electronic Circuits 2 Winter 2025", "ECE 340", "ECE 340 001", "11:30AM -", "Email", "ECE 340:", "Electronic circuits and their limitations including, metal-oxide-semiconductor (MOS) and bipolar junction transistor (BJT) differential pairs, biasing, the cascode configuration and active loads.", "Differential and multistage amplifiers.", "View requirements for ECE 340", "ECE 340 is the third core course in a three-course sequence (after ECE 140 and ECE 240) on electronic circuits.", "ECE 340 focusses on the analysis and design of transistor amplifiers using integrated circuit (IC) technology, where transistors and other electronic components are built together on a semiconductor chip.", "We study amplifiers, and their supporting circuits, because these are essential building blocks for many analog application-specific ICs (ASICs), including sensor interfaces, baseband-communication systems, power-delivery circuits, and data converters.", "We will study transistor amplifiers built using metal-oxide-semiconductor field-effect transistors (MOSFETs) and bipolar junction transistors (BJTs).", "Perform dc operating point and small-signal ac analyses of MOSFET and BJT circuits.", "Analyze and design single-stage and multi-stage MOSFET and BJT amplifiers with passive and active loads, including cascodes.", "Analyze the frequency response of transistor amplifiers.", "Operate appropriate lab equipment to build, debug, and characterize basic electronic circuits.", "Review of single-MOSFET amplifiers", "Integrated circuit (IC) building blocks: current mirrors and biasing, active loads, and cascode amplifiers", "BJT circuits and single-BJT amplifiers", "Differential-pair amplifiers", "Frequency response of amplifiers", "Multi-stage amplifiers and op amps at the transistor level", "Feedback in circuits", "**NOTE:", "Review of basic electronic measurements and op amp circuits", "Single-transistor amplifiers and cascodes", "Current mirrors", "Frequency response of amplifiers", "**NOTE:", "Closed book and closed notes", "Non-programmable, non-graphing scientific calculator is allowed", "A formula sheet will be provided", "All labs contain an \"in-lab\" section which involves building and measuring various circuits and reporting results.", "Numerical solutions not included in the textbook will normally be provided upon release of the problem set.", "Intellectual property includes items such as:"]}, {"course_id": 118, "course_code": "ECE 350", "course_name": "ECE350 - Real-Time Operating Systems (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Real-Time Operating Systems Winter 2025", "ECE 350", "ECE 350 001", "08:30AM - 09:50AM E7 4053", "11:30AM -", "ECE 350 201", "01:30PM - 04:20PM E2 2356A", "ECE 350 202", "01:30PM - 04:20PM E2 2356A", "01:30PM - 04:20PM E2 2356A", "ECE 350 101", "10:00AM - 11:20AM E7 4053", "About Prof. Zarnett", "8 years industry engineering experience in display & imaging", "Research specialization brain-machine interfacing", "Ahmed Elbaroudy - ammaelba@uwaterloo.ca", "Neeraj Nagar - nnagar@uwaterloo.ca", "Memory and virtual memory and caching; I/O devices, drivers, and permanent storage management; process scheduling; queue management in the kernel; real-time kernel development.", "Aspects of multi-core operating systems.", "View requirements for ECE 350", "Understand the differences between non-real-time and real-time operating system.", "The course notes should be pretty much everything you need for this course.", "I read them so you don’t have to!", "They are neither required nor recommended, but I'll list them here in case you truly wish to look at them.", "Operating Systems Internals and Design Principles (9th Edition).", "Please bring this situation to the attention of the course staff as soon as possible so that can be resolved quickly.", "However, each group must submit their own, independently-developed code for each lab.", "Similarly, each person must submit their own, independently-developed code for each assignment.", "I suggest you avoid looking at other people’s code entirely, but if you do, then you should not be doing that anywhere you might be writing your own code.", "The temptation to write your code just like what you see is simply too high.", "However, penalties may be more severe for repeat offenders (see below for information on Academic Integrity).", "All of the above applies to multiple instances — a student caught in several incidents of academic dishonesty will be subject to the above penalties for each of the incidents.", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, ChatGPT) and how such tools can be used to write and test code.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be diﬃcult to interpret on a discussion forum.", "The human visual system has evolved to perceive saber‐toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text‐mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions."]}, {"course_id": 119, "course_code": "ECE 356", "course_name": "ECE356 - Database Systems (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Database Systems Fall 2024", "ECE 356", "ECE 356 001", "11:30AM -", "08:30AM - 09:50AM E7 4417", "Data models, file systems, database system architectures, query languages, integrity and security, database design.", "View requirements for ECE 356", "Relational databases empower the vast majority of dynamic websites as well as a variety of information management systems in private and public sector organizations.", "ECE356 explores the concepts and techniques that make such databases convenient, efficient, and reliable.", "The course additionally includes an introduction to data mining and NoSQL.", "model data using entity-relationship (ER) diagrams", "understand the relational model and design a relational schema for a data set", "execute SQL commands against a remote database using Java Database Connectivity (JDBC)", "identify integrity constraints and functional dependencies in data", "apply the theory of database normalization to optimize the design of a relational schema", "understand the basics of transaction execution, concurrency control, and recovery in databases", "understand SQL injection attacks, as well as password hashing and salting", "perform simple data mining and analytics operations on real data sets", "design a denormalized schema for a NoSQL database", "September 4-10 intro, relational model SSH, mysql command line tool     first week of classes", "September 11-17 relational algebra, SQL relational algebra", "October 2-8 normalization normal forms and normalization", "Exams", "A make-up final exam, if offered by the instructor, may be scheduled in a future academic term.", "The instructor will not offer a make-up midterm, and will instead consider shifting the weight of a missed midterm towards the final exam.", "Members of the teaching team may also evaluate students' proficiency in the use of software in connection with lab work.", "If a student's solution differs substantially from the solution recognized by the teaching team, the student may be asked to provide sample inputs and outputs to evaluate the correctness of their solution.", "Collaboration", "Exams may cover both theory and practice, including your ability to read and write SQL code.", "Notice of Recording"]}, {"course_id": 120, "course_code": "ECE 358", "course_name": "ECE358 - Computer Networks (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 358", "10:00AM - 11:20AM E7 4417", "Email", "Prof. Catherine Rosenberg", "Mike Cooper-Stachowsky", "Substitute Instructor", "Dr. Abdalla Mohamed Hussein", "Maryam Amini", "maryam.amini@uwaterloo.ca", "yuan.quan@uwaterloo.ca", "Mohammad Abuyaghi", "This course is a comprehensive introduction to computer networks.", "View requirements for ECE 358", "Revised Description: This course is a comprehensive introduction to computer networks.", "The lower-level outcomes are:", "Have a good understanding of protocols and networking design concepts.", "Have a working knowledge of socket programming.", "Have a working knowledge of transport protocols with a special emphasis on TCP and retransmission protocols.", "Example of LAN technologies: Ethernet and switches.", "Synthesis: a day in the life of a web request", "LAB1: Development of a simulator of a single transmission system.", "Examination", "If you miss the midterm without a valid reason, that midterm earns a score of zero.", "Lab marking and reports submissions", "Instructions for how to package your files and submit are in the lab manuals."]}, {"course_id": 121, "course_code": "ECE 360", "course_name": "ECE360 - Power Systems and Smart Grids (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Power Systems and Smart Grids Fall 2024", "ECE 360", "ECE 360 001", "Office: E3-4111, Ext: 37063", "Email: GBommali@uwaterloo.ca", "Email: aomar@uwaterloo.ca", "Fundamentals of power systems, analysis techniques including power flow and symmetrical fault analyses, and the basics of distribution systems and smart grids.", "View requirements for ECE 360", "This course provides a comprehensive overview of power systems and smart grids, exploring their fundamental concepts, components, and operations.", "Students will gain insights into the generation, transmission, distribution, and utilization of electrical energy, as well as the emerging technologies and trends shaping the future of the power industry.", "Analyzing power systems is vital for their operation, utilizing techniques like Power Flow Analysis to monitor voltage and power flow and identify potential issues such as bottlenecks.", "Symmetrical Fault Analysis assesses system resilience against faults.", "Distribution systems, the final delivery point, incorporate smart grids that enhance functionality through technologies like smart meters, renewable energy integration, advanced communication networks, and energy storage solutions to improve efficiency, reliability, and sustainability of power distribution.", "Develop the capability to identify and analyze power systems encompassing generation, transmission, and distribution.", "Acquire the ability to integrate renewable energy sources into power systems and leverage smart grid technologies to enhance grid efficiency and modernization.", "Navigate the regulatory and economic aspects of power systems, adapting to changes in deregulation and energy economics.", "Develop strong problem-solving and innovative thinking skills to address the evolving needs of the energy sector.", "Acquire a solid foundation in the theoretical and practical aspects of power systems and smart grids, preparing for a successful career in electrical engineering.", "Power Systems: Power system structure: generation, transmission and distribution system, load profiles and characteristics; Deregulation; Smart grids.", "Per Unit System: importance of per unit system,  concept of base quantities, process of converting actual quantities to per unit values, per unit system for analyzing power systems.", "Fault Analysis and Protection: Three-phase symmetrical faults; Basic concepts of protection, elements of protection systems.", "Protection zones, Primary and backup protection, Protection system requirements, Protective relays, Application of protection systems.", "Distribution Systems: Distribution system configurations; Voltage drop and loss calculations; Shunt capacitors in distribution systems; Distribution automation", "Smart Grids: Philosophy and concept of smart grids, Smart homes and smart meters; requirements; concept of smart loads and customer engagement; self healing and restoration paths.", "Power Systems Analysis and Design, Glover , Sarma and Overbye, SI version, 5th Edition, Cengage Learning, 2012 No", "Come to the lab with a clear understanding of what you are meant to accomplish, or with clear questions, so that the teaching team can help you.", "Lab Study – 0: Lab Safety & Equipment Introduction", "Lab Study – 4: Power Systems Load Flow Studies", "Lab Study – 5: Short Circuit Analysis and Protection Simulations"]}, {"course_id": 122, "course_code": "ECE 373", "course_name": "ECE373 - Radio Frequency and Microwave Circuits (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Radio Frequency and Microwave Circuits Fall 2024", "ECE 373", "ECE 373 001", "Email", "ECE 373:", "Review of transmission line and scattering matrix representation of radiofrequency (RF) circuits, multiport RF networks, modern RF and microwave planar technology, lumped and distributed microstrip circuits, microwave couplers, Hybrids, resonators, filters, Low-noise amplifiers (LNAs), RF oscillators and mixers, computer-aided design (CAD) tools for RF circuits, hybrid and monolithic RF circuits.", "View requirements for ECE 373", "Design and analyse RF passive circuits such as couplers, power dividers, and filters.", "Design and analyse of RF active circuits such as low noise amplifiers, oscillators and mixers.", "Get familiar with the usage of Advanced Design Tools for simulating RF circuits.", "Transmission line theories and generalized matrix representation of RF circuits", "Analysis of multiport RF networks", "Introduction to modern microwave planar technologies", "Lumped and distributed microstrip circuits", "Analysis of microstrip circuits", "Microstrip couplers, hybrids and impedance matching networks", "Microwave resonators and filters", "Design of RF low noise amplifiers (LNA’s)", "Design of RF oscillators and mixers", "Use of existing commercial CAD design tools for RF circuits", "Computer-Aided Design of Microwave Circuits [", "] K. C. Gupta, Computer-Aided Design of Microwave Circuits, Dedham, Mass.: Artech, No", "Microwave Transistor Amplifier: Analysis and Design [", "By the end of the labs, students will be able to use Keysight’s Advanced Design System (ADS) circuit and Electromagnetic (EM) simulator to simulate and design RF circuits.", "The list of circuits includes couplers, filters, and low noise amplifiers.", "Lab 1: Introduction to Keysight’s Advanced Design System (ADS) tool", "Lab 2: Passive Circuit Design", "Lab 3: Passive/Active Circuit Design", "Lab 4: S-parameter Measurements using Vector Network Analyser", "· No open-toed shoes or bare feet in the lab, and no running in the lab.", "Phone numbers for", "Ambulance and UW police are 911 & x22222, respectively.", "· See the poster near the door for first Aid/emergency procedures."]}, {"course_id": 123, "course_code": "ECE 375", "course_name": "ECE375 - Electromagnetic Fields and Waves (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electromagnetic Fields and Waves Winter 2025", "ECE 375", "Monday, Friday -", "Maxwell's equations; plane waves; time-harmonic fields; waves at planar boundaries; boundary conditions; reflection and transmission; transmission lines; electric fields in matter; magnetic fields in matter.", "View requirements for ECE 375", "You should discuss your problems regarding concepts with the instructor and the tutorial TA.", "Slides", "Time-Varying Electromagnetics", "Maxwell’s Equations", "8-2,8-3", "Snell’s law, Fiber optics", "2-Ramo, Whinnery, VanDuzer, “Fields & waves in Communication Electronics”, 3rd ed., John Wiley, 1994."]}, {"course_id": 124, "course_code": "ECE 406", "course_name": "ECE406 - Algorithm Design and Analysis (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Algorithm Design and Analysis Winter 2025", "ECE 406", "ECE 406 001", "11:30AM -", "E. Creager", "04:00PM - 05:20PM", "E. Creager", "04:00PM - 05:20PM", "• Rushabh Solanki", "ECE 406:", "Design and analysis of efficient, correct algorithms.", "Advanced data structures, divide-and-conquer algorithms, recurrences, greedy algorithms, dynamic programming, graph algorithms, search and backtrack, inherently hard and unsolvable problems, approximation and randomized algorithms, and amortized analysis.", "View requirements for ECE 406", "How to design efficient algorithms using divide and conquer, greedy algorithms, and dynamic programming.", "The kinds of problems that can be solved with linear programming, and why they can be solved efficiently.", "What it means to reduce one problem to another, and how it used in complexity analysis", "Introduction to algorithms Chapter 0 0.5 hours", "Divide and conquer algorithms Chapter 2 5 hours", "Graphs, decompositions and depth-first search Chapter 3 3 hours", "Linear Programming: Simplex algorithm, duality theorem Chapter 7 4 hours", "No lectures during ECE midterms week (Feb 24--28)", "LEC001] Tue 2:30--3:30pm in E7-5353", "Assignments Information and Guidelines: Assignments are given roughly every other week, and their primary goal is to give you practice in designing and analyzing algorithms.", "You must list these collaborators at the top of the first page of your assignment (there is no penalty for listing collaborators, but it ensures we do not falsely identify plagiarism).", "In submitting an assignment, you are “signing off on your work” as described in the academic integrity form at https://uwaterloo.ca/academic-integrity/. The penalty for a first plagiarism offence is -100% for the assignment.", "* Each student must turn in a signed academic integrity form to confirm their understanding of the above policies.", "Notice of Recording"]}, {"course_id": 125, "course_code": "ECE 409", "course_name": "ECE409 - Cryptography and System Security (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Cryptography and System Security Winter 2025", "04:00PM - 05:20PM", "08:30AM - 09:50AM E7 5353", "Introduction to cryptology and computer security, theory of secure communications, points of attack, conventional cryptographic systems, public key cryptographic systems, standards, firewalls, wireless system security, applications.", "View requirements for ECE 409", "This course will provide introduction to  cryptography and system security.", "It covers  basic concepts in cryptography and system security,   types of attacks, trust and threat models,  pseudorandomness, computational security,  symmetric-key  cryptography,  public-key cryptography,   attacks on cryptographic operations,   network security protocols,   wireless system security and privacy,  applications in IoT systems,   special topics on  privacy preserving  AI,   quantum key  distribution and post-quantum cryptography.", "Explain the principles of cryptography and system security.", "Explain how practical schemes of symmetric-key cryptography and public-key cryptography are designed and implemented.", "Analyze the security and privacy protections in wireless systems and their applications in IoT.", "Apply security principles to solve problems in concrete applications.", "Introduction  to Cryptography  and System Security", "Cryptography and cryptanalysis", "Basic protections: encryption and authentication", "Classification of cryptosystems", "Basic  concepts of secure systems.", "Types of attacks,  trust and threat model", "Computational security and one-way functions", "Chapter 3. Symmetric-key Cryptographic Systems", "Arithmetics of binary finite fields", "Secure hash functions: SHA1, SHA2 and SHA3", "MAC and forgery attack", "Time-memory trade-off attacks and attacks by AI", "Public-key Cryptographic Systems", "Arithmetic operations", "Security of public-key cryptography (factorization, DL, LWE)", "Practical public-key systems (DH, RSA, DSA, ECC)", "Fault side-channel attacks", "Network Security Protocols", "Implementing secure systems:  PKI  and  X.509 certificates", "Hop-by-hop versus end-to-end protections and VPN", "Chapter 6. Wireless System Security", "5G security architecture for IoT security and privacy", "Privacy preserving machine learning: secret sharing; securing federate learning", "Basic concepts for quantum cryptography", "Quantum key distribution", "Post-quantum cryptography", "Communication System Security L.L. Chen and G. Gong", "R. Anderson, Security Engineering A Guide to Building Dependable Distributed Systems, Wiley, 2014 (Anderson14).", "Schneier on Security, http://www.schneier.com/blog/. A blog covering current computer security and privacy issues.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 126, "course_code": "ECE 416", "course_name": "ECE416 - Advanced Topics in Networking (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Advanced Topics in Networking Winter 2025", "TBA", "TBA", "TBA", "Access code to sign up (if not already enrolled): ece416-w25", "View requirements for ECE 416", "Understand the structure, addressing, and operational aspects of IPv6, and evaluate its advantages over IPv4 in addressing scalability and security challenges", "Understand the principles of Quality of Service (QoS) in networking, including techniques and protocols used to manage bandwidth, reduce latency, prioritize traffic, and ensure reliable data transmission for diverse applications.", "Examine the concepts of mobility in 4G and 5G networks, including tunnel routing mechanisms, and assess their impact on network performance and application delivery.", "Investigate IoT architectures, protocols, and security challenges, and understand their applications in smart environments and industrial systems.", "Conduct research-driven projects on advanced networking topics, present findings through technical papers and presentations, and engage in constructive peer discussions", "Introduction and review of ECE 358", "Introduction to Security in Computer Networks", "Software defined networks", "Security in Computer Networks (Will be split across different layers)", "Month", "F", "Deliverables", "Multiple dropboxes has been created for your submissions as follows:", "Partial/full solutions for these problem sets will be posted on the course website.", "This course includes the independent development and practice of specific skills, such as writing a white paper.", "Library for research-based assignments"]}, {"course_id": 127, "course_code": "ECE 417", "course_name": "ECE417 - Image Processing (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Image Processing Winter 2025", "Monday, Friday -", "Topics include intensity transformations for image enhancement, two-dimensional discrete Fourier transform, spatial and frequency domain linear image filtering, nonlinear image filtering, binary image processing, edge detection, image segmentation, and digital video processing basics.", "View requirements for ECE 417", "This course also includes advanced topics including statistical and perceptual image modeling and processing; and compression, streaming, robustness, and scalability issues in visual communications.", "Understand basic theories and methodologies of digital image processing", "Digital image and video processing: Intensity transformations for image enhancement; spatial domain linear filtering; frequency domain linear filtering; nonlinear image filtering; image sampling and interpolation; motion and digital video processing.", "Image analysis and understanding: Edge detection; image segmentation; energy preserving and energy compaction; principle component analysis and independent component analysis; sparse representations; wavelet and multiresolution image analysis; non-linear image analysis.", "Statistical and perceptual image modeling and processing: Spatial domain image statistics; Fourier domain statistical image models; wavelet domain statistical image models; Markov random field models; computational models of the human visual system; perceptual image quality assessment and processing; data-driven and learning-based image processing algorithms.", "Visual communications: compression, quality, streaming, robustness and scalability: Video compression and standards; quality-of-service and quality-of-experience; adaptive video streaming; error resilient visual coding and communications; scalable image and video coding and communications.", "Electronic copies of lectures and study materials will be provided at course web site.", "Additional references include research papers published in journals, conferences and open-source archives that can be found online.", "Homework assignments are not graded but will be helpful for students to understand basic image processing concepts and algorithms, and will also be helpful for the preparation of the final exam.", "A research project that attempts some new investigations in a specific direction.", "The project presentation slides and reports should be submitted via Dropboxes at LEARN."]}, {"course_id": 128, "course_code": "ECE 423", "course_name": "ECE423 - Embedded Computer Systems (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Embedded Computer Systems Winter 2025", "04:00PM - 05:20PM", "Emon Sarkar esarkar@uwaterloo.ca", "Specification and design of embedded systems, specification languages, hardware/software co-design, performance estimation, co-simulation, verification, validation, embedded architectures, processor architectures and software synthesis, system-on-a-chip paradigm, retargetable code generation and optimization, verification and validation, environmental issues and considerations.", "View requirements for ECE 423", "Part I: Introduction", "Part II: Embedded Systems and SoC Design", "4.5", "Part VII: Embedded Architecture: System Architecture", "4.5", "Part X: System Software for Embedded Multicores", "The deliverables for each assignment consist of a demo and a report.", "Help sessions will be scheduled in the lab room E2 2356A every week, starting on the second week of classes and excluding reading week, on the following day and time: Wednesday 2:00PM-5:00PM.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 129, "course_code": "ECE 432", "course_name": "ECE432 - Radio Frequency Integrated Devices and Circuits (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Radio Frequency Integrated Devices and Circuits Spring 2024", "08:30AM - 09:50AM E7 4433", "S. Su", "04:00PM - 05:20PM", "An introduction to the theory and practice of Radio Frequency (RF) Integrated Circuit design.", "Physics and modelling of RF integrated components such as resistor, inductor, capacitor (RLC) passives, diodes, metal oxide semiconductor field-effect transistors (MOSFETs), high electron mobility transistors, hetero-junction bipolar transistors.", "An introduction to radio frequency and high-speed integrated circuit design.", "Topics include physics and modelling of passive components (diode, R, L, C, transformer, and transmission line) and transistors (MOSFETs and BJTs) on a silicon chip; design of transistor-level circuit building blocks, including wideband/tuned amplifiers, frequency synthesizers (e.g., oscillators, phase-locked loops), mixers and multipliers, power amplifiers, filters; signal processing and conditioning techniques and analysis of modern communication and computing systems.", "Innovative and complete designs may be good candidates for peer-reviewed publications in IEEE CASS and SSCS.", "Students will use industry-standard design tools and flows, with potential for top designs to be ported to advanced CMOS technologies, fabricated, and measured at UWaterloo.", "Analyze and design the main circuit blocks of a modern transceiver", "Specify components, circuits and sub-systems for use in high-speed/RF circuits", "Describe the behavior of RF and high-speed systems in terms of sensitivity, dynamic range, etc.", "Device Physics and Modeling (Diode, MOS and BJT)", "Amplifiers (Basic Topologies and Biasing) Homework 1", "Impedance Matching and Filters Homework 2", "Tuned Amplifiers (Narrowband LNAs) Lab 3", "Communication and Computing Systems Lab 4", "Signal Processing and Modulation Techniques Homework 4", "Mixers and Multipliers Lab 5", "Power Amplifiers, Nonlinearity and Distortion Homework 5", "A. S. Sedra & K. C. Smith, Microelectronic Circuits 8th edition Yes", "laptop/desktop used for simulations Yes", "If you miss both exams, it will be handled on a case-by-case basis."]}, {"course_id": 130, "course_code": "ECE 444", "course_name": "ECE444 - Integrated Analog Electronics (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Integrated Analog Electronics Winter 2025", "11:30AM -", "04:00PM - 05:20PM", "08:30AM - 09:50AM E7 4433", "Email", "Analog electronics exploits the physical behaviour of electronic devices to create electronic systems.", "The performance of single and multiple transistor amplifying stages are studied.", "Followed by a study of biasing, current mirror, and output stages, which are then combined in the study of operational amplifier circuits.", "Frequency response and feedback are then reviewed leading to a detailed study of stability and compensation for multistage and operational amplifiers.", "View requirements for ECE 444", "Analog integrated circuits (ICs) exploit the physical behaviour of electronic devices to create electronic systems.", "We will study the performance of single- and multiple-transistor amplifying stages.", "This is followed by a study of biasing, current mirrors, and output stages, which are then combined in the study of operational amplifiers.", "We then review frequency response and feedback, leading to a detailed study of stability and compensation for multistage and operational amplifiers.", "We will mostly study complementary metal-oxide-semiconductor (CMOS) circuits, but will use bipolar junction transistors (BJTs) for certain applications.", "The course finishes with a look at switched-capacitor circuits and data converters, including analog-to-digital converters (ADCs) and digital-to-analog converters (DACs).", "The knowledge and skills you will learn in this course will prepare you to:", "Pursue graduate studies in IC design (this is usually necessary to work as an IC designer in industry).", "Analyze and design some common analog IC components.", "Model and simulate analog IC components at different levels of abstraction.", "MOSFETs: regions of operation, small-signal models, body effect, weak inversion, intrinsic gain, and transition frequency", "Cascode operational transconductance amplifiers (OTAs) and Gm-C filters", "Current and voltage references", "CMOS two-stage OTA and frequency compensation", "Power amplifiers and output stages", "Data converters", "**NOTE:", "Closed book and closed notes", "Non-programmable, non-graphing scientific calculator is allowed", "A formula sheet will be provided", "The labs involve using LTspice from Analog Devices to design and simulate various circuit blocks using a commercially-available CMOS IC technology.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as circuit simulation.", "Library for research-based assignments"]}, {"course_id": 131, "course_code": "ECE 451", "course_name": "ECE451 - Software Requirements Specification and Analysis (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Software Requirements Specification and Analysis Winter 2025", "10:00AM - 11:20AM MC 2035", "Email:x784chen@uwaterloo.ca", "Email: ar2elsha@uwaterloo.ca", "Email: d3pang@uwaterloo.ca", "Models, notations, and processes for software requirements identification, representation, analysis, and validation.", "ECE 451: View requirements for ECE 451", "The week of", "Deliverables", "1 Introduction", "3 RE Reference Model", "Jan 13 4 Domain Model 4 Domain Model D0 – Group members & Project idea", "Jan 27 7 Functional Modelling 8 OCL D1 – Domain Model & Stakeholders", "Feb 10 10 Quality Requirements 10 Quality Requirements D2 -  Use case Diagram & Description", "Feb 24 11 Requirements Conflict management 12 Prioritizing Requirements D3 – Functional Model & OCL", "Mar 3 13 Cost Estimation 14 Risk Analysis D4 – State Diagram", "Mar 17 15 Temporal Logic 16 Validation and Verification D5 – Cost Estimation & Risk Analysis", "Mar 31 17 Software Project Management 18 Requirement Engineering for AI Systems D6 - Quality Attributes and Temporal Logic", "Ability to separate requirements from specifications from domain assumptions and argue that a specification + domain assumptions satisfy requirements", "Ability to model requirements in a variety of modelling paradigms", "Ability to elicit and document non-functional requirements such that the to-be-developed software can be objectively tested for their satisfaction", "Ability to use tools to manage a Software Development Team.", "Why is requirements analysis complex?", "Functions as a modelling notation.  Pre- and post-conditions.", "Use-case diagrams.", "Functions over a class diagram.", "Modelling dynamic behaviour of a software system.", "UML State Machines.", "Specification patterns.", "7: Model Integration (1 hour)", "The expected contents and organization of a Software Requirements Specification (SRS).", "AI vs non-AI Systems based on what we covered in this course.", "Braek and Haugen, Engineering real-time systems: an object-oriented methodology using SDL, Prentice-Hall, 1993.", "Larman, Applying UML and Patterns, Prentice Hall, 2004.", "Maciaszek, Requirements Analysis and System Design, Addison Wesley, 2001.", "Bray, An Introduction to Requirements Engineering, Addison-Wesley, 2002.", "Nuseibeh and Zave, Software Requirements and Design:", "van Lamsweerde, Requirements Engineering: From System Goals to UML Models to Software Specifications, Wiley, 2009.", "Brooks, The Design of Design, Addison Wesley, 2010.", "Alan Davis, Just Enough Requirements Management: Where Software Development Meets Marketing, Dorset House Publishing, 2005.", "The project can be related to requirements engineering or a more general software engineering topic.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}]