[{"course_id": 44, "course_code": "ME 459", "course_name": "ME459 - Energy Conversion (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Energy Conversion Fall 2024", "10:00AM - 11:20AM E5 3102", "Design of fossil-fuel central power plants, including boiler efficiency calculations and advanced steam and binary cycles.", "Review of atomic physics including fission and fusion energy.", "Design of nuclear fission power plants including design of reactor core for critical conditions, fuel cycles and radiation hazards.", "Design considerations for solar energy conversion devices including: availability of solar energy, solar-thermal converters, thermal storage and photovoltaics.", "Principles of fuel cells and some aspects of their design.", "We look at the way Canada, and the world, use energy, where the energy comes from, the finite nature of some reserves, and the impact of this energy use on the environment.", "Sustainability and the security of energy supply are also discussed.", "We review conventional energy systems from an efficiency and global warming perspective.", "From the study of these various factors, it will become clear that new energy technologies will need to be adopted in the future.", "We then study energy conversion devices and systems not studied in previous courses: for example, nuclear reactors, MHD, fuel cells, solar energy conversion(s), wind energy conversion, co-generation, hydroelectricity, ethanol, methanol, geothermal, ocean thermal, wave, tidal, thermoelectric.", "The objective is to broaden the students’ understanding of energy, both in a technical sense and in an environmental and socio-economic sense.", "6 Entropy and Availability", "8 Coal and Combustion", "9 Nuclear Energy", "11 Ethanol for Vehicles", "12 Methanol for Vehicles", "14 Solar Energy", "17 Wind Power", "18 Wave Power", "19 Tidal Power", "22 Thermoelectric", "Students must research in depth one topic in energy conversion and present their findings in a 7500 - 10000 word or so (~15-20 pages, … … or so) report.", "Project topics will be allocated in the first few lectures on a first-come, first-served basis.", "To select a topic, send me an email request, with alternatives in case your primary request is taken.", "However, the socio-economic and environmental aspects of the topic, and some indication of the magnitude of its possible impact on the demand for energy and on global-warming should also be considered."]}, {"course_id": 46, "course_code": "ME 526", "course_name": "ME526 - Fatigue and Fracture Analysis (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Fatigue and Fracture Analysis Winter 2025", "05:30PM - 08:20PM E7 3343", "Email: a3taghipour@uwaterloo.ca", "Fatigue and fracture analysis of metallic components including welded joints.", "Review of test and design procedures.", "S-N curves and effects of mean, residual and multiaxial stressing.", "Stress concentrations; scatter and fatigue life distributions.", "Linear elastic fracture mechanics analysis of fatigue crack propagation and fracture initiation.", "Understand the principles of fatigue and fracture mechanics.", "Apply stress-based and strain-based fatigue analysis techniques.", "Utilize fracture mechanics for crack propagation analysis.", "Week Topics Deliverables Comment", "“Mechanical Behavior of Materials - Engineering Methods for Deformation, Fracture and Fatigue”,4th Edition, N. E. Dowling, Prentice Hall, 2012.", "Exams", "Make-up exams will only be permitted for legitimate reasons as per university policy and may differ in format and difficulty from the original.", "This course emphasizes the independent development and practice of specific skills, including fatigue analysis, fracture mechanics, material behavior modeling, and engineering failure analysis techniques.", "Fundamental Values of Academic Integrity: ICAI Values (https://academicintegrity.org/images/pdfs/20019_ICAI-Fundamental-Values_R12.pdf)"]}, {"course_id": 47, "course_code": "ME 531", "course_name": "ME531 - Physical Metallurgy Applied to Manufacturing (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Please do check your email regularly to make sure you do not miss anything", "This course will allow the student to develop a more in depth knowledge of physical metallurgy and its application in understanding and solving relevant manufacturing problems.", "It will begin with a treatment of solid-state diffusion, mass transport and the principles of solidification including constitutional supercooling.", "The course will include case studies aimed at providing the students with an opportunity to apply their knowledge in a practical way.", "Explain the cause of the microstructure development during various metallurgical processes using the fundamentals of thermodynamic", "Phase and Phase Equilibria for Multi-Component Systems (Section 1.3 to 1.5)", "Energy Aspect of Diffusion (Section 2.2 to 2.4 and 2.7, 2.8)", "Relating these concepts to heat treatments we know (Sections 5.4 to 5.6, 5.8)2", "1These two sections are going to be intertwined and these sections would also be intertwined", "We will take the concepts in this course and apply it to deepen our understanding of these microstructure formation", "Engineering Materials 2 - An Introduction to Microstructures and Processing (4th Edition).", "These includes the lab.", "We will also play around with a software name Thermocalc, which is free for students if you sign up here:", "https://thermocalc.com/academia/free-educational-package/", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 48, "course_code": "ME 533", "course_name": "ME533 - Non-Metallic and Composite Materials (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["11:30AM - 12:20PM DWE 2402", "Please do check your email regularly to make sure you do not miss anything", "The structure and properties of polymers and ceramics in bulk form and as matrices and reinforcements in composites will be covered.", "The geometrical arrangement of fibres within laminae and their influences on elastic and strength properties of composites will be described based on suitable micromechanical models.", "The role of the matrix and fibre/matrix interface in determining composite properties will be described.", "Explain the interaction of the reinforcement phase and the matrix phases in various types of structural composite and their roles within the composites.", "Devise simple structural composites using the fundamental understanding in order to achieve the desired properties.", "What is a Composite and the rationale behind them?", "A Primer on Polymer Science", "Carbon-Carbon Bond and the Carbon backbone", "Carbon fibers and the source of its properties", "Polymer structure and how it affects strength", "Chain Length, Molecular Weight, and Degree of Polymerization", "Crystallinity, Defects, Properties & Behaviour", "A Primer on Ceramics", "Difficulty in Processing and its relations to Properties & Behaviour", "The Matrix Phase and the need for Reinforcements", "Micromechanics of Continuous Fiber Reinforced Composites", "Various orientation of fibers", "Micromechanics of Discontinuous Fiber Reinforced Composites", "Modifying the rule of mixture", "The importance of interfaces", "Extending these to macro-composites", "Manufacturing and Processing", "Manufacturing of Fibers", "Extending these to composites", "End-of-Life, recyclability, and environmental concerns", "Design tools for Composites", "More Advanced topics in Composites", "Fracture and Failure of Polymers and Ceramics", "Natural and Advanced composites", "Carbon/carbon composites", "Nanocomposites and dispersion strengthened composites", "Woods and other natural composites", "*", "John Wiley & Son available in the Davis Library: TA403 .C23 2006, *recommended for review of fundamental of materials science No", "*recommended for review of fundamental of materials science No", "Engineering Materials 2 - An Introduction to Microstructures and Processing (4th Edition).", "*recommended for review of fundamental of materials science No", "Materials Selection in Mechanical Design (4th Edition).", "These assessments will be administered online and students will be given some period of time (usually a week or so) to complete the task.", "During the first week of the final exam period, there will be a final assessment with one or both a numerical and a conceptual assessment.", "These includes the lab.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 49, "course_code": "ME 535", "course_name": "ME535 - Welding Metallurgy (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["DWE 2402", "P. Enrique", "Metallurgy of welding of steels (carbon, microalloy, low alloy and stainless steels), cast irons, aluminum-based, copper-based, nickel-based, cobalt-based, titanium-based and other alloys, (including dissimilar combinations) to explain the effects of welding processes and conditions (including post-weld heat treating) on microstructure and properties; causes and prevention of defects and deficiencies which can occur in different alloys, including porosity, cracking, embrittlement (hydrogen, temper, strain aging, ductile-brittle transition temperatures), overaging; metallurgy of soldered and brazed joints.", "Laboratory experiments will demonstrate microstructural effects and defects in a range of alloys for different welding processes and conditions.", "Understand the role of solidification conditions (G vs. R) on the microstructures that form", "Understand the types of defects that occur during solidification in the fusion zone and heat affected zone in various welding processes", "Understand the phase transformations that may occur in the fusion zone and heat affected zones after solidification", "Understand how welding process parameters influence all of the above concepts", "Understand how post-process heat treatments influence microstructures", "January 7 Introduction and welding background", "January 21 Solidification I", "February 18 Multi-pass welding and additive manufacturing", "March 4 Post-weld processing and properties", "March 11 Solidification defects and welding defects I", "March 18 Solidification defects and welding defects II", "March 25 Weld shielding and oxidation reactions", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 50, "course_code": "ME 538", "course_name": "ME538 - Welding Design, Fabrication and Quality Control (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 11:20AM DWE 3519", "08:30AM - 11:20AM", "Email: michael.benoit@uwaterloo.ca", "Email: amemblet@uwaterloo.ca", "Design of weld joints for structures made from ferrous alloys such as plain carbon and low alloy steels and non-ferrous alloys such as aluminum alloys.", "Quality and quality control in welding fabrication; welding standards; welding procedure qualification; nondestructive examination methods for welds and brazed joints such as radiography, dye penetrant, magnetic particle, ultrasonic, and eddy current techniques.", "Identify and differentiate weld discontinuities, flaws, and defects", "Utilize visual inspection and select appropriate non-destructive examination techniques to detect weld discontinuities, flaws, and defects", "Analyze welded connections in static and fatigue applications", "Familiarize themselves with design, fabrication, and quality control codes", "Module 1 - Weld quality and non-destructive examination techniques", "Destructive testing", "Non-destructive testing", "Module 2 - Introduction to weld design", "Selection guideline of weld joints and types", "Design principles for weld integrity and manufacturability", "Module 3 - Weld design and analysis for static load applications", "Allowable stress design methodology", "Module 4 - Weld design and analysis for fatigue load applications", "Causes of fatigue failure in welds", "Stress range and fatigue classification", "Cumulative damage - Miner's rule", "Module 5 - Design, fabrication, and quality control codes", "Guest speakers to be confirmed", "Friday February 7 - 8:30-11:30", "CSA W47.1 - Certification of Companies for Fusion Welding of Steel, CSA Group, Mississauga, ON, Canada, 2009 Available online via library No 227", "Test 2 will be held during the final lecture and will focus on static and fatigue weld design and analysis.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as design and analysis of welded connections and understanding the use of non-destructive examination methods.", "Library for research-based assignments"]}, {"course_id": 51, "course_code": "ME 540", "course_name": "ME540 - Fundamentals in Neural and Rehabilitation Engineering (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Fundamentals in Neural and Rehabilitation Engineering Fall 2024", "03:30PM - 04:20PM", "DWE 2402", "02:30PM - 03:20PM", "DWE 2402", "03:30PM - 04:20PM", "DWE 2402", "02:30PM - 03:20PM", "DWE 2402", "03:30PM - 04:20PM", "DWE 2402", "Introduction to the field of neural and rehabilitation engineering (NRE).", "Topics include describing common neurological and musculoskeletal injuries, related neural and rehabilitation engineering approaches to address disabilities, and the development of a design framework for synthesizing a novel neural and rehabilitation engineering approach.", "Critical concepts in clinical research design to meet current regulatory, ethical, and practice policies will be studied.", "Describe and apply evidence-based medicine (EBM) concepts applied to NRE.", "Evaluate and criticize existing neural and rehabilitation engineering (NRE) approaches.", "Synthesize and disseminate a novel innovation to solve a self-selected problem in NRE.", "There are 12 graduate attributes total and collection of these attributes is pertinent in ensuring our engineering programs remain accredited.", "This is an upper year elective course introducing the field of neural and rehabilitation engineering (NRE) by exposing students to the key problems and current engineering approaches.", "The first half of the course will focus on describing common neurological and musculoskeletal injuries and related NRE approaches to address disabilities.", "Subsequent classes will examine critical concepts in clinical research design to meet current regulatory, ethical, and practice policies.", "At the end of the term, students will pitch their proposal to a panel of judges, representing clinical and industry stakeholders.", "Hands-on labs will teach students the integration of mechanical, electrical, and software systems through building a soft robotic finger prosthesis along with inertial measurement units, electromyography and electroencephalography.", "1 Introduction", "4 Parkinson's Disease & Deep-Brain Stimulation", "5 Prosthetics & Myoelectric Control  Assignment 2", "6 Spinal Cord Injury & Brain-Computer Interfaces", "8 Audition & Cochlear Implants", "9 Vision & Tactile  Assignment 3", "10 Autism Spectrum Disorder & Concussion  EMG Lab Activity", "Students must email the instructor before the assignment deadline to use these grace days.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 52, "course_code": "ME 547", "course_name": "ME547 - Robot Manipulators: Kinematics, Dynamics, Control (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["E-mail: fidan@uwaterloo.ca", "E-mail", "End-of-arm sensing and outer loop control.", "The topics covered include general vector kinematics; robot vision geometry; forward, inverse, and differential robot manipulator kinematics; statics and dynamics of robot manipulators; motion and force control and sensing in robot manipulator systems.", "Understand and explain kinematic and dynamic components of robot manipulators", "Understand and design (at systems level) fundamental control and sensing mechanisms used in robot manipulator systems", "Do kinematic and dynamic design/analysis related to motion of typical robot manipulator systems", "Introduction to Robotics, Vector Kinematics", "Vector Kinematics, Forward Kinematics", "Inverse Kinematics", "Motion Control, Dynamics", "March 24", "Stadler: Analytical Robotics and Mechatronics McGraw - Hill, 1995, Reference No 35", "Craig, Introduction to Robotics - Mechanics and Control 3rd/4th Ed., Prentice-Hall, 2005/2018 No 73 / 235"]}, {"course_id": 53, "course_code": "ME 548", "course_name": "ME548 - Numerical Control of Machine Tools 1 (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 11:20AM DWE 2402", "Optimum cutting conditions.", "Laboratory work provides hands-on experience in tool path generation, machining, and measurements of cutting forces and vibration.", "This course aims to provide students with a background in the operating principles of CNC machine tools, NC part programming, CAD/CAM software, mechanics of metal cutting operations (such as turning, milling, and drilling), and the dynamic behavior of machine tools under the influence of cutting forces originating from the machining process.", "Write and interpret G-code for three-axis CNC machining.", "Model feed drives and analyze their performance based on torque and power requirements.", "Use basic control methods to tune servo drives based on time and frequency domain requirements as well as desired dimensional accuracy of produced parts.", "Understand the use of and differences between the oblique and orthogonal cutting models for describing metal cutting mechanics.", "Calculate cutting forces in three orthogonal axes for milling, turning, and drilling processes for a given set of process parameters.", "Describe and analyze multi-degree-of-freedom vibrations that occur in machine tool structures using modal analysis.", "Describe the causes of regenerative chatter in machining and predict its occurrence based on machine-tool dynamics and process parameters using an orthogonal cutting model.", "Use related software for designing and optimizing CNC operations (MasterCAM, MachPro), performing measurements on a CMM machine (MCOSMOS), and analyzing machine dynamics (tap testing with CutPro).", "Operating principles, components, and control of CNC machine tools", "Automatic NC code generation with CAD/CAM software (MasterCAM)", "Afterwards, they will write a CMM inspection program and use the CMM to measure the errors in their part.", "Orthogonal and oblique cutting", "Mechanics of milling, turning, and drilling", "Tool wear and breakage", "Selection of optimum machining conditions", "Students will measure actual cutting forces during a milling operation using a dynamometer.", "Static and Dynamic Deformations in Machining (~11 hr)", "Dimensional form errors in turning, boring, and milling", "Structural vibrations of machine tools", "Forced and self-excited (chatter) vibrations in machining", "Project 3 (7%): Modal testing and analysis of a linear motion stage.", "Students will measure the accelerance frequency response function (FRF) of a linear motion stage at 5 different points.", "Manufacturing Automation: Metal Cutting Mechanics, Machine Tool Vibrations, and CNC Design by Altintas , 2nd Edition Yes", "Some excerpts and figures from the English translation of the following lectures notes are included with the permission of Prof. Dr.-Ing.", "Further information regarding the categories of offences and types of penalties can be found in Policy #71, Student Academic Discipline.", "This course includes the independent development and practice of specific knowledge and skills, such as writing and interpreting NC-code to represent machining toolpaths, the dynamic modeling of feed drives, the analysis and design of machine tool control systems, the prediction of cutting forces, elastic deformations, and vibrations in machining, the measurement, analysis, and interpretation of multi-directional vibration properties of machine tool structures, etc. Therefore, the use of Generative artificial intelligence (GenAI) trained using large language models (LLM) or other methods to produce text, images, music, or code, like Chat GPT, DALL-E, or GitHub CoPilot, is not permitted in this class.", "Library for research-based assignments"]}, {"course_id": 54, "course_code": "ME 555", "course_name": "ME555 - Computer-Aided Design (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Computer-Aided Design Winter 2025", "02:30PM - 05:20PM", "DWE 2402", "B. Khamesee", "B. Khamesee", "E-mail: khamesee@uwaterloo.ca Office: E3-3148", "Email: yang.wang@uwaterloo.ca Office: E5-3041", "Email: b4brown@uwaterloo.ca", "Need for geometric modelling, historic developments; wire frame models; hidden line removed models; polyhedral models; surface models and solid models.", "Geometric models and the role of engineers.", "Parametric and feature-based design.", "Welcome", "This course focuses on providing a better understanding of the theory upon which CAD software is built, thereby providing an understanding of its importance, its abilities and methods that can be realized with it.", "The goal of the course is to impart an understanding that allows you to design or supervise the development of CAD models that improve the efficiency of specific mechanical design applications.", "Establishing a comprehensive knowledge base in CAD", "Grasping fundamental concepts of geometric modeling", "Proficiently employing CAD tools to create solid models", "Design or supervise the development of CAD models that improve the efficiency of specific mechanical design applications", "Lecture/Lab hours & locations", "Suggested References", "Computer Aided Design and Manufacturing - Zhuming Bi, Xiaoqin Wang, John Wiley & Sons, 2020 No", "Supplies and laptop recommendations https://uwaterloo.ca/engineering/undergraduate-students/supplies-and-laptop-recommendations No", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 55, "course_code": "ME 557", "course_name": "ME557 - Combustion 1 (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Combustion thermodynamics, introduction to chemical kinetics of combustion, combustion properties of fuels, flammability of combustible mixtures.", "Flame propagation mechanisms, pre-mixed and diffusional; stability of flames; introduction to combustion aerodynamics, jet flames; atomization; droplet and spray combustion.", "Elementary ignition concepts and theory.", "Basic detonation theory.", "to provide the basic concepts of combustion", "to apply these concepts to solve practical problems", "to develop a systematic methodology for the solution of practical problems", "• Calculate the temperature and compositions (for both major and minor species) in the combustion gas mixture, the amount of energy released during combustion process, and the amount of harmful emissions formed/released during/from combustion process", "• Analyze the rate of fuel consumption and rate of heat release during combustion process", "• Describe the different modes of combustion (detonation, deflagration, premixed flames and diffusion flames), ignition and extinction phenomena", "• Understand how pollutant emissions are formed and could be controlled in a combustion process/device/system", "Introduction to chemical kinetics (Chaps 4 and 5)                                                6", "Conservation equations and transport phenomena (Chaps 3, 6 and 7)                1", "Ignition and extinction                                                                                           4", "An Introduction to Combustion, Concepts and Applications. 4th", "Exams will be given in class in-person.", "Exams will be close book and close lecture note; but crib sheet (double-sided letter-sized) is allowed:", "Other allowed items: pens/pencils, erasers and a simple calculator without memory/programmable functionalities.", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 56, "course_code": "ME 559", "course_name": "ME559 - Finite Element Methods (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Finite Element Methods Fall 2024", "03:30PM -", "DWE 2402", "Email: kinal@uwaterloo.ca", "Name: Johann Barry Scheepers", "Email: jbscheepers@uwaterloo.ca", "A course presenting the fundamental ideas involved in conventional finite element analysis in mechanical engineering.", "Interpret the philosophy behind principles, design and modelling considerations in using the finite element method (FEM).", "Derive the equations of motion from interpretations of various physical systems (trusses, beams, plates, etc.)", "Obtain analytical solutions to simple finite element problems (e.g., static truss networks).", "Develop an understanding of commercial finite element software packages (ANSYS, ABAQUS, etc.) for use in linear-elastic equilibrium problems and modal analyses.", "Communicate the most important methods, results and conclusions in a brief technical report.", "- Concept of stiffness analyses for simple spring systems", "- direct equilibrium approach", "- application of boundary conditions", "- solution of linear algebraic equations", "- discretization and interpolation", "- element stiffness equations using virtual work formulation", "- assembly into global stiffness equations", "- boundary conditions and solution", "- post-processing for strain and stress", "- higher order elements", "- meshing practice", "- convergence studies", "- imperfection analyses", "- solvers", "Thermal and fluid flow analysis:", "Basic Introduction No", "Advanced No"]}, {"course_id": 57, "course_code": "ME 561", "course_name": "ME561 - Fluid Power Control Systems (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Fluid Power Control Systems Fall 2024", "DWE 2402", "DWE 2402", "Email: jnorakwe@uwaterloo.ca", "Email: amiclaus@uwaterloo.ca", "Email: zhhmears@uwaterloo.ca", "Design and function of conventional hydraulic and pneumatic circuits.", "Speed control in fluid power circuits.", "Performance of pumps and fluid motors.", "Hydrostatic and hydrokinetic transmission systems.", "Principles of sealing, filtration and heat control in hydraulic circuits.", "Industrial applications of fluid power systems.", "Understand the basic theory of fluid power", "Distinguish hydraulic and pneumatic components, circuits, and systems", "Design, analyze, and implement control systems for real fluid power systems, and gain hands-on experience in doing so", "Understand the concepts and fundamentals of electrohydraulic and electropneumatic systems and applications of PLC to fluid power control systems", "Chapter 1: Basics of Hydraulic Systems   [", "Chapter 2: Losses in Hydraulic Systems   [", "Chapter 7: Design of Hydraulic Circuits   [", "Chapter 8: Pneumatic Circuit Components and Design of Pneumatic Circuits   [", "Chapter 9: Modeling and Control of Hydraulic Systems   [", "Chapter 10: Design of Electrohydraulic / Electropneumatic Systems and Application of Digital Control (PLC)", "Fluid Power with Applications, by Anthony Espositi Optional Textbook (available in the UW Library)", "Simulation Software", "there for further reading for those interested in learning beyond what is covered in lectures and course", "Multiple editions are available in the library; all editions are almost identical.", "Festo FluidSim 6 simulation software will be used for the in-person hydraulic and pneumatic labs.", "Assignment 3, Circuit Design and Modeling of Hydraulic Systems (7.5%)", "Notice of Recording", "If you choose not to be recorded, this notice serves as confirmation of your understanding that such recordings can be viewed later.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 58, "course_code": "ME 562", "course_name": "ME562 - Experimental Methods in Fluids (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Experimental Methods in Fluids Winter 2024", "10:30AM - 11:20AM DWE 2402", "Office: E3-3153", "Email: ctoppings@uwaterloo.ca", "Office: E3-3152", "Email: n5liu@uwaterloo.ca", "It covers the following topics: experimental facilities and techniques for measurements in fluid flows, flow visualization, identification of appropriate tools for experimental assessment, planning of experiments, laboratory experiments, data acquisition, analysis of experimental results and uncertainty estimation.", "This course will rely on fundamental topics in theoretical and applied fluid mechanics covered in ME 351: Fluid Mechanics 1 and ME 362: Fluid Mechanics 2. Competence with these prerequisite materials will be essential.", "In addition, the course relies on a solid background in basic science and core engineering subjects, including calculus, physics, continuum mechanics, thermodynamics, and basic engineering design.", "Since we will not be able to allocate time to review all these concepts in this course, please be sure to review the relevant topics.", "Interpret experimental results and examine their limitations using error analysis.", "Chapters", "Experimental Planning", "Fluid mechanics fundamentals", "Experimental modelling", "Basic measurement systems", "Experimental uncertainty", "Basics of Measurement Systems", "Data Acquisition", "3. Data Analysis", "Examination of Data", "Basic Statistics", "Field and Lab Facilities", "Experimental Techniques", "Measurements in Fluid Mechanics Tavoularis, S. Cambridge University Press, 2005 No", "Springer Handbook of Experimental Fluid Mechanics Editors: C. Tropea, A.L. Yarin, F. Foss, Springer, 2007 No", "You must familiarise yourself with these procedures before operating the associated laboratory facilities and equipment.", "Students will plan their experiments, select and apply different experimental tools, and analyze their experimental data to estimate the desired performance parameters of a given engineering system.", "Accommodations related to assessment due dates will be handled on a case-by-case basis.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 59, "course_code": "ME 563", "course_name": "ME563 - Turbomachines (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["09:30AM - 10:20AM DWE 2402", "Questions of a personal nature", "Your instructor checks email and the Ask the Instructor discussion topic* frequently and will make every effort to reply to your questions within 24 hours, Monday to Friday.", "My research focus is Wind Energy (mostly aerodynamics and aeroacoustics but many related areas).", "I have added a picture of a group of us at our wind turbine test site and you can find out more about what I do at http://windenergy.uwaterloo.ca/ .", "I am really looking forwardto our time together!\"", "Basic equation of flow in turbomachines, compressible flow.", "Energy transfer in radial and axial turbomachines, performance characteristics, losses, and efficiencies.", "The course will progress from specifying a machine for a system through dimensionless parameters, the Euler turbomachine equations, 1 D flow paths to 2D and complex flow analysis.", "Understand the terminology, general flow paths, and describe the physical layout of common turbomachinery Determine system behavior for an incompressible system (pipes or ducts) and specify machine requirements", "Describe important dimensionless groups common in turbomachinery and utilize them to characterize machines Apply dimensional analysis techniques to determine performance parameters", "Comprehend concepts of 1st and 2nd law of thermodynamics, Angular Momentum, moment of momentum, and efficiency to analyze flow paths for turbomachines", "Develop 1D Velocity diagrams, and apply the Euler turbomachine equation to performance analysis", "Comprehend some basic aerodynamics to understand wind turbine energy extraction", "Discussions", "Introduction Terminology, general flow paths, physical layout", "Dimensional Analysis Important dimensionless groups, performance parameters", "*(Content coverage during that week will be given on LEARN)", "References", "Fluid Mechanics, any edition, White, F.M., McGraw-Hill, Toronto some chapters No 109.95", "Fluid mechanics and Thermodynamics of Turbomachinery 6th ed Dixon, S. L., Boston BH 2010 ONLINE at UWaterloo Library No", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 60, "course_code": "ME 564", "course_name": "ME564 - Aerodynamics (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM DWE 2402", "Questions of a personal nature", "Office: E3 3101B", "MME Department: Current Students", "Students should communicate with the teaching team and university staff in a professional manner.", "Kinematics and dynamics of inviscid flow; airfoil dynamics including thin airfoil theory, finite wings, panel methods and airfoil parameters.", "Boundary layer theory and boundary layer control as applied in aerodynamics.", "Introduction to high speed aerodynamics.", "Introduction to dynamics of flight including stability and control.", "Apply thin airfoil theory to estimate airfoil performance", "Design and optimize the profile of wings and rotor blades", "Describe strategies to improve airfoil performance", "Understand the role of aerodynamics in engineering design", "The following is a general outline of the course:", "Introduction & Review of ME 351, ME 362", "Aerodynamic forces", "Separation and Stall", "Airfoil Profile Selection", "Vortex sheet", "Design Project #1", "Rotor Design", "Design considerations", "Aircraft Design", "Stability", "Performance & Design considerations", "Design Project #2", "Exam Period", "Fluid Mechanics, 9th edition, White, F.M., McGraw-Hill (OR earlier edition)", "A summary of required and recommended supplies for Faculty of Engineering students can be found here:", "Design Project 1 10%", "Design Project 2 10%", "Design Projects", "The midterm exam will assess student comprehension of the material covered in the first half of the course.", "This assessment must be done individually and will be a closed book examination.", "This assessment must be done individually and will be a closed book examination.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 61, "course_code": "ME 566", "course_name": "ME566 - Computational Fluid Dynamics for Engineering Design (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Computational Fluid Dynamics for Engineering Design Fall 2024", "01:30PM - 03:20PM", "DWE 2402", "Current lecture delivery plans", "All lectures will be recorded and made available on Learn, unless there is a technical issue preventing the recording.", "A course to develop the understanding required to simulate complex fluid flows, such as those found in turbo-machines, duct systems, and other engineering hardware.", "Course topics include the physics of complex viscous fluid flows, first- and second-order finite control volume discretization methods, iterative algorithms for the solution of sparse matrix equation sets, including multi-grid acceleration, boundary condition modelling, two-equation and Reynolds stress turbulence models, and grid generation techniques.", "Computational fluid dynamics software is used throughout the course to simulate and analyze complex fluid flows relevant to engineering applications.", "Introduce the major approximations implied in CFD analysis of complex turbulent flows and the methods for controlling the resulting errors.", "Develop a familiarity with the steps required to complete a flow analysis project: (c) Communicate the findings of a CFD analysis in a complete and concise report", "Develop an enriched understanding of the physics of complex fluid flows: (a) Analyze a simulated or measured flow field to determine the most significant flow processes using quantitative analysis [", "Introduce the major approximations implied in CFD analysis of complex turbulent flows and the methods for controlling the resulting errors: (a) Describe the basic computational methods used to obtain a solution and the relationship between CFD model specification and the CFD simulation", "Develop an enriched understanding of the physics of complex fluid flows: (a) Analyze a simulated or measured flow field to determine the most significant flow processes using quantitative analysis [", "Develop an enriched understanding of the physics of complex fluid flows: (c) Select an optimal flow design from a set of flow design alternatives", "Develop an enriched understanding of the physics of complex fluid flows: (b) Identify how the significant flow processes impact flow design performance", "Introduce the major approximations implied in CFD analysis of complex turbulent flows and the methods for controlling the resulting errors: (b) Generate a CFD simulation.", "(c) Evaluate a CFD simulation to determine the sensitivity of the simulation to the model components and parameters", "Introduce the major approximations implied in CFD analysis of complex turbulent flows and the methods for controlling the resulting errors: (c) Evaluate a CFD simulation to determine the sensitivity of the simulation to the model components and parameters.", "1.3 Application to a simple pipe network", "1.4 Role of goal in CFD simulation process", "2.2 Boundary conditions", "2.3 Tutorial", "The Governing Equations of Fluid Dynamics", "3.1 Flow kinematics", "3.2 Conservation of mass", "3.3 Conservation of momentum", "3.4 Generic form of governing equations", "4.1 1-D steady-state diffusion", "4.2 Example", "5. Convection-Diffusion problems", "5.1 steady 1-D equation - no source", "5.3 Upwind Differencing Scheme", "Solution of discretized equations", "6.1 Direct methods", "6.2 Indirect methods", "6.3 Multigrid methods", "7.1 Implicit vs Explicit scheme", "7.2 Implicit Scheme", "7.3 Explicit Scheme", "Turbulence models", "8.2 Reynolds averaged Navier Stokes equations", "8.3 Eddy viscosity models", "8.4 Wall corrections", "8.5 Advanced models", "An Introduction to Computational Fluid Dynamics: The Finite Volume Method, 2nd Edition, H.K. Versteeg and W. Malalasekera, 2007, Pearson Prentice Hall.", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as learning a new CFD package and in-depth understanding of the models and numerical methods with their limitations used in CFD.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 62, "course_code": "ME 567", "course_name": "ME567 - Fire Safety Engineering (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Fire Safety Engineering Winter 2025", "08:30AM - 09:20AM", "DWE 2402", "Fundamentals of fire behaviour, fuels and flammability, heat transfer and fluid dynamics of fires and fire modelling.", "Practical issues and applications of fire safety, fire control and hazard assessment in the design of buildings, industrial environments, and transportation systems.", "Understand theory and practical considerations related to fuels and flammability, heat transfer and fluid dynamics of fires, ignition, fire spread and plume development.", "Be able to apply key fundamental engineering concepts to practical issues and simplified applications in fire safety, fire control and hazard assessment.", "Have an introductory understanding of fire modeling, fire growth in compartments, fire suppression and principles of risk assessment applied to fire hazards.", "Dougal Drysdale, “An Introduction to Fire Dynamics”, 3rd edition, John Wiley and Sons, Toronto Earlier edition can be used but Table and page numbers may be different).", "Other on-line chemical/thermophysical property data tables and sources.", "Text matching software may be used on very rare occasions to screen case studies and independent research projects in this course.", "This is being done to verify that use of all material and sources in case studies and independent research projects is properly documented.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 64, "course_code": "ME 572", "course_name": "ME572 - Building Energy Analysis (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Building Energy Analysis Fall 2024", "Introduction to whole-building energy analysis.", "Energy auditing, benchmarking, and simulation.", "Review of relevant concepts in heat transfer and thermodynamics, including introductory psychrometrics.", "Economic and environmental impacts of building energy use.", "The course is intended to help students develop knowledge and skills that will be useful in analyzing and diagnosing the energy use of buildings, with the general objectives of reducing environmental, economic, and social impacts of energy use.", "Topics will be presented from a multi-disciplinary perspective, as the design, construction, and operation & maintenance of buildings are all multi-disciplinary endeavors.", "Relevant concepts in thermodynamics and heat transfer will be reviewed.", "Selected building systems and components will be studied, including aspects of building envelope, lighting, and HVAC systems.", "Apply basic energy calculations to a variety of components and systems impacting building energy use.", "2. Apply simple analysis techniques in building energy auditing and simulation.", "Apply basic calculations to assess impacts of building energy use (e.g. economic cost, GHG emissions).", "Criteria for accreditation include expectations that graduating students will be generally capable of demonstrating certain attributes.", "Indicator", "Knowledge Base (1c) Demonstrate understanding of specialized engineering knowledge.", "D", "D", "D", "D", "D", "D", "D", "Impact of Engineering (9b) Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "D", "Introduction & Fundamentals", "Energy Analysis Fundamentals", "Energy Auditing, Benchmarking, & Re-tuning", "Simple Heating System: Design & Analysis", "Load Duration Curve", "2. Building Components & Systems", "Interior Lighting Systems", "Aspects of 1-D Heat Transfer", "Building Envelope", "Aspects of Simple HVAC Components & Systems", "3. Aspects of Building Energy Simulation", "Aspects of Whole-Building Energy Simulation", "Application of Simulation Results in Design", "Careful review of the course notes and completion of the practice problems should be viewed as key activities to help you develop understanding of the course material and prepare for tests/exams.", "Some projects may be completed in small groups.", "P1 Small Building Re-Tuning", "P2 Lighting System Analysis", "P3 Building Envelope Analysis", "P4 Whole-Building Energy Simulation", "eQUEST", "Please consider that the personal traits and habits that you develop during your education are carried forward into your career.", "Those who find ways to justify “taking short-cuts” as they pursue their education may be unintentionally training themselves do the same in their careers.", "Unfortunately, engineers who have “taken short-cuts” have been responsible for many disasters and failures."]}, {"course_id": 65, "course_code": "ME 573", "course_name": "ME573 - HVAC Systems, Equipment, and Energy Efficiency (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "HVAC Systems, Equipment, and Energy Efficiency Winter 2025", "Selected topics in HVAC systems design with focus on energy-efficiency and environmental-sustainability.", "Heating and cooling distribution using air-, water-, and refrigerant-based systems.", "Constant- and variable-flow systems.", "Heat- and energy-recovery systems.", "Vapour-compression refrigeration and heat-pump systems (including air- and geothermal-source heat pumps).", "Selected topics in HVAC systems design, with focus on energy-efficiency and environmental-sustainability: heating and cooling distribution using air-, water-, and refrigerant-based systems; constant- and variable-flow systems; heat- and energy-recovery systems; vapor-compression heat-pump systems, including air-and geothermal-source heat pumps.", "Course Overview: Achieving significant reductions in building energy consumption will be important in efforts to deal with the environmental and socioeconomic impacts of energy use.", "The energy used by heating, ventilating, and air-conditioning (HVAC) systems represents a large portion of the energy consumption of most commercial, institutional, and residential buildings.", "This course will introduce selected topics in HVAC systems design, with focus on energy-efficiency and environmental-sustainability: heating and cooling distribution using air-, water-, and refrigerant-based systems; constant- and variable-flow systems; heat- and energy-recovery systems; vapor-compression heat-pump systems, including air- and geothermal-source heat pumps.", "Recommended Preparation: It is strongly recommended that students have engaged in prior study of introductory concepts in thermodynamics, heat transfer, and fluid mechanics, including analysis of refrigeration cycles and basic psychrometrics.", "Students without this background are expected to undertake additional study to acquire sufficient competency in each topic.", "Perform simple thermodynamic calculations for selected HVAC components and systems.", "2. Explain operational characteristics of selected energy-saving strategies for HVAC systems.", "3. Assess the potential for selected energy-saving strategies to operate effectively for a variety of operating conditions and applications.", "Criteria for accreditation include expectations that graduating students will be generally capable of demonstrating certain attributes.", "Indicator", "Knowledge Base (1c) Demonstrate understanding of engineering fundamentals.", "D", "(1d) Demonstrate understanding of specialized engineering knowledge.", "D", "D", "D", "D", "D", "Impact of Engineering (9b) Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "D", "Section", "Introduction", "Review of selected fundamental concepts.", "Considerations for equipment selection.", "3. Variable-Flow Hydronic Systems", "Closed-loop hydronic systems.", "Constant- and variable-flow systems.", "4. Aspects of Ventilation Systems", "Air-to-air energy recovery systems.", "4. Aspects of Ventilation Systems (cont'd)", "System considerations with AAER equipment.", "Heat-Pump Systems and Equipment", "Simple and modified refrigerant cycles.", "Air- and water-source systems.", "Simultaneous heating/cooling systems.", "Useful References:  i) the ASHRAE Handbooks can be accessed through the university library via the Knovel database; ii) the CIBSE applications manual “AM17 Heat Pump Installations for Large Non-Domestic Buildings (2022)” (free pdf) is an excellent reference for many concepts covered by this course; iii) for a textbook covering general aspects of HVAC design & analysis, consider: “Heating and Cooling of Buildings: Principles and Practice of Energy Efficient Design (Third Edition)”, by T.A. Reddy et al.. CRC Press, 2016.", "Notice of Recording", "Please consider that the personal traits and habits that you develop during your education are carried forward into your career.", "Those who find ways to justify “taking short-cuts” as they pursue their education may be unintentionally training themselves do the same in their careers.", "Unfortunately, engineers who have “taken short-cuts” have been responsible for many disasters and failures."]}, {"course_id": 66, "course_code": "ME 574", "course_name": "ME574 - Engineering Biomechanics (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Biomechanics Winter 2025", "02:30PM - 05:20PM", "RCH 301", "Introduction to engineering technologies applicable to the field of biomechanics.", "Specific topics covered may include biological growth, form and function; biomaterials; kinematics and neurology of gait; biotribology; joint anatomy, function and repair; occupational biomechanics; trauma prevention.", "The course will provide a general overview of engineering biomechanics for civil, mechanical and biomedical engineering students.", "2. Conduct gait analysis and calculate forces applied at joints and foot reactions", "Introduction", "Evolution of Biomechanics", "Applications (medical and engineering)", "Musculoskeletal System", "Introduction,", "Anatomical positions & movements,", "System components,", "Gait Biomechanics", "Introduction;", "Muscles forces,", "Bone & Cartilage Biomechanics", "Introduction (highlights & progress),", "Bone mechanical properties & applications;", "Cartilage structure and mechanics", "Tendon & Ligament biomechanics", "Mechanical behaviour", "Biotribology & Joint Replacement", "Biotribology subfields,", "Cancer Biomechanics", "Introduction: cancer stages,", "Mechanical characteristics of cancer cells,", "Biomechanics and cancer treatment,", "Cardiovascular biomechanics, and", "Biomechanics in Radiotherapy", "“Orthopaedic Biomechanics: Mechanics and Design in Musculoskeletal Systems,” Pearson Prentice Hall.", "Biomechanics and motor control of human movement.", "Biomechanics and motor contAl-Mayah, A. (Ed.)"]}, {"course_id": 67, "course_code": "ME 595", "course_name": "ME595 - Special Topics in Mechanical Engineering (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Me 595 Wind Energy Fall 2024", "DWE 2402", "Office location E3 2135D", "Your instructor checks email and the Ask the Instructor discussion topic* frequently and will make every effort to reply to your questions within 24 hours, Monday to Friday.", "Special Topics in Fluid Mechanics (Wind Energy)", "This course will attempt to survey the wind energy field with a particular emphasis on the fluid mechanic and aerodynamic aspects of wind energy.", "The focus for this course is to give a good general background and then concentrate more on the mechanical engineering aspects.", "Develop an understanding of wind energy development in Canada", "Develop an understanding of a wind resource analysis", "Understand the origin and variation in global wind patterns", "Gain some basic knowledge of meteorology and the impact on wind resource", "Describe typical instruments used in wind resource measurement", "Estimate wind resource using statistical tools", "Gain understanding of basic concepts in aerodynamics", "Gain understanding how lift and drag of airfoils influence wind energy", "Develop a prediction of wind turbine blade performance based on airfoil selection", "Design a basic wind turbine blade using a simplified BEM approach", "Understand the source of noise in wind turbines", "Review current standards for noise emissions", "Use models to predict noise from a single turbine", "2 Wind as an Energy Source Boundary layers, measurements", "9 Aerodynamics Basic concepts in aerodynamics", "10 Aerodynamics BEM Basic wind turbine blade using a simplified BEM approach 4", "12 Design and Measurement Basic control ideas, Standards", "There will be a mixture of question formats including multiple choice, short answer and short calculation questions.", "This course includes the independent development and practice of specific skills, such as engineering report writing, engineering design and analysis.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 68, "course_code": "ME 596", "course_name": "ME596 - Special Topics in Mechanical Engineering (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Special Topics in Mechanical Engineering Fall 2024", "Email: yimin.wu@uwaterloo.ca", "Applications for nano-, and micro-electro-mechanical systems (MEMS) devices and their functionalization.", "Week Number Beginning Monday Topics", "2 Sept 9 Lecture: Nano and Micro-Electro-Mechanical Systems (N/MEMS) Devices and Nano and Micro Systems Lab", "3 Sept 16 Lecture: Introduction and Fabrication", "Principles of Electronic Materials and Devices Principles of Electronic Materials and Devices, S.O. Kasap, McGraw Hill, 3rd edition, 2006 No"]}, {"course_id": 69, "course_code": "ME 597", "course_name": "ME597 - Special Topics in Mechanical Engineering (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Special Topics in Mechanical Engineering Winter 2025", "04:00PM - 05:20PM", "DWE 2402", "E3 3178", "This course covers four fundamental topics of Autonomous Mobile Robotics; 1) modeling, 2) sensors and perception, 3) estimation (localization and mapping), 4) planning and navigation.", "Sensors include various types and algorithms (for vision and range sensors).", "Estimation includes Bayesian estimation theory and its application to localization (and/or mapping).", "Topics in Planning include odometry motion models and graph-based and probabilistic motion planning as well as obstacle avoidance (reaction-based) methods.", "Develop fundamental understanding of essential components for autonomous mobile robotics", "Understand motion and measurement models for a large variety of vehicles and sensors.", "Understand localization/mapping algorithms for perception within environments.", "1/7,9 Course introduction, coordinate systems and transforms in 2D", "Vision sensors and basics of image processing for mobile robots", "2/11,13 Discrete odometry motion models, probability reviews", "3/4,6 Nonparametric filters and Monte Carlo localization, mapping", "3/11,13 Introduction to path planning, graph construction", "3/18,20 Graph-based planning algorithms (deterministic/probabilistic)", "4/1,3 Navigation and advanced topics", "LP] Kevin Lynch & Frank Park, Modern Robotics: Mechanics, Planning and Control, The Cambridge University Press A free preprint can be downloaded from https://hades.mech.northwestern.edu/index.php/Modern_Robotics No", "The first book is mostly related to modeling/kinematics part of the course", "The second book is largely related to visual-based robotic perception as well as planning sections of the course", "A free preprint for the first book can be downloaded from https://hades.mech.northwestern.edu/index.php/Modern_Robotics", "The in-person prelab will be held in Week 3 (a week before the first lab) to go over system setup.", "③ Lab#1 (Week 4) – Sensor data processing", "Analytical problems and coding (mostly with Matlab).", "Exams", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Library for research-based assignments"]}, {"course_id": 70, "course_code": "ME 598", "course_name": "ME598 - Special Topics in Mechanical Engineering (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Special Topics in Mechanical Engineering - Composite Materials: Introduction, Fabrication and Design Winter 2025", "02:30PM - 05:20PM", "DWE 2402", "Email: john.montesano@uwaterloo.ca", "Part III of the course will focus on design of FRP laminated composite materials and structures where theory from Parts I and II will be applied.", "Understand various manufacturing processes for FRP composite materials and the influence of processing cycle parameters on potential defects", "Apply classical lamination theory to determine stresses and deformations of laminates", "Design laminated FRP composite materials and corresponding components/structures to perform an intended function", "Materials Science and Processing of FRPs", "Introduction", "- Advantages and disadvantages", "- Applications of FRPs", "- Fibers: reinforcement types/form", "- Matrix: polymer properties, types of polymers", "- Role of each phase", "- Overview of processing methods for composite parts", "Mechanics of FRPs", "- Stress tensors, strain-displacement relations", "- Material anisotropy", "- Computing mechanical properties and strength of FRP lamina", "- Continuous and discontinuous FRPs", "-", "Mechanical Testing", "- Mechanical property evaluation", "- Testing standards, test apparatus", "- Predicting the response of lamina", "Mechanics of Laminates", "- Generalized plate theory", "- Classical lamination theory", "Design of FRPs", "Designing laminates", "- Effective properties of laminates", "- ABD matrices, influence of stacking sequence", "Designing FRP parts", "- Design process guidelines", "**Slides and supplementary materials to be posted on LEARN", "Analysis and performance of fiber composites, 4th edition.", "Stress analysis of fiber-reinforced composite materials.", "Design Project 40%", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 71, "course_code": "ME 599", "course_name": "ME599 - Special Topics in Mechanical Engineering (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Special Topics in Mechanical Engineering Winter 2025", "DWE 2402", "DWE 2402", "Introduction to the principle and operation of various types of fuel cells (such as alkaline, proton exchange membrane, phosphoric acid, molten carbonate, solid oxide, and direct methanol fuel cells).", "Configuration of individual cell, stack and fuel cell system.", "Introduction to electrochemical kinetics.", "Transport-related phenomena and conservation equations for reacting multi-component systems.", "Fuel cell system design, optimization and economics.", "To introduce the principles and operations of hydrogen technologies including various types of fuel cell systems.", "To evaluate the effect of different operation parameters and design considerations on fuel cell performance, durability, and cost.", "To develop a fundamental understanding of the thermodynamic, electrochemical kinetics, and transport processes governing fuel cell system operation", "To develop the problem-solving skills related to hydrogen technologies that required in real world applications", "Chapters", "Introduction and basics of fuel cells", "Thermodynamics analysis of fuel cells", "Introduction of electrochemical kinetics", "Transport phenomena/conservation equations/modelling Fuel cellsystem design, optimization and economics", "Molten carbonate fuel cells(MCFCs)", "Fuel processing/Direct methanolfuel cells", "Total", "Principles of Fuel Cells No", "Edition1st Edition", "First Published2005", "eBook Published21 December 2005", "DOIhttps://doi.org/10.1201/9780203942338", "SubjectsEngineering & Technology, Mathematics & Statistics", "Notice of Recording"]}, {"course_id": 72, "course_code": "MTE 420", "course_name": "MTE420 - Power Electronics and Motor Drives (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Power Electronics and Motor Drives Fall 2024", "10:00AM - 11:20AM DWE 2402", "11:30AM - 12:20PM DWE 2402", "E-mail: mkazerani@uwaterloo.ca", "Analysis, design and control of power electronic converters, principles of operation and control of DC and special-purpose motors, power electronics-based control of DC and special-purpose motors.", "This course covers a wide range of materials on power electronic and motor drives, including terminal characteristics of power semiconductor devices, switch losses, power electronic converter topologies (diode rectifiers, thyristor converters, DC/DC converters and DC/AC converters) and their corresponding control techniques, waveform quality, L-C low-pass filter design, power factor correction, DC motors and their corresponding speed control and electrical braking techniques, Induction motors and their corresponding speed control and electrical braking techniques, special-purpose motors, and computer simulation of power electronic converters and motor drives.", "Describe terminal characteristics of power semiconductor devices; Select a proper switch for a given application", "Calculate switch losses as the first step in identifying thermal management requirements", "Describe structure and analyze operation of diode rectifiers, thyristor converters, DC/DC converters and DC/AC converters", "Design DC/DC converters and DC/AC converters", "Describe and implement control techniques for DC/DC converters and DC/AC converters", "Design L-C low-pass filters for power electronic converters", "Describe the concept of power factor correction (PFC) and a well-known PFC technique", "Describe the structure, speed control and electrical braking techniques of DC motors", "Describe the structure, speed control and electrical braking techniques of induction motors", "Describe the structure and basics of control of special-purpose motors", "Simulate power electronic converters and motor drives using PSIM (a commercial software tool for simulation of power electronic systems)", "Introduction to power electronics (Introduction, Application areas, Application examples)", "Waveform Quality (Harmonic distortion and EMI caused by power converters, Waveform quality indices, Power factor correction, Input and output low- pass L-C filter design)", "IGBT and IGCT, Introduction to Wide-Bandgap devices, Switch losses)", "Analysis, design, modulation techniques and applications of power converters (Diode rectifiers, Thyristor converters, Switch-mode DC-to-DC converters, Switch-mode DC-to-AC converters (Inverters), Modulation Techniques: Hysteresis, Pulse Width Modulation (PWM) and Selective Harmonic Elimination, Applications: Switch-mode power supplies, Variable Speed Drives, Grid Interfacing of Distributed Generation, Power Factor Correction, Active power filters)", "Electric Motors and Motor Drives (Structures, principles of operation and control of DC motor, Induction Motor, and Special-Purpose Motors)", "Textbooks and References"]}, {"course_id": 73, "course_code": "MTE 421", "course_name": "MTE421 - Linear and Nonlinear Electronics (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Introduction to Analog and Digital Transistor-Level Design Fall 2024", "DWE 2402", "DWE 2402", "A detailed study of operational amplifier circuits.", "A detailed study of stability and compensation for multistage and operational amplifiers.", "Introduction to common circuit blocks; A/D (analog-to-digital) converters, D/A (digital-to-analog) converters, and phase-locked loops.", "View requirements for MTE 421", "An introduction to analog transistor-level circuits, including metal-oxide-semiconductor (MOS) single, differential, and multistage amplifiers, cascode configurations, current mirrors, active loads, and frequency limitations.", "An introduction to digital transistor-level design, including MOS static and dynamic behavior, complementary MOS (CMOS) inverters, combinational and sequential circuit design, arithmetic circuits, and clocking and timing considerations.", "Students complete a project using industry standard integrated circuit schematic and layout tools.", "Design digital circuits at the transistor level", "Minimize delays in transistor-level digital circuits", "Create DRC-free layouts (no design rule violations) of digital transistor-level circuits", "Analyze a multistage MOSFET amplifier circuit to determine its figures of merit", "Design a multistage MOSFET amplifier circuit based on given requirements", "I plan to cover parts of the following chapters from the Sedra/Smith textbook: 5, 7, 8, 9, 10, 11, 16, and 17", "Lectures 3 and 4 - Small-Signal Models and Single-Stage Amplifiers (S/S Chapter 7)", "Lectures 9 to 11 - Differential Amplifiers (S/S Chapter 9)", "Notice of Recording", "If this happens, I will communicate instructions in advance over LEARN.", "Collaboration vs. Plagiarism", "I encourage you to interact with other students to get to know the Cadence software and its particularities."]}, {"course_id": 74, "course_code": "MTE 460", "course_name": "MTE460 - Mechatronic System Integration (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Mechatronic System Integration Fall 2024", "08:30AM - 09:50AM DWE 2402", "03:30PM -", "Email: eugene.li@uwaterloo.ca", "Email: hisham.khalil@uwaterloo.ca", "Responses can be expected within 1-2 hours during Monday-Friday 8:30 - 4:30.", "Responses times outside of this time frame cannot be guaranteed.", "Response should be primarily conducted through email.", "Mechatronic system interfaces and architecture design.", "Sensing and actuation in industrial mechatronics systems.", "Discrete and hybrid control systems.", "The focus of this course is to understand the mechanisms and systems used in Industrial Mechatronic Systems and how to leverage them to build and develop industrial Internet of Things (IIoT) devices.", "Students will be provided a high level review of mechatronic components and then taught how to integrate mechatronic devices using traditional methods.", "Complete mechanical, electrical and system level designs of industrial mechatronic systems", "Implement low level control, distributed control and supervisory control techniques", "Implement network communication protocols for industrial mechatronic systems", "Detect and correct faults in mechatronic systems", "Design industrial internet of things (IIoT) devices", "Introduction to Mechatronic System Integration in context of industrial automation", "In this topic we would introduce the different sub-systems in a Mechatronic System and how they fit into the context of Industrial Automation.", "A brief discussion of typical industrial systems and their components occur to provide context for the decision being made", "Specific attention will be made on how to isolate specific functions of an industrial system and how to test these functions", "System Architecture Design", "In this section we will discuss the functional design specifications and how they relate to the operation of a mechatronic system.", "PLCs and Distributed Control", "In this section we will take an in-depth look at PLCs and Distributed control.", "We will review ladder logic, but also discuss other PLC programming methods such as structured text, functional block diagram (FBD), sequential function charts and other aspects of the IEC 61131-3 standard", "Electrical Sensors and Safety Systems", "In this section we will review many common electrical sensors and how they are integrated into the industrial automation system.", "This includes discrete IO, analog IO and other electrical safety systems", "Mechanical design and specification", "A discussion of the different mechanical components that are used in industrial automation as well as relevant standards.", "Specific attention will be paid to how these components are specified to achieve system criteria.", "Motors, Actuators and motion control", "In this section we will begin with a brief review of various motors and actuators as well as motion control methods.", "Power Systems", "Textbook Chapters: DCIA 3.3", "In this section we will explore power distribution in the context of industrial automation.", "This discussion will focus on the types of power distribution panels and the connection methods.", "Topics will also include conversion from AC to DC, high power to low power and other electrical safety interlock systems.", "Edge Connected Devices", "This section will investigate what is needed to develop edge connected devices and what design considerations must be made to ensure they are implemented effectively", "References", "IPAC – Industrial Process Automation System: Design and Implementation, Mehta, B. R ; Reddy, Y. Jaganmohan", "PIAS – Programming Industrial Automation Systems, Karl-Heinz John, Michael Tiegelkamp", "This lab will provide students an opportunity to review past PLC concepts such as sensor integration and basic motor control and familiarize themselves with the lab hardware", "Distributed system control", "In this lab we will aim to control multiple conveyor belt systems through PLC hardware and network communication protocols.", "The focus of this lab will be to implement control algorithms over multiple layers of networks", "Lab 0 Sept 4-Sept 11 This first week is a chance for groups to investigate the lab equipment.", "The purpose of the assignments is to test the students understanding of larger concepts that are not feasible in a lab, but relevant to complete understand of mechatronics integration.", "Safety and Power Systems", "Through these assignments, the students will be tasked with designing and specifying components and integrating them in 3D modelling software without physically manufacturing large components.", "Following the completion of the labs the students will be given the opportunity to select a project topic from a list of problems and propose a solution to said problem.", "Projects will be completed in groups of 3.", "Abstract", "Introduction", "Identified solution", "Solution verification", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 75, "course_code": "MTE 544", "course_name": "MTE544 - Autonomous Mobile Robots (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "yue.hu@uwaterloo.ca", "11:30AM - 12:20PM E5 3102", "E3 3178", "yue.hu@uwaterloo.ca", "E3 3178", "yue.hu@uwaterloo.ca", "E3 3178", "yue.hu@uwaterloo.ca", "08:30AM - 11:20AM E3 3178", "yue.hu@uwaterloo.ca", "Location: E5 - 3102", "Fundamentals of autonomous mobile robotics, including both perception and planning for autonomous operation, sensor modelling, vehicle state estimation using Bayes Filters, Kalman Filters, and Particle Filters as well as onboard localization and mapping.", "Topics in planning include vehicle motion modelling and control, as well as graph based and probabilistic motion planning of (Micro Electro Mechanical Systems) MEMS devices.", "This course covers four fundamental topics of Autonomous Mobile Robotics; 1) modeling, 2) sensors and perception, 3) estimation (localization and mapping), 4) planning and navigation.", "Modeling covers kinematic models of various types of wheeled mobile robots.", "Sensors include various types and algorithms (for vision and range sensors).", "Estimation includes Bayesian estimation theory and its application to localization (and/or mapping).", "Topics in Planning include odometry motion models and graph-based and probabilistic motion planning as well as obstacle avoidance (reaction-based) methods.", "Discussions and questions - Piazza", "Sign-up link: https://piazza.com/uwaterloo.ca/fall2024/mte544, Access code: MTE544FALL2024.", "We have a few desktop computers (number subject to change depending on working conditions of the computers) that can be accessed remotely.", "User accounts are given on a per-request basis.", "A booking system will be set up for those choosing to use this solution.", "We have a total of 15 laptops (number subject to change depending on working conditions of laptops) that students can lend on a first-come-first-served basis.", "The lending time must not exceed one week each time.", "Develop kinematic models and controls for autonomous robots.", "Apply motion and measurement models to a variety of vehicles and sensors.", "Apply localization/mapping algorithms for perception within environments.", "Create collision free paths through environments based on maps.", "9/4 Course logistics and introduction", "9/4", "9/11 Kinematic models: 4 wheels, holonomic and omniwheel", "9/18 Introduction to sensors, Inertial sensors, Position Sensors", "9/24 Introduction to odometry, Range sensors (line-fit and RANSAC)", "-", "9/25", "10/1 Vision sensors and basics of image processing", "10/8 Introduction to localization, Discrete motion model", "10/29 Probabilistic Motion Model and Velocity Motion Model", "10/30 Probabilistic Measurement Model and Likelihood Field Model", "11/12 Introduction to planning, graph-based methods, Dijkstra", "11/13 A*, D*, introduction to random methods", "11/20 RRT*, Potential Field", "11/27 Explanation of take-home exam & course summary", "Fr1 Section: Friday 8:30-11:20 AM", "There will be a total of 4 in-person Lab sessions, taking place in E3-3178, in-person attendance is compulsory.", "If you need to switch to a different section, you need to inform the instructor and the TAs for the arrangement with one week notice (accommodations for late notices are allowed on a case-by-case evaluation basis).", "Lab#2 – Control the robot to follow a trajectory using a closed-loop controller.", "Lab#3 – Estimation and mapping: estimate robot motion from sensor data utilizing filters.", "The in-person lab is not meant for implementation but for testing and getting help from the TAs.", "Fail to submit a completed code will result in penalty on the lab report.", "Each member must demonstrate to have equally contributed to the report.", "Submit the report with a final version of your code, and attach a list of modifications made between the first version and the final version.", "About 2 weeks’ time will be given to complete each assignment.", "Notice of Recording", "In case of shutdown of in-person activities, the following arrangements will take place:", "This course includes the independent development and practice of specific skills, such as implementation of theory into practice (e.g. algorithms into code), knowledge of the mathematical models and algorithms, and being able to develop independent solutions for mobile robotics.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 76, "course_code": "MTE 545", "course_name": "MTE545 - Introduction to MEMS Fabrication (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to MEMS Fabrication Fall 2024", "E7 3343", "Discussions", "Questions of a personal nature", "Email: omar.awad@uwaterloo.ca", "Location: E3 - 3161", "Email: agulsaran@uwaterloo.ca", "Introduction to MEMS.", "Basic MEMS governing equations in different energy domains (mechanical, electrical, and thermal).", "Techniques for testing and characterization of MEMS devices.", "The goal of this course is to develop a basic understanding of the fabrication techniques as well as the design of Micro Electro Mechanical Systems (MEMS) including:", "Surface Micromachining", "Bulk Micromachining", "Piezoresistive MEMS transduction", "Apply common microfabrication methods for the layout of MEMS structures", "Have an understanding of the design and multi-physics analysis of MEMS", "Use CoventorWare™ to layout, simulate the production, and model MEMS structures", "1 4-Sep Le1 Introduction to MTE 545 Ch1 (1.1 ) -", "Other Thin Film Deposition Methods for MEMS", "Creating and Transferring Patterns - Part 1 Ch2 (2.4-2.5)", "11-Oct Le17 Designing a Fabrication Process - MEMS Fab Exercise 2 Review Le4 - Le17", "30-Oct Le22 Mechanical Modeling of Beams - Part 2 Ch10 (10.3.3)", "1-Nov Le23 Mechanical Modeling of Beams - Part 3 Ch10 (10.3.3)", "7-Nov Le25 MEMS Pressure Sensor - Mechanical Analysis Ch10 (10.3.3)", "9-Nov Le26 MEMS Pressure Sensor - Electrical Analysis 1 Ch8 (8.3)", "TBD", "R. C. Jaeger, \"Introduction to Microelectronics Fabrication,\" First Edition, Addison-Wesley, 1993", "T. R. Hsu, \"MEMS & Microsystems: Design, Manufacture and Nanoscale Engineering,\" John Wiley & Sons Inc., 2008", "J. W. Gardner, V. Varadan, O. Awadelkarim, “Microsensors MEMS and Smart Devices,\" John Wiley & Sons, Inc. 2002", "Most recent updates on library services and operations", "Worst knowledge quiz grade will be dropped", "Setting aside at least two hours per week to study the material delivered in class in preparation for exams.", "There are eleven knowledge review quizzes in total during the term.", "The course uses CoventorWare® for the layout of MEMS devices and their analysis using finite element modeling (FEM).", "You will be introduced to the layout tools and FEM analysis features of CoventorWare® in the following two-hour labs:", "CoventorWare® Laboratory 1: Introduction to CoventorWare® (Week 5)", "They will be offered in-person in E3 - 3178 in groups of maximum 10 people, during the dates, times and room specified below:", "Please self-enroll for any of these time slots using your Available Groups in LEARN.", "MEMS Characterization Laboratories", "There will be three MEMS characterization laboratories during the term.", "Please, self-enroll in the pre-scheduled time slots posted in the MEMS Laboratories - Group Members, Dates and Times section, in groups of maximum 3 people, using your Available Groups in LEARN.", "Laboratory 1: Introduction to MEMS Devices (Week 3)", "Exams", "Many of these responsibilities are described at the first lecture and/or captured in the policies of the University."]}, {"course_id": 77, "course_code": "MTE 546", "course_name": "MTE546 - Multi-Sensor Data Fusion (0.50)", "term_name": "List 1", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Multi-Sensor Data Fusion Winter 2025", "DWE 2402", "Sensor data and information fusion systems.", "Sensor fusion approaches for estimation and decisions including weighted least squares, extended Kalman Filter, Dempster-Shafer evidential reasoning, artificial neural networks; Outlier rejection; Spatial and temporal registration.", "Course project involving independent study of one aspect of sensor data fusion.", "Discriminate between data, feature and decision fusion", "Use probability theory for uncertainty modeling, and decision fusion", "Classification and classifier fusion", "Evaluate the performance of decision making in discrete decision space (classification)", "Use Regression techniques to build model for sensors", "Perform model evaluation and model selection", "Detect and reject outliers using thresholding and clustering", "Implement weighted sum fusion", "Fuse measurement models and noisy data in Kalman filter framework", "Use Extended Kalman filter in fusing sensors and process model", "Use Unscented Kalman Filter in fusing sensors and process model", "Target tracking with Interactive Multiple Model Filters", "Use techniques such as OWA for decision fusion", "Use Fuzzy set theory and Fuzzy inference systems to fuse measurements and/or decisions", "Implement and use Artificial Neural Network to fuse multi-sensor/multi-feature data (regression and classification)", "Introduction, Basic definitions, Math review, Discrete decision fusion, Classifiers, Bayesian Classifier", "Tracking with Interactive Multiple Models (IMM), Ordered Weighted Averaging (OWA) fusion and Max-Entropy OWA fusion, Fuzzy set theory", "Fuzzy Logic, Fuzzy Inference system, Fuzzy fusion", "RBF networks,  examples of deep neural nets and their applications"]}, {"course_id": 78, "course_code": "ECE 305", "course_name": "ECE305 - Introduction to Quantum Mechanics (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Introduction to Quantum Mechanics Fall 2024", "ECE 305", "11:30AM -", "04:00PM - 05:20PM", "Introduction to quantization, wave-particle duality, and the uncertainty principle.", "Introduction to approximation methods including time-independent perturbation theory.", "View requirements for ECE 305", "Learn basic mathematics for quantum mechanics", "Understand the fundamental concepts of quantum mechanics: quantization, wave-particle duality, the uncertainty principles", "Learn how to solve Schrödinger equations for exemplary problems: particle-in-a-box, finite-height potential, a harmonic oscillator", "Learn modern applications of quantum mechanics", "Make-Up-F", "Tutorial-Th", "Introduction", "Stern-Gerlach", "Math/Matrix Notation", "Quantum State Vectors", "Linear Algebra", "Ch. 2.3-2.4", "Expectation Values", "Calculating expectation values", "Expectation values", "Schrödinger Equation", "Schrödinger Equation", "Spin Precession", "Energy Eigenvalue Equation", "Schrödinger Equation", "Wavefunction", "Wavefunction", "Wavefunction", "Nov.11-15", "Nov.18-22", "Finite Squarewell", "Nov.25-29", "Quantum Cryptography", "Quantum Mechanics: A Paradigms Approach by David H. McIntyre Yes", "Linear Algebra Lecture Material: https://ece.uwaterloo.ca/~ne112/Lecture_materials/.", "Notice of Recording"]}, {"course_id": 79, "course_code": "ECE 406", "course_name": "ECE406 - Algorithm Design and Analysis (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Algorithm Design and Analysis Winter 2025", "ECE 406", "ECE 406 001", "11:30AM -", "E. Creager", "04:00PM - 05:20PM", "E. Creager", "04:00PM - 05:20PM", "• Rushabh Solanki", "ECE 406:", "Design and analysis of efficient, correct algorithms.", "Advanced data structures, divide-and-conquer algorithms, recurrences, greedy algorithms, dynamic programming, graph algorithms, search and backtrack, inherently hard and unsolvable problems, approximation and randomized algorithms, and amortized analysis.", "View requirements for ECE 406", "How to design efficient algorithms using divide and conquer, greedy algorithms, and dynamic programming.", "The kinds of problems that can be solved with linear programming, and why they can be solved efficiently.", "What it means to reduce one problem to another, and how it used in complexity analysis", "Introduction to algorithms Chapter 0 0.5 hours", "Divide and conquer algorithms Chapter 2 5 hours", "Graphs, decompositions and depth-first search Chapter 3 3 hours", "Linear Programming: Simplex algorithm, duality theorem Chapter 7 4 hours", "No lectures during ECE midterms week (Feb 24--28)", "LEC001] Tue 2:30--3:30pm in E7-5353", "Assignments Information and Guidelines: Assignments are given roughly every other week, and their primary goal is to give you practice in designing and analyzing algorithms.", "You must list these collaborators at the top of the first page of your assignment (there is no penalty for listing collaborators, but it ensures we do not falsely identify plagiarism).", "In submitting an assignment, you are “signing off on your work” as described in the academic integrity form at https://uwaterloo.ca/academic-integrity/. The penalty for a first plagiarism offence is -100% for the assignment.", "* Each student must turn in a signed academic integrity form to confirm their understanding of the above policies.", "Notice of Recording"]}, {"course_id": 80, "course_code": "ECE 457A", "course_name": "ECE457A - Co-operative and Adaptive Algorithms (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Co-operative and Adaptive Algorithms Fall 2024", "ECE 457A", "E7 3343", "• Huda Diab Abdulgalil: Email hdiababd@uwaterloo.ca", "The course starts by addressing the ill-structured problems and need for computational intelligence methods.", "It introduces the concepts of heuristics and their use in conjunction with search methods, solving problems using heuristics and metaheuristics, constraints satisfaction.", "The course also introduces the concepts of co-operation and adaptations and how they are influencing new methods for solving complex problems.", "The course starts by illustrating how the concepts of co-operation and adaptation are manifested in nature and how such models are inspiring new types of solutions methods.", "Topics to be covered include search algorithms, game playing, constraints satisfaction, meta-heuristics, evolutionary computing methods, swarm intelligence, ant-colony algorithms, particle swarm methods, adaptive and learning algorithms and the use of these algorithms in solving continuous and discrete problems that arise in engineering applications.", "View requirements for ECE 457A", "Motivate the need for algorithms that exhibit a degree of intelligence: logical, computational, and biologically inspired.", "Introduce the concepts of cooperation and adaptations and how they are influencing new methods for solving complex problems.", "Illustrate the use of these algorithms in solving continuous and discrete, and machine learning problems", "Introduction: About this course, AI, Adaptation, Cooperation, goals and definitions of artificial intelligence;", "ill-structured problems and need for approximate algorithms, cooperation and adaptation in nature.", "Search: state space problem formulation and representation;", "use of heuristic search methods and meta-heuristic algorithms", "Trajectory Methods: Tabu search", "Engineering use cases", "Engineering use cases", "Mathematical Models of Genetic Algorithms", "Introduction to Swarm Intelligence: cooperation and adaptation methods inspired by nature.", "Engineering use cases", "Engineering use cases", "Evolutionary Programming: Continuous and Discrete EP", "Finite State Machine Optimization", "Evolutionary Strategies", "Self-Adaptive Evolution Strategies", "Introduction to evolutionary computing Introduction to evolutionary computing, by Eiben and A, Smith, J.E, Springer, Berlin, 2003.", "Search and Optimization by Metaheuristics Techniques and Algorithms Inspired by Nature Search and Optimization by Metaheuristics Techniques and Algorithms Inspired by Nature Ke-Lin Du, M. N. S. Swamy No", "Search Algorithms Types: Breadth and Depth First Search Algorithm Search Algorithms Types: Breadth and Depth First Search Algorithm Merium Hazem Anwar Labib Bishara, Merihan Hazem Anwar Labib Bishara No", "**The lecture notes are copy-right protected material.", "Such behaviour includes:", "Adhering to the principles of academic integrity when conducting and reporting research.”"]}, {"course_id": 81, "course_code": "ECE 457B", "course_name": "ECE457B - Fundamentals of Computational Intelligence (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Fundamentals of Computational Intelligence Winter 2025", "ECE 457B", "Monday, Friday -", "10:00AM - 11:20AM E7 5353", "04:00PM - 05:20PM", "Da Saem Lee : ds3lee@uwaterloo.ca", "Communication and Discussion", "If you really have a critical time issue, or you don't want the TA's to see the message (for any reason at all), then you should send Prof. Crowley a direct message on Teams chat in addition to email.", "Model-based prediction and classification.", "Multiple examples and case studies such as autonomous driving, intelligent manufacturing, natural language understanding, speech recognition, computer vision, stock market prediction, disease early detection and diagnosis.", "View requirements for ECE 457B", "It encompasses a broad spectrum of supervised learning topics, including nonparametric and parametric models, linear and nonlinear approaches, deep learning paradigms, and probabilistic models.", "Theoretical knowledge is translated into practice through tutorials on industry-standard tools such as PyTorch and Keras.", "Interactive classroom discussions will pivot around both the practical trade- offs inherent in real-world applications and the theoretical underpinnings that provide an intuitive grasp of the field.", "These topics are an outline, and each year some subset of non-core topics will be skipped due to time constraints and in order to benefit students through deeper focus.", "Classification I", "Distance based - k-Nearest Neighbours (kNN)", "Fundamentals of Parameter Estimation and Learning", "MAP Implementation as Classification: Naive Bayes Algorithm", "Dimensionality Reduction and Manifold Learning", "Vector Embeddings : TF-IDF, Word2Vec, BERT", "Kernel Methods and Latent Models", "k-Means Algorithm, DBScan Algorithm", "Anomaly Detection: Classification, Outlier, Density, and Isolation based", "Classification III : Data, Image and Time-series classification using Deep Learning", "Representation Learning II: Auto-encoders and Variational Auto-Encoders", "Attention and Transformer Networks", "Some additional information and links might be here for older courses.", "A visual grading tool for pdfs submissions of tests and assignments, allows limited online test with mark-down text entry and multiple choice questions.", "Some assignments and tests might be made available online for submission using this tool as well.", "Arxiv Tutorials - pdfs will be posted to hypothes.is and others links will be provided to a number of detailed tutorials on some course topics.", "The first half covers many of basics of this course, while the second half focusses on Deep Learning only.", "Exams", "Completing the assignments will require multiple skills:", "familiarity with statistical, probabilistic analysis of data and results", "logical design and clear description of a expeirmental methodology", "programming various algorithms for processing, training and analysis of data to achieve given tasks (programming will be in Python using libraries such as sci-kit learn and tensorflow, pytorch, pandas)", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 82, "course_code": "ECE 459", "course_name": "ECE459 - Programming for Performance (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 459", "Monday, Friday -", "08:30AM - 09:50AM E7 5353", "04:00PM - 05:20PM", "Monday, Friday -", "04:00PM - 05:20PM", "11:30AM -", "07:00PM - 07:50PM E7 5353", "07:00PM - 07:50PM E7 5353", "About Prof. Zarnett", "Then I got the AIF in the mail and decided I didn't want to study Computer Engineering after all.", "I'm an Associate Professor of Electrical and Computer Engineering.", "Some of you will know me as the previous Director of Software Engineering from back when you were in 1A. I studied math/CS yet convinced PEO to license me as a P.Eng.", "My research interests focus on using compiler and static analysis techniques to ensure program correctness.", "The LI is responsible for technical matters related to the assignments: git.uwaterloo.ca, git in general, administering the systems where you need to run your labs.", "And I enjoy engaging in discussions about these fields.", "Thanushon Sivakaran <tsivakar@uwaterloo.ca>", "Profiling computer systems; bottlenecks, Amdahl's law.", "View requirements for ECE 459", "Many modern software systems must process large amounts of data, either in the form of huge data sets or vast numbers of (concurrent) transactions.", "This course introduces students to techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs.", "These techniques will enable you to design and build critical software infrastructure, especially in an age of Big Data.", "While you may have seen some of these ideas in the context of operating systems (ECE350/SE350/CS350/MTE241) and concurrency (ECE252/CS343), this course gives you tools to make code run faster.", "Design and apply techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs.", "We intend to use these slots until we reach the end of the course material.", "The notes cite a number of sources, some of which are useful books.", "Rust familiarization and use of nonblocking I/O;", "Auto‐grading and auto‐feedback systems, including marmoset, may be used for the evaluation of some of your assignments.", "Acceptable collaboration includes discussing ideas and structures with others, as well as helping others debug their code.", "If your code is too close in structure to someone else's code, you are going to have a problem.", "Or, let's sum this up in two short instructions:", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, ChatGPT) and how such tools can be used to write and test code.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be diﬃcult to interpret on a discussion forum.", "The human visual system has evolved to perceive saber‐toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text‐mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 83, "course_code": "ECE 481", "course_name": "ECE481 - Digital Control Systems (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Digital Control Systems Spring 2024", "yash.pant@uwaterloo.ca", "11:30AM -", "Dynamic system modelling and basic system identification.", "Sampled data systems.", "Digital control system design: emulation methods, z-domain, frequency domain, pole placement.", "Implementation of digital controllers.", "Design controllers to deal with basic nonlinear effects.", "Explain how sampling rates affect the performance of a digital control system and how to account for the sampling rate when you design feedback controllers.", "Discretize a plant in order to do control design directly in the discrete-time domain and discretize a continuous control law to implement it in a computer program.", "Test stability of discrete-time systems and quantify dynamic performance of these systems.", "Design digital control laws by emulation, in both the z-domain and the frequency domain.", "Design techniques include deadbeat control and pole placement.", "Motivating examples, introduction to discrete-time control systems and sampled-data control systems.", "Bounded-input bounded-output stability, feedback stability, time-domain specifications, steady-state performance, frequency domain analysis.", "Pole placement controller design for continuous-time systems in the s-domain, incorporating tracking specifications.", "State-space models, linearization, inverting static non-linearities, static friction.", "Linear discrete-time systems (4 lectures)", "Discretize the plant and design the controller in the discrete-time domain, stability tests, design in the frequency domain, design in the time-domain.", "Optimization-based control of constrained systems (1 lecture)", "Introduction to optimal control, effect of constraints, Model Predictive Control.", "The optional suggested textbook is: Digital Control System Analysis and Design, 4th edition, C.L.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as linear algebra for control system analysis and design, implementation in Matlab/Simulink .", "Library for research-based assignments"]}, {"course_id": 85, "course_code": "ECE 486", "course_name": "ECE486 - Robot Dynamics and Control (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Robot Dynamics and Control Spring 2024", "ECE 486 / ECE 780", "ECE 486 001", "ECE 486 101", "08:00PM -", "ECE 486 201", "ECE 780 001", "ECE 486:", "Introduction to the study of robotics focusing on the mechanics and control of serial manipulators.", "Topics include rigid body motion, forward and inverse kinematics, differential kinematics, forward and inverse dynamics, trajectory generation, motion planning, and feedback control.", "This course will introduce students to dynamic modeling and control techniques for robotic systems, and expose them to some cutting-edge research.", "Dynamics of manipulators", "Optimization-based robot control", "May 7 Introduction to robot dynamics and control", "May 23 Dynamic model of manipulators 6 [", "CONTROL OF MANIPULATORS", "Jun 27 Control of driftless systems 14", "Jul 4 Control of differentially flat systems 14", "OPTIMIZATION-BASED ROBOT CONTROL", "Jul 18 Invariance and control barrier functions 4 [", "The lecturing deliverable will consist in a 15-minute presentation of a topic not covered in class and independently studied.", "Magnus Egerstedt, Robot Ecology: Constraint-Based Design for Long-Duration Autonomy, Princeton University Press, 2021 No", "ECE 486", "The project will consist of a mobile manipulation task using the DJI RoboMaster EP programmed in", "The code developed to complete the project", "The reports must be formatted using", "The project will consist of the solution to a problem in the student’s research area using the techniques", "– Section II: Novelty and/or impact", "– Section III: How robot dynamics and control techniques play a key role", "– Section V: Metric for success", "– Section I: Introduction", "– Section III: Materials and methods", "The code developed to complete the project"]}, {"course_id": 86, "course_code": "ECE 488", "course_name": "ECE488 - Multivariable Control Systems (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Multivariable Control Systems Winter 2025", "ECE 488", "Monday, Friday -", "D. Davison", "04:00PM - 05:20PM", "ECE 488 101", "08:00PM -", "D. Davison", "Instructor Dan Davison", "EIT-3114", "Review of feedback control design fundamentals; SISO controller parameterizations; the fundamental effect of MIMO interaction; introduction to state-space models in continuous and discrete time; SISO techniques for MIMO design; optimal control; model-predictive control design; state estimation; decoupling, MIMO PID control design; applications in areas such as aerospace systems.", "View requirements for ECE 488", "Course pre-requisites:", "This course builds on classical control theory from a first control course (ECE380, MTE360, BME356, SYDE352, or equivalent).", "I assume you have good working knowledge of Laplace transforms, transfer functions, Bode plots, block diagrams, and basic control tools (Routh-Hurwitz stability test, root locus plots, Nyquist plots, design of PID/lead/lag controllers).", "To develop tools that allow us to analyze and design control systems that have multiple inputs and/or multiple outputs.", "(7) Proficiently interpret and analyze MIMO systems (Chapter 4)", "(9) Proficiently manipulate and analyze MIMO state-space systems (Chapter 5)", "(11) Explain the advantages and disadvantages of state-space and transfer-function techniques for MIMO control (Chapter 5)", "Tests and final exam", "Tests and final exam", "Tests and final exam", "Tests and final exam", "Tests and final exam", "\"Impact of engineering on society and the environment\"", "\"Economics and project management\"", "Mon Feb 10 Lecture Ch 3 pp.157-164 and P3 & P4", "These slots will compensate for lectures that are cancelled during the ECE Midterm Week.", "You can send a print request online at https://wstore.uwaterloo.ca/pages/w-print-student.", "Chapter 4:  \"Control System Design\", by Goodwin, Graebe, and Salgado, 2001", "Summary of marked components", "Tests and final exam", "Any reason for missing a test, other than those listed above, results in a score of zero on that test.", "The purpose of the Project Exercises is to increase your understanding of the techniques and ideas presented in the lectures by applying them to a quasi-realistic system.", "In-person students who faithfully attend the in-person lectures can get bonus marks.", "I will occasionally distribute slips to each person present in the lecture room.", "Correctly answer a simple question on the slip, and put the slip in the box at the front of the room.", "Most of the 36 lecture videos explain how a random subset of viewers can get a 0.5% bonus mark.", "Mixed learning modes:  Students who switch between in-person and online learning may collect a mixture of in-person and online bonus marks."]}, {"course_id": 87, "course_code": "ECE 495", "course_name": "ECE495 - Autonomous Vehicles (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 495", "ECE 495 001", "Monday, Friday -", "11:30AM -", "04:00PM - 05:20PM", "Mahdi Naseri mahdi.naseri@uwaterloo.ca", "Autonomous driving system overview; computer vision basics, deep learning for perception, motion modelling and state estimation, localization and mapping, object tracking, behavioral planning and reinforcement learning, path planning and vehicle control, safety and verification and validation, adoption and impact.", "View requirements for ECE 495", "Linear algebra", "Basic mechanics", "Feedback control", "Basic programming skills in Python and C++", "Design and implement perception functions using classical and deep learning computer vision techniques", "Formulate and implement Extended Kalman Filter for dynamic state estimation", "Understand and implement basic vehicle control and trajectory methods", "Understand the limitations and risks of current methods and be aware of future research and industry trends", "Functional Architecture", "WISE ADS", "Image representation", "Image filtering", "Lane detection using classical computer vision", "Image features", "Linear regression", "Neural network training", "Implementing vanilla neural network from scratch", "U2 Semantic segmentation", "Training a deep network for semantic segmentation", "Deep network for object detection", "U1 Dynamic system modeling", "Probabilistic models", "Bayes filtering", "U2 Occupancy grid mapping", "Vehicle modeling – Part 1", "U1 Lateral vehicle control", "Longitudinal vehicle control", "Vehicle controller", "Motion planning problem", "Motion planning methods", "The in-person lecture slots will be used for covering selected topics from the course material, answering and discussing the sample practice questions, and guest lectures on emerging research topics.", "Additional material covered in guest lectures may be included in exams as bonus questions.", "However, some students may prefer to read text explaining these concepts.", "A recent book discusses the major functions of autonomous vehicles, touching on many of the topics covered in the course and beyond", "Creating Autonomous Vehicle Systems, Second Edition, Morgan and Claypool Publishers, 2020", "Section 4.2: Edge Detection", "Section 3.2: Linear Filtering", "Sections 3.1 and 3.2: Linear Regression", "Neural networks", "Section 7.3: Semantic Segmentation", "Section 7.2: Object detection", "Vehicle modeling", "Motion planning", "Computer Vision: Algorithms and Applications.", "An Introduction to Statistical Learning with Applications in R. Springer, 2017 (available online through UW library)", "Kalman and Bayesian Filters in Python.", "Automatic Steering Methods for Autonomous Automobile Path Tracking.", "A Survey of Motion Planning and Control Techniques for Self-driving Urban Vehicles.", "Design Space of Behaviour Planning for Autonomous Driving.", "Online courses", "Coursera has a Self-Driving Cars Specialization, which you can access at", "The specialization has four courses:", "Introduction to Self-Driving Cars", "State Estimation and Localization for Self-Driving Cars", "Visual Perception for Self-Driving Cars", "Motion Planning for Self-Driving Cars", "Object detection can be a tricky concept to grasp.", "Finally, the Stanford course on Convolutional Neural Networks for Visual Recognition (cs231n) gives a great introduction to neural networks in general and convolutional neural networks in particular.", "Advanced reading", "The following two papers cover the trajectory planning concepts discussed in the course (these algorithms are used in the WISE ADS stack that operates UW Moose):", "I am including the following books here in case you want to deepen your knowledge on some of the topics covered in the course.", "State Estimation for Robotics.", "7 Implementing a simple trajectory planner Fri, Apr 4 12", "Collaboration & Plagiarism: Plagiarism, taking credit for work that others did, is not permitted, and this applies to source code as well as exams.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 88, "course_code": "MSE 331", "course_name": "MSE331 - Introduction to Optimization (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Optimization Winter 2025", "08:30AM - 09:20AM", "RCH 301", "Email: fgzara@uwaterloo.ca", "This first course in optimization uses a quantitative approach to problem solving involving, mathematical modelling and formulations, solution methods, and output analysis.", "Students are introduced to a variety of practical problem formulations in management and engineering, a number of solution methods, including, but not limited to, linear optimization, network models, project management, and decision analysis.", "View requirements for MSE 331", "Identify real-world problems that may be solved using optimization methods", "Formulate linear, integer, and network optimization models", "Solve linear programming problems using the simplex method", "Formulate and interpret the dual of a linear program", "Analyzer the sensitivity of an optimal solution of a linear program to changes in its parameters", "Introduction to the course", "Introduction to mathematical modelling", "Jan 14-16 Modelling using LP & Mixed Integer Programming (MIP) Solution using Excel solver A1 posted", "Jan 21-23 Modelling using LP & Mixed Integer Programming (MIP) Solution using Gurobi/Cplex A1 due", "Solution Methods for Linear Programming More solver practice A2 posted", "Solution Methods for Linear Programming", "Sensitivity Analysis in LP", "Solution methods practice", "A4 posted", "Mar 11-13 Solution Methods for MIP: the branch-and-bound method   A4 due", "Branch-and-Bound - the General case", "Network flow models", "Mar 25-27 Network flow models  Network flow models A5 due", "Introduction to Operations Research, Frederick S. Hillier, McGraw-Hill Higher Education, 11th Edition, 2021."]}, {"course_id": 89, "course_code": "MSE 431", "course_name": "MSE431 - Stochastic Models and Methods (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Stochastic Models and Methods Winter 2025", "MSE 431", "S. Erenay", "TAs    Atahan Bayir", "Introduction to operations research models and methods for problems with random, stochastic, and probabilistic components.", "Applications include the design, modelling, and analysis of service and manufacturing systems, with emphasis on important functions such as queueing, inventory, reliability, equipment replacement, and maintenance.", "View requirements for MSE 431", "Understand/use the key elements of probability theory and simple stochastic models [", "Critique and propose areas of improvement for Markov chain models by addressing weak points and unrealistic issues.", "Develop and use probabilistic models to analyze and address the needs of real-life systems.", "Basic Concepts of Queuing Theory (week11-12) (new topics)", "You will be given around 30-50 minutes to complete each quiz.", "You will be given a problem definition and asked to apply an advanced stochastic modeling approach to address the problem.", "You are expected to a) model the problem as a stochastic process, b) solve the corresponding problem, and c) gain insights from the solutions and discuss how these insights can be used for more educated decision-making.", "If necessary, a softcopy can be sent to the instructor’s email address before the deadline and a hard copy can be submitted the next day to catch the deadline.", "Illness During the Term", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 90, "course_code": "MSE 432", "course_name": "MSE432 - Production and Service Operations Management (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Production and Service Operations Management Winter 2025", "Introduction to management, planning, and control decisions in manufacturing and service settings using quantitative approaches.", "Students are exposed to a number of examples and case studies, and work on a project that involves analysis and discussion of improved designs.", "Develop understanding of the impact of services and production operations in organizations [PA]", "Employ decision-making tools used by operations managers [", "Impact]", "Introduction to OM and Demand Forecasting (I)", "Demand Forecasting (II) and Product Design", "Capacity Planning and Process Design/Facility Layout", "Chapters 11", "Aggregate Operation Planning", "Just-in-Time Production and Project Management", "Demand Forecasting", "Capacity Planning and Process Design/Facility Layout", "Aggregate Operations Planning", "JIT & Project Management"]}, {"course_id": 91, "course_code": "MSE 446", "course_name": "MSE446 - Introduction to Machine Learning (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Machine Learning Winter 2025", "04:00PM - 05:20PM", "Topics covered may include data cleaning and transformation, overfitting and generalization, n-fold cross validation, regression, decision trees, neural networks, rule finding, and clustering.", "View requirements for MSE 446", "Problem Analysis]", "Jan. 6   Introduction", "Mar. 31   Advanced topics", "Apr. 2   Advanced topics", "https://web.stanford.edu/~jurafsky/slp3/ Includes language models No 0", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 93, "course_code": "MSE 551", "course_name": "MSE551 - Quality Management and Control (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "S. Dimitrov", "09:00AM - 09:50AM CPH 3681", "yekta.amirkhalili@uwaterloo.ca", "Yekta Amirkhalili  yekta.amirkhalili@uwaterloo.ca", "Accurately summarize the parts of a quality management system", "Assess a system for quality improvement opportunities", "Create a quality management system for a process", "Evaluate a quality management system for a process", "Apply documentation, and analytical techniques related to quality", "Last 1/2 to 2/3 of the course we cover up to 4 cases designed by the Waterloo Cases in Design Engineering.", "We will be using case studies prepared with the help of the Waterloo Cases in Design Engineering team.", "In each of the case studies you will be solving a quality problem or designing a quality management system.", "Case studies have been shown to help students develop skills in problem solving, using qualitative and quantitative methods problem solving, dealing with complex situations and dealing with ambiguities.", "We will discuss more about the exact format for our case study discussion and the case study reports as the term moves forward.", "My goal to make the case study portion of our course a fun and exciting way to learn and apply quality engineering concepts.", "Introduction to Statistical Quality Control, (8th edition).", "Notice of Recording", "Email Correspondence", "In the case the question is deemed of interest to multiple individuals.", "As a reminder of this honor code, you will be asked for every homework assignment to aﬃrm the following statement “I have neither given nor received aid on this homework assignment, nor have I concealed a violation of the Honor Code.”", "In‐person Lectures Except in Case of Medical Need", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 94, "course_code": "MSE 555", "course_name": "MSE555 - Scheduling: Theory and Practice (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["11:30AM -", "Students will be introduced to the theoretical background in these areas, but the emphasis will be placed on modelling and solving scheduling problems in practice.", "Students will apply these concepts in design activities in assignments and a course project.", "In this course, we look at practical scheduling problems, solution techniques, and algorithms in both manufacturing and service industries.", "We apply our knowledge to investigate one case study concerning real world scheduling problems and learn from one guest speaker who discusses interesting scheduling challenges and opportunities.", "Modeling and solving scheduling problems", "Analyzing scheduling related data and deriving insights into the problem", "Understanding the main challenges in real world scheduling problems", "Submit", "Introduction", "Administration", "Introduction: Scheduling Problems", "4.4", "4.4", "Dispatch Rules and Shifting Bottleneck", "Solution Techniques", "Introduction to Service Scheduling", "Workforce Scheduling", "Queueing & Scheduling", "Queueing & Scheduling (continue …)", "Queueing & Scheduling (continue …)", "TBA", "“Planning and Scheduling in Manufacturing and Services,” Michael L. Pinedo (Springer).", "Total"]}, {"course_id": 95, "course_code": "SYDE 522", "course_name": "SYDE522 - Foundations of Artificial Intelligence (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["The objective of this course is to introduce students to fundamental concepts of artificial intelligence.", "Understand the basic concepts in Artificial Intelligence (CEAB requirements: 1d)", "Discuss how basic concepts lead to modern AI systems (CEAB requirements: 1d)", "Integrate ethical considerations when using AI (CEAB requirements: 10)", "Instruction", "Course slides and code notebooks will be posted on LEARN.", "W Sept 4 Introduction and Definitions", "M Sept 9 Perceptrons and Delta Rule", "M Sept 16 Evaluation Metrics and Experimental Validation", "M Sept 23 Linear SVMs", "M Nov 25  Extra Topics: Genetic Algorithms", "Late policy: If students have reasons for an assignment to be submitted late, they need to contact the instructor and accommodations can be made on a case-by-case basis.", "Course and Departmental Expectations", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.", "A.A.S. also offers learning strategy supports to all students that can be accessed through:"]}, {"course_id": 96, "course_code": "SYDE 532", "course_name": "SYDE532 - Introduction to Complex Systems (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Introduction to Complex Systems Winter 2025", "10:00AM - 10:50AM E5 6008", "Professor Paul Fieguth pfieguth@uwaterloo.ca Office Hours: Mondays 4-5pm in E7-6338", "The overwhelming majority of societal, ecological and climate issues of pressing importance are complex systems; nonlinear dynamic interacting systems poorly characterized by linear analyses and Gaussian statistics.", "This course introduces the mathematics needed to understand such interactions, including nonlinear dynamics, critical and bifurcation behaviours, large-scale systems and power-law distributions.", "The mathematical methods will be motivated by extensive examples and case studies such as global warming, energy shortages, desertification, overpopulation, poverty, and economic instability, to be investigated from a systems engineering perspective that will connect mathematical concepts to real-world examples.", "Understand the assumptions and limitations behind linear dynamic / Gaussian systems", "Understand the mathematical properties of nonlinear dynamic / power-law systems", "Be able to abstract / generalize the impacts and implications of nonlinear systems", "Be able to draw connections between macroscopic socio-environmental systems", "Mathematics and Modeling", "The Science of the Physical World", "3. Earth Monitoring and Inverse Systems", "An Introduction to Complex Systems (2nd ed) Springer Verlag, 2021 Yes $0", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 97, "course_code": "SYDE 543", "course_name": "SYDE543 - Cognitive Ergonomics (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Piazza will be the main platform for Q&A. In case you need to contact the teaching team, make sure to add SYDE 543 to the beginning of the subject line.", "This course focuses on the role engineering psychology research plays in design of the information displays and devices associated with simple and complex cognitive tasks.", "Remember and comprehend important cognitive ergonomic concepts, theories, and principles", "Analyze human information processing constraints and limitations, and use it to identify cognitive ergonomics issues in systems design", "Apply cognitive ergonomics knowledge to produce improved designs considering human cognitive constraints", "Course Introduction", "Human-computer Communication", "Human Errors", "Senses", "Attention and Learning", "Control", "Empirical Evaluation", "Research Methods in Cognitive Ergonomics", "Decision Making", "Decision making and biases", "Working Memory", "Memory and Training", "Situation Awareness", "March 25,28", "Case study presentation", "Case study presentation", "Foundations for designing user-centered systems: What system designers need to know about people.", "Santa Barbara CA: Aegean Publishing Company No 120", "Alternatively, one of the team members can send the email and cc all the other team members.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "You will be clearly directed whether you are allowed to use these methods for each assignment."]}, {"course_id": 98, "course_code": "SYDE 548", "course_name": "SYDE548 - User Centred Design Methods (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["User Centred Design Methods Winter 2025", "UCD Mentors Pronouns Email Office Extra Help", "This course approaches the design of tasks, tools, products, and systems from a user-centered design perspective.", "Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process.", "Major topics include user research methods for usability and user experience, inspection methods, user testing, applied statistical analysis.", "SYDE 548 (UCD Methods) approaches the design of tasks, tools, products, and systems from a user-centered design perspective.", "Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process.", "Major topics include user research methods for usability and user experience, inspection methods, user testing, and applied statistical analysis.", "SYDE 548 User-Centred Design Methods is a technical elective.", "It builds from earlier SYDE core courses in design (SYDE-BME 161 Introduction to Design, SYDE-BME 162 Human Factors in Design, and SYDE-BME 361 Engineering Design).", "Motivated students willing to become familiar with basic human factors engineering can participate and contribute to course activities.", "Whether you are interested in becoming a UCD specialist, a certified ergonomist, or just want to be a wise designer or consumer, this course will supply you with a range of practical tools (methods).", "Our “In-class” sessions are used as workshops for interactions and hands-on skill development with different UR methods.", "Engineering Graduate Attribute]", "(A) Describe ethical UCD methods used for formal and informal design assessments with human participants.", "(B) Investigate & select appropriate ethical & equitable UCD methods for specific design situations.[2a, 3b, 10b]", "(C) Apply UCD method protocols to instructor-defined design situations.", "(D) Modify UCD method protocols to collect data for a student-defined design project.", "(E) Select and apply appropriate statistical analysis for given UCD data.", "(F) Design ethical UCD test plans for instructor-defined design situations.", "(G) Create User Research Portfolios describing ethical UCD methods, protocols, and lessons learned.", "CEAB Engineering Graduate Attribute", "Knowledge Base for Engineering", "2. Problem Analysis", "Data Analysis Quizzes,", "4. Design", "-", "Impact of Engineering on Society and the Environment", "Ethics & Equity", "Economics & Project Management", "-", "2. Situations of Concern, Design Impacts & Personas Quantifying Usability; Standard UX Questionnaires;", "SUS Scoring (standard and positive versions)", "3. Design Ethnography: UR Safaris & Secondary Research.", "Interviews & Distress Protocols.", "5. Thematic Analysis Methods - Part 1 Thematic Analysis Methods - Part 2", "Formative Design Walkthroughs & Estimating Formative Sample Sizes.", "UR Methods & GenAI Revisited.", "Quantifying the User Experience: Practical statistics for user research.", "An e-copy of the 1st edition can be accessed through UW Library Reserves.", "The User Experience Team of One: A Research and Design Survival Guide. 2nd edition.", "Hanington, B. & Martin, B (2019) Universal Methods of Design (Expanded & Revised): 125 Ways to research complex problems, develop innovative ideas, and design effective solutions.", "An e-copy of the 1st edition can be accessed through UW Library Reserves No", "Design Materials (for workshops, data collection, and analysis).", "The number of students who can access an e-copy at a given time may be limited.", "Since user-centred design and user research skills are valued by industry, it is important that each student submits original work and demonstrates their own value-added UR skills to earn credit for the course.", "Intellectual property includes items such as:"]}, {"course_id": 100, "course_code": "SYDE 572", "course_name": "SYDE572 - Introduction to Pattern Recognition (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Pattern Recognition Fall 2024", "Pattern features as components in a random vector representation.", "Applications; optical character recognition, speech recognition, industrial robot vision, medical diagnosis, remote sensing and satellite image analysis, fault detection and diagnosis in complex systems such as nuclear reactors.", "Understand the principles of fundamental pattern recognition concepts such as classification, feature extraction and selection, deep learning, etc.", "2. Apply learnt techniques and algorithms in assignments using Python", "3. Understand and contextualize the learnt concepts in applications of pattern recognition to science, engineering, and industry", "4. Design a pattern recognition system provided a task and a set of data.", "Problem Analysis", "Introduction, Pattern Recognition Problem Definition", "Parametric and Nonparametric Distance-Based Classification", "KNN and distance-based classification", "Parametric and Nonparametric Density Estimation", "Discriminant Functions", "Gaussian mixture models", "Parametric and Nonparametric Clustering", "Expectation Maximization", "Linear and nonlinear regression", "Ensemble classification", "Advanced topics", "An Introduction to Statistical Learning, James, Witten, Hastie, Tibshirani, 2nd Ed.", "Introduction to Machine Learning, Alpaydin.", "Dive into Deep Learning", "Various usefullinks and advisorcontact information can be foundhere:"]}, {"course_id": 101, "course_code": "SYDE 584", "course_name": "SYDE584 - Physiological Systems and Biomedical Design (0.50)", "term_name": "List 2", "program_name": "Mechanical Engineering", "program_id": 113, "major_id": 1, "major_name": "Mechanical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Physiological Systems and Biomedical Design Winter 2025", "04:30PM - 05:20PM", "04:30PM - 05:20PM", "Email: maud.gorbet@uwaterloo.ca", "Email: gganjikho@uwaterloo.ca", "The structure, functions, and properties of major physiological systems (e.g., musculoskeletal, nervous, cardiovascular, and respiratory) will be presented in relation to modelling physiological systems and the design of biomedical devices (imaging, assistive, and diagnostic).", "The structure, functions and properties of some of the major physiological systems (musculoskeletal, nervous, and cardiovascular) will be presented with an engineering science perspective.", "Strong emphasis will be given to mechanical, electrical, chemical and biological properties of tissues and their relation to measurements, modeling human systems, and the design of biomedical devices (assistive, orthopedic and diagnostic).", "Various aspects of physiological system dysfunctions and how they influence measurements and design of medical devices will be discussed.", "Learn and integrate basics of human physiology", "Develop an engineering perspective toward understanding biological functions", "Develop critical thinking skills for solving biomedical problems and designing sound biomedical technologies", "Describe the components/structures of the studied physiological systems (1d)", "Identify the relationship between structure and functions in physiological systems (1d, 3b, 3c)", "Interpret experimental results (graphs, tables, raw data) to evaluate the effects of disease, aging or a medical device on structure and/or function of physiological systems (3c)", "Evaluate biomedical engineering solutions by applying your knowledge of physiology and the scientific methods (2c)", "Develop reasoned solutions to address biomedical problems by applying your knowledge of physiology and engineering principles while considering social-economical-ethical impacts (4b, 4c, 9a, 9b)", "1 Knowledge Base 1d - Demonstrate understanding of specialized engineering knowledge", "2 Problem Analysis 2c - Critically evaluate solutions of engineering problems", "3 Investigation 3b - Gather information from relevant sources to address complex engineering problems", "3c - Synthesize information from multiple sources to reach valid conclusions", "4 Design 4b - Generate and refine potential solutions to complex, open-ended design problems", "4c - Critically evaluate and compare design choices", "9b - Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations in making decisions", "Week  Date  Topics (physiology & biomedical applications) Learning assessment", "Membrane potential, membrane transport and biological system communications.", "Implications in disease and diagnostics.", "Applications to biomedical engineering.", "Biomedical applications in bone and connective tissues", "7 Feb 24 & Feb 26", "Electrodes for Brain-computer Interface", "9 March 10 & March 12", "Engineering a heart and heart valves", "10  March 17 & March 19", "March 19: LEC & TUT Cancelled (symposium week)", "March 24 & March 26", "Muscle tissue 1: structure and functions", "These will be short and will contain up to 20 multiple choice questions.", "No late submission and no make-up quiz will be organized.", "There will be some opportunities to complete some of these activities remotely in case you were unable to attend.", "These will be also used by Prof Gorbet to evaluate comprehension of concepts and common misunderstandings.", "0 - Submission missing", "1.5 - Good submission: submission demonstrates a clear effort in applying course concepts and/or critical thinking", "Research and design project outline proposals", "The research & design outline proposals are expected to be done in pairs, and will relate to the study of a disease or aging and proposing a novel biomedical solution to characterize, support or replace the affected physiological structure or function.", "Library for research-based assignments", "Email Communication", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Visit them at www.uwaterloo.ca/wcc.", "Course and Departmental Expectations in SYDE", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 0, "course_code": "CHE 102", "course_name": "CHE102 - Chemistry for Engineers (0.50)", "term_name": "1A Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Chemistry for Engineers Winter 2025", "CHE 102", "E. Boghaert", "Eline Boghaert (eline.boghaert@uwaterloo.ca)", "While this course can be completed asynchronously online, synchronous online sessions will be held on Wednesday from 11:30 AM - 12:30 PM and Friday from 12:30 PM - 1:30 PM to review key concepts, demonstrate problem solving and answer questions.", "Stoichiometric calculations, properties of gases, properties of liquids and solutions, gas phase chemical equilibrium, ionic equilibrium in aqueous solution, oxidation-reduction reactions, chemical kinetics.", "View requirements for CHE 102", "Explain the behavior of ideal systems (including different states of matter, physical and chemical equilibrium and reaction kinetics) in terms of the molecular nature of matter.", "Write balanced chemical reactions and perform stoichiometric calculations.", "Identify which principles of physical chemistry are relevant to the analysis of problems involving physical and chemical equilibrium and rates of reaction.", "Select and apply an appropriate law to solve problems involving physical and chemical equilibrium and rates of reaction.", "Apply course concepts to identify and analyze concerns regarding the safety and/or sustainability of a chemical process.", "Unit 1: Introduction and Stoichiometry Week 1", "Introduction Lesson 1: Introduction to Significant Digits, Line Calculations and Unit Conversions (1.4, 1.5, 1.7)", "Lesson 5.1: Chemical Equilibrium and Equilibrium Constants (15.1-15.4)", "Unit 6: Equilibrium in Electrochemical Systems Week 11", "Lesson participation grades for each lesson are evenly weighted in the total lesson participation grade.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 1, "course_code": "MATH 115", "course_name": "MATH115 - Linear Algebra for Engineering (0.50)", "term_name": "1A Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Linear Algebra for Engineering Fall 2024", "02:30PM - 03:20PM", "RCH 301", "RCH 301", "10:30AM - 11:20AM E7 5353", "02:30PM - 03:20PM", "E. Dupont", "03:30PM - 04:20PM E7 5343", "10:30AM - 12:20PM RCH 301", "10:30AM - 12:20PM", "PHY 313", "E. Dupont", "08:30AM - 09:20AM", "08:30AM - 10:20AM PHY 313", "08:30AM - 10:20AM RCH 309", "10:30AM - 11:20AM RCH 103", "11:30AM - 12:20PM RCH 103", "RCH 204", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "08:30AM - 10:20AM EV3 4412", "08:30AM - 10:20AM MC 4058", "02:30PM - 03:20PM", "09:30AM - 10:20AM RCH 302", "F. Al-Faisal", "10:30AM - 12:20PM MC 4063", "10:30AM - 12:20PM MC 4060", "10:30AM - 11:20AM RCH 110", "F. Al-Faisal", "03:30PM - 04:20PM", "02:30PM - 04:20PM MC 4060", "DWE 3522", "Tuesday -", "07:00PM - 08:50PM", "Linear equations, matrices, and determinants.", "Introduction to vector spaces.", "Eigenvalues and diagonalization.", "Present solutions to problems in a clear and logical manner with all steps being fully justified.", "Understand the basic operations of addition and scalar multiplication as they apply to vectors, matrices and linear transformations.", "Find the solution to a system of linear equations using matrices and elementary row operations.", "Understand matrix algebra and its connection to systems of equations.", "Have both a geometric and an algebraic understanding of span, linear independence, bases and subspaces.", "Recognize the link between matrices and linear transformations, and understand that many common geometric operations such as projections, reflections and rotations are linear transformations.", "Develop a basic algebraic and geometric understanding of complex numbers and complex polynomials.", "Determine the eigenvalues and eigenvectors of a matrix and diagonalize a matrix.", "1.1 Vectors in Rn", "1.2 Linear Combinations", "1.3 The Norm and the Dot Product", "1.4 Vector Equations of Lines and Planes", "1.5 The Cross Product in R3", "1.6 The Scalar Equation of Planes in R3", "1.7 Projections", "Chapter 2 Systems of Linear Equations", "2.1 Introduction and Terminology", "2.2 Solving Systems of Linear Equations", "2.3 Rank", "2.4 Homogeneous Systems of Linear Equations", "3.1 Matrix Algebra", "3.2 The Matrix-Vector Product", "3.3 The Matrix Equation Ax=b", "3.4 Matrix Multiplication", "3.5 Matrix Inverses", "4.1 Spanning Sets", "4.2 Geometry of Spanning Sets", "4.3 Linear Dependence and Linear Independence", "4.4 Subspaces of Rn", "4.5 Bases and Dimension", "4.6 Fundamental Subspaces of a Matrix", "Chapter 5 Linear Transformations", "5.1 Matrix Transformations and Linear Transformations", "5.2 Examples of Linear Transformations", "5.3 Operations on Linear Transformations", "5.4 Inverses of Linear Transformations", "5.5 The Kernel and the Range", "Chapter 6 Determinants", "6.1 Determinants and Invertibility", "6.2 Elementary Row and Column Operations", "6.3 Properties of Determinants", "7.1 Basic Operations", "7.2 Conjugate and Modulus", "7.3 Polar Form", "7.4 Complex Polynomials", "7.5 Complex nth Roots", "Chapter 8 Eigenvalues and Eigenvectors", "8.1 Introduction", "8.2 Computing Eigenvalues and Eigenvectors", "8.3 Eigenspaces", "8.4 Diagonalization", "8.5 Powers of Matrices", "Linear Algebra for Engineering Fall 2024 Course Notes Required text provided on LEARN Yes", "Linear Algebra with Applications by Keith Nicholson Optional text provided on LEARN No", "The Linear Algebra for Engineering Fall 2024 Course Notes is the required text for this course, and is available on LEARN.", "The text Linear Algebra with Applications is an optional text also available on LEARN for those students looking for an alternate exposition of the material and/or additional problems to work on.", "Students looking for extra practice beyond the course notes are welcome to attempt problems in the corresponding sections of the optional textbook.", "Python Assignments: Throughout the term, there will be 5 equally weighted assignments where students will use python to execute some prewritten code in an effort to explore some larger-scale applications of linear algebra.", "If you find yourself in a situation where you are missing multiple assessments, then you are advised to contact both your instructor and the First Year Engineering Office to make sure you have the proper supports in place to succeed in this courses.", "To be clear - such websites are not allowed to be used for the completion of any part of the course MATH 115, and students are not permitted to share questions from the course anywhere.", "Generative AI: This course includes the independent development and practice of specific skills, such as computations, problem solving and proof writing.", "Library for research-based assignments"]}, {"course_id": 2, "course_code": "MATH 116", "course_name": "MATH116 - Calculus 1 for Engineering (0.50)", "term_name": "1A Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["03:30PM - 04:20PM", "RCH 301", "RCH 301", "08:30AM - 09:20AM", "03:30PM - 04:20PM", "Monday, Friday -", "11:30AM - 12:20PM", "02:30PM - 03:20PM", "09:30AM - 10:20AM RCH 103", "11:30AM - 12:20PM RCH 103", "11:30AM - 12:20PM STC 0060", "02:30PM - 03:20PM", "02:30PM - 03:20PM", "10:30AM - 11:20AM RCH 101", "09:30AM - 10:20AM RCH 110", "03:30PM - 04:20PM", "07:00PM - 08:50PM", "RCH 204", "DWE 3516", "PHY 313", "02:30PM - 04:20PM DWE 3518", "08:30AM - 10:20AM RCH 204", "08:30AM - 10:20AM MC 4063", "08:30AM - 10:20AM MC 4060", "08:30AM - 10:20AM MC 4058", "02:30PM - 04:20PM MC 4060", "DWE 1515", "DWE 3522A", "Applications of the integral.", "Use trigonometric, exponential, and logarithmic functions to solve a variety of problems.", "Use differentiation to solve a variety of application problems including curve sketching, related rates, and optimization problems.", "Introduction and Review of Functions (Domain, Range, etc.)", "Compositions of Functions", "Inverses of Functions", "Odd and Even Functions, Transformations", "Piecewise and Heaviside Function", "Trigonometric and \"Inverse\" Trigonometric Functions", "Exponential and Logarithmic Functions", "Hyperbolic Trig Functions", "Limits", "Continuity", "§ 2.1-2.4", "Differentiation", "Implicit and Logarithmic Differentiation", "Curve Sketching Techniques", "Optimization Problems", "§ 4.2-4.8", "Linear Approximation, Differentials", "The Definite Integral", "Indefinite Integrals", "Integration by Substitution", "Integration by Parts", "In particular:"]}, {"course_id": 3, "course_code": "MTE 121", "course_name": "MTE121 - Digital Computation (0.50)", "term_name": "1A Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "10:30AM - 11:20AM STC 0060", "Friday -", "Friday", "10:30AM - 12:20PM E2 1792", "10:30AM - 12:20PM E2 1792", "Katherine Idzik <kidzik@uwaterloo.ca> Office: E2-1785G", "First Year Engineering Tutor:", "Navdeep Dhaliwal Monday 3:30PM-4:30PM E7-3414 navdeep.dhaliwal@uwaterloo.ca", "Katherine Idzik Monday 12:30PM - 1:30PM E2-1786", "Katherine Idzik Monday 3:30PM - 4:30PM E2-1786", "Katherine Idzik Wednesday 11:30AM -", "Oleksii Zamozhskyi Monday 6:00PM - 7:00PM RCH-204 ozamozhs@uwaterloo.ca", "Maksym Veremchuk Monday 7:00PM - 8:00PM RCH-204 mrveremchuk@uwaterloo.ca", "First year Engineering Tutor Office Hours Time Location Email Contact", "Introduction to electronic digital computers, hardware and software organization, examples of efficient numerical algorithms for basic scientific computations.", "Software design process in a high-level programming environment.", "Event-driven programming using polling of a simple mechatronic system involving sensors and motors.", "Solve software design problems at an introductory level, by considering the engineering trade-offs and constraints, as they apply to programming", "Implement procedural programs and simple objects in a high level programming language", "Design, implement, and test the software for a mechatronic system using motors and sensors", "Evaluate and select appropriate data storage and function layout for a given software problem", "Decisions", "Functions", "Pointers", "If you miss a deadline for health reasons, a Verification of Illness form should be submitted to the First Year Engineering Office.", "Exams", "***Any guidelines UW releases on verification and declaration of illness for the term, will supersede the instructions given here***", "Tools used may include inspection by a person, and a code similarity tool such as moss.", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 4, "course_code": "MATH 118", "course_name": "MATH118 - Calculus 2 for Engineering (0.50)", "term_name": "1B Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:30AM - 11:20AM RCH 110", "02:30PM - 03:20PM", "RCH 306", "09:30AM - 10:20AM RCH 105", "RCH 306", "10:30AM - 11:20AM RCH 103", "RCH 204", "02:30PM - 03:20PM", "02:30PM - 04:20PM MC 4060", "Monday -", "Monday", "Linear and separable first order differential equations, applications.", "Parametric curves and polar coordinates, arc length and area.", "Get experience in writing well-organized and readable mathematical solutions, so that you will be able to communicate mathematical or technical ideas.", "Select an appropriate integration technique and apply it to solve indefinite or definite integrals.", "Find a power series representation of a function and find a closed form for a function represented by a power series.", "Understand the formal definition of the limit of a sequence and use it to prove basic limits.", "Understand the principle of mathematical induction and use it to prove some mathematical statements.", "Integration by substitution (review)", "Integration by parts (review)", "Trigonometric integrals", "Trigonometric substitution and completing the square", "Partial fractions", "Numerical integration", "Error bounds for numerical integration", "Improper integrals", "First make up lecture occurs", "Separable DEs, linear first-order DEs", "Applications of DEs", "Sequences, limits of sequences", "Recursively-defined sequences, mathematical induction", "Appendix A", "Integral test, p-series", "Comparison tests", "Second make up lecture occurs", "-", "Winter reading week", "-", "Absolute vs. conditional convergence", "Ratio and root tests", "Estimating sums", "Power series", "Taylor and Maclaurin series", "Sums of power series", "Applications of series", "Parametric equations", "Polar coordinates, polar curves", "Area and arc length of polar curves", "In particular:"]}, {"course_id": 5, "course_code": "MTE 111", "course_name": "MTE111 - Structure and Properties of Materials (0.50)", "term_name": "1B Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Structure and Properties of Materials Winter 2025", "08:30AM - 11:20AM E3 2119", "08:30AM - 11:20AM E3 2119", "09:30AM - 10:20AM MC 4058", "09:30AM - 10:20AM MC 4042", "Neel Sanjay Agarwal nsagarwal@uwaterloo.ca", "Claire Thompson claire.thompson@uwaterloo.ca", "The relevance of materials to engineering practice; the relationships between macroscopic physical properties (including mechanical, photonic, thermal, electrical, and magnetic properties) and microscopic causes based on fundamental principles (including electronic and atomic structures, atomic bonding, crystal structure, and microstructure); description of the differences in macroscopic physical properties of metals, polymers, ceramics, semiconductors, and composite materials in terms of microscopic causes.", "Define mechanical properties of materials and relate them to atomic structure and imperfections in the atomic arrangements.", "Differentiate between different materials used in engineering and will be able to select appropriate materials for a given application.", "Relate fundamental concepts to properties of materials", "Demonstrate hands-on skills including proper protocols and operating procedures for engineering tools related to materials characterization", "Demonstrate correct data evaluation with basic statistical methods", "Jan 6           Introduction to Materials Science and Engineering                    Ch. 1, Background Reading only", "(unit cells, crystallographic points/planes/directions, ionic & covalent bonds, XRD)", "Mar 24       Electronic & Magnetic Materials                                                    Ch. 19.1, 20.1-.3", "W.D. Callister, Materials Science and Engineering: An Introduction (supplemental) No", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 6, "course_code": "MTE 119", "course_name": "MTE119 - Statics (0.50)", "term_name": "1B Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 11:20AM STC 0040", "Email: stewart.mclachlin@uwaterloo.ca", "Basic concepts of mechanics, vectors.", "Analysis of trusses and frames.", "Distributed forces, centroids, and moments of inertia.", "Internal shear and bending moments in beams.", "MTE 119 provides a basic understanding of the part of mechanics which is concerned with the equilibrium of bodies under the action of forces.", "Topics covered include basic concepts of mechanics and vectors, Free-Body diagrams and equilibrium of particles, Free-Body diagrams and equilibrium of rigid bodies, force systems, analysis of trusses, beams and frames, distributed forces, centroids and moments of inertia, internal shear and bending moments in beams, friction and application of frictional forces.", "Weekly Problem Sets: A selection of problem set questions from the course textbook will be posted each week.", "Weekly Checklist: A checklist will be posted in Learn each week that indicates the course material being covered and expected progress each week.", "Draw complete free-body diagrams and write appropriate equilibrium equations from the free-body diagram, including the support reactions on a structure.", "Apply the concepts of equilibrium to various structures.", "Able to calculate moments, centers of mass, and forces for particular structures.", "Describe position, forces, and moments in terms of vector forms in two and three dimensions.", "Simplify systems of forces and moments to equivalent systems (1)", "Determine the internal forces in a structure.", "A knowledge base for engineering", "3 Chapter 4.1-4.4", "9 Chapter 7.1-7.2", "10 Chapter 8.1-8.2", "1 Introduction", "2.1 Scalars and Vectors", "2.2 Vector Operations", "2.3 Vector Addition of Forces", "2.4 Addition of a System of Coplanar Forces", "2.5 Cartesian Vectors", "2.6 Addition of Cartesian Vectors", "2.7 Position Vectors", "2.8 Force Vector Directed Along a Line", "2.9 Dot Product", "3 Equilibrium of a Particle", "3.1 Condition for the Equilibrium of a Particle", "3.2 The Free-Body Diagram", "3.3 Coplanar Force Systems", "3.4 Three-Dimensional Force Systems", "4.1 Moment of a Force–Scalar Formulation", "4.2 Cross Product", "4.3 Moment of a Force–Vector Formulation", "4.4 Principle of Moments", "4.5 Moment of a Force about a Specified Axis", "4.7 Simplification of a Force and Couple System", "4.8 Further Simplification of a Force and Couple System", "4.9 Reduction of a Simple Distributed Loading", "5 Equilibrium of a Rigid Body", "5.1 Conditions for Rigid-Body Equilibrium", "5.2 Free-Body Diagrams", "5.3 Equations of Equilibrium", "5.4 Two- and Three-Force Members", "5.5 Free-Body Diagrams", "5.6 Equations of Equilibrium", "6 Structural Analysis", "6.1 Simple Trusses", "6.3 Zero-Force Members", "7.1 Internal Forces Developed in Structural Members", "7.2 Shear and Moment Equations and Diagrams", "8 Friction", "8.1 Characteristics of Dry Friction", "8.2 Problems Involving Dry Friction", "10.1 Definition of Moments of Inertia for Areas", "10.5 Product of Inertia for an Area", "Design Project - (February 13 - March 13) 10%", "Design Project (10%):", "Missing a test", "Outside of a self-declared illness, it is your responsibility to attend and complete the test during the assigned test period.", "It is a 2.5 hours, cumulative, closed-book and closed-notes exam.", "Legible and organized projects, quizzes and exams", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as the use of statics principles in a practical design project.", "Library for research-based assignments"]}, {"course_id": 7, "course_code": "MTE 140", "course_name": "MTE140 - Algorithms and Data Structures (0.50)", "term_name": "1B Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Algorithms and Data Structures Winter 2025", "08:30AM - 09:50AM STC 0040", "Friday -", "Friday", "08:30AM - 10:20AM", "Friday 2:30pm – 3:30pm EST in E7 6336", "Put MTE 140 in the email subjectline followed by a briefdescription of the email subject.", "This course emphasizes the following topics: structured software design data structures, abstract data types, recursive algorithms, algorithm analysis and design, sorting and searching, hashing, and problem-solving strategies.", "View requirements for MTE 140", "Performing rigorous complexity analyses of simple algorithms and data structures, (Attributes: 1 & 2)", "Comparing different data-structuring techniques from the point of view of time and memory requirements, (Attributes: 1 & 2)", "construct meaning from oral, written, and graphic communication through interpreting, exemplifying,", "Instruction & Assessment:", "What you should be doing each week", "Suggested problem sets & solutions", "Activities & Deliverables", "1 Jan 6 – 10 Introduction and Review of Programming Fundamentals", "Pointers and Dynamic Memory Allocation", "6 Feb 10 – 14 Stacks and Queues", "Midterm Exam: Friday Feb 28 at 8:30am in E7 3343 and E7 3353", "\"Data Structures and Algorithms in a Nutshell” by A. Wong et al (sku 281120120157B).", "Students should use original variable names and comment their code thoroughly with explanation to demonstrate originality.", "A student must save a copy of the submitted work on his or her personal computer or personal file system in case of any website problem.", "Access to calculators and programming environment is allowed.", "AI screening tools might be used by the teaching team", "COVID-19 Emergency Remote Teaching-Learning for In-Class Sessions:", "COVID-19 Emergency Self-Isolation:"]}, {"course_id": 8, "course_code": "MTE 182", "course_name": "MTE182 - Physics 2: Dynamics (0.50)", "term_name": "2A Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "E7 3343", "E. Abdel-Rahman", "Eihab M. Abdel-Rahman  E7-6422 --", "Yasser Shama E7-6427 F 11:30 AM–12:30PM", "Energy and momentum methods.", "Systems of particles.", "Kinematics and kinetics of rigid bodies; planar motion.", "Dynamics is the study of motion, its patterns and causes.", "This is a first course in dynamics limited to planar motion of particles and rigid bodies.", "It covers:", "• planar kinematics: the patterns of motion of particles and rigid bodies in a plane", "Plan a motion trajectory and determine the forces required to obtain it", "Evaluate the kinetic and potential energy of an object", "Evaluate the power and efficiency of a machine", "Analyze events involving impacts and explosive forces", "Evaluate the kinetic and potential energy of an object.", "Evaluate the power and efficiency of a machine.", "- The project will be carried out in groups of 4.", "Notice of Recording"]}, {"course_id": 9, "course_code": "MTE 201", "course_name": "MTE201 - Experimental Measurement and Statistical Analysis (0.50)", "term_name": "2A Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Experimental Measurement and Statistical Analysis Winter 2025", "E7 3343", "03:30PM - 04:20PM E7 3343", "Techniques of sampling and statistical estimation.", "Introduction to sensors and data acquisition tools.", "The t-test and chi-squared test.", "Curve fitting by least squares.", "Correlation and regression.", "Design of experiments.", "View requirements for MTE 201", "Understand the basic concepts of probability, random variables, probability distributions, sampling distribution and central limit theorem", "Use statistical models and concepts including probability, hypothesis testing and confidence interval to solve engineering problems", "Demonstrate working knowledge of experimental measurements, data collection and uncertainty analysis through open-ended discovery exercises and projects", "Introduction:", "Statistics in engineering", "Summary of data", "Stem and leaf diagrams", "Histograms and box plots", "Introduction to probability", "Normal distribution Normal distribution", "Sampling", "t distribution", "Discrete variables", "for discrete data", "Experimental uncertainty analysis Systematic and random error PROBLEM SET #4 Hypothesis testing", "23 factorial design", "Response surfaces", "Empirical modeling", "Linear regression", "Inferences based on least squares estimators", "TBD", "Labs: Lab exercise #1 will be assigned during the second week of the term to demonstrate data collection and analysis concepts from the course material.", "Students will work in groups of two, collecting data and performing a statistical analysis for a physical quantity of their choosing.", "Students must observe safety rules and regulations while working in labs and fabrication spaces, in accordance with departmental health and safety rules and regulations."]}, {"course_id": 10, "course_code": "MTE 202", "course_name": "MTE202 - Ordinary Differential Equations (0.50)", "term_name": "2A Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Ordinary Differential Equations Winter 2025", "MTE 202", "01:50PM E7 3343", "01:50PM E7 3343", "First order differential equations; direction field; separable equations, integrating factors and simple transformations; applications; second and higher order ODE's with constant coefficients - transient and steady state solutions; The Laplace Transform; systems of equations - reduction to single equation; matrix differential equations; introduction to partial differential equations.", "View requirements for MTE 202", "Specifically, we define what ordinary differential equations are and how they relate to the physical problems encountered in simplified engineering systems.", "Techniques for solving first and higher order differential equations, linear equations with constant and variable coefficients, and non-linear equations are introduced.", "Applications involving simple dynamical systems and principles of mass, momentum, and heat conservation will emphasize the role of ordinary differential equations in understanding the behaviour of physical systems.", "Classify a differential equation with respect to order and form", "Understand what it means for a function to be a solution to a ODE/IVP", "Use appropriate analytical method(s) to find a solution to different types of ODE problem", "Select appropriate analytical method(s) to solve ODEs", "Formulate simplified models which represent the behaviour of simplified engineering systems", "Find solutions to said simplified models and provide a meaningful interpretation of found solution", "a) Classify a differential equation with respect to order and form", "b) Understand what it means for a function to be a solution to a ODE/IVP", "2. Find explicit solutions to specific classes", "a) Be able to find explicit solutions for particular first or second order ODES and systems of first order equations using a range of approaches which includes the Laplace transform", "b) Determine the correct solution technique to solve a problem", "3. Effectively apply the concepts of differential equations in the analysis of simplified engineering systems", "a) Formulate simplified models which represent the behaviour of simplified engineering systems", "b) Find solutions to said simplified models and provide a meaningful interpretation of found solution", "Order Linear ODEs ~ 3 Lectures", "Linear Independence (Wronskian, Variation of Parameters, & Reduction of Order) ~ 3 Lectures", "Cauchy-Euler & Variable Coefficient ODEs ~ 1 Lectures", "Systems of 1st order ODEs ~ 3 Lectures", "Giordano and Weir:  Differential Equations: A Modelling Approach, Addison-Wesley - $120", "Additionally, the supply and laptop recommendations from the department can be found via:", "You will be permitted calculators and a single sided (US letter page - 8.5 by 11 inches) cheat sheet where you can write anything you want except worked examples.", "Solutions to these problem sets will be available on LEARN the following Monday.", "This course includes the independent development and practice of specific mathematical skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 11, "course_code": "MTE 219", "course_name": "MTE219 - Mechanics of Deformable Solids (0.50)", "term_name": "2A Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["E7 3343", "E7 3343", "Mechanical & Mechatronic Engineering Department-MME", "Amirsalar Anousheh", "Amirsalar Anousheh, Wednesday 11:30-12:30 E2-2354F", "Introduction to mechanical response of materials and stress-strain relationships.", "Behaviour of prismatic members in tension, compression, shear, bending and torsion.", "By the end of this course students should be able tounderstand, apply and utilize the concepts of structural stress, strain and elastic behaviour and their applications to analyze structures under load for strength, and design of simple structures.", "Utilize the knowledge to design simple structures Relevant course activities/assessments: project", "Day", "MTE119 review- Concept of Equilibrium", "Stress in elastic range, Brittle fracture plane, Angle of twist, Statically indeterminate shafts, Design of transmission shafts", "Eccentric loading, Unsymmetrical bending", "Mohr circle, The three Mohr circles and maximum shear stress, Yield Criteria", "24-28", "Chapter 8: Section 8.4: Stress under combined loading Assignment #10", "Chapter 8.3", "Strength analysis"]}, {"course_id": 12, "course_code": "MTE 262", "course_name": "MTE262 - Introduction to Digital Logic (0.50)", "term_name": "2A Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Introduction to Digital Logic Winter 2025", "02:30PM - 03:20PM", "E7 3343", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "Number systems, logic gates, Boolean algebra.", "Karnaugh maps, and", "Implementation of combinational and sequential logic circuits on Field Programmable Gate Arrays (FPGA) boards.", "Sequential logic and state machines.", "Use logic gates and common circuit blocks to build and analyze combinational logic circuits", "Explain different number systems and convert between bases, in particular decimal and binary and decimal and hexadecimal, which are commonly used in digital systems", "Manipulate and simplify circuits using Boolean algebra and Karnaugh maps", "Implement digital logic using industry grade tools such as Field Programmable Gate Arrays (FPGAs), Programmable Logic Controllers (PLC) and system simulations", "Develop and use state machines to implement and analyze sequential circuits", "1 Introduction to Digital Logic", "3 Introduction to VHDL", "5 Boolean Algebra", "7 Number Systems", "9 Sequential Circuits", "W11 (Mar-25) PLC Introduction + Simulation", "While a cell phone can be used, a device with a larger screen will give you a better experience.", "The only exception to this rule is under extenuating circumstances, accommodations and submission of VIF (in case of illness).", "The only exception to this rule is under extenuating circumstances, accommodations and submission of VIF (in case of illness).", "There will be a total of 5 labs, where you will work in groups and will take place in-person in E7 – 3419.", "No extensions are allowed in submission of labs except under extenuating circumstances, accommodations and in case of approval of Verification of Illness.", "Exams", "**", "Do I have to do the labs again?", "Can I reuse material from previous lab submissions?", "No, you must start with a blank page and redo the labs as though you are completing them for the first time.", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as manipulating digital logic and programming devices such as PLCs.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 13, "course_code": "MTE 203", "course_name": "MTE203 - Advanced Calculus (0.50)", "term_name": "2B Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Advanced Calculus Fall 2024", "10:30AM - 11:20AM E7 3343", "11:30AM -", "12:20PM E7 3343", "Discussions", "Questions of a personal nature", "Prof. Patricia Nieva", "Email: pnieva@uwaterloo.ca", "Location: E5 - 3034", "Cannot come in person?", "Mr. Ahmed Shahin", "Email: ahmed.shahin@uwaterloo.ca", "Email: amir.mahdipour@uwaterloo.ca", "Email learnhelp@uwaterloo.ca", "Review of vectors and vector operations; 3-D analytic geometry and space curves; multivariable calculus, including partial differentiation, total differential, chain rule, directional derivative, gradient operator, maxima and minima; multiple integrals - surface area, volume, and moments of inertia; line and surface integrals; vector theorems; complex analysis including limits, analytic functions, complex line integral, Cauchy's Integral Formula; Fourier Series (real and complex) and Fourier Integrals.", "Scalar functions", "Vector functions", "Derivatives", "Integration", "Complex Analysis, including Limits, Analytic Functions, Complex Line Integral, Cauchy's Integral Formula; Fourier Series (real and complex) and Fourier Integrals, are covered as part of MTE 220 and SYDE 252.", "Understand the basic concepts and know the basic techniques of differential and integral calculus of different functions of several variables", "Apply the course concepts to physical systems, for example describing position, velocity and acceleration in 3D space", "Introduction to MTE 203, Vectors and 3D Analytic Geometry", "Planes in 3D, Distance in 3D", "Introduction to Matlab", "Path and Curves", "Differentiation and Integration of Vector Functions (Disp.,Vel., Acc.)", "Le8", "Frenet Vector Frame", "24-Sep", "24-Sep", "Multivariable Functions, Contour Maps and Level Surfaces", "Partial Derivatives of a Function of 2 Variables", "Higher Order Partial Derivatives", "Application of Higher Order Partial Derivatives", "MLab2", "Graphing and Contour Plotting", "Directional Derivative and the Gradient Vector", "Applications of the Directional Derivative", "Tu5", "Trim - 12.10", "Tu6", "Absolute and Constrained Maxima and Minima", "Double Integrals and their evaluation by Double Iterated Integrals", "Double Integrals Applications and Polar Coordinates", "Tu6", "Triple Integrals: Cartesian Coordinates and Applications", "Line Integrals, Introduction to Vector Fields", "Line Integrals Involving Vector Fields", "Fundamental Theorem and Conservative Fields", "Surface Integrals (Scalar and Involving Vector Functions)", "Divergence and Divergence Theorem", "TBD", "i-clicker Cloud (REEF) polling system REEF account or i>clicker remotes allowed Yes", "Worst knowledge quiz grade will be dropped", "There are eleven knowledge review quizzes in total during the term.", "I-clicker points are only given if you attend and participate in the polling during the in-person lectures.", "There are no make-up i-clicker points given.", "Why should I participate in i-Clicker/REEF sessions when they count for so little?", "When response to an i-Clicker/REEF question reveals a misconception in a substantial proportion of the class, we will have the opportunity to go over that material.", "They will introduce you to the MatLab software and will use some of its features to illustrate concepts from MTE 203.", "Worksheet and Project files should be submitted in PDF form, and all *.m Matlab files should be zipped before submission.", "However, a certain degree of collaboration is allowed in the lab within the following limits:", "• Sharing and debugging each other's code", "• Looking at each other's code", "• Giving exact steps to solve a question", "Access to Matlab", "You can access Matlab in three ways:", "Access Matlab through the Matlab online cloud", "Many of these responsibilities are described at the first lecture and/or captured in the policies of the University.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 14, "course_code": "MTE 204", "course_name": "MTE204 - Numerical Methods (0.50)", "term_name": "2B Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Numerical Methods Fall 2024", "MTE 204", "MTE 204 001", "08:30AM - 10:20AM E7 3343", "09:30AM - 10:20AM E7 3343", "Both online and in-person meetings will begin in the second week of the course.", "MTE 204:", "Number systems and machine errors; roots of non-linear equations; matrix calculations; Eigenvalue and Eigenvector calculations; interpolation and approximation; numerical integration and solution of ODE's (linear and non-linear) and systems of ODEs; calculation of series; solution methods for PDE's; use of numeric and symbolic computing tools.", "View requirements for MTE 204", "This course applies numerical methods to solve complex engineering problems where exact analytical solutions are impractical.", "MTE 202 - Ordinary Differential Equations is a pre-requisite course for MTE 204.", "MTE 100 – Introduction to Mechatronics Engineering", "MATH 115 - Linear Algebra", "MATH 116 - Calculus I", "MTE 111 – Introduction to Materials", "MTE 119 - Statics", "MTE 219 - Mechanics of Deformable Solids", "SYDE 182 - Dynamics", "Develop and implement algorithms for solving linear algebraic equations, utilizing techniques such as Gaussian elimination, LU decomposition, and iterative methods.", "Construct and evaluate curve fitting models using interpolation and regression techniques to approximate data and make predictions (1,2,3,4,5).", "Apply numerical techniques to partial differential equations (PDEs) using methods such as finite difference, finite element, and finite volume methods, and interpret the results in the context of engineering problems (1,2,3,4,5).", "The numbers in the parathesis refer to the Engineering Graduate Attributes defined by the Canadian Engineering Accreditation Board (CEAB):", "A knowledge base for engineering: Demonstrated competence in university-level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "Problem analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, and economic, environmental, cultural, and societal considerations.", "Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking, and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Impact of engineering on society and the environment: An ability to analyze social and environmental aspects of engineering activities.", "Such ability includes an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society, the uncertainties in the prediction of such interactions, and the concepts of sustainable design and development and environmental stewardship.", "Life-long learning: An ability to identify and to address their own educational needs in a changing world in ways sufficient to maintain their competence and to allow them to contribute to the advancement of knowledge.", "MTE 204-Fall 2024-Schedule of Course Activities and Assessments", "Make-up lectures are held in E7-3343 on Mondays and Tutorial on Tuesdays in E5-3102 on the dates and times indicated below.", "FRI", "8:30-10:20", "8:30-10:20", "8:30-10:20", "8:30-10:20", "8:30-10:20", "8:30-10:20", "8:30-10:20", "8:30-10:20", "Study Day", "Study Day", "Fall 2024 - MTE204 - Numerical Methods -Course Topics", "Modeling Computers and Error Analysis Part 1", "Approximation and Round-Off Errors Chapter 3", "Error definition & Round-off errors 3.3", "Roots of equations; Graphical methods 5.1", "Bracketing method for root finding: Bisection method 5.2", "Open methods for root finding: Fixed point & Newton Raphson 6.1, 6.2", "Secant method & Numerical root-finding: an engineering application 8.4", "Linear Algebraic Equation Part 3", "Systems of linear equations – Introduction & Naive Gauss elimination PT3.1-PT3.3, 9.1, 9.2", "Elimination Pitfall & Improving Techniques: pivoting and scaling  9.3, 9.4", "Special matrices; Gauss-Seidel & its improvement techniques 11.1, 11.2", "Least-Square Regression Chapter 17", "Linear regression and Linearization of nonlinear relationships 17.1", "Numerical Differentiation and Integration Part 6", "Integration of Equations Chapter 22", "Ordinary Differential Equations Part 7", "Euler’s method & its improvements 25.1, 25.2", "Ordinary Differential Equations Part 7", "General methods for boundary value problems 27.1", "Case Studies: Ordinary Differential Equations  Chapter 28", "Examples/Applications 28.1-28.4", "Introduction to finite difference method and finite volume method PT8.1-PT8.2", "Finite Difference: Elliptic Equations Chapter 29", "Solution techniques 29.2", "Boundary conditions  29.3", "Finite Difference: Parabolic Equations Chapter 30", "The heat conduction equation  30.1", "A simple implicit method  30.3", "Frank-Nicolson method 30.4", "Introduction to FEM: The general approach  31.1", "Major Exams: Both midterm and final exams are closed-book with a formula sheet permitted.", "Quizzes: The online quizzes will help you to solidify your understanding of the fundamental concepts.", "Sexual Violence Prevention & Response Office (SVPRO) supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 15, "course_code": "MTE 220", "course_name": "MTE220 - Sensors and Instrumentation (0.50)", "term_name": "2B Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Sensors and Instrumentation Fall 2024", "10:00AM - 11:20AM E7 3343", "E7 3343", "01:30PM - 04:20PM E3 3164", "MTE 220 202", "01:30PM - 04:20PM E3 3164", "01:30PM - 04:20PM E3 3164", "Email:    derek.wright@uwaterloo.ca", "Bookings include a Teams link when in-person meetings are not possible.", "Email:    m4alsaad@uwaterloo.ca", "Review of circuit theory; input-output relationships, transfer functions and frequency response of linear systems; operational amplifiers, operational amplifier circuits using negative or positive feedback; diodes, operational amplifier circuits using diodes; analog signal detection, conditioning and conversion systems; transducers and sensors, difference and instrumentation amplifiers, active filters.", "View requirements for MTE 220", "Analyze circuits consisting of linear and nonlinear components and sensors", "Design signal conditioning circuits based on given requirements", "Understand basic embedded system power supply options", "Use appropriate lab equipment to build, debug, and characterize sensor circuits for mechatronic systems", "The textbooks can provide supplemental information if needed.", "Review of Linear Circuit Fundamentals", "Engineering and Circuit Conventions", "Schematics and Devices", "Analysis Tools and Techniques", "Opamps", "First-Order Step Response", "Sinusoidal and Phasor Analysis", "Opamps and Opamp Circuits", "Opamp and Amplifier Circuit Models", "Comparators and Schmitt Triggers", "Single-Ended and Differential Signalling", "Instrumentation Amplifiers", "Filters", "Introduction to the Laplace Domain", "Transfer Functions and Bode Plots", "First-Order Filters", "Second- and Higher-Order Filters", "Sensors and Interfacing", "Sensor Characteristics", "Sensor Interfacing", "Passive Sensors and Techniques", "Active Sensor and Techniques", "Introduction to Diodes", "Diode Operation and Circuit Models", "Diode Types", "Diode Analysis Techniques", "Diode Circuits", "Introduction to Transistors", "MOSFET Operation and Circuit Models", "MOSFETs as Switches (Digital)", "MOSFETs as Amplifiers (Analog)", "Powering Embedded Systems", "Power Sources", "Battery Basics", "Power Conditioning Circuits", "Current Sensing", "9/19", "Hall Effect Sensor & Schmitt Trigger", "Power PCB", "PWM & Filters", "Distance Sensing", "Its grade is weighted to ensure that students who graduate MTE 220 can demonstrate competency in the learning outcomes.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 16, "course_code": "MTE 241", "course_name": "MTE241 - Introduction to Computer Structures and Real-Time Systems (0.50)", "term_name": "2B Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Computer Structures and Real-Time Systems Fall 2024", "08:30AM - 09:20AM E7 3343", "08:30AM - 10:20AM E7 3343", "M. Cooper-Stachowsky", "MTE 241 202", "M. Cooper-Stachowsky", "M. Cooper-Stachowsky", "11:30AM -", "12:20PM E7 3343", "All software and also the law and ethics course one time -- let's discuss contract law if you're up for it?", "Mike Cooper-Stachowsky -- mstachowsky@uwaterloo.ca", "Introduction to computer organization, basic real-time concepts, process management, interprocess communication and synchronization, memory management, resource management, interrupt handling, concurrent programming, file systems.", "View requirements for MTE 241", "Describe the basic components of a computer system [KB(I)]*", "Perform Memory-Mapped I/O [KB(D)]", "Program a real-time application with multiple coordinated tasks [Des(D),Tools(D)]", "STM32F401RE Nucleo Board A microcontroller board for the labs.", "A Practical Introduction to Real-Time Systems For Undergraduate Engineering It's the textbook, available free in PDF form: https://ece.uwaterloo.ca/~dwharder/icsrts/Lecture_materials/A_practical_introduction_to_real-time_systems_for_undergraduate_engineering.pdf No", "Available for free in PDF form: https://github.com/jzarnett/mte241/ Yes", "You should purchase this board well in advance of the first lab and install the STM32CubeIDE software to test that it works.", "A small number of lab computers will have the software installed for your use.", "You will use the STM32F401RE microcontroller board and the STM32CubeIDE to write a real-time operating system in the C language.", "The questions are designed to test your understanding of the concepts you should have learned in the lab.", "Exams are in-person, closed-book.", "This paper must be a standard letter size.", "Laptop and Device Policy: The human visual system has evolved to perceive saber-toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text-mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "In either case, we will cancel all the in-person lectures and in-class exercises during the relevant period and try to have some online synchronous video lectures during that period.", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, Chat- GPT) and how such tools can be used to write and test code.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 17, "course_code": "MTE 252", "course_name": "MTE252 - Linear Systems and Signals (0.50)", "term_name": "2B Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Linear Systems and Signals Fall 2024", "08:30AM - 09:50AM E7 3343", "11:30AM -", "12:20PM E7 3343", "Email: nmaftoon@uwaterloo.ca", "Models and analysis of linear systems.", "Discrete time systems, continuous time systems; difference and differential equations; impulse and frequency response.", "Complex frequency, functions of complex variable transform domain techniques: Z transforms; Fourier analysis, Laplace transform.", "Transfer functions and frequency response, frequency domain analysis of linear systems; sample theory, stability, and linear filters.", "View requirements for MTE 252", "Through these interactions we can identify systems, manipulate them or design systems that help us in one way or another.", "Sometimes we do this the other way around: we are interested in a signal (e.g., a clinical image) and we design a system to give us the useful signal to extract specific useful information.", "Perform time domain and frequency domain analysis of continuous-time and discrete- time signals and systems using convolution, Laplace transform, z-transform and Fourier analysis [", "Design filters and perform signal processing and filtering [", "Numbers in brackets refer to their Associated C.E.A.B Graduate attributes", "Week of", "----", "----", "----", "MID-TERM WEEK", "3rd Edition", "2nd Edition", "Week of", "Book sections to read", "Book sections to skim", "Book sections to read", "Book sections to skim", "Convolution sum & Convolution integral 3.8; 2.4;   3.8; 2.4", "MID-TERM WEEK", "\"Linear Signals and Systems, 3rd ed.\"", "Matlab Access", "Remote access:https://uwaterloo.ca/engineering-computing/remote-desktop-connection", "Each of these assignments may include analytical, numerical (using Matlab, or a language of your choice) and explanatory components exploring fundamental aspects of the material covered in the course.", "Students will work in teams of 4 to create a signal-processing program for cochlear implants.", "Late project submission rules", "If your team misses a phase submission deadline, your team can still submit the deliverables of the phase for a maximum half of the grade for that phase.", "This course includes the independent development and practice of specific skills, such as system design, filter design and signal processing.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 18, "course_code": "MTE 309", "course_name": "MTE309 - Introduction to Thermodynamics and Heat Transfer (0.50)", "term_name": "3A Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Introduction to Thermodynamics and Heat Transfer Winter 2025", "08:30AM - 09:50AM E7 3353", "08:30AM - 09:50AM E7 3353", "An appointment is preferred for consultations longer than 15-20 mins.", "Energy transfer as work and heat, and the First Law of thermodynamics.", "Control-mass and control-volume analysis.", "The Carnot cycle and its implications for practical cyclic devices.", "Introduction to heat transfer by conduction, convection, and radiation.", "Basic formulation and solution of steady and transient problems.", "Relating these concepts to the problem at hands can prove challenging, hence, the existence of strict methodologies.", "To convey concepts of engineering (macroscopic) thermodynamics and heat transfer", "To apply these concepts to solve practical engineering problems", "• Conduct energy analysis based on the first and second laws of thermodynamics", "• Calculate the property values of simple compressible substances", "• Conduct analysis for various modes of heat transfer under steady and transient conditions", "• Calculate the rate of heat transfer for basic engineering problems", "1             Basic concepts of thermodynamics: Systems and properties (Chap. 1 and 2)             3", "Total                                                                                                                         36", "Exams will be given in class in-person.", "Exams will be close book and close lecture note; but crib sheet (double-sided letter-sized) is allowed:", "Other allowed items: pens/pencils, erasers and a simple calculator without memory/programmable functionalities.", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as those specified in the course objectives and learning outcomes stated earlier.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 19, "course_code": "MTE 320", "course_name": "MTE320 - Actuators and Power Electronics (0.50)", "term_name": "3A Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:30AM - 11:20AM E7 3353", "11:30AM - 12:20PM E7 3353", "Office &Ext", "E-mail", "Ramadan El-Shatshat", "Duty", "E-mail", "Ahmed Sayed Abdelaal Abdelaziz", "Ahmed Shaban Omar", "Review of circuit analysis and basic electromagnetic theory.", "Introduction to typical speed and torque control techniques of motors.", "View requirements for MTE 320", "This course provides an in-depth study of the principles and applications of actuators and power electronics in modern engineering systems.", "It combines foundational knowledge in circuit analysis and electromagnetic theory with practical skills for analyzing and operating electromechanical systems.", "Topics include the fundamentals of AC circuits, magnetic circuits, transformers, DC machines, and power electronics, with a focus on their use in motor control and power conversion.", "The course also includes a comprehensive laboratory component that reinforces theoretical concepts through hands-on experiments.", "Students will work in teams to enhance their understanding of actuators and power electronic systems.", "Understanding AC circuit concepts, including phasor notation, power factor correction, and magnetic circuits with losses, to analyze electric systems.", "Understand the operation, characteristics, and control techniques of single-phase transformers and DC machines, including efficiency, regulation, and speed control.", "Analyze power electronic converters, including semiconductor devices and DC/DC converters, for various applications.", "Implement speed control techniques for DC motors using power electronic converters to optimize performance.", "Develop strong problem-solving and innovative thinking skills to address the evolving needs of actuators' operation and control", "Acquire a solid foundation in the theoretical and practical aspects of electric drives and control, preparing for a successful career in electrical engineering.", "1 AC Circuits: Single-phase circuits, phasor notation, average and RMS values, complex power, and power factor correction.", "2 Magnetic Circuits: Electric and magnetic circuit analysis, magnetic field generation, induced voltages and forces, and loss mechanisms.", "3 Transformers: Theory of operation, equivalent circuits, efficiency, regulation, and special applications in power systems.", "5 Power Electronics: Semiconductor devices, power electronic converters, DC/DC converter, and their applications.", "Motor Control: Basics of motor speed control using power electronic converters for DC motor performance optimization.", "with a clear understanding of what you are meant to accomplish, or with clear questions, so that the Teaching Fellows can help you.", "In no case will a lab report be accepted more than a week past the deadline; if a valid reason exists for being unable to hand in the lab within the week following the deadline, then the lab will be assigned a weight of zero and the remaining labs will be reweighted accordingly."]}, {"course_id": 20, "course_code": "MTE 321", "course_name": "MTE321 - Design and Dynamics of Machines (0.50)", "term_name": "3A Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Design and Dynamics of Machines Winter 2025", "MTE 321", "10:00AM - 11:20AM E7 3353", "All the MME class schedules can be found here:", "Office Hours: Fridays from 12:30pm to 1:30pm in E3-4102-8.", "Principles of the geometry and motion in linkages and mechanisms.", "Computer-aided kinematic and kinetic analysis of mechanisms.", "Static failure and yield criteria in ductile and brittle materials.", "Shaft design under static and fluctuating loads.", "View requirements for MTE 321", "Identify different types of mechanisms and their degrees of freedom", "Analyze and obtain displacements, velocities, accelerations, and forces at different points of a mechanism using analytical methods", "Design and fabricate mechanisms with three precision points to do specific tasks", "Design and analyze 1DoF mechanims", "Analyze the stress distribution in mechanical members under combined loading", "Design ductile and brittle parts to prevent yield failure under static loading", "Design mechanical parts to prevent fatigue failure under fluctuating loading", "Simplify complicated mechanical design problems in order to predict failure under static and fluctuating loads", "Identify, represent and communicate a mechanical/mechanism design problem", "Work effectively as a member of a team", "Apply project management skills and techniques", "Part I", "Dynamics of Machines", "Chapter 1: Introduction to Mechanisms", "Kinematic analysis of 2-loop/multi-loop mechanisms", "4 (Jan 27) Chapter 4: Kinetic Analysis of Mechanisms", "Governing equations, Shaking forces and moments, Analytical Kinetic analysis of mechanisms", "Analytical Kinetic analysis of mechanisms", "Synthesis of four-bar linkages and crank-slider mechanisms with 3-precision points  Project 1 Solving Session", "Mechanical Design", "Analysis of a 3D real-life problem: yield analysis of a steel shaft with gears Project 1 Solving Session", "Stress-life method, S-N diagram and the endurance limit", "Endurance limit modifying factors, Fatigue stress concentration factor", "Fatigue and yield analysis of a 3D real-life shaft design problem, shaft components, deflection of shafts/beams Project 2 Solving Session", "⎩", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 21, "course_code": "MTE 325", "course_name": "MTE325 - Microprocessor Systems and Interfacing for Mechatronics Engineering (0.50)", "term_name": "3A Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Microprocessor Systems and Interfacing for Mechatronics Engineering Winter 2025", "03:30PM - 04:20PM", "E5 3102", "01:30PM - 04:20PM E3 3155", "01:30PM - 04:20PM E3 3155", "01:30PM - 04:20PM E3 3155", "book a meeting", "E7-3412", "Synchronization and data flow; interfacing to sensors and actuators;", "parallel, serial, and analog interfacing; buses; direct memory access (DMA); interfacing considerations; privacy and security considerations.", "View requirements for MTE 325", "Summarize the flow of data between software and hardware elements in an embedded system", "Describe the trade-offs between implementation alternatives for both hardware and software", "Outline the ethical implications of embedded system design choices", "Use industry-standard tools to implement and debug embedded systems", "Design an embedded system to perform a given task", "Projects provide students with an opportunity to explore selected concepts in a real-world context.", "Lectures and tutorials are held in person and attendance is expected at all sessions for learning and skill development.", "Jan 20th and Jan 22nd  Lab 1 – Introduction and setup (watch Learn for signup instructions closer to)", "Lab 2 – Synchronization Techniques", "Course Introduction An introduction to the teaching team, course expectations, deliverables, marking scheme, and a very brief introduction to interfacing concepts.", "Embedded Systems A review of fundamentals of embedded systems and the terminology associated with embedded systems.", "Embedded Design Model An introduction to the embedded design model used to develop a system for the remainder of the course.", "Embedded Software An overview of they key differences between software for embedded systems and general software development.", "Synchronization, Data Generation and Data Transfer A model for analyzing synchronization behaviour and performance and examples of synchronization analysis.", "Buses - Data Transfer A comparison of the functional behaviour and timing behaviour of synchronous, asynchronous, and partially interlocked asynchronous.", "Parallel Interfacing A detailed examination of the design of parallel interfaces.", "This includes an examination of the role of the interface in matching bus timing and signaling characteristics with a device's timing and signaling characteristics.", "Analog Interfacing An introduction to digital-to-analog interfacing, analog-to-digital interfacing, and sample-and-hold circuitry.", "This includes a comparison of asynchronous communication techniques and synchronous techniques as well as the protocols for serial communication.", "Buses - Arbitration A brief examination of alternatives for bus arbitration including a discussion of the operation and characteristics of daisy chained and non-daisy chained bus arbitration techniques.", "A brief examination of direct memory access including a discussion of hardware design implications, software implications, and system performance.", "Security and Ethics An overview of common security terminology and why it has become increasingly important for embedded systems.", "The ethical implications of today’s embedded systems applications will also be discussed.", "Other References", "Supplementary readings are available for most chapters on Learn No $0.00", "You are encouraged to subscribe in order to receive email copies of announcements.", "The LEARN calendar has been setup to specify reminders of important dates for the course.", "The Project module contains a description of the projects as well as files and resources that may be useful in completing the projects.", "You may use these exams to assess your preparation for the exams in the course.", "Your project average includes your grades for all project demonstrations and submissions.", "Students will need to make design decisions and use the resources that are typically available for a particular embedded system application.", "The purpose of this project is to provide practice with applications of course concepts and experience tackling an open-ended interfacing problem in preparation for their 3rd and 4th year design projects.", "Demonstration-based deliverables Can be completed anytime during lab sessions 3-6 19", "Submission-based deliverables Last day of class, 8:00 pm 5", "University of Waterloo Verification of Illness forms and self-declared absences will be taken into consideration only for the student to whom it applies, if appropriate.", "Notes for Students Repeating the Course", "Do I have to do the project again?", "Can I reuse material from previous submissions?", "It would also be helpful if you provided comments such as \"In the previous submission, concerns were expressed related to the definition of maximum stable frequency.", "Exams", "***Any guidelines UW releases on verification and declaration of illness for the term, will supersede the instructions given here***", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 22, "course_code": "MTE 351", "course_name": "MTE351 - Systems Models 1 (0.50)", "term_name": "3A Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Systems Models 1 Winter 2025", "08:30AM - 09:20AM E7 3353", "Put SYDE 351 in the email subjectline followed by a briefdescription of the email subject.", "Introduction to systems modelling and analysis.", "Graph theoretic models and formulation of system equations.", "Application to engineering systems.", "View requirements for MTE 351", "By the end of the course, learn to analyze, implement, and use various circuits techniques in a variety of applications.", "This includes:", "Derive the mathematical equations describing dynamic engineering systems (mechanical, electrical, electromechanical, fluid, and/or thermal), (Attributes: 1c, 2a, 2b)", "Generate state-space models of dynamic engineering systems using newton’s 2nd law and graph theory, (Attributes: 1c, 2a, 2b, 2c)", "Generate block diagrams of dynamic engineering systems, (Attributes: 1c, 2c)", "Perform time domain and frequency domain analysis of dynamic engineering systems (Attributes: 2a, 2b, 2c)", "Use proper engineering tools/software to simulate engineering systems.", "construct meaning from oral, written, and graphic communication through interpreting, exemplifying,", "exams are initially planned to be held in-person.", "Instruction & Assessment:", "What you shouldbe doing each week", "Suggested problem sets & solutions", "Microsoft Teams will be used as online platform:", "Activities & Deliverables", "Topic 1 - Systems Modeling and Solution in Time and Frequency Domain", "Course Introduction", "Modelling of Dynamic Systems", "1.6 & Appendix D", "Laplace Transform & Transfer Function", "First Order Systems Time and Frequency Domains Solution", "Second Order Systems Time and Frequency Domains Solution", "SimulationX Demo for 1st and 2nd Order System Responses", "Topic 2: Mechanical Systems Modeling in Time and Frequency Domain", "Spring Elements", "Lecture Notes & 3.1 3.2, 4.1", "Spring-Mass Systems Solution in Time and Frequency Domain", "Damping Systems in Time and Frequency Domain", "4.2", "4.4", "Mass-Spring-Damper Solutions in the Time and Frequency Domain", "Software Simulations of Mechanical Systems", "State-Variable Models and State Space Formulation Using N2L", "Block Diagrams and State-Space Modeling Using Simulink", "Real-life Applications Simulation Using SimulationX", "Topic 5: Electrical & Electromechanical Systems Modeling in Time and Frequency Domain", "Electric Elements and Circuits", "Transfer Function and Impendence", "Topic 5: Electrical & Electromechanical Systems Modeling in Time and Frequency Domain", "Transfer Function and Impendence continued", "Electromechanical Systems", "Linear Graph Theory", "Systems Equations using Linear Graph Theory Method", "Real-Life Applications on Mechanical and Electrical Systems", "Topic 7: Introduction to Fluid & Thermal Systems (subject to change)", "Fluid Systems", "Thermal Systems", "7.1-7.5 & 7.10.1", "7.6-7.8 & 7.10.2", "Final Exam - TBD", "Topic 1 - Systems Modeling and Solution in Time and Frequency Domain", "Course Introduction", "Modelling of Dynamic Systems", "Laplace Transform & Transfer Function", "First Order Systems Time and Frequency Domains Solution", "Second Order Systems Time and Frequency Domains Solution", "SimulationX Demo for 1st and 2nd Order System Responses", "Topic 2: Mechanical Systems Modeling in Time and Frequency Domain", "Spring Elements", "Spring-Mass Systems Solution in Time and Frequency Domain", "Damping Systems in Time and Frequency Domain", "Mass-Spring-Damper Solutions in the Time and Frequency Domain", "Software Simulations of Mechanical Systems", "State-Variable Models and State Space Formulation Using N2L", "Block Diagrams and State-Space Modeling Using Simulink", "9 Real-life Applications Simulation Using Simscape and SimulationX 6 Simscape, and SimulationX", "Topic 5: Electrical & Electromechanical Systems Modeling in Time and Frequency Domain", "Electric Elements and Circuits", "Transfer Function and Impendence", "Transfer Function and Impendence continued", "Electromechanical Systems", "Linear Graph Theory", "Systems Equations using Linear Graph Theory Method", "Real-Life Applications on Mechanical and Electrical Systems", "Topic 7: Introduction to Fluid & Thermal Systems (subject to change)", "Fluid Systems", "Thermal Systems", "Clarence W. de Silva, Modeling of Dynamic Systems, 2017, Taylor and Francis The electronic book is available for free from the library:  https://www-taylorfrancis- com.proxy.lib.uwaterloo.ca/books/mono/10.1201/9781315154824/modeling-dynamic- systems-engineering-applications-clarence-de-silva No", "Shuvra Das, Modeling and simulation of mechatronic systems using Simscape, 2020, Morgan & Claypool.", "SimulationX offers better Acausal system handling and simulation advantages.", "Those will be marked for completion not for correctness.", "Each of these assignments may include analytical, numerical (using MATLAB/Simulink/Simscape) and explanatory components exploring fundamental aspects of the material covered in the course.", "COVID-19 Emergency Remote Teaching-Learning for In-Class Sessions:", "COVID-19 Emergency Self-Isolation:"]}, {"course_id": 23, "course_code": "MSE 261", "course_name": "MSE261 - Engineering Economics: Financial Management for Engineers (0.50)", "term_name": "3B Term", "program_name": "Mechatronics Engineering", "program_id": 114, "major_id": 1, "major_name": "Mechatronics Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Economics: Financial Management for Engineers Winter 2025", "10:30AM -", "12:20PM RCH 306", "S. Mortazavian Farsani", "10:30AM - 11:20AM RCH 306", "Depreciation models and asset replacement analysis.", "View requirements for MSE 261", "Engineers are often required by society to make responsible decisions on complex issues that have financial, economic, political and environmental elements.", "This course presents engineering economics as a key part of an engineer’s decision-making mandate.", "Engineering Economics focuses on basic principles and applications of economic decision-making between alternatives encountered in engineering systems projects.", "Apply basic financial calculations, useful in personal life and business [", "4. Recognize the impact of inflation and taxation in making engineering economics decisions [11b]", "Analyze the public centered projects by their costs and benefits (dis-benefits) to society and environment [9a, 9b, 11b]", "Understand and analyze the components of financial statements and use them in investment decisions and preparing business plans [1c, 11b]", "The course will be dynamic and hence, the weekly schedule provided in this document is tentative and subject to slight changes in order to adapt to the needs and conditions the class may face.", "Week of", "Introduction", "Cash Flow Analysis", "-", "Replacement Analysis", "Inflation", "Public Sector Decision Making", "Introduction to Project Management", "Engineering Economics: Financial Decision Making for Engineers (7th Edition).", "Engineering Economic Analysis (4th Canadian Edition).", "Quizzes are non-cumulative while midterm and final exams are cumulative in the sense that final exam covers whatever covered after the midterm content.", "In case of any technical issues uploading the files, please email the TAs right away.", "All assessments will be also submitted online in that case.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}]