[{"course_id": 23, "course_code": "EARTH 436A", "course_name": "EARTH436A - Thesis Proposal (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["EARTH 436A", "EARTH 436A 001", "11:30AM -", "View requirements for EARTH 436A", "Thesis Course (Earth 436) provides an opportunity for students to design and conduct independent research under the supervision of a faculty member in the Department of Earth & Environmental Sciences.", "In the past years, a number of excellent research projects have been completed leading in some cases to award winning presentations at conferences and publications in peer-reviewed journals.", "Students must normally obtain a minimum mark of 75% in Earth 436A to be allowed to register in Earth 436B. For students who enroll in Earth 436A only, the scope of work will involve the selection of a scientific topic of interest, detailed review of several published papers on the subject and the development of a potential research project that would fill a gap in current knowledge on the subject.", "In Earth 436B, the remaining activities required to complete the research project are carried out based on the experimental design formulated in Earth 436A. The format and structure of the Final Research Report can be either a conventional thesis document or a journal manuscript.", "It involves oral communication either one on one or before groups both large and small and written communication, which involves preparation of maps, charts and 6 narrative reports with personal observations, analyses and reviews of your own new work and that of previous workers.", "While most of your work will be technical and reflect scientific rigor, you may be called upon to prepare shorter status and policy briefs for decision-makers, legal summaries and commentaries, mine stakes and resource claim descriptions, and other items, all of which require organized and well-reasoned clear writing.", "Students should familiar with and able to do the following at the end of this course: • plan and conduct independent and original research under the guidance of a research advisor • learn how to explore, organize, execute, share and disseminate the results of your own scientific questions and thoughts • acquire new practical research and analytical skills using data either collected by yourself in the field or assembled in the laboratory or information/data collected by someone else (often the faculty advisor) in a research environment that you would not have had a chance to do elsewhere in your program • learn discipline-specific protocols and procedures for addressing scientific questions and procedures and formats for reporting technical information according to discipline or sub\u0002discipline standards • acquire an appreciation for and basic skill level to organize, interpret, and identify relevance of new information and research results • understand how to organize, communicate effectively and clearly disseminate new information to peers and other professionals, both written and orally • know how to undertake self-assessment, and learn how to give and receive constructive review and critique by your peers", "DATE ACTIVITIES & DUE DATES  ATTENDANCE & GRADING", "No meeting", "23 September", "Applying for graduate school and applying for NSERC & other scholarships.", "Work on research design proposal", "No meeting", "Farvolden Day and Job Fair", "No meeting", "No meeting", "No meeting", "No Meeting", "Presentation Abstract:", "2 December No meeting Work on your project and final thesis design; Finish writing & Edit No meeting", "9 December", "No meeting", "No meeting", "FINAL RESEARCH DESIGN PROPOSAL 50%", "Many professors have a number of possible projects in mind.", "Topics involving co-advisors outside of the Dept. of Earth & Environmental Sciences must be approved by the Earth 436A instructor.", "Write a short summary of the project and include the objectives, context, methods and major findings in sentence form (~250 words max.)", "and then give a critique of the thesis in sentence form (~150 words max.).", "Maximum length for the summary and critique is one page single spaced (~400 words max.", "FINAL RESEARCH DESIGN PROPOSAL (50%): The final research design proposal contains an Introduction, comprehensive Literature Review, Overall Goal(s) and (specific) Objectives, Experimental Design and Methods (including anticipated results and potential data presentation)."]}, {"course_id": 24, "course_code": "EARTH 440", "course_name": "EARTH440 - Quaternary Geology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "02:30PM - 05:20PM", "Students can expect a response within 48 hours from Monday to Friday.", "The TA will also be available during in-person laboratory sessions.", "Glacial-interglacial cycles and sub-Milankovitch oscillations from ocean sediments and ice cores.", "Glacial sediment-land systems.", "Local field trips.", "View requirements for EARTH 440", "Local field trips focusing on the regional Quaternary geology and sedimentology of glacial sediments.", "Know the main principles, concepts and approaches pertaining to the study of Quaternary sediments and landforms (especially glacial sediments in Canada);", "Knowledge of the Quaternary geology of southern Ontario;", "Knowledge of the main applications of glacial geology;", "Gain experience recognising and investigating landforms and glaciogenic sediments using tools such as Google Earth and a GIS;", "Gain experience searching for and using public spatial datasets from various government agencies and other sources;", "Experiment and learn to create engaging and accurate stories about Quaternary geology features and maps", "Appreciation and basic knowledge of the complexity of changes that have occurred throughout the Quaternary Period", "The following textbooks have also been used in the development of this course:", "Field trips: Four field trips will occur during lecture and lab session hours in September and early October.", "The field trips are intended to give an overview of the glacial stratigraphy and sediment-landform assemblages in the region as well as some hands-on experience.", "You will be given the opportunity to learn some basic field description/measurement procedures.", "Important note: Field trip fees may be charged to cover direct costs of travel (essentially the cost of school bus transportation service).", "In-class quizzes: There will be a series of short in-class quizzes (~10-15 min each) throughout the term.", "Each team will have to prepare a StoryMap summarizing the field trips and with one particular aspect of the trips highlighted and explained in greater details.", "The second StoryMap will be about a specific map sheet area selected from a short list of available surficial geology maps produced by a government geological survey in recent years.", "The StoryMap will provide an overview of the main geological and geomorphological features of the map, and will also put the map into the broader regional context based on the available scientific literature.", "Notice of Recording", "Weekends and holidays will not count when determining a late submission penalty"]}, {"course_id": 25, "course_code": "ERS 215", "course_name": "ERS215 - Environmental and Sustainability Assessment 1 (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Environmental and Sustainability Assessment 1 Winter 2025", "Instructor: Felicitas Egunyu felicitas.egunyu@uwaterloo.ca", "An introduction to processes and techniques for incorporating environmental considerations in planning and evaluating proposals for future undertakings that may have significant social and biophysical effects.", "The course provides an overview of methodologies for, and controversies surrounding, the design and conduct of biophysical and socioeconomic impact studies, and the testing of reported findings.", "View requirements for ERS 215", "Key topics and themes will be elaborated on through videos and by regular attention to case studies.", "Assigned readings throughout the semester are critical for providing additional depth and breadth.", "Group reading discussion and assignments provide an opportunity for integrating key topics and themes, as well as for linking them with the broader scholarly literature on environmental assessment.", "From this course you will develop a key understanding of what an EA should be and therefore, you can apply this knowledge and understanding to any assessment act.", "Define the aims and objectives of environmental/impact assessments, as well as key terms and concepts in EA/IA", "Identify the roles and relevance of EA/IA as a potential venue that can contribute to sustainability", "Describe the different steps and components of an EA/IA process in Canada", "Apply EA/IA principles for best practices to case studies and critically analyze the strengths and weaknesses of environmental assessment", "Introduction to Environmental Impact Assessment: A Guide to Principles and Practice, 4th Edition.", "Introduction to Environmental Impact Assessment: A Guide to Principles and Practice, 4th Edition.", "Introduction to Environmental Impact Assessment: A Guide to Principles and Practice, 4th Edition.", "(Similar to A and A+ in the previous system)", "(Similar to B+ and A- in the previous system)", "(Similar to B- and B in the previous system)", "(Similar to D-, D and D+ in the previous system)", "(Similar to F and F+ in the previous system)", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 26, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 27, "course_code": "PHYS 111", "course_name": "PHYS111 - Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["An introduction to physics for students intending to concentrate their further studies in biology, dentistry, medicine and paramedicine; includes particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.", "The main physics principles and laws covered in PHYS 111 include: “Particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.”", "PHYS 111 focuses on basic physics principles and laws, on conceptual understanding and problem-solving skills, and an appreciation for the power of physics in explaining how nature works, in the contexts of both the physical and life sciences.", "Physics Principles and Laws: By the end of the course, students will be able to construct scientifically sound explanations of a variety of basic physical phenomena by applying basic physics principles/laws.", "define linear momentum, and calculate and compare momenta of various real-life objects;", "define and calculate impulse, and establish the conditions for conservation of linear momentum; and", "apply the laws of conservation of momentum and energy to collisions.", "Problem-Solving Skills and Strategies: By the end of the course, students will be able to creatively apply a variety of structured problem-solving strategies:", "interpret, visualize and convert the problem into a physical model (e.g., draw a free body diagram);", "evaluate the result — does it make sense?", "These problem-solving skills are useful in the students’ own disciplines and beyond.", "More detailed information about the course elements which contribute to the final grade will be given in the learn sight and in future outline updates", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 28, "course_code": "STAT 202", "course_name": "STAT202 - Introductory Statistics for Scientists (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Statistics for Scientists Winter 2025", "R. Metzger", "R. Metzger", "jenny.tieu@uwaterloo.ca", "02:30PM - 03:20PM", "jenny.tieu@uwaterloo.ca", "R. Metzger", "02:30PM - 03:20PM", "PHY 313", "jenny.tieu@uwaterloo.ca", "R. Metzger", "Methods for data summary and presentation.", "Estimation, hypothesis testing, two-sample techniques and paired comparisons, regression, correlation.", "Evaluate the strengths and weaknesses of a simple sampling technique.", "Given a set of data:", "Build a simple linear model for a dataset.", "Perform simple statistical test to determine whether:", "A population mean and proportion differs from a particular value.", "A simple linear regression model parameter is significant.", "Probability Functions (PF) and Cumulative Distribution Functions (CDF):", "Differentiate between a Binomial and Poisson experiment.", "Define simple sample spaces and calculate simple probabilities.", "Calculate the sample mean and sample variance of a linear combination.", "Linear Relationships (Covariance and Correlation), Time Series, Scatterplots, Linear Regression", "Instructor(s) will go over a problem set.", "Regression analysis", "Sample design", "Poisson Distribution, Normal Distribution", "Instructor(s) will go over a problem set.", "Inference", "Instructor(s) will go over a problem set.", "Inference", "Inference", "- location TBD", "≥50", "No considerations are given for individual technical issues.", "This is a cumulative test that will cover the entire course.", "Late Tests will be given a zero mark.", "Note for your circumstance to be deemed valid you must have been incapacitated for a significant portion of the assessment window.", "A circumstance that incapacitates a student for a month or longer is unlikely to be accommodated – in such a case we ask that you please speak to your academic advisor and consider dropping the course.", "In the past some of the issues below have cropped up in my courses:", "Make sure you start online quizzes early, hand in assignments early, etc in case of unforeseen technical issues!", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 29, "course_code": "BIOL 462", "course_name": "BIOL462 - Applied Wetland Science (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM DC 1351", "Shayna Meinzinger                                           sbmeinzinger@uwaterloo.ca            Office hours: by email appointment", "Advanced concepts on wetland ecosystems in the context of regional and global earth systems processes such as carbon and nitrogen cycling and climate change, applications of wetland paleoecology, use of isotopes and other geochemical tools in wetland science, and wetland engineering in landscape rehabilitation and ecotechnology.", "Current issues in Canada and abroad will be examined.", "We may also use unscheduled tutorial time for make-up classes if needed.", "Identify a wetland’s class using the Canadian the wetland classification system and define and describe form and type", "Describe wetland ecological function, biogeochemical function, and role in and impact by anthropogenic climate change", "Describe the basic principles and challenges associated with wetland restoration and creation, and the design of treatment wetlands", "Create (as a group) a short scientific report and infographic summazing scientific understanding of a wetland, including appropriate references", "Introduction   Chapter 1,2", "Safety Meeting for Field Trips", "7. Biogeochemistry II:  Carbon and Climate Change", "7. Biogeochemistry II: Carbon and Climate Change", "11 Nov. 12 7. Biogeochemistry II: Carbon and Climate Change   Chapter 16", "Guest lecture: Emilie Montreuil Strub and Rachel McNamee: Microplastics in Lakes", "Textbook and Readings", "Supplementary textbook that covers biogeochemistry better than Mitsch and Gosselink.", "Graduate school level so do not be alarmed!", "Reference-managing software Very handy to manage references for your group project.", "Useful for field day to document findings.", "It is a closed-book test worth ~40 marks.", "Task 0: Pick your group based on field site and topic and sign up under Learn: Groups--> Group Project.", "Task 1: Do the assigned readings and literature search for your wetland and create a draft \"concept map\" showing the interaction of geology/geomorphology, soils, water and plants in your wetland.", "Use this data for completion of Tasks 2-4.", "We strongly encourage you to have a rough draft ready a week before and use the last week to copyedit and refine the writing of your group members.", "Some class time will be used to go over appropriate scientific research methods and writing techniques.", "Notice of Recording", "Extensions and Accommodations", "Extensions and other accommodations will only be considered on a case-by-case basis.", "You are taking full responsibility for AI-generated materials as if you had produced them yourself: ideas must be attributed and facts must be true.", "In reference list:", "URL of the platform where the conversation took place].", "That all said, AIs can be interesting and fun!", "You are welcome to check them out and use them as a study aid.", "(Note: If you want to use ChatGPT, you must make a free account and provide your email and phone number."]}, {"course_id": 30, "course_code": "EARTH 444", "course_name": "EARTH444 - Applied Wetland Science (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM DC 1351", "Shayna Meinzinger                                           sbmeinzinger@uwaterloo.ca            Office hours: by email appointment", "Advanced concepts on wetland ecosystems in the context of regional and global earth systems processes such as carbon and nitrogen cycling and climate change, applications of wetland paleoecology, use of isotopes and other geochemical tools in wetland science, and wetland engineering in landscape rehabilitation and ecotechnology.", "Current issues in Canada and abroad will be examined.", "We may also use unscheduled tutorial time for make-up classes if needed.", "Identify a wetland’s class using the Canadian the wetland classification system and define and describe form and type", "Describe wetland ecological function, biogeochemical function, and role in and impact by anthropogenic climate change", "Describe the basic principles and challenges associated with wetland restoration and creation, and the design of treatment wetlands", "Create (as a group) a short scientific report and infographic summazing scientific understanding of a wetland, including appropriate references", "Introduction   Chapter 1,2", "Safety Meeting for Field Trips", "7. Biogeochemistry II:  Carbon and Climate Change", "7. Biogeochemistry II: Carbon and Climate Change", "11 Nov. 12 7. Biogeochemistry II: Carbon and Climate Change   Chapter 16", "Guest lecture: Emilie Montreuil Strub and Rachel McNamee: Microplastics in Lakes", "Textbook and Readings", "Supplementary textbook that covers biogeochemistry better than Mitsch and Gosselink.", "Graduate school level so do not be alarmed!", "Reference-managing software Very handy to manage references for your group project.", "Useful for field day to document findings.", "It is a closed-book test worth ~40 marks.", "Task 0: Pick your group based on field site and topic and sign up under Learn: Groups--> Group Project.", "Task 1: Do the assigned readings and literature search for your wetland and create a draft \"concept map\" showing the interaction of geology/geomorphology, soils, water and plants in your wetland.", "Use this data for completion of Tasks 2-4.", "We strongly encourage you to have a rough draft ready a week before and use the last week to copyedit and refine the writing of your group members.", "Some class time will be used to go over appropriate scientific research methods and writing techniques.", "Notice of Recording", "Extensions and Accommodations", "Extensions and other accommodations will only be considered on a case-by-case basis.", "You are taking full responsibility for AI-generated materials as if you had produced them yourself: ideas must be attributed and facts must be true.", "In reference list:", "URL of the platform where the conversation took place].", "That all said, AIs can be interesting and fun!", "You are welcome to check them out and use them as a study aid.", "(Note: If you want to use ChatGPT, you must make a free account and provide your email and phone number."]}, {"course_id": 32, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 33, "course_code": "EARTH 436B", "course_name": "EARTH436B - Honours Thesis (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["All students will be encouraged to consider formatting their research report as a journal paper with the potential to be submitted for publication consideration to a journal at the end of the course.", "OPTION A - Journal Paper Manuscript", "OPTION B - Conventional Thesis", "Obtain a past BSc thesis similar in scope to the research topic to be used as a guide document.", "The advisor can assist in selecting and providing an appropriate example.", "Plan and conduct independent and original research under the guidance of a research manager", "Learn discipline-specific protocols and procedures for addressing scientific questions and procedures and formats for reporting technical information according to discipline or sub-discipline standards", "Acquire an appreciation for and basic skill level to organize, interpret, and identify relevance of new information and results", "Understand how to organize, communicate effectively and disseminate clearly new information to peers and other professionals, both written and orally", "ACTIVITIES & DUE DATES", "No meeting", "No meeting", "Poster Session EIT Foyer in Museum", "Examples of past posters and final reports will also be provided as reference materials.", "Progress Report (15%): Progress reports should contain an updated clear statement of goal(s) and objectives of the research, a brief description of methods, an analysis of progress and problems, and a realistic timetable for completion of the remaining stages of the research project.", "This will be followed by a question-and-answer period.", "The letter of explanation and a revised timetable for completion must also be sent to the course instructor (drudolph@uwaterloo.ca).", "These electronic theses will be stored by the library and accessible online.", "The instructions for binding can be found at:", "Plagiarism is a very serious charge and can ruin promising careers.", "While generative AI technologies can provide general background information, you are responsible for demonstrating your application of knowledge by reporting, interpreting, and explaining your experimental findings in the context of the primary literature.", "Library for research-based assignments"]}, {"course_id": 34, "course_code": "CS 100", "course_name": "CS100 - Introduction to Computing Through Applications (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Computing Through Applications Winter 2025", "Friday -", "Friday", "10:30AM - 12:20PM MC 3005", "10:30AM - 12:20PM MC 3027", "Dave Tompkins", "E-mail: dtompkins@uwaterloo.ca", "E-mail: cs100@uwaterloo.ca", "Introduction to the Internet, World Wide Web, HTML, and XML.", "Algorithms underlying the functional components of web search engines and their influence on data access.", "CS 100: Introduction to Digital Information, Computers, the Internet and Applications", "Explain the emerging computing technologies introduced in the course.", "Digital Information", "Computer + Network organization", "Dynamic web pages and web applications", "Privacy and security", "Emerging Topics", "Distributed networking and \"big data\"", "Artificial intelligence", "ChatGPT and large language models", "Social media and monetization", "A1 released", "Laptops, Devices and Software", "Library for research-based assignments"]}, {"course_id": 35, "course_code": "MATH 103", "course_name": "MATH103 - Introductory Algebra for Arts and Social Science (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introductory Algebra for Arts and Social Science Winter 2025", "Email: jen.nelson@uwaterloo.ca", "Topics will be chosen from linear equations, systems of linear equations, linear inequalities, functions, set theory, permutations and combinations, binomial theorem, probability theory.", "The course begins with a review of operations with real numbers and fundamental algebra skills.", "The solutions of polynomial equations, both linear and quadratic, in one and two variables and their graphical representation are studied.", "An extension is made to linear systems with their solutions being expressed both algebraically and graphically.", "To solve linear systems, matrices and the associated row reduction strategies are used.", "The relationship between exponential functions and logarithmic functions is examined.", "The basic properties of logarithms are introduced and used to solve logarithmic and exponential equations.", "Various applications involving exponential growth and decay and logarithmic scales are presented.", "Concepts in set theory and counting theory support the study of probability theory.", "Perform operations with real numbers and algebraic expressions.", "Solve linear equations and inequalities in one variable, including those involving absolute value, and represent the solutions algebraically and graphically.", "Solve a system of linear equations using matrix operations, introducing a free variable, or parameter as appropriate.", "Solve quadratic equations in one variable.", "Recognize that the solutions to a quadratic equation in two variables lie on a curve known as a parabola and analyze the properties of a parabola.", "Describe the relationship between an exponential function and a logarithmic function.", "Use the properties of logarithms to solve logarithmic and exponential equations, and to solve problems involving exponential growth and decay, and logarithmic scales.", "Use the appropriate symbols and language in set theory to perform set operations, represent sets and subsets using Venn diagrams, and apply the counting principles for sets in real-life situations.", "1.1 Real Numbers", "1.2 Order of Operations", "1.3 Fundamental Algebraic Skills", "Unit 2: Equations and Inequalities", "2.1 Equations in One Variable", "Unit 2: Equations and Inequalities Continued", "2.3 Multivariate Equations", "Unit 3: Systems of Linear Equations and Matrices", "3.1 Systems of Linear Equations", "3.2 Introduction to Matrices and Elementary Row Operations", "Unit 3: Systems of Linear Equations and Matrices Continued", "3.3 Applications", "3.4 Systems With No Solutions and Systems With an Infinite Number of Solutions", "Unit 4: Quadratic Equations and Functions", "4.1 Quadratic Equations in One Variable", "4.2 Quadratic Equations in Two Variables and the Parabola", "4.3 Quadratic Functions", "4.4 Applications", "Unit 5: Exponential and Logarithmic Functions", "5.1 Exponential Functions and Equations", "5.2 Exponential Functions and Logarithmic Functions", "Unit 5: Exponential and Logarithmic Functions Continued", "5.4 Solving Logarithmic and Exponential Equations", "5.5 Applications", "6.1 Introduction to Sets", "6.2 Set Operations", "6.3 Counting Principles for Sets", "7.2 Combinations of Simple Events — Compound Events", "7.4 An Introduction to Random Variables and Probability Functions", "8.1 Counting Principles and Probability", "8.3 Combinations — Unordered Selections", "8.4 Binomial Models", "A non-programmable, non-graphing scientific calculator.", "Assignments may be screened by a human for evidence of plagiarism or the inappropriate use of resources.", "Notice of Recording", "instructor in advance in order to facilitate class participation.)"]}, {"course_id": 36, "course_code": "MATH 104", "course_name": "MATH104 - Introductory Calculus for Arts and Social Science (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Calculus for Arts and Social Science Winter 2025", "The major concepts introduced to solve problems are rate of change, optimization, growth and decay, and integration.", "This course provides an introduction to the applications of differential and integral calculus in business, the behavioural sciences, and the social sciences.", "A special type of limit will give rise to the derivative, the central idea in differential calculus.", "The interpretation of the derivative in applications such as rates of change and optimization, where the situations can be modelled by algebraic, exponential, or logarithmic functions, will be examined.", "The concepts of the antiderivative and the indefinite integral will be studied.", "The Fundamental Theorem of Calculus will relate the integral to the derivative.", "The problem of calculating the area under a curve will lead to the definite integral, a basic concept of integral calculus.", "The interpretation of the integral in various applications will be studied.", "be able to interpret a limit, given the graph of a function;", "evaluate the limit of a function using appropriate techniques;", "determine the derivative of polynomial functions using the definition of a derivative;", "determine the derivative of algebraic, exponential, and logarithmic functions using the techniques of differentiation;", "apply the derivative to determining equations of tangents, graphing functions, solving rate problems, and solving optimization problems;", "determine general and unique antiderivatives;", "determine the indefinite integral of a function using the techniques of integration;", "determine definite integrals; and", "Note there is a 24-hour cool-down period.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical tool-building and function sketching.", "Library for research-based assignments"]}, {"course_id": 37, "course_code": "MATH 124", "course_name": "MATH124 - Calculus and Vector Algebra for Kinesiology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Calculus and Vector Algebra for Kinesiology Fall 2024", "ipayne@uwaterloo.ca", "ipayne@uwaterloo.ca", "Email address ipayne@uwaterloo.ca", "Review of trigonometry and basic algebra.", "Introduction to vectors in 2- and 3-space: sums, addition, dot products, cross products and angles between vectors.", "Solving linear systems in two and three variables.", "Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties.", "Intuitive discussion of limits and continuity.", "Derivatives of elementary functions, derivative rules; applications to curve sketching, optimization.", "3 September 16 - September 20 exponential and trig functions, limits", "6 October 7 - October 11 derivatives of trig functions, implicit differentiation, first derivative test", "11 November 18 - November 22 dot product, projections, cross product, scalar equations", "12 November 25 - November 29 solving and interpreting systems of equations", "No specific Text will be followed for this course No", "The quizzes are mean to be written in under an hour, but you will be given the entire 110 minutes.", "Final Exam: The final exam will be scheduled be written during the exam period in December."]}, {"course_id": 0, "course_code": "BIOL 150", "course_name": "BIOL150 - Organismal and Evolutionary Ecology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Organismal and Evolutionary Ecology Fall 2023", "11:30AM - 12:20PM RCH 101", "Learn Discussion Board", "Email and Appointment Requests", "Coverage includes hypothesis testing and the nature of scientific inquiry, basic population genetics, physiological ecology, life histories, dispersal, basic population and community ecology, macroevolution, systematics and classification, as well as functional morphology.", "The theory of evolution unites the whole of biology and all living organisms into a coherent body of knowledge, allowing comparisons across all forms of life.", "Ecology describes how organisms interact with their environment and each other to create interdependent systems from microscopic to global scales.", "These disciplines are fundamentally tied together: evolution is the primary mechanism by which species adapt to their environment; ecological interactions and environmental variability drive natural selection.", "You will also carry out simulated lab assignments to test the principles of evolution, design ecological experiments to test alternate hypotheses about the conservation of species and manipulate demographic parameters to test their influence on population growth.", "Understand the principles of scientific methodology", "Define ecological and evolutionary terms, such as the niche, adaptation, and altruism", "Illustrate these mechanisms in the context of course examples", "Explain how ecological interactions and evolution are interconnected", "Sign code of conduct and upload to LEARN.", "2) Sept 8 Evolution for Ecology Section 1: Evolution and Ecology are Intertwined", "4) Sept 13 Evolution for Ecology", "5) Sept 15 Evolution for Ecology Section 3: Genetics and Evolution", "6) Sept 18 Evolution for Ecology Section 4: Managing the Evolution of Resistance", "9) Sep 25 Physiological Ecology Section 1: Trade-offs and Species Distributions", "15) Oct 9-13 Holiday – No classes Understanding Experimental Design Simulation due by Oct 16, 11:59 pm", "16) Oct 16 Empiricism in Ecology Understanding Experimental Design Simulation due by 11:59 pm (best 2/3 for 10%)", "It is important that you review the information below before you subscribe to the SimUText for Organismal Ecology and Evolution - Chapters at University of Waterloo.", "SimUText Application Installers", "SimUText Application Installers", "At the end of every unit, you will work individually to develop a concept map using Cmap Cloud to visually display the relationships among what you consider the key concepts in the unit.", "These should represent your personal comprehension of how the concepts relate to each other, and no two should be identical.", "Also, class will entail a lot of discussion that won’t be represented in PPT slides.", "The simulations include one on Evolution in Ecology, one on Experimental Design in Ecology and one on Population Growth.", "The learning outcome for the unit tests is to demonstrate your recall and comprehension of the material covered in the units and to incentivize keeping up with the readings and attending lectures and reviewing for the final exam.", "The learning outcome is to demonstrate recall, synthesis and integration of material learned during the course.", "The final exam will consist of multiple-choice, T/F, solve the equation type of questions and integration questions that are designed to test your basic and deeper understanding of the course concepts.", "Important note regarding tests and exams", "Unit tests will be completed for the first 4 units of the course.", "Ensure you have a reliable internet connection and functional computer to complete them – technical challenges encountered during remote completion are not an excuse for missed tests.", "I will have a limited number of printed back-ups for students in class who experience technical difficulties.", "You will need to have a reliable internet connection and functional computer to complete the exams.", "Emails can be received 24 hours per day.", "If you miss a make-up exam for any reason, you will be given a DNW, and must petition the Associate Dean of Science if you feel you missed it for a valid reason.", "At the discretion of the instructor, you may be permitted to write a make-up exam.", "The timing will be conveyed to you via e-mail if you are eligible for a make-up.", "If you follow these steps,", "I will consider granting an extension", "Students are responsible for their own behavior and should be mindful of the impact that their actions have on the wellbeing of others.", "Act in a respectful and open manner when listening to the views and ideas of others.", "Participate fully in the discussion boards: make sure your answers are to the best of your ability and that you respond to others’ posts.", "Signature"]}, {"course_id": 1, "course_code": "BIOL 165", "course_name": "BIOL165 - Diversity of Life (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "An introduction to the diversity of living organisms from simple prokaryotes to complex eukaryotes.", "The characteristics that define these phyla", "Be able to compare and contrast life histories", "Introduction and Cell Biology", "Phylogeny and Classification", "Bacteria and Archaea", "Protists", "Library for research-based assignments"]}, {"course_id": 2, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}, {"course_id": 3, "course_code": "BIOL 240L", "course_name": "BIOL240L - Microbiology Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["BIOL 240L", "BIOL 240L 001", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 002", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 003", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 005", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 006", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 007", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 008", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 010", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 012", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 013", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 014", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 015", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 017", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 018", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 021", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "Email: cduxbury@uwaterloo.ca", "View requirements for BIOL 240L", "Main Objective Obtain a a good understanding of the basic techniques used in a microbiology lab to study and handle microorganisms safely.", "Apply staining techniques to differentiate and observe types of bacteria", "Appreciate proper aseptic technique while handling microorganisms in the lab and inoculating media", "Properly prepare slides for examination under the microscope", "Prepare and use dilutions to isolate pure cultures and to enumerate the number of organisms in a culture", "Exp 3: Basic Bacterial Shapes", "Exp 12: Pour-Plate Method", "Exp 14: Aseptic Technique in Pipette Handling", "Exp 15: Standard Plate Count Method", "Exp 17: Bacterial Flagella Stain", "Exp 19: Miniprep of Plasmid DNA", "Exp 20: Analysis of Plasmid and Genomic DNA", "Exp 21: Metabolic Activities of Bacteria", "Exp 30: Evaluation of Chemical Antimicrobial Agents", "Exp 31: Antibiotic Sensitivity Testing", "Exp 32: Isolation of Bacterial Mutants", "TBA", "Extra precautions must be taken to ensure the safety of yourself and those around us!", "Always be prepared for a quiz; they could be given at any time and they are cumulative!", "To make this happen, a flowchart for each experiment is required.", "The flowchart is similar to a \"map\" of your experiment and should be sufficiently detailed and include the most important information about the experimental steps and possible time management.", "The flowchart should NOT be a reiteration of the \"METHODS\" section in your manual.", "Please see Flowchart Help Sheet for a flowchart example.", "Your professionalism mark will be assigned by your TAs and will be assessed on the basis of your performance in the laboratory, attendance, and your degree of skill in microbiological techniques.", "More information will be given closer to date.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 4, "course_code": "BIOL 241", "course_name": "BIOL241 - Introduction to Applied Microbiology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introduction to Applied Microbiology Winter 2025", "RCH 101", "Course Lecturer: Dr. Kesen Ma; kma@uwaterloo.ca; office hours & virtual meetings (Zoom) by appointment only", "Laboratory Instructor: Dr. Cheryl Duxbury; cduxbury@uwaterloo.ca; office hours & virtual meetings (Microsoft Teams) by appointment only", "Introduction to microbial ecology, environmental microbiology, food microbiology, and medical microbiology explored through lectures and laboratory exercises.", "Topics in environmental microbiology include biogeochemical cycling and biological treatment of wastes and pollutants.", "Topics in medical microbiology include concepts of immunology and host-pathogen relationships.", "microbial ecology", "bacteria-bacteriophage interactions", "biodegradation and bioremediation • sewage treatment", "industrial microbiology", "host-parasite relationships - factors in microbial pathogenicity, innate barriers in the host", "immunology - innate, adaptive", "immunization; immune response diseases", "Extend Biol 240 and cover topics such as the diversity of microbial metabolism and habitat, the importance of microbes in nutrient cycling, biological treatment of pollution, use of microorganisms for the production of food, pharmaceuticals, and the role of microbes in human disease.", "Know the importance of microbes to life as we know it, and the applications of useful microbial characteristics.", "Enhance understanding of the roles that microbes play in the natural world .", "Learn more skills in aseptic laboratory techniques and know how to conduct some classical microbial testing of food, water, and soil.", "Lecture topics and relevant textbook chapters", "2021 & 2017.", "Microbial Ecology", "2. Bacteria-Bacteriophage Interactions", "Terrestrial & Aquatic Environments", "5. Biodegradation & Bioremediation", "Food & Industrial Microbiology", "(spoilage & preservation", "food & industrial processes)", "Immunology", "(innate, adaptive immunity,immunization & immune response diseases)", "Infectious Disease", "*note: this is the same textbook as used in BIOL 240 & BIOL 240L. The new 3rd edition of the book can be accessed via a subscription through Wiley ($57 for 150-day subscription, $134.95 for a lifetime subscription:", "This manual cannot be ordered online and must be purchased in person prior to your first lab.", "Both exams will be in a multiple-choice format (e.g., multiple choice, true/false, matching questions, fill in the gap).", "Notice of Recording", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Allowed", "Allowing under certain conditions", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 5, "course_code": "BIOL 350", "course_name": "BIOL350 - Ecosystem Ecology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Ecosystem Ecology Fall 2024", "10:30AM - 11:20AM RCH 205", "This course provides an overview of the dynamic interactions among microbes, plants, animals, and their physical environment with emphasis on ecosystem structure and function.", "Topics explored through lectures and tutorial sessions include the hydrological cycle, biogeochemical cycling, ecological energetics, roles of population and community interactions, paleoecology, and current topics in ecosystem science.", "An ecosystem is defined as an integrated system of interacting biotic and abiotic components that occupy a volume of space.", "Consequently, society needs well trained people with skills in ecosystem science to effectively protect and manage ecosystems in the face of ever-growing pressures.", "Both theoretical and applied aspects of ecosystem ecology will be discussed.", "The synchronous (scheduled) in-person tutorials and associated assignments will provide experiential learning of relevant skills in generation and interpretation of data, integration of concepts, critical analysis, and written and oral communication.", "Define and explain, in written and oral presentations, the main terms and concepts in ecosystem ecology, such as energy flow and nutrient cycling.", "Explain how interactions between organisms and the environment regulate the structure and function of ecosystems.", "Generate, analyze and interpret data on nutrient limitation, nutrient cycling and food-web interactions, and communicate the findings and their importance in written reports.", "Use basic principles of ecosystem science to anticipate how ecosystems and their components will likely respond to changes in physical, chemical and biological conditions.", "Critically analyze published research papers in ecosystem ecology.", "Week 2 (Sep. 9) Introduction Lecture 2: Abiotic factors & ecosystem structure n/a", "Introduction Lecture 3: Ecosystems as systems n/a", "Integration Lecture 12: Controls on ecosystem structure & function Ch. 11", "Integration Lecture 14: Selected ecosystems I TBA", "Integration Lecture 16: Selected ecosystems III TBA", "Case studies Lecture 18: Human alteration of the N cycle Ch. 12 & ESA Bulletins", "Integration Lecture 22: Frontiers in ecosystem science & Review Ch. 17", "Most chapters have very slight updates, and I’ll direct you to any material I bring in from this newer edition", "You can also provide Dr. Vanderwolf with a very compelling compassionate reason, such as a serious family emergency, before the test.", "If you provide me with a compassionate reason after the test, it will be given no consideration."]}, {"course_id": 6, "course_code": "BIOL 351", "course_name": "BIOL351 - Aquatic Ecology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Aquatic Ecology Winter 2025", "Office - B2-253", "Study of the structure and function of lake and stream ecosystems.", "The course emphasizes biological components and processes, but includes the origin and nature of lake and stream systems and the fundamentals of surface water chemistry and physics.", "Explain the fundamental physical, chemical and biological characteristics and processes of aquatic ecosystems", "Describe the key components of aquatic ecosystem structure and function", "Discuss the influence and importance of aquatic ecosystems on human socity and the impacts human management actions have on aquatic ecosystems", "Properties of Water – Physics and Chemistry in Ecology?", "Evolution of Organisms and Biodiversity of freshwaters", "Nutrient Cycling and Associated Aquatic Chemistry", "Trophic State and Eutrophication", "Response to Stress – Pollution in aquatic Ecosystems", "Aquatic Ecology in Practice", "Course Text - Freshwater Ecology: Concepts and Environmental Applications of Limnology.", "Students will learn to synthesize major themes from lecture by answering a multiple choice question at the conclusion of each lecture using the course LEARN page (Note quizzes will only be available in lecture time, no exceptions).", "Student will self-organize to work in teams of three to complete two, one-page fact sheets over the course of the term.", "The first fact sheet will describe the characteristics (e.g., habitat, life history, threats, protection strategies) of an aquatic species-at-risk in Ontario, Canada.", "Tests and exams will be multiple choice format.", "Late submissions will be penalized at a rate of 10% per day for the first seven days.", "Extensions", "Generative Artificial Intelligence Usage", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "In these situations, students are encouraged to reach out to the instructor for assistance.", "Accommodation"]}, {"course_id": 7, "course_code": "BIOL 354", "course_name": "BIOL354 - Environmental Toxicology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Environmental Toxicology Fall 2024", "02:30PM - 05:20PM B2 351", "07:00PM - 09:50PM B2 351", "02:30PM - 05:20PM B2 351", "02:30PM - 05:20PM B2 351", "07:00PM - 09:50PM B2 351", "Please bring a reusable mug if you'd like a cup of tea.", "An introduction to the basic theories, principles, and techniques of environmental toxicology.", "A comparative study of the effects of specific groups of toxicants and how they can affect molecular, cellular, and organismal processes will be explored in lectures and through laboratory experiments.", "Know the basic theories, principles and techniques of environmental toxicology.", "Understand how different toxicants move from source to receptor, the concept of dose-response relationships and toxicokinetics.", "Understand the process of assessing toxicity using various toxicity test methods and the understand the physiological impacts of various classes of toxicants.", "Know the scientific terminology and knowledge base necessary to effectively communicate the impact of toxicants on target organisms through an in-person group presentation.", "Follow safety procedures as they relate to working in a toxicology laboratory and handling samples and organisms in the lab.", "Conduct toxicity tests using model organisms to assess the effects of pollutants.", "Describe how bioassays are used to estimate toxicity in environmental toxicology.", "Interpret and analyze the results of toxicity experiments, draw appropriate conclusions supported by the data in the format of a laboratory report.", "Week 2 Dose-Response Relationships & Toxicity Test Methods Chapter 4 Sections 4.3.2.", "no grade**", "no grade**", "Week 8 Survey of Toxic Substances - Inorganic & Organic Contaminants", "2,4-D", "2,4-D", "**", "Official Grades and Course Access", "Few are available on loan in the lab (first come, first served)", "WHMIS training checked for completion during the first lab Yes", "At the discretion of the instructor, you may be permitted to take a make-up exam.", "The make-up exam may be of different format than the missed examination (e.g. oral examination for the make-up).", "The Lecture Minute Paper activity will be followed by a discussion Indigenous Learning Circles that provide an opportunity for relational and reciprocal learning, fostering critical thinking, problem-solving skills, increased engagement, and community building.", "Lab Activities & Assessments", "Notice of Recording", "Don’t waste your time with these requests!", "Library for research-based assignments"]}, {"course_id": 8, "course_code": "BIOL 447", "course_name": "BIOL447 - Environmental Microbiology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Environmental Microbiology Fall 2024", "10:00AM - 11:20AM MC 4064", "10:00AM - 11:20AM MC 4064", "You can!", "A study of the environmental impact of microorganisms.", "Tutorials emphasize critical analysis of primary literature.", "Relate microbe-environment interactions to core concepts in microbiology and biochemistry", "Identify appropriate experimental methods to answer specific research questions", "Evaluate experimental designs in published research", "Effectively communicate critical evaluation to peers", "Introduction to cellular respiration and redox;", "Calculating the oxidation state of a carbon;", "Sampling & analysis", "Critical evaluation of research", "Important points to consider when critically evaluating published research papers;", "critical evaluation, part 1", "Algal and cyanobacterial blooms", "Chapter 6 - Microbial primary production and phototrophy;", "(2023)   (Introduction and Methods)", "critical evaluation, part 1", "critical evaluation, part 2", "Biodegradation & bioremediation", "critical evaluation, part 2", "Hydrocarbon degradation", "Passow U & Overton EB (2021) (review paper)", "Environmental impacts of viruses", "Chapter 10 - Ecology of viruses;", "Final exam - TBA", "You can miss up to 3 classes and still achieve full participation marks.", "I have chosen settings that make the scores as transparent as possible, and students can see their in-progress scores for each assignment.", "You can self-declare an absence on Quest in certain situations.", "The dates affected and degree of incapacitation will be used to determine follow-up action."]}, {"course_id": 9, "course_code": "CHEM 120", "course_name": "CHEM120 - General Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry 1 Winter 2025", "RCH 101", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "The second part of this course is concerned with explaining periodicity and trends in chemical reactivity in terms of the electronic structure of atoms and molecules.", "Topics covered in this part of the course include the quantum theory of the hydrogen atom; electron configurations in multi-electron atoms; ionic and covalent bonding; Lewis structures, valence shell electron repulsion theory and molecular geometry; quantum mechanical bonding theories, including valence bond theory and molecular orbital theory.", "Additional topics may include an introduction to electron-transfer reactions, including the assignment of oxidation states and the balancing of oxidation-reduction reactions.", "assess the greenness of a chemical reaction using Atom Economy and E-Factor metrics.", "describe the electronic structure of atoms in terms of quantum theory using atomic orbitals and quantum numbers.", "justify the organization of the periodic table and predict trends in the properties of the elements.", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and explain molecular shape and stability in terms of electron count.", "describe the interactions of molecules in solids, liquids, and gases to compare physical and reactive properties.", "Course Structure and Continuity Plans", "No extensions will be granted for Participation Challenges, but each student can drop one participation challenge from their overall grade.", "Printed spiral bound copies of the course notes can be purchased online from the UW bookstore https://wstore.uwaterloo.ca/", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare pandemic-related illnesses on Quest (Information at this link)", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 10, "course_code": "CHEM 120L", "course_name": "CHEM120L - General Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 1 Fall 2024", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Be sure to record their name and contact information in your lab manual.", "Skillfully perform basic procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "1,3,5,7,9,11", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Sept 19 - 24", "1,3,5,7,9,11", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "1,3,5,7,9,11", "- studying cis and trans isomers", "Oct 24-29", "1,3,5,7,9,11", "Titration as an Analysis Tool", "- identify an unknown solid acid", "1,3,5,7,9,11", "Introduction to Chromatography", "- quantify a cation using ion exchange", "1,3,5,7,9,11", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 11, "course_code": "CHEM 123", "course_name": "CHEM123 - General Chemistry 2 (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry 2 Winter 2025", "09:30AM - 10:20AM STC 1012", "Introduction to chemical equilibria.", "Describe the energy and entropy changes that accompany physical and chemical changes.", "Calculate the equilibrium constant for a reaction using the standard thermodynamic properties of reactants and products.", "Predict the direction of spontaneous change for a given set of initial conditions for a variety of chemical systems.", "Apply equilibrium principles to a variety of chemical reaction types including gas-phase reactions, acid-base reactions, precipitation reactions, complexation reactions and redox reactions.", "Analyze oxidation-reduction reactions and identify species being oxidized and reduced.", "Explain the basic construction of, uses of, and the differences between galvanic and electrolytic cells.", "CHEM 120 and CHEM 123 comprise a full-year course in introductory chemistry.", "Course Structure and Continuity Plans", "Chemistry Study Hall:  Starting the 2nd week of classes, there will be a first-year study hall on Tuesdays and Thursdays at 5:30 pm - 6:50 pm in STC 1012.", "You can attend as many Study Hall Sessions as you would like - grab your friends and connect with your TAs!", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 12, "course_code": "CHEM 123L", "course_name": "CHEM123L - General Chemistry Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 2 Winter 2025", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- a real life analysis", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 13, "course_code": "CHEM 220", "course_name": "CHEM220 - Intro Analytical Chemistry (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Intro Analytical Chemistry Fall 2024", "09:30AM - 10:20AM EXP 1689", "10:30AM - 11:20AM EXP 1689", "C2-275A", "For issues regarding grades/absences please email Stacey", "Emphasis on planning and decision-making in the analytical process.", "Introduction to Analytical Chemistry Chapter 1: 1-13", "Significant Figures", "Experimental Error", "Statistics", "Statistical Analysis", "Calibration Methods", "Calculations in Statistics and Calibration Methods", "Gravimetric and Combustion Analysis", "Monoprotic and Polyprotic Acid-Base Equilibria", "Gravimetric and Chemical Equilibria Problems", "Titrations – Introduction", "Instrumentation for Spectroscopy", "Absorption Spectrometry", "Fluorometry", "Introduction to Analytical Separations Chapter 29: 821-855 Work on Questions at end of course notes and provided on OWL platform.", "870-882", "Electrochemistry and", "Electroanalytical Techniques", "Applications of Analytical Chemistry", "Applications of Analytical Chemistry", "Students who do not write a test and who do not provide a valid reason, will have that test recorded as zero.", "Students who miss a test with an approved absence will not be provided a make-up test.", "Additional practice problems can be found at the end of each section of course notes.", "Notice of Recording", "Suggested practice problems will be posted via the textbook online system and at the end of each section of course notes.", "This course focusses on the independent development and practice of specific skills related to analytical chemistry.", "Intellectual property includes items such as:"]}, {"course_id": 14, "course_code": "EARTH 121", "course_name": "EARTH121 - Introductory Earth Sciences (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Earth Sciences Fall 2024", "Students will learn to think like a geoscientist by adopting four ways of thinking that take into account a systems approach, a variety of spatial and temporal scales, and field thinking.", "Recognize the dynamic nature of Earth through an examination of the interactive components of the Rock Cycle.", "Extrapolate meaning from everyday geologic material and predict occurrence and origin.", "Week 1: Introduction and Four Ways of Thinking 1a and 1b Discussion: Introduce Yourself", "Week 2: Introduction to Rocks 2a Field Notes Journal 2: Are minerals important?", "Week 3: Introduction to the Rock Cycle 2b Field Notes Journal 3: What do you see in the video?", "Week 4: Introduction to the Rock Classification 2c Field Notes Journal 4: Is this depiction of the Rock Cycle complete and accurate?", "Week 5: Geologic Time and Geologic Time Scale 3a and 3b Field Notes Journal 5: How do I create a simplified Geologic Time Scale?", "Please note emails can be received 24 hours per day", "Short-term Absence", "Covid-19-related Absence", "Intellectual property includes items such as:"]}, {"course_id": 15, "course_code": "EARTH 121L", "course_name": "EARTH121L - Introductory Earth Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Earth Sciences Laboratory Fall 2024", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Email: keith.delaney@uwaterloo.ca", "Sahar Soltani - sahar.soltani@uwaterloo.ca / LABS 001 & 003", "By far, the majority of people qualified as geologists spend their time using their knowledge working 'in the field', or in exploration, putting principles learned in theory and in the laboratory, into practice.", "Identify common mineral and rocks based on their identification properties", "Understand the rock cycle and how minerals and rocks are formed", "Understand the theory of plate tectonics and how it has shaped the Earth's surface over time", "Qualitatively and Quantitatively describe earthquakes and some of their processes", "Read and interpret data from both topographic and geologic maps", "Understand the immense history and geologic record of our planet", "Understand the factors influencing climate change and quantify how the planet is changing", "Will assess Mineral and Rock Identification knowledge with real samples.", "Lab 8 Earth Structures", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "Situation where VIFs are not Appropriate"]}, {"course_id": 16, "course_code": "EARTH 122", "course_name": "EARTH122 - Introductory Environmental Sciences (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Environmental Sciences Winter 2025", "08:30AM - 09:50AM STC 1012", "I hold a PhD in Earth & Environmental Sciences from the University of Waterloo (2014) and an HBSc in Earth & Environmental Sciences from McMaster University (2006).", "You might notice I'm looking pretty pregnant!", "I'm conveniently due on April 27 BUT in the unlikely even that I have a baby really early, the excellent Dr. Keith Delaney (who has taught this class for many years) will step in at the end.", "Discussions", "Questions of a personal nature", "Office: EIT 2051D (very back of Earth & Environmental Sciences main office)", "Email: msrosamo@uwaterloo.ca", "Grad TA contact info can be found in the EARTH 122L syllabus.", "Course topics include sustainable development and the availability and use of natural resources, principles of ecology and environmental science, biogeochemical cycles, climate and climate change, soils and food supply, energy systems, surface water and groundwater, waste generation and management, pollution, and catastrophic natural processes.", "Describe common global environmental issues and the role of environmental science in identifying, understanding, and solving these issues.", "Interpret and manipulate simple box models of environmental systems", "Interpret scientific diagrams and graphs pertaining to environmental science", "1 January 06 - 10 Intro to Environmental Science & Matter, Energy and Physical Environment Chps 1 & 2", "2 January 13 - 17 Earth Systems/Ecosystems & Evolution, Biodiversity, Population Ecology Chps 3 & 4", "3 January 20 - 24 Species Interactions/Community Ecology & Human Population Chps 5 & 6", "Soils & Soil Resources*", "8 February 24 - 28 Freshwater Systems/Water Resources & Marine, Coastal Systems, Fisheries Chps 11 & 12 Quiz 6 - Chapters 11 & 12 Content Mon. Mar 3  5:00PM 3", "10 March 10 - 14 Global Climate Change & Fossil Fuels: Energy Use/Impacts Chps 14 & 15", "Energy Alternatives & Mineral Resources & Mining", "Quiz 8 - Chapters 15 & 16 & 17 Content*", "12 March 24 - 28 Managing our Waste & Environmental Health Hazards Chps 18 & 19 Quiz 9 - Chapters 18 & 19 Content Mon. Mar 31 5:00PM 3", "A Look at Environmental Science and Natural Hazards & Final Exam Study Guide / Discussion", "following these guidelines: https://uwaterloo.ca/science-undergraduate-office/academic-policies-and-procedures/accommodation-illness-or-other-extenuating-circumstances."]}, {"course_id": 17, "course_code": "EARTH 122L", "course_name": "EARTH122L - Introductory Environmental Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introductory Environmental Sciences Laboratory Winter 2025", "EARTH 122L", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Sana Ahmad has a BSc degree in Honours Co-op Environmental Science with a Geoscience Specialization from the University of Waterloo.", "Discussions", "Questions of a personal nature", "Office: EIT 2046 (within the Earth & Environmental Sciences main office)", "Email: s76ahmad@uwaterloo.ca", "Please put EARTH 122L in your email subject line so I don't miss it!", "Please do not send them personal emails!", "View requirements for EARTH 122L", "Use GPS devices and GIS software to locate points of interest and create a map", "ALL LABS ARE HELD IN ROOM: EIT 1013 (ground floor of EIT  - same building as Earth Sciences Museum)", "8 February 24 - 28 Coastal Processes and Problems: Loving Our Coasts to Death?", "10 March 10 - 14 On-Campus Water Sampling and GPS Data Collection Field Sampling and Data Collection Lab around UW Campus", "13 March 31 - April 03 Landscape Geology: Glaciers and Deserts & Climate Change: Pleistocene Records, Milankovitch Cycles Lab 8: Landscape Geology and Climate Change End of Lab 7%", "Note used copies are also fine!", "The format of the final exam will be run digitally through the LEARN Quiz system in the last week of the course, not during the formal exam period.", "Notice of Recording", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "These can be completed digitally now!", "This official verification is necessary before any action can be taken and can be downloaded from the Health Services website.", "Situation where VIFs are not Appropriate", "Example citations:", "\"References"]}, {"course_id": 18, "course_code": "EARTH 123", "course_name": "EARTH123 - Introductory Hydrology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Dr. Rosamond is the International Lecturer for Water Sciences in the Department of Earth & Environmental Sciences at the University of Waterloo.", "She loves learning about water, especially nutrients and greenhouse gases in streams in rivers.", "Email: msrosamo@uwaterloo.ca", "Education", "2014 - PhD, Earth & Environmental Sciences, University of Waterloo, Waterloo, ON, Canada", "2006 - Honours BSc, Earth & Environmental Science (Sedimentology Specialization), McMaster University, Hamilton ON, Canada", "Philosophy of Teaching", "Dr. Rosamond's teaching philosophy focuses on (a) active learning techniques, including field and laboratory experience, and practical demonstrations in class, (b) building on the mathematical and chemical fundamentals in Earth Sciences.", "She is interested in adapting curricula to include experiential learning, focus on students' analytical skills, and to scaffold skills and concepts across courses in Earth & Environmental Sciences.", "Yizhi is a graduate student in Earth & Environmental Sciences at University of Waterloo, looking at groundwater contamination.", "Email: y278yuan@uwaterloo.ca", "The material is both qualitative and quantitative in nature and focuses on the circulation of water through the atmosphere, soil, groundwater aquifers, as well as looking at both the global fresh and marine water systems.", "Emphasis is placed on the physical aspects of hydrology, and the geologic and environmental factors that control the occurrence and cycling of water on Earth, as well as the impacts caused by population growth, contamination, urbanization or land use management, and climate change.", "View requirements for EARTH 123", "Describe the complexity and inter-connections of the global hydrological cycle;", "Apply basic qualitative techniques for describing earth systems processes related to water and water movements;", "Create and critique a simple water balance equation for a lake, river, or groundwater system;", "Introduce Yourself &", "All times are in China Standard Time.", "December", "Can be purchased through e-book sellers.", "These are a mix of multiple choice, matching, and mathematical questions.", "Surveys", "Discussions", "Notice of Recording", "We will assess what to do on a case-by-case basis."]}, {"course_id": 19, "course_code": "EARTH 221", "course_name": "EARTH221 - Introductory Geochemistry (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "EARTH 221", "EARTH 221 001", "EARTH 221 101", "RCH 306", "My PhD was completed in 2014 in nitrogen cycling and use of stable isotopes to understand N cycling in the Grand River, Ontario.", "EARTH 221:", "Introduction to environmental isotope geochemistry and radiometric dating.", "Basic aqueous geochemistry: pH, carbonate equilibrium, and common ions in natural waters.", "View requirements for EARTH 221", "Calculate basic geochemical parameters and create associated diagrams", "Identify applications of geochemistry for environmental problems/studies", "Present and discuss geochemical scientific literature", "Please read slides for Intro, element abundances, isotopes, chart of the nuclides, nucleosynthetic processes", "Highlights of Origin of Elements", "Periodic Table/Earth Formation", "Solar System geochemistry and planetary formation, composition of meteorites", "Chemistry of bulk Earth, atmosphere, oceans, crust, mantle, and core   A2 Misra p. 296 – 313, 326-344, 354-362", "Equilibrium constants, introduction to phase diagrams, basics of kinetics", "Basic concepts, laws of thermodynamics, Gibb's free energy.", "Igneous rock geochemistry", "A4 Misra p. 226 –  240, 310-313", "Introduction to Geochemistry.", "This grade includes:", "In groups of 4, you will present the findings of a recent scientific paper that includes some geochemistry.", "It is a closed book test.", "Typical question types may be multiple choice, interpreting diagrams, explaining concepts, and doing calculations (equations provided).", "Equations are provided and you should definitely bring a calculator.", "Notice of Recording", "Extensions and Accommodations", "Extensions and other accommodations will only be considered on a case-by-case basis.", "You are taking full responsibility for AI-generated materials as if you had produced them yourself: ideas must be attributed and facts must be true.", "In reference list:", "URL of the platform where the conversation took place]."]}, {"course_id": 20, "course_code": "EARTH 223", "course_name": "EARTH223 - Field Methods in Hydrology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrology Fall 2024", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "This course consists of field exercises and lectures designed to provide students with practical hands-on experience conducting a variety of hydrological monitoring techniques.", "This course is designed to provide hands-on field experience in the use of standard hydrologic monitoring techniques.", "The main objectives of this course are to use a variety of hydrologic data collection techniques in practical settings to answer hydrologic questions, identify the difficulty and importance of collecting good field data, and determine the accuracy/error of different measurement methods quantitatively and qualitatively.", "A Module will consist of two elements: (1) an activity in the field and (2) lecture and tutorial to review the fundamental concepts and discuss the data collected in the field.", "During each activity you will be working in groups of ~4.", "Assessment for each Module will consist of a pre-activity quiz administered on LEARN and an assignment that must be completed individually and uploaded to LEARN.", "Interpret the data in a hydrological context to explain groundwater/surface-water interactions, quantify water balances, and understand sources of contaminants found in water.", "Explain how drinking water in the Region of Waterloo is obtained, managed, and treated to ensure a safe and adequate supply.", "A Module will consist of two elements: (1) an activity in the field and (2) lecture and tutorial to review the fundamental concepts and discuss the data collected in the field.", "During each activity you will be working in groups of ~4.", "Assessment for each Module will consist of a pre-activity quiz administered on LEARN and an assignment that must be completed individually and uploaded to LEARN.", "Field Class Field Class Field Class Field Class", "Introduction (complete online)", "Sept 23**", "Sept 23**", "Sept 25**", "Sept 25**", "Oct 14**", "Oct 14**", "Oct 16**", "Oct 16**", "Oct 28**", "Oct 28**", "Oct 30**", "Oct 30**", "-", "Nov 25**", "-", "Nov 25**", "-", "-", "* complete virtually on your own", "***If possible", "These videos are designed to prepare you for the upcoming field activity and must be completed prior to the scheduled field activity time.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Must be uploaded as a single file", "Notice of Recording", "The field work is a critical part of this course and often you will be working in teams and so your lack of attendance may also result in some hardship for your group.", "You must be present for each field activity in order to get full credit for that activity  – unexcused absences will result in a 20% penalty for each missed field activity.", "For this reason, all students must complete WHMIS (Workplace Hazardous Materials Information System training) module before their first field activity session and provide proof of their training by uploading a picture of their form to DROPBOX.", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline).", "The policy can be found at: http://www.adm.uwaterloo.ca/infosec/Policies/policy33.htm", "Note on Avoidance of Academic Offences: Studying and working in groups to learn material can be a very valuable practice and is encouraged.", "Library for research-based assignments", "Strategies for learning online", "6 strategies for effective learning"]}, {"course_id": 21, "course_code": "EARTH 342", "course_name": "EARTH342 - Geomorphology and GIS Applications (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Geomorphology and GIS Applications Fall 2024", "changcheng.li@uwaterloo.ca", "04:00PM - 05:20PM", "changcheng.li@uwaterloo.ca", "Characteristics and development of various landforms (e.g. mountain belts, volcanoes, impact craters, and those created by erosion/deposition of rivers/glaciers) are introduced.", "Application of Geographic Information Systems (GIS) to Earth Sciences.", "Basic concepts of GIS and GIS applications in mineral exploration industry and in fieldwork are introduced.", "View requirements for EARTH 342", "Introduction to Geomorphology", "Various landforms and their development processes", "Introduction to ArcGIS", "Vector data model and raster data model", "Map projection and coordinate system", "Data input", "Basic applications of ArcGIS in mineral exploration and mining industry", "Spatial data analysis", "Interpretation of satellite image and air photos", "Introduction to ArcGIS", "GIS for Assessment report for a mineral exploration company", "Make a geological map", "Enhance contrast in colour between different rock units in Landsat satellite images", "One example of natural hazard assessment using spatial data analysis in ArcGIS", "Input and organize geographic data in ArcGIS and present them using maps", "Prepare base maps needed for geological field mapping", "Set up a web map for digital mapping in a group and collect data using mobile devices", "Make a geological map in ArcGIS based on field mapping data and interpretations", "Make drill hole location maps for assessment reports for a mineral exploration company", "Carry out basic spatial analysis to assess a natural hazard in a given scientific model and make maps to present spatial analysis results", "Examination regulations as outlined in the current UW undergraduate calendar are to be followed.", "In this course, the following will be considered as academic misconduct and unacceptable:", "Re-creating exam questions and answers without the express permission of the course instructor"]}, {"course_id": 22, "course_code": "EARTH 355", "course_name": "EARTH355 - Water: Data to Decisions (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["EARTH 355 - Water: Data to Decisions Winter 2025", "EARTH 355", "11:30AM -", "Please put \"Earth 355\" and issue in your email subject line.", "This course explores approaches for interpreting environmental data to support water decisions using theoretical and computational techniques.", "View requirements for EARTH 355", "In addition, approximately one case study will be provided each week as reading material with an instructor led discussion during this time.", "By the end of this course, you should be able to design a study to test a scientific hypothesis by:", "Identifying relevant statistical techniques", "Assessing results of statistical techniques to form a conclusion (using hand calculations & coding language)", "Acknowledging data uncertainty in statistical and mechanistic water models", "Compiling Data", "Identify and frame decisions", "Identify data requirements for making the decision", "Develop a database of the data", "Drinking Water Advisories in Nine First Nations in Ontario", "Compiling your Dataset", "Introduction to Jupyter Notebook and R", "Poster Development", "Context and Hypothesis", "Descriptive Statistics", "Develop tabular and graphical representations of data", "Calculate central tendency and variance in a variety of ways", "Identify when log transforms should be used for central tendency", "Calculate a z-score and explain what it means", "Environmental Flows and Minimum Desirable Streamflows", "Data Structure, Descriptive Statistics & Histograms", "Poster Development", "Introduction (literature review)", "&", "Calculate confidence intervals", "Calculate interval estimates", "4: Aggregate Development", "4: Plotting Univariate Data and Extracting information from Plots", "Poster Development", "3 & 4: Introduction and Data Presentation", "Define a hypothesis", "Test a mean", "Differences between two groups of data", "Estimating Risks from Exposure to Methyl mercury", "Functions and Confidence Intervals", "Poster Development", "Data and Methods", "Analysis of Frequency Data", "Test a hypothesis using χ2 test", "Assessing Relationships and Associations", "Loops and Hypothesis Testing", "Poster Development", "Data and Methods", "Identifying Temporal Trends", "Intensification of Algal Blooms", "Temporal patterns and probability of occurrence", "Plotting Categorical Data and the Chi-Square Test", "Poster Development", "Data and Methods", "Perform a nearest-neighbour analysis", "Nearest neighbor", "Local averaging", "Inverse distance weighting", "Explain the concept of kriging", "Identifying Spatial Trends", "Water contamination and cancer clusters", "Spatial patterns and interpolation", "Loading R packages, Plotting Bivariate Quantitative Data, and the Runs Test", "Poster Development", "Submit draft poster", "Spatial Mapping, Quadrat Analysis, and Nearest-Neighbor Analysis", "Poster Development", "Correlation Analysis & Regression Analysis", "Calculate Pearson product moment correlation coefficient (R)", "Calculate a simple linear regression using least squares criterion", "Describe how multiple regression analyses are different from single linear regression", "Correlation", "Correlation and Linear Regression", "Correlation and Regression", "Poster Development", "Methods and Results", "Trends & Fit Metrics", "Determine if a time series has a monotonic trend using Mann-Kendall or Sens Slope", "Identify appropriate fit metrics to assess data", "Trends", "Trends in baseflow across Canada", "Trends and Fit Metrics", "Poster Development", "Methods and Results", "&", "Introduction/Context - 15%", "Conclusions & Recommendations - 15%", "For the in-class activities, you will be given a worksheet to solve a problem related to the topic of discussion.", "The draft will be peer-marked using a rubric provided on LEARN.", "There will be one open question where you will be asked to discuss a perspective of one of the case studies we covered in class."]}, {"course_id": 23, "course_code": "EARTH 421", "course_name": "EARTH421 - Advanced Geochemistry (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Advanced Geochemistry Fall 2024", "08:30AM - 09:50AM MC 4064", "01:00PM - 03:20PM", "08:30AM - 10:50AM EIT 1009", "Development of the three laws of thermodynamics; Gibbs free energy and equilibria constants.", "Introduction to various topics in aqueous geochemistry such as mineral equilibria, ion exchange, and redox equilibria.", "View requirements for EARTH 421", "Development of the three Laws of Thermodynamics; Gibbs free energy and equilibrium constants.", "Introduction to various topics in aqueous geochemistry, such as mineral equilibrium, ion exchange and redox equilibrium.", "Laboratory sessions will involve various activities related to acid-base equilibrium, redox reactions, chemical modeling, and analytical instrumentation methods.", "Thermodynamics offers Geoscientists a powerful tool to aid in the interpretation of near surface processes.", "It can be used to delineate the physicochemical conditions that led to a particular mineral assemblage; to discern whether a mineral assemblage could have resulted from equilibrium or disequilibrium (kinetic-controlled) conditions; to aid in decision-making in exploration geochemistry; and to design geochemical barriers and containment systems at waste disposal sites.", "Applications include geothermal systems, acid-mine drainage, carbon sequestration, and other near surface environmental systems.", "Develop thermodynamic principles most relevant to geochemical systems", "Understand the concepts of chemical equilibrium and metastability in the context of Earth systems", "Develop conceptual and empirical models to describe natural geochemical systems", "Apply geochemical principles toward achieving a sustainable use of Earth’s resources, including predicting the impacts of resource development and developing strategies for mitigation of impacts", "Communicate geochemical concepts to various audiences", "Introduction and review", "Thermodynamics of Pure Substances", "Examples: Steam separation in geothermal systems, CO2 compressibility for sequestration.", "Thermodynamics of Simple Mixtures", "Free Energy (G)", "Determining mineral phase transitions.", "The derivation of the equilibrium constant (K) from the first and second laws.", "The need for the third law and evidence; where thermodynamic data originates and its limitations", "Free energy calculations", "Aqueous Solutions", "Applications of acid-base and redox reactions in natural and perturbed systems.", "Aqueous geochemistry", "Solubility products and saturation indices; the influence of ion hydrolysis on mineral and gas solubilities.", "The Carbonate System", "An examination of carbonate gas-water-solid equilibrium and the factors that influence it.", "A look at analogous geochemical systems.", "Recommended reading for those pursuing advanced degrees in geochemistry."]}, {"course_id": 24, "course_code": "EARTH 458", "course_name": "EARTH458 - Physical Hydrogeology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrogeology Fall 2024", "08:30AM - 09:50AM DWE 3519", "An introduction to the principles and theories of mineral deposit genesis.", "Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered.", "View requirements for EARTH 458L", "Applied geophysics provides geoscientists with a wide-range of non-invasive methods for characterizing the Earth's interior.", "This course is an introduction to the physical principles underlying field acquisition, processing, and data interpretation for commonly used applied geophysical techniques (seismic, electrical, electromagnetic induction, gravity, and magnetic methods).", "This course is not only pertinent for geoscientists but also for engineers and others interested in learning how physics can be used to explore the Earth's interior or perform non-destructive testing.", "Near-surface geophysics is used to characterize the shallow subsurface for a wide-spectrum of applications.", "This application-oriented course covers current methodology in near-surface geophysics, including electrical, electromagnetic, ground penetrating radar, seismic refraction, and well-logging methods.", "Techniques for geophysical data acquisition and interpretation are studied and applied to field data.", "Examples of the application of geophysical techniques to archeological, forensics, geotechnical, glaciology, and hydrogeological problems are examined.", "View requirements for EARTH 461", "A field-oriented course on current methodology in the general area of geotechnical or engineering geophysics as applied to environmental problems.", "Typical topics covered: well logging and time domain electromagnetic surveys for groundwater supply; magnetic and terrain conductivity surveys for waste materials; ground penetrating radar applications to stratigraphy and contamination; streaming potential surveys of dam leakage.", "A pre-lab quiz must be completed before attending each field lab.", "Labs will be completed in groups with field data recorded in field books or datasheets.", "These data will be used to a complete individual lab assignment.", "This site contains over 100 groundwater monitoring wells.", "Field lab activities involve:", "(3) Measurement of in-situ hydraulic conductivity using single-well response tests", "Each lab will provide you with a unique dataset that you will use to develop a conceptual site model of the local groundwater flow system.", "• Properly construct and interpret soil core logs using United Soil Classification System, and make lithostratigraphic interpretations using geophysical logs", "• Assess and interpret water level measurements through the construction of water table maps and flownets", "• Interpret single-well response tests including falling and rising head (slug) tests to determine in-situ hydraulic conductivity", "• Interpret hydraulic pumping tests to determine aquifer transmissivity and storage parameters and assess water resource vulnerability", "Each module will contain a series of recorded lecture slides and video demonstrations reviewing core concepts and guidelines for the upcoming field lab.", "Please include “Earth 458L” in the subject line of all e-mail communications as well as your Full Name and Student ID# in the text of the email.", "Hydrogeological equipment to make measurements and collect data (temporary use)", "Specialized hydrogeological software to complete certain assignments", "Datasheet to record field data", "Other data should be recorded in your field books and distributed to your group members as needed.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Notice of Recording", "Participation in Field Labs:", "These quizzes are designed to keep you on schedule and prepare you for the in-person field lab and assigned activities.", "There will be a 48-hour grace period to finalize the submission of your assigned activities without incurring any late penalty."]}, {"course_id": 25, "course_code": "EARTH 458L", "course_name": "EARTH458L - Field Methods in Hydrogeology (0.25)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrogeology Fall 2024", "08:30AM - 09:50AM DWE 3519", "An introduction to the principles and theories of mineral deposit genesis.", "Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered.", "View requirements for EARTH 458L", "Applied geophysics provides geoscientists with a wide-range of non-invasive methods for characterizing the Earth's interior.", "This course is an introduction to the physical principles underlying field acquisition, processing, and data interpretation for commonly used applied geophysical techniques (seismic, electrical, electromagnetic induction, gravity, and magnetic methods).", "This course is not only pertinent for geoscientists but also for engineers and others interested in learning how physics can be used to explore the Earth's interior or perform non-destructive testing.", "Near-surface geophysics is used to characterize the shallow subsurface for a wide-spectrum of applications.", "This application-oriented course covers current methodology in near-surface geophysics, including electrical, electromagnetic, ground penetrating radar, seismic refraction, and well-logging methods.", "Techniques for geophysical data acquisition and interpretation are studied and applied to field data.", "Examples of the application of geophysical techniques to archeological, forensics, geotechnical, glaciology, and hydrogeological problems are examined.", "View requirements for EARTH 461", "A field-oriented course on current methodology in the general area of geotechnical or engineering geophysics as applied to environmental problems.", "Typical topics covered: well logging and time domain electromagnetic surveys for groundwater supply; magnetic and terrain conductivity surveys for waste materials; ground penetrating radar applications to stratigraphy and contamination; streaming potential surveys of dam leakage.", "A pre-lab quiz must be completed before attending each field lab.", "Labs will be completed in groups with field data recorded in field books or datasheets.", "These data will be used to a complete individual lab assignment.", "This site contains over 100 groundwater monitoring wells.", "Field lab activities involve:", "(3) Measurement of in-situ hydraulic conductivity using single-well response tests", "Each lab will provide you with a unique dataset that you will use to develop a conceptual site model of the local groundwater flow system.", "• Properly construct and interpret soil core logs using United Soil Classification System, and make lithostratigraphic interpretations using geophysical logs", "• Assess and interpret water level measurements through the construction of water table maps and flownets", "• Interpret single-well response tests including falling and rising head (slug) tests to determine in-situ hydraulic conductivity", "• Interpret hydraulic pumping tests to determine aquifer transmissivity and storage parameters and assess water resource vulnerability", "Each module will contain a series of recorded lecture slides and video demonstrations reviewing core concepts and guidelines for the upcoming field lab.", "Please include “Earth 458L” in the subject line of all e-mail communications as well as your Full Name and Student ID# in the text of the email.", "Hydrogeological equipment to make measurements and collect data (temporary use)", "Specialized hydrogeological software to complete certain assignments", "Datasheet to record field data", "Other data should be recorded in your field books and distributed to your group members as needed.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Notice of Recording", "Participation in Field Labs:", "These quizzes are designed to keep you on schedule and prepare you for the in-person field lab and assigned activities.", "There will be a 48-hour grace period to finalize the submission of your assigned activities without incurring any late penalty."]}, {"course_id": 26, "course_code": "ERS 316", "course_name": "ERS316 - Urban Water and Wastewater Systems: Integrated Planning and Management (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Urban Water and Wastewater Systems: Integrated Planning and Management Fall 2024", "ERS 316", "Dr. Felicitas Egunyu", "Emily Rorison          Email: erorison@uwaterloo.ca", "Development and maintenance of urban water and wastewater systems, along with demand and supply management planning, efficiency mechanisms, development and equity concerns, will be examined.", "View requirements for ERS 316", "This course is designed for senior students interested in urban environmental issues, with a focus on water services.", "This course extends concepts learned in ERS 265 (Water History), complements ERS 365 (Water Governance), and is a useful foundation for a senior thesis (ERS 411) or interdisciplinary graduate studies on water issues.", "For those students who have a strong interest in the topic, but do not have the background knowledge, this course will offer a comprehensive understanding of urban water and wastewater systems.", "Lectures, participating in tutorials, and groups provide an overview of key concepts and highlight important ideas from the readings.", "Describe frameworks for understanding and explaining urban water use.", "3. Identify and describe municipal water and wastewater systems and their subcomponents.", "The Aqueducts and Water Supply of Ancient Rome", "Yudelson", "Yudelson", "Yudelson", "Yudelson Chapters 7 – 8", "Yudelson Chapters 11 – 13", "Exposing the myths of household water insecurity in the global north: A critical review", "Yudelson", "Notice of Recording", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 27, "course_code": "GEOG 305", "course_name": "GEOG305 - Fluvial Geomorphology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["RCH 211", "Emphasis on concepts related to fluvial processes, river mechanics, the relationship between environmental change and river regime.", "Fluvial geomorphology is the scientific study of river landforms and the processes that create them.", "A working knowledge of fluvial processes has important practical environmental science, watershed management and engineering applications and is relevant to many other fields of environmental enquiry such as environmental engineering, watershed planning, source water protection, forestry, and risk management.", "This course will examine a range of physical and chemical processes that create micro and macro-scale landforms over a range of spatial and temporal scales.", "Implications of these processes for environmental management in the context of environmental change will be considered.", "To understand basic fluvial geomorphic processes and their role in landform development and change", "Why study rivers?", "Sept 16              Landscapes and Rivers", "Inputs, outputs and storage", "Types of systems", "Fluvial system variables", "Spatial and temporal scales", "Concept of equilibrium", "Feedback, thresholds and equilibrium – Southern Rockies case study", "Flow generation and hydrological pathways", "Storm hydrograph and drainage basin response", "Discharge Measurement and Streamflow Analysis", "Floods", "Bankfull discharge", "Flood magnitude and frequency", "Regional flood frequency curves", "Rills and gullying", "Soil erosion models", "Modes of sediment transport in rivers", "Sediment storage and delivery ratio", "Flow in river channels", "Driving and resisting forces", "Channel parameters", "Concept of flow continuity", "Flow, channel and boundary resistance", "Subcritical, critical and supercritical flow", "Boundary layer", "Concept of stream power", "Work, energy and stream power", "Erosion in bedrock channels", "Erosion in alluvial channels", "Sediment supply and transport rates", "Driving variables", "Boundary conditions", "Nature of change", "System response", "https://uwaterloo.kanopy.com/video/return-river-0", "Dec 2                  Impact of climate change on river systems", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 28, "course_code": "GEOG 407", "course_name": "GEOG407 - Environmental Hydrology of Terrestrial Ecosystems (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Environmental Hydrology of Terrestrial Ecosystems Winter 2025", "08:30AM - 09:50AM AL 211", "merrin.macrae@uwaterloo.ca", "Email: mmacrae@uwaterloo.ca", "This course focuses on ecological and biogeochemical processes that are linked to the terrestrial hydrological cycle and how these relate to the management of natural resources.", "The objectives of this interdisciplinary course are to explore topics that integrate ecosystem processes with physical hydrology and examine the impacts of human activities on ecohydrological and hydrochemical processes within terrestrial systems.", "Understand linkages between hydrological and biogeochemical processes in the natural environment", "Understand the implications of land use change and climate change on selected ecosystems", "Analyze and visualize numerical data and write laboratory reports", "Jan. 14 Watershed Hydrology Field and Lab Methods for Water Quality 1 *Safety/services & orientation of labs; TAs do overview of labs", "Feb. 25 Wetlands and In-stream Processes  *Data Lab Part 2", "Mar. 4 Impacts of Climate Change on hydrology and biogeochem: case study of subarctic and temperate peatlands *Data Lab Part 2", "Each lab section will attend a total of two “practical labs” – one will be held outdoors in the field and the other will be held indoors in a laboratory setting.", "For the indoor lab, students will learn standard techniques for the processing of samples and the analyses of key water quality parameters.", "This time of year can be cold and wet – students must have proper clothing to stay warm and dry for 1.5 hours in the field.", "The meticulous construction of lab reports or field reports is a hallmark of any undergraduate education in geography and environmental sciences.", "The careful analysis of hydrological and water quality data is also critical in water quality research and is a skill necessary to succeed in jobs in this field.", "These labs will introduce you to the exploration and analysis of standard parameters in water quality analysis, by working with the data and constructing informative tables and graphs and describing what your data is showing you.", "The exam will consist of a series of multiple choice, short answer and longer essay-style questions.", "This course includes the independent development and practice of specific skills, such as understanding the importance of proper data collection and analysis, as well as the interpretation of these data.", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 29, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 30, "course_code": "PHYS 111", "course_name": "PHYS111 - Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["An introduction to physics for students intending to concentrate their further studies in biology, dentistry, medicine and paramedicine; includes particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.", "The main physics principles and laws covered in PHYS 111 include: “Particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.”", "PHYS 111 focuses on basic physics principles and laws, on conceptual understanding and problem-solving skills, and an appreciation for the power of physics in explaining how nature works, in the contexts of both the physical and life sciences.", "Physics Principles and Laws: By the end of the course, students will be able to construct scientifically sound explanations of a variety of basic physical phenomena by applying basic physics principles/laws.", "define linear momentum, and calculate and compare momenta of various real-life objects;", "define and calculate impulse, and establish the conditions for conservation of linear momentum; and", "apply the laws of conservation of momentum and energy to collisions.", "Problem-Solving Skills and Strategies: By the end of the course, students will be able to creatively apply a variety of structured problem-solving strategies:", "interpret, visualize and convert the problem into a physical model (e.g., draw a free body diagram);", "evaluate the result — does it make sense?", "These problem-solving skills are useful in the students’ own disciplines and beyond.", "More detailed information about the course elements which contribute to the final grade will be given in the learn sight and in future outline updates", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 31, "course_code": "STAT 202", "course_name": "STAT202 - Introductory Statistics for Scientists (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Statistics for Scientists Winter 2025", "R. Metzger", "R. Metzger", "jenny.tieu@uwaterloo.ca", "02:30PM - 03:20PM", "jenny.tieu@uwaterloo.ca", "R. Metzger", "02:30PM - 03:20PM", "PHY 313", "jenny.tieu@uwaterloo.ca", "R. Metzger", "Methods for data summary and presentation.", "Estimation, hypothesis testing, two-sample techniques and paired comparisons, regression, correlation.", "Evaluate the strengths and weaknesses of a simple sampling technique.", "Given a set of data:", "Build a simple linear model for a dataset.", "Perform simple statistical test to determine whether:", "A population mean and proportion differs from a particular value.", "A simple linear regression model parameter is significant.", "Probability Functions (PF) and Cumulative Distribution Functions (CDF):", "Differentiate between a Binomial and Poisson experiment.", "Define simple sample spaces and calculate simple probabilities.", "Calculate the sample mean and sample variance of a linear combination.", "Linear Relationships (Covariance and Correlation), Time Series, Scatterplots, Linear Regression", "Instructor(s) will go over a problem set.", "Regression analysis", "Sample design", "Poisson Distribution, Normal Distribution", "Instructor(s) will go over a problem set.", "Inference", "Instructor(s) will go over a problem set.", "Inference", "Inference", "- location TBD", "≥50", "No considerations are given for individual technical issues.", "This is a cumulative test that will cover the entire course.", "Late Tests will be given a zero mark.", "Note for your circumstance to be deemed valid you must have been incapacitated for a significant portion of the assessment window.", "A circumstance that incapacitates a student for a month or longer is unlikely to be accommodated – in such a case we ask that you please speak to your academic advisor and consider dropping the course.", "In the past some of the issues below have cropped up in my courses:", "Make sure you start online quizzes early, hand in assignments early, etc in case of unforeseen technical issues!", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 33, "course_code": "BIOL 470", "course_name": "BIOL470 - Methods of Aquatic Ecology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Methods of Aquatic Ecology Fall 2024", "03:30PM - 04:20PM", "As an active researcher in aquatic ecology for more than 30 years (with the Fisheries and Oceans Canada, Environment Canada, Canadian Water Network and the University of Waterloo) the instructor (Prof. Mark Servos) will highlight and demonstrate some key techniques and share experiences based on extensive field work in Canada and elsewhere.", "Professor Mark Servos", "An introduction to methods used to sample and characterize the ecological structure and function of aquatic ecosystems, including basic aspects of the abiotic environment.", "Field trips to lake and stream sites are combined with laboratory analysis of samples and data.", "While the main emphasis is on the techniques, the exercises also provide direct experience with some of the natural and anthropogenic variation observable in aquatic systems.", "On-line background with readings and assignments,", "Field collections/demonstrations,", "Sample preparation, analysis and demonstrations,", "The impact of Belwood Lake on the ecology of the Grand River below the Shand Dam is used as a case study.", "Students will develop an understanding of the common methods used in aquatic ecology to study and assess biodiversity and change in aquatic ecosystems.", "It should be noted that the intention is not to cover every aspect of aquatic ecology but to apply methods and techniques that are common in current biomonitoring program.", "Identify and use common sampling equipment applied in aquatic ecology,", "Understand the physical and ecological structure and processes of a lake environment,", "Understand the physical and ecological structure of a stream environment,", "Put the ecological data collected into the context of the physical/biological environment,", "Field Trip/Lab", "Adaptation to Rivers", "Data Analysis and Review", "Practical Test and Data Analysis", "Freshwater Ecology: Concepts and Environmental Applications in Limnology, 3rd Edition, 2020.", "The assignments are all linked to the final interpretation and synthesis of the field sampling data and preparation of the final report.", "The first assignments focus on field sampling methods (supporting the field trips) and then analysis of the samples collected and data interpretation.", "Practical Test", "This will be a test of the acquired skills for field collections, sample preservation, identifications/methods.", "You will be issued a field lab book on the first class/lab.", "Please make drawing and included important aspects of filed collections methods, how to separate the common species collected/identified and data processing.", "If you need to miss a field trip it is very important to tell us in advance (so we can plan for it).", "If you miss a field trip or lab you are still responsible for all class material covered.", "If you come to the first lab and provide the password/code “rainbow darter” you will get your first stamp.", "Notice of Recording", "During this class we will take photos of the field and lab activities.", "Exceptions for Special Circumstances"]}, {"course_id": 34, "course_code": "BIOL 361", "course_name": "BIOL361 - Biostatistics and Experimental Design (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Biostatistics and Experimental Design Winter 2025", "Question & Answer (Consultation) Sessions: Prof. Hall will be available for two 50-muinute remote sessions each week of classes to answer questions and provide advice.", "These sessions will be held every Tuesday @ 11:00 am -11:50 am & Friday @ 11:30-12:20 pm that you access via Teams at this link.", "You must bring your personal computer to each lab session capable of running the statistical software!", "An introduction to hypothesis testing and experimental design in biology.", "Topics will include exploratory data analysis, analysis of variance, categorical data analysis, correlation, linear regression, multiple linear regression, power analysis, and visualization tools.", "Statistical software will be used in computer laboratories to explore examples and applications.", "Biology 361 is a practical course in statistics and experimental design for students of the biological sciences.", "Provide you with a set of tools and techniques so you can perform your own data analysis and experimental design.", "The tools include statistical-analysis tools and graphical approaches to data analysis and display.", "This course offers training in data handling & analysis, hypothesis testing and experimental design in Biology.", "Topics will include: exploratory data analysis, two-sample tests, analysis of variance, categorical data analysis, correlation, linear regression, multiple linear regression, power analysis, experimental design, and data visualization tools and statistical software.", "The Course Schedule provides the list of topics covered during each week of the course.", "The lab sessions provide important skill development and practice for activities that students will use in the written assignments and tests of the course – so, the Lab sessions are the most important components of the course!", "Make sure to attend them!!!", "Effectively use a sophisticated statistical software package (e.g., IBM SPSS Statistics).", "Summarize and display data so you can learn what they show, and to communicate the key features to others.", "Gain confidence in solving problems and answering scientific questions with data (= evidence).", "This is a practical course that provides students with experiential learning opportunities to master skills in handling data (graphical and numerical summaries), statistical analysis and experimental design.", "Effectively use a sophisticated statistical software package (e.g., IBM SPSS Statistics).", "Summarize and display data so you can learn what they show, and to communicate the key features to others.", "Gain confidence in solving problems and answering scientific questions with data (= evidence).", "Lecture 1: Introduction to course/Intro to statistics", "Lecture 2: Data in Biology", "Lecture 3: Intro to Hypothesis Testing & Exp’tal Design", "Lab 1 – Intro to SPSS & Descriptive Statistics", "Lab 2 – Confidence Intervals & Hypothesis Testing", "Descriptive Statistics", "Lecture 10: Experimental Design I", "Lecture 11: Experimental Design II", "Lab 4 – Experimental Design", "Lecture 15: Categorical data analysis I", "Lab 7 – Categorical Data Analysis", "Lecture 18: Regression Analysis I", "Lab 8 - Correlation & Linear Regression", "Lecture 20: Multiple Linear Regression", "Lecture 21: Power Analysis", "Lab 9 – Simple & Multiple Linear Regression", "Lab 10 – Power Analysis", "Exam period", "exact timing To Be Announced", "STRONGLY RECOMMENDED 6-month rental No 50.62", "IBM SPSS Statistics (SPSS) is a sophisticated statistical software package that is widely used in research and business.", "Thus, I strongly urge students to use the first option - to purchase a copy of IBM SPSS Statistics for Students.", "There is a 12-month rental (extends well beyond end of the course: $ 84.50) if you have reason to use SPSS after the course ends: https://e5.onthehub.com/WebStore/OfferingDetails.aspx?o=adb263bd-0a39-ed11-814e-000d3af41938&pmv=4089c65e-9133-ed11-814e-000d3af41938&ws=4c3b92f6-3b32-e611-941d-b8ca3a5db7a1&vsro=8", "If you experience difficulties with Option 2 or do not see the software offering on the page, contact Science Computing via email at sci@uwaterloo.atlassian.net", "I have placed them on 1-day reserve in the UW Davis Library so students can access them.", "Excellent introductory biostatistics text that focuses on explaining the proper scientific interpretation of statistical tests rather on the mathematical logic of the tests.", "Biometry: The Principles and Practice of Statistics in Biological Research (3rd Edition).", "W.H. Freeman & Co. ISBN 0-7167-2411-1.", "Includes a full complement of statistical tables.", "Excellent resource for experimental methodology in the ecological sciences.", "Experimental Design for the Life Sciences.", "This course includes independent development and practice of specific skills by students, such as organizing data in spreadsheets for analysis by statistical software, making choices about the most effective graph and table style to display information (data), choosing the appropriate statistical test for a stated hypothesis and data set, drawing your own interpretations and conclusions from the data, and communicating your own understanding.", "•              Library for research-based assignments"]}, {"course_id": 35, "course_code": "BIOL 450", "course_name": "BIOL450 - Marine Biology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Know and describe the ecology and evolution of marine organisms in the context of the habitat that they occupy and the selection pressures that have led to these adaptations.", "The textbook provides extra material that will enhance the student learning experience and understanding as it will expand on key concepts that we cover in class.", "Exams Format- The format for both the midterm and final exam may be multiple choice, true/false, matching, and short answer questions.", "I will first post the questions and give you a few days to go over them, and then post the answers.", "These recap sessions will be during class time and are an opportunity for us to go again together over concepts that require further clarification.", "Note that these recap sessions ARE NOT intended to go over again entire lecture topics so please be specific with what you are asking (you can point to specific slide numbers if easier).", "If I don’t get a lot of questions for these recap sessions, then we will move over to new material so please make sure to attend those sessions.", "Notice of Recording", "Do not share these with any third-party sites or on social media.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 36, "course_code": "EARTH 437", "course_name": "EARTH437 - Rock Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["10:00AM - 11:20AM PHY 313", "Rock mechanics principles and design procedures in areas of mining, civil engineering, and petroleum engineering.", "Monitoring methods, including introduction to microseismic surveillance.", "ROCK MECHANICS & ROCK ENGINEERING", "Course content in relation to prerequisite courses", "Scope, capabilities & applications of rock mechanics", "Discussion of On Line Information Sources for engineers and scientists", "Discussion of RISK in engineering design and operation, in different industries", "DESIGN PRINCIPLES", "Uncertainties in design, concept of modelling, types of model", "--Introduction to probabilistic concepts in design; safety factors in civil, mining and petroleum", "--Conceptual, mathematical, empirical, physical, probabilistic models", "Parametric studies (sensitivity analyses) as a design tool", "Empirical design & expert systems (review); use of knowledge sources and data bases", "Analog and physical models (review); assessment of mechanisms", "Analytical solutions & numerical modeling", "Limitations and role of laboratory and field testing in rock mechanics (overview)", "Estimation of the past and future load history and geometry evolution", "Development of a sufficient behavioral law for the problem to be addressed", "Confirmation of the design validity and continued optimization by monitoring and re-analyzing", "**Assignment 1 on Design Approaches and Uncertainty in Rock Engineering.", "FORCE AND STRESS", "Mass and weight, forces, stresses and strengths, vectors & tensors", "Calculation of total and effective stresses in sedimentary basins", "Slow compaction and lithification of sediments, continental drift and mantle processes", "Stress on a surface & elemental cube; shear and normal stress calculation on an arbitrary plane", "Gravitational stresses, effects of depth and topography", "At-rest stress state, loading and unloading effects, stress history and diagenesis", "Tectonic stresses, \"fossilized\" stresses, intercrystalline stresses and core microfracturing and disking", "Limits to earth stresses, active and passive limits for sediments, effect of cohesion", "Limits to stresses in jointed rocks, slip of joints, effect of fissured masses", "Measured soil & rock stress trends, unloading of strata", "Stresses in creeping rock strata such as shale and halite", "Stresses near the earth's surfaces and at depth; depth and intensity of earthquakes", "Stress trajectories in the earth, changes because of tectonic and volcanic effects", "Estimation of stress states in sediments; basin models and structural geology principles", "Stress measurement methods in soils & rocks: nulling, strain-relief, and direct methods", "Nulling methods: slotting stress meter, undercoring & flat jack methods", "Direct methods: liquid inclusion, hydraulic fracturing & hydraulic tests on preexisting fissures", "**Assignment 2 on Stresses in the Earth: calculations, measurements, estimations", "Definitions of strength & yield criteria; peak strength and ultimate strength", "The difference between residual mineral strength and ultimate rock mass strength", "Strength & yield criteria in 2-D stress space (t-sn' and p-q diagrams)", "Uniaxial, biaxial, polyaxial, hydrostatic compression tests", "Effect of scale on strength, large-scale triaxial tests in the laboratory", "Direct & indirect tensile tests, beam bending, torsion and hollow cylinder tests", "Tilt tests on blocks & core, rock-to-rock surface required", "Triaxial testing of discontinuities - limitations", "Sampling of jointed rock & filling materials, taking and testing replicas", "Direct shear test with laboratory & field‑portable apparatus", "In situ tests on blocks, slopes and underground testing", "Estimating shear strength from back analysis", "The effects of increasing normal stress on porous and non-porous rocks", "Dilatant behavior & i-angle, curvilinear criteria overview, scale & roughness effects", "Shear strength criteria, Mohr‑Coulomb strengths of joints and fillings", "Attributes of the strength surface", "Mohr‑Coulomb criterion, Griffith criterion and extensions", "Crack initiation & propagation, Griffith crack theory, extensional strain fracture criteria", "Modes of rupture & yield associated with brittle behavior and different stresses", "A proposed mechanism for rock bursting", "Fracture toughness tests for fracture mechanics", "Mechanisms of brittle rupture in blasting, hydraulic fracture", "STRAIN AND DEFORMATION:", "CONCEPTS & MEASUREMENT", "Elastic and inelastic behaviour, linear and non-linear behaviour", "Strain and deformation, reversible and irreversible straining, non-linearity of deformation processes", "Strain localization because of weakening, localization of slip along joints in a rock mass", "Strain paths for 2-D cases in typical situations such as mining a free vertical face,", "Anisotropy of rock deformability: principal directions of stiffness, example of shales", "Uniaxial compression test & derivation of elastic parameters", "Volumetric strain measurements in triaxial tests, dilation of rock matrix and joint surfaces", "Joint stiffness & compliance, shear stiffness versus shear displacement", "FIELD TESTS OF ROCK AND ROCK MASS DEFORMABILITY", "Flexible CSM dilatometer & rigid Goodman Jack", "Plate loading tests, surface & underground, rigid & flexible plates", "Radial jacking & pressure tests in tunnels", "STRESS‑STRAIN CURVES FOR SOILS & ROCKS", "Typical static-elastic parameters & behavior of various rock types", "Dilatancy suppression as the effect of normal stress; increasing damage with dilatancy reduction", "Comparison of laboratory & field results", "Stress waves and their velocities in different rocks", "Measurement of wave velocity & dynamic elastic parameters", "Typical dynamic elastic properties, difference between static & dynamic values", "Time- and temperature-dependence of strength and strain", "Conventional \"primary-secondary-tertiary\" creep concepts", "The concept of steady-state fabric and increasing damage in covalent bonded rocks", "Laboratory uniaxial & triaxial creep tests", "Stress relaxation & strain‑rate controlled tests", "Field tests & back analysis; trial rooms and convergence measurements", "Rheological elements & simple rheological \"bodies\"", "Non-linear elastic, plastic (slip and rupture), and viscous parameters", "Creep behavior of typical soft & hard rocks", "**Assignment 4 on Rock Deformation: compressibility, deformation, calculation of moduli, creep, swelling, and thermal effects in rocks: rheological models, simple calculations", "Slopes in Mining Engineering versus Slopes in Civil Engineering", "The Safety Factor concept and the Probability of Slip concept", "Slowly creeping slopes – clay shales in Western Canada", "Earthquake triggered slides – quick clay slides in ON, QC", "Impacts of rainfall events", "Deep weathering in crystalline rocks and impact on joint strength", "VECTOR ANALYSIS AND LIMITING EQUILIBRIUM METHODS", "The infinite slope sliding along a pressurized basal plane", "--Vectorial analysis using forces", "--Development of equations, design charts", "--Design charts and making a problem dimensionless for plotting", "Using a simple model of slope yield to incorporate uncertainty – the Monte Carlo method", "--Porous, permeable thermal reservoir", "The disposal reservoir", "--Biosolids injection and sequestration of carbon in solid form", "Closed-form solution derivations for the lateral stress changes in a reservoir", "CLOSED-FORM SOLUTIONS FOR CIRCULAR OPENINGS IN ELASTIC ROCK", "The Lamé hollow cylinder equations", "--Derivation of hydraulic fracture equations for an impermeable, pressurized elastic borehole", "--State of stress in the elastic tunnel or borehole wall in a deviatoric stress field", "--Closed-form solution for thermal stresses on the wall of a circular opening because of DT", "--Use of a borehole stability software package", "DVELOPING AND STABILIZING UNDERGROUND OPENINGS", "--Support systems", "The use of such solutions as a guide to engineering practice", "**Assignment 7 on Circular Openings: the tunnel and a fissure, the fracture equations, typical stress distributions", "Establishment of baseline data", "Confirmation of analytical and design assumptions", "Process optimization during development and operations – Adaptive Management in Geo Engineering", "The uses of direct observation", "Alarms, limit switches, designing software for continuous analysis", "Multi-arm calipers, geophysical log methods", "Geophysical borehole logging methods", "Temperature and pressure monitoring installations in deep boreholes", "Active seismic methods, X-hole seismic tomography, time-lapse methods", "Gravity surveys, magnetic surveys", "Surface and subsurface tiltmeter arrays", "Microseismic monitoring", "**Assignment 8 on Monitoring and Design Verification in Rock Mechanics", "The Introduction to Rock Mechanics course will repeatedly emphasize to the student the importance of understanding limitations and risks that must be managed in a Professional context, including issues such as responsibilities and ethics in design and reporting (Read the additional document on Information Sources and Ethics)", "The design process in Geomechanics will be outlined as a process of risk management and continual design and project outcomes improvement", "The student will learn to appreciate the importance of Earth Stresses and how to measure or estimate them, and be able to do depth and stress-pressure calculations", "It is an expectation that the student knows what deformation-based design is and how to estimate and measure the deformability of rock at all scales from the laboratory to the field, for Civil, Mining and Petroleum Engineering applications, including foundations design, prediction compaction behavior", "A basic comprehension of Yield and “Failure” of rock specimens and rock masses, including failure mechanisms, the yield behavior of joints, dilation, Mohr-Coulomb yield criteria, ultimate strength, use of Mohr-Coulomb diagrams to evaluate strength and proximity to strain-weakening yield, is expected as part of the design environment in rock mechanics", "What is rheological modelling and its role in breaking down complex stress-strain-yield constitutive behavior into simpler elements to help understand the elements of constitutive laws and physics?", "What are the basic mechanics and physics of creep in rock and rock masses (with some emphasis on salt mechanics)?", "Doing slope stability analysis using limiting equilibrium of forces methods, including understanding how to incorporate forces arising from pore pressures, earthquake loading, self-weight, tensioned cables, and other factors into slope stability assessment.", "Introduction to stress concentrations arising around circular openings and other structures in RM, using the Kirsch equations for stresses around a circular borehole.", "Students are introduced to this analysis for first-order estimates of borehole yield, and sequenced/observational methods for tunneling in naturally jointed rock masses are introduced.", "Calculating effective stress changes and proximity to strain-weakening yield based on stress and yield criterion analysis", "Although the course does not involve mathematical modeling (numerical simulation) directly, everyone in RM areas and other engineering domains will be using numerical modeling approaches in their careers.", "The concept of THMC coupling will be introduced", "Introduction to some special topics will be undertaken in the final several lectures to help open the student to interesting development and directions in Geomechanics.", "For example, shale gas and shale oil geoengineering, CO2 sequestration, and geothermal energy are important emerging areas that are rich in RM issues", "Assignment #1 Design and Uncertainty", "Assignment #2 Stresses in the Earth", "TBA"]}, {"course_id": 37, "course_code": "EARTH 439", "course_name": "EARTH439 - Flow and Transport Through Fractured Rocks (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Email:", "Fractures are ubiquitous in geologic media and important in disciplines such as physical and contaminant hydrogeology, geotechnical engineering, civil and environmental engineering, and petroleum engineering among other areas.", "Despite the importance of fractures, its characterization and predictions of groundwater flow and contaminant transport are fraught with significant difficulties.", "An introduction to the physical hydrogeology of fractured rock.", "Topics will include a review of the structural geology of fractured rocks, development and validity of the cubic law, groundwater flow and contaminant transport in discrete fractures and fracture networks, hydraulic testing methods and the hydrogeology of low-permeability environments.", "The overall aim for this course is for students to better understand concepts/processes that affect fluid flow and solute transport processes in fractured geologic media.", "This includes the proper formulation of conceptual models, its proper translation to mathematical models and to obtain some knowledge on solution techniques to obtain quantitative solutions.", "Week No. 6: Analysis of single-hole hydraulic tests in fractured rocks and its implications (Feb. 12), Review (Feb. 14)", "Please do not submit a series of cell phone photos of your assignment.", "Must be uploaded to the appropriate Dropbox folder", "Must be submitted as a PDF file", "Must be uploaded as a single file", "Rules for working with others"]}, {"course_id": 38, "course_code": "EARTH 456", "course_name": "EARTH456 - Numerical Methods in Hydrogeology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Numerical Methods in Hydrogeology Winter 2025", "An introduction to the theory and practice of groundwater flow and contaminant transport modeling.", "Topics related to variably-saturated flow will focus on derivation of Richard's equation, a control volume finite difference discretization, assembly and solution of the flow equation, material balance error, truncation error analysis, stability and monotonicity.", "Explain the fundamental theory behind groundwater flow and contaminant transport modeling", "Apply numerical techniques, including control volume finite difference discretization, to solve groundwater flow and contaminant transport equations.", "Analyze numerical model accuracy, including material balance error, truncation error, stability, and monotonicity in variably-saturated flow and contaminant transport problems.", "Use a modeling software to model variably-saturated flow and contaminant transport.", "Interpret and visualize groundwater flow and contaminant transport model results and communicate findings effectively.", "Identify the concepts of groundwater and solute transport modeling and their real-world applications.", "Section 1.1 Derivation of Richards' Equation", "Section 1.2 Derivation of Richards 'Equation – Pressure Head Formulation", "Section 1.3 Three-Dimensional Groundwater Flow", "Derive and interpret three-dimensional groundwater flow dynamics and their mathematical representation.", "Section 1.4 Control Volume Finite Difference Discretization for Flow", "Section 1.5 A Rigorous Derivation of the Control Volume Finite Difference Discretization", "Develop, apply, and justify control volume finite difference discretization techniques for groundwater flow problems, demonstrating a rigorous understanding of mathematical principles.", "Assemble and implement saturated groundwater flow equations in numerical models using discretized formulations.", "Assemble the saturated groundwater flow equation using control volume discretization.", "Analyze groundwater flow material balance errors and their implications for numerical model accuracy.", "Section 1.8 Truncation Error Analysis", "Section 1.8 Truncation Error Analysis", "Section 1.9 Stability and Monotonicity", "Section 2.1 Derivation of the Contaminant Transport Equation", "Analyze the stability and monotonicity of numerical methods for groundwater flow models.", "Derive the contaminant transport equation and articulate its role in modeling solute movement through porous media.", "Section 2.1 Derivation of the Contaminant Transport Equation", "Section 2.2 Control Volume Finite Difference Discretization of the Contaminant Transport Equation", "Section 2.3 Central Spatial Weighting of Advective Flux", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Apply control volume finite difference discretization to the contaminant transport equation for numerical modeling.", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Section 2.4 Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.5 Upstream Spatial Weighting of Advective Flux", "Section 2.5.1 Truncation Error of Upstream Spatial Weighting", "Section 2.6 Crank-Nicolson Temporal Weighting with Upstream Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.7 Assembly of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.7.1 Monotonicity of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.8 Assembly of Fully-Implicit Temporal Weighting with Upstream Spatial Weighting", "Section 2.8.1 Monotonicity of Upstream Spatial Weighting with Fully-Implicit Temporal Weighting", "Section 2.9 Boundary Conditions for Transport Coupled to Flow", "Analyze the accuracy of various contaminant transport weighting schemes and their impact on numerical model performance.", "Apply boundary conditions for contaminant transport coupled with groundwater flow and assess material balance errors to ensure reliable numerical simulations.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "The total maximum bonus points that can be earned across all five assignments is five.", "Students can earn bonus points by actively participating in discussions or helping their peers understand the course material and assignments.", "Explaining a challenging concept to peers in a collaborative study session.", "A maximum of five contributions will be allowed per assignment."]}, {"course_id": 39, "course_code": "EARTH 459", "course_name": "EARTH459 - Chemical Hydrogeology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["10:00AM - 11:20AM PHY 150", "10:30AM - 11:20AM MC 4042", "View requirements for EARTH 459", "Overall learning objective: To provide an understanding of the basic principles of chemical hydrogeology as they relate to problem solving in various applications of geochemistry.", "Develop the skills to collect accurate and reliable physical, geochemical and microbiological measurements from groundwater flow systems", "Analyze geochemical and hydrogeological data to identify the processes that affect groundwater quality and cause groundwater contamination", "Develop management and remediation systems to protect groundwater quality and protect human and ecosystem health", "Part 1: Chemical principles and processes of water-rock interaction", "Introduction to chemical hydrogeology:", "Mineral-water interaction:", "Mineral-water interaction:", "Development of natural groundwater chemical sequences in flow systems:", "Redox reactions, redox sequences in groundwater flow systems", "Development of natural groundwater chemical sequences in flow systems:", "Introduction to chemical modelling:", "Case studies of groundwater contamination and remediation.", "Introduction to common scenarios of groundwater contamination and classes of contaminants considered in this course.", "Non-Aqueous Phase Liquids – dissolution and contamination patterns, vapour transport, implications for clean-up.", "Acid generating mine wastes and inorganic contaminants:", "Selected topics in chemical hydrogeology:", "Natural attenuation and in-situ remediation: Inorganic contaminants and radionuclides, approaches and case studies.", "Emerging contaminants in groundwater: Fate of pharmaceutical compounds and other emerging compounds in septic system and landfill plumes.", "Environmental Isotopes in Hydrogeology Authors: I.D. Clark and P. Fritz No 250", "This course includes the independent development and practice of specific skills, such as geochemical calculations.", "Library for research-based assignments"]}, {"course_id": 40, "course_code": "BIOL 462", "course_name": "BIOL462 - Applied Wetland Science (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM DC 1351", "Shayna Meinzinger                                           sbmeinzinger@uwaterloo.ca            Office hours: by email appointment", "Advanced concepts on wetland ecosystems in the context of regional and global earth systems processes such as carbon and nitrogen cycling and climate change, applications of wetland paleoecology, use of isotopes and other geochemical tools in wetland science, and wetland engineering in landscape rehabilitation and ecotechnology.", "Current issues in Canada and abroad will be examined.", "We may also use unscheduled tutorial time for make-up classes if needed.", "Identify a wetland’s class using the Canadian the wetland classification system and define and describe form and type", "Describe wetland ecological function, biogeochemical function, and role in and impact by anthropogenic climate change", "Describe the basic principles and challenges associated with wetland restoration and creation, and the design of treatment wetlands", "Create (as a group) a short scientific report and infographic summazing scientific understanding of a wetland, including appropriate references", "Introduction   Chapter 1,2", "Safety Meeting for Field Trips", "7. Biogeochemistry II:  Carbon and Climate Change", "7. Biogeochemistry II: Carbon and Climate Change", "11 Nov. 12 7. Biogeochemistry II: Carbon and Climate Change   Chapter 16", "Guest lecture: Emilie Montreuil Strub and Rachel McNamee: Microplastics in Lakes", "Textbook and Readings", "Supplementary textbook that covers biogeochemistry better than Mitsch and Gosselink.", "Graduate school level so do not be alarmed!", "Reference-managing software Very handy to manage references for your group project.", "Useful for field day to document findings.", "It is a closed-book test worth ~40 marks.", "Task 0: Pick your group based on field site and topic and sign up under Learn: Groups--> Group Project.", "Task 1: Do the assigned readings and literature search for your wetland and create a draft \"concept map\" showing the interaction of geology/geomorphology, soils, water and plants in your wetland.", "Use this data for completion of Tasks 2-4.", "We strongly encourage you to have a rough draft ready a week before and use the last week to copyedit and refine the writing of your group members.", "Some class time will be used to go over appropriate scientific research methods and writing techniques.", "Notice of Recording", "Extensions and Accommodations", "Extensions and other accommodations will only be considered on a case-by-case basis.", "You are taking full responsibility for AI-generated materials as if you had produced them yourself: ideas must be attributed and facts must be true.", "In reference list:", "URL of the platform where the conversation took place].", "That all said, AIs can be interesting and fun!", "You are welcome to check them out and use them as a study aid.", "(Note: If you want to use ChatGPT, you must make a free account and provide your email and phone number."]}, {"course_id": 41, "course_code": "EARTH 444", "course_name": "EARTH444 - Applied Wetland Science (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM DC 1351", "Shayna Meinzinger                                           sbmeinzinger@uwaterloo.ca            Office hours: by email appointment", "Advanced concepts on wetland ecosystems in the context of regional and global earth systems processes such as carbon and nitrogen cycling and climate change, applications of wetland paleoecology, use of isotopes and other geochemical tools in wetland science, and wetland engineering in landscape rehabilitation and ecotechnology.", "Current issues in Canada and abroad will be examined.", "We may also use unscheduled tutorial time for make-up classes if needed.", "Identify a wetland’s class using the Canadian the wetland classification system and define and describe form and type", "Describe wetland ecological function, biogeochemical function, and role in and impact by anthropogenic climate change", "Describe the basic principles and challenges associated with wetland restoration and creation, and the design of treatment wetlands", "Create (as a group) a short scientific report and infographic summazing scientific understanding of a wetland, including appropriate references", "Introduction   Chapter 1,2", "Safety Meeting for Field Trips", "7. Biogeochemistry II:  Carbon and Climate Change", "7. Biogeochemistry II: Carbon and Climate Change", "11 Nov. 12 7. Biogeochemistry II: Carbon and Climate Change   Chapter 16", "Guest lecture: Emilie Montreuil Strub and Rachel McNamee: Microplastics in Lakes", "Textbook and Readings", "Supplementary textbook that covers biogeochemistry better than Mitsch and Gosselink.", "Graduate school level so do not be alarmed!", "Reference-managing software Very handy to manage references for your group project.", "Useful for field day to document findings.", "It is a closed-book test worth ~40 marks.", "Task 0: Pick your group based on field site and topic and sign up under Learn: Groups--> Group Project.", "Task 1: Do the assigned readings and literature search for your wetland and create a draft \"concept map\" showing the interaction of geology/geomorphology, soils, water and plants in your wetland.", "Use this data for completion of Tasks 2-4.", "We strongly encourage you to have a rough draft ready a week before and use the last week to copyedit and refine the writing of your group members.", "Some class time will be used to go over appropriate scientific research methods and writing techniques.", "Notice of Recording", "Extensions and Accommodations", "Extensions and other accommodations will only be considered on a case-by-case basis.", "You are taking full responsibility for AI-generated materials as if you had produced them yourself: ideas must be attributed and facts must be true.", "In reference list:", "URL of the platform where the conversation took place].", "That all said, AIs can be interesting and fun!", "You are welcome to check them out and use them as a study aid.", "(Note: If you want to use ChatGPT, you must make a free account and provide your email and phone number."]}, {"course_id": 43, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 44, "course_code": "GEOG 453", "course_name": "GEOG453 - Urban Stormwater Management (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["08:30AM - 09:50AM UTD 105", "This course reviews the physical and chemical processes, environmental assessment techniques and best management practices related to stormwater management in the urban systems.", "Stormwater management is an evolving field of study that includes aspects of environmental design, engineering, chemistry, hydrology, planning, finance, and public administration.", "This course reviews the principles of urban stormwater management to provide a practical understanding of the development and implementation of effective management plans to mitigate environmental impacts of stormwater in urban environments.", "Current design principles and their implementation in modern planning practices for stormwater management in urban watersheds are reviewed.", "2) consider the economic and environmental impacts of urban drainage and", "3) review current design principles and their implementation in modern planning practices for stormwater management in urban watersheds.", "Introduction to Urban Stormwater:", "Applied Environmental Science and                                            Engineering for a Sustainable Future.", "Streams in the urban landscape.", "Sept 16               Ecological and Biochemical Impacts of Urbanization on Watersheds", "Sept 25                Stormwater Design I - Drainage Systems and runoff analysis", "Sept 30                Stormwater Design II – Major system component design", "Oct 2                    Stormwater Design III - Minor system component design", "Oct 9                   Implications of Climate Change for Stormwater Management Planning and Design", "Oct 21                Environmental Indicators and Stormwater Monitoring Programs: Winter Road Maintenance and Road Salt                                      Management", "Efficacy of urban road salt reduction                                          strategies on public supply well quality.", "Oct 28                Choosing Best Management Practices - Details of Stormwater Master Planning and Site Design / Low Impact                                  Development McPhillips, L.E. and Matsler, A.M., 2018.", "Frontiers in built environment, 4, p.26.", "Nov 18                Erosion and Sediment Control", "Front-loading urban stormwater management for success: A                                  perspective incorporating current studies on the implementation of retrofit low-impact development.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 45, "course_code": "PLAN 453", "course_name": "PLAN453 - Urban Stormwater Management (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["08:30AM - 09:50AM UTD 105", "This course reviews the physical and chemical processes, environmental assessment techniques and best management practices related to stormwater management in the urban systems.", "Stormwater management is an evolving field of study that includes aspects of environmental design, engineering, chemistry, hydrology, planning, finance, and public administration.", "This course reviews the principles of urban stormwater management to provide a practical understanding of the development and implementation of effective management plans to mitigate environmental impacts of stormwater in urban environments.", "Current design principles and their implementation in modern planning practices for stormwater management in urban watersheds are reviewed.", "2) consider the economic and environmental impacts of urban drainage", "3) review current design principles and their implementation in modern planning practices for stormwater management in urban watershed", "Introduction to Urban Stormwater:", "Applied Environmental Science and                                            Engineering for a Sustainable Future.", "Streams in the urban landscape.", "Sept 16               Ecological and Biochemical Impacts of Urbanization on Watersheds", "Sept 25                Stormwater Design I - Drainage Systems and runoff analysis", "Sept 30                Stormwater Design II – Major system component design", "Oct 2                    Stormwater Design III - Minor system component design", "Oct 9                   Implications of Climate Change for Stormwater Management Planning and Design", "Oct 21                Environmental Indicators and Stormwater Monitoring Programs: Winter Road Maintenance and Road Salt                                       Management", "Efficacy of urban road salt reduction strategies on public supply well quality.", "Oct 28                Choosing Best Management Practices - Details of Stormwater Master Planning and Subdivision/Site Planning, Site Design / Low Impact Development McPhillips, L.E. and Matsler, A.M., 2018.", "Frontiers in built environment, 4, p.26.", "Nov 18                Erosion and Sediment Control", "Front-loading urban stormwater management for success: A perspective incorporating current studies on the implementation of retrofit low-impact development.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 0, "course_code": "ENVS 200", "course_name": "ENVS200 - Field Ecology (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["Field Ecology Winter 2025", "**We aim to respond to forum posts and necessary emails within general workday hours (8:30 AM – 4:30 PM) and within 24hrs, except over weekends and holidays.", "Introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "View requirements for ENVS 200", "Such knowledge, called ecoliteracy, will provide a critical basis for your engagement in the 21st century, the “century of the environment”—not least because so many of the environmental issues we face derive in part from a limited understanding of how we are embedded within and dependent upon ecological systems.", "Field ecology necessarily harbours an ethical component both because of our natural affinity for life (or ‘biophilia’) and because questions of ecological ‘impact’ and 'quality’ are necessarily value-laden.", "In summary, this course introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "By the end of this course, you should be on a path to life-long learning as an ecologically-literate citizen.", "Demonstrate how these principles apply to real-world situations (in context of lab activities, assignments, and labs), including human interactions with the natural world.", "Articulate the elements of scientific inquiry as they apply to ecology/", "These course learning outcomes will not only prepare you to be an informed citizen and member of the community of life on earth, but also provide the basis for knowledge, humility, and wisdom in your dealings with ecological problems in your daily life and eventual career.", "Week Number", "Introduction and indicator species: Bird identification Lab 1:  Survey completed and submitted in lab (2%)", "3. Jan 21 *Conditions and Resources; Climate and Biomes", "You should review the course “reading guide” in LEARN before reading because you are not responsible for all textbook sections and vocabulary.", "demonstrate how these principles apply to real-world situations, including human interactions with the natural world Readings, Labs, Discussion board Weekly lecture quizzes and activities, exams, lab activities, discussion forums", "These experiences are intended to help you apply ecological concepts in real-world contexts while building valuable field skills.", "Simply missing a deadline and later mentioning registration with Accessibility Services will not be considered sufficient.", "Appeals and grievance", "Availability for exams", "These slides are meant to be a template for your note-taking: they will not replace careful attention, note-taking and participation.", "Along with the University of Waterloo and the Faculty of Environment and its Departments, I consider your well-being to be extremely important.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "However, there may be instances during lectures where AI usage is allowed after receiving clear verbal permission from the professor.", "Students are responsible for following these guidelines and seeking clarification when needed.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 1, "course_code": "GEOG 205", "course_name": "GEOG205 - Principles of Geomorphology (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["08:30AM - 09:50AM EV3 1408", "In-person - EV1 235", "Topics include the role of time and scale in geomorphic processes, as well as the role of water, hill-slope processes, soils, wind, and glaciation and ice in polar and alpine environs.", "This class introduces students to principles involved in the origin and evolution of landforms and the physical processes responsible for their creation and modification.", "Principles of geomorphology are critical to those who have careers in various fields within geography, geology, and earth and environmental sciences.", "Identify and interpret landforms from maps, photographs, and surface models", "Evaluate how the basic principles of energy transfer, driving forces, and event magnitude combine to shape landscapes ranging from mountains to coasts", "Gain experience collecting and synthesizing data, interpreting geomorphic processes, and evaluating landscape evolution", "Bolded labs = mandetory in-person activities", "Geomorphic Concepts, Tools and Methods in Geomorpholog Lab 1 Intro --", "Coastal and Submarine Processes and Landforms Lab 4 Aeolian", "Available for free online via UW Library No", "Please communicate with the instructional team if you have a documented, legitimate reason for submitting late work – if you communicate clearly and in a timely manner, we will work with making the deadline manageable for your specific sitution", "I expect you:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 2, "course_code": "GEOG 209", "course_name": "GEOG209 - Hydroclimatology (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["08:30AM - 10:20AM EV2 2002", "Dr. Richard Petrone                                                                                       Winter 2025", "Lab Co-ordinator:", "TBA", "An introduction to the fundamental processes governing climate and hydrological systems and the links between them.", "It starts with a discussion of basic atmospheric and hydrological processes and traces the flow of energy and water between the earth's surface and the atmosphere.", "This course provides students with a thorough background of the fundamental processes governing the climate and hydrological systems, and the links between them.", "The course first reviews fundamental atmospheric and hydrologic processes, and traces the flow of energy and water between the Earth’s surface and the atmosphere.", "Through the use of group activities students will be given the opportunity to gain experience manipulating real hydrological and meteorological data and instrumentation.", "This course will serve as an introduction to near-surface hydroclimatic processes, their feedbacks and climate change, forming essential background for upper level courses in climate change, hydroclimatology and environmental sciences and studies in general.", "The fundamental knowledge and skills developed in this course will provide students with the basis to appreciate and understand the natural hydrologic and climate systems.", "It also provides the required foundation for advanced courses in climatology and hydrology.", "The objective of this course is to provide students with the background to further their interests in weather and climate, and provide the theoretical foundations for upper level science and management courses.", "To identify the key boundary layer processes that drive the hydroclimate system.", "To identify and evaluate the characteristics of different land-use types and ecosystems that drive their hydroclimatic regimes.", "Introduction to Hydroclimatology", "Evapotranspiration", "Climates of Natural Surfaces and Vegetation Effects", "Floods and Drought", "Ecology – Hydroclimate Linkages – Water and Carbon Exchange", "Landuse Change and Hydroclimatic Effects", "SVAT modelling", "Tutorial rooms and groups will be determined in the first week of lectures.", "Feb. 3              Lab #2 – Streamflow & Climate assignment introduced & Lab #1 handed in", "March 10         Lab #3 – Energy Balance & Evapotranspiration assignment introduced and Lab #2 handed in", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 3, "course_code": "GEOG 306", "course_name": "GEOG306 - Human Dimensions of Natural Hazards (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["Human Dimensions of Natural Hazards - GEOG 306 Winter 2025", "08:30AM - 09:50AM B1 271", "E. Mohammadi", "E-mail:            elham.mohammadi@uwaterloo.ca", "The physical nature of a wide range of geophysical and biophysical hazards will be explored, paying particular attention to the ways in which hazards become dangerous to humans, and the pathways by which humans can either increase or decrease their vulnerability in the face of natural hazards.", "Natural hazards and associated disasters are, in part, a product of inappropriate human modifications or management of the natural landscape.", "Throughout the course, case studies and examples drawn from countries and regions around the world will be used to clarify conceptual and methodological issues.", "Appreciate the physical processes associated with various natural hazards, with a focus on geophysical, meteorological, and hydrological hazards.", "Appreciate the key components of preparing for disasters.", "Apply knowledge to compare hazards theory with real-world case studies.", "Theme 1: Introduction", "Introduction to Course, Natural Hazards, and Disasters", "Defining and Measuring Disasters", "Theme 3: Prevention and Mitigation of Disasters", "Theme 3: Prevention and Mitigation of Disasters", "Theme 3: Prevention and Mitigation of Disasters", "Disasters in the Media and Risk Perception", "Disasters in the Media and Risk Perception Cont'd + Hazard focus: Wildfires", "Key Considerations in BBB", "Livelihoods & Psychological Recovery", "Comparative Analysis of Responses to Specific Disasters 20%", "Please note that these activities are designed to reinforce key concepts and promote collaboration.", "Description: Engage with the concept of vulnerability by crafting a compelling narrative that could be used in a media piece (e.g., news).", "Select and compare two disaster response efforts for similar events across different regions.", "The exam will take the form of multiple choice and short/medium-length written answer questions.", "Short-Term Absence Declarations", "This essentially removes the need for a short-term absence declaration, since a longer, three-day grace period has already been applied.", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 4, "course_code": "GEOG 316", "course_name": "GEOG316 - Multivariate Statistics (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["08:30AM - 09:50AM EV3 3412", "This course provides students with a foundation in the fundamentals of multivariate analysis, and practical experience of applying those techniques to problems in the geographical and environmental sciences.", "Identify the most appropriate multivariate statistical techniques to use for data analysis in their academic discipline.", "Discriminate between the most common multivariate statistical techniques used in the environmental sciences.", "Apply these techniques to real data using the R statistical language.", "Interpret the output from R and communicate the results of these techniques.", "& Intro to multivariate analysis", "A1:", "A2:", "Lecture 9: K-means", "A4:", "Lecture 11: Introduction to Deep Learning", "An Introduction to Applied Multivariate Analysis with R Everitt, B., & Hothorn, T., 2011.", "Multivariate Statistics for the Environmental Sciences, Wiley, ISBN: 978-0-340-80763-7, 248p.", "Multivariate Statistics for Wildlife and Ecology Research.", "Applied Multivariate Research: Design and Interpretation.", "Multivariate Statistics for Environmental Sciences.", "Applied Multivariate Statistical Analysis for Geographers.", "You will apply the statistical analysis techniques learned in class to those data, and then interpret the results in the answer document.", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 5, "course_code": "GEOG 318", "course_name": "GEOG318 - Spatial Analysis (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["Notice of Recording", "Spatial Analysis Winter 2025", "Email:                     dtrobins@uwaterloo.ca", "Email:                      lqzhao@uwaterloo.ca", "Advanced quantitative analysis in a spatial context.", "Today, spatial analysis is mainly based on statistical techniques and geoprocessing using geographic information systems (GIS).", "The spatial character of data implies several methodological challenges in spatial data analysis especially related to the spatial dependence of the data, which often invalidates non-spatial modeling and evaluation approaches and leads to special techniques for spatial sampling and spatial regression modeling.", "In addition, selected topics such as spatial data mining and spatial analysis software may be addressed, depending upon the progress of the course.", "Several real-world applications of spatial analysis techniques will be discussed and provide context for course assignments.", "develop a general understanding of a variety of spatial modelling techniques", "interpret and critically discuss spatial models and their results", "The lecture will be used to introduce the theory and concepts behind spatial analysis methods as well as to demonstrate techniques that will aid the completion of lab assignments.", "1  Jan 8 Introduction to Spatial Analysis 1, 2", "Feb 12 Describing and Analyzing Fields 9", "7  Feb 26 Describing and Analyzing Fields  9, 10", "10  Mar 19 Landscape Metrics and Applications of Spatial Analysis", "Spatial Data Analysis: an Introduction for GIS Users.", "Principles of Geographical Information Systems.", "Assignments commence in the second week of the course but the first week will require students to setup a workflow for using Jupyter Notebooks on the Math Faculty Jupyter Hub, which can be found here: https://jupyter.math.uwaterloo.ca/hub/login", "There are no serious programming requirements or extensive prior knowledge of geographic information systems to complete the assignments in this course.", "The notebooks will guide you through the technical steps and students will adjust notebook content/code to improve their understanding about the statistical and spatial analysis concepts discussed in the course.", "Notice of Recording", "Community of Learners", "A goal for this course is that we shall all contribute to a climate that promotes a Community of Learners.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "This course includes the independent development and practice of specific skills, such as analyzing spatial data, summarizing data for reporting results, or putting together statistical models.", "Library for research-based assignments", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 6, "course_code": "GEOG 368", "course_name": "GEOG368 - Ecology and Conservation for Planning (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["Ecology and Conservation for Planning Winter 2025", "02:30PM - 05:20PM", "This course provides students with a critical understanding of the relationship between human development and natural environments.", "Students will develop an understanding of core ecological principles and how these can be taken up in plans and policies to promote nature conservation in urban and rural environments.", "The course will include examples of how planners mitigate the environmental impacts of development of land, allotment of open space and parks, and conservation of sensitive areas and species in both urban and rural contexts.", "understand biophysical and ecological processes in urban areas", "plan for biophysical and ecological process when developing and managing the built environment", "Overview of syllabus and foundational concepts", "Get into groups and choose case study for weekly activities and final project", "Spatial patterns and mosaics", "Urban water systems and water bodies", "Urban habitat and vegetation", "Urban features", "Readings", "The ecological and evolutionary consequences of systemic racism in urban environments.", "ECOLOGICAL URBANISM: A FRAMEWORK FOR THE DESIGN OF RESILIENT CITIES Yes 0", "Each quiz corresponds to the theme for each week.", "The first will critically engage with a recent and important contribution from Schell et al.", "Each Reflection Paper should be approximately 500 to 1,000 words and should answer the following questions:", "The case study should describe each of the focal ecological components of the city and develop a plan to improve or enhance the sustainability of these components.", "These will vary week to week, but are designed to prepare students to complete their case study assignment.", "The complete style outline can be found in the Publication Manual of the American Psychological Association, located in the reference section in Dana Porter Library, or on sale in the Book Store.", "APA Frequently Asked Questions - http://www.apastyle.org/learn/faqs/", "University of Wisconsin-Madison Writing Centre: http://www.writing.wisc.edu", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 7, "course_code": "GEOG 453", "course_name": "GEOG453 - Urban Stormwater Management (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["08:30AM - 09:50AM UTD 105", "This course reviews the physical and chemical processes, environmental assessment techniques and best management practices related to stormwater management in the urban systems.", "Stormwater management is an evolving field of study that includes aspects of environmental design, engineering, chemistry, hydrology, planning, finance, and public administration.", "This course reviews the principles of urban stormwater management to provide a practical understanding of the development and implementation of effective management plans to mitigate environmental impacts of stormwater in urban environments.", "Current design principles and their implementation in modern planning practices for stormwater management in urban watersheds are reviewed.", "2) consider the economic and environmental impacts of urban drainage and", "3) review current design principles and their implementation in modern planning practices for stormwater management in urban watersheds.", "Introduction to Urban Stormwater:", "Applied Environmental Science and                                            Engineering for a Sustainable Future.", "Streams in the urban landscape.", "Sept 16               Ecological and Biochemical Impacts of Urbanization on Watersheds", "Sept 25                Stormwater Design I - Drainage Systems and runoff analysis", "Sept 30                Stormwater Design II – Major system component design", "Oct 2                    Stormwater Design III - Minor system component design", "Oct 9                   Implications of Climate Change for Stormwater Management Planning and Design", "Oct 21                Environmental Indicators and Stormwater Monitoring Programs: Winter Road Maintenance and Road Salt                                      Management", "Efficacy of urban road salt reduction                                          strategies on public supply well quality.", "Oct 28                Choosing Best Management Practices - Details of Stormwater Master Planning and Site Design / Low Impact                                  Development McPhillips, L.E. and Matsler, A.M., 2018.", "Frontiers in built environment, 4, p.26.", "Nov 18                Erosion and Sediment Control", "Front-loading urban stormwater management for success: A                                  perspective incorporating current studies on the implementation of retrofit low-impact development.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 8, "course_code": "PLAN 341", "course_name": "PLAN341 - Ecology and Conservation for Planning (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["Ecology and Conservation for Planning Winter 2025", "02:30PM - 05:20PM", "This course provides students with a critical understanding of the relationship between human development and natural environments.", "Students will develop an understanding of core ecological principles and how these can be taken up in plans and policies to promote nature conservation in urban and rural environments.", "The course will include examples of how planners mitigate the environmental impacts of development of land, allotment of open space and parks, and conservation of sensitive areas and species in both urban and rural contexts.", "understand biophysical and ecological processes in urban areas", "plan for biophysical and ecological process when developing and managing the built environment", "Overview of syllabus and foundational concepts", "Get into groups and choose case study for weekly activities and final project", "Spatial patterns and mosaics", "Urban water systems and water bodies", "Urban habitat and vegetation", "Urban features", "Readings", "The ecological and evolutionary consequences of systemic racism in urban environments.", "ECOLOGICAL URBANISM: A FRAMEWORK FOR THE DESIGN OF RESILIENT CITIES Yes 0", "Each quiz corresponds to the theme for each week.", "The first will critically engage with a recent and important contribution from Schell et al.", "Each Reflection Paper should be approximately 500 to 1,000 words and should answer the following questions:", "The case study should describe each of the focal ecological components of the city and develop a plan to improve or enhance the sustainability of these components.", "These will vary week to week, but are designed to prepare students to complete their case study assignment.", "The complete style outline can be found in the Publication Manual of the American Psychological Association, located in the reference section in Dana Porter Library, or on sale in the Book Store.", "APA Frequently Asked Questions - http://www.apastyle.org/learn/faqs/", "University of Wisconsin-Madison Writing Centre: http://www.writing.wisc.edu", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 9, "course_code": "PLAN 351", "course_name": "PLAN351 - Multivariate Statistics (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["08:30AM - 09:50AM EV3 3412", "This course provides students with a foundation in the fundamentals of multivariate analysis, and practical experience of applying those techniques to problems in the geographical and environmental sciences.", "Identify the most appropriate multivariate statistical techniques to use for data analysis in their academic discipline.", "Discriminate between the most common multivariate statistical techniques used in the environmental sciences.", "Apply these techniques to real data using the R statistical language.", "Interpret the output from R and communicate the results of these techniques.", "& Intro to multivariate analysis", "A1:", "A2:", "Lecture 9: K-means", "A4:", "Lecture 11: Introduction to Deep Learning", "An Introduction to Applied Multivariate Analysis with R Everitt, B., & Hothorn, T., 2011.", "Multivariate Statistics for the Environmental Sciences, Wiley, ISBN: 978-0-340-80763-7, 248p.", "Multivariate Statistics for Wildlife and Ecology Research.", "Applied Multivariate Research: Design and Interpretation.", "Multivariate Statistics for Environmental Sciences.", "Applied Multivariate Statistical Analysis for Geographers.", "You will apply the statistical analysis techniques learned in class to those data, and then interpret the results in the answer document.", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 10, "course_code": "PLAN 353", "course_name": "PLAN353 - Spatial Analysis (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["Notice of Recording", "Spatial Analysis Winter 2025", "Email:                     dtrobins@uwaterloo.ca", "Email:                      lqzhao@uwaterloo.ca", "Advanced quantitative analysis in a spatial context.", "Today, spatial analysis is mainly based on statistical techniques and geoprocessing using geographic information systems (GIS).", "The spatial character of data implies several methodological challenges in spatial data analysis especially related to the spatial dependence of the data, which often invalidates non-spatial modeling and evaluation approaches and leads to special techniques for spatial sampling and spatial regression modeling.", "In addition, selected topics such as spatial data mining and spatial analysis software may be addressed, depending upon the progress of the course.", "Several real-world applications of spatial analysis techniques will be discussed and provide context for course assignments.", "develop a general understanding of a variety of spatial modelling techniques", "interpret and critically discuss spatial models and their results", "The lecture will be used to introduce the theory and concepts behind spatial analysis methods as well as to demonstrate techniques that will aid the completion of lab assignments.", "1  Jan 8 Introduction to Spatial Analysis 1, 2", "Feb 12 Describing and Analyzing Fields 9", "7  Feb 26 Describing and Analyzing Fields  9, 10", "10  Mar 19 Landscape Metrics and Applications of Spatial Analysis", "Spatial Data Analysis: an Introduction for GIS Users.", "Principles of Geographical Information Systems.", "Assignments commence in the second week of the course but the first week will require students to setup a workflow for using Jupyter Notebooks on the Math Faculty Jupyter Hub, which can be found here: https://jupyter.math.uwaterloo.ca/hub/login", "There are no serious programming requirements or extensive prior knowledge of geographic information systems to complete the assignments in this course.", "The notebooks will guide you through the technical steps and students will adjust notebook content/code to improve their understanding about the statistical and spatial analysis concepts discussed in the course.", "Notice of Recording", "Community of Learners", "A goal for this course is that we shall all contribute to a climate that promotes a Community of Learners.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "This course includes the independent development and practice of specific skills, such as analyzing spatial data, summarizing data for reporting results, or putting together statistical models.", "Library for research-based assignments", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 11, "course_code": "PLAN 453", "course_name": "PLAN453 - Urban Stormwater Management (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["08:30AM - 09:50AM UTD 105", "This course reviews the physical and chemical processes, environmental assessment techniques and best management practices related to stormwater management in the urban systems.", "Stormwater management is an evolving field of study that includes aspects of environmental design, engineering, chemistry, hydrology, planning, finance, and public administration.", "This course reviews the principles of urban stormwater management to provide a practical understanding of the development and implementation of effective management plans to mitigate environmental impacts of stormwater in urban environments.", "Current design principles and their implementation in modern planning practices for stormwater management in urban watersheds are reviewed.", "2) consider the economic and environmental impacts of urban drainage", "3) review current design principles and their implementation in modern planning practices for stormwater management in urban watershed", "Introduction to Urban Stormwater:", "Applied Environmental Science and                                            Engineering for a Sustainable Future.", "Streams in the urban landscape.", "Sept 16               Ecological and Biochemical Impacts of Urbanization on Watersheds", "Sept 25                Stormwater Design I - Drainage Systems and runoff analysis", "Sept 30                Stormwater Design II – Major system component design", "Oct 2                    Stormwater Design III - Minor system component design", "Oct 9                   Implications of Climate Change for Stormwater Management Planning and Design", "Oct 21                Environmental Indicators and Stormwater Monitoring Programs: Winter Road Maintenance and Road Salt                                       Management", "Efficacy of urban road salt reduction strategies on public supply well quality.", "Oct 28                Choosing Best Management Practices - Details of Stormwater Master Planning and Subdivision/Site Planning, Site Design / Low Impact Development McPhillips, L.E. and Matsler, A.M., 2018.", "Frontiers in built environment, 4, p.26.", "Nov 18                Erosion and Sediment Control", "Front-loading urban stormwater management for success: A perspective incorporating current studies on the implementation of retrofit low-impact development.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 12, "course_code": "ERS 484", "course_name": "ERS484 - Soil Ecosystem Dynamics (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["Soil Ecosystem Dynamics Fall 2024", "08:30AM - 11:20AM EV1 350", "Office Hours Appointment/walk-in", "This course examines the role of soil in the environment, its importance as a natural resource in agricultural and forest productivity, and the effects on soil resources as a result of different management practices.", "It is divided into three sections: 1) introduction to soil composition, formation, and physical, chemical and biological characteristics of soil; 2) soil degradation and management approaches to rehabilitation; 3) soil pollution and the role of soil in maintaining environmental integrity.", "View requirements for ERS 484", "Fundamental Concepts of Soil Science", "Identify different methods of soil sampling, processing, and analyses", "Apply the fundamental concepts of soil science", "Describe different systems of soil classification", "Degraded Soils & Management", "Recognize sustainable soil management practices and provide examples using case studies", "Soil Pollution & Environmental Integrity", "Show how soil and soil pollution can influence atmospheric and hydrologic processes", "- Introduction", "composition & importance", "- Soil sampling methods", "- Soil physical properties", "- Soil chemical properties", "- Soil water", "- Soil biology and soil organic matter", "- Soil formation &", "classification", "Module 2: Degraded Soils & Management", "- Soil tillage systems", "- Soil salinity", "- Soil sodicity", "- Soil erosion & erosion", "control measures", "Soil Pollution & Environmental Integrity", "- Soil pollution", "- Environmental integrity", "Required (available in bookstore & on Course Reserve in Dana Porter)", "Teaching & Learning Methods", "Fundamental Concepts of Soil Science", "Degraded Soils & Management", "Soil Pollution & Environmental Integrity", "PowerPoint slides", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 14, "course_code": "GEOG 303", "course_name": "GEOG303 - Physical Hydrology (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["08:30AM - 10:20AM EV1 350", "merrin.macrae@uwaterloo.ca", "Precipitation, interception, infiltration, groundwater and soil water processes, evapotranspiration, runoff, and storage will be examined from a theoretical and practical viewpoint, and their linkages demonstrated by lab and fieldwork.", "How much water do ecosystems use?", "What environmental features control the flows and stores of water, and how do we measure and assess it?", "An underlying theme will be to examine how environmental setting and environmental change affects ecosystem hydrology.", "We will explore both theoretical and practical aspects of the hydrological cycle.", "Describe the key controls on each major component of the hydrological cycle", "2. Relate the sensitivity of these components to different environmental settings and environmental changes", "3. Be familiar with field methods to collect and collate raw data", "4. Calculate specific hydrological fluxes and water stores for a given field site", "5. Evaluate the reliability of these (imperfect) data and calculations", "Introduction to Course/Overview of Hydrologic Cycle 1.1-1.3 No lab this week", "4.1-4.2", "4.9", "2.1-2.5", "24-Oct", "Atmospheric Processes: Energy Balance and Evapotranspiration 2.6-2.7 Quiz 2", "These should encourage you to keep up with the readings and participate in the lectures.", "Students are not expected to be proficient in more advanced software packages, but may find them helpful in completing the labs.", "This course includes the independent development and practice of specific skills, such as working through calculations and understanding the significance of different assumptions and data sources.", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 15, "course_code": "GEOG 304", "course_name": "GEOG304 - Carbon in the Biosphere (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["Carbon in the Biosphere Spring 2022", "08:30AM - 04:20PM", "This course investigates stocks and fluxes of carbon in forests, wetlands, and lakes through directed readings and field investigations.", "This field-based course will focus on measurement methods, data collection and interpretation, and study design.", "Use a variety of field and laboratory techniques to measure stocks and fluxes of carbon in the biosphere", "Understand and explain the challenges associated with data collection, analysis and interpretation and be able to evaluate the accuracy and precision of a range of field techniques", "Apply what they have learned to develop their own research question related to biosphere carbon exchange, design a study, present a proposal, provide feedback on proposals of their peers, collect appropriate data and prepare a consulting type report of the results", "Safety and lab orientation", "Study site tour", "UWaterloo Environmental Reserve/campus", "Soil organic matter and understory CO2 exchange", "Environmental Reserve", "Wednesday, June 22 Proposal presentations and preliminary data collection Proposal presentation TREE Lab", "Environmental Reserve", "Thursday, June 23 Data collection   Environmental Reserve", "Friday, June 24 Data collection Field notebook Environmental Reserve", "Field notebook Yes", "Pre-field trip reading seminar 15%", "Field notebook 10%", "Your involvement in these discussions will be reflected in your participation grade.", "The goals of group work in this class to build a sense of community, engage in peer education by learning from the diverse skill-sets of your peers, learn to collaborate in research by identifying strengths of the groups’ members and capitalize on these to accomplish a task and learning to resolve conflicts.", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations."]}, {"course_id": 16, "course_code": "GEOG 305", "course_name": "GEOG305 - Fluvial Geomorphology (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["RCH 211", "Emphasis on concepts related to fluvial processes, river mechanics, the relationship between environmental change and river regime.", "Fluvial geomorphology is the scientific study of river landforms and the processes that create them.", "A working knowledge of fluvial processes has important practical environmental science, watershed management and engineering applications and is relevant to many other fields of environmental enquiry such as environmental engineering, watershed planning, source water protection, forestry, and risk management.", "This course will examine a range of physical and chemical processes that create micro and macro-scale landforms over a range of spatial and temporal scales.", "Implications of these processes for environmental management in the context of environmental change will be considered.", "To understand basic fluvial geomorphic processes and their role in landform development and change", "Why study rivers?", "Sept 16              Landscapes and Rivers", "Inputs, outputs and storage", "Types of systems", "Fluvial system variables", "Spatial and temporal scales", "Concept of equilibrium", "Feedback, thresholds and equilibrium – Southern Rockies case study", "Flow generation and hydrological pathways", "Storm hydrograph and drainage basin response", "Discharge Measurement and Streamflow Analysis", "Floods", "Bankfull discharge", "Flood magnitude and frequency", "Regional flood frequency curves", "Rills and gullying", "Soil erosion models", "Modes of sediment transport in rivers", "Sediment storage and delivery ratio", "Flow in river channels", "Driving and resisting forces", "Channel parameters", "Concept of flow continuity", "Flow, channel and boundary resistance", "Subcritical, critical and supercritical flow", "Boundary layer", "Concept of stream power", "Work, energy and stream power", "Erosion in bedrock channels", "Erosion in alluvial channels", "Sediment supply and transport rates", "Driving variables", "Boundary conditions", "Nature of change", "System response", "https://uwaterloo.kanopy.com/video/return-river-0", "Dec 2                  Impact of climate change on river systems", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 17, "course_code": "GEOG 309", "course_name": "GEOG309 - Physical Climatology (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["Office Hours and email communications: TBA (each TA will be responsible for particular assignment)", "Topics include radiation and energy balances, general circulation patterns, synoptic development and micro-climatology.", "Climate change and climate variability", "Fundamentals of global warming", "The concepts of feedbacks", "Climate change and human dimensions", "How to explain the issues of climate change and variability ideas to others with confidence and persuasion", "Climate Change and Variability", "Human Dimension", "Weather Systems and Synoptic Development (Part 1) 273-295 299-325 262-285 287-313 Ch. 9,10", "Weather Systems and Synoptic Development (Part 2)", "Any earlier edition is good but the page numbers in the outline will not be correct for other editions than the fifth and seventh.", "Understand physical processes of climate and weather Lectures and Text readings", "Analysis of Weather events during the course", "Analysis of Sequence of Weather Maps", "(Working as groups of 6-8 and explain the sequence and processes of weather in Southern Ontario)", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "This course includes the independent development and practice of specific skills, such as Assess public debate on Climate Change and Variability.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 18, "course_code": "GEOG 320", "course_name": "GEOG320 - The Cryosphere (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["04:30PM - 05:20PM", "EV2 1002A", "This course provides a comprehensive overview of the cryosphere and cryosphere-atmosphere interactions.", "Topics covered include the material and thermodynamic properties of snow and ice, the role of the cryosphere in weather and climate, and the response of the cryosphere to climate change (past, present, and future).", "Describe the fundamental material properties of snow and ice, including crystal structures, phase transitions, and thermodynamic behavior, and relate these properties to cryospheric processes.", "Explain the role of the various elements of the cryosphere in weather and climate.", "Explain the response of the various elements of the cryosphere to changing weather and climate.", "Explain the impacts of climate change on the cryosphere, both in terms of observed trends and projected future changes, considering the implications for sea level rise, freshwater resources, and polar ecosystems.", "Identify historical and state-of-the-art datasets, including field observations and remote sensing data, needed to document the current state of the cryosphere.", "Identify field instruments for measuring cryospheric parameters, such as snow depth, ice thickness, and permafrost temperature.", "Conduct basic simulations with cryosphere process models, such as snow and lake ice models.", "Synthesize complex cryospheric data and model outputs to assess the broader implications for climate science, global carbon cycling, and human societies.", "Communicate research findings and insights related to the cryosphere effectively through written reports and oral presentations.", "Introduction to the Cryosphere", "Material Properties of Snow and Ice", "Analysis and interpretation of field-based measurements", "Snow and Ice Thermodynamics", "Analysis and interpretation of field-based measurements", "Glaciers and Ice Sheets", "Deadlines for each deliverable can be found in the course schedule above.", "The term paper involves the completion of an extensive survey of the scientific literature on a relevant topic (e.g. remote sensing, numerical modeling or in-situ studies of any element of the cryosphere; cryosphere-climate interactions on a variety of space and time scales; the representation of elements of the cryosphere in climate or weather prediction models; the impact of changes in any element or a group of elements of the cryosphere on Society).", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 19, "course_code": "GEOG 404", "course_name": "GEOG404 - Soil Ecosystem Dynamics (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["Soil Ecosystem Dynamics Fall 2024", "08:30AM - 11:20AM EV1 350", "Office Hours Appointment/walk-in", "This course examines the role of soil in the environment, its importance as a natural resource in agricultural and forest productivity, and the effects on soil resources as a result of different management practices.", "It is divided into three sections: 1) introduction to soil composition, formation, and physical, chemical and biological characteristics of soil; 2) soil degradation and management approaches to rehabilitation; 3) soil pollution and the role of soil in maintaining environmental integrity.", "- Introduction", "composition & importance", "- Soil sampling methods", "- Soil physical properties", "- Soil chemical properties", "- Soil water", "- Soil biology and soil organic matter", "- Soil formation &", "classification", "Module 2: Degraded Soils & Management", "- Soil tillage systems", "- Soil salinity", "- Soil sodicity", "- Soil erosion & erosion", "control measures", "Soil Pollution & Environmental Integrity", "- Soil pollution", "- Environmental integrity", "Required (available in bookstore & on Course Reserve in Dana Porter)", "Teaching & Learning Methods", "Fundamental Concepts of Soil Science", "Degraded Soils & Management", "Soil Pollution & Environmental Integrity", "PowerPoint slides", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}]