[{"course_id": 44, "course_code": "PSYCH 101R", "course_name": "PSYCH101R - Introductory Psychology (0.50)", "term_name": "List 2", "program_name": "Cognitive Science", "program_id": 34, "major_id": 1, "major_name": "Cognitive Science Minor", "topics": ["10:00AM - 11:20AM REN 2106", "serena.mcdiarmid@uwaterloo.ca", "11:30AM -", "serena.mcdiarmid@uwaterloo.ca", "Instructor - Serena McDiarmid, MASc, BEd, Sessional Instructor, Social Development Studies", "serena.mcdiarmid@uwaterloo.ca Pronouns she/her", "“I went to the University of Waterloo for my undergraduate degree in health studies and even took some courses at Renison!", "I loved learning about people and ways I could help them, but I also felt a lot of pressure to get high grades and stand out.", "I realized that mistakes were okay and a normal part of learning, and that a bad grade didn't make me a bad person.", "Instructor - Cameron Smith, PhD, Sessional Professor, Social Development Studies", "“I began my university career in Mathematics and Business Administration.", "I remember feeling like I went from being a big fish in a little pond to being a guppy in the ocean.", "It honestly took me a few years before I really felt like I knew what I was doing and got used to studying at a university level.", "Q: Can I play the two professors off of each other like a sitcom Mom and Dad?", "A general survey course designed to provide the student with an understanding of the basic concepts and techniques of modern psychology as a behavioural science.", "We will explore topics ranging from human development throughout the lifespan, to learning and memory, to psychological disorders and the therapies that are used to treat them.", "Explain key concepts from across the discipline of psychology using appropriate terminology.", "Describe the methods of investigation used in psychology, and the strengths and limitations of these methods.", "Identify and communicate the influence of psychological concepts on behaviour and/or systems in everyday situations.", "Apply the findings of psychological research to your life and to important issues in our society and the world at large.", "Sept 11 & 13: Human Development", "Prof. Smith", "Sept 18 & 20: Research Methods", "Prof. Smith", "Sept 27: Senses & Perception", "Prof. Smith", "Prof. Smith", "Prof. Smith", "Prof. Smith", "It is available through a number of different avenues.", "Digital e-version can be purchased at https://uwaterloo-store.vitalsource.com/products/psychology-in-modules-david-g-myers-c-nathan-v9781319355487?term=9781319132095.", "Although we do not officially recommend it using the 12th edition, the differences in these editions are not major.", "From our experience, students can build their skills in note taking, studying, understanding concepts, and test-taking as the term goes on.", "Each quiz contributes to students’ grade enough to make the time and effort they put into it worthwhile, but not so much that a particularly challenging week in their lives will have a significant impact on their final grade.", "Quizzes are multiple choice", "If you want to help a friend succeed, there are other ways to do that without committing academic misconduct - such as studying together.", "*", "As students in this course, you will be exposed to many new ideas and concepts that other people in your life would find useful and interesting!", "In this assignment, your goal is to choose one of the concepts introduced in the first five weeks of class and teach someone else about it.", "Ideas of what videos could look like:", "A narrated slideshow", "A persuasive speech", "A doodle video", "Your co-workers", "The information must be accurate and demonstrate a depth of understanding about the meaning and significance of the concept/topic.", "You will also be exposed to new ideas that relate strongly to your own life.", "How was the concept/theory relevant to the situation?", "Sona Participation and Research Experience Marks", "Participation enables students to learn first-hand about psychology research and related concepts.", "Educational focus of participation in research", "To maximize the educational benefits of participating in research, students will receive feedback information following their participation in each study detailing the following elements:", "Provisions to ensure confidentiality of data", "Participation in remotely operated and in-person in lab studies has increment values of 0.5 participation credits (grade percentage points) for each 30-minutes of participation.", "**", "Identify the psychological concepts in the article and indicate the pages in the textbook that are applicable.", "Clearly evaluate the application or treatment of those concepts in the article.", "Accommodation for Students with Disabilities", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Do you want professors and interviewers to call you by a different first name?"]}, {"course_id": 47, "course_code": "PSYCH 314", "course_name": "PSYCH314 - Cognitive Development (0.50)", "term_name": "List 2", "program_name": "Cognitive Science", "program_id": 34, "major_id": 1, "major_name": "Cognitive Science Minor", "topics": ["This course introduces research in the areas of debate in cognitive development pertaining to children in infancy and early childhood and drawn from a variety of disciplines including developmental psychology, psycholinguistics, and comparative psychology.", "Throughout the course, we will also dive deeply into the unique nature, nuances, challenges, and potentials of studying cognition in development.", "… identify challenges of cognitive development research, and examine the different solutions used by researchers.", "… discuss and explain central theories and major empirical findings from cognitive development research.", "Reading Response - Start of Unit (four total, one per unit, 5pts each) 20%", "(It’s easy to forget this, but every instructor has their own style and skill for creating slides, and those creations belong to their creator!)", "There are a lot of decisions I have to make, and I can’t know for sure how they impact you ahead of time.", "It is a challenging and often painful time to just exist in the world.", "We will also be comparing students' responses to a number of AI-completed assignments generated prior to the start of the term for critical matches.", "This course includes the independent development and practice of specific skills, such as analytical thinking and reflection.", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 50, "course_code": "PSYCH 353", "course_name": "PSYCH353 - Social Cognition (0.50)", "term_name": "List 2", "program_name": "Cognitive Science", "program_id": 34, "major_id": 1, "major_name": "Cognitive Science Minor", "topics": ["Social Cognition Spring 2023", "Email:              h3deshpande@uwaterloo.ca", "Email:              jrross@uwaterloo.ca", "Topics include representation, recall, and use of social knowledge, controllability of thought processes, effects of feelings and desires, stereotype activation and use, and cultural influences.", "Many of us are drawn to psychology because of our interest in understanding why people do what they do.", "In this course, we’ll be exploring a number of questions that are studied by social cognition researchers.", "How does our social knowledge influence perceptions, judgments, and behaviour?", "How do we make sense of the past, make predictions about the future, and manage conflicting goals?", "Understand the basic concepts and theories in social cognition", "Read and critique primary source material", "Apply principles from social cognition to everyday experiences (in your life, in the media)", "Readings", "Introduction & Accessibility", "388-430)", "Automaticity and Control &", "Perceiving Others", "Motivated Perception &", "Heuristics and Hypothesis Testing &", "Affective Forecasting", "Memory", "Ross & Wilson (2003)", "Hellmann & Memon (2016)", "Counterfactuals &", "Self-Identity", "Culture and Cognitive Styles &", "Wisdom &", "Regulatory Focus &", "Molden & Dweck (2006)", "Motivation and Goals &", "Social Self-Regulation", "Fishback & Dhar (2005)", "Fitzimons & Finkel (2011)", "Exams", "These exams will draw from both lecture and readings and will be composed of multiple-choice, short-answer, and short essay questions.", "Discussion Boards and Reflection Papers", "Exams", "Sona Participation and Research Experience Marks", "Students may complete any combination of these options to earn research experience grades Credits will be permitted to be earned with a maximum of half from online, and the other half (2.0) from In-lab or Remote Access studies (In Lab studies can however go over the limit up to the total of 4.0)", "Participation enables students to learn first-hand about psychology research and related concepts.", "You can schedule your In-Person studies through SONA as well but please note the time and location", "Educational focus of participation in research", "To maximize the educational benefits of participating in research, students will receive feedback information following their participation in each study detailing the following elements:", "Provisions to ensure confidentiality of data", "**", "Identify the psychological concepts in the article and indicate the pages in the textbook that are applicable.", "Clearly evaluate the application or treatment of those concepts in the article.", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Intellectual property includes items such as:", "Cross-listed courses"]}, {"course_id": 52, "course_code": "PSYCH 461", "course_name": "PSYCH461 - Honours Seminar in Cognitive Neuroscience (0.50)", "term_name": "List 2", "program_name": "Cognitive Science", "program_id": 34, "major_id": 1, "major_name": "Cognitive Science Minor", "topics": ["Instructors: This course will be co-taught by Sophia Tran sophiahtran@uwaterloo.ca & Chantal Trudel chantal.trudel@uwaterloo.ca", "The single-case approach in neuropsychology has made a significant contribution to our understanding of the architecture of human cognition.", "Studying such patients can provide insights into the brain basis of cognitive processes such as attention, perception, personality, emotion, memory, decision making, and language capacity.", "This seminar will first review the basic methodological approach used in single case studies, and the limitations of those approaches, before moving on to a more detailed examination of particular classic cases and their relevance to what we know today.", "The goal of the course is to examine classic neuropsychological patient cases in order to understand how these have informed current models of human behaviour.", "Examine the relevance and limitations of single cases studies in neuropsychology", "Evaluate the impact of classic neuropsychological patient cases on the understanding of current models of human behaviour", "Verbally communicate the key points of modern studies in relation to the classic cases studied", "Organization and history of classic case methods", "Akelaitis – Split Brains", "What do we miss if we look only for dysfunction?", "Charcot – Imagery", "Bodamer –   Prosopagnosia", "Are faces really a special category?", "Balint-Holmes – Visuospatial control", "Patterson & Zangwill – Neglect", "What is the difference between a syndrome and a constellation of symptoms?", "Monrad-Krohn – Foreign accent syndrome", "Is there a language ‘centre’ in the brain?", "Gage – Executive control", "Is “behavioural control” an ethically defensible reason for engaging in psychosurgery?", "The modern case papers being presented.", "Students will be responsible for finding a relevant modern case study (studies with two or three patients are fine – but the point is to find something that is NOT a large group study).", "25-minute presentation + 5-minute question period", "Description of the study and its main findings", "Advances to our models of behaviour relevant to the classic case", "Students should choose their case study early and send it to the instructors to post on LEARN no later than 1 week prior to their presentation.", "When multiple students present in a given week then presenting students for that week should co-ordinate both their presentations and plans for group discussion to avoid overlap.", "Engage critical thinking regarding the cognitive domain of interest.", "One of the key values of undergraduate seminars comes from the interactions among students where key ideas are discussed and challenged.", "A selection of recent articles discussing the pros and cons of Neuropyschological patient studies, can be found on LEARN.", "Read these, then prepare a 1,500 word max paper outlining “What can we learn from a broken brain?”", "Sona Participation and Research Experience Marks", "The two options for earning research experience grades; participation in research through online remotely operated and In Lab studies, as well as article review; are described below.", "Students may complete any combination of these options to earn research experience grades.", "Participation enables students to learn first-hand about psychology research and related concepts.", "Educational focus of participation in research", "To maximize the educational benefits of participating in research, students will receive feedback information following their participation in each study detailing the following elements:", "Provisions to ensure confidentiality of data", "**", "Identify the psychological concepts in the article and indicate the pages in the textbook that are applicable.", "Clearly evaluate the application or treatment of those concepts in the article.", "This course includes the independent development and practice of specific skills, such as critical thinking, building an argument and synthesis of ideas.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 54, "course_code": "SYDE 543", "course_name": "SYDE543 - Cognitive Ergonomics (0.50)", "term_name": "List 2", "program_name": "Cognitive Science", "program_id": 34, "major_id": 1, "major_name": "Cognitive Science Minor", "topics": ["Piazza will be the main platform for Q&A. In case you need to contact the teaching team, make sure to add SYDE 543 to the beginning of the subject line.", "This course focuses on the role engineering psychology research plays in design of the information displays and devices associated with simple and complex cognitive tasks.", "Remember and comprehend important cognitive ergonomic concepts, theories, and principles", "Analyze human information processing constraints and limitations, and use it to identify cognitive ergonomics issues in systems design", "Apply cognitive ergonomics knowledge to produce improved designs considering human cognitive constraints", "Course Introduction", "Human-computer Communication", "Human Errors", "Senses", "Attention and Learning", "Control", "Empirical Evaluation", "Research Methods in Cognitive Ergonomics", "Decision Making", "Decision making and biases", "Working Memory", "Memory and Training", "Situation Awareness", "March 25,28", "Case study presentation", "Case study presentation", "Foundations for designing user-centered systems: What system designers need to know about people.", "Santa Barbara CA: Aegean Publishing Company No 120", "Alternatively, one of the team members can send the email and cc all the other team members.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "You will be clearly directed whether you are allowed to use these methods for each assignment."]}, {"course_id": 55, "course_code": "SYDE 548", "course_name": "SYDE548 - User Centred Design Methods (0.50)", "term_name": "List 2", "program_name": "Cognitive Science", "program_id": 34, "major_id": 1, "major_name": "Cognitive Science Minor", "topics": ["User Centred Design Methods Winter 2025", "UCD Mentors Pronouns Email Office Extra Help", "This course approaches the design of tasks, tools, products, and systems from a user-centered design perspective.", "Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process.", "Major topics include user research methods for usability and user experience, inspection methods, user testing, applied statistical analysis.", "SYDE 548 (UCD Methods) approaches the design of tasks, tools, products, and systems from a user-centered design perspective.", "Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process.", "Major topics include user research methods for usability and user experience, inspection methods, user testing, and applied statistical analysis.", "SYDE 548 User-Centred Design Methods is a technical elective.", "It builds from earlier SYDE core courses in design (SYDE-BME 161 Introduction to Design, SYDE-BME 162 Human Factors in Design, and SYDE-BME 361 Engineering Design).", "Motivated students willing to become familiar with basic human factors engineering can participate and contribute to course activities.", "Whether you are interested in becoming a UCD specialist, a certified ergonomist, or just want to be a wise designer or consumer, this course will supply you with a range of practical tools (methods).", "Our “In-class” sessions are used as workshops for interactions and hands-on skill development with different UR methods.", "Engineering Graduate Attribute]", "(A) Describe ethical UCD methods used for formal and informal design assessments with human participants.", "(B) Investigate & select appropriate ethical & equitable UCD methods for specific design situations.[2a, 3b, 10b]", "(C) Apply UCD method protocols to instructor-defined design situations.", "(D) Modify UCD method protocols to collect data for a student-defined design project.", "(E) Select and apply appropriate statistical analysis for given UCD data.", "(F) Design ethical UCD test plans for instructor-defined design situations.", "(G) Create User Research Portfolios describing ethical UCD methods, protocols, and lessons learned.", "CEAB Engineering Graduate Attribute", "Knowledge Base for Engineering", "2. Problem Analysis", "Data Analysis Quizzes,", "4. Design", "-", "Impact of Engineering on Society and the Environment", "Ethics & Equity", "Economics & Project Management", "-", "2. Situations of Concern, Design Impacts & Personas Quantifying Usability; Standard UX Questionnaires;", "SUS Scoring (standard and positive versions)", "3. Design Ethnography: UR Safaris & Secondary Research.", "Interviews & Distress Protocols.", "5. Thematic Analysis Methods - Part 1 Thematic Analysis Methods - Part 2", "Formative Design Walkthroughs & Estimating Formative Sample Sizes.", "UR Methods & GenAI Revisited.", "Quantifying the User Experience: Practical statistics for user research.", "An e-copy of the 1st edition can be accessed through UW Library Reserves.", "The User Experience Team of One: A Research and Design Survival Guide. 2nd edition.", "Hanington, B. & Martin, B (2019) Universal Methods of Design (Expanded & Revised): 125 Ways to research complex problems, develop innovative ideas, and design effective solutions.", "An e-copy of the 1st edition can be accessed through UW Library Reserves No", "Design Materials (for workshops, data collection, and analysis).", "The number of students who can access an e-copy at a given time may be limited.", "Since user-centred design and user research skills are valued by industry, it is important that each student submits original work and demonstrates their own value-added UR skills to earn credit for the course.", "Intellectual property includes items such as:"]}, {"course_id": 56, "course_code": "SYDE 572", "course_name": "SYDE572 - Introduction to Pattern Recognition (0.50)", "term_name": "List 2", "program_name": "Cognitive Science", "program_id": 34, "major_id": 1, "major_name": "Cognitive Science Minor", "topics": ["Introduction to Pattern Recognition Fall 2024", "Pattern features as components in a random vector representation.", "Applications; optical character recognition, speech recognition, industrial robot vision, medical diagnosis, remote sensing and satellite image analysis, fault detection and diagnosis in complex systems such as nuclear reactors.", "Understand the principles of fundamental pattern recognition concepts such as classification, feature extraction and selection, deep learning, etc.", "2. Apply learnt techniques and algorithms in assignments using Python", "3. Understand and contextualize the learnt concepts in applications of pattern recognition to science, engineering, and industry", "4. Design a pattern recognition system provided a task and a set of data.", "Problem Analysis", "Introduction, Pattern Recognition Problem Definition", "Parametric and Nonparametric Distance-Based Classification", "KNN and distance-based classification", "Parametric and Nonparametric Density Estimation", "Discriminant Functions", "Gaussian mixture models", "Parametric and Nonparametric Clustering", "Expectation Maximization", "Linear and nonlinear regression", "Ensemble classification", "Advanced topics", "An Introduction to Statistical Learning, James, Witten, Hastie, Tibshirani, 2nd Ed.", "Introduction to Machine Learning, Alpaydin.", "Dive into Deep Learning", "Various usefullinks and advisorcontact information can be foundhere:"]}, {"course_id": 0, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 1, "course_code": "CO 255", "course_name": "CO255 - Introduction to Optimization (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Introduction to Optimization (Advanced Level)", "08:30AM - 09:50AM MC 4040", "Linear optimization: feasibility theorems, duality, the simplex algorithm.", "Know a variety of optimization algorithms, including the Simplex method, cutting plane methods, and descent methods.", "Know and apply the definition and properties of convex sets and functions.", "Write the dual of a linear programming problem and understand the properties relating the primal and dual.", "Apply optimization methods to common continuous and discrete problems including game theory, flow, scheduling, and data science.", "Linear programming, Fourier-Motzkin elimination, and Farkas's lemma.", "Duality in linear programming.", "Convex optimization and the KKT conditions.", "Discrete optimization and total unimodularity.", "Applications of total unimodularity to matching and flow problems", "Application of nonlinear optimization to data science", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course.", "If you have questions or concerns about these matters, please email mathadvisor@uwaterloo.ca."]}, {"course_id": 2, "course_code": "MATH 239", "course_name": "MATH239 - Introduction to Combinatorics (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics Winter 2025", "11:30AM - 12:20PM MC 4059", "09:30AM - 10:20AM MC 4021", "P. Nelson", "08:30AM - 09:20AM QNC 1502", "S. Pfannerer-Mittas", "10:30AM - 11:20AM MC 4058", "11:30AM - 12:20PM MC 4058", "09:30AM - 10:20AM MC 4042", "02:30PM - 03:20PM", "10:30AM - 11:20AM PHY 150", "04:30PM - 05:20PM", "You should have no reason to contact them directly, but you can find their email addresses through Learn.", "First name Last name", "Guilherme Zeus Dantas E Moura", "Theodore Morrison", "Matthew Kroeker", "Introduction to graph theory: colourings, matchings, connectivity, planarity.", "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.", "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 3, "course_code": "MATH 249", "course_name": "MATH249 - Introduction to Combinatorics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics (Advanced Level)", "09:30AM - 10:20AM MC 2017", "For graph theory, while we will focus on the same topics covered in MATH 239 (planarity and bipartite matching), our coverage of those topics will differ substantially in depth and in the techniques that we employ; in particular, we will see striking applications of algebra.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 4, "course_code": "PMATH 336", "course_name": "PMATH336 - Introduction to Group Theory with Applications (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Group Theory with Applications Fall 2023", "08:30AM - 09:20AM", "Section/chapter numbers refer to the free online textbook \"Abstract Algebra: Theory and Applications,\" 2022 edition, by Thomas W. Judson.", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 5, "course_code": "PMATH 347", "course_name": "PMATH347 - Groups and Rings (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Groups and Rings Fall 2024", "08:30AM - 09:20AM", "Objective: This course is designed to introduce the theory of groups and rings to students.", "Group Theory: Understand fundamental concepts such as groups, subgroups, and homomorphisms, and apply key theorems like Lagrange’s theorem and Sylow theorems.", "Ring Theory: Learn the properties and structures of rings, ideals, and polynomial rings, including integral domains and fields.", "Their total marks are equal to an assignment and can be used to replace the second-lowest assignment mark.", "Tests will be conducted online at the scheduled time slots", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 6, "course_code": "CO 330", "course_name": "CO330 - Combinatorial Enumeration (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Kartik Singh <k266singh@uwaterloo.ca>", "Kimia Shaban <kimia.shaban@uwaterloo.ca>", "The algebra of formal power series.", "Integer partitions, geometric methods, enumerating linear transformations.", "Introduction to the pattern algebra, applications to the enumeration of strings.", "Enumeration under symmetries.", "We will focus on studying several nice classes of combinatorial objects while developing a unified framework and a toolbox of combinatorial techniques.", "We will cover a large subset of the following topics in this course:", "q-Analogues and polynomial identities.", "Exponential generating functions and labelled objects.", "9/16-9/20 Ordinary generating functions (ICE Ch. 4) A2 due 10/4", "10/14-10/18 reading week", "11/4-11/8 Exponential generating functions and labelled classes (ICE Ch. 10) A5 due 11/22", "David G. Wagner's CO 330 Course Notes: Introduction to Combinatorial Enumeration this is referred to as ICE in the table above Yes", "Generatingfunctionology by Herbert Wilf we will use this as a resource for exponential generating functions No", "Your goal should be to write a proof that can be followed by an average student in the class who hasn't already figured out the solution.", "This course includes the independent development and practice of specific skills that require consistent work.", "Library for research-based assignments"]}, {"course_id": 7, "course_code": "CO 331", "course_name": "CO331 - Coding Theory (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["A first course in error-correcting codes.", "Linear block codes, Hamming-Golay codes, and multiple error-correcting BCH codes are studied.", "The mathematical ingredients for the course include linear algebra, groups, rings, ideals, and finite fields.", "Demonstrate a fundamental understanding of the binary symmetric channel, decoding strategies, and the challenges with designing good codes;", "Construct codes, and devise efficient encoding and decoding algorithms for them as a means of gaining exposure to the applications of linear algebra and abstract algebra;", "Analyze the properties of major families of algebraic codes including linear codes, Hamming codes, Golay codes, cyclic codes, BCH codes, and Reed-Solomon codes.", "An Introduction to Error Correcting Codes with Applications, by S.A. Vanstone and P.C. van Oorschot Available for free download from the UW library.", "The quizzes are each worth 7.5%, and can be taken between 8:00 am and 9:30 pm.", "You can submit solutions to a subset of questions by the assignment due date.", "The subset you submit must be comprised of solutions to full questions (not parts of questions), and need not be a proper subset.", "You may ask for general clariﬁcation about assignment questions.", "If you do collaborate, you must acknowledge your collaborators in the write-up for each problem.", "High workloads because of midterms and assignments in other courses will not qualify as a special circumstance.", "If you have any concerns with the marking of assignment questions, please email your instructor together with a clear and detailed description of your appeal(s).", "Intellectual property includes items such as:", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 8, "course_code": "CO 342", "course_name": "CO342 - Introduction to Graph Theory (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Graph Theory Fall 2024", "08:30AM - 09:20AM", "An introduction to some of the key topics in graph theory: connectivity, planarity, and matchings.", "Prove Kuratowski's chatacterization of planar graph", "Efficiently decide whether a given graph is planar", "Efficiently find a maximum matching in a graph", "Prove the Tutte-Berge formula on the size of a maximum matching", "Prove Menger's Theorem on vertex-disjoint paths", "Week 1: Introduction to minors", "Separating and non-separating cycles", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words."]}, {"course_id": 9, "course_code": "CO 351", "course_name": "CO351 - Network Flow Theory (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["In case of (medical or other) emergencies, or private issues, send E-mail to the instructor.", "Network simplex and primal-dual algorithms.", "Applications to problems of transportation, distribution, job assignments, and critical-path planning.", "The course covers mathematical models for optimization problems on networks.", "The max-flow-min-cut theorem has many applications including its implication of the Menger theorem in graph theory.", "Additionally, the course presents several algorithms for solving optimization problems on networks.", "Linear programming and LP duality are central to the design and analysis of some of the algorithms.", "- maximum flows and minimum cuts (max-flow/min-cut theorem, preflow-push algorithm);", "- applications to problems in transportation, distribution, job assignments, and critical-path planning, etc.", "1 Sep. 4-6 Review linear programming and graph theory", "4 Sep. 23-27 Shortest di-paths problem A1", "11 Nov. 18-22 Minimum cost flow A4", "\"Network Flow Algorithms\" (grad-level book) by D.P.Williamson http://www.networkflowalgs.com/ No", "This is a closed-book exam.", "This is a closed-book exam.", "Students are advised to invest in a reliable internet connection and a reliable device (for a fraction of the cost of UW tuition).", "The answer to most common issues as well as how-to videos can be found at"]}, {"course_id": 10, "course_code": "CO 353", "course_name": "CO353 - Computational Discrete Optimization (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Computational Discrete Optimization Winter 2025", "08:30AM - 09:50AM E2 1732", "Formulations of combinatorial optimization problems, greedy algorithms, dynamic programming, branch-and-bound, cutting plane algorithms, decomposition techniques in integer programming, approximation algorithms.", "A discrete optimization problem, broadly speaking, involves a discrete set of feasible solutions and a real-valued objective function that assigns a value to each solution.", "Discrete optimization problems are of immense practical importance, are solved every day (sometimes each hour or more frequently) by many Fortune 500 companies;  well-known problems in the class include", "This course provides an introduction to the broad field of discrete optimization and covers several classes of commonly used techniques for the design of algorithms, including:", "Dynamic programming,", "We will discuss algorithmic efficiency and introduce the basics of complexity theory.", "For NP-hard problems, we will explore the field of approximation algorithms, which provides efficient methods for computing solutions with guaranteed quality.", "Students will complete two practical projects as part of the course, where they will develop, implement, and test algorithms for specific discrete optimization problems.", "formulate discrete optimization problems;", "identify and apply algorithms that can be used to solve selected discrete optimization problems;", "prove correctness of above algorithms and results related to the structures of discrete optimization problems.", "\"The Design of Approximation Algorithms\" by David Williamson, David Shmoys No", "\"Approximation Algorithms\" by Vijay Vazirani No", "\"The Design of Approximation Algorithm\" by David Williamson, David Shmoys;", "\"Approximation Algorithms\" by Vijay Vazirani.", "Each collaboration and resource used to prepare the submission should be appropriately acknowledged in the submission.", "Projects are to be done in groups of two-three.", "Submissions not following the specified format might be assessed based only on their performance and correctness of their output without providing feedback.", "In case you are not able to participate in some of the assessments please visit this webpage to submit the required information.", "Notice of Recording", "If due to changes in regulations and guidelines, it becomes impossible for us to hold in-person lectures and office hours, the lectures and office hours will be held over Zoom."]}, {"course_id": 13, "course_code": "CO 431", "course_name": "CO431 - Symmetric Functions (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Symmetric Functions Fall 2024", "04:00PM - 05:20PM", "DWE 3517", "The ring of symmetric functions, standard bases, the Hall inner product.", "In practice, mostly you want to be very good at linear algebra.", "You should know basic things about groups and the basic definitions of ring theory.", "If you know some combinatorics, you’ll appreciate that although it’s unnecessary.", "TBA", "Bump & Schilling, Crystal Bases: Representations and Combinatorics", "Egge, An Introduction to Symmetric Functions and their Combinatorics", "Macdonald, Symmetric Functions and Hall Polynomials", "Manivel, Symmetric Functions, Schubert Polynomials and Degeneracy Loci", "Phone: 519-884-0000 extension 213", "Please inform me of these at the start of the course."]}, {"course_id": 14, "course_code": "CO 432", "course_name": "CO432 - Information Theory and Applications (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Information Theory and Applications Winter 2024", "11:30AM -", "Basics of information theory; Shannon entropy, KL divergence, and mutual information; basic properties of entropic quantities; chain rule, Pinsker's Inequality, Data Processing Inequality; compression; Channel Coding Theorem; error-correction; applications to combinatorics, optimization, cryptography, and computer science.", "Although it was originally developed as a mathematical theory of communication, information theory has found a growing number of applications in seemingly unrelated domains.", "Through this course, we will study basic concepts from information theory, properties of entropic quantities, their operational interpretations, and applications in discrete mathematics and computer science.", "A tentative list of topics includes:", "basic properties of entropic quantities", "one-shot and asymptotic compression", "Noisy Coding Theorem and error-correction codes", "communication complexity of Set Disjointness", "applications of error-correction codes", "extended linear programming formulations", "sample complexity in Learning", "Define fundamental entropic quantities", "Describe and analyse fundamental communication tasks", "Apply information-theoretic concepts and methods in other contexts", "Introduction to the course.", "Shannon entropy: definition, interpretation, basic properties; prefix-free codes, Kraft Inequality, Source coding theorem; Asymptotic equipartition theorem", "Communication over noisy channels, capacity of a channel, examples of simple channels and their capacity; Idea behind channel coding, joint typicality, Channel coding theorem", "Error-correction codes, distance of a code, error rate, information rate; Hadamard code, Reed-Solomon code; Efficient encoding and decoding for Reed-Solomon codes; Linear codes, generator matrix, distance, dual code", "k-wise independence, construction using Reed-Solomon codes, support size; algorithm for E3-Sat; k-wise independence and distance of dual code, almost k-wise independence, general construction using binary codes", "Protocol for Equality revisited; Self-correction and self-testing of Hadamard code; exponential length PCPs for 3-Sat with a constant number of queries", "Monotone functions and formulae, monotone formulae for Threshold functions; graph entropy, graph entropy of classes of graphs, properties of graph entropy; min-terms, min-terms of OR and AND of functions, graphs constructed from min-terms; lower bound for Threshold function", "Linear programming formulations, polytopes, extensions, the permutahedron, extension complexity; Max-Clique, formulation with the correlation polytope; slack matrix, non-negative rank, Yannakakis Factorization Theorem; facets specified by 0-1 vectors, connection to Set Disjointness; lower bound on non-negative rank via sampling disjoint subsets", "Quantum information basics: von Neumann entropy, Holevo Theorem, compression of pure states", "Information Theory and its applications in Theory of Computation, course taught by Venkatesan Guruswami and Mahdi Cheraghchi http://www.cs.cmu.edu/~venkatg/teaching/ITCS-spr2013/", "For example, in case of a short period of illness and a strong performance in the course, we expect to shift the weight to the remaining assessments.", "Notice of Recording", "In case public health restrictions prevent in-person classes, live lectures will be held online and recorded.", "You can freely discuss the material in the lectures and the textbook.", "Please email the instructor or TA only for matters of a personal nature.", "In case public health restrictions prevent in-person classes, lectures will be held live, online.", "There are a number of resources available if you find yourself in a difficult situation.", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 18, "course_code": "CO 442", "course_name": "CO442 - Graph Theory (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Colouring: Brooks' Theorem and Vizing's Theorem. Flows: integer and group-valued flows, the flow polynomial, the 6-flow theorem. Extremal graph theory; Ramsey's theorem, Turan's theorem, Mader's theorem on graphs with no n-clique-minor. Probabilistic methods: Lower bounds for Ramsey numbers, graphs with large girth and chromatic number.", "Graph Theory ", "P. Nelson", "External graph theory: Turan's theorem, the Erdos-Gallai theorem."]}, {"course_id": 20, "course_code": "CO 446", "course_name": "CO446 - Matroid Theory (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Matroid Theory Spring 2023", "This is an introductory course on matroid theory, with particular emphasis on graphic matroids and on topics that are applicable to graph theory. The topics include matroid intersection and partition, graphic matroids, matroid connectivity, regular matroids, and representable matroids. Applications include matching, disjoint paths, disjoint spanning trees, the 8-flow theorem for graphs, planarity testing, and recognizing totally unimodular matrices.", "P. Nelson", "Applications include matching, disjoint paths, disjoint spanning trees, the 8-flow theorem for graphs, planarity testing, and recognizing totally unimodular matrices."]}, {"course_id": 22, "course_code": "CO 452", "course_name": "CO452 - Integer Programming (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Formulation of problems as integer linear programs.", "Solution by branch-and-bound and cutting plane algorithms.", "Introduction to the theory of valid inequalities and polyhedral combinatorics.", "Integer Programming is a mathematical program that can be seen as a linear program with the additional requirement that some (or all) of the variables are required to take on integer values.", "While linear programming is already very useful in modeling problems and can be solved well using either interior point methods or the simplex method, {\\bf Integer programs, or IPs} have a much broader range of applications.", "In this course we will explore an upper-level undergraduate/basic graduate introduction to the topic of Integer Programming.", "Understand basic theory and algorithms behind integer programming approaches", "Basic geometric definitions: Convex/affine/linear combinations.", "Basic polyhedral theory: Faces, facets, extreme points.", "Integral polyhedra and Total Dual Integrality.", "Union of polyhedra and representability.", "Equivalence of optimization and separation.", "Gomory cuts and other cutting planes.", "Rank and closures.", "Branch-and-bound: Basic ideas and extensions.", "Theoretical and computational results.", "This includes technical problems in your submission, like power outage, no internet access, etc.", "Collaboration", "Re-marking policies", "Note that your solution will be very carefully examined during a re-mark.", "In addition such student needs to be in good standing.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as undertanding theory and algorithms for some classes of optimization models.", "Library for research-based assignments"]}, {"course_id": 23, "course_code": "CO 454", "course_name": "CO454 - Scheduling (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Scheduling Spring 2024", "10:00AM - 11:20AM DWE 3517", "E-mail : nikhil.kumar2@uwaterloo.ca", "An overview of practical optimization problems that can be posed as scheduling problems.", "Simple and efficient combinatorial algorithms for easy problems.", "Scheduling problems form a large part of resource allocation problems where sparse resources have to be assigned over time to complete tasks and optimize over one or multiple objectives.", "The course will also contain a brief overview of computational complexity and various techniques for the design of efficient exact and approximate algorithms.", "Scheduling problems: Modeling and notations", "Single-machine Models, Optimal schedules, Exact algorithms", "Computational complexity - P, NP, NP-completeness.", "Multiple-machine models, approximation algorithms.", "Dynamic Programming and its application to scheduling", "Linear and Integer Programming techniques", "Scheduling: Theory, Algorithms, and Systems Author: Michael Pinedo No", "Algorithm Design Authors: Jon Kleinberg and Eva Tardos No"]}, {"course_id": 24, "course_code": "CO 456", "course_name": "CO456 - Introduction to Game Theory (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Game Theory Fall 2024", "A broad introduction to game theory and its applications to the modeling of competition and cooperation in business, economics, and society.", "Classical game theory studies the competitive and cooperative behaviour of rational and self‐interested individuals in strategic environments.", "It speciﬁcally develops beautiful analytic tools to analyze and model situations in which a person’s welfare is a function not only of their own actions, but also those of others.", "This course is meant to be a broad and mathematical introduction to game theory and its appications.", "We will attempt to cover these topics:", "This class is meant to be a broad and mathematical introduction to game theory and its applications.", "Game Theory Basics, Bernhard von Stengel http://www.maths.lse.ac.uk/personal/stengel/lectnotes1-7.pdf No", "An Introduction to Game Theory, Martin J. Osborne https://www.economics.utoronto.ca/osborne/igt/ No", "Mechanism Design and Approximation, Jason D. Hartline http://jasonhartline.com/MDnA/ No", "As the title implies, a basic introduction to various topics in game theory.", "An introduction to game theory and equilibria from a computer science perspective.", "An Introduction to Game Theory, Martin J. Osborne.", "The text contains a section on game theory, and some chapters about matching games.", "Mechanism Design and Approximation, Jason D. Hartline.", "These notes were written for a graduate class, and cover mechanism design from an advanced perspective.", "Your submission must be clear and legible, and in the correct orientation.", "You are expected to work on the assignment problems and submit them well ahead of the deadline, in case of technical difficulty.", "You must write up your own solutions without seeking help from anyone, and list the names of your collaborators in each of the assignment problems involved.", "This is a closed-book exam, no aids are allowed.", "A missed test will be treated the same as a mark of zero.", "This is a closed-book exam, no aids are allowed.", "Re-marking policies", "Note that your solution will be very carefully examined during a re-mark.", "In case of serious illness during the final exam, you may be granted a grade of INC provided that", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as finding Nash equilibria and applying game theory to real life applications.", "Library for research-based assignments"]}, {"course_id": 26, "course_code": "CO 463", "course_name": "CO463 - Convex Optimization and Analysis (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Convex Optimization and Analysis Winter 2024", "An introduction to the modern theory of convex programming, its extensions and applications.", "Structure of convex sets, separation and support, subgradient calculus for convex functions, Fenchel conjugacy and duality, Lagrange multipliers.", "Ellipsoid method for convex optimization.", "Determine whether sets and functions are convex and supply a proof", "Compute conjugates and subdifferentials of convex functions and duals of norms", "Determine Lagrange duals and necessary and sufficient conditions for convex optimization problems", "Recognize standard forms of convex programming", "Implement some convex optimization algorithms and use a convex optimization modeling language", "Convex sets", "Convex functions", "Characterization in terms of first and second derivative", "Conjugacy", "Norms and sublinear functions", "Convex optimization", "Standard forms of convex programming", "Basics of monotone operator theory", "First-order methods", "H. Bauschke and P. Combettes, Convex analysis and monotone operator theory in Hilbert spaces, 2017.", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 28, "course_code": "CO 471", "course_name": "CO471 - Semidefinite Optimization (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Semidefinite Optimization Spring 2023", "04:00PM - 05:20PM", "Optimization over convex sets described as the intersection of the set of symmetric, positive semidefinite matrices with affine spaces.", "Theoretical and practical consequences of these formulations.", "Duality theory and algorithms.", "Optimization over convex sets described as the intersections of the set of symmetric, positive semidefinite matrices with affine spaces.", "Formulations of problems from combinatorial optimization, graph theory, number theory, probability and statistics, engineering design and control theory.", "Theoretical and practical consequences of these formulations.", "Duality theory and algorithms.", "Topics Include: Optimization over convex sets described as the intersection of the set of symmetric, positive semideﬁnite matrices with aﬃne spaces: Semideﬁnite optimization vastly generalizes linear programming where variable vectors may be replaced with matrix variables and, in addition to linear equations and inequalities, one may utilize constraints requiring some of the matrix variables to be symmetric and positive semideﬁnite.", "duality theory for semideﬁnite optimization,", "algorithms for semideﬁnite optimization: ellipsoid method, ﬁrst‐order methods and primal‐dual interior‐point methods for semideﬁnite optimization, and approximation algorithms based on semideﬁnite optimization,", "formulations of problems from combinatorial optimization, graph theory, number theory, probability and statistics, complexity analysis of algorithms, engineering design and control theory, theoretical and practical consequences of these formulations,", "Polyhedral and Semidefinite Programming Methods in Combinatorial Optimization"]}, {"course_id": 29, "course_code": "CO 481", "course_name": "CO481 - Introduction to Quantum Information Processing (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Quantum Information Processing Winter 2024", "Basics of computational complexity; basics of quantum information; quantum phenomena; quantum circuits and universality; relationship between quantum and classical complexity classes; simple quantum algorithms; quantum Fourier transform; Shor factoring algorithm; Grover search algorithm; physical realization of quantum computation; error-correction and fault-tolerance; quantum key distribution.", "This course aims to give a basic foundation in the field of quantum information processing (often just called \"quantum computing\").", "QIP is a multidisciplinary subject and therefore this course will introduce fundamental concepts in theoretical computer science and physics that will enable students to pursue further study in various aspects of QIP.", "Prerequisites: A solid background in basic linear algebra (e.g. a good performance in MATH 235 or MATH 114) is necessary.", "Explain the logical level functioning of quantum computers.", "Describe and analyze several elementary quantum algorithms.", "Introduction to Quantum Mechanics (6 hrs)", "Bloch sphere.", "Introduction to Computation and Computational Complexity (6 hrs)", "Quantum circuits.", "Basic complexity classes.", "Quantum Algorithms (9 hrs)", "Basic algorithms.", "Implementations of quantum information processors.", "An Introduction to Quantum Computing, by Kaye et al.", "Students may assist each other in working through assignment problems, as"]}, {"course_id": 30, "course_code": "CO 485", "course_name": "CO485 - The Mathematics of Public-Key Cryptography (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["The Mathematics of Public-Key Cryptography Fall 2024", "08:30AM - 09:50AM DWE 3517", "An in-depth study of public-key cryptography.", "Public-key encryption, digital signatures, key establishment, elliptic curve cryptography, post-quantum cryptography.", "An in-depth study of public-key cryptography, including: number-theoretic problems - prime generation, integer factorization, discrete logarithms; public-key encryption; digital signatures; key establishment; elliptic curve cryptography; post-quantum cryptography; and security proofs.", "An in-depth study of public-key cryptography and number-theoretic problems related to the efficient and secure use of public-key cryptographic schemes.", "Algorithmic number theory: Primality testing, integer factorization problem, discrete logarithm problem, elliptic curve discrete logarithm problem.", "Additional topics: Pairing-based cryptography, post-quantum cryptography.", "An Introduction to Mathematical Cryptography (2nd ed.), Hoffstein, Pipher, and Silverman.", "The quizzes are intended to reinforce basic concepts that are, in some sense, \"too easy\" to put in an assignment (e.g., definitions, simple calculations).", "Assignments: Right now I expect a total of 6 assignments in the course.", "Late assignments will be given a grade of 0 and I reserve the right not to grade them.", "Exception: Any student who self-declares a short-term absence overlapping with an assignment due date receives a 48-hour extension on the assignment without penalty, and assignments submitted within this extension period will be graded."]}, {"course_id": 32, "course_code": "CO 487", "course_name": "CO487 - Applied Cryptography (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Instructor: Samuel Jaques", "Email: sejaques@uwaterloo.ca", "Timothy Miller", "Nicolas Swanson", "A broad introduction to modern cryptography, highlighting the tools and techniques used to secure internet and messaging applications.", "It is one of the core technologies for securing the emerging information infrastructure.", "This course is a comprehensive introduction to modern cryptography that is aimed primarily at those interested in applications.", "In the area of public-key cryptography, topics will include an overview of specific systems (Diffie–Hellman, RSA, DSA, etc.) and a few advanced protocols.", "The security of these schemes and the use of public-key techniques for generating digital signatures will be described.", "Linear and differential cryptanalysis of ciphers.", "Define the main information security goals of confidentiality, integrity, authentication, and availability", "Explain the intended security properties of each cryptographic primitive and analyze relationships between security properties", "Explain mathematical techniques underlying standardized cryptographic algorithms", "Identify flaws in uses of cryptographic algorithms", "Determine which cryptographic algorithms can be used and combined to build systems with desired functionality and security", "Understand and contextualize the cryptography and security around them in daily life", "0 1 (Jan 6-8) Introduction", "Symmetric Encryption", "3.6 9 Elliptic Curve Cryptography 4 Yes", "4   Applications", "Understanding Cryptography: From Established Symmetric and Asymmetric Ciphers to Post-Quantum Algorithms, 2nd edition, Springer, 2024 Primary reference.", "A1: January 23", "A4: March 20", "This will be clearly indicated for each such question.", "In that case you are required to work independently.", "These questions will test your ability to identify the important concepts introduced in lectures, and your understanding of them.", "In particular:", "Please inform us of these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 33, "course_code": "CS 467", "course_name": "CS467 - Introduction to Quantum Information Processing (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Quantum Information Processing Winter 2024", "Basics of computational complexity; basics of quantum information; quantum phenomena; quantum circuits and universality; relationship between quantum and classical complexity classes; simple quantum algorithms; quantum Fourier transform; Shor factoring algorithm; Grover search algorithm; physical realization of quantum computation; error-correction and fault-tolerance; quantum key distribution.", "This course aims to give a basic foundation in the field of quantum information processing (often just called \"quantum computing\").", "QIP is a multidisciplinary subject and therefore this course will introduce fundamental concepts in theoretical computer science and physics that will enable students to pursue further study in various aspects of QIP.", "Prerequisites: A solid background in basic linear algebra (e.g. a good performance in MATH 235 or MATH 114) is necessary.", "Explain the logical level functioning of quantum computers.", "Describe and analyze several elementary quantum algorithms.", "Introduction to Quantum Mechanics (6 hrs)", "Bloch sphere.", "Introduction to Computation and Computational Complexity (6 hrs)", "Quantum circuits.", "Basic complexity classes.", "Quantum Algorithms (9 hrs)", "Basic algorithms.", "Implementations of quantum information processors.", "An Introduction to Quantum Computing, by Kaye et al.", "Students may assist each other in working through assignment problems, as"]}, {"course_id": 34, "course_code": "PHYS 467", "course_name": "PHYS467 - Introduction to Quantum Information Processing (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Quantum Information Processing Winter 2024", "Basics of computational complexity; basics of quantum information; quantum phenomena; quantum circuits and universality; relationship between quantum and classical complexity classes; simple quantum algorithms; quantum Fourier transform; Shor factoring algorithm; Grover search algorithm; physical realization of quantum computation; error-correction and fault-tolerance; quantum key distribution.", "This course aims to give a basic foundation in the field of quantum information processing (often just called \"quantum computing\").", "QIP is a multidisciplinary subject and therefore this course will introduce fundamental concepts in theoretical computer science and physics that will enable students to pursue further study in various aspects of QIP.", "Prerequisites: A solid background in basic linear algebra (e.g. a good performance in MATH 235 or MATH 114) is necessary.", "Explain the logical level functioning of quantum computers.", "Describe and analyze several elementary quantum algorithms.", "Introduction to Quantum Mechanics (6 hrs)", "Bloch sphere.", "Introduction to Computation and Computational Complexity (6 hrs)", "Quantum circuits.", "Basic complexity classes.", "Quantum Algorithms (9 hrs)", "Basic algorithms.", "Implementations of quantum information processors.", "An Introduction to Quantum Computing, by Kaye et al.", "Students may assist each other in working through assignment problems, as"]}, {"course_id": 36, "course_code": "CS 466", "course_name": "CS466 - Algorithm Design and Analysis (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Algorithm Design and Analysis Fall 2024", "Monday -", "Monday", "Sepehr Assadi - sassadi@uwaterloo.ca", "MohammadHossein Ebtehaj - mhebtehaj@uwaterloo.ca", "General information", "Mathematical maturity, and a strong background in probability, data structures, and algorithm design.", "I invite you to let me know about what I can stop, start, or continue doing to make sure every one of my students feels valued and can engage actively in our learning community.", "This is an advanced algorithm design and analysis course, aimed at undergraduate students interested in a deep dive in theoretical computer science (TCS), as well as graduate students doing research in TCS.", "Probabilistic analysis: Randomized algorithms, Concentration inequalities, Balls-and-bins", "Linear programming: Basics, Duality, Center-of-gravity algorithm, Rounding", "Multiplicative weight update (MWU): Expert problem, Fast packing/covering linear programs", "Random walks: Connectivity in RL, Perfect matchings in regular bipartite graphs, Sampling", "Dynamic graph algorithms: Connectivity, Approximate matching", "Parallel algorithms: Matching in RNC, Isolation lemma", "design and analyze algorithms for a wide range of canonical problems studied in this course, and even more importantly, for new problems that you may have not encountered directly yet,", "know a wide range of algorithmic and mathematical tools commonly used in design and analysis of algorithms, and", "have a basic familiarity with various algorithmic models of computation studied in TCS.", "Probabilistic Background and Concentration inequalities", "Streaming distinct elements, Limited independence hash functions", "Balls-and-bins experiments: Power of two choices via random graph theory", "MSTs: Basics, Fredman-Tarjan algorithm", "MSTs: Karger-Klein-Tarjan algorithm", "Linear programming (LP): Basics and Applications", "Linear Programming (LP): Duality and Integrality gaps", "Linear Programming (LP): More on Integrality gaps, Dual fitting for set cover", "Linear Programming (LP): Primal-dual for bipartite matching", "Online matching with a primal-dual analysis", "Graph sketches: Connectivity and L0-samplers", "Random walks: fundamental theorem of Markov chains, connectivity in RL", "Random walks: Perfect matching in regular bipartite graphs", "DP09 Devdatt P. Dubhashi and Alessandro Panconesi, Concentration of Measure for the Analysis of Randomised Algorithms.", "V20 Nisheeth K. Vishnoi, Algorithms for Convex Optimization.", "AHK12", "Please refer to the Course Webpage for a list of papers related to the topics discussed in the lectures.", "This is a list of some other closely related courses taught elsewhere:", "Randomised and Advanced Algorithms, Winter 2024 by Clément Canonne @ University of Sydney.", "Advanced Algorithms, Spring 2023 by Anupam Gupta @ CMU.", "Advanced Algorithms, Fall 2021 by Mohsen Ghaffari @ ETH.", "Advanced Algorithm Design, Fall 2022 by Matt Weinberg and Huacheng Yu @ Princeton.", "Advanced Topics in Algorithms, Fall 2021 by Kent Quanrud @ Purdue.", "Advanced Algorithms, Winter 2020 by Aleksandar Nikolov @ University of Toronto.", "CS466/666: Algorithm Design and Analysis, Spring 2024 by Rafael Oliveira", "CS466/666: Algorithm Design and Analysis, Fall 2024 by Sepehr Assadi", "CS466/666: Algorithm Design and Analysis, Fall 2022 by Therese Biedl", "CS466/666: Algorithm Design and Analysis, Spring 2022 by Lap Chi Lau", "Course Project (only for graduate students in CS 666) 15%", "15% Course Project (only for graduate students in CS 666)", "The solutions should be turned in as a single pdf file containing the answers to the assignment questions in order.", "For students: LaTeX tremendously helps you in writing clean and well-structured proofs (a necessity for a rigorous proof ) as well as editing an already written proof further.", "For submissions, only one member of the group submits the full solutions on Crowdmark and lists the name of their partners in the group.", "In this case, all members of the group lose one of their extensions.", "However, you can bring in a one-page cheat sheet with you to the exam.", "The final exam follows the same policies as the mid-term exam for blank solutions, one-page cheat sheet, and missed exams.", "Course Project (only for graduate students registered in CS 666)", "Policies and Statements", "Email is fast and tends to give the illusion of constant and immediate access.", "Also, please use email only to communicate specific concerns, questions, or comments regarding your experience in the course, or setting up appointments for in-person meetings outside office hours in case necessary.", "I am using bunch of different email filters to manage my (unmanageable) inbox and I may not get to see emails without this format at all...", "Please let us know ways to improv", "Please inform us of these at the start of the course.", "Your Health & Well-Being", "This is a challenging course with various advanced topics and not-so-easy assignments and exams.", "All of these are going to be time and energy consuming.", "I expect that any assignment or exam you submit in this course will be your own product and follows the collaboration and external resources policies specified earlier in this course outline.", "Intellectual property includes items such as:"]}, {"course_id": 37, "course_code": "CS 487", "course_name": "CS487 - Introduction to Symbolic Computation (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Symbolic Computation Winter 2025", "10:00AM - 11:20AM MC 4020", "An introduction to the use of computers for symbolic mathematical computation, involving traditional mathematical computations such as solving linear equations (exactly), analytic differentiation and integration of functions, and analytic solution of differential equations.", "Objectives: To introduce students to how symbolic computation is done and broaden their knowledge of algorithmic techniques used to efficiently solve problems in many different algebraic and geometric settings, their limitations, and to gain a deeper understanding about symbolic algorithms and how to analyze them.", "Basic arithmetic operations with polynomials", "Polynomial Factoring (univariate, multivariate, and over finite fields as well as over the rationals)", "Multivariate Polynomial Division", "Groebner Bases", "Basic Algorithms in Group Theory", "Applications", "Algorithms for Computer Algebra The book is optional No 210.71", "Please inform the instructor to make the deadline adjustment.", "Your code is an important part of the assignment, and as such it should be readable and well-commented.", "Assignment figures and graphs should be carefully thought out and labelled to present the data and your conclusions in an effective and clear manner.", "Any code and algorithms you write should be sufficiently well documented through code comments or descriptions as to be readily understood.", "This code submission should allow the TAs to run your code if and when necessary to verify the results that your code produces.", "This could be a literature survey of a subtopic in numerical linear algebra, an empirical comparison/implementation of several related algorithms, an application of numerical linear algebra to another field, the design of a novel numerical linear algebra algorithm, or a theoretical analysis of the performance of a numerical linear algebra algorithm (new or old).", "Collaboration and Plagiarism:", "We encourage you to discuss general concepts and problems with classmates, TAs, and instructors.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Intellectual property includes items such as:", "Avoiding Academic Offenses", "Many students may be unaware of the line between acceptable and unacceptable academic behaviour, especially when discussing", "For information and tips related to academic integrity, students may", "The most severe COVID-related risks have lessened for many people, such as individuals", "With these facts in mind, one way that everyone in our class can contribute to a safer and more equitable learning environment is to stay home when you are ill and, at minimum, wear a mask if you suspect you might be contagious.", "A range of on- and off-campus resources are available"]}, {"course_id": 38, "course_code": "AMATH 331", "course_name": "AMATH331 - Applied Real Analysis (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["04:00PM - 05:20PM", "henry.shum@uwaterloo.ca", "Email: henry.shum@uwaterloo.ca", "Give mathematical definitions of limits for sequences of real numbers, vectors, and functions.", "Define open, closed, bounded, compact, and complete sets, and distinguish these concepts.", "Determine whether a vector-valued function is continuous or discontinuous .", "2.6-2.7", "Jan 27-31 Euclidean space, sequences and convergence in Rn, closed sets  1.2, 4.1-4.3 Assign 1", "Feb 24-28 Uniform continuity, normed vector spaces 5.1, 5.5, 6.1, 7.1  Midterm", "Mar 3 - 7 Normed and inner product spaces, sequences of functions 7.1, 7.2, 7.4, 8.1, 8.2", "Mar 31-Apr 4 Finite-dimensional spaces, series of functions 7.3, 7.5, 7.6, 8.4 Assign 4", "Real Analysis and Applications: Theory in Practice Available online: https://proxy.lib.uwaterloo.ca/login?url=http://dx.doi.org/10.1007/978-0-387-98098-0 No 0", "Principles of Mathematical Analysis.", "Topics covered in each assignment will be those of roughly the two weeks up to and including Monday of the week before the deadline.", "The final exam will be registrar-scheduled and in-person, if possible, with a duration of 150 minutes.", "Re-mark Request Policy", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 39, "course_code": "PMATH 331", "course_name": "PMATH331 - Applied Real Analysis (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["04:00PM - 05:20PM", "henry.shum@uwaterloo.ca", "Email: henry.shum@uwaterloo.ca", "Give mathematical definitions of limits for sequences of real numbers, vectors, and functions.", "Define open, closed, bounded, compact, and complete sets, and distinguish these concepts.", "Determine whether a vector-valued function is continuous or discontinuous .", "2.6-2.7", "Jan 27-31 Euclidean space, sequences and convergence in Rn, closed sets  1.2, 4.1-4.3 Assign 1", "Feb 24-28 Uniform continuity, normed vector spaces 5.1, 5.5, 6.1, 7.1  Midterm", "Mar 3 - 7 Normed and inner product spaces, sequences of functions 7.1, 7.2, 7.4, 8.1, 8.2", "Mar 31-Apr 4 Finite-dimensional spaces, series of functions 7.3, 7.5, 7.6, 8.4 Assign 4", "Real Analysis and Applications: Theory in Practice Available online: https://proxy.lib.uwaterloo.ca/login?url=http://dx.doi.org/10.1007/978-0-387-98098-0 No 0", "Principles of Mathematical Analysis.", "Topics covered in each assignment will be those of roughly the two weeks up to and including Monday of the week before the deadline.", "The final exam will be registrar-scheduled and in-person, if possible, with a duration of 150 minutes.", "Re-mark Request Policy", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 40, "course_code": "PMATH 333", "course_name": "PMATH333 - Introduction to Real Analysis (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Real Analysis Fall 2024", "11:30AM - 12:20PM RCH 112", "Topics discussed include the completeness properties of the reals; the density of the rationals; the topology of real n-dimensional space: open and closed sets, connectedness, compactness (by open covers), the Heine-Borel theorem, completeness; sequences in real n-dimensional space: convergence, Cauchy sequences, subsequences, the Bolzano-Weierstrass theorem; multivariable functions: limits, point-wise and uniform continuity, the extreme value theorem, uniform convergence of sequences of functions, Taylor's theorem, term-by-term differentiation of power series; integration in real n-dimensional space: Riemann integrability, Fubini's theorem for continuous functions on rectangles, term-by-term integration of power series.", "Ordered Fields", "The Riemann Integral", "Chapter 4. Sequences and Series of Functions", "Topology in Euclidean Space", "Differentiation in Euclidean Space", "Chapter 7. Jordan Content and Integration in Euclidean Space", "Course materials can be found at http://www.math.uwaterloo.ca/~snew/", "A suggested text is An Introduction to Analysis, by William Wade."]}, {"course_id": 41, "course_code": "PMATH 351", "course_name": "PMATH351 - Real Analysis (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Real Analysis Winter 2025", "09:30AM - 10:20AM RCH 301", "Email: kghare@uwaterloo.ca", "Email: nmrslavitch@uwaterloo.ca", "Email: s352lee@uwaterloo.ca", "Normed and metric spaces, open sets, continuous mappings, sequence and function spaces, completeness, contraction mappings, compactness of metric spaces, finite-dimensional normed spaces, Arzela-Ascoli theorem, existence of solutions of differential equations, Stone-Weierstrass theorem.", "Week 7: February 24 - 28 Section 3.1 - 3.2 Midterm February 28,", "Please note, you will be responsible for all material on assignments for midterms and final exams.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 42, "course_code": "AMATH 332", "course_name": "AMATH332 - Applied Complex Analysis (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Applied Complex Analysis Winter 2025", "02:30PM - 03:20PM", "Complex numbers, Cauchy-Riemann equations, analytic functions, conformal maps and applications to the solution of Laplace's equation, contour integrals, Cauchy integral formula, Taylor and Laurent expansions, residue calculus and applications.", "In the case of illness, a VIF will be required.", "If the midterm is missed, after your instructor has verified you have valid reasons for it, and has received a VIF in case of illness, the weight will be shifted to the final exam.", "If the final exam is missed, and valid reasons are found for it, together with a VIF in case of illness, a grade of INC will be given to the student as long as assignments and midterms have seen a good performance.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 43, "course_code": "PMATH 332", "course_name": "PMATH332 - Applied Complex Analysis (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Applied Complex Analysis Winter 2025", "02:30PM - 03:20PM", "Complex numbers, Cauchy-Riemann equations, analytic functions, conformal maps and applications to the solution of Laplace's equation, contour integrals, Cauchy integral formula, Taylor and Laurent expansions, residue calculus and applications.", "In the case of illness, a VIF will be required.", "If the midterm is missed, after your instructor has verified you have valid reasons for it, and has received a VIF in case of illness, the weight will be shifted to the final exam.", "If the final exam is missed, and valid reasons are found for it, together with a VIF in case of illness, a grade of INC will be given to the student as long as assignments and midterms have seen a good performance.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 44, "course_code": "PMATH 352", "course_name": "PMATH352 - Complex Analysis (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Complex Analysis Winter 2025", "Complex numbers provide the natural setting in which to study differentiable functions.", "Cauchy's theorem plays a central role in this subject, and many important results follow from it: Cauchy's integral formula, the theory of Taylor and Laurent series, Cauchy's residue theorem, the argument principle, the fundamental theorem of algebra, the maximum modulus theorem, Mittag-Lefler expansions, and Weierstrass products.", "We’ll start the course with a basic review of complex numbers, and the complex exponential and logarithm, complex analytic functions, and make our way towards Cauchy's theorem and its wonderful consequences.", "My lectures will draw on a number of books and sources, but I recommend Knopp's Elements of the Theory of Functions, and his Theory of Functions Parts I and II.", "Another reference is Marsden and Hoffman's Basic Complex Analysis.", "3) analytic functions, Cauchy Riemann equations", "6) complex integration", "8) Cauchy's Integral Formulas"]}, {"course_id": 45, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 46, "course_code": "MATH 247", "course_name": "MATH247 - Calculus 3 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Topology on RN: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. (~3 weeks)", "Differentiation: partial differentiability, differentiability, chain rule, [midterm likely here], Taylor polynomials, extreme value problems. (~4 weeks)", "Integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. (~3 weeks)", "Local properties of continuously differentiable functions:  open mapping theorem, inverse function theorem, implicit function theorem. (~2 weeks)", "11:30AM - 12:20PM QNC 2501", "Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem.", "Topology of real n-dimensional space: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. Differential calculus on multivariable functions: partial differentiability, differentiability, chain rule, Taylor polynomials, extreme value problems. Riemann integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem."]}, {"course_id": 47, "course_code": "PMATH 334", "course_name": "PMATH334 - Introduction to Rings and Fields with Applications (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM MC 4041", "This course provides an introduction to the fundamental algebraic structures of rings and fields, with an emphasis on their properties and applications.", "Topics include polynomial rings, field extensions, and their connections to areas such as number theory and geometry.", "Memerize fundamental concepts of algebraic structures, including groups, rings, integral domains, fields, vector space, etc.", "Analyze structures of rings and fields using homomorphisms.", "Analyze and identify reducibility of a polynomial over a field", "Understand field extension and be able to construct extension fields", "Understand some standard algebra proof techniques.", "Week 3 Integral Domains and Fields Chapter 3", "Week 9 Unique Factorization Domains, Divisibility in Polynomial Rings Chapter 6, 7", "Week 12 Extension Fields Chapter 9", "Week 13 Straight-edge and Compasses Constructions  Chapter 10", "Evaluation", "While collaboration in understanding the material is encouraged, the work submitted must be your own, written independently.", "For example, submitting 60 minutes late will result in a maximum possible score of 40%, assuming a perfect score.", "Calculators and reference sheet are not permitted during these assessments.", "Accommodation Requests", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as reading and writing proofs.", "Library for research-based assignments"]}, {"course_id": 48, "course_code": "PMATH 348", "course_name": "PMATH348 - Fields and Galois Theory (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Fields and Galois Theory Winter 2025", "08:30AM - 09:20AM", "Fields, algebraic and transcendental extensions, minimal polynomials, splitting fields, and the structure of finite fields.", "Solvable groups and the insolvability of the quintic.", "fields, algebraic and transcendental extensions, minimal polynomials, splitting fields, finite fields, separable polynomials", "Since quizzes are timed assessments, it is important to know the contents well before taking them.", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 49, "course_code": "PMATH 340", "course_name": "PMATH340 - Elementary Number Theory (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "09:30AM - 10:20AM MC 4060", "Office hour: Wednesday, 1:00pm - 2:00pm", "Solve linear diophantine equations", "Compute continued fraction expansions of rational numbers", "Convince their friends and family that number theory is excellent", "A Friendly Introduction to Number Theory (by Silverman)", "Scheme 2 - Available if you sit all 3 quizzes and score above 75% in each of them.", "A1 - 24th", "A2 - 7th Feb", "A4 - 14th Mar", "Q1 - 31st", "Q2 - 7th Mar", "There will be no midterms!", "In case of a missed assessment, you should notify your instructor via email within 24 hours of the assessment's completion/due date in order to receive an accommodation.", "Notice of Recording"]}, {"course_id": 51, "course_code": "PMATH 441", "course_name": "PMATH441 - Algebraic Number Theory (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["03:30PM - 04:20PM", "Rings of integers, Dedekind domains, and unique factorization of ideals", "Computing the ring of integers in number field", "The Splitting of primes", "Cyclotomic Fields", "However, I will follow closely the first three chapters of the following course notes:", "Presentation: Students who take PMATH741 are asked to choose one question from practice problems to give a short presentation at some point towards the end of the term."]}, {"course_id": 0, "course_code": "CS 230", "course_name": "CS230 - Introduction to Computers and Computer Systems (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computers and Computer Systems Winter 2025", "08:30AM - 09:50AM MC 1085", "10:00AM - 11:20AM MC 2065", "10:30AM - 11:20AM MC 4045", "11:30AM - 12:20PM MC 2017", "MC6228", "TBA", "cs230@uwaterloo.ca", "TBA", "TBA", "An introduction to hardware and software concepts used in computer systems.", "Specific topics include machine-level programming, memory organization, and basic I/O mechanisms.", "Build and Execute", "Program in assembly language", "Understand the basics of machine internals", "Understand the basic elements of the compilation cycle", "Understand the basic principles of multiprocessing", "Note: Submissions for programming questions should only use code and concepts taught during lectures.", "Use of code or advanced concepts not taught in the course will be viewed as a possible violation of Academic Integrity for passing off someone else's work as your own.", "The assignments have a flexible late-day system detailed here:", "These cannot be used on quizzes.", "Multiple assignment extensions can be used on one assignment and/or split across different assignments.", "You do not need a reason to use assignment extensions, you may use them as you please.", "These servers are shared with all other CS courses.", "Students are expected to start assignments early in case something unexpected occurs closer to the deadline.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 1, "course_code": "CS 234", "course_name": "CS234 - Data Types and Structures (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Data Types and Structures Fall 2024", "MarkUs problems Email IAs at the course account", "Microsoft Teams problems Email ISG Coordinator Scott King", "Missed assignment or quiz Email ISG Coordinator Scott King", "Extenuating circumstances Email ISG Coordinator Scott King", "Error in mark entry Email IAs at the course account", "ISG Coordinator", "Introduction to commonly used data types, including lists, sets, mappings, and trees.", "This course introduces widely used and effective methods of data organization, focusing on data structures, their algorithms, and the performance of these algorithms.", "Students who successfully complete the course can use these tools to design and develop efficient programs for a wide variety of applications.", "Audience", "Students wishing to understand how choices made in program design can significantly affect performance and how to make these choices", "Highly recommended for students in Information Management and similar fields and for those in the Mathematics/Teaching plan", "The initial topics in CS 234 will present some material new to those coming out of CS 116 (but covered in CS 136) and some material new to those coming out of CS 136 (but covered in CS 116).", "Co-requisites: None", "Rance D. Neśaise, Data Structures and Algorithms Using Python, Wiley, 2010", "Describe basic quadratic sorting algorithms, such as Selection Sort or Insertion Sort.", "Given a simple, well-specified computational task, write a program in a high-level imperative language (e.g., Python, C, or Java) and generate appropriate test cases.", "Use as appropriate simple types, built-in compound types and control idioms, such as selection, iteration, and recursion.", "Explain the benefits of using abstract data types (ADTs) and data structures, and more generally, the concepts of modularity and data hiding, in solving problems in a wide variety of application areas.", "Understand the differing points of view of the user and provider of an ADT and the use of an interface to communicate between views.", "Explain and use the concepts of asymptotic running time, order notation, worst-case, average-case, and best-case complexity, and lower and upper bounds.", "Given a simple algorithm written in pseudocode, determine and informally justify its asymptotic running time, as expressed in order notation.", "Explain the basic structure of memory, including the distinction between external and internal memory and the concept of paging.", "Explain the complexity of some common implementations of these ADTs.", "Given a well-specified computational problem, determine which (if any) ADTs would be suitable.", "Explain how specialized data structures can lead to efficient solutions to specific real-world problems.", "Topics: User and provider viewpoints, planning and coding stages, abstract data types, modularity and data hiding, ADT Multiset, pseudocode, memory model", "Topics: Best, worst, and average-case running times, order notation, algorithm analysis", "Topics: Graph terminology, ADT Undirected Graph, ADT Directed Graph, implementations, depth-first search, breadth-first search", "Topics: Average-case analysis, interpolation search, heuristics, hashing, bucket sort, radix sort", "Notice of Recording", "Should problems occur, your early drafts serve as backups in case of computer problems, and provide evidence of your having attempted to submit work before the deadline.", "Re-mark requests", "The subject should be \"Ax re-mark request\" for x the number of the assignment.", "In the body of the email, include the rationale for the re-mark and the parts of the question that need atttention.", "Exam policies and missed examinations", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 2, "course_code": "AMATH 242", "course_name": "AMATH242 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 3, "course_code": "CS 371", "course_name": "CS371 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 4, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 5, "course_code": "MATH 247", "course_name": "MATH247 - Calculus 3 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Topology on RN: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. (~3 weeks)", "Differentiation: partial differentiability, differentiability, chain rule, [midterm likely here], Taylor polynomials, extreme value problems. (~4 weeks)", "Integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. (~3 weeks)", "Local properties of continuously differentiable functions:  open mapping theorem, inverse function theorem, implicit function theorem. (~2 weeks)", "11:30AM - 12:20PM QNC 2501", "Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem.", "Topology of real n-dimensional space: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. Differential calculus on multivariable functions: partial differentiability, differentiability, chain rule, Taylor polynomials, extreme value problems. Riemann integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem."]}, {"course_id": 6, "course_code": "MATH 239", "course_name": "MATH239 - Introduction to Combinatorics (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics Winter 2025", "11:30AM - 12:20PM MC 4059", "09:30AM - 10:20AM MC 4021", "P. Nelson", "08:30AM - 09:20AM QNC 1502", "S. Pfannerer-Mittas", "10:30AM - 11:20AM MC 4058", "11:30AM - 12:20PM MC 4058", "09:30AM - 10:20AM MC 4042", "02:30PM - 03:20PM", "10:30AM - 11:20AM PHY 150", "04:30PM - 05:20PM", "You should have no reason to contact them directly, but you can find their email addresses through Learn.", "First name Last name", "Guilherme Zeus Dantas E Moura", "Theodore Morrison", "Matthew Kroeker", "Introduction to graph theory: colourings, matchings, connectivity, planarity.", "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.", "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 7, "course_code": "MATH 249", "course_name": "MATH249 - Introduction to Combinatorics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics (Advanced Level)", "09:30AM - 10:20AM MC 2017", "For graph theory, while we will focus on the same topics covered in MATH 239 (planarity and bipartite matching), our coverage of those topics will differ substantially in depth and in the techniques that we employ; in particular, we will see striking applications of algebra.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 8, "course_code": "AMATH 250", "course_name": "AMATH250 - Introduction to Differential Equations (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Differential Equations Winter 2025", "Solving linear differential equations: first- and second-order scalar equations and first-order vector equations.", "The main purpose of the course is to explore how first and second order differential equations (DEs) are used to model physical systems and predict their behaviour.", "first order linear DE models of compartment problems, atomic decay, and bodies in motion;", "first order separable DE models of population growth;", "a first order exact DE model of the electric dipole;", "second order linear DE models for oscillatory systems such as mass-spring-damper systems and electrical circuits;", "second order nonlinear DE models for suspended cables and rocket motion;", "linear vector DE models of multiple compartment problems and species interactions.", "Both analytical solution techniques and qualitative methods (direction field analysis, dimensional analysis, and phase portraits) will be presented as ways to gain information about system behaviour.", "We will investigate conditions for existence, uniqueness, and continuity of solutions of both first and second order initial value problems, and for systems in the plane.", "Maple will be used to generate numerical and graphical solutions, to illustrate concepts graphically, and to explore model behaviour.", "increase your comprehension of some of the many ways that differential equations can help us understand the real world;", "develop your ability to understand a mathematical model for a specific situation;", "explore analytical and qualitative solution methods for first and second order differential equations, and the use of Maple; and", "Please choose only one of the two options below.", "Submission Instructions", "Copyright Notice", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as solving differential equations.", "Library for research-based assignments"]}, {"course_id": 9, "course_code": "AMATH 251", "course_name": "AMATH251 - Introduction to Differential Equations (Advanced Level) (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Introduction to Differential Equations (Advanced Level)", "Email: cbauch@uwaterloo.ca", "Email: apunnavajhala@uwaterloo.ca", "This course offers a more theoretical treatment of differential equations and solution methods.", "In addition, emphasis will be placed on computational analysis of differential equations and on applications in science and engineering.", "Newton's enthusiasm was due to his success in using differential equations to give the first mathematical description of planetary orbits.", "Can you imagine what his reaction would be to the present widespread use of differential equations, with applications ranging from the space shuttle guidance system to epidemic models and neural networks?", "learn how to solve simple differential equations", "understand how differential equations can be applied in various fields", "We will cover portions of the following chapters from Boyce & DiPrima, in order:", "Chapter 1: Introduction to DEs", "Chapter 2: First-order differential equations", "Chapter 3: Second-order differential equations", "Chapter 7: Systems of linear equations", "Chapter 8: Numerical methods", "Chapter 9: Nonlinear differential equations and stability", "Elementary Differential Equations and Boundary Value problems.", "Assignments are to be brought to the start of lecture as a hard copy.", "Notice of Recording", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 10, "course_code": "AMATH 350", "course_name": "AMATH350 - Differential Equations for Business and Economics (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Differential Equations for Business and Economics Winter 2025", "11:30AM - 12:20PM MC 4045", "First order ordinary differential equations.", "Applications to continuous compounding and the dynamics of supply and demand.", "Higher order linear ordinary differential equations.", "Systems of linear ordinary differential equations.", "Introduction to linear partial differential equations.", "Ordinary differential equations and their applications", "Systems of linear ordinary differential equations", "Linear partial differential equations and Fourier transform", "Black-Scholes equation and solution", "(Jan 6-10) Introduction to Differential Equations (DEs), Separable Equations, Initial-Value Problems, Applications from Finance", "Dimensional Homogeneity, First-Order Linear Ordinary DEs, Use of Substitutions, Applications from Finance Chapter 2 Posting Assignment 1", "Introduction to Higher-Order Linear Equations: Theoretical Background", "Introduction to Systems of Ordinary Differential Equations, Method of Solution for Homogeneous Systems (Second Order)", "(Mar 3-7) Introduction to Partial Differential Equations, First-order Equations (Partial Integration, Method of Characteristics) Chapter 5", "Second-Order Linear PDEs: Classification, Solution by Partial Integration or Method of Characteristics Chapter 5", "Please submit your assignments early in case of unexpected technical difficulties."]}, {"course_id": 11, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 12, "course_code": "CO 255", "course_name": "CO255 - Introduction to Optimization (Advanced Level) (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Introduction to Optimization (Advanced Level)", "08:30AM - 09:50AM MC 4040", "Linear optimization: feasibility theorems, duality, the simplex algorithm.", "Know a variety of optimization algorithms, including the Simplex method, cutting plane methods, and descent methods.", "Know and apply the definition and properties of convex sets and functions.", "Write the dual of a linear programming problem and understand the properties relating the primal and dual.", "Apply optimization methods to common continuous and discrete problems including game theory, flow, scheduling, and data science.", "Linear programming, Fourier-Motzkin elimination, and Farkas's lemma.", "Duality in linear programming.", "Convex optimization and the KKT conditions.", "Discrete optimization and total unimodularity.", "Applications of total unimodularity to matching and flow problems", "Application of nonlinear optimization to data science", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course.", "If you have questions or concerns about these matters, please email mathadvisor@uwaterloo.ca."]}, {"course_id": 13, "course_code": "CS 245", "course_name": "CS245 - Logic and Computation (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Logic and Computation Winter 2025", "10:30AM - 11:20AM MC 4041", "Formalizing the notions of correct and incorrect reasoning, defining what is computable, and exploring the limits of computation.", "The course covers a variety of topics related to logic and computation that are required as background for other courses in Computer Science.", "It differs both in tone and content from a logic course one would typically find in a mathematics program.", "Develop mathematical reasoning skills", "Improve understanding of propositional and first-order logic, including key notions, such as: expressing natural language statements as logical formulas, distinguishing between correct and incorrect reasoning (between valid and invalid logical arguments), constructing a formal proof, distinguishing between syntax and semantics", "Explore the limits of computers, including decidability and undecidability", "Introduction", "Structural induction and its use in proving statements about formulas", "Adequate sets of connectives", "Soundness and completeness of formal deduction", "Applications of propositional logic to computer science, such as: Automated proofs: Resolution, Davis-Putnam Procedure; Hardware and software veriﬁcation", "First-Order Logic", "Limitations of propositional logic, and the necessity of first-order logic for reasoning about objects and properties", "Quantiﬁers, universe of discourse, translation between English and first-order logic formulas", "Syntax of first-order logic: terms, formulas", "Semantics of first-order logic: valuations", "Proving argument validity in first-order logic (semantically)", "Formal deduction in first-order logic; Proving argument validity by formal deduction (syntactically)", "Applications of first-order logic to computer science, such as: Automated theorem provers and veriﬁers; Databases", "Decidability and Peano Arithmetic", "Turing Machine as a model of computation", "Undecidability: Basic notions, undecidability of the Halting Problem and other decision problems", "The Peano axioms for number theory (including the induction axiom), undecidability of Peano Arithmetic", "An Important Application of Logic to Computer Science", "Hoare triples", "partial and total correctness", "Formalize English sentences into properly formed formulas in the propositional and first-order logic and, conversely, interpret such formulas in English", "Formalize the notion of correct reasoning and proof, and be able to construct formal proofs", "Realize the limitation of formal proof systems", "Understand the applications of logic to computer science", "This means that you must decide whether to exercise your option to submit late before the deadline, and refrain from making a partial submission in this case.", "There will be a marked quiz due in each week when there will not be a Crowdmark assignment due or a mid-term examination.", "This course includes the independent development and practice of specific skills, including writing numerous proofs using numerous abstract definitions.", "Library for research-based assignments"]}, {"course_id": 14, "course_code": "CS 245E", "course_name": "CS245E - Logic and Computation (Enriched) (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["10:00AM - 11:20AM MC 2034", "Tuesday -", "This includes:", "Basic sematic notions:", "Truth tables", "A formal proof system for Propositional logic", "Soundness and completeness theorems for the proof system", "Basic sematic notions", "Structures for a vocabulary", "Logical truths and logical implications", "Translations between FOL formulas and English and mathematical statements.", "A formal proof system for Predicate logic", "Soundness theorem for the proof system", "However, the focus of this version of the course is more on fundamental and mathematical concepts (on the expense of developing technical skills, such as designing formal proofs).", "We will use propositional logic as a main tool for demonstration key logical concepts such as", "Structural induction its justification and many applications.", "soundness and completeness theorems", "the expressive power of the logic (what can and what cannot be expressed).", "We will revisit these topics for first order logic.", "Finally, we will discuss applications of logic to computer science, in particular showing limitations of computations (undesirability)."]}, {"course_id": 15, "course_code": "PMATH 330", "course_name": "PMATH330 - Introduction to Mathematical Logic (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Mathematical Logic Winter 2025", "08:30AM - 09:20AM", "I’m a researcher in mathematical logic, so this course forms the backbone of my career.", "A broad introduction to mathematical logic.", "The notions of logical consequence and derivation are introduced in the settings of propositional and first order logic, with discussions of the completeness theorem and satisfiability", "We will spend the first half of the course covering propositional logic, with a midterm on February 14.", "We will spend the second half covering first-order logic.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 16, "course_code": "PMATH 432", "course_name": "PMATH432 - Mathematical Logic (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Mathematical Logic Fall 2024", "Pending approval, I hope to teach a graduate topics course in model theory (PMATH 930) in the Fall of 2025.", "Topics: The completeness and compactness theorems of first order logic.", "Zermelo-Fraenkel set theory and ordinals/cardinals.", "First-order languages and structures, syntactic provability and semantic truth, the soundness and completeness theorems, compactness and its consequences, elementary equivalence, the ZFC axioms of set theory, ordinals, cardinals, computability, and Gödel's incompleteness theorem."]}, {"course_id": 17, "course_code": "CS 246", "course_name": "CS246 - Object-Oriented Software Development (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Object-Oriented Software Development Winter 2025", "10:00AM - 11:20AM MC 1056", "10:30AM - 11:20AM MC 3003", "11:30AM - 12:20PM MC 3003", "Tuesday -", "Ross Evans rpevans@uwaterloo.ca", "Introduction to object-oriented programming and to tools and techniques for software development.", "Designing, coding, debugging, testing, and documenting medium-sized programs: reading specifications and designing software to implement them; selecting appropriate data structures and control structures; writing reusable code; reusing existing code; basic performance issues; debuggers; test suites.", "This course introduces students to object-oriented programming in C++ to facilitate designing, coding, debugging, testing, and documenting medium-sized programs.", "Students learn to read a specification and design software to implement it.", "Important skills are selecting appropriate data structures and control structures, writing reusable code, reusing existing code, understanding basic performance issues, developing debugging skills, and learning to test a program.", "C++", "Introduction to C++", "I/O and Strings", "Basic language constructs and Functions", "Exceptions", "Introduction to Templates", "Exception safety", "Template functions and algorithms", "Object-Oriented Programming", "UML class models", "Constructors and Destructors", "Encapsulation", "Inheritance", "Design patterns: Iterator, Observer, Decorator, Factory method, Template method, Non-virtual interface (NVI), and the Pimpl idiom", "Inheritance: vtables", "Multiple inheritance", "Design quality", "MVC (model-view-controller) architecture", "Design, implement, test, and debug C++ programs to solve problems requiring hundreds of lines of code, making appropriate use of", "types, variables, arrays, strings, and dynamic memory; loops, conditionals, and other control structures; structures, unions, and enumerations; procedures and functions; the preprocessor; formatted and unformatted I/O", "a subset of the STL, including vector, list, and map", "assertions and exceptions", "test suites for regression testing, white and black box testing", "structured programming, incremental development", "interface design, abstractions, information hiding, cohesion and coupling", "a subset of UML to specify classes, objects and relationships among them", "a selection of design patterns", "Explain the following properties of the memory model used in C++, including their impact on time and space efficiency when designing code: bytes vs. words, memory as an array, run-time stack and stack frames, memory allocation on the heap vs. automatic allocation on the stack, pointers as memory addresses, the representation of objects in memory", "You must complete A0 in order to receive marks for the rest of the course.", "A1 Basic C++ Monday, January 20 Monday, January 27 5", "A2 Introduction to OOP Monday, February 3 Monday, February 10 6", "A4 Design Patterns Monday, March 10 Monday, March 17 8", "Note: Marmoset is not a compiler!", "Do not submit C++ code to Marmoset, without first attempting to compile it yourself.", "Students from different sections can be in the same group.", "Working on a group is an important learning experience for software development in a team.", "Students in a group will be responsible for forming and managing the group.", "Please be very careful in selecting your group as there are always groups that end up having major issues every term.", "Exams", "Examination Date Final Grade Weight", "Each weekly set of problems completed succesfully can be used to replace 0.5% of the final grade from the final exam.", "In the case where both a midterm and final exam can be held, the final course grade will be calculated from the following components and weights:", "To pass the course, you must satisfy these three conditions:", "A grade of at least 45% on the weighted average of assignments A1-A4", "Assignments1to4  = (A1*5 + A2*6 + A3*6 + A4*8) / 25", "Normal = A1*5 + A2*6 + A3*6 + A4*8 + A5*15 + Midterm*20 + Final*(40-0.5*TutorialsCompleted) + 0.5*TutorialsCompleted", "if (MidtermInPerson==TRUE && FinalInPerson==TRUE)", "else", "if (MidtermInPerson==FALSE && FinalInPerson==TRUE)", "else", "if (MidtermInPerson==TRUE && FinalInPerson==FALSE)", "else", "if (MidtermInPerson==FALSE && FinalInPerson==FALSE)", "else", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 18, "course_code": "CS 246E", "course_name": "CS246E - Object-Oriented Software Development (Enriched) (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Object-Oriented Software Development (Enriched)", "Tuesday -", "CS246 description: Introduction to object-oriented programming and to tools and techniques for software development.", "Designing, coding, debugging, testing, and documenting medium-sized programs: reading specifications and designing software to implement them; selecting appropriate data structures and control structures; writing reusable code; reusing existing code; basic performance issues; debuggers; test suites.)", "functions and classes as the basic building blocks for abstractions", "function and class templates; exception safety", "object-oriented design principles; design patterns", "language features in combination", "Software library development for general client use.", "Principles of object-oriented software design.", "A selection of software design patterns.", "A1     10%", "Office hours: the list of office hours can be found at https://student.cs.uwaterloo.ca/~cs246e/F24/officehours.shtml", "Note: Marmoset is not a compiler!", "Please do not submit C++ code to Marmoset without first attempting to compile it yourself.", "The release test for a problem gives you the result of running your program on one basic test case (usually a case that appears in the assignment specification).", "So be sure to test your code thoroughly, so that you pass as many of our secret tests as possible.", "Testing", "Hand-Marking", "Note that correctly-working code is only one component of an assignment mark.", "Intellectual property includes items such as:", "CAN I POST MY CODE ONLINE?", "The second complicating factor concerns the question of who actually owns assignment solutions.", "The instructor supplies the question, a framework for the solution (including rules, guidelines, and possibly some starter code or libraries) and has in mind the general structure of what a correct solution ought to look like.", "the instructor(s) may permit posting of only those portions of assignments that were not provided as starter code;", "The instructors' policy for a given offering of a course will be stated in the course outline.", "If you wish to share your code with potential employers, and your instructor does not permit you to publicly post your solutions, you may host your code in a private repository, and provide a password to potential employers (for example, on your resume).", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 19, "course_code": "AMATH 342", "course_name": "AMATH342 - Computational Methods for Differential Equations (0.50)", "term_name": "List 2", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Computational Methods for Differential Equations Winter 2025", "10:00AM - 11:20AM PAS 2083", "An introduction to numerical methods for ordinary and partial differential equations.", "Ordinary differential equations: multistep and Runge-Kutta methods; stability and convergence; systems and stiffness; boundary value problems.", "Partial differential equations: finite difference methods for elliptic, hyperbolic and parabolic equations; stability and convergence.", "Analyze and implement numerical methods for ordinary differential equations", "Analyze and implement finite difference methods for partial differential equations", "Runge-Kutta methods: 3 weeks", "Linear multistep method: 3 weeks", "Computer Methods for Ordinary Differential Equations and Differential-Algebraic Equations.", "Numerical Solution of Partial Differential Equations.", "A first course in the numerical analysis of differential equations.", "Finite Difference Methods for Ordinary and Partial Differential Equations.", "SIAM 2007", "You can discuss problems and compare answers with your classmates.", "Do NOT email me about taking an extension unless your circumstances require a longer extension.", "Late Assignments and make-up midterm:"]}, {"course_id": 20, "course_code": "CS 475", "course_name": "CS475 - Computational Linear Algebra (0.50)", "term_name": "List 2", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Computational Linear Algebra Spring 2024", "Basic concepts and implementation of numerical linear algebra techniques and their use in solving application problems.", "Special methods for solving linear systems having special features.", "QR and SVD methods for solving least squares problems.", "Computation and uses of these decompositions in practice.", "Basic concepts and implementation of numerical linear algebra techniques and their use in solving application problems.", "Special methods for solving linear systems having special features.", "QR and SVD methods for solving least squares problems.", "Computation and uses of these decompositions in practice.", "Solving special linear systems", "Understanding least squares problems and some applications", "Numerical Linear Algebra}, L.N. Trefethen and D. Bau III, SIAM, QA184.T74, 1997 Optional No", "Iterative Methods for Sparse Linear Systems, 2nd edition}, Y. Saad, SIAM, QA188.S17, 2003 Optional No", "Applied Numerical Linear Algebra, J. Demmel, SIAM QA184.D455, 1997.", "Undergrads", "Please inform the instructor to make the deadline adjustment.", "Your code is an important part of the assignment, and as such it should be readable and well-commented.", "Assignment figures and graphs should be carefully thought out and labelled to present the data and your conclusions in an effective and clear manner.", "Any code and algorithms you write should be sufficiently well documented through code comments or descriptions as to be readily understood.", "This code submission should allow the TAs to run your code if and when necessary to verify the results that your code produces.", "This could be a literature survey of a subtopic in numerical linear algebra, an empirical comparison/implementation of several related algorithms, an application of numerical linear algebra to another field, the design of a novel numerical linear algebra algorithm, or a theoretical analysis of the performance of a numerical linear algebra algorithm (new or old).", "Collaboration and Plagiarism:", "We encourage you to discuss general concepts and problems with classmates, TAs, and instructors.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Intellectual property includes items such as:", "Avoiding Academic Offenses", "Many students may be unaware of the line between acceptable and unacceptable academic behaviour, especially when discussing", "For information and tips related to academic integrity, students may", "Your suggestions are encouraged and", "The most severe COVID-related risks have lessened for many people, such as individuals", "With these facts in", "mind, one way that everyone in our class can contribute to a safer and more equitable learning environment is to stay home when you", "are ill and, at minimum, wear a mask if you suspect you might be contagious.", "A range of on- and off-campus resources are available", "the Six Nations that includes six miles on each side of the Grand River."]}, {"course_id": 21, "course_code": "PMATH 370", "course_name": "PMATH370 - Chaos and Fractals (0.50)", "term_name": "List 2", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM QNC 1502", "E-mail: bmadill@uwaterloo.ca", "The mathematics of iterated functions, properties of discrete dynamical systems, Mandelbrot and Julia sets.", "Week of", "Iteration and Orbits", "Graphical Analysis and Fixed Points", "Bifurcations and the Cantor Set A1", "Symbolic Dynamics", "Iterated Function Systems I Midterm", "Iterated Function Systems II", "March 25*", "Guest Speakers", "Guest Speakers A4", "A First Course in Chaotic Dynamical Systems Author: Devaney Yes", "b) Assignments may be done in groups of up to 3 people."]}, {"course_id": 22, "course_code": "CO 353", "course_name": "CO353 - Computational Discrete Optimization (0.50)", "term_name": "List 2", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Computational Discrete Optimization Winter 2025", "08:30AM - 09:50AM E2 1732", "Formulations of combinatorial optimization problems, greedy algorithms, dynamic programming, branch-and-bound, cutting plane algorithms, decomposition techniques in integer programming, approximation algorithms.", "A discrete optimization problem, broadly speaking, involves a discrete set of feasible solutions and a real-valued objective function that assigns a value to each solution.", "Discrete optimization problems are of immense practical importance, are solved every day (sometimes each hour or more frequently) by many Fortune 500 companies;  well-known problems in the class include", "This course provides an introduction to the broad field of discrete optimization and covers several classes of commonly used techniques for the design of algorithms, including:", "Dynamic programming,", "We will discuss algorithmic efficiency and introduce the basics of complexity theory.", "For NP-hard problems, we will explore the field of approximation algorithms, which provides efficient methods for computing solutions with guaranteed quality.", "Students will complete two practical projects as part of the course, where they will develop, implement, and test algorithms for specific discrete optimization problems.", "formulate discrete optimization problems;", "identify and apply algorithms that can be used to solve selected discrete optimization problems;", "prove correctness of above algorithms and results related to the structures of discrete optimization problems.", "\"The Design of Approximation Algorithms\" by David Williamson, David Shmoys No", "\"Approximation Algorithms\" by Vijay Vazirani No", "\"The Design of Approximation Algorithm\" by David Williamson, David Shmoys;", "\"Approximation Algorithms\" by Vijay Vazirani.", "Each collaboration and resource used to prepare the submission should be appropriately acknowledged in the submission.", "Projects are to be done in groups of two-three.", "Submissions not following the specified format might be assessed based only on their performance and correctness of their output without providing feedback.", "In case you are not able to participate in some of the assessments please visit this webpage to submit the required information.", "Notice of Recording", "If due to changes in regulations and guidelines, it becomes impossible for us to hold in-person lectures and office hours, the lectures and office hours will be held over Zoom."]}, {"course_id": 24, "course_code": "STAT 340", "course_name": "STAT340 - Stochastic Simulation Methods (0.50)", "term_name": "List 2", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Stochastic Simulation Methods Winter 2025", "STAT 340", "10:30AM - 11:20AM MC 4045", "Office hours: Fridays, 1:00pm - 2:00pm, in M3 - 2106", "Random variate generation in the univariate and multivariate case, Monte Carlo integration, advanced computer implementation, variance reduction, statistical analysis of simulated data, extensions to challenging simulation problems.", "Mathematical treatment of the underlying stochastic concepts and proofs.", "View requirements for STAT 340", "Random variate generation in the univariate and multivariate case, Monte Carlo integration, advanced com- puter implementation, variance reduction, statistical analysis of simulated data, extensions to challenging simulation problems.", "Mathematical treatment of the underlying stochastic concepts and proofs.", "1)  Introduction to simulation and Rprogramming;", "4)  Inversion method, acceptance-rejection method, table-look up method to sample from non-uniform distributions;", "Sampling from multivariate distributions and copulas;", "7)  Monte-Carlo estimators and its properties;", "Further topics time-permitting", "iClicker Rules", "), usually a make-up examination will take place at a time mutually agreed-upon.", "To have your document considered for regrading you must formulate a request in writing by email to the instructor, providing the problem and a reason for why you believe it should be regraded.", "A mechanic encounters a problem, analyzes it, and fixes it with the tools from her/his toolbox."]}, {"course_id": 25, "course_code": "STAT 341", "course_name": "STAT341 - Computational Statistics and Data Analysis (0.50)", "term_name": "List 2", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Computational Statistics and Data Analysis Winter 2025", "04:00PM - 05:20PM", "10:00AM - 11:20AM EIT 1015", "04:30PM - 05:20PM", "Megan French", "Daniel Zhang", "While personal matters can be communicated via email, Piazza should be the primary platform for Q&A outside of class.", "A computationally focused approach to statistical reasoning in the context of real data.", "Functional programming in R and algorithms will be used to define interesting attributes of finite populations and their sampling characteristics.", "Understand the fundamentals of population-based statistical analyses, as well as implicitly/explicitly defined population attributes", "Understand the basics of sampling and the underlying ideas/mechanisms of probability sampling and related issues", "Understand the basics of inductive inference including target and study populations, measurements, comparing subpopulations, random intervals and coverage probabilities, and resampling methods such as bootstrap", "Generate high-quality visualization and inferential statistics R output for the topics above", "Prepare reports that communicate your statistical analyses using LaTeX and R Markdown.", "Jan. 6 Introduction to the course", "location and scale invariance/equivariance", "Power transformations and linear relationships", "Implicitly defined Attributes", "Solving system of equations Assignment #1", "Iteratively re-weighted least-squares", "Sampling mechanisms and inclusion probabilities", "Sampling design", "9. Mar. 3 Anatomy of tests of significance", "A t-like discrepancy measure  Assignment #2", "Mar. 10 Multiple testing", "Student-t-based intervals", "Mar. 17  Introduction to resampling methods", "Bootstrap in regression", "Multiple samples and prediction", "Decomposition of APSE, bias-variance trade-off", "Training and Test sets", "K-fold cross validation Assignment #3", "Each folder will contain five files, e.g. for section 2.1-", "There will be a 2.5-hour, closed book, cumulative final exam during the Final Examination Period: April 9 – April 25.", "An INC grade is rarely granted and will be considered on a case-by-case basis, with decisions based largely on your performance throughout the semester.", "Self-Declared COVID-19 Related Absences: You may self-declare one absence per term during the formal lecture period for influenza-like illnesses.", "Course Software: R is a language and a free statistical computing and graphics software that we will use extensively throughout the course.", "The only time you may run into trouble is if you call a function from a package to handle a task you have been asked to code out explicitly.", "For example, if you are asked to code a function that calculates the mean of a vector in R, and your solution is to just call the function mean(), then you will not receive any marks.", "Communication: When you email your instructor, make sure you include the following information in your email:", "Including non-English characters in your email (sometimes imposed by installing a non-English operating system) prompts UW servers to spam your emails for the instructor.", "These characters most often appear in (not exclusively) the subject line, From, To, and Date/Time portions of previous communications if you reply to an email.", "You must use the web-based email platform if you suspect that you have non-English characters in your emails imposed by your computer, phone, tablet, etc.", "This course includes the independent development and practice of specific skills related to computational statistics and data analysis.", "Phone: 519-884-0000 extension 213"]}, {"course_id": 26, "course_code": "AMATH 343", "course_name": "AMATH343 - Discrete Models in Applied Mathematics (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Discrete Models in Applied Mathematics Fall 2023", "Difference equations and discrete dynamical systems.", "Mathematical models are taken from ecology, biology, economics, and other fields.", "Many such systems evolve over continuous time and can be modelled by differential equations, however, there are some systems for which the evolution is more appropriately described using discrete time intervals - for example, plant and animal populations where breeding and other effects can be assumed to take place at particular times of the year.", "As with differential equations, difference equations can be classified as linear difference equations and nonlinear difference equations.", "First, we will examine linear difference equations and a number of standard methods to solve them.", "The asymptotic behaviour of nonlinear systems can be quite complicated, leading to such things as “bifurcations,” “chaos,” and “fractals.”", "A few simple models will be studied in order to understand certain aspects of this behaviour.", "We will explore the notion of “fractal dimension” as well as some simple methods of generating fractal sets.", "Time permitting, we will look at iterated function systems (IFS), a simple, yet powerful, geometric method of generating and studying fractal sets.", "Week Of", "Week Number", "Introduction to Difference Equations & Some Applications", "Linear Difference Equations", "Linear Difference Equations", "A1 Due", "Linear Difference Equations", "Nonlinear Dynamics", "Nonlinear Dynamics", "Nonlinear Dynamics", "Chaotic Systems", "A4 Due", "Chaotic Systems", "Introduction to Difference Equations, With Illustrative Examples from Economics, Psychology and Sociology, by S. Goldberg (Wiley 1958).", "An Introduction to Difference Equations, Third Edition, by S. Elaydi (Springer 2005).", "Mathematical Models in Biology, by L. Edelstein-Keshet (SIAM Press 2005).", "An Introduction to Chaotic Dynamical Systems, by R.L. Devaney (Benjamin Cummings 1989).", "Your solutions must be legible, detailed and well-organized, indicating the logic and methods used in obtaining the answer and not merely a scribble of formulas and equations.", "In fact, you may view the assignments as a guide to what you are expected to know in this course.", "MIDTERM & FINAL EXAM"]}, {"course_id": 27, "course_code": "AMATH 382", "course_name": "AMATH382 - Computational Modelling of Cellular Systems (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Computational Modelling of Cellular Systems Winter 2024", "08:30AM - 09:50AM MC 4061", "B. Ingalls", "An introduction to dynamic mathematical modeling of cellular processes.", "The emphasis is on using computational tools to investigate differential equation-based models.", "This course provides an introduction to dynamic mathematical modeling of cellular processes.", "The emphasis will be on using computational tools to investigate models of cellular phenomena.", "The course then addresses models in four biological domains: metabolic networks, signal transduction pathways, gene regulatory networks and electrophysiology.", "Intended Audience: Third and fourth year students interested in dynamic modelling in molecular cell biology.", "Software: We will be making heavy use of packages for numerical simulation of differential equations.", "Appendix C of the course notes consists of tutorials on MATLAB and XPPAUT, which is a GUI-based package for dynamical systems analysis.", "Design and simulate ordinary differential equation models of chemical reaction networks", "Investigate differential equation models using phase plane analysis, sensitivity analysis, and bifurcation analysis", "Develop and interpret differential equation models of biomolecular networks in the context of cellular metabolism, signal transduction, gene regulation, and electrophysiology", "Design and simulate stochastic models of gene regulatory networks", "Provide critical analysis of kinetic models of intracellular networks in the scientific literature and communicate their potential and limitations", "Kinetic Modelling of Biochemical Networks", "Module 3. Dynamics and Stability", "Mathematical Modeling of Systems Biology posted: https://www.math.uwaterloo.ca/~bingalls/MMSB/ Yes", "Term project will be completed in groups of two.", "Oral presentations will be in person during 20-minute time-slots scheduled during the last week of lectures (45% of project grade)", "Notice of Recording"]}, {"course_id": 28, "course_code": "AMATH 383", "course_name": "AMATH383 - Introduction to Mathematical Biology (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Mathematical Biology Winter 2025", "Email: cbauch@uwaterloo.ca", "Email: TBD", "Students develop an intuition for describing the biological world in mathematical terms, by writing down and analyzing mathematical models of biological systems.", "Students also collaborate in team projects where they are required to construct, analyze and interpret models using mathematical software packages, and present their work to the class.", "Biology prerequisites are not necessary, but knowledge of differential equations and matrix algebra is required.", "Sampling of material offered: ecology (exponential growth models, logistic growth models, predator-prey dynamics, competition models); epidemiology (compartmental models of childhood infectious diseases, influenza); microbiology (slime mold growth; cell cycles); population genetics; and physiology.", "Techniques learned will include stability analysis of discrete-time models and ordinary differential equations, phase plane methods and qualitative solutions, travelling wave solutions of partial differential equations, and use of mathematical software for modelling.", "In some populations, dynamics can be broken down into discrete stages (for instance, insects that reproduce only during a particular time of year).", "In these cases, difference equations that describe time is a discrete way are appropriate models.", "We will discuss the theory of linear and nonlinear difference equations and their applications in biology.", "We will introduce the topic of ordinary differential equation models and their formulation and analysis in the context of biological problems.", "In both parts I and II, we will emphasise how appropriate assumptions can simplify the biological problem, how important variables can be identified and how difference/differential equations can be tailored to describe the essential features of a biological process.", "After defining the problem and formulating a consistent set of equations, we will turn to the analysis of their solutions.", "Introduction to Spatially Distributed Systems, Partial Differential Equations and Other Methodologies.", "In order to analyze them it is necessary to develop models that capture spatial structure of real populations.", "Partial differential equations can provide means for modeling spatially structured biological processes.", "We will briefly introduce these methodologies and demonstrate how they can be applied to study spatio-temporal dynamics of biological phenomena.", "construct, analyze and interpret mathematical models of biological systems.", "Linear Difference Equations", "Growth Model", "Day 2: Plant population growth model", "Day 3: How to solve linear systems of", "difference equations; red blood cell model", "Nonlinear Difference Equations", "equations and cobwebbing, chaos", "difference equations", "Day 3: cheyne-stokes model, logsitic model", "stability analysis", "Nonlinear Difference Equations", "Day 2: nicholson-bailey model", "competition model", "Day 1: logistic growth ODE model", "Day 2: chemostat model", "Models", "sketching qualitative solutions", "Day 2: phase portrait for chemostat model", "interpretation of eigenvectors and", "eigenvalues", "ODEs: Epidemic Models", "Day 1: infectious disease epidemiology and Malthusean models", "Day 2: compartmental models", "Day 3: phase portrait for SIR model, herd", "reading", "ODEs: Ecological Models", "Day 1: Lotka-Volterra predator prey model", "Day 2: extensions to Lotka-Volterra model", "Models", "PDEs: Introduction to PDEs", "derivation of 1-D balance equation from", "mass conservation principles", "PDEs: PDE models", "reports and", "Mathematical Models in Biology.", "If a student misses a test for medical or compassionate reasons, no makeup test will be administered.", "Students will work in groups of 4 to construct, analyze and interpret a model of their own design.", "The project topic must be approved by the instructor, and should be relevant to biological systems.", "In particular, it should contain:", "This should briefly summarize the motivation and methods and highlight the key results.", "• Introduction: explaining background and motivating the problem of interest.", "• Methods: explain the model equations and parameter values.", "• Discussion: comment on what you have discovered and what research you think needs to be carried out in the future to make further progress on the", "I can suggest appropriate references, answer questions, and generally give you advice."]}, {"course_id": 30, "course_code": "AMATH 442", "course_name": "AMATH442 - Computational Methods for Partial Differential Equations (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Computational Methods for Partial Differential Equations Fall 2024", "04:30PM - 05:20PM", "You can find the access code under Announcements on LEARN.", "This course studies several classes of methods for the numerical solution of partial differential equations in multiple dimensions on structured and unstructured grids.", "Finite volume methods for hyperbolic conservation laws: linear and nonlinear hyperbolic systems; stability; numerical conservation.", "Finite element methods for elliptic and parabolic equations: weak forms; existence of solutions; optimal convergence; higher-order methods.", "Analyze and implement finite element methods for elliptic and parabolic partial differential equations", "Understand and implement finite volume methods for hyperbolic conservation laws", "The Mathematical Theory of Finite Element Methods, Third Edition, 2008.", "Notice of Recording"]}, {"course_id": 31, "course_code": "AMATH 455", "course_name": "AMATH455 - Control Theory (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["11:30AM -", "System theory in both time and frequency domain, state-space computations, stability, system uncertainty, loopshaping, linear quadratic regulators, and estimation.", "System theory in both time and frequency domain, state-space computations, stability, system uncertainty, loopshaping, linear quadratic regulators and estimation.", "The aim of this course is to provide a solid understanding of the mathematical foundations of control theory for linear systems.", "Topics to be covered include state space and frequency domain representations, controllability and observability, open and closed loop stability, state feedback and stabilization, detectability, observers and linear quadratic regulators.", "Both theoretical and practical aspects of the material will be addressed.", "linear systems theory,", "Applications, both in class and in the lab, will be used to illustrate and motivate the theory.", "Master state-space and frequency domain formulations of linear systems", "Investigate controllability and observability of linear time-invariant systems", "Use linearization techniques to deal with nonlinear systems", "Determine transfer functions of control systems", "Master time and frequency responses", "Investigate internal stability and stabilization of a linear system", "Investigate detectability, output feedback, and external stability of a linear system", "Investigate closed-loop stability of linear systems", "Investigate the Linear Quadratic Regulator", "Jan 29 – Feb 2  Realization & minimal realizations, poles and zeros", "Feedback Systems: An Introduction for Scientistsand Engineers.", "Linear System Theory and Design.", "Hespanha, Joao P. Linear Systems Theory.", "Please consider informing us and indicating your pronouns and preferred name.", "Library for research-based assignments"]}]