[{"course_id": 68, "course_code": "HRM 301", "course_name": "HRM301 - Strategic Human Resources Management (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["HRM 301", "HRM 301 001", "Email: wpeckham@uwaterloo.ca", "Email: c43young@uwaterloo.ca", "HRM 301:", "An examination of the issues and challenges confronted by human resource professionals when planning and forecasting the staffing needs of an organization.", "View requirements for HRM 301", "This course is of importance to those with interests in the field of human resources as well as to managers in all functional areas of an organization who need to build and develop the knowledge, skills and attitudes to effectively manage people.", "Overall, you will gain an understanding of why effective human resource practices are critical to the success of any organization and be introduced to the strategic planning role that Human Resources Professionals now play in organizations.", "Understand both external and internal factors influencing organizational strategies and the benefits of strategic planning.", "Gain a better understanding and knowledge regarding various HR topics including motivation and well-being of employees, leadership styles, restructuring, strategic HRM, culture, and various organizational designs.", "Chapters", "Determining HR Demand", "Ascertaining HR Supply", "Downsizing and Restructuring", "Mergers and Acquisitions", "HR Assessment and Analytics", "With Top Hat’s highlighting tool, you can select important keywords and sentences to save and store in your Top Hat notebook.", "Their technical support team may require specific user information when troubleshooting issues.", "You will be responsible to identify the challenge and explain why with relevant research this is seen as a challenge in today’s organizations.", "This course includes the independent development and practice of specific skills, such as research, analytical thinking, problem solving, and practical application of concepts and theories.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 69, "course_code": "INDEV 100", "course_name": "INDEV100 - Introduction to International Development (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to International Development Fall 2023", "Students obtain an overview of the multi-dimensional and transdisciplinary nature of development.", "Themes include theories and strategies of development; history of development; relevance of context (culture, economics, and politics); the impact of law and international regulatory bodies; environmental influences; urbanization; the factors of health, literacy and violence; development agencies.", "Reference is made to particular development problems in specific developing countries.", "Discriminatory and intolerant language is unacceptable, but openness about these complicated issues is encouraged using thoughtful and respectful language.", "You can expect the instructor to respond to emails within 48 hours exclusive of weekends and holidays.", "To identify and critique the history of International Development concepts, theories, actors, and institutions.", "To explain and assess key development issues in the field of International Development.", "Is International Development legitimate?", "Tentative guest speakers are also indicated in the schedule below.", "Sep 21 Colonialism and Post-Development   Haslam et al.", "Nov 24 Tutorial: The City Water Index & the multi-facetedness of development issues.", "12 Nov 28 Democracy in Development   Haslam et al.", "Introduction to International Development: Approaches, Actors, Issues and Practices.", "Participation is defined in this course as frequent and relevant contributions to in-class discussions, in the form of either questions or comments, that provide new critical insight or knowledge and foster an environment of inclusivity and respect in the classroom.", "Each quiz has 20 multiple-choice questions which cover the main concepts and ideas of the section of the curriculum.", "Do not email the instructor until you have read and completed the following.", "Please be sure to read the rubric before starting your assignment.", "your name and student number;", "**Please note that your mark can be raised, lowered, or remain the same through a re-grade**", "*", "*", "* Please submit your paper for consideration by email to the instructor no later than one week following your receipt of the decision by the TA.", "Include a formal business letter that includes the following information:", "your name and student number;", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 70, "course_code": "MSE 311", "course_name": "MSE311 - Organizational Design and Technology (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Organizational Design and Technology Winter 2025", "MSE 311", "The instructor Kenneth McKay can be reached via email kmckay@uwaterloo.", "The focus of this course is on the procedures and variables involved in the design and redesign of organizations.", "View requirements for MSE 311", "understand underlying concepts and models which help to explain the impact of technology on organizational design decisions and how these choices can impact organizational performance, short and long term", "understand organizational design in practice", "apply organizational design concepts to student situations", "understand organizational design in the current context", "Knowledge base (D) - 1d - demonstrate understanding of specialized knowledge needed to understand and design organizational structures", "Design (D) - 4a - follow an engineering design methodogy suitable for designing organizational structures", "Use of engineering tools (D) - 5a, 5b, 5c - select, modify, use suitable tools and models for designing organizational structures", "Ethics and equity (D) - 10a - identify ethical and unethical behaviour in the organizational design and use of technology such as AI", "Overview and introduction", "Organizational evolution and design dimensions", "Drivers, criteria for design decisions", "Design constraints and limitations", "Governance and oversight", "Start-ups, small organizations", "Risk management considerations", "The major concepts outlined below illustrate the strategy being used and it is expected that the final assessment scheme will be close to the descriptions below.", "The requirements and process for self-assessment will be shared in the first week.", "The specific AI usage guidelines and requirements will be shared in the first week.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 71, "course_code": "MSE 432", "course_name": "MSE432 - Production and Service Operations Management (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["Production and Service Operations Management Winter 2025", "Introduction to management, planning, and control decisions in manufacturing and service settings using quantitative approaches.", "Students are exposed to a number of examples and case studies, and work on a project that involves analysis and discussion of improved designs.", "Develop understanding of the impact of services and production operations in organizations [PA]", "Employ decision-making tools used by operations managers [", "Impact]", "Introduction to OM and Demand Forecasting (I)", "Demand Forecasting (II) and Product Design", "Capacity Planning and Process Design/Facility Layout", "Chapters 11", "Aggregate Operation Planning", "Just-in-Time Production and Project Management", "Demand Forecasting", "Capacity Planning and Process Design/Facility Layout", "Aggregate Operations Planning", "JIT & Project Management"]}, {"course_id": 72, "course_code": "STAT 231", "course_name": "STAT231 - Statistics (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "03:30PM - 04:20PM DC 1350", "02:30PM - 03:20PM", "11:30AM - 12:20PM MC 1085", "03:30PM - 04:20PM", "10:30AM - 11:20AM EIT 1015", "09:30AM - 10:20AM EIT 1015", "Email: aslynko@uwaterloo.ca", "Email: liqun.diao@uwaterloo.ca", "Email: yangjc@uwaterloo.ca", "Email: henan.xu@uwaterloo.ca", "Funmilayo Adeku", "Email: fadeku@uwaterloo.ca", "This course provides a systematic approach to empirical problem solving which will enable students to critically assess the sampling protocol and conclusions of an empirical study including the possible sources of error in the study and whether evidence of a causal relationship can be reasonably concluded.", "The connection between the attributes of a population and the parameters in the named distributions covered in STAT230 will be emphasized.", "Numerical and graphical techniques for summarizing data and checking the fit of a statistical model will be discussed.", "The method of maximum likelihood will be used to obtain point and interval estimates for the parameters of interest as well as testing hypotheses.", "The interpretation of confidence intervals and p-values will be emphasized.", "The Chi-squared and t distributions will be introduced and used to construct confidence intervals and tests of hypotheses including likelihood ratio tests.", "Contingency tables and Gaussian response models including the two sample Gaussian and simple linear regression will be used as examples.", "Course Information Webpage", "Please do not send these questions via email.", "I expect everyone to be respectful to each other, any posts that do not meet the principles in Policy 33: Ethical Behaviour will be removed.", "Email", "Please send emails from uwaterloo.ca email address and include the session number and student ID number.", "Continuity Plans", "Use numerical and graphical summaries of a data set to describe the characteristics of a variate and to check the fit of a statistical model to the data.", "Use the steps of PPDAC to identify both the objectives and possible sources of error in an empirical study, and to critically evaluate the conclusions.", "Identify the connection between attributes of a population and the parameters in the named distributions (Binomial, Poisson, Multinomial, Exponential, Normal).", "Define and use the likelihood function to obtain point estimates of the unknown parameters in a model particularly for the Binomial, Poisson, Multinomial, Exponential and Gaussian (Normal) models.", "Use a pivotal quantity to construct a confidence interval for a parameter in some specific cases, and interpret the confidence interval.", "Use the likelihood function to construct and conduct a test of hypothesis for an unknown parameter in a model.", "Interpret p-values and describe the connection with confidence intervals.", "Define the properties of the Chi-squared and t distribution.", "Define a Gaussian response model including simple linear regression; determine point and interval estimates and conduct tests of hypotheses for the parameters in a Gaussian model.", "Use a Goodness of Fit test to test the fit of a model, independence in a two-way table and equality of proportions for two or more groups", "Describe the importance of randomization and pairing in experimental design and be able to recognize whether a study design allows the researcher to conclude cause and effect.", "This learning consists of taking the time to carefully read the course notes on your own, making sure you understand the concepts and steps demonstrated in the lectures to tackle examples, and then solving the end-of-chapter problems.", "Monday", "Friday", "Welcome", "1.1 Introduction to Statistical Sciences", "1.3 Numerical Data Summaries", "1.3 Graphical Summaries", "1.4 Probability Distributions and Statistical Models", "1.5 Data Analysis and Statistical Inference", "1.6 Introduction to R and RStudio", "2.1 Choosing a Statistical Model", "2.2 Estimation of Parameters", "2.3 Method of Maximum Likelihood", "2.4 Likelihood Functions for Multinomial Models", "2.5 Invariance Property of MLE", "2.6 Checking the Model", "3.1 Planing and Conducting Empirical Studies", "3.2 Steps of PPDAC", "3.3 Case Study", "4.1 Statistical Models and Estimation", "4.2 Estimators and Sampling Distributions", "4.4 Confidence Intervals and Pivotal Quantities", "4.5 The Chi-Squared and t Distributions", "4.6 Likelihood-Based Confidence Intervals", "4.7 Confidence Intervals for Parameters in the Gaussian model", "4.7 Confidence Intervals for Parameters in the Gaussian model (Continued)", "5.1 Introduction to Hypothesis Testing", "5.2 Test of Hypotheses for Parameters in the Gaussian Model", "Relationship Between Hypothesis Testing and Confidence Intervals", "5.3 Likelihood Ratio Test of Hypothesis - One parameter", "6.1 Gaussian Response Models", "6.2 Simple Linear Regression: Maximum Likelihood and Least Squares Estimates", "Confidence Interval for Parameters in the Model", "6.3 Checking Model Assumptions and Residual Plots", "Randomization, Paring, and Experimental Design", "7.1 Likelihood Ratio Test for the Multinomial Model", "7.2 Goodness of Fit Tests", "This learning consists mostly of making sure you understand the concepts and steps that were introduced and used in class to solve examples and then solving problems from the Course Notes on your own.", "R Statistical Software", "R and the RStudio development environment can be downloaded from here.", "All assessments are proctored, in-person, and closed-book exams.", "A 2.5-hour cumulative final examination will be held during the final exam period (April 9 - 25, 2025).", "If you have a question regarding the marking of an assessment, you should first check the posted solutions on LEARN.", "First and last name", "Session number", "Please be specific and explain your rationale for a remark.", "Notice of Recording", "Short-term absence", "COVID-19-related absence", "No limits on number of submissions per term and only available during the formal lecture period", "In particular:", "Please inform us of these at the start of the course.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 73, "course_code": "STAT 333", "course_name": "STAT333 - Stochastic Processes 1 (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["11:30AM - 12:20PM DC 1350", "04:00PM - 05:20PM", "Erik Hintz: Fridays, 2:00pm - 3:00pm, in M3-2106", "Requests must be emailed to: sasugradadv@uwaterloo.ca", "Topics cover generating functions, conditional probability distributions and conditional expectation, discrete-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, applications including the random walk, the gambler's ruin problem, and the Galton-Watson branching process, an introduction to counting processes, connections between the exponential distribution and Poisson process, and non-homogeneous and compound Poisson processes.", "use moment generating functions as a tool to determine expected values and identify probability distributions of random variables;", "use the law of total expectation to calculate expected values and probabilities through the principle of conditioning;", "specify a discrete-time Markov chain (DTMC), in terms of its transition probability matrix and initial conditions, and calculate various transition probabilities;", "classify the states of a DTMC;", "define fundamental DTMC concepts including irreducibility, periodicity, and recurrence/transience;", "find limiting/stationary probability distributions for certain DTMCs through the use of the Basic Limit Theorem;", "calculate absorption probabilities and expected absorption times for DTMCs using the principle of conditioning with respect to the first transition;", "Week 11 March 24 - March 28 Chap 4: Exponential Distribution & Poisson Processes Tutorial Assignment 2", "Week 12 March 31 - April 4 Chap 4: Exponential Distribution & Poisson Processes Tutorial Test 3", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solving exercises from the Course Notes on your own.", "Introduction to Probability Models by Sheldon M. Ross (2019)"]}, {"course_id": 0, "course_code": "CHEM 120", "course_name": "CHEM120 - General Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry 1 Winter 2025", "RCH 101", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "The second part of this course is concerned with explaining periodicity and trends in chemical reactivity in terms of the electronic structure of atoms and molecules.", "Topics covered in this part of the course include the quantum theory of the hydrogen atom; electron configurations in multi-electron atoms; ionic and covalent bonding; Lewis structures, valence shell electron repulsion theory and molecular geometry; quantum mechanical bonding theories, including valence bond theory and molecular orbital theory.", "Additional topics may include an introduction to electron-transfer reactions, including the assignment of oxidation states and the balancing of oxidation-reduction reactions.", "assess the greenness of a chemical reaction using Atom Economy and E-Factor metrics.", "describe the electronic structure of atoms in terms of quantum theory using atomic orbitals and quantum numbers.", "justify the organization of the periodic table and predict trends in the properties of the elements.", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and explain molecular shape and stability in terms of electron count.", "describe the interactions of molecules in solids, liquids, and gases to compare physical and reactive properties.", "Course Structure and Continuity Plans", "No extensions will be granted for Participation Challenges, but each student can drop one participation challenge from their overall grade.", "Printed spiral bound copies of the course notes can be purchased online from the UW bookstore https://wstore.uwaterloo.ca/", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare pandemic-related illnesses on Quest (Information at this link)", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 1, "course_code": "CHEM 120L", "course_name": "CHEM120L - General Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 1 Fall 2024", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Be sure to record their name and contact information in your lab manual.", "Skillfully perform basic procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "1,3,5,7,9,11", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Sept 19 - 24", "1,3,5,7,9,11", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "1,3,5,7,9,11", "- studying cis and trans isomers", "Oct 24-29", "1,3,5,7,9,11", "Titration as an Analysis Tool", "- identify an unknown solid acid", "1,3,5,7,9,11", "Introduction to Chromatography", "- quantify a cation using ion exchange", "1,3,5,7,9,11", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 2, "course_code": "CHEM 123", "course_name": "CHEM123 - General Chemistry 2 (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry 2 Winter 2025", "09:30AM - 10:20AM STC 1012", "Introduction to chemical equilibria.", "Describe the energy and entropy changes that accompany physical and chemical changes.", "Calculate the equilibrium constant for a reaction using the standard thermodynamic properties of reactants and products.", "Predict the direction of spontaneous change for a given set of initial conditions for a variety of chemical systems.", "Apply equilibrium principles to a variety of chemical reaction types including gas-phase reactions, acid-base reactions, precipitation reactions, complexation reactions and redox reactions.", "Analyze oxidation-reduction reactions and identify species being oxidized and reduced.", "Explain the basic construction of, uses of, and the differences between galvanic and electrolytic cells.", "CHEM 120 and CHEM 123 comprise a full-year course in introductory chemistry.", "Course Structure and Continuity Plans", "Chemistry Study Hall:  Starting the 2nd week of classes, there will be a first-year study hall on Tuesdays and Thursdays at 5:30 pm - 6:50 pm in STC 1012.", "You can attend as many Study Hall Sessions as you would like - grab your friends and connect with your TAs!", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 3, "course_code": "CHEM 123L", "course_name": "CHEM123L - General Chemistry Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 2 Winter 2025", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- a real life analysis", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 4, "course_code": "CHEM 237", "course_name": "CHEM237 - Introductory Biochemistry (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:20AM", "RCH 101", "10:30AM - 11:20AM RCH 101", "ESC 227", "Structure and properties of proteins and enzymes.", "develop a molecular level understanding of biological processes to achieve this the following learning outcomes will be", "in both qualitative and quantitative examples", "evaluate unknown thermodynamic parameters from given values of others.", "I equilibrium constants from standard free energy changes.", "qualitatively describe the composition of solutions of a weak acid or base as a function of pH.", "calculate the precise", "recognize the 20 amino acids that are commonly found in proteins and identify compounds derived from them", "calculate the charge on an amino acid side chain as a function of pH", "know the 4 levels of protein structure and the covalent and non covalent interactions that stabilize them", "explain how to purify proteins using the physical and chemical properties of the proteins", "determine the primary sequence of a protein given the appropriate data", "understand basic chemical kinetics and the application to biological systems", "determine the mechanism of inhibition of an enzyme using", "the structure of fatty acids and membrane lipids", "the structures of cell membranes and how the fatty acid composition of those membranes affects membrane structure and fluidity", "the structure of simple sugars and polysaccharides and the chemistry of the reactions in which they participate", "Suggested supplementary reading in \"Biochemistry Free for All\".", "Biochemistry free for all: Introduction Water and Buffers, pages 34-49", "VVP chapters 3 and 4.1", "Biochemistry free for all pages 53-70", "Appendix A.1 and A.2", "Chapter 4.2 and 4.3", "Biochemistry free for all.", "pp 74-108", "Week 6  Protein folding and Introduction to hemoglobin", "Chapter 4 - Biochemistry in focus", "Biochemistry free for all pages 128-141", "first kinetics Chapter 10 then mechanisms Chapter 9", "Biochemistry free for all pages 337-362", "Biochemistry free for all pp 190-217", "Biochemistry free for all pp 222-233", "Biochemistry free for all pp 287 - 312", "Notice of Recording"]}, {"course_id": 5, "course_code": "CHEM 237L", "course_name": "CHEM237L - Introductory Biochemistry Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Natasha Evans", "ESC 238", "natasha.evans@uwaterloo.ca", "Introductions are planned during the first week.", "Dawson McLachlan a3mclachlan@uwaterloo.ca", "Ethan Piercey ekpiercey@uwaterloo.ca", "Lindsey Shivers lshivers@uwaterloo.ca", "Nicholas Williams n28williams@uwaterloo.ca", "Sean McDonald s24mcdonald@uwaterloo.ca", "Students will be guided through the process of collecting data and further proper analysis of it.", "The lab manual includes the experimental procedures, pre-lab exercises and reporting information, whereas the content on LEARN includes information related to the relative concepts being used, procedural videos and videos informing how to use the instruments in the lab.", "- Plan and recite proper biochemical techniques for (i) making biochemical solutions and (ii) separating, identifying and quantifying biochemical molecules in solution", "- Analyze and report findings from biochemistry data", "Date Experiments (for other half of the lab -Room 146-C-lockers)", "Clothing covering entirety of your legs Yes", "During your first week of labs you will be performing the first experiment of the term.", "It is preferred that you complete these quizzes PRIOR to the first week of experiments.", "In the case of a legitimate single missed laboratory period (confirmed by a VIF and approved by the instructor), the course weighting of the missed grade elements will be added to the final lab test.", "*", "Reports will be penalized a deduction of 20% for being one day late unless there is a valid reason; e.g., instructor-accepted valid VIF.", "Notice of Recording", "These meetings will be recorded and released to the students in the course.", "Students who wish to opt out of submitting electronic versions of their reports to Turnitin must notify the instructor at the beginning of the term."]}, {"course_id": 6, "course_code": "CHEM 266", "course_name": "CHEM266 - Basic Organic Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "11:30AM -", "Structure, nomenclature, and reactions of important classes of organic compounds.", "Stereochemistry and its role in reaction mechanisms.", "Name basic organic molecules", "Draw resonance structures and identify major and minor contributors", "Identify and describe the acidity and basicity of various molecules", "Draw organic molecules in three dimensions and identify the lowest and highest energy conformations", "Describe the stereochemical relationship between different molecules", "Explain chemical reactions using energy diagrams", "Understand the reactivity of a variety of molecules containing a variety of functional groups", "Molecular Modelling Kit No", "Notice of Recording"]}, {"course_id": 7, "course_code": "CHEM 266L", "course_name": "CHEM266L - Organic Chemistry Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["CHEM 266L", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "CHEM 266L 006", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Answers can be expected within 24 hours.", "Piazza is available for clarification questions but I will only provide quick answers as I prefer having longer conversations in person.", "View requirements for CHEM 266L", "Topics include acid-base chemistry, substitution reactions, Grignard reactions, liquid-liquid extraction, product isolation and purification.", "Be proficient with basic organic laboratory techniques including selecting proper glassware, measuring small and large quantities of solids and liquids, designing the setup required for simple synthetic reactions, filtration, and basic characterization.", "Understand and be able to design and execute a liquid-liquid extraction processes for the separation of ionizable acidic, ionizable basic, and non-ionizable (neutral) substances.", "Demonstrate independent thinking by answering questions in your own words, showing critical reflection beyond the initial description of observations and facts.", "Laboratory performance marks will be given by the Teaching Assistants and Lab Instructor and averaged for each in-person lab period.", "This is not directly the case; we do expect students to need a lot of clarifications when working in the lab for the first time.", "Laboratory Worksheets and Reports", "Questions similar to the pre-laboratory quizzes and reports will be used, but may be modified to be multiple choice.", "Human rights must be centered in our pedagogical practice to ensure students feel safe and respected into our instructional spaces.", "We also acknowledge that speaking of underrepresented groups in Science is a misnomer and we should speak of historically excluded persons as Black, Indigenous, Queer and Persons of Colour have contributed to chemical research since the inception of the field.", "Scheduling issues", "General Policies", "Aside from LEARN, we will use various software to facilitate the delivery of the laboratory.", "Important note: Since the manual is printed months before delivery of the lab, we may need to make corrections during the term.", "Expectation of Academic Integrity", "Be especially careful with sharing diagrams and mechanisms, as we often detect excessive collaboration when students share images.", "None-the-less all violations of academic misconduct will be dealt with be taken seriously and dealt with according to the consequences outlines in Policy 71."]}, {"course_id": 8, "course_code": "CS 100", "course_name": "CS100 - Introduction to Computing Through Applications (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Computing Through Applications Winter 2025", "Friday -", "Friday", "10:30AM - 12:20PM MC 3005", "10:30AM - 12:20PM MC 3027", "Dave Tompkins", "E-mail: dtompkins@uwaterloo.ca", "E-mail: cs100@uwaterloo.ca", "Introduction to the Internet, World Wide Web, HTML, and XML.", "Algorithms underlying the functional components of web search engines and their influence on data access.", "CS 100: Introduction to Digital Information, Computers, the Internet and Applications", "Explain the emerging computing technologies introduced in the course.", "Digital Information", "Computer + Network organization", "Dynamic web pages and web applications", "Privacy and security", "Emerging Topics", "Distributed networking and \"big data\"", "Artificial intelligence", "ChatGPT and large language models", "Social media and monetization", "A1 released", "Laptops, Devices and Software", "Library for research-based assignments"]}, {"course_id": 9, "course_code": "ECON 101", "course_name": "ECON101 - Introduction to Microeconomics (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Microeconomics Winter 2025", "ECON 101", "Email: chvandew@uwaterloo.ca", "“ECON 101” must appear in the subject line and the message must include your full name and student ID number.", "This course provides an introduction to microeconomic analysis relevant for understanding the Canadian economy.", "The behaviour of individual consumers and producers, the determination of market prices for commodities and resources, and the role of government policy in the functioning of the market system are the main topics covered.", "View requirements for ECON 101", "The course comprises the theoretical essentials of microeconomics and will serve as a prerequisite for virtually every economics class that you will endeavour to take in the future.", "understand the need for people to make choices and to work together towards overcoming the universal problem of scarcity;", "appreciate the relevance of economics in a changing world;", "apply elements of microeconomic theory to understand how consumers and producers make rational decisions;", "decompose problems into their economic parts.", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Intellectual property includes items such as:", "Please carefully read the Economics Department policy for instructions.", "Economics Department Deferred Final Exam Policy", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Applications for Accommodation", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 10, "course_code": "ECON 102", "course_name": "ECON102 - Introduction to Macroeconomics (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Macroeconomics Winter 2025", "ECON 102", "04:00PM - 05:20PM", "View requirements for ECON 102", "Describe important macroeconomic questions and goals, and explain how monetary and fiscal policy may influence economic outcomes.", "Explain and solve simple models and problems.", "Identify strengths and weaknesses of macroeconomic data, models and theories.", "I. Introduction", "Measurement, Accounting and Data", "Gross Domestic Product and the System of National Accounts.", "Inflation and Price Indices.", "Economic Frameworks", "Modelling Concepts and Model Evaluation.", "Concept of Aggregate Demand in the Goods Market.", "Trends, Cycles and Inequality", "Inequality and Poverty concepts and issues.", "Money and Inflation", "Monetary System and role of money.", "Cost of Inflation", "International Economic Concepts, Exchange Rates and Balance of Payments", "The lecture slides cover a variety of standard macroeconomic topics.", "CAUTION: the notation and even the macroeconomic models presented can vary subtly across textbooks.", "Differences in approach and thought can also help to better understand the benefits and drawbacks of different economic theory and methods.", "The format of the mid-term will be multiple-part short-answer questions.", "All deferred Final Exam requests for Economics courses are administered by the Economics Undergraduate Office.", "In order to achieve a healthy balance between work hours and personal life, there will be a finite amount of time I can dedicate to appointments and emails.", "Also know that I am here to support your learning goals, whether they be to understand a subset of the econometric tools, to pass the course, or to achieve a high grade.", "Applications for Accommodation", "Economics Department Deferred Final Exam Policy", "On campus supports", "Other on-campus supports", "Please see WUSA main web page for these and other services and clubs which may provide more specific and personalized support for specific needs.", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 11, "course_code": "ECON 221", "course_name": "ECON221 - Statistics for Economists (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Statistics for Economists Winter 2025", "ECON 221", "ECON 221 001", "08:30AM - 09:50AM HH 334", "Email: pchausse@uwaterloo.ca", "Clinic: There is a clinic to help students with ECON 211 and ECON 221 every Tuesday and Wednesday from 3:00PM to 4:30PM in HH 235.", "ECON 221:", "This course introduces students to describing economic data and drawing inferences from features of economic data.", "Starting from fundamental axioms of probability, students will learn about the calculation of probabilities of basic events and the features of random variables, the most important tool for representing the outcomes of complex economic phenomena.", "Students will describe discrete and continuous random variables via their probability distributions and summary statistics such as means and standard deviations, as well as the relationships between two random variables in terms of covariance, correlation, and simple regression models.", "The concepts of hypothesis testing and confidence intervals, and the fundamentals of statistical inference are discussed for basic features of random variables and for comparing the features of more than one random variable.", "View requirements for ECON 221", "evaluate and conduct elementary data analysis", "use probability theory to model uncertain outcomes", "conduct basic statistical inference", "Introduction (First lecture)", "Estimators and Inference on the mean: Chapter 8 of K", "Inference on the variance and the chi-square distribution: Chapter 11 of HID", "Students will submit two files: plain-English data analysis in one text file and the associated computer code used to conduct the analysis in another text file.", "Exercises will be given and reviewed.", "Economics Department Deferred Final Exam Policy", "Applications for Accommodation", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 12, "course_code": "ECON 371", "course_name": "ECON371 - Business Finance 1 (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["ECON 371", "ECON 371 001", "Office hours will be both in person and through MS Teams on a first-come-first-serve basis.", "Email: prajsic@uwaterloo.ca", "“ECON 371” must appear in the subject line and the message must include your full name and student ID number.", "The course develops both the conceptual framework and the tools required for these decisions.", "View requirements for ECON 371", "It describes major players and types of financial instruments in financial markets, and it offers the general framework of financial landscape.", "This course will describe the basics of how firms and individuals make investment decisions and how they finance their investments.", "The goal is to understand financial markets and investment strategies.", "The understanding of the most important financial problems leads to strategic planning and analytical understanding of possible solutions.", "Today’s financial decisions are critical for the successes of the businesses in the future.", "This course will help students develop skills applicable to financial decision-making processes within businesses as well as in their personal lives.", "understand the need for firms and individuals to make financial decisions and together work towards overcoming the universal problem of scarcity;", "appreciate the relevance of finance in a changing world;", "Explain why maximizing market value is the logical financial goal of the corporation", "Calculate and interpret some key measures of firm performance", "Interpret price-earnings ratios", "Calculate present and future values of streams of cash payments", "Define and understand the fundamental features and elements of stocks and bonds", "Use financial models to evaluate stocks and bonds", "Interpret the relationships between financial markets and information", "Perform interest rate conversions from APR to effective rates and vice versa", "Develop loan amortization schedules using loan terms", "Explain what a yield curve is and why short-term interest rates affect its shape", "Identify the cash flows properly attributable to a proposed new project", "Use sensitivity, scenario, and break-even analysis to evaluate the financial impact of forecasting errors", "Introduction to Business Finance:", "Corporate Finance and the Financial Manager", "Corporate Finance and the Financial Manager", "Introduction to Business Finance:", "Financial Statement Analysis", "Introduction to Business Finance:", "Financial Statement Analysis", "The Valuation Principle: The Foundation of Financial decision Making", "The Valuation Principle: The Foundation of Financial decision Making", "Bonds", "Bonds", "Fundamentals of Capital Budgeting", "Fundamentals of Capital Budgeting", "In that case, the quiz will be a mix of questions from all the chapters we covered so far.", "I will set constant weights for each student of 25% for the first midterm and 30% for the second midterm in Learn, but I will be adjusting those weights individually in my Excel sheet when calculating final grades at the end of the semester.", "The purpose of the review quizzes is to help students identify and understand key concepts covered in the lectures and in the textbook.", "Under the Training & Support tab, you will find helpful information including technical support.", "Midterms and Final Exam", "The format for midterms and the final exam will be a mix of multiple-choice questions, numerical calculation questions, and written problems.", "Missing a Midterm Due to Self-Isolation", "Please carefully read the Economics Department policy on deferred final exams for instructions.", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "Economics Department Deferred Final Exam Policy", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 13, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 14, "course_code": "MGMT 220", "course_name": "MGMT220 - Entrepreneurship and the Creative Workplace (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Email: r8mclean@uwaterloo.ca", "The first explores entrepreneurship as a key input to economic activity.", "The design of an appropriate strategy and the implementation of this strategy through appropriate controls and structure are considered in the context of the innovative firm.", "Develop entrepreneurial and intrapreneurial skills for personal and professional development.", "Apply strategic design principles to business plans.", "2. Understand and apply fundamental aspects of entrepreneurial thinking across disciplines and as a means of personal and professional development.", "3. Explain concepts, theories, and practices employed in entrepreneurship and the role entrepreneurship plays in the global economy and society.", "5. Evaluate new venture opportunities to determine their strengths, weaknesses, and overall business potential.", "Sept 11: Entrepreneurship & economic activity", "Sept 16: Finding Opportunities & Blue Oceans", "Week Five – Financial Requirements and Market Feasibility", "Week Ten – Business Plans and Business Models", "Week Eleven – Existing Business Models", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page."]}, {"course_id": 15, "course_code": "SCBUS 122", "course_name": "SCBUS122 - Management of Business Organizations (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Ghajaa Senthilkumaran - g3senthilkumaran@uwaterloo.ca", "Be sure to mark your section number and name in the Subject line.", "This course introduces and applies common tools used by managers such as the Business Model Canvas and frameworks like Decision Making and Project Management models.", "Managerial skills such as communication (oral and written), working in and leading teams and critical thinking will be a focus, using current events and real life scenarios in business and organizations to learn from.", "Identify the roles leaders and managers play within an organization, in particular the important role of Science and Innovation in organizations", "Apply a decision making framework taking into account ethical concerns and other criteria", "General Information", "Teams should escalate quickly to Faculty if they need help resolving critical team issues.", "Students failing the final exam will receive a maximum grade of 45%", "Notice of Recording", "It is not appropriate to attend a session you are not enrolled in, without talking to the instructor first", "You can self-declare an absence on Quest in certain situations.", "The dates affected and degree of incapacitation will be used to determine follow-up action.", "Offenses include the following:", "Avoidance of Academic Offenses", "All students are expected to know what constitutes an academic offense and thereby avoid committing them by doing the following:", "Resolution of Academic Offenses", "Instructors must notify the Associate Dean of the infraction in writing with all supporting evidence.", "Copyright Information", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline).", "Intellectual property includes items such as:", "Writing and Communication specialists offer one-on- one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "Phone: 519-884-0000 extension 213"]}, {"course_id": 16, "course_code": "SCBUS 123", "course_name": "SCBUS123 - Workshop 1: Science and Business (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["03:30PM - 04:20PM", "Email: kmemon@uwaterloo.ca; https://www.linkedin.com/in/kashifmemon/", "This workshop addresses concepts of technology development and related marketing aspects that undertake an analysis of a firm's existence, its physical and/or social media presence, and customer feedback.", "Students work in collaborative teams to tackle case studies and class exercises.", "This involves conducting a PESTLE and SWOT analysis, market planning, information retrieval strategies, scientific business forecasting, competitive intelligence, and product development.", "In this introductory Business Development Workshop, you will learn how to go about understanding and generating business development ideas.", "Through the development of a full-fledged marketing plan for your product or service you will participate in the planning and preparation of your own Business Development Strategy.", "You will consider the overall impact this change will have on your development as a Science and Business student.", "Remember that every time you promote your product the first question asked is do you have a strategy?", "This course will be the first step in developing a strategic plan.", "The Product", "3. Define Product and Marketing:", "4. Strategic Planning: SWOT Analysis", "Measuring your product’s demand: Market Demand", "Analyze business behaviour and business markets", "Selecting Target Markets", "Positioning your product over the life cycle", "Manage your Product", "Manage Channels", "This means you will act and communicate professionally, as you will with co-workers.", "Work professionally in groups and contribute to the group objectives and product.", "Deliverables", "Participation in class discussions is required and will be graded using the criteria outlined below in table – A. Marks for contribution to class discussions will be based on how well your comments relate to key concepts in the course.", "Please ask students to complete the absence declaration form in Quest in lieu of email request to yourself or a conversation.", "Student makes regular high-quality contribution", "relates the issues under discussion to key concepts in the", "understanding of topics but does not relate the issues", "under discussion to key concepts in the course.", "name tag displayed in majority of classes.", "relate issues under discussion to key concepts in the", "Very minimal contribution to class discussions, MS TEAMS", "No contribution to class discussions, MS TEAMS group", "Surprise Product/Service and Analysis Presentation 10%", "It contains very important on responsibilities of each team member within the project.", "Bring and display a name tag during all in-person sessions.", "If this might be the case for you, please clarify with myself and the course TA’s by email at the beginning of term so we can be sure to attribute your marks to you.", "Excuses such as “I was not comfortable in reporting the member that did not want to work” are not acceptable and will result in poor marks for the entire group.", "It is the responsibility of each member to report non-contributing members early on.", "As individual team members, your responsibilities include serving as a team leader and being a team player.", "To help your group define a clear understanding of responsibilities, each group will prepare a group contract at the beginning of term.", "A fragmented or disjointed submission assignment created by a group working primarily in isolation will most likely be obvious and of poor quality leading to a poor grade.", "Note: Missing APA citations, in-text or full references list page, missing correspondence between in-text citations and reference section, and missing APA formatting will result in a mark of zero out of THE TOTAL MARK in the assignment.", "THE ONE AND ONLY EXCEPTION", "Please refer to in-text citation, reference list, general formatting and sample paper and other tabs as needed for 7th edition APA citation and formatting guidelines.", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline).", "Re-creating test questions and answers without the express permission of the course instructor", "Case Study: A Flood of Water Consumption Choices P 23", "Product/Service choice to be first come first served basis.", "P&G Segments Its Market Along Multiple Dimensions P191", "SURPRISE PRODUCT AND ANALYSIS PRESENTATION", "SURPRISE PRODUCT AND ANALYSIS PRESENTATION", "SURPRISE PRODUCT AND ANALYSIS PRESENTATION", "SURPRISE PRODUCT AND ANALYSIS PRESENTATION", "Concepts Revision and MyBusiness"]}, {"course_id": 17, "course_code": "SCBUS 223", "course_name": "SCBUS223 - Workshop 2: Strategies Behind Technological Innovation (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Workshop 2: Strategies Behind Technological Innovation Fall 2024", "03:30PM - 04:20PM MC 4021", "Students working in groups analyze real business ventures, their launch, and growth, synthesizing major field research to develop a term deliverable in the form of a company report and final project presentation.", "Students engage in experiential learning involving theory, case studies, scientific team debates, and critical reasoning.", "SCBUS 223 Strategies Behind Technological Innovation", "Email: kmemon@uwaterloo.ca; https://www.linkedin.com/in/kashifmemon/", "Email : djhaveri@uwaterloo.ca", "A warm welcome to everyone!", "Email: djhaveri@uwaterloo.ca", "Students will also organize an in-depth written and oral presentation of the results of the study, while working as a member of a team.", "It is important to recognize that there is no “best practice” to manage innovation and hence to understand the true meaning of innovation the course will be supplemented by case studies “Innovation Debates” from Harvard Business Review, specific case studies from the textbook, and class discussions.", "This means you will act and communicate professionally, as you will with co-workers.", "Work professionally in groups and contribute to the group objectives and product.", "Deliverables", "Participation in class discussions is required and will be graded using the criteria outlined below in table – A. Marks for contribution to class discussions will be based on how well your comments relate to key concepts in the course.", "This will be enforced, and attendance will not be recorded for late comers.", "Please ask students to complete the absence declaration form in Quest in lieu of email request to yourself or a conversation.", "Student makes regular high-quality contribution", "relates the issues under discussion to key concepts in the", "understanding of topics but does not relate the issues", "under discussion to key concepts in the course.", "name tag displayed in majority of classes.", "relate issues under discussion to key concepts in the", "Very minimal contribution to class discussions, MS TEAMS", "No contribution to class discussions, MS TEAMS group", "Submit the Summary of the assigned case to the Case Study Summary LEARN Dropbox by MONDAY Afternoon BY 1.00 pm each week before their presentation the next class.", "These Innovation Debates bring 2 groups against each other every week.", "It contains very important on responsibilities of each team member within the project.", "Panel Boards", "This will be enforced, and attendance will not be recorded for late comers.", "Excuses such as “I was not comfortable in reporting the member that did not want to work” are not acceptable and will result in poor marks for the entire group.", "It is the responsibility of each member to report non-contributing members early on.", "As individual team members, your responsibilities include serving as a team leader and being a team player.", "To help your group define a clear understanding of responsibilities, each group will prepare a group contract at the beginning of term.", "A fragmented or disjointed submission assignment created by a group working primarily in isolation will most likely be obvious and of poor quality leading to a poor grade.", "Note: Missing APA citations, in-text or full references list page, missing correspondence between in-text citations and reference section, and missing APA formatting will result in a mark of zero out of THE TOTAL MARK in the assignment.", "THE ONE AND ONLY EXCEPTION", "Please refer to in-text citation, reference list, general formatting and sample paper and other tabs as needed for 7th edition APA citation and formatting guidelines.", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline).", "Re-creating test questions and answers without the express permission of the course instructor", "2:30-4:20", "Company choice to be first come first served basis.", "For example, “the company promised us and backed out” or “we are trying to find a company in our field of interest are not acceptable.”", "Innovation Debate 1 – Group 1 vs. Group 2", "You Need an Innovation Strategy", "It’s the only way to make sound trade-off decisions and choose the right practices.", "Does every innovation need a “strategy”?", "innovation can survive without a strategy)", "Innovation Debate 2 – Group 3 vs. Group 4", "Turn Your Science into a Business", "Oliver Alexy", "Innovation Debate 3 – Group 5 vs. Group 6", "Lean business model", "Steve Blank", "MVP, minimum viable product” and “pivoting are key concepts in this.", "The lean startup is a bad and bankrupt philosophy for mediocre people with mediocre vision and ambition", "For example, “the company promised us and backed out” or “we are trying to find a company in our field of interest are not acceptable.”", "The information needs to be comprehensive and clear.", "successful innovations in emerging markets that", "are then exported as knowledge and", "each market has its own innovation needs/", "How Apple Organizes for Innovation", "[DJ1]wording a little confusing"]}, {"course_id": 18, "course_code": "SCBUS 225", "course_name": "SCBUS225 - Organizational Behaviour in Scientific and Technical Workplaces (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Organizational Behaviour in Scientific and Technical Workplaces Winter 2025", "Avneet Dhiman", "TBA", "This workshop uses case studies, lectures, and discussions to explore a basic understanding of how organizations work, and how people interact within organizations in order to achieve ethical human, organizational, and social objectives.", "This course considers organizational structure and models, ethics, organizational theory, organizational culture, motivation, diversity, negotiation, communication, leadership, and management, and how these principles are applied in start ups or scientific and technical environments.", "SCBUS225 explores the behavior of individuals and groups in organizations.", "The course looks at job performance and organizational commitment, explores personal behaviors and their impact, examines relational skills and finally considers organizational structure and change.", "Define, summarize, and explain the core concepts or Organizational Behaviour - Individual outcomes, Individual Characteristics and Mechanisms, Relational Mechanisms and Organizational Mechanisms", "Describe and explain the connections between Organizational Behaviour concepts", "Evaluate the workplace performance of yourself and others and be able to assess motivations, stress, personality and other OB factors to get a new desired outcome", "In", "In", "Introduction and", "Welcome and Intro to", "Personality and EI", "Stress / Decision Making", "Cultural Differences and Organizational Commitment", "Motivation", "Teams", "In-Class Individual Case Analysis", "Power, Influence and Negotiation", "Individual Case Analysis", "Peer evaluations are used because group case exercises represent a considerable portion of your overall course grade.", "During the second week of classes, you will choose a team.", "Submission Times"]}, {"course_id": 19, "course_code": "SCBUS 323", "course_name": "SCBUS323 - Workshop 3: Technology Development (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "SCBUS 323 - Technology Development Fall 2024", "The major class project focuses on the development of a business plan for a product that could be commercialized.", "View requirements for SCBUS 323", "By the end of this course, you will develop the concept and business model for your own technology-based product, and demonstrate this idea using a prototype or proof of concept.", "Identify a Business Opportunity", "Market Analysis", "Industry Analysis", "Technology Analysis", "Formulate Problem", "Stakeholders", "Ideate Solution", "Technical solution", "Business Model", "Prototype Solution", "Prototyping techniques", "User Testing", "Scaling", "Persuading users", "Synthesize trends in different industries, markets and areas of technology to identify high-impact business opportunities", "Formulate a specific technical problem that can be solved based on the synthesis", "Plan a product development cycle to develop and prototype a technology-based solution to the formulated problem", "Design a technical solution and business model that could be used to benefit from the business opportunity", "Prototype and test the concepts relevant to the proposed technical solution and business model to demonstrate their feasibility, and product-market fit", "Pitch the technology-based product to various stakeholders to persuade a funder to invest in your product, and entice users to use the product", "In addition to its own Learning Outcomes, this course integrates knowledge and concepts relevant to product design and development from your other courses.", "Working in teams (team canvas, team charter, team roles and strategies, motivation, stages of team development, conflict and crisis resolution, leadership, team norms and ways of working) - SCBUS 122", "Business models - MGM 220", "Ethical decision making (utilitarian, golden means, duties-based and rights-based ethics, ethical problem solving process) - SCBUS 122, 225", "As each group selects a unique product to develop, you will also have an opportunity to develop your lifelong learning and independent self-learning capabilities.", "Introduction", "Product Lifecycle and Development", "Identify", "Problem formulation", "Requirements and User Stories", "User Need and Empathy Map", "Service Environment", "Stakeholders", "Formulate", "Creative Problem Solving and Design Thinking", "Solution Development Process", "Idea Generation and Selection", "Design", "Technology and Innovation", "Identify", "Customer Discovery Model", "Knowing Your Business Environment", "Design", "Fundraising and Incubation", "Quantified Metrics and Risks", "Detailed Design", "Prototyping and Testing", "Scaling Up and Long Term Trends", "DFX and Broader Considerations", "Business plans and pitches", "Presentation 3: SCBUS 323 Technology Development Spotlight", "Ethics of Product Design", "Design", "Exam Period", "Assignment 3: Product Design Documentation", "Ms Teams Used as a file repository and communication tool for teams Yes", "Assignment 3: Product Design and Business Model report + investment one-pager 20%", "Presentation 3: Product Demo and Interactive Pitch 10%", "In-class activities", "Participation in each question will score you one point.", "You will be graded as follows for each in-class activity:", "Team1-week1-class_activity", "Progress Meetings and Reports", "ITP Metrics will be used for Peer Assessment.", "Understanding of concepts beyond that of the typical junior student.", "4.5", "Understanding of the concepts and their importance, along with insight into how they can be used to optimize team performance.", "A strong positive force that makes a beneficial contribution to the team, in addition to bringing out the best in other team members.", "Understanding of the concepts and their importance.", "3.5", "Understanding of the concepts and their importance.", "Understanding of the concepts and their importance, and exhibit a growth trajectory at the end of the term.", "2.5", "Understanding the concepts and their importance.", "Understanding of the concepts.", "Superficial understanding of most basic concepts.", "Superficial understanding of some concepts", "Sparse understanding of the concepts.", "No understanding of the concepts.", "The professionalism of your communications with your team,  and members of the teaching team", "Negative Behaviour - Major Infraction", "Missing team meetings without valid reason or advanced notice to the team (handled on a case by case basis)", "Any minor infraction with intent to deceive or commit fraud (handled on a case by case basis)", "Negative Behaviour - Minor Infraction", "No greeting", "Positive Behaviour", "Creativity in activities (good brainstorming, use of flip charts to keep the ideas flowing, etc)", "Receives constructive feedback well", "Gives constructive feedback well", "Exhibited a pattern of self-improvement over the course of the term", "Notice of Recording", "General Information", "Students may request a meeting in person to give evidence of the error and to explain the problem.", "Misinterpretation of a course concept", "Working in Groups", "To help your group define a clear understanding of responsibilities, each group will prepare a team charter at the beginning of the term.", "The Attribution Table should be reviewed by all of the team members prior to submission to make sure that all members agree on the information given in the table.", "If the Attribution Table indicates a substantial discrepancy in contribution (i.e. a large difference in team member contributions) then the marks assigned to individual team members for the assignment may reflect this discrepancy.", "If the instructor is convinced that there was a discrepancy in contribution (as shown in the attribution table), then the instructor will decide on a reduced mark for the team member(s) who contributed substantially less.", "A team member doing a larger share of the work WILL NEVER receive a higher mark than the team mark.", "Your Instructor can help you resolve these issues and help you, as a team, develop strategies for working successfully with each other.", "Remember: most projects do NOT fail for technical reasons; they fail because of planning and team problems.", "Firing a team member is a strategy of last resort.", "The team will issue a warning E-mail to the person informing him or her of the situation, i.e. that the person will be fired from the team unless change occurs.", "The E-mail must use a professional tone and cite specific behaviours that the person must change in order to remain part of the team and deadlines for those changes to occur.", "The goal of these meetings is to:", "This is done in a E-mail copied to the instructor.", "Quitting a team is a strategy of last resort.", "You will issue a warning E-mail to your team informing them of the situation, i.e. that you are ready to quit the team unless change occurs.", "The E-mail must use a professional tone and cite specific behaviours that the team must change in order for you to stay.", "The goal of these meetings is to:", "This is done in a E-mail copied to the instructor.", "The E-mail shall briefly cite the reasons for the departure.", "If you are ever in doubt whether something constitutes plagiarism ask a member of the teaching team.", "It is best practice to reference even public domain images where possible.", "It is unethical and illegal to give away intellectual property that does not belong to you without the permission of the owner, in this case the whole team.", "Intellectual property includes items such as:", "Writing and Communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "A list of the main services provided below:", "Good2Talk, free confidential helpline for post-secondary students - 1-866-925-5454", "KW Sexual Assault Support Centre - 519-741-8633"]}, {"course_id": 20, "course_code": "SCBUS 423", "course_name": "SCBUS423 - Workshop 4: Strategic Management of Science and Business (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["okey.igboeli@uwaterloo.ca", "Current real-world issues and problems in the strategic management of start-ups and scientific/technology companies are addressed, based on the use of publicly available information including research findings.", "Ongoing identification and implementation of new processes, service, products and/or product designs are important for growth and business viability in both established traditional companies, and entrepreneurial start-up firms.", "Strategic planning and focused implementation of strategic decisions are necessary to sustain corporate growth.", "Importance of strategic planning and implementation", "Environment analysis", "Strategic positioning and competitive advantage", "Implementing strategy", "Change management related to strategic decisions", "Explain concepts involved in strategic planning and implementation.", "Create corporate values and purpose that align with the strategic positioning of the specific firm.", "Apply critical thinking and problem-solving skills relevant to strategic planning.", "6  Chapter 11 Crossan et al  Introduction to assigned case studies", "11  Review of key concepts     Individual strategic analysis due 24 November at 11:30 pm on LEARN", "Strategic Analysis and Action Edition: 9th", "Apple Inc.", "Seso Global: Building a Blockchain-enabled Property Marketplace in Nigeria", "Marks for contribution to these discussions will be based on how well your comments relate to key concepts in the course.", "10  Student made high quality contribution to discussions, demonstrates excellent understanding of topics, relates the issues under discussion to key concepts in the course.", "8  Student demonstrated good understanding of topics, but did not relate the issues under discussion to key concepts in the course.", "6  Student made infrequent contribution to discussions and did not relate issues under discussion to key concepts in the course.", "3  Very minimal contribution to discussions; lacks understanding of key concepts.", "Individual strategic analysis assignment: Provide a comprehensive strategic analysis of the company approved for you, demonstrating use of key concepts covered in the course.", "The document will cover all key aspects of strategic planning and implementation, including potential risks involved in execution, and ways to mitigate them.", "To help your group define a clear understanding of responsibilities, each group will prepare a group contract at the beginning of the term.", "Group members may divide the responsibility for particular parts of the report as they choose and assign a part or parts to individual group members.", "In this case, I will inform you with a short email and the class will be automatically notified by the LEARN notification system, so make sure you turn it on.", "This means you will act and communicate professionally, as you will with co-workers.", "Work professionally in groups and contribute to the group objectives and product."]}, {"course_id": 21, "course_code": "AFM 123", "course_name": "AFM123 - Accounting Information for Managers (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Accounting Information for Managers Winter 2025", "AFM 123 001", "AFM 123 003", "School of Accounting and Finance (SAF) students in the Accounting and Financial Management program, please contact: SAF Academic Advisor, Undergraduate Studies", "AFM 123: View requirements for AFM 123", "Students will obtain a fundamental understanding of financial and management concepts, and an appreciation of the measurement issues and monetary impact of business decisions on communities, society and the environment.", "Topics include financial statement reporting and analysis, cost analysis, triple bottom-line reporting, corporate social responsibility including the Global Sullivan Principles, and green accounting.", "View requirements for INDEV 202", "It introduces the basic concepts and tools needed to help interpret a standard set of financial statements prepared and issued by a business enterprise.", "Prepare basic financial accounting transactions and statements and evaluate the results of basic financial statements.", "• introduction to financial accounting, forms of business ownership, and the fundamentals of business", "• financial accounting and adjusting entries", "• accounting for employee payroll", "• introduction to managerial accounting", "• cost terms, concepts and classifications", "• cost-volume-profit analysis", "• short-term decision making", "• operational and capital budgeting", "Second, you have chosen a career where verbally expressing you views, ideas and concerns will be important to your long-term success.", "Participating in the classroom with your team members and interaction with the instructor and TA’s is a great way to hone this skill.", "Employers want students who know how to be team players.", "For instance, figuring out how to launch a product in a new market is just one example.", "Or, business managers working at a hospital might have to design a strategy to reduce the cost of services while also improving the quality.", "A team should also establish processes, such as how often the team will meet, how long those meetings might be, what kind of records will be kept.", "Listening is a critical skill for being a team player.", "Students in groups should be learning from their teammates.", "They might have a solution for a team problem, but their team member might have a better one.", "Doing so will create a deeper relationship.", "You should use these opportunities to test your understanding of the material and identify where you might be confused.", "Class sessions will be a combination of lecture, problem solving and discussion.", "You are required to read the assigned reading and study the assigned problems before each class / weekly module.", "Team Projects Contribution", "A general comment like “I believe I deserve more” will be ignored.", "Your commentary must identify a specific concern with the grading on your work.", "Cross-listed courses", "For example, a AFM/ARBUS cross-list will count in a ARBUS major average, even if the course was taken under the AFM subject code.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "Library for research-based assignments", "I-clickers/Electronic Polling Tools", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 22, "course_code": "ARBUS 102", "course_name": "ARBUS102 - Accounting Information for Managers (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Accounting Information for Managers Winter 2025", "AFM 123 001", "AFM 123 003", "School of Accounting and Finance (SAF) students in the Accounting and Financial Management program, please contact: SAF Academic Advisor, Undergraduate Studies", "AFM 123: View requirements for AFM 123", "Students will obtain a fundamental understanding of financial and management concepts, and an appreciation of the measurement issues and monetary impact of business decisions on communities, society and the environment.", "Topics include financial statement reporting and analysis, cost analysis, triple bottom-line reporting, corporate social responsibility including the Global Sullivan Principles, and green accounting.", "View requirements for INDEV 202", "It introduces the basic concepts and tools needed to help interpret a standard set of financial statements prepared and issued by a business enterprise.", "Prepare basic financial accounting transactions and statements and evaluate the results of basic financial statements.", "• introduction to financial accounting, forms of business ownership, and the fundamentals of business", "• financial accounting and adjusting entries", "• accounting for employee payroll", "• introduction to managerial accounting", "• cost terms, concepts and classifications", "• cost-volume-profit analysis", "• short-term decision making", "• operational and capital budgeting", "Second, you have chosen a career where verbally expressing you views, ideas and concerns will be important to your long-term success.", "Participating in the classroom with your team members and interaction with the instructor and TA’s is a great way to hone this skill.", "Employers want students who know how to be team players.", "For instance, figuring out how to launch a product in a new market is just one example.", "Or, business managers working at a hospital might have to design a strategy to reduce the cost of services while also improving the quality.", "A team should also establish processes, such as how often the team will meet, how long those meetings might be, what kind of records will be kept.", "Listening is a critical skill for being a team player.", "Students in groups should be learning from their teammates.", "They might have a solution for a team problem, but their team member might have a better one.", "Doing so will create a deeper relationship.", "You should use these opportunities to test your understanding of the material and identify where you might be confused.", "Class sessions will be a combination of lecture, problem solving and discussion.", "You are required to read the assigned reading and study the assigned problems before each class / weekly module.", "Team Projects Contribution", "A general comment like “I believe I deserve more” will be ignored.", "Your commentary must identify a specific concern with the grading on your work.", "Cross-listed courses", "For example, a AFM/ARBUS cross-list will count in a ARBUS major average, even if the course was taken under the AFM subject code.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "Library for research-based assignments", "I-clickers/Electronic Polling Tools", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 23, "course_code": "AFM 131", "course_name": "AFM131 - Introduction to Business in North America (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Business in North America Winter 2025", "AFM 131", "Coverage also includes study of the principles of effective management and the financial system as a source of corporate capital.", "View requirements for AFM 131", "Describe the business environment and the relationships between the functional areas of business", "Write in a professional manner to effectively communicate in the appropriate context (e.g., in a discussion board)", "Demonstrate collaboration skills (i.e., understanding, respect) to work effectively in a team during discussions", "Penalties for Academic Integrity Offenses", "48 hour short-term absence", "Self-declared COVID-related absence", "Intellectual property includes items such as:", "Cross-listed courses", "Phone: 519-884-0000 extension 213", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 25, "course_code": "AFM 231", "course_name": "AFM231 - Business Law (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["07:00PM - 09:50PM", "Students can contact the course instructor via email at rhussein@uwaterloo.ca.", "Particular attention is given to the law relating to contracts and business organizations.", "AFM 231: View requirements for AFM 231", "While the course introduces you to basic concepts in law, it is designed for, and particularly emphasizes topics that will be of specific relevance to you as future business managers, owners, or even practicing professionals.", "This includes understanding the basics of legal risk so you can make more effective business decisions.", "Business managers/owners often must engage in risk management exercises.", "Appreciate the complexity of integrating multiple private law concepts into the analysis of a business situation.", "Utilize a basic framework for legal risk management assessments and generate an inventory of possible legal risk management tools.", "Describe the common as well as contrasting relationship between legal compliance and ethical conduct.", "March 24-28", "Wrap-up", "Accordingly, if students do opt to use an older edition it would be advisable to use an edition that is as close to the 8th edition as possible and consider cross-referencing it to the current edition and noting any differences.", "Completion", "The response demonstrates a clear understanding of the relevant course concepts and effectively applies these concepts to the hypothetical scenario.", "Application to Real-World Example", "The response includes an appropriate real-world example that relates to the course material, illustrating how the concept can be applied outside the context of the hypothetical.", "Students may also include a revised answer based on a similar but different set of hypothetical facts.", "For example, a student may propose one solution based on the given facts but suggest a different solution if the facts were altered.", "Students are expected to demonstrate critical thinking and clearly articulate their reasoning.", "Each quiz covers content that relates to the current course content (the current chapters and occasionally a prior chapter as well if it has not yet been part of a quiz).", "Submission Times", "Reevaluation Request", "Requests for re-evaluation of submitted material can be done via email.", "Also, students should detail what their concern as specifically as possible.", "Artificial Intelligence Tools", "Also, some evaluation elements are structured such that it may be even quicker to do it yourself than to utilize an AI tool and then further edit/revise before submission.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 26, "course_code": "LS 283", "course_name": "LS283 - Business Law (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["07:00PM - 09:50PM", "Students can contact the course instructor via email at rhussein@uwaterloo.ca.", "Particular attention is given to the law relating to contracts and business organizations.", "AFM 231: View requirements for AFM 231", "While the course introduces you to basic concepts in law, it is designed for, and particularly emphasizes topics that will be of specific relevance to you as future business managers, owners, or even practicing professionals.", "This includes understanding the basics of legal risk so you can make more effective business decisions.", "Business managers/owners often must engage in risk management exercises.", "Appreciate the complexity of integrating multiple private law concepts into the analysis of a business situation.", "Utilize a basic framework for legal risk management assessments and generate an inventory of possible legal risk management tools.", "Describe the common as well as contrasting relationship between legal compliance and ethical conduct.", "March 24-28", "Wrap-up", "Accordingly, if students do opt to use an older edition it would be advisable to use an edition that is as close to the 8th edition as possible and consider cross-referencing it to the current edition and noting any differences.", "Completion", "The response demonstrates a clear understanding of the relevant course concepts and effectively applies these concepts to the hypothetical scenario.", "Application to Real-World Example", "The response includes an appropriate real-world example that relates to the course material, illustrating how the concept can be applied outside the context of the hypothetical.", "Students may also include a revised answer based on a similar but different set of hypothetical facts.", "For example, a student may propose one solution based on the given facts but suggest a different solution if the facts were altered.", "Students are expected to demonstrate critical thinking and clearly articulate their reasoning.", "Each quiz covers content that relates to the current course content (the current chapters and occasionally a prior chapter as well if it has not yet been part of a quiz).", "Submission Times", "Reevaluation Request", "Requests for re-evaluation of submitted material can be done via email.", "Also, students should detail what their concern as specifically as possible.", "Artificial Intelligence Tools", "Also, some evaluation elements are structured such that it may be even quicker to do it yourself than to utilize an AI tool and then further edit/revise before submission.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 28, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 29, "course_code": "ACTSC 231", "course_name": "ACTSC231 - Introductory Financial Mathematics (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Financial Mathematics Winter 2025", "11:30AM - 12:20PM QNC 1502", "03:30PM - 04:20PM MC 2065", "Indicate what you've tried and where you're stuck (e.g., \"I thought the solution should be ...", "The theory of rates of interest and discount; annuities and sinking funds with practical applications to mortgage and bond questions.", "This course provides foundational tools for understanding key financial concepts, such as interest rates, annuities, loans, and bonds.", "The principles introduced are essential for performing calculations related to everyday financial matters, like determining mortgage payments or valuing investments, and they play a key role in sectors like banking, insurance, and real estate.", "By the end of the course, you will have a strong grasp of the mathematical techniques used to approach real-world financial problems, laying a foundation for further study and practical applications in finance and actuarial science.", "You can find the Actuarial Science program and plan requirements in the Undergraduate Academic Calendar.", "This course meets several requirements for SOA, CAS, and CIA designations", "It covers most SOA FM Exam learning objectives, except interest rate swaps and determinants of interest rates.", "Bonds]", "General cash flows and portfolios]", "Immunization]", "Define cash flow matching and immunization.", "Yes $89 (6-month digital license)", "We will assign problems from the textbook as practice, and completing these independently is essential for developing and self-assessing your understanding of the material.", "Exam Practice: The individual stage simulates the pressure of closed-book individual exams, preparing you for midterms and the final exam.", "Collaborative Learning: Group work enhances understanding as you learn from and explain concepts to your teammates.", "Strategies for success", "Attend all lectures: Regular attendance helps you grasp key concepts and stay on track with the material.", "A financial calculator is not required, and all questions are designed so that full marks can be achieved with a standard non-financial calculator.", "The final exam covers all topics introduced in the course.", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 30, "course_code": "AFM 333", "course_name": "AFM333 - International Business (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "AFM 333 / ARBUS 301", "AFM 333 001", "10:00AM - 11:20AM ONLN - Online", "10:00AM - 11:20AM HH 1101", "AFM 333 002", "11:30AM -", "AFM 333 003", "10:00AM - 11:20AM ONLN - Online", "10:00AM - 11:20AM HH 1101", "11:30AM -", "AFM 333 / ARBUS 301:", "AFM 333: View requirements for AFM 333", "Analyze the impact of various events in the global business and political environment", "Research and review information about the business, social and political culture of various countries", "Apply case analysis techniques to solving real world business problems by identifying symptoms and root causes, analyzing alternatives, and making recommendations backed up by persuasive evidence", "Define and discuss relevant international business concepts including globalization, comparative advantage, supply chains, and international marketing, HR and financial management", "There is a scheduled online and in class section each week.", "In general you will prepare the online lectures ahead of class.", "Your online textbook and the online lectures you will complete each week are in place of a second in person lecture.", "(Please check your spam folder first)", "The following is a guideline of how your assessment will be consolidated with the instructor’s evaluation of your “in class” contribution and will map to a range of contribution grades assigned at the end of term:", "TopHat Learning Resource & Quizzes", "(please check your spam folder first)", "These will be randomly assigned in week two and will generally include a mix both AFM and ARBUS students.", "Using your preferred online collaboration tool, your student team will prepare a 3 minute audio and/or video recording along with support PowerPoint slides which summarizes a current event article related to globalization, international business, or a core topic of the course.", "This submission should discuss the impacts or implications of the article including how it may relate to key concepts covered in the course as well as your team’s analysis and opinion on the topic.", "Teams should escalate quickly to Faculty if they need help resolving critical team issues.", "A final case examination covering all material in the course, will be scheduled during the exam period (timing TBD) and will be released and available for completion within a 24 hour period.", "Both exams are designed to be completable within a 2-3 hour period during the 24 hour window.", "Notice of Recording", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 31, "course_code": "ARBUS 301", "course_name": "ARBUS301 - International Business (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "AFM 333 / ARBUS 301", "AFM 333 001", "10:00AM - 11:20AM ONLN - Online", "10:00AM - 11:20AM HH 1101", "AFM 333 002", "11:30AM -", "AFM 333 003", "10:00AM - 11:20AM ONLN - Online", "10:00AM - 11:20AM HH 1101", "11:30AM -", "AFM 333 / ARBUS 301:", "AFM 333: View requirements for AFM 333", "Analyze the impact of various events in the global business and political environment", "Research and review information about the business, social and political culture of various countries", "Apply case analysis techniques to solving real world business problems by identifying symptoms and root causes, analyzing alternatives, and making recommendations backed up by persuasive evidence", "Define and discuss relevant international business concepts including globalization, comparative advantage, supply chains, and international marketing, HR and financial management", "There is a scheduled online and in class section each week.", "In general you will prepare the online lectures ahead of class.", "Your online textbook and the online lectures you will complete each week are in place of a second in person lecture.", "(Please check your spam folder first)", "The following is a guideline of how your assessment will be consolidated with the instructor’s evaluation of your “in class” contribution and will map to a range of contribution grades assigned at the end of term:", "TopHat Learning Resource & Quizzes", "(please check your spam folder first)", "These will be randomly assigned in week two and will generally include a mix both AFM and ARBUS students.", "Using your preferred online collaboration tool, your student team will prepare a 3 minute audio and/or video recording along with support PowerPoint slides which summarizes a current event article related to globalization, international business, or a core topic of the course.", "This submission should discuss the impacts or implications of the article including how it may relate to key concepts covered in the course as well as your team’s analysis and opinion on the topic.", "Teams should escalate quickly to Faculty if they need help resolving critical team issues.", "A final case examination covering all material in the course, will be scheduled during the exam period (timing TBD) and will be released and available for completion within a 24 hour period.", "Both exams are designed to be completable within a 2-3 hour period during the 24 hour window.", "Notice of Recording", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 32, "course_code": "BET 300", "course_name": "BET300 - Foundations of Venture Creation (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Associate Professor, Teaching Stream and Enterprise Co-op Coordinator", "Conrad School of Entrepreneurship and Business", "Email: whchang@uwaterloo.ca", "The theoretical knowledge and practical skills needed to create a successful small entrepreneurial enterprise are developed.", "Topics include definition and evaluation of entrepreneurial opportunities, business planning, funding strategies and early-stage revenue models, legal issues, and intellectual property protection.", "View requirements for BET 300", "They will gain specific knowledge and develop process skills to help them make critical decisions during the earliest stages of planning and launching their venture.", "The evidence of learning progressions will be in the form of regular weekly documentation of active experimentation and reflective observations, group workshop session summaries, presentations, reports and final assignment workbook with source references and citations demonstrating integrative learning and iterative cycles of learning progressions.", "2.Become familiar with the typical components of an entrepreneurial ecosystem, and the specific actors at U. Waterloo and in the Waterloo Region who assist start-ups.", "3.Craft a clear value proposition.", "6.Develop understanding of Problem-Solution fit and Product-Market fit.", "7.Gain experience evaluating opportunities and understanding customer needs.", "8.Identify core components of a business model, e.g. Strategyzer 9 components of Business Model Canvas", "Research and Analysis – understanding context of venture idea", "Application of Skills – identifying and applying existing relevant skills", "Mindset – developing specific mindsets", "working definitions", "peers’ cold intro’s", "Startup Ecosystem", "Think-Pair-Share", "Group workshop session BMC for YVI", "Value proposition current version", "Strategyzer template poster Business Model Canvas", "Think-Pair-Share", "Testing your Business Model & Test Cards", "Crowdsource new Test Cards", "Crowdsource new SCAMPER", "Jenni.AI user testing in the course", "Book – Business Model Generation", "Strategyzer Reference Guide called Testing your Business Model and Test Cards", "Think-Pair-Share", "Invited alumni speaker // Startup Pitch competition winners", "Assignment due Problem space research for YVI", "Startup pitch presentations structures formats", "Think-Pair-Share", "SLICC proposal & guide template", "Minimum Viable Product (MVP)", "Apple iPhone", "Apple Vision Pro", "BMC worked examples to cross-reference and create YVI BMC draft", "Think-Pair-Share", "GreenHouse Social Impact Incubator", "BMC & Social Impact Canvases", "Product-Market Fit (PMF) Framework", "YVI BMC & Impact Canvas contrast", "Think-Pair-Share", "Velocity Innovation Arena", "YVI startup pitch presentation draft", "YVI BMC testing", "YVI MVP draft attributes descriptions", "MVP Validation Guide & 24 Experiments", "YVI BMC testing", "Think-Pair-Share", "Design Sprint", "YVI BMC & MVP testing", "Think-Pair-Share", "health tech & startup network EC's", "YVI BMC & MVP testing", "Think-Pair-Share", "Worked examples SLICC final assignment Workbook & Reflection", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 33, "course_code": "ECON 211", "course_name": "ECON211 - Introduction to Mathematical Economics (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Mathematical Economics Winter 2025", "Email: r22georg@uwaterloo.ca", "An introduction to mathematical techniques of particular use in economics.", "Topics include matrix algebra, differentation, partial derivatives, optimization techniques including constrained optimization - all developed within the context of economic problems.", "View requirements for ECON 211", "use mathematics more proficiently in the context of economic analysis", "1.Sets, Functions and Graphs", "2.Limits and Continuity", "Osbourne 1.4 ‘continuous functions’", "Osbourne 1.5", "Osbourne 1.5-1.6", "Osbourne 2.1-2.5", "Multivariate Calculus topics", "6.Determinant and Definiteness of Matrices", "Osbourne 4.1-4.3", "7.Curvature of Functions of Several Variables", "Osbourne 5.1-5.3", "Optimization", "Constrained Optimization", "Constrained Optimization", "Akihito Asano, An Introduction to Mathematics for Economics Full text download available through course reserves Yes 0", "K. Sydsaeter and P.J. Hammond, Mathematics for Economic Analysis, Prentice-Hall, 1995.", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Economics Department Deferred Final Exam Policy"]}, {"course_id": 35, "course_code": "ECON 361", "course_name": "ECON361 - Cost-Benefit Analysis and Project Evaluation (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Cost-Benefit Analysis and Project Evaluation Fall 2024", "Methods for evaluating private and public projects; decision rules, efficiency conditions, and methods of conducting cost-benefit analysis.", "View requirements for ECON 361", "This course introduces the method of Cost-Benefit Analysis, which is instrumental in providing policy makers with specialized tools and information for determining the economic merits of various projects.", "Relying on basic principles of microeconomics, the course will develop a sound understanding of the main advantages and limitations of the Cost Benefit Analysis method, along with a proficiency in both assessing and conducting such analyses in practice.", "New topics include updated discussions – based on the latest research – on experimental and behavioural evidence associated with non-pecuniary effects of employment, the social discount rate in the context of climate change mitigation and adaptation, cost-effectiveness and cost-utility analysis.", "Understand the basic components of CBA, including: estimation of impacts, monetization, market and non-market valuation methods, estimation and prediction under uncertainty", "“Cost-Benefit Analysis: Concepts and Practice”, 5th Edition, Cambridge University Press, 2018.", "refers to the 5th edition!", "The assigned textbook chapters are indicated for each learning module and are mandatory reading.", "World Bank – Impact Evaluation in Practice, 2nd edition", "Cost-Benefit Analysis in World Bank’s Projects", "Library for research-based assignments", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page."]}, {"course_id": 36, "course_code": "ECON 372", "course_name": "ECON372 - Business Finance 2 (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Business Finance 2 Fall 2024", "ECON 372", "10:00AM - 11:20AM DWE 3517", "For your convenience, office hours will be both in person and through MS Teams on a first-come-first-serve basis.", "Email: prajsic@uwaterloo.ca", "“ECON 372” must appear in the subject line and the message must include your full name and student ID number.", "This course examines a number of topics relevant to financial practitioners.", "View requirements for ECON 372", "The purpose of this course is to provide students with advanced topics in corporate finance and their applications.", "The key concepts and topics to be covered include security valuation, risk and return, risk diversification, capital asset pricing model (CAPM), investment performance measurement, financial derivatives, and forecasting.", "Students will learn how to apply these concepts to real world problems using various examples and case studies.", "The course deepens the general framework of financial landscape offered in ECON 371 by discussing the role of financial instruments and institutions in the economy.", "The goal is to develop a deeper understanding of financial markets and investment strategies.", "understand the need for firms and individuals to make financial decisions and together work towards overcoming the universal problem of scarcity;", "appreciate the relevance of finance in a changing world;", "explain why maximizing market value is the logical financial goal of the corporation", "calculate and interpret some key measures of firm performance", "understand and apply the Capital Asset Pricing Model", "describe how options markets can be used to manage risk", "identify different types of debt financing available to a firm", "understand why investment decisions, rather than financing decisions, fundamentally determine the value and cost of capital of the firm", "create pro forma income statements and balance sheets.", "Introduction to Advanced Business Finance:", "Review of Key Concepts in Finance", "Review of Key Concepts in Finance", "Capital Markets and the Pricing of Risk", "Capital Markets and the Pricing of Risk", "Determining the Cost of Capital", "Determining the Cost of Capital", "Risk and the Pricing of Options", "Financial Planning and Forecasting:", "Financial Modeling and Pro Forma Analysis", "The purpose of the review quizzes is to help students identify and understand key concepts covered in the lectures and in the textbook.", "The persuasive essay assignment is supposed to incorporate theoretical aspects of the course that are communicated to a general audience with some basic background and interest in financial issues.", "Under the Training & Support tab, you will find helpful information including technical support.", "Midterms and Final Exam", "The format for midterms and the final exam will be a mix of multiple-choice questions, numerical calculation questions, and written problems.", "Missing a Midterm Due to Self-Isolation", "Please carefully read the Economics Department policy on deferred final exams for instructions.", "Intellectual property includes items such as:", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "Economics Department Deferred Final Exam Policy"]}, {"course_id": 37, "course_code": "HRM 200", "course_name": "HRM200 - Basic Human Resources Management (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Reviews the role of human resources administration in organizations and the manner in which human resources executives contribute to the well-being of a total enterprise.", "For students who are pursuing the Certified Human Resources Professional (CHRP) certification, this is a core course.", "HR policies and practices significantly impact the bottom line and an organization’s overall performance.", "The course will examine the evolution of HR from a primarily administrative function to a strategic partner and decision maker in the organization.", "Increase your understanding and appreciation of the Human Resources function and its role in an organization.", "Identify Human Resource issues facing organizations and line managers through textbook examples and real-life experiences of the instructor and develop insights on what it is like to work in the Human Resource profession.", "Readings", "Module 2: HR Technology and Designing and Analyzing Jobs Chapter 3", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Reference", "There are two written Case Applications in HRM 200 and I want to make it very clear that these written assignments are to be your own original work which means that:", "This course includes the independent development and practice of specific skills, such as Communication, Listening, Conflict Resolution, Cultural Awareness & Sensitivity, Decision Making, Employee Relations and Employment Law & Legislation.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 38, "course_code": "HRM 301", "course_name": "HRM301 - Strategic Human Resources Management (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["HRM 301", "HRM 301 001", "Email: wpeckham@uwaterloo.ca", "Email: c43young@uwaterloo.ca", "HRM 301:", "An examination of the issues and challenges confronted by human resource professionals when planning and forecasting the staffing needs of an organization.", "View requirements for HRM 301", "This course is of importance to those with interests in the field of human resources as well as to managers in all functional areas of an organization who need to build and develop the knowledge, skills and attitudes to effectively manage people.", "Overall, you will gain an understanding of why effective human resource practices are critical to the success of any organization and be introduced to the strategic planning role that Human Resources Professionals now play in organizations.", "Understand both external and internal factors influencing organizational strategies and the benefits of strategic planning.", "Gain a better understanding and knowledge regarding various HR topics including motivation and well-being of employees, leadership styles, restructuring, strategic HRM, culture, and various organizational designs.", "Chapters", "Determining HR Demand", "Ascertaining HR Supply", "Downsizing and Restructuring", "Mergers and Acquisitions", "HR Assessment and Analytics", "With Top Hat’s highlighting tool, you can select important keywords and sentences to save and store in your Top Hat notebook.", "Their technical support team may require specific user information when troubleshooting issues.", "You will be responsible to identify the challenge and explain why with relevant research this is seen as a challenge in today’s organizations.", "This course includes the independent development and practice of specific skills, such as research, analytical thinking, problem solving, and practical application of concepts and theories.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 39, "course_code": "INDEV 100", "course_name": "INDEV100 - Introduction to International Development (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to International Development Fall 2023", "Students obtain an overview of the multi-dimensional and transdisciplinary nature of development.", "Themes include theories and strategies of development; history of development; relevance of context (culture, economics, and politics); the impact of law and international regulatory bodies; environmental influences; urbanization; the factors of health, literacy and violence; development agencies.", "Reference is made to particular development problems in specific developing countries.", "Discriminatory and intolerant language is unacceptable, but openness about these complicated issues is encouraged using thoughtful and respectful language.", "You can expect the instructor to respond to emails within 48 hours exclusive of weekends and holidays.", "To identify and critique the history of International Development concepts, theories, actors, and institutions.", "To explain and assess key development issues in the field of International Development.", "Is International Development legitimate?", "Tentative guest speakers are also indicated in the schedule below.", "Sep 21 Colonialism and Post-Development   Haslam et al.", "Nov 24 Tutorial: The City Water Index & the multi-facetedness of development issues.", "12 Nov 28 Democracy in Development   Haslam et al.", "Introduction to International Development: Approaches, Actors, Issues and Practices.", "Participation is defined in this course as frequent and relevant contributions to in-class discussions, in the form of either questions or comments, that provide new critical insight or knowledge and foster an environment of inclusivity and respect in the classroom.", "Each quiz has 20 multiple-choice questions which cover the main concepts and ideas of the section of the curriculum.", "Do not email the instructor until you have read and completed the following.", "Please be sure to read the rubric before starting your assignment.", "your name and student number;", "**Please note that your mark can be raised, lowered, or remain the same through a re-grade**", "*", "*", "* Please submit your paper for consideration by email to the instructor no later than one week following your receipt of the decision by the TA.", "Include a formal business letter that includes the following information:", "your name and student number;", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 40, "course_code": "MSE 311", "course_name": "MSE311 - Organizational Design and Technology (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Organizational Design and Technology Winter 2025", "MSE 311", "The instructor Kenneth McKay can be reached via email kmckay@uwaterloo.", "The focus of this course is on the procedures and variables involved in the design and redesign of organizations.", "View requirements for MSE 311", "understand underlying concepts and models which help to explain the impact of technology on organizational design decisions and how these choices can impact organizational performance, short and long term", "understand organizational design in practice", "apply organizational design concepts to student situations", "understand organizational design in the current context", "Knowledge base (D) - 1d - demonstrate understanding of specialized knowledge needed to understand and design organizational structures", "Design (D) - 4a - follow an engineering design methodogy suitable for designing organizational structures", "Use of engineering tools (D) - 5a, 5b, 5c - select, modify, use suitable tools and models for designing organizational structures", "Ethics and equity (D) - 10a - identify ethical and unethical behaviour in the organizational design and use of technology such as AI", "Overview and introduction", "Organizational evolution and design dimensions", "Drivers, criteria for design decisions", "Design constraints and limitations", "Governance and oversight", "Start-ups, small organizations", "Risk management considerations", "The major concepts outlined below illustrate the strategy being used and it is expected that the final assessment scheme will be close to the descriptions below.", "The requirements and process for self-assessment will be shared in the first week.", "The specific AI usage guidelines and requirements will be shared in the first week.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 41, "course_code": "MSE 432", "course_name": "MSE432 - Production and Service Operations Management (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Production and Service Operations Management Winter 2025", "Introduction to management, planning, and control decisions in manufacturing and service settings using quantitative approaches.", "Students are exposed to a number of examples and case studies, and work on a project that involves analysis and discussion of improved designs.", "Develop understanding of the impact of services and production operations in organizations [PA]", "Employ decision-making tools used by operations managers [", "Impact]", "Introduction to OM and Demand Forecasting (I)", "Demand Forecasting (II) and Product Design", "Capacity Planning and Process Design/Facility Layout", "Chapters 11", "Aggregate Operation Planning", "Just-in-Time Production and Project Management", "Demand Forecasting", "Capacity Planning and Process Design/Facility Layout", "Aggregate Operations Planning", "JIT & Project Management"]}, {"course_id": 42, "course_code": "STAT 231", "course_name": "STAT231 - Statistics (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "03:30PM - 04:20PM DC 1350", "02:30PM - 03:20PM", "11:30AM - 12:20PM MC 1085", "03:30PM - 04:20PM", "10:30AM - 11:20AM EIT 1015", "09:30AM - 10:20AM EIT 1015", "Email: aslynko@uwaterloo.ca", "Email: liqun.diao@uwaterloo.ca", "Email: yangjc@uwaterloo.ca", "Email: henan.xu@uwaterloo.ca", "Funmilayo Adeku", "Email: fadeku@uwaterloo.ca", "This course provides a systematic approach to empirical problem solving which will enable students to critically assess the sampling protocol and conclusions of an empirical study including the possible sources of error in the study and whether evidence of a causal relationship can be reasonably concluded.", "The connection between the attributes of a population and the parameters in the named distributions covered in STAT230 will be emphasized.", "Numerical and graphical techniques for summarizing data and checking the fit of a statistical model will be discussed.", "The method of maximum likelihood will be used to obtain point and interval estimates for the parameters of interest as well as testing hypotheses.", "The interpretation of confidence intervals and p-values will be emphasized.", "The Chi-squared and t distributions will be introduced and used to construct confidence intervals and tests of hypotheses including likelihood ratio tests.", "Contingency tables and Gaussian response models including the two sample Gaussian and simple linear regression will be used as examples.", "Course Information Webpage", "Please do not send these questions via email.", "I expect everyone to be respectful to each other, any posts that do not meet the principles in Policy 33: Ethical Behaviour will be removed.", "Email", "Please send emails from uwaterloo.ca email address and include the session number and student ID number.", "Continuity Plans", "Use numerical and graphical summaries of a data set to describe the characteristics of a variate and to check the fit of a statistical model to the data.", "Use the steps of PPDAC to identify both the objectives and possible sources of error in an empirical study, and to critically evaluate the conclusions.", "Identify the connection between attributes of a population and the parameters in the named distributions (Binomial, Poisson, Multinomial, Exponential, Normal).", "Define and use the likelihood function to obtain point estimates of the unknown parameters in a model particularly for the Binomial, Poisson, Multinomial, Exponential and Gaussian (Normal) models.", "Use a pivotal quantity to construct a confidence interval for a parameter in some specific cases, and interpret the confidence interval.", "Use the likelihood function to construct and conduct a test of hypothesis for an unknown parameter in a model.", "Interpret p-values and describe the connection with confidence intervals.", "Define the properties of the Chi-squared and t distribution.", "Define a Gaussian response model including simple linear regression; determine point and interval estimates and conduct tests of hypotheses for the parameters in a Gaussian model.", "Use a Goodness of Fit test to test the fit of a model, independence in a two-way table and equality of proportions for two or more groups", "Describe the importance of randomization and pairing in experimental design and be able to recognize whether a study design allows the researcher to conclude cause and effect.", "This learning consists of taking the time to carefully read the course notes on your own, making sure you understand the concepts and steps demonstrated in the lectures to tackle examples, and then solving the end-of-chapter problems.", "Monday", "Friday", "Welcome", "1.1 Introduction to Statistical Sciences", "1.3 Numerical Data Summaries", "1.3 Graphical Summaries", "1.4 Probability Distributions and Statistical Models", "1.5 Data Analysis and Statistical Inference", "1.6 Introduction to R and RStudio", "2.1 Choosing a Statistical Model", "2.2 Estimation of Parameters", "2.3 Method of Maximum Likelihood", "2.4 Likelihood Functions for Multinomial Models", "2.5 Invariance Property of MLE", "2.6 Checking the Model", "3.1 Planing and Conducting Empirical Studies", "3.2 Steps of PPDAC", "3.3 Case Study", "4.1 Statistical Models and Estimation", "4.2 Estimators and Sampling Distributions", "4.4 Confidence Intervals and Pivotal Quantities", "4.5 The Chi-Squared and t Distributions", "4.6 Likelihood-Based Confidence Intervals", "4.7 Confidence Intervals for Parameters in the Gaussian model", "4.7 Confidence Intervals for Parameters in the Gaussian model (Continued)", "5.1 Introduction to Hypothesis Testing", "5.2 Test of Hypotheses for Parameters in the Gaussian Model", "Relationship Between Hypothesis Testing and Confidence Intervals", "5.3 Likelihood Ratio Test of Hypothesis - One parameter", "6.1 Gaussian Response Models", "6.2 Simple Linear Regression: Maximum Likelihood and Least Squares Estimates", "Confidence Interval for Parameters in the Model", "6.3 Checking Model Assumptions and Residual Plots", "Randomization, Paring, and Experimental Design", "7.1 Likelihood Ratio Test for the Multinomial Model", "7.2 Goodness of Fit Tests", "This learning consists mostly of making sure you understand the concepts and steps that were introduced and used in class to solve examples and then solving problems from the Course Notes on your own.", "R Statistical Software", "R and the RStudio development environment can be downloaded from here.", "All assessments are proctored, in-person, and closed-book exams.", "A 2.5-hour cumulative final examination will be held during the final exam period (April 9 - 25, 2025).", "If you have a question regarding the marking of an assessment, you should first check the posted solutions on LEARN.", "First and last name", "Session number", "Please be specific and explain your rationale for a remark.", "Notice of Recording", "Short-term absence", "COVID-19-related absence", "No limits on number of submissions per term and only available during the formal lecture period", "In particular:", "Please inform us of these at the start of the course.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 43, "course_code": "STAT 333", "course_name": "STAT333 - Stochastic Processes 1 (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["11:30AM - 12:20PM DC 1350", "04:00PM - 05:20PM", "Erik Hintz: Fridays, 2:00pm - 3:00pm, in M3-2106", "Requests must be emailed to: sasugradadv@uwaterloo.ca", "Topics cover generating functions, conditional probability distributions and conditional expectation, discrete-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, applications including the random walk, the gambler's ruin problem, and the Galton-Watson branching process, an introduction to counting processes, connections between the exponential distribution and Poisson process, and non-homogeneous and compound Poisson processes.", "use moment generating functions as a tool to determine expected values and identify probability distributions of random variables;", "use the law of total expectation to calculate expected values and probabilities through the principle of conditioning;", "specify a discrete-time Markov chain (DTMC), in terms of its transition probability matrix and initial conditions, and calculate various transition probabilities;", "classify the states of a DTMC;", "define fundamental DTMC concepts including irreducibility, periodicity, and recurrence/transience;", "find limiting/stationary probability distributions for certain DTMCs through the use of the Basic Limit Theorem;", "calculate absorption probabilities and expected absorption times for DTMCs using the principle of conditioning with respect to the first transition;", "Week 11 March 24 - March 28 Chap 4: Exponential Distribution & Poisson Processes Tutorial Assignment 2", "Week 12 March 31 - April 4 Chap 4: Exponential Distribution & Poisson Processes Tutorial Test 3", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solving exercises from the Course Notes on your own.", "Introduction to Probability Models by Sheldon M. Ross (2019)"]}, {"course_id": 0, "course_code": "CS 349", "course_name": "CS349 - User Interfaces (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["04:00PM - 05:20PM", "Please contact her in regards to any accommodations, including those for illness and short-term absences.", "Bella Chen", "Zitao Wang", "Beginning in the second week, we hold regular weekday office hours in-person and online within the CS 349 team (via Microsoft Teams).", "An introduction to contemporary user interface implementation concepts, including event abstraction, graphical components, layout, feedback, testing, accessibility, and architectures to develop user interfaces.", "Explain architectural and algorithmic details underlying current user interfaces and user interface toolkits.", "Implement user interfaces in a browser using Typescript: (1) using the HTML Canvas; (2) using HTML elements and DOM manipulation, and (3) using a modern UI web development framework", "5 Feb 3 - Feb 7 Dispatch, Layout A1", "11 Mar 24 - Mar 29 Direct Manipulation, Accessibility", "Exams", "Final, in-person tbd tbd", "It has code relating to lectures and a git submodule with the SimpleKit UI toolkit.", "See the README for details for cloning and keeping everything up to date.", "A1-A4 4 x 13% = 52%", "You should conform to the tools and versions specified in the assignment description.", "Out-of-scope Language Features", "Please review policies for Academic Integrity, Using Code from Other Sources, and Using Advanced AI Systems under Course Policies.", "You may use code examples provided in-class (i.e., in the CS349 public repo).", "You may directly use or include portions of these in-class samples in your assignments.", "You may discuss how you accomplished something in general terms with other students, but you may not directly share code.", "Self-Declared Short-term Absence", "There are no extensions beyond the maximum 48-hour late period after the original deadline.", "You can use any code from this term's offering of CS 349 without documenting it as a source.", "This includes starter code for assignments, code shown in lectures, and code from the course code repo.", "Using Advanced AI Systems", "Use of advanced AI systems to generate code (ie.", "Intellectual property includes items such as:", "All source code written by the instructor and provided in lecture, as starter code for an assignment, or in a sample code repository.", "Inclusiveness", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 1, "course_code": "CS 449", "course_name": "CS449 - Human-Computer Interaction (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Human-Computer Interaction Fall 2024", "11:30AM -", "10:00AM - 11:20AM B2 350", "11:30AM -", "10:00AM - 11:20AM B2 350", "10:00AM - 11:20AM DC 1350", "LEC - Monday 10-11:30am DC 1350", "An introduction to the fundamental theories, methods, and research in the design and evaluation of novel computational artifacts designed to meet real-world human needs.", "Through lectures and design activities, students work in teams of 5 to design a solution for a real-world problem.", "The end result of the team project is a high-fidelity interactive prototype of a mobile application, targeted at solving a particular real-world problem.", "Identify the primary luminaries in Interactive Design and HCI", "Identify your target users", "Design studies to understand your users and their needs within a sociocultural context", "Create user data-driven designs and prototypes of different levels of fidelity", "Design studies to evaluate designs during different stages of the project", "Properly gather and analyze qualitative and quantitative data from semi-structured interviews, paper prototype evaluation, heuristic evaluations and cognitive walkthrough", "Discover a variety of HCI research methodologies", "Add a high-quality design of an interesting product to your design portfolio", "The success of a team project depends critically on each student being a responsible member of the team, i.e., showing up and participating.", "Special consideration can be made for a few exceptions (e.g., academic travel, illnesses and family emergencies).", "Deliverables and Late Penalties", "Intellectual property includes items such as:"]}, {"course_id": 2, "course_code": "BET 360", "course_name": "BET360 - Design Frameworks for Social Ventures (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Design Frameworks for Social Ventures Fall 2024", "BET 360", "In this course, students will explore several design frameworks as they relate to complex problems; assess the impacts of these frameworks in recent entrepreneurial applications; and determine how to apply these concepts in the design of the social impact aspects of ventures and cross-industry collaborations.", "View requirements for BET 360", "Articulate the importance of design, and design thinking in solving problems for social and environmental change, through entrepreneurial ventures", "Understand, describe, and apply emerging frameworks in designing for social impact (ie.", "Collaborate with others to explore significant social problems using critical lenses", "Design, when everybody designs: An introduction to design for social innovation.", "Thinking in Systems: A primer.", "Electronic Device Policy", "Accommodation for Students with Disabilities", "This course includes the independent development and practice of specific critical thinking skills, such as;", "To understand, explain, and analyze base content knowledge around a range of topics in social impact and design, curated for this course", "Library for research-based assignments"]}, {"course_id": 3, "course_code": "CS 492", "course_name": "CS492 - The Social Implications of Computing (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["The Social Implications of Computing Winter 2025", "08:30AM - 11:20AM AL 124", "Students learn how to make informed judgements about the social and ethical consequences of deploying computer technologies and how to foster critical thought and professional responsibility.", "Identify important social implications of computerization;", "Combine their opinions with information from existing research in both written and oral formats;", "Identify where their knowledge of computer science provides a valuable contribution to the overall dialogue about the social and ethical implications of computing.", "Proactively identify potential ethical issues related to data and new technologies and applications;", "Evaluate the potential risks and benefits of different courses of action that could be taken with respect to data and new technologies and applications;", "Succinctly and confidently articulate and justify your views on ethical issues related to data and new technologies and applications;", "for CS 492 Section 003 in particular", "That said, please do not attend class if you are sick and should be in self-isolation; just let your instructor and TAs know you are ill and unable to attend class.", "A link to join the Slack channel may be found here: https://join.slack.com/t/cs492section003w25/shared_invite/zt-2wl26b5p3-pxMv5Z6mRjbOoNybeKXSwA.", "Evaluation in this course will be comprised of the following three components:", "A note on the use of large language models (“LLMs”) and generative AI systems: While it is my strong preference that students not use these systems and prepare their journal entries entirely on their own, students are permitted to use such systems to improve the technical quality of their writing, but they may not use them to do their writing for them.", "If you do use one of these systems, you must inform us that you have done so and how you used it.", "Unlike the weekly commentaries or position papers, students are encouraged to experiment with LLMs and generative AI systems and to incorporate them as part of their small-group projects!", "A five-minute video tour of the project and its findings.", "This should be rare since overall grades can easily be improved by submitting an additional written assignment.", "EMPOWER ME in China", "In particular:", "IP includes items such as:", "In particular, in this Ethics Workshop, we will discuss bias and discrimination in data and algorithms, and how new technologies and applications can contribute to and ameliorate these problems."]}, {"course_id": 4, "course_code": "GSJ 205", "course_name": "GSJ205 - Technology, Gender, and Social Justice (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["11:30AM -", "Email: slstettner@uwaterloo.ca", "Do not leave me a phone message; I do not have access to the phone that claims to belong to me!", "I will continue to add materials and speakers to the course syllabus, so please check back regularly for updates.", "•Reflect critically on social location and intersectionality in understanding the ways that technology can both liberate and oppress).", "Sept. 7 - 11 Introduction to course", "Design and Culture 8, no. 2 (2016): 235-252.", "In Proceedings of the 2019 CHI conference on human factors in computing systems, pp.", "\"Gender-inclusive design: Sense of belonging and bias in web interfaces.\"", "In Proceedings of the 2018 CHI Conference on human factors in computing systems, pp.", "Watch: The Algorithms of Oppression (on LEARN)", "Rose, Emma J. \"Design as advocacy: Using a human-centered approach to investigate the needs of vulnerable populations.\"", "\"Datafied body projects in India: Femtech and the rise of reproductive surveillance in the digital era.\"", "Your contributions should be thoughtful and demonstrate that you have done that week’s readings and thought about the course concepts.", "Take-home mid-term test: There is a mid-term take-home test in the course.", "With the video presentation, students must submit a copy of their script that includes proper citations to their peer-reviewed research sources.", "Intellectual property includes items such as:", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses"]}, {"course_id": 5, "course_code": "MSE 442", "course_name": "MSE442 - Impact of Information Systems on Organizations and Society (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Notice of Recording", "Impact of Information Systems on Organizations and Society Winter 2025", "MSE 442", "This course is designed to familiarize the student with issues related to the impact of computer-based technologies on individual jobs, organizations, and broader societal level.", "View requirements for MSE 442", "Identify the role(s) of information technology in society in a number of different fields.", "Identify and explain the advantages and drawbacks of a particular information technology case in society.", "Synthesize ‘for’ and ‘against’ cases and highlight the strengths and weaknesses of these beliefs.", "Present well-constructed arguments using sound knowledge and evidence supporting the case.", "Describe the impact of information technology in society with reference to potential future occupations.", "The survey can be accessed with the following link: https://www.surveymonkey.com/r/HMGHBKF", "Each team will create 5 questions for the opposing team and post these by Wednesday at noon of the debate week.", "A maximum of 100 words is allowed for each question.", "A maximum of 200 words is allowed for the response to each question received.", "Do the questions effectively challenge the opposing team?", "Do the answers to the questions received reflect good understanding of the case that the team is presenting?", "Are the arguments presented in the answers well constructed and is the evidence presented relevant and convincing?", "Inclusion of the main issues in the public debate on the topic", "Each review should be a maximum of 1000 words.", "Each review should be a maximum of 1000 words.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 6, "course_code": "PACS 315", "course_name": "PACS315 - Engineering and Peace (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Engineering and Peace Fall 2024", "07:00PM - 09:50PM CGR 1302", "Office Hours: Online or in-person meetings can be booked via Calendly between 8:30 AM – 4:30 PM on weekdays", "This course is built on the conviction that the kinds of problems engineers seek to address, and the ways they seek to address them, should matter for anyone interested in advancing peace in the world.", "Topics include historical connections between the discipline of engineering and warfare, understanding the engineering method and mindset, and technological frontiers for peacebuilding.", "Augment their approach to analyzing and solving problems with insights from both engineering and peacebuilding theory and practice; and", "Identify opportunities to apply their expertise and passions to make a meaningful social impact", "Why has war been the business of so many engineers?", "Sep. 18", "Sheldon Fernandez", "UWaterloo Turkstra Chair in Urban Engineering", "Critical Media Lab", "Communitech", "Laurel Boytim", "The Ripple Effect Education", "Engineers as social innovators Riley, “We’ve Been Framed!”", "Global Peace Index 2024 Institute for Economics & Peace.", "Morgan & Claypool Publishers, 2007.", "We’ve Been Framed!", "Also available for free through MIT Press Open Access] No", "Engineers of Jihad: The Curious Connection Between Violent Extremism and Education.", "Engineers of Jihad: The Curious Connection Between Violent Extremism and Education.", "A Perusall-generated score of 2.0 or higher is required to receive credit each week, and the overall grade for this element will be based on the accumulation of these credits (2% per reading assignment up to a maximum of 10 credits).", "Engage with a guest engineer and/or peacebuilder.", "Each class will begin with a conversation with a guest speaker with expertise and life experiences related to the topics covered in this course.", "95% – Made a contribution that went above and beyond expectations by demonstrating an exceptional level of consideration and care, and/or providing a rare and surprising degree of insight", "Each submission should be a minimum of 250 words.", "Offer a critique of the book, highlighting both strengths and witnesses, as well as offering a recommendation for who would benefit most from reading the book.", "Why did you chose to attend this event?", "Who played a key role in leading the event?", "Please read Grebel's full land acknowledgement for additional context on the college’s connections to the first European settlers on this land.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "This course includes the independent development and practice of reflection and writing skills."]}, {"course_id": 7, "course_code": "SOC 232", "course_name": "SOC232 - Technology and Social Change (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Notice of Recording", "SOC 232", "I am an Associate Professor in the Department of Sociology & Legal Studies and at the Stratford School of Interaction Design and Business.", "Apply sociological theories and concepts to understand, examine, and critically evaluate how technology shapes, and is shaped by, social phenomena.", "Identify how digital technologies shape our interpersonal relationships and communities, in both positive and negative ways.", "Assigned readings and playlists may change through the term.", "Sept 12  Introduction to the Course No readings this week", "Sept 19 “Do guns kill people?", "In The Design of Everyday Things: Revised and Expanded Edition, Revised, Expanded ed. edition, 1–36.", "Do Artifacts Have Politics?", "Techno-social Designing.", "The Adoption and Diffusion of Technological Innovations", "Tragic Design: The Impact of Bad Product Design and How to Fix It (1st edition).", "Community in the Network Society", "Computer Love: Replicating Social Order Through Early Computer Dating Systems.", "Deviance in the Dark psychology experiment [", "Assigned readings and playlists may change through the term.", "85%+", "Summary of relevant material is minimal in favor of cross-cutting synthesis of ideas.", "Deep and critical engagement with course content.", "Submission shows overall unity but may meander.", "Satisfactory", "Response is a good effort but falls short of a comprehensive answer.", "Problems in logic and content are identifiable, and writing is weak or tend towards summary rather than critical analysis.", "Please use APA formatting and citation style.", "Late Policies and Extension Requests", "Self-declarations cannot be “stacked” to extend beyond these 5 days.", "Notice of Recording", "However, if Health & Safety protocols demand a shift away from in-person teaching and towards online teaching, some activities for this course may involve recording, in partial fulfillment of the course learning outcomes.", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Do you want professors and interviewers to call you by a different first name?"]}, {"course_id": 8, "course_code": "STV 202", "course_name": "STV202 - Design and Society (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Design and Society Winter 2025", "Email: cshelley@uwaterloo.ca", "Email: js2kim@uwaterloo.ca", "View requirements for STV 202", "Topics include the nature of design, the social and cultural implications of design, the roles of designers in relation to the social contract, and design assessment in light of social values such as risk, fairness, progress, and sustainability.", "The course material provides a mixture of theoretical concepts and practical cases of their application.", "Describe concepts and perspectives relating to social and ethical aspects of good design.", "Analyze and evaluate designs in light of those concepts and perspectives.", "Compare concepts and perspectives and consider overlaps and differences among them.", "Reflect on the significance of social and ethical issues in their understanding of good design.", "The numbers in parentheses next to learning outcomes above refer to applicable Canadian Engineering Accreditation Board Engineering Graduate Attributes defined here: https://uwaterloo.ca/engineering/graduate-attributes", "Rational design & Social psychology.", "Social contracts & Agendas.", "Design and society: Social issues in technological design, Berlin: Springer.", "A 10-question, multiple-choice quiz is to be completed by each student on the course Learn site for each non-midterm module starting at the outset of week 2.", "Quiz questions each week relate to the textbook chapter(s) assigned for that week.", "Design discussions", "Discussions will take place each non-workshop week after week 1.", "Design presentations", "5 minutes) and may be chosen for viewing in subsequent classes.", "Midterms", "Midterm 1 covers chapters Good design through Culture, Midterm 2 covers chapters Social contract through Activism, and Midterm 3 covers chapters Risk through Sustainability.", "Grade exemptions", "To allow for situations not covered under the Late submissions policy (see below), each student’s lowest quiz, discussion,  presentation, and workshop grade will be dropped from the calculation of their overall grade in each of those categories.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 9, "course_code": "STV 205", "course_name": "STV205 - Cybernetics and Society (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Cybernetics and Society Spring 2024", "This course will present an overview of cybernetics from automation and robotics to prosthetics and wearable computing.", "The roles of men and women in a post-human era will be discussed along with related themes dealing with gender, cyberspace, politics, and popular culture.", "Apply analogical thinking to examine technologies from a functional as well as a social and cultural perspective.", "Assess the kinds of problems addressed by different kinds of technologies and reflect upon your own problem-solving experiences.", "Understand the basic concepts of cybernetics from a historical perspective and discuss issues concerning the development of technologies with someone from an academic discipline different from your own.", "On Thursday at 9:00pm ET, a multiple-choice quiz will be published that you must complete by Friday at 11:59pm ET.", "The study materials are a mix of book chapters and articles as well as video and audio clips.", "Each week, except the first week, in STV 205 will follow this pattern:", "Module 1.1 First-Order Cybernetics: Norbert Wiener, Margaret Mead, Feedback, Information and Analogy - May 9", "Module 2.1 Second-Order Cybernetics: Heinz von Foerster, the Observer and the Observed, Determinism versus Constructivism, and the Attention Economy - June 6", "Module 2.3: Big Data Algorithms, Surveillance Capitalism, and the Smart City - June 20", "Module 3.2: Utopia, Dystopia and Anti-Utopia? - July 11", "Systems Thinkers by Magnus Ramage/Karen Shipp Yes", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 10, "course_code": "STV 208", "course_name": "STV208 - Artificial Intelligence and Society: Impact, Ethics, and Equity (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Artificial Intelligence and Society: Impact, Ethics, and Equity Winter 2025", "The objective of this course is to introduce students to ethical and social concerns relating to Artificial Intelligence (AI).", "By understanding the basic principles of AI and its evolution, to engaging with complex issues like algorithmic bias and privacy concerns, this course offers a comprehensive look at both the promise and challenges AI brings to society.", "Through real-world case studies, students will analyze how AI systems influence industries, economies, and governance while learning to apply ethical frameworks that ensure fairness and accountability in AI deployment.", "The course is designed to not only equip students with the tools to evaluate the societal impacts of AI critically but also to empower them to actively engage in discussions about the future of technology and society.", "By the end of the course, students will be prepared to make informed contributions to the ongoing debates about the role of AI in shaping the future.", "Identify and explain key concepts related to the societal impacts of AI technologies, including ethical considerations, biases, and privacy concerns, and classify real-world examples where these issues arise.", "Compare different ethical frameworks and governance models for AI, and critically test their effectiveness in addressing issues such as fairness, accountability, transparency, and human rights.", "Evaluate the broader implications of AI on democracy, human rights, and socioeconomic systems, and assess how AI-driven innovations can either support or challenge social equity, ethical standards, and global governance structures.", "8 Socioeconomic Impacts of AI and Automation Mar 5 Mar 11", "12 The Future of AI: Ethical Design and Responsible Innovation Apr 2", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 11, "course_code": "STV 210", "course_name": "STV210 - The Computing Society (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["The Computing Society Fall 2024", "S. Campbell", "If that’s not a good time for you, just get in touch and let me know when you’re free and I’ll do my best to find time.", "It explores the impact and consequences of computing from a societal perspective, but also considers various nontechnical factors and values that have shaped computing technology and practice.", "Material artifacts will form a core element of the course.", "STV 210: View requirements for STV 210", "It’s a combination of STV-like concepts and historical concepts.", "The goal for this course is to appreciate how the history of computing can be used to better understand the interaction between technology and society today and in the future.", "*", "*", "*", "*", "*", "*", "*", "*", "You don’t need to buy it!", "An electronic version is available though the library, and we’re only reading some of the chapters.", "The activities allow you to practice with concepts and prepare you for assignments.", "Each group submits a summary of their discussion before leaving for the night, and each student in the group will share the grade.", "Self-Assessments", "There’s no shame!", "I know it can feel embarrassing to ask for help, but I seriously don’t mind helping everyone.", "Extensions", "Gender-inclusive language", "Gender-inclusive and fair language should be used in the interests of precision and politeness.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 12, "course_code": "STV 302", "course_name": "STV302 - Information Technology and Society (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Information Technology and Society Spring 2024", "S. Campbell", "But is this just a misplaced perception?", "Ultimately, what sort of technological values underpin the actions of IT creators and users?", "Identify, classify and analyze concepts and perspectives related to the interaction between information technology and society.", "Identify and analyze technological values of creators and users, and those embedded within information technology.", "Develop independent research questions, and communicate findings in written and verbal formats.", "Also, for any engineering undergraduates, the course provides instruction in fulfilment of CEAB graduate attributes 10, b, and c", "May 29 1.3 Is everything online?", "June 12 2.1 Disinformation Yes", "June 26 2.3 IT & Fairness Yes", "Further instructions for each self-assessment and a rubric will be provided on LEARN in the Module 1.4, 2.4, and 3.4 folders.", "I know it can feel embarrassing to ask for help, but I seriously don’t mind helping everyone.", "That’s when I can best help, not a month later.", "Gender-inclusive language", "Gender-inclusive and fair language should be used in the interests of precision and politeness.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 14, "course_code": "STV 305", "course_name": "STV305 - Technology, Society and the Modern City (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Email: cshelley@uwaterloo.ca.", "Cities may be humanity's most significant invention, where we shape our vision of the civilized life.", "At the same time, the demands of cities shape our lives in fundamental ways.", "The purpose of this course is to examine the technology of civilized life, with the city itself as both a technological system and a scene of technological living.", "View requirements for STV 305", "Describe concepts and perspectives relating to cities as socio-technical systems.", "Analyze and evaluate developments in cities in light of those concepts and perspectives.", "Reflect and communicate analyses of social and ethical aspects of technology and cities.", "Week 11 November 21 Smart cities", "Discussions", "Each student is expected to participate in in-class discussion each week.", "Summaries", "Summaries may be shared with the class to kick-start in-class discussion.", "Self-assessments", "Grade exemptions", "Each student’s lowest discussion mark and exercise mark will be dropped from the calculation of their overall mark in those categories.", "Students are welcome to request regrading of assignments.", "Test conflicts"]}, {"course_id": 16, "course_code": "ENGL 108D", "course_name": "ENGL108D - Digital Lives (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Email: c23marti@uwaterloo.ca", "An examination of how digital communication technologies create and promote online identities and social spaces, as well as interpersonal and communal interactions.", "View requirements for ENGL 108D", "How do the technical affordances of online spaces shape the way we use them?", "Analyze the socio-cultural, technological and ideological systems that shape the digital world, and shape us in turn.", "Apply core concepts of new media theory to your own digital life, improve your informational awareness and engage critically with digital culture.", "The Emergence of the Digital World Pt 2 Curtis, Hypernormalization", "Shrinking Frontiers: Digital Platforms and Corporate Consolidation", "Dijck, Platform Society", "Values at Play", "Week 7 AI Slop, Grifter Gurus and Memecoin scams: Digital Life in the Post-truth era   TBD Digital Artifact Analysis Due", "Critical Digital Media Analysis 15%", "This course includes the independent development and practice of specific skills, notably those involved with written communication, critical thinking and analysis, independent research and oral presentation.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 18, "course_code": "ENGL 295", "course_name": "ENGL295 - Social Media (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["D. Deveau", "D. Deveau", "Email: danielle.deveau@uwaterloo.ca", "This course surveys the popular social media landscape and charts scholarly approaches, both methodological and theoretical, to understanding and analyzing social media texts.", "View requirements for ENGL 295", "This course surveys the popular social media landscape and charts scholarly approaches, both methodological and theoretical, to understanding and analyzing social media texts.", "Demonstrate proficiency in critical analysis of social media platforms and content", "Produce effective evaluations of social media through the communication theory lenses of audience; ownership; production; regulation; labour; and effects", "Identify key social media companies as well as regulatory tensions or gaps", "Demonstrate curiosity, engagement, and a desire to learn through active participation in the course", "Demonstrate professionalism and academic independence by participating fully, initiating your own learning, and meeting course milestones", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 19, "course_code": "FINE 100", "course_name": "FINE100 - Studio Fundamentals (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["01:00PM - 03:20PM", "This course introduces the basic principles of drawing as it relates to concepts of 2D, 3D, and time-based media, through a series of drawing exercises and projects.", "View requirements for FINE 100", "You will create through studio-based practices, learning new ways of seeing and making art from 2D to 4D, becoming comfortable with experimentation, intuition and improvisation as a means toward the goal of personal expression.", "You will be able to see yourself as part of contemporary art, learning that art is an essential aspect of our current and past histories and the ongoing development of cultural life.", "You will learn to develop confidence in the way you speak about artworks and at the same time develop sensitive and supportive language in considering the work of yourself and others in class discussions.", "This methodology is known as cognitive learning which fosters a deeper understanding of physical materials, muscle memory, and solving problems through curiosity and hands-on creative processes.", "Homework: Complete frottage collab drawings and online safety training.", "and the impact of creativity and complete Paper Engineering", "Note: Project #3 Big Swap C & D Due.", "This is a great deal – a huge savings in comparison to what it would cost to buy everything individually.", "Project 1: Fundamental Drawing Project, Part A and B", "This project introduces students to the Elements of Art and Principles of Design vis-à-vis a set of drawing projects that will be submitted in two parts via the cardboard portfolios from your kits.", "Drawing Check List for Part A", "All drawings based on positive & negative space with contour.", "Elements of Art and Principles of Design Cards, each Fine 100 student receives these custom cards as part of their communal fee.", "This project helps you move from 2D to 3D, employing techniques related to paper engineering and pop-up books/mechanics.", "Pop-up Tutorial 1: Materials and Basic Theory with Duncan Burmingham", "There are four parts and each part is worth 10%.", "Working in groups of 3 or 4, students work in collaboration to produce a short film (1-3 minutes).", "References on the impact of visual intelligence and creativity", "Note: It’s okay if you don’t know these answers?", "We included this to support developing a lifelong creative habit, something that we believe can have a huge impact even if you don’t see yourself working as a studio-based artist, so we’re curious to know what you think.", "There will be classes where the set-up is contingent on the facilities in East Campus Hall and it will be difficult to duplicate these at home.", "I have an Instagram account (uwaterloo_finearts_printmaking) that I started in 2020, and I sometimes post from Fine 100.", "Please let me know if you don’t feel comfortable participating in this public forum.", "Materials and Techniques:", "Does your assignment demonstrate control/aptitude over the processes and techniques?", "Elements of Design and Form:", "How does form relate to content?", "Experimentation:", "Is there an aspect of innovation in terms of your approach?", "Does it have a strong concept?", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 20, "course_code": "FINE 150", "course_name": "FINE150 - Appreciation and Expression (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Appreciation and Expression Winter 2025", "Email: mlychek@uwaterloo.ca", "The course delivers an introduction to a variety of basic techniques and concepts relevant to contemporary 2D, 3D, and digital art practices, through a series of structured studio exercises and assignments.", "View requirements for FINE 150", "Build fundamental skills/knowledge of Elements of Art and Principles of Design", "Cultivate critical thinking and creative innovation related to 2D, 3D, conceptual art", "Introduction to Assignment 1: Kilometer Project", "Reminders for Next Week's Life Drawing Sessions", "Introduction to Assignment 4: Artist Remake", "Work Period: Artist Remake and in-progress feedback", "Introduction to Assignment 5: Artist Multiple", "Work Period: Artist Multiple – brainstorming concepts", "Work Period: Artist Multiple - wrapping things up", "Work Period: Artist Multiple - wrapping things up", "DUE: Assignment 5: Artist Multiple - Critique", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 21, "course_code": "FINE 257", "course_name": "FINE257 - Video, New Media and the Digital Turn (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["10:00AM - 11:20AM ECH 1219", "In acknowledging the land and water, we express gratitude to those whose territory we reside on and remind ourselves of our connections and responsibilities to care for the land and water, and to respect each other who live on the land and water.", "Land acknowledgment goes beyond words and requires ongoing learning about the territory and actions to support indigenous communities.", "For further learning, resources can be found at https://www.whose.land/ & https://native-land.ca/.", "View requirements for FINE 257", "Tracing the histories, aesthetics and politics of digital art, students will critically examine the emergence of digital technologies, and their roles in transforming artistic practices, modes of production, and integration across media disciplines.", "Through both chronological and thematic approaches, students will engage with theoretical readings, analyze historical and contemporary case studies in art and digital spaces in everyday life, and create studio-based projects that respond to or critique digital and mediated cultures.", "By the end of the course, students will have developed both a historical understanding and practical fluency in the ways digital art shapes, and is shaped by, cultural and technological transformations.", "Digital &", "Post-digital", "reading week", "Themes in Digital", "Contribution & Development 20%", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 22, "course_code": "INTEG 121", "course_name": "INTEG121 - Collaboration, Design Thinking, and Problem Solving (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["02:30PM - 03:20PM", "EV2 2069", "03:30PM - 04:20PM EV2 2069", "Email: vanessa.schweizer@uwaterloo.ca", "A project course in design and problem-solving across various disciplines.", "Topics include problem-solving methods and issues in design, including ethics, sustainability, and communication in small groups.", "Applied design projects require group work and draw on the skills of creative and critical thinking.", "View requirements for INTEG 121", "Collaboration is essential for solving complex, real-world problems.", "What problems do teams most commonly face and how can those problems be minimized?", "How can productive conflict increase creativity and productivity, and how can destructive conflict be reduced?", "During the course, you will learn collaboration techniques for improving team dynamics, such as creating and using a team charter, identifying and addressing conflict, providing useful feedback to team members, and building on the ideas of others to arrive at the best outcomes.", "Design thinking is contrasted with linear thinking, a common approach for solving problems that are simple.", "You will be introduced to and will practice techniques for centring the user in your designs as well as becoming cognizant of problem-solving and decision-making stages – both individually and within a team.", "Collaboration and design thinking will be exercised and studied through multiple group-based, real-world projects culminating in an open-ended design challenge and skills-based portfolio.", "1) Record and share detailed observations of the world around you in order to think critically", "2) Establish and cultivate positive group dynamics by applying appropriate theory and best practices", "3) Take initiative, exercise responsibility, problem solve, and make decisions during crucial stages of a problem-solving cycle", "Key concepts", "Design thinking (d-thinking) as problem solving", "Introduction to user/human-centred design", "D-thinking techniques", "ASSIGNED: regular observations in sketchbook", "Jan 13 Seminar: Discussion of readings and experience with bricolage", "D-thinking technique #5 – Critique", "DUE start of class Feb 10: Project 1 Individual Post of Team Experience (in Kritik)", "OPTIONAL: continue regular observations individually", "Feb 26: D-thinking technique #4b – the Question Formulation Technique", "In-class:", "Mar 17: Group progress reports and discussion", "Recommended for sharing files with group members and keeping in touch Yes $0", "Design: Artifacts in Society by Karl T. Ulrich Freely available as a PDF on LEARN.", "We will also be using the following online tool (see LEARN for details as to how to access and use each of these tools):", "Kritik enables you to utilize a rubric and provide qualitative feedback.", "LO2: Establish and cultivate positive group dynamics by applying appropriate theory and best practices", "LO3: Take initiative, exercise responsibility, problem solve, and make decisions during crucial stages of a problem-solving cycle", "For in-class observations, the best two observations over the term count towards the course mark.", "At the start of each project, group members should", "Students will be given class time to discuss these with each other, as such discussion informs the group's understanding of the design challenge.", "This means that marks will be recorded without knowing the identity of the student.", "Any of the following errors will result in a penalty:", "Respectful Behavior", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 23, "course_code": "INTEG 251", "course_name": "INTEG251 - Creativity and Innovation (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Creativity and Innovation Fall 2024", "10:00AM - 11:20AM EV2 2069", "Students will learn to identify and explain key ideas and historical figures in the study and practice of creative thinking.", "View requirements for INTEG 251", "The concepts and practices you develop in this course will help you exercise creative thinking and innovation in other classes, projects, and work beyond the university too.", "2) Situate creativity and innovation in a history of changing working conditions across sectors.", "3) Apply key concepts and practices to your own projects inside and outside academia.", "Phases", "Welcome and overview", "Theory and Practice", "Creative Thinking: Def. & Structure", "Discussion: Conscious Creative by Kelly Small (Intro + you pick any 3 ethical practices from the remaining chapters)", "No classes this week", "Design Project", "Wed Oct 23: Brainstorming project options & Group formation", "Wed Oct 30: Ideate possible interventions", "Wed Nov 13: Explicitly linking interventions & designs", "Review, clarifying questions & next steps", "Participation self-evaluation part 2", "What might you learn from these efforts?", "How might you learn from this experience moving forward?", "Each case study comes with different possible readings to be discussed in a short written analysis (approximately 1000-1500 words in essay form):", "Open topic – Propose another case study topic of interest to you; make sure it includes at least two new relevant readings and poses a question that you can answer in a 1000-1500 word essay, drawing on your learning in the course.", "What designs and patterns do you think were shaping what creativity and innovation meant in the context of the project?", "Demonstrate familiarity with concepts and practices from class (5%)", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 24, "course_code": "KIN 320", "course_name": "KIN320 - Task Analysis (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Task Analysis Winter 2025", "KIN 320", "KIN 320 001", "Email", "Email", "Task analysis includes a broad range of descriptive and analytic techniques from which the practitioner must select the most appropriate one for their purposes and setting.", "This skills-based course will guide students in learning task analysis methodologies and associated techniques using a combination of didactic, case-study, and experiential learning-based teaching methods.", "The application of task analysis from the perspective of a Human Factors & Ergonomics (HFE) specialist will be emphasized.", "View requirements for KIN 320", "Identify practical and ethical issues that emerge when applying task analysis", "3. Choose task analysis methodologies appropriate for a given setting and purpose", "4. Perform a range of task analysis methods", "4 Th January 16 Observational Methods & Activity Sampling", "Tu February 18 Break week - No classes", "Th February 20 Break week - No classes", "13 Th February 27 Static strength, holding times & rest allowance", "15 Th March 6 Metabolic Equations", "No Class - Task Analysis Work Period", "Th April 3 No Class - Task Analysis Work period", "April 7-8 – Pre-examination study days", "Instructions regarding time allotted and submission methods will be provided in conjunction with these evaluations.", "Self-declaration of short-term absence"]}, {"course_id": 25, "course_code": "PSYCH 207", "course_name": "PSYCH207 - Cognitive Processes (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["An examination and evaluation of selected topics dealing with human information processing such as attention, memory, pattern recognition, consciousness, language, dyslexia, decision making, and problem solving.", "how we call on our mental information and resources to make important decisions; and,", "Describe how context shapes and constrains cognition, which involves"]}, {"course_id": 26, "course_code": "PSYCH 261", "course_name": "PSYCH261 - Physiological Psychology (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Introduction to brain, basic physiological processes, and their roles in behaviour.", "Both experimental and clinical data are considered.", "Familiarise you with the theoretical and philosophical underpinnings of physiological psychology;", "Teach you about the physiological mechanisms underlying human sensory and perceptual systems; and", "Provide you with insights into the basic physiological and mechanisms involved in behaviour, cognition, emotion and consciousness.", "Week 1: Introduction and History", "Sona Participation and Research Experience Marks", "Students may complete any combination of these options to earn research experience grades.", "Credits for online courses can be earned through any combination of studies as noted above.", "Participation enables students to learn first-hand about psychology research and related concepts.", "Educational focus of participation in research", "To maximize the educational benefits of participating in research, students will receive feedback information following their participation in each study detailing the following elements:", "Provisions to ensure confidentiality of data", "**", "Identify the psychological concepts in the article and indicate the pages in the textbook that are applicable.", "Clearly evaluate the application or treatment of those concepts in the article.", "If such a conflict arises, the Associate Chair for Undergraduate Affairs is available for consultation and to mediate a resolution between the student and instructor."]}, {"course_id": 27, "course_code": "STAT 332", "course_name": "STAT332 - Sampling and Experimental Design (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Sampling and Experimental Design Winter 2025", "Email: schonlau@uwaterloo.ca", "Designing sample surveys.", "Analysis of variance.", "Designing for comparison of groups.", "Sampling: explain the effect of the finite population correction", "Sampling: Design and analyze a stratified random sample", "Experimental: Explain factorial design", "Experimental: Compare and contrast experimental design and observational studies", "5 2025-01-21 6 regress A1 out", "15 2025-03-04 4 Anova/F-test", "Slides Online in learn Yes 0", "Slides:  I am reworking some slides and will post them one-by-one into learn before class.", "data collection) 2%", "Activities supporting in-class analysis: The in-class analysis will require data collection (and possibly other activities).", "All team members must meaningfully contribute to the analysis and to coding.", "Projects must not use data sets that one of the team members has used for similar projects in previous courses.", "You must write up solutions using your own words and write your own programs.", "Give a clear explanation as to why you think you deserve a different mark."]}, {"course_id": 29, "course_code": "CS 454", "course_name": "CS454 - Distributed Systems (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Distributed Systems Winter 2025", "11:30AM -", "S. Al Kiswany", "PHY 313", "S. Al Kiswany", "08:30AM - 09:50AM MC 2035", "S. Al Kiswany", "11:30AM -", "S. Al Kiswany", "PHY 313", "S. Al Kiswany", "08:30AM - 09:50AM MC 2035", "S. Al Kiswany", "An introduction to distributed systems, emphasizing the multiple levels of software in such systems.", "Specific topics include fundamentals of data communications, network architecture and protocols, local-area networks, concurrency control in distributed systems, recovery in distributed systems, and clock synchronization.", "An introduction to distributed systems, emphasizing the multiple levels of software in such systems.", "Specific topics include fundamentals of data communications, network architecture and protocols, local-area networks, concurrency control in distributed systems, recovery in distributed systems, and clock synchronization.", "Introductory Concepts", "Introduction/Overview of networking concepts relevant for distributed systems", "5. Distributed File Systems (2)", "Architecture", "Semantics", "Service software design", "Name Spaces", "Name Resolution", "Physical and Logical Clock Synchronization", "Mutual Exclusion", "Election", "Consistency Models", "Data Analytics", "Online shopping", "Distributed Systems, 4th Edition, Maarten van Steen and Andrew Tanenbaum Available for free Yes 0", "Distributed Systems, 4th Edition, Maarten van Steen and Andrew Tanenbaum", "For assignments, do not use any public or web-based source code repository hosting service other than https://git.uwaterloo.ca.", "You may discuss general concepts and problems with classmates, tutors, TAs, and instructors.", "Copyright and Intellectual Property", "Intellectual property includes items such as:", "Math Faculty code-sharing policy: https://uwaterloo.ca/math/code-sharing-policy"]}, {"course_id": 30, "course_code": "CS 480", "course_name": "CS480 - Introduction to Machine Learning (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Introduction to Machine Learning Winter 2025", "10:00AM - 11:20AM DWE 1501", "Introduction to modelling and algorithmic techniques for machines to learn concepts from data.", "Optimization-based learning: loss minimization. regularization.", "This is especially useful in complex tasks such as natural language processing, information retrieval, data mining, computer vision and robotics where it is not practical for a programmer to enumerate all possible situations in order to specify suitable instructions for all situations.", "The course will introduce the basics of machine learning and data analysis, and demonstrate how machine learning techniques have impacted life and society.", "The course starts with some classical tasks and algorithms in machine learning, then transitions to modern advances and successful applications in real life, and finally ends with discussions on the societal impact that machine learning has generated.", "A significant part of the course will be devoted to raising students' awareness on such ethical issues, including how to make machine learning algorithms fair and unbiased, how to protect individual privacy without compromising learning, how machine learning algorithms might be attacked, how to measure and improve the security of machine learning algorithms, and how to make machine learning algorithms explainable and interpretable.", "Recognize and formalize a task as a machine learning problem", "Identify suitable algorithms to tackle different machine learning problems", "Understand and implement a plethora of foundational machine learning algorithms", "Apply machine learning algorithms to real datasets", "Become aware of potential ethical and safety issues of machine learning on society", "Introduction (first lecture: Jan 7, 2025)", "Linear Regression", "Reproducing Kernels", "Multi-layer Perceptron", "Deep Neural Networks", "Attention", "Decision Trees", "Flow Models", "Variational Autoencoders", "Diffusion Models"]}, {"course_id": 31, "course_code": "CS 484", "course_name": "CS484 - Computational Vision (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Computational Vision Winter 2025", "10:00AM - 11:20AM MC 2034", "Introduction to image and vision understanding by computer.", "Camera-system geometry, image formation and lighting, and image acquisition.", "Processing of stereo images, and motion in image sequences.", "Applications of computer-vision systems.", "General Description", "Computer Vision encompasses a variety of innovative methods and algorithms leveraged in applications such as facial recognition, image searching, augmented reality, medical image analysis, automated mapping of environments, and digital effects in movies and photography.", "This course provides an introduction to the computational and mathematical foundations of computer vision and covers many of its standard applications.", "In case some points in the slides are skipped in class (e.g. review of basic background in linear algebra, or if time runs out), the students could be referred to the posted video lectures.", "The videos explain all the slides, including optional reviews of basic linear algebra, multi-variate calculus, and some (clearly marked) optional material in computer vision.", "iClicker we will use iClicker for occasional in-class polling.", "Mathematical skills: AMATH 242/CS 371 or CS 370 or Linear Algebra 2 (MATH 235/245)", "Comments on Linear Algebra", "Understanding computer vision methods requires certain level of confidence with linear algebra, which is actively used throughout the course.", "CS484 only briefly reviews some critical linear algebraic tools as they become needed, but there is absolutely no time to teach linear algebra on the same level (covering proofs and many basic examples) as it is done in the appropriate math courses.", "Based on observations from the previous years, students who took only one term of introductory linear algebra and do not remember much of it must be ready to commit (possibly substantial) extra time.", "At the same time, computer vision offers highly motivating and intuitive context for learning linear algebra.", "If you plan to take other courses on Data Analysis, AI, or Machine Learning, you will also appretiate stronger linear algebra skills.", "While CS484 covers only the absolutely necessary background in linear algebra, as well as multivariate calculus, some useful external links can be found in \"Math Resources\".", "This course introduces many standard computer vision problems and computational approaches for solving them.", "The context of image analysis also provides an intuitive and stimulating visual environment for developing and understanding numerical algorithms.", "Slides", "In case of substantial changes, the updated slides will be reposted online.", "The posted videos explain all the slides in details, including review of basic background in linear algebra and multi-variate calculus.", "You will be referred to specific relevant sections of these books in class.", "Computer Vision: Algorithms and Applications, 2010.", "Python's linear algebra library \"numpy\" will be widely used in all assignments.", "More details and code samples are posted here.", "This happens naturally as the first half of the course spends more time reviewing background from linear algebra, multi-variate calculus, and statistics.", "Assignments will require submission of code and a report.", "Typical image analysis algorithms produde output (geometric structures, segments, labelings) that can be visualized.", "The drop box remains open for late submissions for a few days past the due date/time of each assignment - TAs record each late day.", "Scholastic offences are taken seriously and students are directed to read the appropriate university policy.", "Assignment 4: low-level segmentation"]}, {"course_id": 32, "course_code": "CS 486", "course_name": "CS486 - Introduction to Artificial Intelligence (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Introduction to Artificial Intelligence Winter 2025", "08:30AM - 09:50AM MC 2038", "08:30AM - 09:50AM MC 2038", "Varun Dhanraj: vdhanraj@uwaterloo.ca", "Methods of general problem solving.", "Multi-agent systems.", "Methods of general problem solving.", "Introduction to mathematical logic Mechanical theorem proving.", "Available free for downlooad online at artint.info Yes"]}, {"course_id": 33, "course_code": "CS 488", "course_name": "CS488 - Introduction to Computer Graphics (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Introduction to Computer Graphics Winter 2025", "04:00PM - 05:20PM", "04:00PM - 05:20PM", "Software and hardware for interactive computer graphics.", "Software and hardware for interactive computer graphics.", "The password will be released during the first week of classes.", "Software and hardware for interactive computer graphics.", "Implementation of 3-D transformations, clipping and projection routines.", "Course delivery will consist mostly of traditional lectures with occasional use of slides and technical demonstrations.", "Continuity Plans", "In case of a cancellation of in-person classes, the instructor will release in the course Lessons website required reading materials equivalent to the contents covered in each lecture.", "These materials can be regarded as illustrated transcripts of the traditional lectures.", "In case of a cancellation of in-person meetings, the course staff’s office hours will be held online, with instructions fort these virtual office hours (VOH) to be provided via Learn.", "The graphics lab will be closed during periods in which in-person lectures need to be cancelled.", "Assignment deadlines will not be postponed so that students can troubleshoot the VM.", "write interactive 3D computer graphics programs;", "understand how linear and perspective transformations are used in modeling and rendering in 3D computer graphics;", "write a simple ray tracer.", "Mathematical Underpinnings", "Transformations", "Hidden Surfaces and Shading", "Realistic Rendering", "Animation", "Students must average at least a 50% in both the programming and examination components of the course to pass.", "Bonus marks obtained in one component are not carried over to the other component.", "The instructor reserves the right, where appropriate, to adjust raw marks downward in the case of cheating and upward in other situations.", "A1 to A4 have the same weight.", "In case of any issue related to their submission procedures, the student must contact the TAs before the day scheduled for the activity (assignment or project) using the appropriate means indicated below.", "Intellectual property includes items such as:", "phone: 1-866-925-5454;", "In particular:", "Please inform of us these at the start of the course."]}]