[{"course_id": 34, "course_code": "MATH 148", "course_name": "MATH148 - Calculus 2 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["08:30AM - 09:20AM", "Instructor: Michael Brannan", "E-mail: michael.brannan@uwaterloo.ca", "Week of", "3 Jan. 20 Fundamental Theorem of Calculus  A1", "4 Jan. 27 Techniques of Integration  A2", "5 Feb. 3 More Techniques and Improper Integration", "6 Feb. 10 Applications of Integration A3", "8 Mar. 3 Convergence Tests A4", "10 Mar 17 Sequences and Series of Functions A5", "11 Mar. 24 Power Series", "12 Mar. 31 Differential Equations A6", "Principles of Mathematical Analysis."]}, {"course_id": 35, "course_code": "MATH 135", "course_name": "MATH135 - Algebra for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["Algebra for Honours Mathematics Winter 2025", "An introduction to the language of mathematics and proof techniques through a study of the basic algebraic systems of mathematics: the integers, the integers modulo n, the rational numbers, the real numbers, the complex numbers and polynomials.", "Algebra for Honours Mathematics is a study of the basic number systems of mathematics.", "The course has two themes: Number systems and Mathematical language.", "The study of number systems will feel more familiar and will cover the integers, the integers modulo n, the complex numbers and polynomials.", "Gain practice in formulating conjectures and discovering proofs.", "Understand basic algebraic systems of mathematics: the integers, the integers modulo n, the rational numbers, the real numbers, the complex numbers and polynomials.", "MATH 135 Course Notes: Language and Proofs in Algebra, An Introduction Please see the Course Notes page in LEARN for the pdf No Free", "Generative AI: This course includes the independent development and practice of specific skills, such as proof discovery and proof writing.", "Library for research-based assignments", "In particular:"]}, {"course_id": 36, "course_code": "MATH 145", "course_name": "MATH145 - Algebra (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["02:30PM - 03:20PM", "E-mail: bmadill@uwaterloo.ca", "Topics include rings and subrings, integral domains and fields, homomorphism and isomorphism, quotient rings and modular arithmetic, isomorphism and the Chinese Remainder Theorem, irreducibility in integral domains, and field extensions.", "Week of", "1 Sept 5* Rings and Subrings", "3 Sept 19 Integral Domains and Fields A1", "7 Oct 24 FIT and CRT A3", "9 Nov 7 GCD's A4", "11 Nov 21 Field Extensions"]}, {"course_id": 37, "course_code": "MATH 136", "course_name": "MATH136 - Linear Algebra 1 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["Notice of Recording", "Linear Algebra 1 for Honours Mathematics Winter 2025", "08:30AM - 09:20AM MC 4061", "09:30AM - 10:20AM MC 4061", "10:30AM - 11:20AM QNC 2502", "11:30AM - 12:20PM MC 2065", "02:30PM - 03:20PM", "03:30PM - 04:20PM QNC 2502", "11:30AM - 12:20PM MC 4061", "10:30AM - 11:20AM B1 271", "Systems of linear equations, matrix algebra, elementary matrices, computational issues.", "Real n-space, vector spaces and subspaces, basis and dimension, rank of a matrix, linear transformations, and matrix representations.", "Master computational aspects of linear algebra, including matrix and vectors operations", "Solve systems of m linear equations in n unknowns", "Evaluate the inverse of a square matrix, when it exists", "Obtain the matrix representation of a linear transformation", "Evaluate the determinant of a square matrix", "Change co-ordinates and bases, and understand the effect on matrix representations", "Become familiar with operations and properties of abstract vector spaces", "While collaboration in understanding the material is encouraged, the work submitted must be your own, written independently.", "For example, submitting 60 minutes late will result in a maximum possible score of 40%, assuming a perfect score.", "Accommodation Requests", "Notice of Recording", "Allocate time appropriately towards the completion of the assignment which reduces the procrastination and cramming cycle", "Appreciate the importance of reviewing marked assignments", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as reading and writing proofs.", "Library for research-based assignments"]}, {"course_id": 38, "course_code": "MATH 146", "course_name": "MATH146 - Linear Algebra 1 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["Linear Algebra 1 (Advanced Level)", "Email: karigiannis@uwaterloo.ca", "This course is a rigorous treatment of the theory of finite dimensional vector spaces over an arbitrary field.", "We also cover the theory of determinants over an arbitrary commutative ring with identity, and some aspects of the theory of polynomials in one variable over a field.", "The ultimate goal is the Primary Decomposition Theorem, which characterizes a linear operator on a finite dimensional vector space in terms of invariant subspaces annihilated by the primary factors of its minimal polynomial.", "We will cover a large amount of difficult material at a fast pace.", "Understand and apply the concepts of the theory of abstract vector spaces and linear operators on finite-dimensional vector spaces.", "fields; systems of linear equations; matrices; row-reduced echelon form; matrix algebra; invertible matrices", "vector spaces; subspaces; bases and dimension; coordinates; row equivalence", "algebra of linear maps; isomorphism; representations by matrices; dual space; transpose of a linear map", "commutative rings; existence and uniqueness of determinants; multilinear maps; the exterior algebra", "eigenvalues; annihilating polynomials; invariant subspaces; simultaneous triangulation and diagonalization", "Much (but not all) of my lectures will closely follow the first six chapters of this book:", "“Linear Algebra: Second Edition” by Kenneth Hoffman and Ray Kunze; Prentice Hall, 1971.", "“Linear Algebra: Fourth Edition” by Friedberg, Insel, and Spence; Prentice-Hall, 2003.", "The assignments are an integral part of your evaluation in this course and I encourage everyone to take them very seriously.", "There will be no opportunity for a make-up midterm test."]}, {"course_id": 39, "course_code": "MATH 235", "course_name": "MATH235 - Linear Algebra 2 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["Linear Algebra 2 for Honours Mathematics Winter 2025", "Understand the definition of an abstract vector space and prove theorems about all vector spaces using the axioms.", "In the context of abstract vector spaces, understand and use the concepts of linear independence, spanning sets, bases, and dimension.", "Understand the definition of a linear transformation, and be able to prove whether or not a function is a linear transformation.", "Prove and apply the rank-nullity theorem.", "Understand and use the relationship between abstract linear transformations and matrices.", "Understand the axioms of an inner product, and use them to prove basic results about inner product spaces.", "Unitarily diagonalize a normal matrix.", "See schedule on Learn for a week-by-week breakdown of topics.", "Abstract Vector Spaces", "The definition of a vector space", "Subspaces", "Bases and dimension", "Linear Transformations", "Linear transformations between abstract vector spaces", "Rank and nullity", "Linear maps as matrices", "Change of coordinates", "Isomorphisms of vector spaces", "Eigenvectors", "Diagonalization", "Powers of matrices", "Inner product spaces", "Inner products", "Orthogonality and norm", "Orthonormal bases", "Projections", "Inner products and Gram matrices", "Singular value decomposition", "Singular values and singular vectors", "Singular value decomposition of matrices", "Singular value decomposition of linear maps", "You may complete these in groups of up to 3 students.", "You should be striving each week to understand the material on the assignments and the posted solutions.", "This will be a closed book exam, with no calculators permitted.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as writings proofs and communicating mathematical ideas.", "Library for research-based assignments"]}, {"course_id": 40, "course_code": "MATH 245", "course_name": "MATH245 - Linear Algebra 2 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["Linear Algebra 2 (Advanced Level)", "11:30AM - 12:20PM E2 1732", "E-mail: bmadill@uwaterloo.ca", "This is a second course in proof-based linear algebra.", "Particular emphasis will be placed on polynomials of linear operators, Jordan canonical form, and inner product spaces.", "Week of", "3 Sept. 16 Jordan Canonical Form I A1", "5 Sept. 30 Inner Product Spaces, Orthogonality T1", "A4", "10 Nov. 11 Singular Value Decomposition A6", "Linear Algebra by Friedberg, Insel, and Spence No"]}, {"course_id": 41, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 42, "course_code": "MATH 247", "course_name": "MATH247 - Calculus 3 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["Topology on RN: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. (~3 weeks)", "Differentiation: partial differentiability, differentiability, chain rule, [midterm likely here], Taylor polynomials, extreme value problems. (~4 weeks)", "Integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. (~3 weeks)", "Local properties of continuously differentiable functions:  open mapping theorem, inverse function theorem, implicit function theorem. (~2 weeks)", "11:30AM - 12:20PM QNC 2501", "Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem.", "Topology of real n-dimensional space: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. Differential calculus on multivariable functions: partial differentiability, differentiability, chain rule, Taylor polynomials, extreme value problems. Riemann integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem."]}, {"course_id": 43, "course_code": "MATH 239", "course_name": "MATH239 - Introduction to Combinatorics (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["Introduction to Combinatorics Winter 2025", "11:30AM - 12:20PM MC 4059", "09:30AM - 10:20AM MC 4021", "P. Nelson", "08:30AM - 09:20AM QNC 1502", "S. Pfannerer-Mittas", "10:30AM - 11:20AM MC 4058", "11:30AM - 12:20PM MC 4058", "09:30AM - 10:20AM MC 4042", "02:30PM - 03:20PM", "10:30AM - 11:20AM PHY 150", "04:30PM - 05:20PM", "You should have no reason to contact them directly, but you can find their email addresses through Learn.", "First name Last name", "Guilherme Zeus Dantas E Moura", "Theodore Morrison", "Matthew Kroeker", "Introduction to graph theory: colourings, matchings, connectivity, planarity.", "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.", "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 44, "course_code": "MATH 249", "course_name": "MATH249 - Introduction to Combinatorics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["Introduction to Combinatorics (Advanced Level)", "09:30AM - 10:20AM MC 2017", "For graph theory, while we will focus on the same topics covered in MATH 239 (planarity and bipartite matching), our coverage of those topics will differ substantially in depth and in the techniques that we employ; in particular, we will see striking applications of algebra.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 45, "course_code": "STAT 230", "course_name": "STAT230 - Probability (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["03:30PM - 04:20PM MC 4045", "09:30AM - 10:20AM MC 4045", "02:30PM - 03:20PM", "03:30PM - 04:20PM MC 2017", "08:30AM - 09:20AM", "Pavel Shuldiner; E-mail: pavel.shuldiner@uwaterloo.ca; M3 4108", "Come with well-organized questions to make the best use of your time.", "Requests must be emailed to sasugradadv@uwaterloo.ca", "Joint probability functions, marginal probability functions, and conditional probability functions of two or more discrete random variables and functions of random variables are also discussed.", "Post-requisite:", "Define a probability model and determine probabilities of events using counting techniques.", "Define and use probability mass functions, probability density functions, and cumulative distribution functions to determine probabilities of events.", "Use moment generating functions as a tool to determine expected values.", "This learning consists of taking the time to carefully read the lecture notes on your own, ensuring you understand the concepts and steps demonstrated in the lectures to tackle examples, and then solving the end-of-section problems.", "Definitions of Probability", "Mathematical Probability Models", "1.1", "1.2", "Counting in Uniform Probability Models", "Addition and Multiplication Rules for Counting", "Permutations and Combinations", "Counting in Uniform Probability Models", "Addition and Multiplication Rules for Counting", "Permutations and Combinations", "Addition Rules for Unions of Events", "1.3", "2.1", "2.2", "2.3", "Conditional Probability and Product Rules for Intersections of Events", "Probability Mass Functions, Cumulative Distribution Functions", "Functions of Random Variables", "3.2", "Expectation of a Random Variable", "Expectation of a Function of a Random Variable, Properties of Expectation", "Moment Generating Functions", "3.3", "3.4", "3.5", "Basic Terminology and Techniques", "Joint Probability Mass Functions, Marginal Probability Mass Functions", "3.5", "4.1", "Multinomial Distribution", "Linear Combinations of Random Variables", "4.2", "4.4", "Linear Combinations of Random Variables", "Law of Total Expectation", "4.4", "4.5", "4.6", "Law of Total Expectation", "Cumulative Distribution Function, Probability Density Function", "Functions of Random Variables", "4.6", "Expectation of a Random Variable", "Moments of a Distribution, Moment Generating Functions, Mean, Variance, Standard Deviation", "Exponential Distribution", "Normal Distribution", "Exponential Distribution", "Normal Distribution", "Use of the Normal Distribution in Approximations", "Therefore, you should plan to spend between 3 and 6 hours each week in out-of-class learning.", "This learning consists mainly of ensuring you understand the concepts and steps used in class to solve problems and then solving exercises from the Course Notes on your own.", "A 2.5-hour final cumulative examination will be held during the final exam period in April.", "In the case of extenuating circumstances, you must provide sufficient documentation via e-mail to Divya Lala at divya.lala@uwaterloo.ca as soon as possible to verify your absence's circumstances.", "Re-mark Requests:", "Cancellation of In-Person Classes:", "Intellectual property includes items such as:", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "This course includes the independent development and practice of specific skills for solving real-life problems using introductory probability rules.", "Library for research-based assignments"]}, {"course_id": 47, "course_code": "STAT 231", "course_name": "STAT231 - Statistics (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["Notice of Recording", "03:30PM - 04:20PM DC 1350", "02:30PM - 03:20PM", "11:30AM - 12:20PM MC 1085", "03:30PM - 04:20PM", "10:30AM - 11:20AM EIT 1015", "09:30AM - 10:20AM EIT 1015", "Email: aslynko@uwaterloo.ca", "Email: liqun.diao@uwaterloo.ca", "Email: yangjc@uwaterloo.ca", "Email: henan.xu@uwaterloo.ca", "Funmilayo Adeku", "Email: fadeku@uwaterloo.ca", "This course provides a systematic approach to empirical problem solving which will enable students to critically assess the sampling protocol and conclusions of an empirical study including the possible sources of error in the study and whether evidence of a causal relationship can be reasonably concluded.", "The connection between the attributes of a population and the parameters in the named distributions covered in STAT230 will be emphasized.", "Numerical and graphical techniques for summarizing data and checking the fit of a statistical model will be discussed.", "The method of maximum likelihood will be used to obtain point and interval estimates for the parameters of interest as well as testing hypotheses.", "The interpretation of confidence intervals and p-values will be emphasized.", "The Chi-squared and t distributions will be introduced and used to construct confidence intervals and tests of hypotheses including likelihood ratio tests.", "Contingency tables and Gaussian response models including the two sample Gaussian and simple linear regression will be used as examples.", "Course Information Webpage", "Please do not send these questions via email.", "I expect everyone to be respectful to each other, any posts that do not meet the principles in Policy 33: Ethical Behaviour will be removed.", "Email", "Please send emails from uwaterloo.ca email address and include the session number and student ID number.", "Continuity Plans", "Use numerical and graphical summaries of a data set to describe the characteristics of a variate and to check the fit of a statistical model to the data.", "Use the steps of PPDAC to identify both the objectives and possible sources of error in an empirical study, and to critically evaluate the conclusions.", "Identify the connection between attributes of a population and the parameters in the named distributions (Binomial, Poisson, Multinomial, Exponential, Normal).", "Define and use the likelihood function to obtain point estimates of the unknown parameters in a model particularly for the Binomial, Poisson, Multinomial, Exponential and Gaussian (Normal) models.", "Use a pivotal quantity to construct a confidence interval for a parameter in some specific cases, and interpret the confidence interval.", "Use the likelihood function to construct and conduct a test of hypothesis for an unknown parameter in a model.", "Interpret p-values and describe the connection with confidence intervals.", "Define the properties of the Chi-squared and t distribution.", "Define a Gaussian response model including simple linear regression; determine point and interval estimates and conduct tests of hypotheses for the parameters in a Gaussian model.", "Use a Goodness of Fit test to test the fit of a model, independence in a two-way table and equality of proportions for two or more groups", "Describe the importance of randomization and pairing in experimental design and be able to recognize whether a study design allows the researcher to conclude cause and effect.", "This learning consists of taking the time to carefully read the course notes on your own, making sure you understand the concepts and steps demonstrated in the lectures to tackle examples, and then solving the end-of-chapter problems.", "Monday", "Friday", "Welcome", "1.1 Introduction to Statistical Sciences", "1.3 Numerical Data Summaries", "1.3 Graphical Summaries", "1.4 Probability Distributions and Statistical Models", "1.5 Data Analysis and Statistical Inference", "1.6 Introduction to R and RStudio", "2.1 Choosing a Statistical Model", "2.2 Estimation of Parameters", "2.3 Method of Maximum Likelihood", "2.4 Likelihood Functions for Multinomial Models", "2.5 Invariance Property of MLE", "2.6 Checking the Model", "3.1 Planing and Conducting Empirical Studies", "3.2 Steps of PPDAC", "3.3 Case Study", "4.1 Statistical Models and Estimation", "4.2 Estimators and Sampling Distributions", "4.4 Confidence Intervals and Pivotal Quantities", "4.5 The Chi-Squared and t Distributions", "4.6 Likelihood-Based Confidence Intervals", "4.7 Confidence Intervals for Parameters in the Gaussian model", "4.7 Confidence Intervals for Parameters in the Gaussian model (Continued)", "5.1 Introduction to Hypothesis Testing", "5.2 Test of Hypotheses for Parameters in the Gaussian Model", "Relationship Between Hypothesis Testing and Confidence Intervals", "5.3 Likelihood Ratio Test of Hypothesis - One parameter", "6.1 Gaussian Response Models", "6.2 Simple Linear Regression: Maximum Likelihood and Least Squares Estimates", "Confidence Interval for Parameters in the Model", "6.3 Checking Model Assumptions and Residual Plots", "Randomization, Paring, and Experimental Design", "7.1 Likelihood Ratio Test for the Multinomial Model", "7.2 Goodness of Fit Tests", "This learning consists mostly of making sure you understand the concepts and steps that were introduced and used in class to solve examples and then solving problems from the Course Notes on your own.", "R Statistical Software", "R and the RStudio development environment can be downloaded from here.", "All assessments are proctored, in-person, and closed-book exams.", "A 2.5-hour cumulative final examination will be held during the final exam period (April 9 - 25, 2025).", "If you have a question regarding the marking of an assessment, you should first check the posted solutions on LEARN.", "First and last name", "Session number", "Please be specific and explain your rationale for a remark.", "Notice of Recording", "Short-term absence", "COVID-19-related absence", "No limits on number of submissions per term and only available during the formal lecture period", "In particular:", "Please inform us of these at the start of the course.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 48, "course_code": "STAT 241", "course_name": "STAT241 - Statistics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["RCH 307", "Part I, Talking Probability: The statistical approach to analyzing data begins with a probability model to describe the data generating process; that’s why, to study statistics, one must first learn to speak the language of probability.", "10-11 Some \"standard\" statistical problems: categorical data analysis; two-sample comparisons, confounding factors, randomization, and blocking; simple linear regression.", "Midterms (M) 30 pts @ 15 pts each", "Final (F) (100 - A - M) pts", "Date & Time Location", "Then, his final exam will be worth 100-A-M=100-0-6=94 pts."]}, {"course_id": 49, "course_code": "STAT 431", "course_name": "STAT431 - Generalized Linear Models and their Applications (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["Generalized Linear Models and their Applications Winter 2025", "Review of the normal linear model and maximum likelihood estimation; regression models for binomial, Poisson and multinomial data; generalized linear models; and other topics in regression modelling.", "The primary objective of this course is to introduce students to generalized linear models.", "Attention will be mainly directed towards theory and applications involving binary, categorical, and count data, although the generalized linear model will be presented in its full generality for responses from the exponential family.", "This course introduces several useful regression techniques for the analysis of data arising in many different settings (ie， medicine, industry, psychology etc.).", "The intended audience consists of students interested in advanced regression modeling.", "The objectives are to help students develop an understanding of the statistical theory and to equip them with the ability to fit regression models for a wide range of problems.", "run generalized linear regression for binary, categorical and count data and have a deep understanding of the underlying theories.", "Week 7 Dose-Response Models Lecture 11", "An Introduction to Generalized Linear Models by Dobson, AJ and Barnett, AG, fourth edition No 92", "Software: Students are encouraged to use R for coding problems in assignments, but feel free to use any computing software you feel comfortable with.", "An introduction to R: https://cran.r-project.org/doc/manuals/r-release/R-intro.pdf.", "Arrangements for students with official conflicts will be handled on a case by case basis."]}, {"course_id": 50, "course_code": "STAT 441", "course_name": "STAT441 - Statistical Learning - Classification (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["10:00AM - 11:20AM B1 271", "Email: mlysy@uwaterloo.ca", "STAT 841: View requirements for STAT 841", "Describe the basic principles and methods of statistical classification.", "Know when to use each of these methods on a given dataset.", "Evaluate and compare the output of various classifiers.", "An Introduction to Statistical Learning with Applications in R, by James, Witten, Hastie & Tibshirani https://www.statlearning.com", "There will be two closed-book midterms worth 15% each on the following dates:", "There are no make-up midterms in this course.", "Discussion Board", "Please self-enroll at https://piazza.com/uwaterloo.ca/winter2025/stat441841cm763.", "You can generally expect a response from TAs within two business days.", "Software", "Material and assignments will require the use of R and Python programming languages, as well as the technical document writing programs for these languages: R Markdown and Quarto.", "Regrades", "Email", "Emails which do not adhere to this standard will generally be ignored.", "Intellectual property includes items such as:", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 51, "course_code": "STAT 442", "course_name": "STAT442 - Data Visualization (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["Notice of Recording", "Data Visualization Winter 2025", "11:30AM - 12:20PM B1 271", "Discussion Board", "Email", "Response time", "Both human perception and statistical properties inform the methods used to display and visually explore categorical, continuous, time-ordered, map, and high dimensional data.", "Statistical concepts visually presented include variability, densities, quantiles, conditioning, and hypothesis testing.", "Interactive graphics include linking, brushing, motion, and the navigation of high dimensional spaces guided via projection indices.", "Interpret and critique the most commonly used kinds of visualizations today.", "Create a variety of univariate, bivariate, and multivariate graphs using base R and the tidyverse.", "Look up the necessary code to complete additional graphs not covered here.", "Book - Data Science - A First Introduction.", "Book - The Chicago Guide to Multivariate Analysis, Jane E. Miller", "Book - Cool Infographics - Effective Communication with Data Visualization and Design, Randy Krum.", "Industry Paper - Making Data Meaningful, United Nations Economic Commission for Europe.", "Notice of Recording", "No waiving of this penalty will occur for technical issues.", "Details can be found here: https://uwaterloo.ca/math/accommodations", "Phone: 519-884-0000 extension 213", "Lots of people look like they have it together in public and online when they're a mess inside too.", "They got you into university, so they've already done most of the work, but at this point, the most they can really do for you decide if you can get into graduate school before doing industry experience.", "Don't let that be your reason for thinking this is as good as it gets.", "In particular:", "Please inform me of these at the start of the course."]}, {"course_id": 52, "course_code": "STAT 443", "course_name": "STAT443 - Forecasting (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["Forecasting Spring 2024", "04:00PM - 05:20PM", "Email: jeremy.vanderdoes@uwaterloo.ca", "This course is an introduction to statistical forecasting.", "This includes considerations of forecasts and uncertainty.", "Speciﬁc topics include:", "Linear time series models: AR, MA, ARMA, ARIMA, SARIMA", "Forecasting: Principles and Practice, 3rd edition free online at https://otexts.com/fpp3/", "Time Series Analysis and Its Applications, 4th edition free online in library or at https://www.stat.pitt.edu/stoffer/tsa4/ Yes", "Introduction to Time Series and Forecasting free online in library Yes"]}, {"course_id": 53, "course_code": "STAT 444", "course_name": "STAT444 - Statistical Learning - Advanced Regression (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["Statistical Learning - Advanced Regression Spring 2024", "Topics cover a wide selection of advanced methods useful to address the challenges arising from real-world and high-dimensional data; methods include robust regression, nonparametric regression such as smoothing splines, kernels, additive models, tree based methods, boosting and bagging, and penalized linear regression methods such as the ridge regression, lasso, and their variants.", "Students will gain an appreciation of the mathematical and statistical concepts underlying the methods and also computational experience in applying the methods to real data.", "Topics cover a wide selection of advanced methods useful to address the challenges arising from real-world and high-dimensional data; methods include robust regression, nonparametric regression such as smoothing splines, kernels, additive models, tree-based methods, boosting and bagging, and penalized linear regression methods such as the ridge regression, lasso, and their variants.", "Students will gain an appreciation of the mathematical and statistical concepts underlying the methods and also computational experience in applying the methods to real data.", "2 Nonlinear Regression I: Basis functions and Splines 3 – 4", "4 Predictive Modelling I: Error Estimation and Model Assessment 7 – 9", "Generalized Additive Models: An Introduction with R https://www.taylorfrancis.com/books/mono/10.1201/9781315370279/generalized-additive-models-simon-wood No"]}, {"course_id": 54, "course_code": "CO 487", "course_name": "CO487 - Applied Cryptography (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["Instructor: Samuel Jaques", "Email: sejaques@uwaterloo.ca", "Timothy Miller", "Nicolas Swanson", "A broad introduction to modern cryptography, highlighting the tools and techniques used to secure internet and messaging applications.", "It is one of the core technologies for securing the emerging information infrastructure.", "This course is a comprehensive introduction to modern cryptography that is aimed primarily at those interested in applications.", "In the area of public-key cryptography, topics will include an overview of specific systems (Diffie–Hellman, RSA, DSA, etc.) and a few advanced protocols.", "The security of these schemes and the use of public-key techniques for generating digital signatures will be described.", "Linear and differential cryptanalysis of ciphers.", "Define the main information security goals of confidentiality, integrity, authentication, and availability", "Explain the intended security properties of each cryptographic primitive and analyze relationships between security properties", "Explain mathematical techniques underlying standardized cryptographic algorithms", "Identify flaws in uses of cryptographic algorithms", "Determine which cryptographic algorithms can be used and combined to build systems with desired functionality and security", "Understand and contextualize the cryptography and security around them in daily life", "0 1 (Jan 6-8) Introduction", "Symmetric Encryption", "3.6 9 Elliptic Curve Cryptography 4 Yes", "4   Applications", "Understanding Cryptography: From Established Symmetric and Asymmetric Ciphers to Post-Quantum Algorithms, 2nd edition, Springer, 2024 Primary reference.", "A1: January 23", "A4: March 20", "This will be clearly indicated for each such question.", "In that case you are required to work independently.", "These questions will test your ability to identify the important concepts introduced in lectures, and your understanding of them.", "In particular:", "Please inform us of these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 56, "course_code": "STAT 440", "course_name": "STAT440 - Computational Inference (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 1, "major_name": "Data Science (Bachelor of Computer Science - Honours)", "topics": ["Computational Inference Winter 2025", "PHY 313", "Introduction to and application of computational methods in statistical inference.", "Monte Carlo evaluation of statistical procedures, exploration of the likelihood function through graphical and optimization techniques.", "Topics include expectation-maximization, Bootstrapping, Markov Chain Monte Carlo, and other computationally intensive methods.", "A1 Feb 4th", "A4 Apr 3rd"]}, {"course_id": 0, "course_code": "CS 136L", "course_name": "CS136L - Tools and Techniques for Software Development (0.25)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Tools and Techniques for Software Development Winter 2025", "08:30AM - 10:20AM MC 3003", "10:30AM - 12:20PM MC 3003", "E. Ciklabakkal", "E. Ciklabakkal", "08:30AM - 10:20AM MC 4042", "E. Ciklabakkal", "10:30AM - 12:20PM MC 4042", "08:30AM - 10:20AM MC 3003", "10:30AM - 12:20PM MC 4060", "02:30PM - 04:20PM MC 4060", "E. Ciklabakkal", "10:30AM - 12:20PM MC 3003", "This course introduces students to tools and techniques useful in the software development lifecycle.", "Students learn to navigate and leverage commands and utilities in the Linux Command Line Shell.", "Students gain experience in version control software, writing scripts to automate tasks, and creating effective test cases to identify bugs.", "Students also gain experience in using built-in support for version control, testing, debugging, build automation, etc. in integrated development environments (IDEs).", "Interact with the Linux Operating System using a command line shell and gain familiarity with commands, utilities and tools.", "Create scripts to automate tasks and increase productivity while working on a software project.", "Design test cases and automate the testing process to check a program for functional correctness and incorrect memory usage.", "Use version control systems to share, contribute, manage and track code.", "Separately compile code modules and leverage build automation tools to do so efficiently.", "Module 0: Linux Shell, a first look", "Module 2: Testing and Debugging", "Module 9: Debugging", "Each lab consists of a number of lab problems.", "Each lab problem has two associated values, a lower one called the pass threshold and a higher one called the completion threshold.", "Special note on test cases: if a lab question asks you to submit test cases, you must create these tests yourself.", "Do not directly copy code from GenAI.", "Do not ask GenAI for a step-by-step breakdown of how to solve a lab problem.", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 1, "course_code": "CS 341", "course_name": "CS341 - Algorithms (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Algorithms Winter 2025", "10:00AM - 11:20AM MC 4061", "08:30AM - 09:50AM MC 1056", "The study of efficient algorithms and effective algorithm design techniques.", "Topics include divide and conquer algorithms, recurrences, greedy algorithms, dynamic programming, graph search and backtrack, problems without algorithms, NP-completeness and its implications.", "DPV", "Introduction to Algorithms, by Cormen, Leiserson, Rivest and Stein, MIT Press.", "describe the main idea first,", "Extensions and Other Accommodations on Assignments", "Students can currently self-declare two kinds of absences on Quest: short-term absence and pandemic-related absence.", "Since a short-term absence lasts 2 days, this means the only accommodation we offer for a short-term absence is a 48 hour extension.", "If you request accommodations through AccessAbility Services (AAS) by filling out a Missed Course Component form, the accommodation is determined on a case-by-case basis through consultation with AAS, but will generally be one of the above options unless your situation is unusual.", "If you collaborate with others, you must clearly indicate the collaboration for each problem.", "This is not a software engineering course; we will not test your code against inputs that do not match our specifications.", "Continuity Plan", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 2, "course_code": "CS 348", "course_name": "CS348 - Introduction to Database Management (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Database Management Winter 2025", "S. Salihoglu", "S. Salihoglu", "This course is an introduction to database management systems (DBMSs), which are the core software systems that applications use to store, manage, query, and manipulate very large-scale data efficiently.", "Fundamentals of data management: the relational data model and its query languages; integrity constraints; indexes and views to make DBMSs efficient for an application workload; and transactions to ensure safe and concurrent access and manipulation of data, focusing on fundamental topics such as serializability and ACID guarantees of a DBMS.", "Database design methodology, which shows how to design \"good\" databases instead of \"bad\" ones and how this can be made formal using the theory of normalization.", "These principles and tools will be very important when you build your own data-intensive applications in your careers.", "In contrast, topics under (3) are from the perspective of system engineers that actually implement the DBMS, and aims to engage students interested in the low-level implementations of the core data structures, algorithms, and protocols DBMSs use to support higher-level applications.", "Data Model: Relational Model", "High Level Query Language: Relational Algebra & SQL, Datalog", "E/R Models", "Normal Forms", "Embedded vs Dynamic SQL", "Frameworks", "Physical Record Design", "Query Planning and Optimization", "Indexes", "RDF Systems", "Database System Concepts (DSC) (Seventh Edition) Abraham Silberschatz, Henry F. Forth and S.Sudarshan, McGraw Hill.", "Project-based: A1(10%)+A2(10%)+A3(10%)+Project(30%)+Midterm(15%)+Final(25%)"]}, {"course_id": 3, "course_code": "CS 431", "course_name": "CS431 - Data-Intensive Distributed Analytics (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Data-Intensive Distributed Analytics Fall 2024", "10:00AM - 11:20AM MC 2035", "Introduces non-CS major students to infrastructure for data-intensive analytics, with a focus on abstractions, frameworks, and algorithms that allow developers to distribute computation across many machines.", "Topics include core concepts (partitioning, replication, locality, consistency), computational models (MapReduce, dataflows, stream processing, bulk-synchronous parallel), and applications.", "Explain the key concepts in distributed big data projects", "Write clean and efficient Hadoop MapReduce and Spark code", "Understand and design distributed algorithms for the analysis of textual, graph, and relational data", "Explain the design issues involved with distributed relational and non-relational database systems such as Apache HBase / Google BigTable", "Introduction to Distributed Text Processing 1", "Introduction to Hadoop MapReduce 3", "Introduction to Apache Spark 3", "Distributed Database Systems 3", "This course includes the independent development and practice of specific skills, such as designing MapReduce and Spark code.", "Library for research-based assignments"]}, {"course_id": 4, "course_code": "STAT 330", "course_name": "STAT330 - Mathematical Statistics (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Mathematical Statistics Winter 2025", "10:30AM - 11:20AM DC 1351", "This course provides a mathematically rigorous treatment for topics covered in STAT230 and 231, and to make essential extensions to the multivariate case.", "Topics covered include independence of random variables, conditional expectation and the determination of the distribution of functions of random variables using the cumulative distribution method, change of variable and moment generating functions.", "Asymptotic properties of the maximum likelihood estimator are examined and used to construct confidence intervals or regions.", "Tutorial: tutorials will be used for going over solutions of practice problem sets and holding term tests.", "Have a deep understanding of various mathematical aspects of Statistics and Probability.", "Week 4 Chapter 3. Expectation & M.G.F. Term Test 1 January 28th", "Asymptotic Distributions", "Introduction to Probability and Mathematical Statistics by Bain and Engelhardt, Second Edition No 112", "Arrangements for students with official conflicts will be handled on a case by case basis."]}, {"course_id": 5, "course_code": "STAT 331", "course_name": "STAT331 - Applied Linear Models (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Applied Linear Models Winter 2025", "08:30AM - 09:50AM MC 4020", "02:30PM - 03:20PM", "RCH 101", "Thursdays from 3:00-4:00pm in M3 3021", "Modelling the relationship between a response variable and several explanatory variables (an output-input system) via regression models.", "Model diagnostics and improvement.", "Algorithms for variable selection.", "Review of basic Normal theory, t, chi-squared, and F distributions.", "Simple linear regression.", "Analysis of variance.", "Multiple linear regression, variable selection techniques, indicator variables, diagnostics.", "Brief introduction to non-linear regression, factorial experimentation.", "Registered students can enroll in the class discussion board through Piazza.", "Search for your question first before posting.", "Do not expect a full solution to your question.", "To help maintain a safe, respectful, and productive community in which we – students and teaching team alike – can take risks in our learning/teaching, tackle challenging concepts, and ultimately grow as learners, we should endeavor to follow these mutual expectations:", "Explain the main concepts of linear regression models.", "Understand the methods of least squares and maximum likelihood estimation for model parameters.", "Interpret the model and its parameters (e.g., regression coefficients) in the context of any application.", "Draw inferences from a fitted model about the parameters of interest and make predictions.", "Apply the previous two outcomes when fitting linear models to real data using R.", "Assess model quality by diagnosing violations in underlying model assumptions (and identify strategies for improvement).", "Evaluate competing fitted models built using various model selection methods (and choose between them).", "Introduction", "The Straight Line Model", "Model formulation and interpretation", "Least squares estimation", "Mean response and residual variance estimation", "Introduction to R/RStudio", "Maximum likelihood estimation", "Estimators and their properties", "Important distributions", "Distributions of estimators", "Confidence intervals", "O - Ch. 2-4", "Straight Line Model in R", "Prediction intervals", "Intervals in R", "Hypothesis testing", "O - Ch. 4-5", "ANOVA and F test", "Model limits", "Data transformations", "O - Ch. 4-6", "O - Ch. 7", "A1 and Q1 Solutions", "Multivariate normal distribution", "The Linear Model", "Examples", "O - Ch. 8-9", "Estimation", "Estimators and their properties", "Distributions of estimators", "O - Ch. 9, 11, 12", "ANOVA and F test", "Significance tests", "General linear hypothesis", "O - Ch. 9, 11, 12", "A2 and Midterm Solutions", "Case Study: South African heart disease", "Nested models", "Additional sum of squares", "O - Ch. 12", "Outliers", "O - Ch. 13-14", "Influence", "O - Ch. 14-15", "A3 and Q2 Solutions", "One-variable-at-a-time selection methods", "Criteria-based selection methods", "O - Ch. 16", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solve exercises from the textbook on your own.", "Introduction to Regression Modeling by Abraham and Ledolter This textbook is an optional reference book (available for free on LEARN).", "R and R-Studio Free software.", "To serve as an opportunity to demonstrate your understanding, application, and integration of the course material, including practical application of the skills/concepts with the statistical software, R.", "Missed Assignment: The time window to complete these assessments are generous and, in general, a sickness lasting a couple of days will not be enough of a reason to ask for alternative accommodations and/or extension.", "Tips for Success", "Students should critically compare their work with available solutions and against the solutions of fellow classmates.", "Notice of Recording", "To help you decide if you should isolate, you can use the provincial self-assessment tool.", "In the scenario where we must transition back online the following contingencies will be used:", "These materials are made available for the personal use of students registered in the current offering of this course.", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical proofs and the fitting, interpretation, and assessment of linear models in real applications.", "Library for research-based assignments"]}, {"course_id": 6, "course_code": "STAT 332", "course_name": "STAT332 - Sampling and Experimental Design (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Sampling and Experimental Design Winter 2025", "Email: schonlau@uwaterloo.ca", "Designing sample surveys.", "Analysis of variance.", "Designing for comparison of groups.", "Sampling: explain the effect of the finite population correction", "Sampling: Design and analyze a stratified random sample", "Experimental: Explain factorial design", "Experimental: Compare and contrast experimental design and observational studies", "5 2025-01-21 6 regress A1 out", "15 2025-03-04 4 Anova/F-test", "Slides Online in learn Yes 0", "Slides:  I am reworking some slides and will post them one-by-one into learn before class.", "data collection) 2%", "Activities supporting in-class analysis: The in-class analysis will require data collection (and possibly other activities).", "All team members must meaningfully contribute to the analysis and to coding.", "Projects must not use data sets that one of the team members has used for similar projects in previous courses.", "You must write up solutions using your own words and write your own programs.", "Give a clear explanation as to why you think you deserve a different mark."]}, {"course_id": 7, "course_code": "STAT 333", "course_name": "STAT333 - Stochastic Processes 1 (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM DC 1350", "04:00PM - 05:20PM", "Erik Hintz: Fridays, 2:00pm - 3:00pm, in M3-2106", "Requests must be emailed to: sasugradadv@uwaterloo.ca", "Topics cover generating functions, conditional probability distributions and conditional expectation, discrete-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, applications including the random walk, the gambler's ruin problem, and the Galton-Watson branching process, an introduction to counting processes, connections between the exponential distribution and Poisson process, and non-homogeneous and compound Poisson processes.", "use moment generating functions as a tool to determine expected values and identify probability distributions of random variables;", "use the law of total expectation to calculate expected values and probabilities through the principle of conditioning;", "specify a discrete-time Markov chain (DTMC), in terms of its transition probability matrix and initial conditions, and calculate various transition probabilities;", "classify the states of a DTMC;", "define fundamental DTMC concepts including irreducibility, periodicity, and recurrence/transience;", "find limiting/stationary probability distributions for certain DTMCs through the use of the Basic Limit Theorem;", "calculate absorption probabilities and expected absorption times for DTMCs using the principle of conditioning with respect to the first transition;", "Week 11 March 24 - March 28 Chap 4: Exponential Distribution & Poisson Processes Tutorial Assignment 2", "Week 12 March 31 - April 4 Chap 4: Exponential Distribution & Poisson Processes Tutorial Test 3", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solving exercises from the Course Notes on your own.", "Introduction to Probability Models by Sheldon M. Ross (2019)"]}, {"course_id": 8, "course_code": "STAT 341", "course_name": "STAT341 - Computational Statistics and Data Analysis (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Computational Statistics and Data Analysis Winter 2025", "04:00PM - 05:20PM", "10:00AM - 11:20AM EIT 1015", "04:30PM - 05:20PM", "Megan French", "Daniel Zhang", "While personal matters can be communicated via email, Piazza should be the primary platform for Q&A outside of class.", "A computationally focused approach to statistical reasoning in the context of real data.", "Functional programming in R and algorithms will be used to define interesting attributes of finite populations and their sampling characteristics.", "Understand the fundamentals of population-based statistical analyses, as well as implicitly/explicitly defined population attributes", "Understand the basics of sampling and the underlying ideas/mechanisms of probability sampling and related issues", "Understand the basics of inductive inference including target and study populations, measurements, comparing subpopulations, random intervals and coverage probabilities, and resampling methods such as bootstrap", "Generate high-quality visualization and inferential statistics R output for the topics above", "Prepare reports that communicate your statistical analyses using LaTeX and R Markdown.", "Jan. 6 Introduction to the course", "location and scale invariance/equivariance", "Power transformations and linear relationships", "Implicitly defined Attributes", "Solving system of equations Assignment #1", "Iteratively re-weighted least-squares", "Sampling mechanisms and inclusion probabilities", "Sampling design", "9. Mar. 3 Anatomy of tests of significance", "A t-like discrepancy measure  Assignment #2", "Mar. 10 Multiple testing", "Student-t-based intervals", "Mar. 17  Introduction to resampling methods", "Bootstrap in regression", "Multiple samples and prediction", "Decomposition of APSE, bias-variance trade-off", "Training and Test sets", "K-fold cross validation Assignment #3", "Each folder will contain five files, e.g. for section 2.1-", "There will be a 2.5-hour, closed book, cumulative final exam during the Final Examination Period: April 9 – April 25.", "An INC grade is rarely granted and will be considered on a case-by-case basis, with decisions based largely on your performance throughout the semester.", "Self-Declared COVID-19 Related Absences: You may self-declare one absence per term during the formal lecture period for influenza-like illnesses.", "Course Software: R is a language and a free statistical computing and graphics software that we will use extensively throughout the course.", "The only time you may run into trouble is if you call a function from a package to handle a task you have been asked to code out explicitly.", "For example, if you are asked to code a function that calculates the mean of a vector in R, and your solution is to just call the function mean(), then you will not receive any marks.", "Communication: When you email your instructor, make sure you include the following information in your email:", "Including non-English characters in your email (sometimes imposed by installing a non-English operating system) prompts UW servers to spam your emails for the instructor.", "These characters most often appear in (not exclusively) the subject line, From, To, and Date/Time portions of previous communications if you reply to an email.", "You must use the web-based email platform if you suspect that you have non-English characters in your emails imposed by your computer, phone, tablet, etc.", "This course includes the independent development and practice of specific skills related to computational statistics and data analysis.", "Phone: 519-884-0000 extension 213"]}, {"course_id": 9, "course_code": "CS 136", "course_name": "CS136 - Elementary Algorithm Design and Data Abstraction (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Elementary Algorithm Design and Data Abstraction Winter 2025", "08:30AM - 09:50AM MC 2017", "10:00AM - 11:20AM MC 2038", "10:00AM - 11:20AM MC 4059", "11:30AM -", "Monday -", "Monday", "07:00PM - 08:50PM", "This course builds on the techniques and patterns learned in CS135 while making the transition to use an imperative language.", "Topics discussed include iterative and recursive sorting algorithms; lists, stacks, queues, trees, and their application; abstract data types and their implementations.", "produce well-designed, properly formatted, documented and tested programs of a moderate size (200 lines) that can use basic I/O", "explain and demonstrate the use of the C memory model, including the explicit allocation and deallocation of memory", "explain and demonstrate the principles of modularization and abstraction", "implement, use and compare elementary data structures (structures, arrays, lists and trees) and abstract data type collections (stacks, queues, sequences, sets, dictionaries)", "If both exams are held in person", "If both exams must be held online", "If in-person exams cannot be held then they will be held online (if possible).", "You may also ask on the discussion forums in a private message.", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 10, "course_code": "CS 146", "course_name": "CS146 - Elementary Algorithm Design and Data Abstraction (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Elementary Algorithm Design and Data Abstraction (Advanced Level)", "Monday -", "Monday", "07:00PM - 08:50PM", "02:30PM - 03:20PM", "Brad In-person MC 6427", "On-line Consulting Hours: Microsoft Teams", "CS 146: Elementary Algorithm Design and Data Abstraction (advanced version)", "To familiarize students with key concepts in introductory computer science from an imperative perspective and to contrast this with the functional perspective taken in CS 145;", "To allow students to complete the CS portion of their Math core requirements and, if desired, to continue on to second-year core courses in CS;", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "Introduction to C and elementary mutation in Scheme", "The memory model.", "Variable declaration, assignment and infix expressions in C. Basic I/O in C. Compilation.", "Algorithm analysis in C. File I/O in C and Scheme.", "Program organization and testing methods.", "Space analysis in C and Scheme.", "Mutable lists, queues, deques, and trees in C. Time-space tradeoffs among mutable and immutable ADT implementations.", "Low-level abstractions", "Pointer arithmetic in C. Arrays in C and vectors in Scheme.", "Strings in C. Elementary hashing.", "Libraries in C and Scheme.", "Implementing high-level abstractions", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "The provided slides are not a substitute for attendance in any first-year CS course, but in CS 146, there are no slides, and the lecture summaries made available after lecture are an even worse substitute for attendance.", "Lectures will involve the development of ideas summarized very tersely in the handouts, as well as on-the-fly development of code, analyses, and proofs.", "CS145 and CS146 were originally designed as a year-long unit of curriculum, but eventually the individual courses drifted in their own directions.", "1.1 A note on logistics", "1.2 Review of forms of recursion and associated proof techniques", "1.3 In preparation for side effects", "1.4 Output", "1.5 Input", "1.6 First Introduction to C", "1.8 Memoization", "1.9 Mutation in C", "1.11 Boxes in C", "1.12 Advanced mutation", "1.13 Aliasing in C", "1.14 Memory and vectors", "1.15 Vectors in Racket", "1.16 Arrays in C", "1.18 ADTs in C; Amortized Analysis", "2 SIMPL: a simple imperative language", "2.1 Syntax and informal semantics", "2.2 Examples in several languages", "2.3 Formal semantics", "2.5 Proving imperative programs correct", "A primitive imperative language", "3.1 A primitive imperative language", "3.2 The PRIMPL simulator", "3.4 The SIMPL to A-PRIMPL compiler", "3.6 Strings in C", "3.7 Adding functions to SIMPL", "3.8 Adding both arrays and functions to SIMPL", "3.9 Implementing lists in PRIMPL", "4 MMIX: a realistic instruction set", "4.1 A more realistic processor", "4.2 The MMIX architecture", "4.2.1 Branches and Jumps", "4.2.2 Example", "4.2.3 Software Interrupts", "4.2.5 A Problem with Branches and Jumps", "4.4 Towards a SIMPL to MMIX compiler", "5.1 Storing primitive values", "5.3 Managing memory", "5.4 Structural and pointer equality", "5.5 Function application in a Racket interpreter", "5.7 Justifying the cost of Racket primitives", "5.8 Moving towards implementation in an imperative language", "6.2 Zippers", "6.3 A continuation-passing interpreter", "6.6.2 Mark-and-sweep", "6.6.3 Copying garbage collection", "6.7 Heterogeneous Data in C", "6.8 Multidimensional Arrays in C", "6.10 Variable-length Argument Lists", "7.1 Continuation-passing style", "7.2 Exception handling", "7.3 Undelimited continuations", "7.4 Delimited continuations", "7.5 Racket’s implementation of continuations", "In CS 146, we will examine the imperative paradigm, and compare and contrast the way that efficient algorithms and data structures are designed in imperative and functional languages.", "Racket is a laboratory for current research on aspects of functional programming languages, and we will continue to look at interesting topics in this area, perhaps at the cost of some coherency in the flow of material.", "They will not be due each week on the same day, as is common in the other first-year CS courses and the first-year Math courses.", "Assignment questions are the main way to reinforce and deepen your understanding of the concepts and skills discussed in lecture.", "You will submit program files electronically to the Marmoset system , which runs tests on your code and informs you of the results fairly rapidly.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "(Please also note that we may use the trends in a student's submission history to estimate the likelihood of other forms of cheating as well.)", "Library for research-based assignments"]}, {"course_id": 11, "course_code": "CS 240", "course_name": "CS240 - Data Structures and Data Management (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Data Structures and Data Management Winter 2025", "10:00AM - 11:20AM RCH 112", "11:30AM -", "10:30AM - 11:20AM MC 4040", "11:30AM - 12:20PM MC 4040", "Email: oveksler@uwaterloo.ca", "Email: cs240@uwaterloo.ca", "Email: cs240@uwaterloo.ca", "All of Tom's consulting hours are in-person in MC 4065.", "Email: cs240@uwaterloo.ca", "Email: cs240@uwaterloo.ca", "Email: cs240@uwaterloo.ca", "Instructional Support Coordinator: Karen Anderson", "Email: kaanders@uwaterloo.ca", "Introduction to widely used and effective methods of data organization, focusing on data structures, their algorithms, and the performance of these algorithms.", "CS 240: Data Structures and Data Management", "This course introduces widely used and effective methods of data organization, focusing on data structures, their algorithms, and the performance of these algorithms.", "Analyze, apply, and use various data structures and data-management techniques in a variety of applications", "Perform rigorous complexity analyses of simple algorithms and data structures, which includes writing correct mathematical proofs on inductively-defined structures and solving simple recurrence relations", "Select a good data structure to solve a specific algorithmic problem", "Apply data structures correctly and efficiently in one or more high-level programming languages, including C++", "Audience", "Successors: Most third-year CS major courses", "Conflicts: Other courses that seriously consider efficiency and correctness of fundamental data structures and their algorithms", "Analytical:", "Define and explain order notation; perform complexity analyses of simple algorithms", "Perform basic computations of discrete probability and expectation", "Use mathematical induction on recursively defined structures, including finding simple errors in inductive arguments", "Prove simple properties of program fragments correct through the use of pre-conditions and post-conditions for loops and recursive calls", "Computational and algorithmic:", "Design, implement, test, and debug C++ programs to solve problems requiring hundreds of lines of code", "Define the ADTs for stacks and queues; write efficient implementations in C/C++", "Describe tree structures, including binary search trees and multi-way trees; use these structures in C/C++ programs", "Describe basic sorting algorithms (including Quicksort) and implement them in C/C++", "Perform rigorous asymptotic analyses of simple algorithms and express the result using order notation; compare algorithms based on their asymptotic complexity; and prove formal results involving order notation", "Apply the priority-queue ADT to solve various application problems, implement a priority queue using heaps, and analyze the complexity of common implementations of heap operations", "Develop best-, worst- and average-case analyses of sorting algorithms, including Quicksort, and explain the ramifications of these analyses in practice; explain the basic principles of randomized algorithms and their potential advantages, specifically in the case of Quicksort; explain the difference between comparison-based sorting and non-comparison-based sorting algorithms, and when and why the latter may run faster; and apply sorting-based techniques to algorithmic problems, such as elimination of duplicates", "Explain the advantages and disadvantages of various hashing techniques; identify the best hashing techniques to use in a particular application scenario; and recognize when hashing techniques are preferable to other dictionary implementations", "Design data structures for real-world data (where keys are often inherently multidimensional) in such a way that common operations (including range search) can be implemented efficiently", "Design special data structures that can efficiently store and process words and strings, and select and apply a suitable technique for data compression in a specific application scenario", "Introduction and review (3 hours)", "Basic computer model: the random-access machine", "Runtime of an algorithm: worst-case, best-case, and average-case", "Review of stacks and queues", "Priority queue ADT and simple implementations", "Sorting and analysis of randomized algorithms (5 hours)", "Quicksort (non-randomized): worst-case, best-case, and average-case complexity", "Randomized quicksort and its analysis; application to selection and its analysis", "Lower bound on comparison-based sorting", "Non-comparison-based sorting algorithms (e.g., Counting Sort and Radix Sort)", "Dictionary ADT and simple implementations", "Binary search trees (insert and delete operations and analysis)", "Key-indexed search, simple hash functions", "Range search in a binary search tree", "Algorithms and data structures for text processing (8 hours)", "Sometimes these include animations/overlays, in case of which there will be both a Display version (with them) and a Print version (omitting them, but otherwise the same content).", "The slides for each module will be posted as the term progresses.", "Module 1 Introduction and Asymptotic Analysis M1.pdf", "Module 3 Sorting, Average-Case and Randomized Algorithms M3.pdf", "Optional: Goodrich & Tamassia   8.3", "Module 8 Range-Searching in Dictionaries of Points   Course notes Chapter 8", "A0.tex", "A1.tex", "The following books are on reserve in the DC library for reference and additional resources:", "Algorithm Design and Applications (2015)", "Also covers cuckoo hashing.", "Sedgewick] Algorithms in C++, Third Edition (1998)", "Computational Geometry: Algorithms and Applications", "CLRS] Introduction to Algorithms, 2nd edition (2001)", "Introduction to Algorithms, 2nd edition is also avaliable online (in campus).", "This website will be the primary means of communication and distribution of materials for the course.", "The course uses a number of different tools for distributing information and receiving submissions.", "These are not worth credit, but may help you in self-testing your understanding of the material.", "Only one programming question can be shifted to the final exam.", "If more than this has verification for non-submittal, then it will be considered on a case-by-case basis.", "A student with a medical reason may not be granted an INC because they have not performed sufficiently well during the academic term.", "An INC will be granted ONLY if there is a strong reason for missing the exam (generally a serious medical issue verified by a doctor's note) AND a satisfactory performance during the term (both assignments and midterm).", "Academic Dishonesty", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "The first criterion for marking is the correctness, the second criterion is efficiency.", "describe the main idea first in words,", "In the case that you are using facts stated in lectures/modules, be sure to cite where you got them from.)", "Files should be named .cpp, where the specific file name will be specified in the assignment.", "You should include sufficiently many comments in your code that the main ideas of design and correctness are clear.", "One-line changes: In the case you passed the public test, and failed some secret tests, if your program works with a one line change, then we may accept it for remarking and give some marks after deducting a penalty (typically 10-20% of the programming question).", "Here are some ways to create PDF files:", "Create your solution in LaTeX. LaTeX is a document preparation system that uses a mark-up language to write/create and co-ordinate different parts of documents, including diagrams and was introduced in Assignment 0.", "The following are least preferred methods since the results may be hard for markers to read and/or the files may be too large.", "Submitting a Re-Mark Request: Please email cs240@uwaterloo.ca in order to submit a request.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 12, "course_code": "CS 240E", "course_name": "CS240E - Data Structures and Data Management (Enriched) (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Data Structures and Data Management (Enriched)", "10:00AM - 11:20AM MC 4041", "Email: biedl [", "Email: cs240e", "All of Tom's consulting hours are in-person in MC 4065.", "Email: cs240", "Instructional Support Coordinator: Karen Anderson", "Email: kaanders [", "Module 1 Introduction and Asymptotic Analysis Course notes Chapter 1 (skip 1.5 for now)", "(updated)  Sorting, Average-Case and Randomized Algorithms Course notes Chapter 3 (and parts of 1.5)", "Optional: Goodrich & Tamassia   8.3", "Module 8 Range-Searching in Dictionaries of Points Course notes Chapter 8", "Tutorial 3 Friday, January 24 Average-case vs expected, sorting", "The following books are on reserve in the DC library for reference and additional resources:", "Algorithm Design and Applications (2015)", "Also covers cuckoo hashing.", "Sedgewick] Algorithms in C++, Third Edition (1998)", "Computational Geometry: Algorithms and Applications", "CLRS] Introduction to Algorithms, 2nd edition (2001)", "Introduction to Algorithms, 2nd edition is also avaliable online (in campus).", "Only one programming question can be shifted to the final exam.", "If more than this has verification for non-submittal, then it will be considered on a case-by-case basis.", "A student with a medical reason may not be granted an INC because they have not performed sufficiently well during the academic term.", "An INC will be granted ONLY if there is a strong reason for missing the exam (generally a serious medical issue verified by a doctor's note) AND a satisfactory performance during the term (both assignments and midterm).", "Academic Dishonesty", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Communication & Resources in CS 240E", "CS240E uses a variety of platforms in order to communicate and provide course materials to students.", "If your issue is confidential, but not specifically for one member of the course personnel, then a better option might be a private post to piazza.", "You can ignore these if you are comfortable with the material.", "Written assignments are submitted electronically using Crowdmark - a web-based submission and marking system.", "To submit files for Assignments, follow these instructions:", "Under each question, you can select files to add them to your submission for that question.", "You can submit and re-submit files as many times as you want before the deadline.", "Logging In", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 13, "course_code": "CS 241", "course_name": "CS241 - Foundations of Sequential Programs (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["ISA", "Yiwen Dong", "ISC", "The relationship between high-level languages and the computer architecture that underlies their implementation, including basic machine architecture, assemblers, specification and translation of programming languages, linkers and loaders, block-structured languages, parameter passing mechanisms, and comparison of programming languages.", "Write short machine- and assembly-language programs to perform simple data manipulation", "Write a basic assembler supporting labels", "Give formal specifications for regular languages, including regular expressions and finite-state machines", "Write a scanner capable of dealing with a typical high-level programming language (given the specification)", "Give a grammar for a context-free language and create derivations for strings in a context-free language", "Perform context-sensitive analysis including type checking for high-level languages", "Write a simple code generator for an imperative language, i.e., one doing little or no optimization", "Apply appropriate design decisions when programming in C/C++ based on a detailed understanding of the way memory is used by a running C/C++ program", "Week 1: Introduction and Modules 1, 2", "20M+40F", "This course includes the independent development and practice of specific skills, such as development of large software artifacts.", "Library for research-based assignments"]}, {"course_id": 14, "course_code": "CS 241E", "course_name": "CS241E - Foundations of Sequential Programs (Enriched) (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["03:30PM - 04:20PM MC 1056", "02:30PM - 03:20PM", "07:00PM - 08:50PM", "The relationship between high-level languages and the computer architecture that underlies their implementation, including basic machine architecture, assemblers, specification and translation of programming languages, linkers and loaders, block-structured languages, parameter passing mechanisms, and comparison of programming languages.", "Non-enriched version: Any CS 241E student may switch to the regular version of CS 241 during the first two weeks of lectures.", "Machine-level implementation of high-level language features (9 hours)", "Introduction to formal languages.", "Regular languages, regular expressions and finite state machines.", "Semantic Analysis and Code generation (6 hours)", "Dynamic Memory Allocation.", "Write short machine- and assembly-language programs to perform simple data manipulation.", "Write a basic assembler supporting labels.", "Give formal specifications for regular languages, including regular expressions and bubble diagrams.", "Write a scanner capable of dealing with a typical high-level programming language (given the specification).", "Give a grammar for a context-free language and, given a grammar, produce a derivation for a given string in the language.", "Write a simple code generator for an imperative language, i.e., one doing little or no optimization.", "Apply appropriate design decisions when programming in C/C++ based on a detailed understanding of the way memory is used by a running C/C++ program.", "I Sept. 5 Introduction", "A link to the Marmoset system and instructions for using it may be found on the course web page.", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as implementing and debugging a compiler.", "Library for research-based assignments"]}, {"course_id": 15, "course_code": "CS 245", "course_name": "CS245 - Logic and Computation (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Logic and Computation Winter 2025", "10:30AM - 11:20AM MC 4041", "Formalizing the notions of correct and incorrect reasoning, defining what is computable, and exploring the limits of computation.", "The course covers a variety of topics related to logic and computation that are required as background for other courses in Computer Science.", "It differs both in tone and content from a logic course one would typically find in a mathematics program.", "Develop mathematical reasoning skills", "Improve understanding of propositional and first-order logic, including key notions, such as: expressing natural language statements as logical formulas, distinguishing between correct and incorrect reasoning (between valid and invalid logical arguments), constructing a formal proof, distinguishing between syntax and semantics", "Explore the limits of computers, including decidability and undecidability", "Introduction", "Structural induction and its use in proving statements about formulas", "Adequate sets of connectives", "Soundness and completeness of formal deduction", "Applications of propositional logic to computer science, such as: Automated proofs: Resolution, Davis-Putnam Procedure; Hardware and software veriﬁcation", "First-Order Logic", "Limitations of propositional logic, and the necessity of first-order logic for reasoning about objects and properties", "Quantiﬁers, universe of discourse, translation between English and first-order logic formulas", "Syntax of first-order logic: terms, formulas", "Semantics of first-order logic: valuations", "Proving argument validity in first-order logic (semantically)", "Formal deduction in first-order logic; Proving argument validity by formal deduction (syntactically)", "Applications of first-order logic to computer science, such as: Automated theorem provers and veriﬁers; Databases", "Decidability and Peano Arithmetic", "Turing Machine as a model of computation", "Undecidability: Basic notions, undecidability of the Halting Problem and other decision problems", "The Peano axioms for number theory (including the induction axiom), undecidability of Peano Arithmetic", "An Important Application of Logic to Computer Science", "Hoare triples", "partial and total correctness", "Formalize English sentences into properly formed formulas in the propositional and first-order logic and, conversely, interpret such formulas in English", "Formalize the notion of correct reasoning and proof, and be able to construct formal proofs", "Realize the limitation of formal proof systems", "Understand the applications of logic to computer science", "This means that you must decide whether to exercise your option to submit late before the deadline, and refrain from making a partial submission in this case.", "There will be a marked quiz due in each week when there will not be a Crowdmark assignment due or a mid-term examination.", "This course includes the independent development and practice of specific skills, including writing numerous proofs using numerous abstract definitions.", "Library for research-based assignments"]}, {"course_id": 16, "course_code": "CS 245E", "course_name": "CS245E - Logic and Computation (Enriched) (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["10:00AM - 11:20AM MC 2034", "Tuesday -", "This includes:", "Basic sematic notions:", "Truth tables", "A formal proof system for Propositional logic", "Soundness and completeness theorems for the proof system", "Basic sematic notions", "Structures for a vocabulary", "Logical truths and logical implications", "Translations between FOL formulas and English and mathematical statements.", "A formal proof system for Predicate logic", "Soundness theorem for the proof system", "However, the focus of this version of the course is more on fundamental and mathematical concepts (on the expense of developing technical skills, such as designing formal proofs).", "We will use propositional logic as a main tool for demonstration key logical concepts such as", "Structural induction its justification and many applications.", "soundness and completeness theorems", "the expressive power of the logic (what can and what cannot be expressed).", "We will revisit these topics for first order logic.", "Finally, we will discuss applications of logic to computer science, in particular showing limitations of computations (undesirability)."]}, {"course_id": 17, "course_code": "CS 246", "course_name": "CS246 - Object-Oriented Software Development (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Object-Oriented Software Development Winter 2025", "10:00AM - 11:20AM MC 1056", "10:30AM - 11:20AM MC 3003", "11:30AM - 12:20PM MC 3003", "Tuesday -", "Ross Evans rpevans@uwaterloo.ca", "Introduction to object-oriented programming and to tools and techniques for software development.", "Designing, coding, debugging, testing, and documenting medium-sized programs: reading specifications and designing software to implement them; selecting appropriate data structures and control structures; writing reusable code; reusing existing code; basic performance issues; debuggers; test suites.", "This course introduces students to object-oriented programming in C++ to facilitate designing, coding, debugging, testing, and documenting medium-sized programs.", "Students learn to read a specification and design software to implement it.", "Important skills are selecting appropriate data structures and control structures, writing reusable code, reusing existing code, understanding basic performance issues, developing debugging skills, and learning to test a program.", "C++", "Introduction to C++", "I/O and Strings", "Basic language constructs and Functions", "Exceptions", "Introduction to Templates", "Exception safety", "Template functions and algorithms", "Object-Oriented Programming", "UML class models", "Constructors and Destructors", "Encapsulation", "Inheritance", "Design patterns: Iterator, Observer, Decorator, Factory method, Template method, Non-virtual interface (NVI), and the Pimpl idiom", "Inheritance: vtables", "Multiple inheritance", "Design quality", "MVC (model-view-controller) architecture", "Design, implement, test, and debug C++ programs to solve problems requiring hundreds of lines of code, making appropriate use of", "types, variables, arrays, strings, and dynamic memory; loops, conditionals, and other control structures; structures, unions, and enumerations; procedures and functions; the preprocessor; formatted and unformatted I/O", "a subset of the STL, including vector, list, and map", "assertions and exceptions", "test suites for regression testing, white and black box testing", "structured programming, incremental development", "interface design, abstractions, information hiding, cohesion and coupling", "a subset of UML to specify classes, objects and relationships among them", "a selection of design patterns", "Explain the following properties of the memory model used in C++, including their impact on time and space efficiency when designing code: bytes vs. words, memory as an array, run-time stack and stack frames, memory allocation on the heap vs. automatic allocation on the stack, pointers as memory addresses, the representation of objects in memory", "You must complete A0 in order to receive marks for the rest of the course.", "A1 Basic C++ Monday, January 20 Monday, January 27 5", "A2 Introduction to OOP Monday, February 3 Monday, February 10 6", "A4 Design Patterns Monday, March 10 Monday, March 17 8", "Note: Marmoset is not a compiler!", "Do not submit C++ code to Marmoset, without first attempting to compile it yourself.", "Students from different sections can be in the same group.", "Working on a group is an important learning experience for software development in a team.", "Students in a group will be responsible for forming and managing the group.", "Please be very careful in selecting your group as there are always groups that end up having major issues every term.", "Exams", "Examination Date Final Grade Weight", "Each weekly set of problems completed succesfully can be used to replace 0.5% of the final grade from the final exam.", "In the case where both a midterm and final exam can be held, the final course grade will be calculated from the following components and weights:", "To pass the course, you must satisfy these three conditions:", "A grade of at least 45% on the weighted average of assignments A1-A4", "Assignments1to4  = (A1*5 + A2*6 + A3*6 + A4*8) / 25", "Normal = A1*5 + A2*6 + A3*6 + A4*8 + A5*15 + Midterm*20 + Final*(40-0.5*TutorialsCompleted) + 0.5*TutorialsCompleted", "if (MidtermInPerson==TRUE && FinalInPerson==TRUE)", "else", "if (MidtermInPerson==FALSE && FinalInPerson==TRUE)", "else", "if (MidtermInPerson==TRUE && FinalInPerson==FALSE)", "else", "if (MidtermInPerson==FALSE && FinalInPerson==FALSE)", "else", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 18, "course_code": "CS 246E", "course_name": "CS246E - Object-Oriented Software Development (Enriched) (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Object-Oriented Software Development (Enriched)", "Tuesday -", "CS246 description: Introduction to object-oriented programming and to tools and techniques for software development.", "Designing, coding, debugging, testing, and documenting medium-sized programs: reading specifications and designing software to implement them; selecting appropriate data structures and control structures; writing reusable code; reusing existing code; basic performance issues; debuggers; test suites.)", "functions and classes as the basic building blocks for abstractions", "function and class templates; exception safety", "object-oriented design principles; design patterns", "language features in combination", "Software library development for general client use.", "Principles of object-oriented software design.", "A selection of software design patterns.", "A1     10%", "Office hours: the list of office hours can be found at https://student.cs.uwaterloo.ca/~cs246e/F24/officehours.shtml", "Note: Marmoset is not a compiler!", "Please do not submit C++ code to Marmoset without first attempting to compile it yourself.", "The release test for a problem gives you the result of running your program on one basic test case (usually a case that appears in the assignment specification).", "So be sure to test your code thoroughly, so that you pass as many of our secret tests as possible.", "Testing", "Hand-Marking", "Note that correctly-working code is only one component of an assignment mark.", "Intellectual property includes items such as:", "CAN I POST MY CODE ONLINE?", "The second complicating factor concerns the question of who actually owns assignment solutions.", "The instructor supplies the question, a framework for the solution (including rules, guidelines, and possibly some starter code or libraries) and has in mind the general structure of what a correct solution ought to look like.", "the instructor(s) may permit posting of only those portions of assignments that were not provided as starter code;", "The instructors' policy for a given offering of a course will be stated in the course outline.", "If you wish to share your code with potential employers, and your instructor does not permit you to publicly post your solutions, you may host your code in a private repository, and provide a password to potential employers (for example, on your resume).", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 19, "course_code": "CS 251", "course_name": "CS251 - Computer Organization and Design (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Computer Organization and Design Winter 2025", "11:30AM -", "RCH 307", "10:30AM - 11:20AM EV3 1408", "Silvia Zhang cs251@uwaterloo.ca", "Basics of digital logic design.", "Data representation and manipulation.", "Basics of processor design.", "This course enables students to develop an accurate mental model of the architecture and organization of physical computers and it introduces them to theoretical and practical concepts relevant to the structure and design of modern digital computers.", "Design simple combinational and sequential hardware at the logic gate level in order to implement simple algorithms and computations, such as addition, multiplication, and data-path control for processors.", "Describe number systems used by computer hardware, including IEEE floating point and two's complement.", "Analyze how machine language is executed by hardware, and describe a simple pipelined processor architecture for executing a RISC machine language.", "Explain basic cache and virtual-memory architectures, and how they can impact performance.", "Introduction and ARM (~3 hours)", "Combinational logic and basic components.", "Basic Processor Design (~9 hours)", "Processor design using single-cycle control.", "Multi-cycle control.", "Virtual memory.", "Multi-processor systems and core processors.", "Patterson and Hennessy: \"Computer Organization and Design\".", "Students registering their clicker for other sections will receive a grade of zero on clicker questions.", "else", "Notice of Recording", "In general, assignments submitted late and without an approved extension by the course ISC will not be accepted and will be given a grade of zero.", "If a student makes a short-term 48-hour declaration, they may contact the course ISC to obtain a 48-hour extension.", "Note that penalties are significantly higher for exams and for repeat offenders.", "Discussion of assignments is allowed, but each student must hand in their own copy of the assignment and word-for-word copying is not allowed.", "In-Class Discipline", "A student who is found to be disruptive during lectures will be given only one verbal warning for the term.", "Students should attend the section they're enrolled in and only the section they're enrolled in", "Further, a weekly quiz will be given and used in place of clickers in the marking scheme.", "Dropping lowest clickers marks, lowest quiz score", "Online Exams", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:"]}, {"course_id": 21, "course_code": "CS 480", "course_name": "CS480 - Introduction to Machine Learning (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Machine Learning Winter 2025", "10:00AM - 11:20AM DWE 1501", "Introduction to modelling and algorithmic techniques for machines to learn concepts from data.", "Optimization-based learning: loss minimization. regularization.", "This is especially useful in complex tasks such as natural language processing, information retrieval, data mining, computer vision and robotics where it is not practical for a programmer to enumerate all possible situations in order to specify suitable instructions for all situations.", "The course will introduce the basics of machine learning and data analysis, and demonstrate how machine learning techniques have impacted life and society.", "The course starts with some classical tasks and algorithms in machine learning, then transitions to modern advances and successful applications in real life, and finally ends with discussions on the societal impact that machine learning has generated.", "A significant part of the course will be devoted to raising students' awareness on such ethical issues, including how to make machine learning algorithms fair and unbiased, how to protect individual privacy without compromising learning, how machine learning algorithms might be attacked, how to measure and improve the security of machine learning algorithms, and how to make machine learning algorithms explainable and interpretable.", "Recognize and formalize a task as a machine learning problem", "Identify suitable algorithms to tackle different machine learning problems", "Understand and implement a plethora of foundational machine learning algorithms", "Apply machine learning algorithms to real datasets", "Become aware of potential ethical and safety issues of machine learning on society", "Introduction (first lecture: Jan 7, 2025)", "Linear Regression", "Reproducing Kernels", "Multi-layer Perceptron", "Deep Neural Networks", "Attention", "Decision Trees", "Flow Models", "Variational Autoencoders", "Diffusion Models"]}, {"course_id": 22, "course_code": "CS 484", "course_name": "CS484 - Computational Vision (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Computational Vision Winter 2025", "10:00AM - 11:20AM MC 2034", "Introduction to image and vision understanding by computer.", "Camera-system geometry, image formation and lighting, and image acquisition.", "Processing of stereo images, and motion in image sequences.", "Applications of computer-vision systems.", "General Description", "Computer Vision encompasses a variety of innovative methods and algorithms leveraged in applications such as facial recognition, image searching, augmented reality, medical image analysis, automated mapping of environments, and digital effects in movies and photography.", "This course provides an introduction to the computational and mathematical foundations of computer vision and covers many of its standard applications.", "In case some points in the slides are skipped in class (e.g. review of basic background in linear algebra, or if time runs out), the students could be referred to the posted video lectures.", "The videos explain all the slides, including optional reviews of basic linear algebra, multi-variate calculus, and some (clearly marked) optional material in computer vision.", "iClicker we will use iClicker for occasional in-class polling.", "Mathematical skills: AMATH 242/CS 371 or CS 370 or Linear Algebra 2 (MATH 235/245)", "Comments on Linear Algebra", "Understanding computer vision methods requires certain level of confidence with linear algebra, which is actively used throughout the course.", "CS484 only briefly reviews some critical linear algebraic tools as they become needed, but there is absolutely no time to teach linear algebra on the same level (covering proofs and many basic examples) as it is done in the appropriate math courses.", "Based on observations from the previous years, students who took only one term of introductory linear algebra and do not remember much of it must be ready to commit (possibly substantial) extra time.", "At the same time, computer vision offers highly motivating and intuitive context for learning linear algebra.", "If you plan to take other courses on Data Analysis, AI, or Machine Learning, you will also appretiate stronger linear algebra skills.", "While CS484 covers only the absolutely necessary background in linear algebra, as well as multivariate calculus, some useful external links can be found in \"Math Resources\".", "This course introduces many standard computer vision problems and computational approaches for solving them.", "The context of image analysis also provides an intuitive and stimulating visual environment for developing and understanding numerical algorithms.", "Slides", "In case of substantial changes, the updated slides will be reposted online.", "The posted videos explain all the slides in details, including review of basic background in linear algebra and multi-variate calculus.", "You will be referred to specific relevant sections of these books in class.", "Computer Vision: Algorithms and Applications, 2010.", "Python's linear algebra library \"numpy\" will be widely used in all assignments.", "More details and code samples are posted here.", "This happens naturally as the first half of the course spends more time reviewing background from linear algebra, multi-variate calculus, and statistics.", "Assignments will require submission of code and a report.", "Typical image analysis algorithms produde output (geometric structures, segments, labelings) that can be visualized.", "The drop box remains open for late submissions for a few days past the due date/time of each assignment - TAs record each late day.", "Scholastic offences are taken seriously and students are directed to read the appropriate university policy.", "Assignment 4: low-level segmentation"]}, {"course_id": 24, "course_code": "CS 486", "course_name": "CS486 - Introduction to Artificial Intelligence (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Artificial Intelligence Winter 2025", "08:30AM - 09:50AM MC 2038", "08:30AM - 09:50AM MC 2038", "Varun Dhanraj: vdhanraj@uwaterloo.ca", "Methods of general problem solving.", "Multi-agent systems.", "Methods of general problem solving.", "Introduction to mathematical logic Mechanical theorem proving.", "Available free for downlooad online at artint.info Yes"]}, {"course_id": 25, "course_code": "STAT 431", "course_name": "STAT431 - Generalized Linear Models and their Applications (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Generalized Linear Models and their Applications Winter 2025", "Review of the normal linear model and maximum likelihood estimation; regression models for binomial, Poisson and multinomial data; generalized linear models; and other topics in regression modelling.", "The primary objective of this course is to introduce students to generalized linear models.", "Attention will be mainly directed towards theory and applications involving binary, categorical, and count data, although the generalized linear model will be presented in its full generality for responses from the exponential family.", "This course introduces several useful regression techniques for the analysis of data arising in many different settings (ie， medicine, industry, psychology etc.).", "The intended audience consists of students interested in advanced regression modeling.", "The objectives are to help students develop an understanding of the statistical theory and to equip them with the ability to fit regression models for a wide range of problems.", "run generalized linear regression for binary, categorical and count data and have a deep understanding of the underlying theories.", "Week 7 Dose-Response Models Lecture 11", "An Introduction to Generalized Linear Models by Dobson, AJ and Barnett, AG, fourth edition No 92", "Software: Students are encouraged to use R for coding problems in assignments, but feel free to use any computing software you feel comfortable with.", "An introduction to R: https://cran.r-project.org/doc/manuals/r-release/R-intro.pdf.", "Arrangements for students with official conflicts will be handled on a case by case basis."]}, {"course_id": 26, "course_code": "STAT 440", "course_name": "STAT440 - Computational Inference (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Computational Inference Winter 2025", "PHY 313", "Introduction to and application of computational methods in statistical inference.", "Monte Carlo evaluation of statistical procedures, exploration of the likelihood function through graphical and optimization techniques.", "Topics include expectation-maximization, Bootstrapping, Markov Chain Monte Carlo, and other computationally intensive methods.", "A1 Feb 4th", "A4 Apr 3rd"]}, {"course_id": 27, "course_code": "STAT 441", "course_name": "STAT441 - Statistical Learning - Classification (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["10:00AM - 11:20AM B1 271", "Email: mlysy@uwaterloo.ca", "STAT 841: View requirements for STAT 841", "Describe the basic principles and methods of statistical classification.", "Know when to use each of these methods on a given dataset.", "Evaluate and compare the output of various classifiers.", "An Introduction to Statistical Learning with Applications in R, by James, Witten, Hastie & Tibshirani https://www.statlearning.com", "There will be two closed-book midterms worth 15% each on the following dates:", "There are no make-up midterms in this course.", "Discussion Board", "Please self-enroll at https://piazza.com/uwaterloo.ca/winter2025/stat441841cm763.", "You can generally expect a response from TAs within two business days.", "Software", "Material and assignments will require the use of R and Python programming languages, as well as the technical document writing programs for these languages: R Markdown and Quarto.", "Regrades", "Email", "Emails which do not adhere to this standard will generally be ignored.", "Intellectual property includes items such as:", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 28, "course_code": "STAT 442", "course_name": "STAT442 - Data Visualization (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Data Visualization Winter 2025", "11:30AM - 12:20PM B1 271", "Discussion Board", "Email", "Response time", "Both human perception and statistical properties inform the methods used to display and visually explore categorical, continuous, time-ordered, map, and high dimensional data.", "Statistical concepts visually presented include variability, densities, quantiles, conditioning, and hypothesis testing.", "Interactive graphics include linking, brushing, motion, and the navigation of high dimensional spaces guided via projection indices.", "Interpret and critique the most commonly used kinds of visualizations today.", "Create a variety of univariate, bivariate, and multivariate graphs using base R and the tidyverse.", "Look up the necessary code to complete additional graphs not covered here.", "Book - Data Science - A First Introduction.", "Book - The Chicago Guide to Multivariate Analysis, Jane E. Miller", "Book - Cool Infographics - Effective Communication with Data Visualization and Design, Randy Krum.", "Industry Paper - Making Data Meaningful, United Nations Economic Commission for Europe.", "Notice of Recording", "No waiving of this penalty will occur for technical issues.", "Details can be found here: https://uwaterloo.ca/math/accommodations", "Phone: 519-884-0000 extension 213", "Lots of people look like they have it together in public and online when they're a mess inside too.", "They got you into university, so they've already done most of the work, but at this point, the most they can really do for you decide if you can get into graduate school before doing industry experience.", "Don't let that be your reason for thinking this is as good as it gets.", "In particular:", "Please inform me of these at the start of the course."]}, {"course_id": 29, "course_code": "STAT 443", "course_name": "STAT443 - Forecasting (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Forecasting Spring 2024", "04:00PM - 05:20PM", "Email: jeremy.vanderdoes@uwaterloo.ca", "This course is an introduction to statistical forecasting.", "This includes considerations of forecasts and uncertainty.", "Speciﬁc topics include:", "Linear time series models: AR, MA, ARMA, ARIMA, SARIMA", "Forecasting: Principles and Practice, 3rd edition free online at https://otexts.com/fpp3/", "Time Series Analysis and Its Applications, 4th edition free online in library or at https://www.stat.pitt.edu/stoffer/tsa4/ Yes", "Introduction to Time Series and Forecasting free online in library Yes"]}, {"course_id": 30, "course_code": "STAT 444", "course_name": "STAT444 - Statistical Learning - Advanced Regression (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Statistical Learning - Advanced Regression Spring 2024", "Topics cover a wide selection of advanced methods useful to address the challenges arising from real-world and high-dimensional data; methods include robust regression, nonparametric regression such as smoothing splines, kernels, additive models, tree based methods, boosting and bagging, and penalized linear regression methods such as the ridge regression, lasso, and their variants.", "Students will gain an appreciation of the mathematical and statistical concepts underlying the methods and also computational experience in applying the methods to real data.", "Topics cover a wide selection of advanced methods useful to address the challenges arising from real-world and high-dimensional data; methods include robust regression, nonparametric regression such as smoothing splines, kernels, additive models, tree-based methods, boosting and bagging, and penalized linear regression methods such as the ridge regression, lasso, and their variants.", "Students will gain an appreciation of the mathematical and statistical concepts underlying the methods and also computational experience in applying the methods to real data.", "2 Nonlinear Regression I: Basis functions and Splines 3 – 4", "4 Predictive Modelling I: Error Estimation and Model Assessment 7 – 9", "Generalized Additive Models: An Introduction with R https://www.taylorfrancis.com/books/mono/10.1201/9781315370279/generalized-additive-models-simon-wood No"]}, {"course_id": 33, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 34, "course_code": "MATH 247", "course_name": "MATH247 - Calculus 3 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Topology on RN: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. (~3 weeks)", "Differentiation: partial differentiability, differentiability, chain rule, [midterm likely here], Taylor polynomials, extreme value problems. (~4 weeks)", "Integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. (~3 weeks)", "Local properties of continuously differentiable functions:  open mapping theorem, inverse function theorem, implicit function theorem. (~2 weeks)", "11:30AM - 12:20PM QNC 2501", "Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem.", "Topology of real n-dimensional space: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. Differential calculus on multivariable functions: partial differentiability, differentiability, chain rule, Taylor polynomials, extreme value problems. Riemann integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem."]}, {"course_id": 35, "course_code": "MATH 239", "course_name": "MATH239 - Introduction to Combinatorics (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics Winter 2025", "11:30AM - 12:20PM MC 4059", "09:30AM - 10:20AM MC 4021", "P. Nelson", "08:30AM - 09:20AM QNC 1502", "S. Pfannerer-Mittas", "10:30AM - 11:20AM MC 4058", "11:30AM - 12:20PM MC 4058", "09:30AM - 10:20AM MC 4042", "02:30PM - 03:20PM", "10:30AM - 11:20AM PHY 150", "04:30PM - 05:20PM", "You should have no reason to contact them directly, but you can find their email addresses through Learn.", "First name Last name", "Guilherme Zeus Dantas E Moura", "Theodore Morrison", "Matthew Kroeker", "Introduction to graph theory: colourings, matchings, connectivity, planarity.", "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.", "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 36, "course_code": "MATH 249", "course_name": "MATH249 - Introduction to Combinatorics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics (Advanced Level)", "09:30AM - 10:20AM MC 2017", "For graph theory, while we will focus on the same topics covered in MATH 239 (planarity and bipartite matching), our coverage of those topics will differ substantially in depth and in the techniques that we employ; in particular, we will see striking applications of algebra.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 1, "course_code": "BET 360", "course_name": "BET360 - Design Frameworks for Social Ventures (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Design Frameworks for Social Ventures Fall 2024", "BET 360", "In this course, students will explore several design frameworks as they relate to complex problems; assess the impacts of these frameworks in recent entrepreneurial applications; and determine how to apply these concepts in the design of the social impact aspects of ventures and cross-industry collaborations.", "View requirements for BET 360", "Articulate the importance of design, and design thinking in solving problems for social and environmental change, through entrepreneurial ventures", "Understand, describe, and apply emerging frameworks in designing for social impact (ie.", "Collaborate with others to explore significant social problems using critical lenses", "Design, when everybody designs: An introduction to design for social innovation.", "Thinking in Systems: A primer.", "Electronic Device Policy", "Accommodation for Students with Disabilities", "This course includes the independent development and practice of specific critical thinking skills, such as;", "To understand, explain, and analyze base content knowledge around a range of topics in social impact and design, curated for this course", "Library for research-based assignments"]}, {"course_id": 5, "course_code": "PACS 315", "course_name": "PACS315 - Engineering and Peace (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Engineering and Peace Fall 2024", "07:00PM - 09:50PM CGR 1302", "Office Hours: Online or in-person meetings can be booked via Calendly between 8:30 AM – 4:30 PM on weekdays", "This course is built on the conviction that the kinds of problems engineers seek to address, and the ways they seek to address them, should matter for anyone interested in advancing peace in the world.", "Topics include historical connections between the discipline of engineering and warfare, understanding the engineering method and mindset, and technological frontiers for peacebuilding.", "Augment their approach to analyzing and solving problems with insights from both engineering and peacebuilding theory and practice; and", "Identify opportunities to apply their expertise and passions to make a meaningful social impact", "Why has war been the business of so many engineers?", "Sep. 18", "Sheldon Fernandez", "UWaterloo Turkstra Chair in Urban Engineering", "Critical Media Lab", "Communitech", "Laurel Boytim", "The Ripple Effect Education", "Engineers as social innovators Riley, “We’ve Been Framed!”", "Global Peace Index 2024 Institute for Economics & Peace.", "Morgan & Claypool Publishers, 2007.", "We’ve Been Framed!", "Also available for free through MIT Press Open Access] No", "Engineers of Jihad: The Curious Connection Between Violent Extremism and Education.", "Engineers of Jihad: The Curious Connection Between Violent Extremism and Education.", "A Perusall-generated score of 2.0 or higher is required to receive credit each week, and the overall grade for this element will be based on the accumulation of these credits (2% per reading assignment up to a maximum of 10 credits).", "Engage with a guest engineer and/or peacebuilder.", "Each class will begin with a conversation with a guest speaker with expertise and life experiences related to the topics covered in this course.", "95% – Made a contribution that went above and beyond expectations by demonstrating an exceptional level of consideration and care, and/or providing a rare and surprising degree of insight", "Each submission should be a minimum of 250 words.", "Offer a critique of the book, highlighting both strengths and witnesses, as well as offering a recommendation for who would benefit most from reading the book.", "Why did you chose to attend this event?", "Who played a key role in leading the event?", "Please read Grebel's full land acknowledgement for additional context on the college’s connections to the first European settlers on this land.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "This course includes the independent development and practice of reflection and writing skills."]}, {"course_id": 6, "course_code": "PHIL 226", "course_name": "PHIL226 - Biomedical Ethics (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Biomedical Ethics Winter 2024", "I will have in-person drop-in office hours on Mondays and Wednesdays 1:15-2:15 in Hagey Hall 322A. You can also request an appointment by emailing me and letting me know your availability as well as whether you prefer virtual or in-person.", "If you are in a debate club, your goal is to defeat your opponent.", "Philosophy is not a debate club.", "First, I will describe the overall structure of the course.", "There will be a multiple choice Learn quiz on Unit 1.", "Third, we spend three classes learning about some general ethical concepts relevant to bioethics: utilitarianism, care ethics, and relational autonomy.", "One is a multiple choice Learn quiz on the readings from the first four classes of Unit 2.", "Just like in Unit 2, there will be a multiple choice Learn quiz on the readings from the first four classes, an in-class test that guides you into writing a first rough draft of your essay, and an essay assignment.", "Unit 1: Some Examples of Ethical Reasoning and Argumentation", "In-Class Test that will have questions that guide you into writing a first rough draft of Essay 1", "I will bring a small number of printed copies for borrowing.", "In A Companion to Bioethics, 2nd edition, edited by Helga Kuhse and Peter Singer, 85-90.", "In The Feminist Health Care Ethics Research Network, Susan Sherwin Coordinator, The Politics of Women’s Health: Exploring Agency and Autonomy, 19-47.", "“Conscientious Objection in Medicine: Accommodation versus Professionalism and the Public Good.”", "“The Best Interests Standard as a Logic of Empire: Unpacking the Political Dimensions of Parental Refusal.”", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Monday March 25", "It is a multiple choice quiz that should not take too long to complete.", "Instructions for the In-Class Tests", "An In-Class Test will have questions that guide you into writing a first rough draft of your essay", "You should study one reading from the first six classes of the relevant Unit", "I will bring a small number of printed copies for borrowing.", "A test that is assessed as Pass receives a grade of 50.", "A test that is assessed as Fail receives a grade of 0.", "Instructions for the Essays", "Introduction (about 75-125 words)", "You are not allowed to use GenAI during the In-Class Tests that guide you into writing a first rough draft of your essay, but you are allowed to use GenAI during the process of getting from your first draft to your final version of your Essay.", "Every philosopher I have met says this.", "Talking - Yes", "Getting Suggestions - No", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:"]}, {"course_id": 7, "course_code": "SOC 232", "course_name": "SOC232 - Technology and Social Change (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "SOC 232", "I am an Associate Professor in the Department of Sociology & Legal Studies and at the Stratford School of Interaction Design and Business.", "Apply sociological theories and concepts to understand, examine, and critically evaluate how technology shapes, and is shaped by, social phenomena.", "Identify how digital technologies shape our interpersonal relationships and communities, in both positive and negative ways.", "Assigned readings and playlists may change through the term.", "Sept 12  Introduction to the Course No readings this week", "Sept 19 “Do guns kill people?", "In The Design of Everyday Things: Revised and Expanded Edition, Revised, Expanded ed. edition, 1–36.", "Do Artifacts Have Politics?", "Techno-social Designing.", "The Adoption and Diffusion of Technological Innovations", "Tragic Design: The Impact of Bad Product Design and How to Fix It (1st edition).", "Community in the Network Society", "Computer Love: Replicating Social Order Through Early Computer Dating Systems.", "Deviance in the Dark psychology experiment [", "Assigned readings and playlists may change through the term.", "85%+", "Summary of relevant material is minimal in favor of cross-cutting synthesis of ideas.", "Deep and critical engagement with course content.", "Submission shows overall unity but may meander.", "Satisfactory", "Response is a good effort but falls short of a comprehensive answer.", "Problems in logic and content are identifiable, and writing is weak or tend towards summary rather than critical analysis.", "Please use APA formatting and citation style.", "Late Policies and Extension Requests", "Self-declarations cannot be “stacked” to extend beyond these 5 days.", "Notice of Recording", "However, if Health & Safety protocols demand a shift away from in-person teaching and towards online teaching, some activities for this course may involve recording, in partial fulfillment of the course learning outcomes.", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Do you want professors and interviewers to call you by a different first name?"]}, {"course_id": 8, "course_code": "SOC 324", "course_name": "SOC324 - Digital Cultures (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Digital Cultures: Technology & Society Fall 2022", "I am an Associate Professor in the Department of Sociology & Legal Studies and at the Stratford School of Interaction Design and Business.", "Questions of a personal nature", "This course examines how digital play represents and structures social interaction and how games develop social norms, influence social consensus, and respond to deviance.", "Apply sociological theories and concepts to understand, examine, and critically evaluate how technology shapes, and is shaped by, social phenomena.", "Identify some of the complex ethical choices and moral codes embedded in digital tools, such as game consoles and smart phones.", "Identify how digital technologies shape our interpersonal relationships and communities, in both positive and negative ways.", "Identify and develop personal research interests relating to digital culture and technology.", "Synthesize complex written arguments, summarize core ideas effectively, and pull out key concepts.", "Develop creative ways to communicate and teach core concepts to others.", "Introduction to the Course No assigned readings.", "The Technological Society", "Theories to make sense of our digital lives.", "In The Design of Everyday Things: Revised and Expanded Edition, Revised, Expanded ed. edition, 1–36.", "Techno-social Designing.", "Tragic Design: The Impact of Bad Product Design and How to Fix It (1st edition).", "-oreilly- com.proxy.lib.uwaterloo.ca/library /view/tragic-design /9781491923603/ch05.html", "Addressing Human Bias in Technology Design", "Confronting the Absence of Women in Technology Innovation.", "Community in the Network Society", "Computer Love: Replicating Social Order Through Early Computer Dating Systems.", "Ethical Dimensions of Technology", "TBD", "Assigned readings and playlists may change through the term.", "Summative Activites take a similar structure to your Module Reflections.", "In a few short classes, we can’t cover everything.", "Your precis should directly provide the following:", "Make an argument for why your is topic sociologically relevant, and should it be covered in a third-year sociology course.", "Be creative!", "Schedule permitting, all projects will be shared and presented in class in celebratory teaching/viewing sessions", "Late Policies and Extension Requests", "Extensions longer than 1 week require:", "Notice of Recording", "However, if Health & Safety protocols demand a shift away from in-person teaching and towards online teaching, some activities for this course may involve recording, in partial fulfillment of the course learning outcomes.", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Do you want professors and interviewers to call you by a different first name?", "Intellectual property includes items such as:"]}, {"course_id": 9, "course_code": "STV 100", "course_name": "STV100 - Society, Technology and Values: Introduction (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Society, Technology and Values: Introduction Winter 2025", "STV 100", "S. Campbell", "TBA", "If that’s not a good time for you, just get in touch and let me know when you’re free to chat and I’ll do my best to find a mutual time to meet.", "This course examines the interaction of the technologies developed by a culture with the values and social organization of that culture.", "These views are then applied to a number of spheres of influence, including patterns of employment and the role of work; medicine and health; polity and economy; sustainable development and the environment.", "View requirements for STV 100", "Identify concepts and perspectives related to the interaction between technology and society, and classify examples.", "Identify embedded technological values and surrounding contexts.", "Assess their own technological perspectives and values within the context of their academic discipline and personal experience.", "*", "*", "*", "*", "*", "*", "*", "Supplies and laptop recommendations", "A new laptop should:", "Have a battery life that will last a long time.", "Several brands have a 10 to 12-hour battery life now.", "Pre-Knowledge Surveys", "The activities allow you to practice with concepts and prepare you for assignments.", "Each group submits a summary of their discussion before leaving for the night, and each student in the group will share the grade.", "Self-Assessments", "There’s no shame!", "I know it can feel embarrassing to ask for help, but I seriously don’t mind helping everyone.", "Extensions", "Gender-inclusive language", "Gender-inclusive and fair language should be used in the interests of precision and politeness.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 10, "course_code": "STV 202", "course_name": "STV202 - Design and Society (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Design and Society Winter 2025", "Email: cshelley@uwaterloo.ca", "Email: js2kim@uwaterloo.ca", "View requirements for STV 202", "Topics include the nature of design, the social and cultural implications of design, the roles of designers in relation to the social contract, and design assessment in light of social values such as risk, fairness, progress, and sustainability.", "The course material provides a mixture of theoretical concepts and practical cases of their application.", "Describe concepts and perspectives relating to social and ethical aspects of good design.", "Analyze and evaluate designs in light of those concepts and perspectives.", "Compare concepts and perspectives and consider overlaps and differences among them.", "Reflect on the significance of social and ethical issues in their understanding of good design.", "The numbers in parentheses next to learning outcomes above refer to applicable Canadian Engineering Accreditation Board Engineering Graduate Attributes defined here: https://uwaterloo.ca/engineering/graduate-attributes", "Rational design & Social psychology.", "Social contracts & Agendas.", "Design and society: Social issues in technological design, Berlin: Springer.", "A 10-question, multiple-choice quiz is to be completed by each student on the course Learn site for each non-midterm module starting at the outset of week 2.", "Quiz questions each week relate to the textbook chapter(s) assigned for that week.", "Design discussions", "Discussions will take place each non-workshop week after week 1.", "Design presentations", "5 minutes) and may be chosen for viewing in subsequent classes.", "Midterms", "Midterm 1 covers chapters Good design through Culture, Midterm 2 covers chapters Social contract through Activism, and Midterm 3 covers chapters Risk through Sustainability.", "Grade exemptions", "To allow for situations not covered under the Late submissions policy (see below), each student’s lowest quiz, discussion,  presentation, and workshop grade will be dropped from the calculation of their overall grade in each of those categories.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 11, "course_code": "STV 205", "course_name": "STV205 - Cybernetics and Society (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Cybernetics and Society Spring 2024", "This course will present an overview of cybernetics from automation and robotics to prosthetics and wearable computing.", "The roles of men and women in a post-human era will be discussed along with related themes dealing with gender, cyberspace, politics, and popular culture.", "Apply analogical thinking to examine technologies from a functional as well as a social and cultural perspective.", "Assess the kinds of problems addressed by different kinds of technologies and reflect upon your own problem-solving experiences.", "Understand the basic concepts of cybernetics from a historical perspective and discuss issues concerning the development of technologies with someone from an academic discipline different from your own.", "On Thursday at 9:00pm ET, a multiple-choice quiz will be published that you must complete by Friday at 11:59pm ET.", "The study materials are a mix of book chapters and articles as well as video and audio clips.", "Each week, except the first week, in STV 205 will follow this pattern:", "Module 1.1 First-Order Cybernetics: Norbert Wiener, Margaret Mead, Feedback, Information and Analogy - May 9", "Module 2.1 Second-Order Cybernetics: Heinz von Foerster, the Observer and the Observed, Determinism versus Constructivism, and the Attention Economy - June 6", "Module 2.3: Big Data Algorithms, Surveillance Capitalism, and the Smart City - June 20", "Module 3.2: Utopia, Dystopia and Anti-Utopia? - July 11", "Systems Thinkers by Magnus Ramage/Karen Shipp Yes", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 12, "course_code": "STV 208", "course_name": "STV208 - Artificial Intelligence and Society: Impact, Ethics, and Equity (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Artificial Intelligence and Society: Impact, Ethics, and Equity Winter 2025", "The objective of this course is to introduce students to ethical and social concerns relating to Artificial Intelligence (AI).", "By understanding the basic principles of AI and its evolution, to engaging with complex issues like algorithmic bias and privacy concerns, this course offers a comprehensive look at both the promise and challenges AI brings to society.", "Through real-world case studies, students will analyze how AI systems influence industries, economies, and governance while learning to apply ethical frameworks that ensure fairness and accountability in AI deployment.", "The course is designed to not only equip students with the tools to evaluate the societal impacts of AI critically but also to empower them to actively engage in discussions about the future of technology and society.", "By the end of the course, students will be prepared to make informed contributions to the ongoing debates about the role of AI in shaping the future.", "Identify and explain key concepts related to the societal impacts of AI technologies, including ethical considerations, biases, and privacy concerns, and classify real-world examples where these issues arise.", "Compare different ethical frameworks and governance models for AI, and critically test their effectiveness in addressing issues such as fairness, accountability, transparency, and human rights.", "Evaluate the broader implications of AI on democracy, human rights, and socioeconomic systems, and assess how AI-driven innovations can either support or challenge social equity, ethical standards, and global governance structures.", "8 Socioeconomic Impacts of AI and Automation Mar 5 Mar 11", "12 The Future of AI: Ethical Design and Responsible Innovation Apr 2", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 13, "course_code": "STV 210", "course_name": "STV210 - The Computing Society (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["The Computing Society Fall 2024", "S. Campbell", "If that’s not a good time for you, just get in touch and let me know when you’re free and I’ll do my best to find time.", "It explores the impact and consequences of computing from a societal perspective, but also considers various nontechnical factors and values that have shaped computing technology and practice.", "Material artifacts will form a core element of the course.", "STV 210: View requirements for STV 210", "It’s a combination of STV-like concepts and historical concepts.", "The goal for this course is to appreciate how the history of computing can be used to better understand the interaction between technology and society today and in the future.", "*", "*", "*", "*", "*", "*", "*", "*", "You don’t need to buy it!", "An electronic version is available though the library, and we’re only reading some of the chapters.", "The activities allow you to practice with concepts and prepare you for assignments.", "Each group submits a summary of their discussion before leaving for the night, and each student in the group will share the grade.", "Self-Assessments", "There’s no shame!", "I know it can feel embarrassing to ask for help, but I seriously don’t mind helping everyone.", "Extensions", "Gender-inclusive language", "Gender-inclusive and fair language should be used in the interests of precision and politeness.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 14, "course_code": "STV 302", "course_name": "STV302 - Information Technology and Society (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Information Technology and Society Spring 2024", "S. Campbell", "But is this just a misplaced perception?", "Ultimately, what sort of technological values underpin the actions of IT creators and users?", "Identify, classify and analyze concepts and perspectives related to the interaction between information technology and society.", "Identify and analyze technological values of creators and users, and those embedded within information technology.", "Develop independent research questions, and communicate findings in written and verbal formats.", "Also, for any engineering undergraduates, the course provides instruction in fulfilment of CEAB graduate attributes 10, b, and c", "May 29 1.3 Is everything online?", "June 12 2.1 Disinformation Yes", "June 26 2.3 IT & Fairness Yes", "Further instructions for each self-assessment and a rubric will be provided on LEARN in the Module 1.4, 2.4, and 3.4 folders.", "I know it can feel embarrassing to ask for help, but I seriously don’t mind helping everyone.", "That’s when I can best help, not a month later.", "Gender-inclusive language", "Gender-inclusive and fair language should be used in the interests of precision and politeness.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 16, "course_code": "STV 305", "course_name": "STV305 - Technology, Society and the Modern City (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Email: cshelley@uwaterloo.ca.", "Cities may be humanity's most significant invention, where we shape our vision of the civilized life.", "At the same time, the demands of cities shape our lives in fundamental ways.", "The purpose of this course is to examine the technology of civilized life, with the city itself as both a technological system and a scene of technological living.", "View requirements for STV 305", "Describe concepts and perspectives relating to cities as socio-technical systems.", "Analyze and evaluate developments in cities in light of those concepts and perspectives.", "Reflect and communicate analyses of social and ethical aspects of technology and cities.", "Week 11 November 21 Smart cities", "Discussions", "Each student is expected to participate in in-class discussion each week.", "Summaries", "Summaries may be shared with the class to kick-start in-class discussion.", "Self-assessments", "Grade exemptions", "Each student’s lowest discussion mark and exercise mark will be dropped from the calculation of their overall mark in those categories.", "Students are welcome to request regrading of assignments.", "Test conflicts"]}, {"course_id": 18, "course_code": "AE 392", "course_name": "AE392 - Economics and Life Cycle Cost Analysis (0.50)", "term_name": "List B", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Economics and Life Cycle Cost Analysis Winter 2025", "AE 392", "09:30AM - 10:50AM ARC 1101", "Email:    bruce.hellinga@uwaterloo.ca", "Sorour Yekeh", "Project financing, life-cycle cost analysis, time value of money, sensitivity analyses, tax, financial implications of infrastructure projects, quantitative decision-making, financial aspects of a business plan.", "View requirements for AE 392", "Appraise and compare the financial implications of potential infrastructure projects", "Judge the attractiveness of public sector infrastructure projects and monetize non-monetary costs and benefits if necessary", "Construct a cash flow diagram to summarize the timing and magnitude of cash flows over time Determine and compare the present worth, future worth, annual worth, internal rate of return, payback period, and benefit-cost ratio of alternative projects", "Implement sensitivity analysis to consider uncertainty in decision making", "Introduction & Engineering Decision Making", "2. Time Value of Money & Depreciation", "3. Cash Flow Analysis", "6. Financial Accounting and Business Plans", "Inflation", "Public Sector Decision Making", "This course includes the independent development and practice of specific skills, such as engineering economic evaluation and decision making.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 19, "course_code": "BME 364", "course_name": "BME364 - Engineering Biomedical Economics (0.50)", "term_name": "List B", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Engineering Biomedical Economics Fall 2024", "09:30AM - 10:20AM E5 6006", "10:30AM - 12:20PM", "08:30AM - 09:20AM", "This course examines key economic issues in health care and biomedical industries.", "Topics include the market for medical care, health insurance, various models of healthcare delivery and competition and the role of government in policy, financing and delivery of health care.", "This course will train students to use economic analysis to model and understand the complex interactions between health care delivery, insurance markets, health innovators, governments, and firms.", "Articulate differences between healthcare systems and how incentives affect the system economics.", "Articulate differences between healthcare systems and how incentives affect the system economics.", "Investigate a research topic in the area of health economics.", "Apply cost-benefit analysis to aid in healthcare decision making.", "A knowledge base for engineering:   Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the biomedical engineering program.", "2. Problem analysis:  An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "Investigation:  An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "4. Design:  An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, and economic, environmental, cultural and societal considerations.", "7. Communication skills:  An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Professionalism:   An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Such ability includes an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society, the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Life-long learning:  An ability to identify and to address their own educational needs in a changing world in ways sufficient to maintain their competence and to allow them to contribute to the advancement of knowledge.", "The Labor Market for Physicians", "7. Demand for Insurance", "Adverse Selection in Real Markets", "Pharmaceuticals and the Economics of Innovation", "The Economics of Health Externalities", "*", "The Contribution and Effects of the Country’s Healthсare Sector on its GDP", "Healthcare as a Basic Human Right: The Pros and Cons of Providing Free Healthcare", "A Look at the Feasibility of a Universal Health Care System", "Methods to Reduce the Risk of Adverse Selection", "The Differences between Moral Hazard and Adverse Selection and their Effects on Health Economics", "The Need to Educate Patients on the Costs Added to their Medical Bills", "The Role of Medical Resources in Increasing Life Expectancy Numbers", "Reasons Patients Should Select Larger Medical Facilities to Avoid Costly Treatments", "The Adverse Effects of an Unplanned Influx in Health Care on the Overall Economic Balance", "The Role of a Stronger Health Care System and Nutrition Programs on the Throughput of the Employed Masses", "Notice of Recording"]}, {"course_id": 20, "course_code": "CIVE 392", "course_name": "CIVE392 - Economics and Life Cycle Cost Analysis (0.50)", "term_name": "List B", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Economics and Life Cycle Cost Analysis Spring 2024", "08:30AM - 09:50AM DC 1350", "Email:  chris.bachmann@uwaterloo.ca", "Email: cglehmannskelton@uwaterloo.ca", "Marley Dowling", "Email: mkldowling@uwaterloo.ca", "Nastaran Mosavari Nezamabad", "Email: nastaran.mosavari.nezamabad@uwaterloo.ca", "Email: enkichiy@uwaterloo.ca", "Project financing, life-cycle cost analysis, time value of money, sensitivity analyses, tax, financial implications of infrastructure projects, quantitative decision-making, financial aspects of a business plan.", "Appraise and compare the financial profitability of potential infrastructure projects", "3. Judge the attractiveness of public sector infrastructure projects and monetize non-monetary costs and benefits if necessary", "4. Construct a cash flow diagram to summarize the timing and magnitude of cash flows over time", "Identify sources of capital for governments and businesses, and calculate the associated cost of capital for financing their projects", "Exam Period", "Cash Flow Analysis", "Comparison Methods", "Public Sector Decision Making", "Inflation", "Public Sector Decision Making, Taxes, Inflation", "Engineering economics: Financial decision making for engineers (5th ed.)."]}, {"course_id": 21, "course_code": "ENVE 392", "course_name": "ENVE392 - Economics and Life Cycle Cost Analysis (0.50)", "term_name": "List B", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Economics and Life Cycle Cost Analysis Spring 2024", "08:30AM - 09:50AM DC 1350", "Email:  chris.bachmann@uwaterloo.ca", "Email: cglehmannskelton@uwaterloo.ca", "Marley Dowling", "Email: mkldowling@uwaterloo.ca", "Nastaran Mosavari Nezamabad", "Email: nastaran.mosavari.nezamabad@uwaterloo.ca", "Email: enkichiy@uwaterloo.ca", "Project financing, life-cycle cost analysis, time value of money, sensitivity analyses, tax, financial implications of infrastructure projects, quantitative decision-making, financial aspects of a business plan.", "Appraise and compare the financial profitability of potential infrastructure projects", "3. Judge the attractiveness of public sector infrastructure projects and monetize non-monetary costs and benefits if necessary", "4. Construct a cash flow diagram to summarize the timing and magnitude of cash flows over time", "Identify sources of capital for governments and businesses, and calculate the associated cost of capital for financing their projects", "Exam Period", "Cash Flow Analysis", "Comparison Methods", "Public Sector Decision Making", "Inflation", "Public Sector Decision Making, Taxes, Inflation", "Engineering economics: Financial decision making for engineers (5th ed.)."]}, {"course_id": 23, "course_code": "GEOE 392", "course_name": "GEOE392 - Economics and Life Cycle Cost Analysis (0.50)", "term_name": "List B", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Economics and Life Cycle Cost Analysis Spring 2024", "08:30AM - 09:50AM DC 1350", "Email:  chris.bachmann@uwaterloo.ca", "Email: cglehmannskelton@uwaterloo.ca", "Marley Dowling", "Email: mkldowling@uwaterloo.ca", "Nastaran Mosavari Nezamabad", "Email: nastaran.mosavari.nezamabad@uwaterloo.ca", "Email: enkichiy@uwaterloo.ca", "Project financing, life-cycle cost analysis, time value of money, sensitivity analyses, tax, financial implications of infrastructure projects, quantitative decision-making, financial aspects of a business plan.", "Appraise and compare the financial profitability of potential infrastructure projects", "3. Judge the attractiveness of public sector infrastructure projects and monetize non-monetary costs and benefits if necessary", "4. Construct a cash flow diagram to summarize the timing and magnitude of cash flows over time", "Identify sources of capital for governments and businesses, and calculate the associated cost of capital for financing their projects", "Exam Period", "Cash Flow Analysis", "Comparison Methods", "Public Sector Decision Making", "Inflation", "Public Sector Decision Making, Taxes, Inflation", "Engineering economics: Financial decision making for engineers (5th ed.)."]}, {"course_id": 24, "course_code": "MSE 261", "course_name": "MSE261 - Engineering Economics: Financial Management for Engineers (0.50)", "term_name": "List B", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Engineering Economics: Financial Management for Engineers Winter 2025", "10:30AM -", "12:20PM RCH 306", "S. Mortazavian Farsani", "10:30AM - 11:20AM RCH 306", "Depreciation models and asset replacement analysis.", "View requirements for MSE 261", "Engineers are often required by society to make responsible decisions on complex issues that have financial, economic, political and environmental elements.", "This course presents engineering economics as a key part of an engineer’s decision-making mandate.", "Engineering Economics focuses on basic principles and applications of economic decision-making between alternatives encountered in engineering systems projects.", "Apply basic financial calculations, useful in personal life and business [", "4. Recognize the impact of inflation and taxation in making engineering economics decisions [11b]", "Analyze the public centered projects by their costs and benefits (dis-benefits) to society and environment [9a, 9b, 11b]", "Understand and analyze the components of financial statements and use them in investment decisions and preparing business plans [1c, 11b]", "The course will be dynamic and hence, the weekly schedule provided in this document is tentative and subject to slight changes in order to adapt to the needs and conditions the class may face.", "Week of", "Introduction", "Cash Flow Analysis", "-", "Replacement Analysis", "Inflation", "Public Sector Decision Making", "Introduction to Project Management", "Engineering Economics: Financial Decision Making for Engineers (7th Edition).", "Engineering Economic Analysis (4th Canadian Edition).", "Quizzes are non-cumulative while midterm and final exams are cumulative in the sense that final exam covers whatever covered after the midterm content.", "In case of any technical issues uploading the files, please email the TAs right away.", "All assessments will be also submitted online in that case.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 25, "course_code": "SYDE 262", "course_name": "SYDE262 - Engineering Economics of Design (0.50)", "term_name": "List B", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Engineering Economics of Design Fall 2024", "jessie.ma@uwaterloo.ca", "11:30AM - 12:20PM E7 4433", "jessie.ma@uwaterloo.ca", "Jessie Ma | jessie.ma@uwaterloo.ca | E7-6304", "Topics include microeconomics, supply, demand and external costs in the context of systems design.", "Evaluate and compare alternatives for an engineering firm's financial decisions (GA 11a, 11b)", "Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)", "Create a business plan for an engineering firm, accounting for uncertainty in economic and environmental aspects (GA 9a, 9b)", "Identify external costs in the context of systems design, including the use of sustainability indicators (GA 9a, 9b)", "1 Sep 2 Introduction Introduction", "3 Sep 16   Decision Making - Cash Flow Series Patters Assignment 1 posted Evaluate and compare alternatives for an engineering firm's financial decisions (GA 11a, 11b) Excel", "4 Sep 23   Decision Making 2 - Basic Evaluation Methods   Evaluate and compare alternatives for an engineering firm's financial decisions (GA 11a, 11b) Excel", "5 Sep 30   Decision Making 3 - Analysis Period & Project Lives; Risk Analysis Assignment 1 due Oct 4 Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)  Excel", "6 Oct 7 2. Context - Looking Outside Entrepreneurship   Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)", "9 Oct 28   Intrapreneurship; Evaluation of Complex Projects (Replacement Analysis, Life Cycle Costs, Benefit-Cost Analysis) Group Project posted Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)", "Identify external costs in the context of systems design, including the us of sustainability indicators (GA 9a, 9b)", "Identify external costs in the context of systems design, including the us of sustainability indicators (GA 9a, 9b)", "12 Nov 18   Business Plans; Markets   Create a business plan for an engineering firm, accounting for uncertainty in economic and environmental aspects (GA 9a, 9b) Excel", "Notice of Recording", "Sign your email with your first and last name and your student number.", "There could be a need to make alternate arrangements for in-person course activities.", "This alternate arrangement could be for a short period of time (e.g., one week) or a more sustained disruption to in-person course activities.", "Impacted in-person deliverables will be handled on a case-by-case basis with notification provided as soon as possible (see COVID-19-Related Absences and Short-Term Absences below).", "They will review your case and coordinate a reasonable and fair plan in consultation with appropriate others.", "Laptops, Tablets, and Electronic Devices", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.", "A.A.S. also offers learning strategy supports to all students that can be accessed through:", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 26, "course_code": "AE 101", "course_name": "AE101 - History of the Built Environment (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Monday -", "Monday", "02:30PM - 05:20PM", "01:30PM - 05:20PM", "· complete a case study research/poster assignment", "I prefer you to go out and sketch in situ rather than from an image online.", "As time permits, I will do some live detail sketches in class, and these should also be included in your sketchbook as part of the annotated notes.", "I understand that this may be challenging for those used to shorter classes.", "2. Understand the critical role of technology as it informs architectural design.", "How did the changed in major structural materials impact the nature of design?", "propel design in other ways.", "So in this first class we will look at an overview of this as a means to allow for a deeper understanding of this notion throughout the course.", "An historical investigation of the invention of iron and steel framing systems and the ramifications on modern architectural conceptual design theories and implementation.", "An historical investigation of the invention of reinforced concrete and the ramifications of the monolithic structure on modern design theories and construction practices.", "Material nature of concrete: compressive", "An Introduction to the Science of Buildings", "Buildings must not only work from a cultural and functional perspective, but they need to address fundamental issues of site, climate and sustainability.", "There is much to be learned from indigenous and vernacular architecture - that worked before the advent of modern AC and heating systems.", "The location and siting of the building must acknowledge solar orientation, the availability of wind for natural cooling, microclimate.", "No class - Terri at CISC Conference in Calgary", "Introduction to the fundamentals of masonry construction, including brick and concrete block, modular sizing, terminology, building practice.", "Differentiating between load bearing and cladding systems use of the material.", "This lecture will look at a wide range of systems of enclosure.", "The transition from load bearing walls to the skeleton frame and curtain wall system has enabled much variety in enclosure systems.", "A lead into thinking more deeply about building enclosure systems, which is the focus of the 2A Design Studio that I teach you in the future.", "A lot at how aesthetics feeds into facade design.", "THE ARCHITECTURE OF ASSEMBLY:", "A study of the impact of industrialized building processes on design strategies.", "This course includes the independent development and practice of specific skills, such as sketching and note taking.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 27, "course_code": "AE 491", "course_name": "AE491 - Engineering Law and Ethics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["G. Smeijers", "email", "The objective of the course is to introduce you to basic principles of law and ethics relevant to the practice of civil engineering.", "Understand the basic structure of Canada’s legal system.", "Understand the basics of Canada’s environmental and health/safety regulatory systems.", "Be able to review a fact pattern and identify concerns related to all of the above.", "We will cover a topic each week of the term as set-out below.", "1              Introduction to Law and Regulation", "As such, any of the following are absolutely inappropriate in the context of this course and will be handled accordingly:"]}, {"course_id": 28, "course_code": "AFM 131", "course_name": "AFM131 - Introduction to Business in North America (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Business in North America Winter 2025", "AFM 131", "Coverage also includes study of the principles of effective management and the financial system as a source of corporate capital.", "View requirements for AFM 131", "Describe the business environment and the relationships between the functional areas of business", "Write in a professional manner to effectively communicate in the appropriate context (e.g., in a discussion board)", "Demonstrate collaboration skills (i.e., understanding, respect) to work effectively in a team during discussions", "Penalties for Academic Integrity Offenses", "48 hour short-term absence", "Self-declared COVID-related absence", "Intellectual property includes items such as:", "Cross-listed courses", "Phone: 519-884-0000 extension 213", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 29, "course_code": "AFM 333", "course_name": "AFM333 - International Business (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "AFM 333 / ARBUS 301", "AFM 333 001", "10:00AM - 11:20AM ONLN - Online", "10:00AM - 11:20AM HH 1101", "AFM 333 002", "11:30AM -", "AFM 333 003", "10:00AM - 11:20AM ONLN - Online", "10:00AM - 11:20AM HH 1101", "11:30AM -", "AFM 333 / ARBUS 301:", "AFM 333: View requirements for AFM 333", "Analyze the impact of various events in the global business and political environment", "Research and review information about the business, social and political culture of various countries", "Apply case analysis techniques to solving real world business problems by identifying symptoms and root causes, analyzing alternatives, and making recommendations backed up by persuasive evidence", "Define and discuss relevant international business concepts including globalization, comparative advantage, supply chains, and international marketing, HR and financial management", "There is a scheduled online and in class section each week.", "In general you will prepare the online lectures ahead of class.", "Your online textbook and the online lectures you will complete each week are in place of a second in person lecture.", "(Please check your spam folder first)", "The following is a guideline of how your assessment will be consolidated with the instructor’s evaluation of your “in class” contribution and will map to a range of contribution grades assigned at the end of term:", "TopHat Learning Resource & Quizzes", "(please check your spam folder first)", "These will be randomly assigned in week two and will generally include a mix both AFM and ARBUS students.", "Using your preferred online collaboration tool, your student team will prepare a 3 minute audio and/or video recording along with support PowerPoint slides which summarizes a current event article related to globalization, international business, or a core topic of the course.", "This submission should discuss the impacts or implications of the article including how it may relate to key concepts covered in the course as well as your team’s analysis and opinion on the topic.", "Teams should escalate quickly to Faculty if they need help resolving critical team issues.", "A final case examination covering all material in the course, will be scheduled during the exam period (timing TBD) and will be released and available for completion within a 24 hour period.", "Both exams are designed to be completable within a 2-3 hour period during the 24 hour window.", "Notice of Recording", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}]