[{"course_id": 13, "course_code": "EARTH 221", "course_name": "EARTH221 - Introductory Geochemistry (0.50)", "term_name": "List 2", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Notice of Recording", "EARTH 221", "EARTH 221 001", "EARTH 221 101", "RCH 306", "My PhD was completed in 2014 in nitrogen cycling and use of stable isotopes to understand N cycling in the Grand River, Ontario.", "EARTH 221:", "Introduction to environmental isotope geochemistry and radiometric dating.", "Basic aqueous geochemistry: pH, carbonate equilibrium, and common ions in natural waters.", "View requirements for EARTH 221", "Calculate basic geochemical parameters and create associated diagrams", "Identify applications of geochemistry for environmental problems/studies", "Present and discuss geochemical scientific literature", "Please read slides for Intro, element abundances, isotopes, chart of the nuclides, nucleosynthetic processes", "Highlights of Origin of Elements", "Periodic Table/Earth Formation", "Solar System geochemistry and planetary formation, composition of meteorites", "Chemistry of bulk Earth, atmosphere, oceans, crust, mantle, and core   A2 Misra p. 296 – 313, 326-344, 354-362", "Equilibrium constants, introduction to phase diagrams, basics of kinetics", "Basic concepts, laws of thermodynamics, Gibb's free energy.", "Igneous rock geochemistry", "A4 Misra p. 226 –  240, 310-313", "Introduction to Geochemistry.", "This grade includes:", "In groups of 4, you will present the findings of a recent scientific paper that includes some geochemistry.", "It is a closed book test.", "Typical question types may be multiple choice, interpreting diagrams, explaining concepts, and doing calculations (equations provided).", "Equations are provided and you should definitely bring a calculator.", "Notice of Recording", "Extensions and Accommodations", "Extensions and other accommodations will only be considered on a case-by-case basis.", "You are taking full responsibility for AI-generated materials as if you had produced them yourself: ideas must be attributed and facts must be true.", "In reference list:", "URL of the platform where the conversation took place]."]}, {"course_id": 14, "course_code": "ENVE 275", "course_name": "ENVE275 - Environmental Chemistry (0.50)", "term_name": "List 2", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Environmental Chemistry Winter 2025", "Equilibrium chemistry including Log-concentration diagrams, titration and buffering intensity, dissolution/precipitation, carbonate system, hardness, and complex formation.", "Classification, nomenclature, physical/chemical parameters and partitioning of organic compounds.", "Basic redox chemistry including: half cell reactions, Faraday and Nernst equations, and pE-pH diagrams.", "Appreciate the role of chemistry in environmental engineering.", "Develop the capabilities to solve problems by combining several chemistry concepts.", "Appreciate simple methods to determine dissolved ionic species in solution.", "Develop conceptual knowledge of equilibrium, equilibrium constant, and their applications to systems at equilibrium.", "Use chemical thermodynamics to estimate equilibrium.", "Calculate acid-base equilibria, buffering capacity and the role they play in environmental systems.", "Understand metal speciation and its relationship to pH.", "Estimate hardness and alkalinity.", "Develop skills for balancing oxidation-reduction reactions, and understand pE-pH diagrams.", "Write a simple laboratory report including data and analysis.", "Application of chemistry in environmental engineering; natural water and its composition; methods of expressing concentration: concentration units, electroneutrality; ionic strength.", "Week 3-4: Chemical reaction in aqueous solution"]}, {"course_id": 15, "course_code": "ENVS 200", "course_name": "ENVS200 - Field Ecology (0.50)", "term_name": "List 2", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Field Ecology Winter 2025", "**We aim to respond to forum posts and necessary emails within general workday hours (8:30 AM – 4:30 PM) and within 24hrs, except over weekends and holidays.", "Introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "View requirements for ENVS 200", "Such knowledge, called ecoliteracy, will provide a critical basis for your engagement in the 21st century, the “century of the environment”—not least because so many of the environmental issues we face derive in part from a limited understanding of how we are embedded within and dependent upon ecological systems.", "Field ecology necessarily harbours an ethical component both because of our natural affinity for life (or ‘biophilia’) and because questions of ecological ‘impact’ and 'quality’ are necessarily value-laden.", "In summary, this course introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "By the end of this course, you should be on a path to life-long learning as an ecologically-literate citizen.", "Demonstrate how these principles apply to real-world situations (in context of lab activities, assignments, and labs), including human interactions with the natural world.", "Articulate the elements of scientific inquiry as they apply to ecology/", "These course learning outcomes will not only prepare you to be an informed citizen and member of the community of life on earth, but also provide the basis for knowledge, humility, and wisdom in your dealings with ecological problems in your daily life and eventual career.", "Week Number", "Introduction and indicator species: Bird identification Lab 1:  Survey completed and submitted in lab (2%)", "3. Jan 21 *Conditions and Resources; Climate and Biomes", "You should review the course “reading guide” in LEARN before reading because you are not responsible for all textbook sections and vocabulary.", "demonstrate how these principles apply to real-world situations, including human interactions with the natural world Readings, Labs, Discussion board Weekly lecture quizzes and activities, exams, lab activities, discussion forums", "These experiences are intended to help you apply ecological concepts in real-world contexts while building valuable field skills.", "Simply missing a deadline and later mentioning registration with Accessibility Services will not be considered sufficient.", "Appeals and grievance", "Availability for exams", "These slides are meant to be a template for your note-taking: they will not replace careful attention, note-taking and participation.", "Along with the University of Waterloo and the Faculty of Environment and its Departments, I consider your well-being to be extremely important.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "However, there may be instances during lectures where AI usage is allowed after receiving clear verbal permission from the professor.", "Students are responsible for following these guidelines and seeking clarification when needed.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 16, "course_code": "ERS 383", "course_name": "ERS383 - Tropical Ecosystems (0.50)", "term_name": "List 2", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Tropical Ecosystems Winter 2025", "ERS 383", "08:30AM - 11:20AM RCH 309", "TBD", "ERS 383:", "This course examines the fundamental concepts of terrestrial ecosystems in tropical climates.", "View requirements for ERS 383", "Fundamental concepts in tropical terrestrial ecosystems", "Major tropical resource systems", "Fundamental Concepts of Tropical Ecosystems", "- Introduction to the course", "- Tropical biomes & ecoregions", "Major Tropical Resource Systems", "- Tropical vegetation", "- Tropical soils", "- Nutrient cycling, carbon &", "climate change", "- Forest landscapes & loss", "- Rainforest development and", "Dynamics", "-Tropical forest management", "- Humans & terrestrial", "ecosystems", "- Tropical agroecosystems &", "Tropical Ecology Yes 107.30", "Teaching & Learning Methods", "MODULE 1: Fundamental Concepts in Tropical Terrestrial Ecosystems", "MODULE 2: Major Tropical Resource Systems", "PowerPoint slides", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 17, "course_code": "GEOG 432", "course_name": "GEOG432 - Health and the Built Environment (0.50)", "term_name": "List 2", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["08:30AM - 09:50AM EV2 2002", "Dr. Adrian Buttazzoni", "Students will learn the history and evolution of both public health and urban planning professions and academic disciplines and gain an appreciation of the theories and methods used in each.", "Introduction", "This course will trace the history and evolution of both professions, academic disciplines, and will compare both theory and methods used.", "Compare planning and public health perspectives on: history and the evolution of the disciplines; theory; methods; power and jurisdiction", "Identify and analyze interactions between natural and built environment characteristics and human health and disease", "Demonstrate interdisciplinary collaboration skills and articulate the benefits of interdisciplinary group work", "Articulate equity considerations of planning decisions and explain the extent to which equity may or may not be important in planning", "Gather and synthesize evidence and develop data-driven predictions of future urban trends.", "Online lecture material covers conceptual and empirical examples/case studies of environment and health relationships.", "Students are responsible for completing the required readings each week, and for keeping informed about course information through LEARN.", "Readings have been selected to provide a balance of breadth and depth into important course concepts.", "Jan 8 Module 1: Introduction to the Course, Equity", "Module 2: History and Evolution of Planning and Public Health", "Introduction to the Future Cities Institute", "Module 3: Theory in Planning and Public Health", "Feb 10, 12 Module 6: Cardiovascular, Muscular, and Skeletal Systems and the Built Environment", "Feb 24, 26 Module 7: Digestive System and the Built Environment", "Mar 17, 19 Module 10: Climate Change and Physiological Systems", "The role of behavioral science theory in development and implementation of public health interventions.", "Commentary: alternative cultures in planning research—from extending scientific frontiers to exploring enduring questions.", "Should planners create hierarchies of evidence?", "The value of Twitter data for determining the emotional responses of people to urban green spaces: A case study and critical evaluation.", "Supervised injection facilities in Canada: past, present, and future.", "Rather than reading on your own, we will be using Perusall – a software designed for collaborative reading where you will be annotating, questioning, and commenting on the assigned readings in groups of students.", "The completion of readings and your level and quality of engagement establish your grade.", "Remember you are communicating a complex topic to a general audience, so you will want to find a balance between the depth and accessibility of information presented.", "Be creative!", "The purpose of this exercise is to familiarize students with having to analyze and communicate complex environment and health topics to general (i.e., non-expert) audiences that in contemporary society often do not read policy reports but rather engage fact sheets, infographics, executive summaries, and other forms of high-level communications.", "Examples of fact sheets/infographics can be found on the CDC website (Spotlight Infographic section) or via these links to infographics about heart disease, adolescent health, and health status and determinants.", "You will be presenting the findings of your final reports to a guest panel of Future Cities Representatives.", "*Detailed assignment instructions can be found on LEARN", "Fact Sheet and Issue Summary", "Short-term absence declarations will be dealt with in the following ways:", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Reading the syllabus: Professors spend a LOT of time and energy creating syllabi that we think are clear, and let students know what to expect and how to prepare.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 18, "course_code": "HLTH 420", "course_name": "HLTH420 - Health and the Built Environment (0.50)", "term_name": "List 2", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["08:30AM - 09:50AM EV2 2002", "Dr. Adrian Buttazzoni", "Students will learn the history and evolution of both public health and urban planning professions and academic disciplines and gain an appreciation of the theories and methods used in each.", "Introduction", "This course will trace the history and evolution of both professions, academic disciplines, and will compare both theory and methods used.", "Compare planning and public health perspectives on: history and the evolution of the disciplines; theory; methods; power and jurisdiction", "Identify and analyze interactions between natural and built environment characteristics and human health and disease", "Demonstrate interdisciplinary collaboration skills and articulate the benefits of interdisciplinary group work", "Articulate equity considerations of planning decisions and explain the extent to which equity may or may not be important in planning", "Gather and synthesize evidence and develop data-driven predictions of future urban trends.", "Online lecture material covers conceptual and empirical examples/case studies of environment and health relationships.", "Students are responsible for completing the required readings each week, and for keeping informed about course information through LEARN.", "Readings have been selected to provide a balance of breadth and depth into important course concepts.", "Jan 8 Module 1: Introduction to the Course, Equity", "Module 2: History and Evolution of Planning and Public Health", "Introduction to the Future Cities Institute", "Module 3: Theory in Planning and Public Health", "Feb 10, 12 Module 6: Cardiovascular, Muscular, and Skeletal Systems and the Built Environment", "Feb 24, 26 Module 7: Digestive System and the Built Environment", "Mar 17, 19 Module 10: Climate Change and Physiological Systems", "The role of behavioral science theory in development and implementation of public health interventions.", "Commentary: alternative cultures in planning research—from extending scientific frontiers to exploring enduring questions.", "Should planners create hierarchies of evidence?", "The value of Twitter data for determining the emotional responses of people to urban green spaces: A case study and critical evaluation.", "Supervised injection facilities in Canada: past, present, and future.", "Rather than reading on your own, we will be using Perusall – a software designed for collaborative reading where you will be annotating, questioning, and commenting on the assigned readings in groups of students.", "The completion of readings and your level and quality of engagement establish your grade.", "Remember you are communicating a complex topic to a general audience, so you will want to find a balance between the depth and accessibility of information presented.", "Be creative!", "The purpose of this exercise is to familiarize students with having to analyze and communicate complex environment and health topics to general (i.e., non-expert) audiences that in contemporary society often do not read policy reports but rather engage fact sheets, infographics, executive summaries, and other forms of high-level communications.", "Examples of fact sheets/infographics can be found on the CDC website (Spotlight Infographic section) or via these links to infographics about heart disease, adolescent health, and health status and determinants.", "You will be presenting the findings of your final reports to a guest panel of Future Cities Representatives.", "*Detailed assignment instructions can be found on LEARN", "Fact Sheet and Issue Summary", "Short-term absence declarations will be dealt with in the following ways:", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Reading the syllabus: Professors spend a LOT of time and energy creating syllabi that we think are clear, and let students know what to expect and how to prepare.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 19, "course_code": "PLAN 432", "course_name": "PLAN432 - Health and the Built Environment (0.50)", "term_name": "List 2", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["08:30AM - 09:50AM EV2 2002", "Dr. Adrian Buttazzoni", "Students will learn the history and evolution of both public health and urban planning professions and academic disciplines and gain an appreciation of the theories and methods used in each.", "Introduction", "This course will trace the history and evolution of both professions, academic disciplines, and will compare both theory and methods used.", "Compare planning and public health perspectives on: history and the evolution of the disciplines; theory; methods; power and jurisdiction", "Identify and analyze interactions between natural and built environment characteristics and human health and disease", "Demonstrate interdisciplinary collaboration skills and articulate the benefits of interdisciplinary group work", "Articulate equity considerations of planning decisions and explain the extent to which equity may or may not be important in planning", "Gather and synthesize evidence and develop data-driven predictions of future urban trends.", "Online lecture material covers conceptual and empirical examples/case studies of environment and health relationships.", "Students are responsible for completing the required readings each week, and for keeping informed about course information through LEARN.", "Readings have been selected to provide a balance of breadth and depth into important course concepts.", "Jan 8 Module 1: Introduction to the Course, Equity", "Module 2: History and Evolution of Planning and Public Health", "Introduction to the Future Cities Institute", "Module 3: Theory in Planning and Public Health", "Feb 10, 12 Module 6: Cardiovascular, Muscular, and Skeletal Systems and the Built Environment", "Feb 24, 26 Module 7: Digestive System and the Built Environment", "Mar 17, 19 Module 10: Climate Change and Physiological Systems", "The role of behavioral science theory in development and implementation of public health interventions.", "Commentary: alternative cultures in planning research—from extending scientific frontiers to exploring enduring questions.", "Should planners create hierarchies of evidence?", "The value of Twitter data for determining the emotional responses of people to urban green spaces: A case study and critical evaluation.", "Supervised injection facilities in Canada: past, present, and future.", "Rather than reading on your own, we will be using Perusall – a software designed for collaborative reading where you will be annotating, questioning, and commenting on the assigned readings in groups of students.", "The completion of readings and your level and quality of engagement establish your grade.", "Remember you are communicating a complex topic to a general audience, so you will want to find a balance between the depth and accessibility of information presented.", "Be creative!", "The purpose of this exercise is to familiarize students with having to analyze and communicate complex environment and health topics to general (i.e., non-expert) audiences that in contemporary society often do not read policy reports but rather engage fact sheets, infographics, executive summaries, and other forms of high-level communications.", "Examples of fact sheets/infographics can be found on the CDC website (Spotlight Infographic section) or via these links to infographics about heart disease, adolescent health, and health status and determinants.", "You will be presenting the findings of your final reports to a guest panel of Future Cities Representatives.", "*Detailed assignment instructions can be found on LEARN", "Fact Sheet and Issue Summary", "Short-term absence declarations will be dealt with in the following ways:", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Reading the syllabus: Professors spend a LOT of time and energy creating syllabi that we think are clear, and let students know what to expect and how to prepare.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 20, "course_code": "CHE 571", "course_name": "CHE571 - Industrial Ecology (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Industrial Ecology Fall 2024", "04:00PM - 05:20PM", "Industrial ecology is a rapidly growing field that systematically examines local, regional, and global uses and flows of materials and energy in products, processes, industrial sectors, and economies.", "It focuses on the potential role of industry in reducing environmental burdens throughout the product life cycle from the extraction of raw materials to the production of goods, to the use of those goods and to the management of the resulting wastes.", "This course will review the environmental issues associated with chemical industries and the roles of engineers to manage these issues.", "The principles and philosophy of green chemistry will be addressed including pollution prevention in unit operations.", "The concepts and practices of environmental life cycle analysis and accounting will be addressed in detail, together with the basics of risk assessment, management and communication.", "View requirements for CHE 571", "Introduction to sustainability and industrial ecology", "Brief overview of the scientific evidence for climate change", "Environmental Law in Canada; due diligence as a defence", "Climate legislation in Canada; carbon trading", "Describe the key principles of industrial ecology, sustainable development and sustainability engineering [1d,8a,9a].", "Explain the science of global warming and climate change [", "Apply carbon accounting standards to develop greenhouse gas emission and reduction estimates for inventories and reduction projects [", "Describe key environmental legislation in Ontario and Canada [8b,9a]", "Basics of sustainability and industrial ecology.", "Introduction to greenhouse gas (GHG) accounting.", "Week 5 GHG accounting - offset systems.", "A timed multiple-choice component.", "3.0 points - solutions are complete, correct and well-presented.", "2.0-2.5 points - solutions are mostly complete and well-presented but have minor errors, missing information.", "Intellectual property includes items such as:", "Graduate Attribute Program Indicators", "A knowledge base for engineering: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "1a Demonstrate understanding of concepts in mathematics.", "1b Demonstrate understanding of concepts in natural science.", "1c Demonstrate understanding of engineering fundamentals.", "1d Demonstrate understanding of specialized engineering knowledge.", "2. Problem Analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "3a Create investigative studies of complex engineering problems.", "3b Gather information from relevant sources to address complex engineering problems.", "4. Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "4a Define design requirements and specifications for complex, open-ended engineering problems.", "4b Critically evaluate and compare design choices.", "7. Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "8a Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Impact of Engineering: An ability to analyze social and environmental aspects of engineering activities.", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "10a Identify ethical and unethical behavior in professional situations.", "10b Identify how an engineer is accountable to multiple stakeholders in engineering practice.", "Life-long Learning: An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge.", "12a Identify gaps in their knowledge, skills and abilities.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 21, "course_code": "CHE 572", "course_name": "CHE572 - Air Pollution Control (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["CHE 572", "CHE 572 001", "CHE 572:", "Design of industrial particulate capture systems using cyclones, electrostatic precipitators, filters, scrubbers.", "Design of organic compound emissions control using incineration, biofiltration, adsorption and absorption.", "View requirements for CHE 572", "Recognize air emission and air quality issues and impacts, and the rationale for their regulation and control.", "Model simple air dispersion problem scenarios and evaluate the significance of the results.", "Identify, rank and select appropriate emission control technologies for a variety of scenarios.", "Perform preliminary process design and cost estimation for a variety of common emission control technologies, and recommend next steps.", "Recognize and recommend mitigation strategies for environmental and safety issues associated with air pollution control.", "Assess indoor air quality concerns and identify potentially useful mitigation techniques.", "Introduction, structure & composition of the atmospheres.", "Indoor air quality & investigations.", "Infection transmission control methods.", "The notes will be required for use in design calculations in almost every class, and exams.", "Comparing answers and discussing reasons for differences", "The following levels of collaboration are not acceptable:", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 22, "course_code": "CHE 574", "course_name": "CHE574 - Industrial Wastewater Pollution Control (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["S. Meunier", "sarah.meunier@uwaterloo.ca", "Dr. Sarah Meunier", "sarah.meunier@uwaterloo.ca", "Sarah Rezaei", "E6-1102", "Principles and design of treatment methods: chemical treatment, precipitation, coagulation and flocculation, ion exchange and membrane separation.", "View requirements for CHE 574", "4. Propose techniques to reduce and treat waste in a variety of industrial processes [1d,2a,2b,3a,3b,6a,6b,7a,7b,7c].", "Assignment 4 5% Topics 6 & 7 - Membrane Separations & Ion Exchange April 4", "Examinations", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 23, "course_code": "CIVE 375", "course_name": "CIVE375 - Environmental Engineering Principles (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Environmental Engineering Principles Fall 2024", "DWE 1501", "02:30PM - 03:20PM", "08:30AM - 11:20AM DWE 1407", "08:30AM - 11:20AM DWE 1407", "08:30AM - 11:20AM DWE 1407", "08:30AM - 11:20AM DWE 1407", "08:30AM - 11:20AM DWE 1407", "Water quality, air pollution, fate and transport of contaminants in natural and engineered systems, and pollution prevention.", "Water and wastewater treatment systems and design principles.", "Explain the importance of water and air quality in natural and engineered systems", "Qualify and quantify transformation and transport phenomena", "Formulate material balances for fluid systems", "Use and judge mathematical models for predicting water quality, including in rivers and lakes", "1-3 Overview of environmental engineering", "8 Modelling transport and transformation", "Piazza – primary way to get & give text-based help (https://piazza.com/uwaterloo.ca/fall2024/cive375)", "Students are very welcome and encouraged to meet with the teaching team in scheduled office hours.", "This course includes the independent development and practice of specific skills, such as problem solving and communication skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 24, "course_code": "ENVE 375", "course_name": "ENVE375 - Physico-Chemical Processes (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Physico-Chemical Processes Spring 2024", "10:00AM - 11:20AM MC 4041", "Demonstrate a deep understanding of the fundamental chemical and physical mechanisms commonly observed in natural and engineered systems.", "Demonstrate the ability to integrate the mechanism models into systems models (i.e., mass balance relationships).", "Employ system models, where appropriate, for engineering analysis and design.", "Design and size preliminary process configurations for the physico-chemical treatment of surface water, groundwater, stormwater, and municipal and industrial wastewater", "Week 12: Membrane-based processes", "TBD"]}, {"course_id": 25, "course_code": "ENVE 376", "course_name": "ENVE376 - Biological Processes (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["08:30AM - 09:50AM RCH 204", "Quantitatively describe common biological substrates in environmental engineering", "2. Quantitatively describe the microbiology and chemistry associated with common biological processes employed in environmental engineering systems", "3. Develop mass balance-based biological process models", "Apply process models for analysis and design of environmental engineering systems", "Introduction to Biological Processes, types of pollutants, applications  Week 1", "Process Configurations and Biomass Morphology, suspended growth systems, fixed film, aggregation Week 3", "Modeling of Biochemical Transformations, growth and substrate utilization, endogenous processes, hydrolysis, matrix representation of biochemical processes  Weeks 4−6", "Calculator Standard requirement for engineering courses Yes", "Evaluating Natural Source Zone Depletion at Sites with LNAPL, Interstate Technology & Regulatory Council, Washington, DC (2009)", "In cases where the number of students does not divide evenly into groups of two, students may form groups of three.", "Laboratory activities and reports are completed and submitted in groups of three.", "In cases where the number of students does not divide evenly into groups of three, students may form groups of four.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 26, "course_code": "ENVE 577", "course_name": "ENVE577 - Engineering for Solid Waste Management (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Attention is given to the engineering design and operational aspects of the control of generation, storage, collection, transfer and transport, processing and disposal of solid wastes in landfill site.", "Design of natural attenuation sites and system reliability features for landfill designs.", "Topics include waste characterization, collection systems, transportation, treatment technologies, landfill design, recycling, waste-to-energy systems, greenhouse gas impacts, and policy frameworks.", "Understand the composition and generation rates of solid waste", "Analyze waste collection, segregation, and treatment methods", "Design components of solid waste management systems (e.g., landfills, composting systems)", "Explore innovative technologies for resource recovery, recycling, and waste-to-energy processes", "Module 1: Introduction to Solid Waste Management", "Definition and types of solid waste", "Examples of waste management systems from different regions", "Calculate the waste generation rate (WGR) per capita for a given dataset and project future WGR trends using population growth models", "Jan 9 Waste Generation and Characteristics", "Physical, chemical, and biological characteristics", "Typical components and composition of waste", "Hazardous wastes and recycling streams", "Introduction to waste composition audits", "Calculate the environmental impact using simplified LCA metrics for waste scenarios", "Jan 16 Lifecycle Analysis and Waste Hierarchy", "Jan 21   Waste Collection Systems", "Door-to-door collection", "Community bins and transfer stations", "Equipment used in collection", "Estimate transportation costs for different modes of waste transfer (e.g., by truck, rail) based on distance, fuel costs, and waste tonnage", "Operations and routing strategies", "Design and function of transfer stations", "Jan 28   Temporary Storage Solutions", "Design of storage bins and containers", "Safety considerations", "Calculate the capacity needs of storage containers", "based on waste generation rates and collection frequency", "Role of public awareness", "Estimate biogas yield from anaerobic digestion of organic waste using stoichiometric calculations", "Process design and optimization", "Applications and challenges", "Incineration: principles and applications", "Pyrolysis and gasification", "Calculate energy recovery from the incineration of municipal solid waste using calorific values", "Design of Material Recovery Facilities (MRFs)", "Challenges in recycling", "Technical, environmental, and economic considerations", "Assess the efficiency of a WTE plant using energy balance equations", "Definitions and frameworks", "Composting and anaerobic digestion as mitigation techniques", "Site selection and design", "Leachate and gas management", "Design a landfill’s leachate collection system based on given permeability and rainfall data", "Operational strategies", "Post-closure monitoring and land reuse", "Environmental and health impacts", "Strategies for remediation", "*TBD", "Mar 13 Analysis and Design of Solid Waste Management Infrastructure", "Design and operation of materials recovery facilities", "Overview of thermal methods and biological processes", "Mar18                          Digital and Smart Solutions for SWM", "Data analytics for waste tracking", "*TBD", "Tools and methodologies", "Challenges and solutions", "Innovations in SWM policies", "** Note:", "Design Project 25%", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, such as practical analysis and critical thinking.", "Library for research-based assignments"]}, {"course_id": 27, "course_code": "ME 452", "course_name": "ME452 - HVAC Load Analysis and Design Fundamentals (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Notice of Recording", "HVAC Load Analysis and Design Fundamentals Winter 2025", "11:30AM - 12:20PM RCH 305", "Email: hasan.habib@uwaterloo.ca", "Duct design and fan selection.", "Heating and cooling load calculations.", "Infiltration and exfiltration.", "B. Be able to fully design an air conditioning and ventilation system", "C. Be able to perform heating and cooling load, and preliminary energy use calculations for buildings", "D. Have developed the ability to apply their knowledge in a real-world setting (practical experience)", "E. Be capable of communicating effectively with industry professionals and clients", "F. Have developed the skills to research and interpret information needed to remain current in the field", "Module 1: Introduction to HVAC:  History, ASHRAE, Unit Systems (chap.", "Module 2: Air Conditioning and Ventilation: Fundamental Concepts of HVAC/Air Conditioning Systems (chap.", "3), Fans and Air Distribution Systems (chap. 16).", "A tentative checklist of material to be reviewed each week will be posted in Learn.", "Midterm Exam: will be held in two parts during scheduled lecture time.", "You can also present case studies of interesting buildings or even a biographical review of someone who made an impact to HVAC.", "A) Develop an appreciation and understanding for the various codes, standards, and guidelines that determine HVAC design practices X    X", "B) Fully specify and design an air conditioning and ventilation system   X", "C) Perform heating and cooling load, and preliminary energy use calculations for buildings     X", "F) Develop the skills to research and interpret information needed to remain current in the field X", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 28, "course_code": "ME 459", "course_name": "ME459 - Energy Conversion (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Energy Conversion Fall 2024", "10:00AM - 11:20AM E5 3102", "Design of fossil-fuel central power plants, including boiler efficiency calculations and advanced steam and binary cycles.", "Review of atomic physics including fission and fusion energy.", "Design of nuclear fission power plants including design of reactor core for critical conditions, fuel cycles and radiation hazards.", "Design considerations for solar energy conversion devices including: availability of solar energy, solar-thermal converters, thermal storage and photovoltaics.", "Principles of fuel cells and some aspects of their design.", "We look at the way Canada, and the world, use energy, where the energy comes from, the finite nature of some reserves, and the impact of this energy use on the environment.", "Sustainability and the security of energy supply are also discussed.", "We review conventional energy systems from an efficiency and global warming perspective.", "From the study of these various factors, it will become clear that new energy technologies will need to be adopted in the future.", "We then study energy conversion devices and systems not studied in previous courses: for example, nuclear reactors, MHD, fuel cells, solar energy conversion(s), wind energy conversion, co-generation, hydroelectricity, ethanol, methanol, geothermal, ocean thermal, wave, tidal, thermoelectric.", "The objective is to broaden the students’ understanding of energy, both in a technical sense and in an environmental and socio-economic sense.", "6 Entropy and Availability", "8 Coal and Combustion", "9 Nuclear Energy", "11 Ethanol for Vehicles", "12 Methanol for Vehicles", "14 Solar Energy", "17 Wind Power", "18 Wave Power", "19 Tidal Power", "22 Thermoelectric", "Students must research in depth one topic in energy conversion and present their findings in a 7500 - 10000 word or so (~15-20 pages, … … or so) report.", "Project topics will be allocated in the first few lectures on a first-come, first-served basis.", "To select a topic, send me an email request, with alternatives in case your primary request is taken.", "However, the socio-economic and environmental aspects of the topic, and some indication of the magnitude of its possible impact on the demand for energy and on global-warming should also be considered."]}, {"course_id": 29, "course_code": "CIVE 230", "course_name": "CIVE230 - Engineering and Sustainable Development (0.50)", "term_name": "List 4", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Engineering and Sustainable Development Spring 2024", "10:00AM - 11:20AM RCH 301", "nadine.ibrahim@uwaterloo.ca", "nadine.ibrahim@uwaterloo.ca", "This course introduces the concept of sustainability and how it applies to decision-making in civil engineering.", "The course begins by defining sustainability, both practically and technically, and describing the concepts of systems, and systems interactions.", "Economic concepts and their applicability to sustainability are described for both developed and developing countries.", "Sustainability concepts covering the triple bottom line are presented, and their applicability to sustainability are described.", "First, the qualitative concepts and background information is presented.", "I’ll be teaching sustainable development and its connection to engineering using both a qualitative and quantitative understanding of sustainability.", "Qualitatively, this involves describing sustainability objectives, trends, current conditions and future projections, and to have a technical and public understanding of sustainability challenges.", "Quantitatively, this involves modeling environmental parameters using linear programming, differential equations, regression and extrapolation, and understanding the metrics used for sustainability assessments.", "I believe students have different strengths, where the diversity of coursework will leverage individual strengths and give everybody a chance to shine!", "I encourage you to read the announcements on a regular basis and stay up to date.", "IDENTIFY: Identify implications of human activities on the three dimensions of sustainability", "QUANTIFY: Quantify sustainability indicators to assess trade-offs", "DEMONSTRATE: Demonstrate course concepts to assess sustainability in global cities", "Relate course concepts to everyday activities and living experiences", "TBD", "Introduction to Engineering and the Environment.", "Introduction to Environmental Engineering and Science 3rd Edition, Prentice Hall.", "Some situations can warrant exceptions - speak to your instructor about these, and I’ll do my best to accommodate extenuating circumstances.", "Lecture topics will be presented in multiple formats to provide flexibility for different users and learning preferences.", "A knowledge survey on your thoughts and experiences with sustainability concepts and practices", "This will be open in the first and last weeks of term.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 30, "course_code": "EARTH 456", "course_name": "EARTH456 - Numerical Methods in Hydrogeology (0.50)", "term_name": "List 4", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Numerical Methods in Hydrogeology Winter 2025", "An introduction to the theory and practice of groundwater flow and contaminant transport modeling.", "Topics related to variably-saturated flow will focus on derivation of Richard's equation, a control volume finite difference discretization, assembly and solution of the flow equation, material balance error, truncation error analysis, stability and monotonicity.", "Explain the fundamental theory behind groundwater flow and contaminant transport modeling", "Apply numerical techniques, including control volume finite difference discretization, to solve groundwater flow and contaminant transport equations.", "Analyze numerical model accuracy, including material balance error, truncation error, stability, and monotonicity in variably-saturated flow and contaminant transport problems.", "Use a modeling software to model variably-saturated flow and contaminant transport.", "Interpret and visualize groundwater flow and contaminant transport model results and communicate findings effectively.", "Identify the concepts of groundwater and solute transport modeling and their real-world applications.", "Section 1.1 Derivation of Richards' Equation", "Section 1.2 Derivation of Richards 'Equation – Pressure Head Formulation", "Section 1.3 Three-Dimensional Groundwater Flow", "Derive and interpret three-dimensional groundwater flow dynamics and their mathematical representation.", "Section 1.4 Control Volume Finite Difference Discretization for Flow", "Section 1.5 A Rigorous Derivation of the Control Volume Finite Difference Discretization", "Develop, apply, and justify control volume finite difference discretization techniques for groundwater flow problems, demonstrating a rigorous understanding of mathematical principles.", "Assemble and implement saturated groundwater flow equations in numerical models using discretized formulations.", "Assemble the saturated groundwater flow equation using control volume discretization.", "Analyze groundwater flow material balance errors and their implications for numerical model accuracy.", "Section 1.8 Truncation Error Analysis", "Section 1.8 Truncation Error Analysis", "Section 1.9 Stability and Monotonicity", "Section 2.1 Derivation of the Contaminant Transport Equation", "Analyze the stability and monotonicity of numerical methods for groundwater flow models.", "Derive the contaminant transport equation and articulate its role in modeling solute movement through porous media.", "Section 2.1 Derivation of the Contaminant Transport Equation", "Section 2.2 Control Volume Finite Difference Discretization of the Contaminant Transport Equation", "Section 2.3 Central Spatial Weighting of Advective Flux", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Apply control volume finite difference discretization to the contaminant transport equation for numerical modeling.", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Section 2.4 Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.5 Upstream Spatial Weighting of Advective Flux", "Section 2.5.1 Truncation Error of Upstream Spatial Weighting", "Section 2.6 Crank-Nicolson Temporal Weighting with Upstream Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.7 Assembly of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.7.1 Monotonicity of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.8 Assembly of Fully-Implicit Temporal Weighting with Upstream Spatial Weighting", "Section 2.8.1 Monotonicity of Upstream Spatial Weighting with Fully-Implicit Temporal Weighting", "Section 2.9 Boundary Conditions for Transport Coupled to Flow", "Analyze the accuracy of various contaminant transport weighting schemes and their impact on numerical model performance.", "Apply boundary conditions for contaminant transport coupled with groundwater flow and assess material balance errors to ensure reliable numerical simulations.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "The total maximum bonus points that can be earned across all five assignments is five.", "Students can earn bonus points by actively participating in discussions or helping their peers understand the course material and assignments.", "Explaining a challenging concept to peers in a collaborative study session.", "A maximum of five contributions will be allowed per assignment."]}, {"course_id": 31, "course_code": "EARTH 458", "course_name": "EARTH458 - Physical Hydrogeology (0.50)", "term_name": "List 4", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Notice of Recording", "Field Methods in Hydrogeology Fall 2024", "08:30AM - 09:50AM DWE 3519", "An introduction to the principles and theories of mineral deposit genesis.", "Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered.", "View requirements for EARTH 458L", "Applied geophysics provides geoscientists with a wide-range of non-invasive methods for characterizing the Earth's interior.", "This course is an introduction to the physical principles underlying field acquisition, processing, and data interpretation for commonly used applied geophysical techniques (seismic, electrical, electromagnetic induction, gravity, and magnetic methods).", "This course is not only pertinent for geoscientists but also for engineers and others interested in learning how physics can be used to explore the Earth's interior or perform non-destructive testing.", "Near-surface geophysics is used to characterize the shallow subsurface for a wide-spectrum of applications.", "This application-oriented course covers current methodology in near-surface geophysics, including electrical, electromagnetic, ground penetrating radar, seismic refraction, and well-logging methods.", "Techniques for geophysical data acquisition and interpretation are studied and applied to field data.", "Examples of the application of geophysical techniques to archeological, forensics, geotechnical, glaciology, and hydrogeological problems are examined.", "View requirements for EARTH 461", "A field-oriented course on current methodology in the general area of geotechnical or engineering geophysics as applied to environmental problems.", "Typical topics covered: well logging and time domain electromagnetic surveys for groundwater supply; magnetic and terrain conductivity surveys for waste materials; ground penetrating radar applications to stratigraphy and contamination; streaming potential surveys of dam leakage.", "A pre-lab quiz must be completed before attending each field lab.", "Labs will be completed in groups with field data recorded in field books or datasheets.", "These data will be used to a complete individual lab assignment.", "This site contains over 100 groundwater monitoring wells.", "Field lab activities involve:", "(3) Measurement of in-situ hydraulic conductivity using single-well response tests", "Each lab will provide you with a unique dataset that you will use to develop a conceptual site model of the local groundwater flow system.", "• Properly construct and interpret soil core logs using United Soil Classification System, and make lithostratigraphic interpretations using geophysical logs", "• Assess and interpret water level measurements through the construction of water table maps and flownets", "• Interpret single-well response tests including falling and rising head (slug) tests to determine in-situ hydraulic conductivity", "• Interpret hydraulic pumping tests to determine aquifer transmissivity and storage parameters and assess water resource vulnerability", "Each module will contain a series of recorded lecture slides and video demonstrations reviewing core concepts and guidelines for the upcoming field lab.", "Please include “Earth 458L” in the subject line of all e-mail communications as well as your Full Name and Student ID# in the text of the email.", "Hydrogeological equipment to make measurements and collect data (temporary use)", "Specialized hydrogeological software to complete certain assignments", "Datasheet to record field data", "Other data should be recorded in your field books and distributed to your group members as needed.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Notice of Recording", "Participation in Field Labs:", "These quizzes are designed to keep you on schedule and prepare you for the in-person field lab and assigned activities.", "There will be a 48-hour grace period to finalize the submission of your assigned activities without incurring any late penalty."]}, {"course_id": 32, "course_code": "ENVE 335", "course_name": "ENVE335 - Decision Making for Environmental Engineers (0.50)", "term_name": "List 4", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Decision Making for Environmental Engineers Winter 2025", "10:00AM - 11:20AM DWE 3518", "08:30AM - 09:20AM", "DWE 3518", "Decision-making, optimization, and assessment of environmental and water resource systems, and the design process in environmental engineering.", "Multi-criteria decision-making methods for concept and embodiment engineering design phases.", "Risk-based system performance metrics and trend tests.", "Uncertainty estimation via First-Order Uncertainty Analysis and Monte Carlo Simulation.", "Formulation and solution of linear, integer, and nonlinear optimization models.", "Sensitivity analysis for decision-making and descriptive (numerical) models.", "Each discipline contributes distinct standards and focuses that enhance both the foundational and practical aspects of decision science.", "This course is specifically tailored to introduce environmental engineers to decision-making theories and methodologies pertinent to addressing environmental sustainability issues.", "Instead, we aim to equip students with critical knowledge and practical skills essential for making informed decisions that address sustainability challenges.", "Demonstrate an understanding of the complexities involved in decision-making processes for addressing environmental sustainability issues.", "Develop and apply a mathematical framework using systems thinking to articulate and analyze decision-making problems in environmental engineering.", "Acquire skills to solve decision-making problems using various methods, including decision trees, multi-criteria decision making, and both single and multi-objective optimization.", "Gain insights into recognizing and evaluating the uncertainties inherent in decision-making and will learn to apply stochastic optimization techniques in uncertain scenarios.", "Broaden their knowledge and interest in advanced decision science methodologies to tackle complex issues in environmental sustainability.", "Theory and Framework", "Course Introduction and Utility theory", "Systems thinking", "Engineering Design and decision trees", "Multi-criteria decision making", "Optimization", "Linear Optimization", "Mid-term and multi-objective optimization", "Simulation optimization", "Decision making under uncertainty", "Stochastic optimization", "Application of Multi-Criteria Decision Analysis in Environmental and Civil Engineering Textbook No 178.90"]}, {"course_id": 33, "course_code": "ENVE 573", "course_name": "ENVE573 - Contaminant Transport (0.50)", "term_name": "List 4", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["DWE 3518", "02:30PM - 03:20PM", "DWE 3518", "Types of contaminants; transport phenomena with a focus on advection-dispersive transport; development of governing equations; types and utility of boundary and initial conditions; and mass balance considerations.", "Review of completely mixed systems including lakes, streams, source functions, feedback systems, and toxic substance models.", "Model calibration, sensitivity, and uncertainty; methods and approaches.", "Solute transport models and solution techniques including random walk, method of characteristics, finite difference method and finite volume method.", "Introduction to mass removal technologies for remediation of soil and groundwater systems.", "One of the key responsibilities of the environmental engineering profession is to monitor, assess, and clean up environmental contamination in the soil, water, and air.", "Engineers are tasked to develop, implement, and design technology and best management practices to mitigate contamination, interpret uncertain environmental data to determine the source(s) and or fate of environmental contaminants, and make predictions about how past and future pollution may pose a health threat to humans and ecosystems.", "The objective of this course is to introduce you to theoretical and practical aspects of mass transport in natural environmental systems, and to learn how to model mass transport processes.", "describe various types of contaminants and their behaviour in a variety of media", "formulate and apply a mathematical mass transport model in response to an environmental problem statement (i.e., select appropriate ICs & BCs, recognize appropriate processes to include, and solve the problem using appropriate mathematical methods)", "explain the physics and mathematical treatment of key transport processes and be able to distinguish and prioritize their role in the transport and remediation of contaminants", "justify the use of assumptions used in contaminant transport models", "interpret observation data in conjunction with model results and critically evaluate model results subject to (often significant) uncertainty", "To satisfy the above outcomes, you will hone your programming skills, a necessary tool for solving the types of problems addressed in this course.", "Canadian Engineering Accreditation Board", "Piazza – Wiki-style Q&A; primary way to get & give text-based help in ENVE 573", "The first tutorial will be held in the second week of the term.", "Drop-in Hours", "Students are very welcome and encouraged to meet with the teaching team in scheduled drop-in hours.", "Water Balance in Completely Mixed Systems", "Suspended Solids Balance in Lakes", "Suspended Solids Balance in Lakes & Sediments", "Single-Species Irreversible Reactions", "Generalized Least-Squared Fitting", "Dissolved Phase Balance in Completely Mixed Systems", "Quantifying Multiphase Systems", "Multiphase Toxicant Balance in Lake & Sediments", "Additional Coupled Mixed Systems", "Advective Transport in Rivers & Streams", "BOD Transport in Rivers & Streams", "Dissolved Oxygen Transport in Rivers & Streams", "Dispersion", "Steady 1D Advection-Dispersion-Reaction Equation (ADRE)", "Dispersion in 2D & 3D", "3D & 2D Advective-Dispersive Transport with Boundary Conditions", "Calibration and Sensitivity", "Uncertainty Analysis", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "extenuating circumstance", "This course includes the independent development and practice of engineering specific skills.", "Campus Supports", "Library for research-based assignments"]}, {"course_id": 36, "course_code": "SYDE 532", "course_name": "SYDE532 - Introduction to Complex Systems (0.50)", "term_name": "List 4", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Notice of Recording", "Introduction to Complex Systems Winter 2025", "10:00AM - 10:50AM E5 6008", "Professor Paul Fieguth pfieguth@uwaterloo.ca Office Hours: Mondays 4-5pm in E7-6338", "The overwhelming majority of societal, ecological and climate issues of pressing importance are complex systems; nonlinear dynamic interacting systems poorly characterized by linear analyses and Gaussian statistics.", "This course introduces the mathematics needed to understand such interactions, including nonlinear dynamics, critical and bifurcation behaviours, large-scale systems and power-law distributions.", "The mathematical methods will be motivated by extensive examples and case studies such as global warming, energy shortages, desertification, overpopulation, poverty, and economic instability, to be investigated from a systems engineering perspective that will connect mathematical concepts to real-world examples.", "Understand the assumptions and limitations behind linear dynamic / Gaussian systems", "Understand the mathematical properties of nonlinear dynamic / power-law systems", "Be able to abstract / generalize the impacts and implications of nonlinear systems", "Be able to draw connections between macroscopic socio-environmental systems", "Mathematics and Modeling", "The Science of the Physical World", "3. Earth Monitoring and Inverse Systems", "An Introduction to Complex Systems (2nd ed) Springer Verlag, 2021 Yes $0", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 0, "course_code": "BME 411", "course_name": "BME411 - Optimization and Numerical Methods (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Optimization and Numerical Methods Fall 2024", "- Abbas Seifi, Professor   Email: aseifi@uwaterloo.ca", "Seyed Mohammad Amin Mirjalili Email:   smamirja@uwaterloo.ca", "Interpolation and curve fitting, root-finding methods, local and global optimization methods, constrained optimization, multiobjective and multidisciplinary design optimization for biomedical applications.", "This course introduces the applications of optimization modeling and numerical methods to biomedical engineering and engineering design.", "It provides an overview of the formulation and classification of optimization problems arising in biomedical engineering and types of suitable optimization methods.", "Graphical solution methods for two-variable problems and optimization techniques for single-variable problems like region elimination approaches, interpolation algorithms, and direct root methods are discussed.", "Linear Programming problem formulations and simplex and interior methods for solving these problems are discussed.", "Learn about different types of optimization problems in biomedical engineering and engineering design (GA: 1,4)", "2. Study types of optimizations methods and where they are applied, convexity, optimality criteria for unconstrained multivariable problems, and optimality conditions for constrained multivariable problems and proper software tools (GA: 1,2,5)", "Apply graphical solution method to solve two-variable optimization problems, and region elimination methods, interpolation methods, and direct root-finding methods to solve single-variable problems (GA: 1,2,5)", "Apply simplex and interior-point methods for solving Linear Programming problems (GA: 1,2,5)", "7. Apply constrained multivariable methods as well as multi-objective techniques to solve biomedical engineering and design optimization problems using Pareto optimality concept (GA: 3,4,5)", "Details and explanation of each attribute can be found at Graduate attributes | Engineering (uwaterloo.ca)", "Week 1 / LO: 1, 2 Sept. 5  Introduction to Optimization Course Overview; Classification of Optimization Problems & Applications", "Slides", "Week 2 / LO: 2 Sept. 10-12 Functions of a Single Variable Optimization Problem Statement; Basic Concepts & Examples; Graphical Solutions; Optimality Conditions", "Week 3 / LO: 4 Sept. 17-19 Optimization of Single Variable Functions", "Unimodal Functions", "Bracketing & Region Elimination Golden Section and Fibonacci methods; Interpolation method", "Assign.1", "Week 4 / LO: 4 Sept. 24-26 Gradient-Based  Root-Finding Methods Newton–Raphson, quasi-Newton Method; Bisection & Secant methods;", "Convexity & Positive Definiteness", "Week 9 / LO: 3,7 Oct. 29 -31 Constrained Multivariate Optimization Optimality Conditions for Convex Nonlinear Programs; Example of KKT Conditions and Solutions; Design Optimization in MATLAB", "Assign.3", "Week 10 / LO: 6 Nov. 5-7 Linear Programming & Duality Theory", "LP Formulation; Graphical Solution & Simplex method", "Duality& Economic Interpretation", "Week 11 / LO: 6 Nov. 12-14 Interior-Point Methods (IPM) Affine-Scaling Interior-point method; Examples; primal-dual interior-point algorithms", "Week 12 / LO: 6,7 Nov. 19-21 Multi-objective Optimization  Quadratic Programming & Applications; Pareto Optimality; e-Constrained Method", "Week 13 / LO: 1,3 Nov. 26- 28 Modern Global Optimization and Applications Genetic Algorithm and Examples; Applications in Design Optimization", "Introduction to Optimum Design, Elsevier Inc., 4th Edition, J. S. Arora, 2016 No", "Optimization Concepts and Applications in Engineering, Cambridge University Press, 2nd Edition, A. D. Belegundu, T. R. Chandrupatla, 2011 No", "The midterm exam will be taken in person and closed book.", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 1, "course_code": "CHE 521", "course_name": "CHE521 - Process Optimization (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Process Optimization Fall 2024", "Email: pulsipher@uwaterloo.ca", "An introduction to chemical process optimization.", "Model development and classification of optimization problems.", "Linear programming techniques, simplex algorithm, goal programming and barrier method, parametric sensitivity analysis and duality theory.", "Convex optimization, necessary and sufficient conditions for optimality for unconstrained and constrained problems.", "Applications include optimization of heat exchanger networks, multistage separation processes, batch operations, process scheduling and chemical reactor networks.", "View requirements for CHE 521", "Formulate well-posed optimization models given a problem statement [", "Classify optimization problems based on the optimization modelling features [", "Formulate and solve linear programming (LP) problems using conventional linear optimization techniques such as graphical and simplex methods [", "Understand the basic concepts in duality theory for linear and nonlinear programming (NLP)", "Understand the importance of convexity in optimization and classify the convexity of simple feasible regions [", "Derive and understand optimality conditions for LPs and NLPs", "Understand the basic concepts behind barrier methods to solve linear and nonlinear programs [", "Formulate and solve simple convex mixed-integer programming (MIP) problems using conventional algorithms, e.g., branch-and-bound [", "Formulate simple trajectory (e.g., ODE-constrained) optimization problems [", "Use optimization software to solve LP, NLP, MIP, and trajectory optimization problems that emerge in chemical engineering applications [", "Introduction to Process Optimization", "Optimization in chemical engineering", "Classification of optimization problems", "Development of well-posed optimization models", "Linear Programming", "Standard form and modelling", "Graphical method", "Duality theory & sensitivity analysis", "Optimality Conditions and Characterization", "Necessary and sufficient conditions for optimality", "Nonlinear Programming", "Standard form and modelling", "Duality theory", "Mixed-Integer Programming", "Introduction to convex mixed-integer optimization", "Branch-and-bound method", "Trajectory Optimization", "Modelling ODE-constrained optimization problems (e.g., optimal control)", "Direct transcription approach", "iClicker Account Free of charge for the 2024/2025 school year Yes", "Grossmann, I., Advanced Optimization for Process Systems Engineering, Cambridge: Cambridge University Press, 2021 Suggested Reference No", "Winston, W., Operations Research: Applications and Algorithms, Thomson, Fourth Edition, 2004 Suggested Reference No", "iClicker Account", "APMonitor design optimization course", "Julia-centric optimization textbook", "Introduction to optimization course notes (note that the code snippets are out-of-date)", "Optimization education resource list", "During each class live polling questions administered via iClicker will be integrated into the lecture material.", "Exams", "This course includes the independent development and practice of specific skills for modelling and solving mathematical programming problems.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 2, "course_code": "CIVE 332", "course_name": "CIVE332 - Civil Systems and Project Management (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Civil Systems and Project Management Winter 2025", "10:00AM - 11:20AM MC 2066", "INSTRUCTOR:    Muhammad Bilal, E2-3328 m25bilal@uwaterloo.ca", "E2-3328", "E2-3321", "Introduction to conceptual planning, construction, management, optimization, and life-cycle performance assessment of civil engineering systems including capital projects.", "Fundamentals of decision theory including concepts of risk, uncertainty, utility, probability, value of information, and game theory.", "Tools for supporting decision-making process, including linear and integer programming, network models, optimization, and Monte Carlo simulation.", "Risk- and cost-benefit analysis of public projects and their impact on sustainability, and quality of life.", "Design, model and analyze some civil engineering systems and understand their complexity;", "Choose and effectively apply tools and methods to improve civil engineering systems performance;", "Apply fundamentals of decision analysis, utility and game theory to assess and quantify risk, uncertainty, and expected utility used in decision-support systems;", "Demonstrate the use of project management tools and methods to applications in planning, scheduling, and estimating on engineering projects; and", "Mathematically and numerically formulate, structure and solve optimization problems (single/multiple/linear/integer/non-linear) using multi-criteria decision-making methods, including assessing sensitivity of decisions.", "PART 1 – Systems Theory: Design Methodology", "PART 1 – Systems Theory: Complex Systems + Review", "Linear Programming Intro", "PART 4 – Optimization: Linear Programming", "Multi-objective programming", "Linear programming models of network flow", "Linear programming models of network flow", "Integer and Mixed Integer Programming"]}, {"course_id": 3, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 4, "course_code": "ENVE 335", "course_name": "ENVE335 - Decision Making for Environmental Engineers (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Decision Making for Environmental Engineers Winter 2025", "10:00AM - 11:20AM DWE 3518", "08:30AM - 09:20AM", "DWE 3518", "Decision-making, optimization, and assessment of environmental and water resource systems, and the design process in environmental engineering.", "Multi-criteria decision-making methods for concept and embodiment engineering design phases.", "Risk-based system performance metrics and trend tests.", "Uncertainty estimation via First-Order Uncertainty Analysis and Monte Carlo Simulation.", "Formulation and solution of linear, integer, and nonlinear optimization models.", "Sensitivity analysis for decision-making and descriptive (numerical) models.", "Each discipline contributes distinct standards and focuses that enhance both the foundational and practical aspects of decision science.", "This course is specifically tailored to introduce environmental engineers to decision-making theories and methodologies pertinent to addressing environmental sustainability issues.", "Instead, we aim to equip students with critical knowledge and practical skills essential for making informed decisions that address sustainability challenges.", "Demonstrate an understanding of the complexities involved in decision-making processes for addressing environmental sustainability issues.", "Develop and apply a mathematical framework using systems thinking to articulate and analyze decision-making problems in environmental engineering.", "Acquire skills to solve decision-making problems using various methods, including decision trees, multi-criteria decision making, and both single and multi-objective optimization.", "Gain insights into recognizing and evaluating the uncertainties inherent in decision-making and will learn to apply stochastic optimization techniques in uncertain scenarios.", "Broaden their knowledge and interest in advanced decision science methodologies to tackle complex issues in environmental sustainability.", "Theory and Framework", "Course Introduction and Utility theory", "Systems thinking", "Engineering Design and decision trees", "Multi-criteria decision making", "Optimization", "Linear Optimization", "Mid-term and multi-objective optimization", "Simulation optimization", "Decision making under uncertainty", "Stochastic optimization", "Application of Multi-Criteria Decision Analysis in Environmental and Civil Engineering Textbook No 178.90"]}, {"course_id": 5, "course_code": "MSE 331", "course_name": "MSE331 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Introduction to Optimization Winter 2025", "08:30AM - 09:20AM", "RCH 301", "Email: fgzara@uwaterloo.ca", "This first course in optimization uses a quantitative approach to problem solving involving, mathematical modelling and formulations, solution methods, and output analysis.", "Students are introduced to a variety of practical problem formulations in management and engineering, a number of solution methods, including, but not limited to, linear optimization, network models, project management, and decision analysis.", "View requirements for MSE 331", "Identify real-world problems that may be solved using optimization methods", "Formulate linear, integer, and network optimization models", "Solve linear programming problems using the simplex method", "Formulate and interpret the dual of a linear program", "Analyzer the sensitivity of an optimal solution of a linear program to changes in its parameters", "Introduction to the course", "Introduction to mathematical modelling", "Jan 14-16 Modelling using LP & Mixed Integer Programming (MIP) Solution using Excel solver A1 posted", "Jan 21-23 Modelling using LP & Mixed Integer Programming (MIP) Solution using Gurobi/Cplex A1 due", "Solution Methods for Linear Programming More solver practice A2 posted", "Solution Methods for Linear Programming", "Sensitivity Analysis in LP", "Solution methods practice", "A4 posted", "Mar 11-13 Solution Methods for MIP: the branch-and-bound method   A4 due", "Branch-and-Bound - the General case", "Network flow models", "Mar 25-27 Network flow models  Network flow models A5 due", "Introduction to Operations Research, Frederick S. Hillier, McGraw-Hill Higher Education, 11th Edition, 2021."]}, {"course_id": 6, "course_code": "SYDE 411", "course_name": "SYDE411 - Optimization and Numerical Methods (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Optimization and Numerical Methods Fall 2024", "08:30AM - 09:50AM E7 4433", "- Abbas Seifi, Professor   Email: aseifi@uwaterloo.ca", "Advanced methods for systems of linear equations.", "Linear programming, simplex and interior-point methods.", "Local and global optimization methods.", "This course introduces the applications of optimization modeling and numerical methods to various engineering optimization problems.", "It provides an overview of the formulation and classification of optimization problems arising in engineering and types of suitable optimization methods.", "Graphical solution methods for two-variable problems and optimization techniques for single-variable problems like region elimination approaches, interpolation algorithms, and direct root-finding methods are discussed.", "Linear Programming problem formulations and simplex and interior-point methods for solving such problems are discussed.", "Learn about different types of optimization problems in engineering design (GA: 1,4)", "2. Study types of optimizations methods and where they are applied, convexity, optimality criteria for unconstrained multivariable problems, and optimality conditions for constrained multivariable problems and proper software tools (GA: 1,2,5)", "Apply graphical solution method to solve two-variable optimization problems, and region elimination methods, interpolation methods, and direct root-finding methods to solve single-variable problems (GA: 1,2,5)", "Apply simplex and interior-point methods for solving Linear Programming problems (GA: 1,2,5)", "7. Apply constrained multivariable methods as well as multi-objective techniques to solve design optimization problems using Pareto optimality concept(GA: 3,4,5)", "Details and explanation of each attribute can be found at Graduate attributes | Engineering (uwaterloo.ca)", "Week 1 / LO: 1,2 Sept. 5  Introduction to Optimization", "Classification of Optimization Problems & Applications", "Slides", "Week 12 / LO: 6,7 Sept. 10-12 Functions of a Single Variable Optimization Problem Statement; Basic Concepts & Examples; Graphical Solutions; Optimality Conditions", "Week 3 / LO: 4 Sept. 17-19 Optimization of Single Variable Functions", "Unimodal Functions", "Bracketing & Region Elimination Golden Section and Fibonacci methods; Interpolation method", "Assign.1", "Week 4 / LO: 4 Sept. 24-26 Gradient-Based  Root-Finding Methods Newton–Raphson, quasi-Newton Method; Bisection & Secant methods;", "Convexity & Positive Definiteness", "Week 9 / LO: 3,7 Oct. 29 -31 Constrained Multivariate Optimization Optimality Conditions for Convex Nonlinear Programs; Example of KKT Conditions and Solutions; Design Optimization in MATLAB", "Assign.3", "Week 10 / LO: 6 Nov. 5-7 Linear Programming & Duality Theory", "LP Formulation; Graphical Solution & Simplex method", "Duality& Economic Interpretation", "Week 11 / LO: 6 Nov. 12-14 Interior-Point Methods (IPM) Affine-Scaling Interior-point method; Examples; primal-dual interior-point algorithms", "Week 12 / LO: 6,7 Nov. 19-21 Multi-objective Optimization  Quadratic Programming & Applications; Pareto Optimality; epsilon-Constrained Method", "Week 13 / LO: 1,3 Nov. 26- 28 Modern Global Optimization and Applications Genetic Algorithm and Examples; Applications in Design Optimization", "Introduction to Optimum Design, Elsevier Inc., 4th Edition, J. S. Arora, 2016 No", "Optimization Concepts and Applications in Engineering, Cambridge University Press, 2nd Edition, A. D. Belegundu, T. R. Chandrupatla, 2011 No", "The midterm exam will be taken in person and closed book.", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 7, "course_code": "CIVE 343", "course_name": "CIVE343 - Traffic Simulation Modelling and Applications (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Traffic Simulation Modelling and Applications Fall 2024", "RCH 306", "Email: reza.aminghafouri@uwaterloo.ca", "Calibration and validation of simulation models, and interpretation and analysis of simulation output.", "Applications of state-of-the-art computer simulation software packages for solving real traffic engineering problems, involving scenario analysis, prediction, and optimization.", "This is an introductory course to traffic engineering, traffic simulation and the processes and tools used to model transportation systems.", "It covers a variety of topics related to simulation modelling of a traffic system and its applications, such as the collection and use of field data, application of statistics to data analysis, alternative traffic modelling techniques such as traffic stream theory, queueing theory, gap acceptance, and car-following and lane-changing models.", "Learn various field data collection technologies and data analysis techniques to support traffic engineering studies.", "1.1", "Introduction", "Traffic engineering", "Model and simulation", "Assignment #1: Data Collection and Analysis", "2.1", "2.2", "Dynamic and stochastic nature of traffic", "Data Analysis", "3.2", "Miovision Smart City and Advanced Traffic Monitoring Solutions", "4.1", "4.2", "4. Traffic Analysis – Macroscopic Models", "Types of traffic models", "Traffic stream models", "Queueing models", "Shockwave theory", "Assignment #2: Simulation Modelling and Analysis", "Simulation modelling", "Simulation runs", "Analysis of simulation results", "- Gap acceptance behaviour and model", "- Lane changing models", "7.1", "7.2", "Modelling lane changing behaviour", "Car following models", "8.1", "Modelling Routing Behaviour", "Trip Generation and Routing", "Connected Vehicles and Applications", "9.2", "9.4", "Signalised Intersections", "Signal controllers, types of signalised intersections", "Theoretical method – signal timing", "Simulation of signalised intersections", "Assignment #5: Network Traffic Analysis", "Modelling of vehicle emissions", "Adaptive signal control", "AI models for traffic control"]}, {"course_id": 8, "course_code": "ECON 371", "course_name": "ECON371 - Business Finance 1 (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["ECON 371", "ECON 371 001", "Office hours will be both in person and through MS Teams on a first-come-first-serve basis.", "Email: prajsic@uwaterloo.ca", "“ECON 371” must appear in the subject line and the message must include your full name and student ID number.", "The course develops both the conceptual framework and the tools required for these decisions.", "View requirements for ECON 371", "It describes major players and types of financial instruments in financial markets, and it offers the general framework of financial landscape.", "This course will describe the basics of how firms and individuals make investment decisions and how they finance their investments.", "The goal is to understand financial markets and investment strategies.", "The understanding of the most important financial problems leads to strategic planning and analytical understanding of possible solutions.", "Today’s financial decisions are critical for the successes of the businesses in the future.", "This course will help students develop skills applicable to financial decision-making processes within businesses as well as in their personal lives.", "understand the need for firms and individuals to make financial decisions and together work towards overcoming the universal problem of scarcity;", "appreciate the relevance of finance in a changing world;", "Explain why maximizing market value is the logical financial goal of the corporation", "Calculate and interpret some key measures of firm performance", "Interpret price-earnings ratios", "Calculate present and future values of streams of cash payments", "Define and understand the fundamental features and elements of stocks and bonds", "Use financial models to evaluate stocks and bonds", "Interpret the relationships between financial markets and information", "Perform interest rate conversions from APR to effective rates and vice versa", "Develop loan amortization schedules using loan terms", "Explain what a yield curve is and why short-term interest rates affect its shape", "Identify the cash flows properly attributable to a proposed new project", "Use sensitivity, scenario, and break-even analysis to evaluate the financial impact of forecasting errors", "Introduction to Business Finance:", "Corporate Finance and the Financial Manager", "Corporate Finance and the Financial Manager", "Introduction to Business Finance:", "Financial Statement Analysis", "Introduction to Business Finance:", "Financial Statement Analysis", "The Valuation Principle: The Foundation of Financial decision Making", "The Valuation Principle: The Foundation of Financial decision Making", "Bonds", "Bonds", "Fundamentals of Capital Budgeting", "Fundamentals of Capital Budgeting", "In that case, the quiz will be a mix of questions from all the chapters we covered so far.", "I will set constant weights for each student of 25% for the first midterm and 30% for the second midterm in Learn, but I will be adjusting those weights individually in my Excel sheet when calculating final grades at the end of the semester.", "The purpose of the review quizzes is to help students identify and understand key concepts covered in the lectures and in the textbook.", "Under the Training & Support tab, you will find helpful information including technical support.", "Midterms and Final Exam", "The format for midterms and the final exam will be a mix of multiple-choice questions, numerical calculation questions, and written problems.", "Missing a Midterm Due to Self-Isolation", "Please carefully read the Economics Department policy on deferred final exams for instructions.", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "Economics Department Deferred Final Exam Policy", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 9, "course_code": "HRM 200", "course_name": "HRM200 - Basic Human Resources Management (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Reviews the role of human resources administration in organizations and the manner in which human resources executives contribute to the well-being of a total enterprise.", "For students who are pursuing the Certified Human Resources Professional (CHRP) certification, this is a core course.", "HR policies and practices significantly impact the bottom line and an organization’s overall performance.", "The course will examine the evolution of HR from a primarily administrative function to a strategic partner and decision maker in the organization.", "Increase your understanding and appreciation of the Human Resources function and its role in an organization.", "Identify Human Resource issues facing organizations and line managers through textbook examples and real-life experiences of the instructor and develop insights on what it is like to work in the Human Resource profession.", "Readings", "Module 2: HR Technology and Designing and Analyzing Jobs Chapter 3", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Reference", "There are two written Case Applications in HRM 200 and I want to make it very clear that these written assignments are to be your own original work which means that:", "This course includes the independent development and practice of specific skills, such as Communication, Listening, Conflict Resolution, Cultural Awareness & Sensitivity, Decision Making, Employee Relations and Employment Law & Legislation.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 10, "course_code": "MSE 311", "course_name": "MSE311 - Organizational Design and Technology (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Notice of Recording", "Organizational Design and Technology Winter 2025", "MSE 311", "The instructor Kenneth McKay can be reached via email kmckay@uwaterloo.", "The focus of this course is on the procedures and variables involved in the design and redesign of organizations.", "View requirements for MSE 311", "understand underlying concepts and models which help to explain the impact of technology on organizational design decisions and how these choices can impact organizational performance, short and long term", "understand organizational design in practice", "apply organizational design concepts to student situations", "understand organizational design in the current context", "Knowledge base (D) - 1d - demonstrate understanding of specialized knowledge needed to understand and design organizational structures", "Design (D) - 4a - follow an engineering design methodogy suitable for designing organizational structures", "Use of engineering tools (D) - 5a, 5b, 5c - select, modify, use suitable tools and models for designing organizational structures", "Ethics and equity (D) - 10a - identify ethical and unethical behaviour in the organizational design and use of technology such as AI", "Overview and introduction", "Organizational evolution and design dimensions", "Drivers, criteria for design decisions", "Design constraints and limitations", "Governance and oversight", "Start-ups, small organizations", "Risk management considerations", "The major concepts outlined below illustrate the strategy being used and it is expected that the final assessment scheme will be close to the descriptions below.", "The requirements and process for self-assessment will be shared in the first week.", "The specific AI usage guidelines and requirements will be shared in the first week.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 11, "course_code": "MSE 332", "course_name": "MSE332 - Fundamentals of Optimization (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Fundamentals of Optimization Fall 2024", "E-mail:    sghadimi@uwaterloo.ca", "This course focuses on solution methods in linear, integer, and nonlinear optimization.", "Topics include the theory and algorithms of linear optimization, branch-and-bound, network algorithms, convexity, and optimality conditions.", "View requirements for MSE 332", "This course builds on the material covered in MSE 331 Introduction to Optimization.", "It covers advanced topics in deterministic optimization with application to Management Engineering decision problems.", "The goal of the course is to develop the ability to formulate fairly complex decision problems, and to design solutions using advanced methods.", "The main topics are advanced linear and integer optimization, dynamic programming, heuristics and metaheuristics, and nonlinear optimization.", "Recognize the major capabilities and limitations of deterministic optimization models and methods as applied to Management Engineering decision problems (Knowledge Base).", "2. Formulate deterministic optimization models: objectives, decisions and constraints (Problem Analysis).", "3. Describe the theory behind available solution methods and apply exact and heuristic algorithms (Design).", "4. Describe a problem related to deterministic optimization by placing it in its general context and framework (Problem Analysis).", "6. Develop an exact or heuristic solution methodology to solve a model (Design).", "The list of all graduate attributes expected by the Canadian Engineering Accreditation Board (CEAB), can be found here.", "Introduction & Review of Linear Algebra", "Theory of Linear Programming (LP)", "Revised Simplex Method", "LP Duality and Dual Simplex Method", "Sensitivity Analysis and Goal programming", "I: Introduction  & Modeling", "NLP II: Unconstrained Optimization", "NLP III: Constrained Optimization", "Dynamic Programming I", "Dynamic Programming II", "Introduction to Game Theory", "Introduction to Operations Research (9th Edition) F.S.", "Operations Research: Applications and Algorithms (4th Edition) Wayne L. Winston, ISBN-10: 0534380581 No", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 13, "course_code": "MSE 431", "course_name": "MSE431 - Stochastic Models and Methods (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Stochastic Models and Methods Winter 2025", "MSE 431", "S. Erenay", "TAs    Atahan Bayir", "Introduction to operations research models and methods for problems with random, stochastic, and probabilistic components.", "Applications include the design, modelling, and analysis of service and manufacturing systems, with emphasis on important functions such as queueing, inventory, reliability, equipment replacement, and maintenance.", "View requirements for MSE 431", "Understand/use the key elements of probability theory and simple stochastic models [", "Critique and propose areas of improvement for Markov chain models by addressing weak points and unrealistic issues.", "Develop and use probabilistic models to analyze and address the needs of real-life systems.", "Basic Concepts of Queuing Theory (week11-12) (new topics)", "You will be given around 30-50 minutes to complete each quiz.", "You will be given a problem definition and asked to apply an advanced stochastic modeling approach to address the problem.", "You are expected to a) model the problem as a stochastic process, b) solve the corresponding problem, and c) gain insights from the solutions and discuss how these insights can be used for more educated decision-making.", "If necessary, a softcopy can be sent to the instructor’s email address before the deadline and a hard copy can be submitted the next day to catch the deadline.", "Illness During the Term", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 14, "course_code": "MSE 432", "course_name": "MSE432 - Production and Service Operations Management (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Production and Service Operations Management Winter 2025", "Introduction to management, planning, and control decisions in manufacturing and service settings using quantitative approaches.", "Students are exposed to a number of examples and case studies, and work on a project that involves analysis and discussion of improved designs.", "Develop understanding of the impact of services and production operations in organizations [PA]", "Employ decision-making tools used by operations managers [", "Impact]", "Introduction to OM and Demand Forecasting (I)", "Demand Forecasting (II) and Product Design", "Capacity Planning and Process Design/Facility Layout", "Chapters 11", "Aggregate Operation Planning", "Just-in-Time Production and Project Management", "Demand Forecasting", "Capacity Planning and Process Design/Facility Layout", "Aggregate Operations Planning", "JIT & Project Management"]}, {"course_id": 15, "course_code": "MSE 433", "course_name": "MSE433 - Applications of Management Engineering (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Applications of Management Engineering Winter 2025", "Email: fgzara@uwaterloo.ca", "This course exposes students to a variety of application areas in management engineering and introduces to them the challenges inherent in implementing new management engineering systems.", "View requirements for MSE 433", "Analyze data from an existing or proposed system and know which Management Engineering tools would be appropriate for analysis", "Create and evaluate an appropriate Management Engineering model", "Analyze and interpret the model results", "Communicate the model and analysis results in written and verbal formats", "Introduction to MSCI 433", "Descriptive Analytics: Data Visualization", "Data visualization in R Form project teams", "Application 1: Analytics for kidney allocation Optimization solver", "Sortation systems", "Analytics models"]}, {"course_id": 16, "course_code": "MSE 435", "course_name": "MSE435 - Advanced Optimization Techniques (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Advanced Optimization Techniques Winter 2025", "View requirements for MSE 435", "It covers techniques in Applied and Advanced Optimization that can solve real‐life practical problems.", "the formulation of various practical problems and their solution.", "the design of solution algorithms and their computer implementation.", "understand and apply some of the well‐known optimization techniques and gain hands‐on experience of their implementation to solve practical problems.", "be aware of the usefulness and limitation of optimization and build a framework through which further optimization applications can be conducted.", "3   21 Modelling with MIP   23 Solution methods for MIP: branch-and-bound"]}, {"course_id": 17, "course_code": "MSE 442", "course_name": "MSE442 - Impact of Information Systems on Organizations and Society (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Notice of Recording", "Impact of Information Systems on Organizations and Society Winter 2025", "MSE 442", "This course is designed to familiarize the student with issues related to the impact of computer-based technologies on individual jobs, organizations, and broader societal level.", "View requirements for MSE 442", "Identify the role(s) of information technology in society in a number of different fields.", "Identify and explain the advantages and drawbacks of a particular information technology case in society.", "Synthesize ‘for’ and ‘against’ cases and highlight the strengths and weaknesses of these beliefs.", "Present well-constructed arguments using sound knowledge and evidence supporting the case.", "Describe the impact of information technology in society with reference to potential future occupations.", "The survey can be accessed with the following link: https://www.surveymonkey.com/r/HMGHBKF", "Each team will create 5 questions for the opposing team and post these by Wednesday at noon of the debate week.", "A maximum of 100 words is allowed for each question.", "A maximum of 200 words is allowed for the response to each question received.", "Do the questions effectively challenge the opposing team?", "Do the answers to the questions received reflect good understanding of the case that the team is presenting?", "Are the arguments presented in the answers well constructed and is the evidence presented relevant and convincing?", "Inclusion of the main issues in the public debate on the topic", "Each review should be a maximum of 1000 words.", "Each review should be a maximum of 1000 words.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 19, "course_code": "MSE 454", "course_name": "MSE454 - Technical Entrepreneurship (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Notice of Recording", "MSE 454", "MSE 454 001", "MSE 454:", "Technical entrepreneurship is examined considering the role of independent business, entrepreneurial behaviour, types of business and enterprises, business structure, sources of venture concepts and capital, company operation and control, and business start up.", "View requirements for MSE 454", "Formulate an initial business pitch including a concise description of the concept and potential market and/or consumer.", "Analyze the value proposition, market, and particular product characteristics.", "Design the characteristics of a product using the technology adoption life cycle.", "Week 6: Your Business Model", "Assignment Due: Your Introduction Strategy - The Sales OR Innovative Change Roadmap (20 marks)", "Your Business Model – the Business Model Canvas 20", "Your Introduction Strategy – The Sales OR Innovative Change Roadmap 20", "A passing grade for your group does not necessarily result in a passing grade for each group member.", "Notice of Recording"]}, {"course_id": 21, "course_code": "MSE 541", "course_name": "MSE541 - Search Engines (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["09:00AM - 09:50AM CPH 3681", "Topics include design and construction of retrieval systems, retrieval models, and evaluation of search engines.", "Search engines and recommendation systems are prevalent in society.", "Recommendation systems are a variant of search engines and are often found in shopping and media sites, e.g. Amazon, TikTok, Spotify, YouTube, and Netflix.", "The methodology for optimization and evaluation, as covered in the course, is applicable to both classical and the most modern of retrieval methods.", "The majority of the homework assignments require software design and implementation based on high level requirements and algorithms.", "The programming assignments are cumulative and require working software from the previous assignment to make the subsequent assignment also work.", "Course prerequisites are MSE 240 (Algorithms and Data Structures) and MSE 251 or MSCI 252 (Probability and Statistics for Engineers) but as a 500 level course, students need to be comfortable with less structure and higher expectations for self-regulated learning.", "Past experience has shown that students who are weak in their information systems skills, in particular computer programming, have significant difficulty with course expectations.", "In other words, your average in your introduction to programming and algorithms and data structures courses should be 80 or higher, and you should enjoy the process of computer programming.", "Identify, explain, and implement the key components of a search engine.", "Explain the advantages and disadvantages of in-situ, online, and offline evaluation methods.", "Make and justify decisions based on the outcome of experiments using statistics.", "Design and implement a search engine and evaluation framework.", "Design and conduct an experiment to test a proposed system change.[Des]", "Evaluation", "Retrieval Models", "Plagiarism software and alternatives: Plagiarism detection software will be used to screen assignments in this course.", "UW-Learn and Campuswire", "Please feel free to email the instructor and request an appointment.", "Failure to follow these classroom rules will result in a 3 stage escalation process:", "Do not contact the instructor by phone except in the case of emergency.", "Do not “drop in for a quick question”.", "No material may be copied from any source except when you must copy something as part of your answer, and in these cases, you must quote the copied material and cite the source.", "As much as possible, discussions of computer programs should be at the level of pseudo-code and not at the level of real computer code.", "Working in groups can be a great way to learn material better and faster.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 23, "course_code": "MSE 546", "course_name": "MSE546 - Advanced Machine Learning (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Advanced Machine Learning Winter 2025", "The course first reviews supervised and unsupervised learning methods, and then dives deeper into their assumptions, mathematical models, and underlying algorithms to help students systematically develop and enhance ML processes.", "View requirements for MSE 546", "Recognize and develop the mathematical background necessary to formulate and analyze advanced machine learning models", "Contrast supervised and unsupervised machine learning models, and examine common models that fall into these categories.", "Analyze learning models based on performance metrics", "Design and develop machine learning models (including neural network-based models) for a real-world learning task", "Understand and critique the limitations of contemporary machine learning models", "Introduction Course Logistics", "Math Background ML intro and Probability, Statistics and Information Theory", "Math Background Linear Algebra and Optimization in ML", "Supervised Deep Learning Deep Neural Networks for Tabular Data", "Supervised Deep Learning Deep Neural Networks for Images", "Supervised Deep Learning Deep Neural Networks for Sequences", "ML Training Considerations Training and Evaluating ML Models", "Non-Parametric Methods k-Nearest Neighbor", "Non-Parametric Methods Decision Trees", "Non-Parametric Methods Ensemble Methods", "Advanced Topics Real-world non-idealities: Dealing with limited data, bias, and fairness", "Advanced Topics Bandit models and Reinforcement Learning", "PiML1] Available for free under CC-BY-NC-ND license at https://probml.github.io/pml-book/book1.html Yes 0", "There may be a slight change in these dates as the course progresses.", "This flexibility allows us to create a balanced and productive environment for everyone involved.", "Each member needs to make a separate submission, where information on collaboration is clearly stated.", "They can be reached during their oﬃce hours in addition to requests on course communication platforms.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 24, "course_code": "MSE 551", "course_name": "MSE551 - Quality Management and Control (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Notice of Recording", "S. Dimitrov", "09:00AM - 09:50AM CPH 3681", "yekta.amirkhalili@uwaterloo.ca", "Yekta Amirkhalili  yekta.amirkhalili@uwaterloo.ca", "Accurately summarize the parts of a quality management system", "Assess a system for quality improvement opportunities", "Create a quality management system for a process", "Evaluate a quality management system for a process", "Apply documentation, and analytical techniques related to quality", "Last 1/2 to 2/3 of the course we cover up to 4 cases designed by the Waterloo Cases in Design Engineering.", "We will be using case studies prepared with the help of the Waterloo Cases in Design Engineering team.", "In each of the case studies you will be solving a quality problem or designing a quality management system.", "Case studies have been shown to help students develop skills in problem solving, using qualitative and quantitative methods problem solving, dealing with complex situations and dealing with ambiguities.", "We will discuss more about the exact format for our case study discussion and the case study reports as the term moves forward.", "My goal to make the case study portion of our course a fun and exciting way to learn and apply quality engineering concepts.", "Introduction to Statistical Quality Control, (8th edition).", "Notice of Recording", "Email Correspondence", "In the case the question is deemed of interest to multiple individuals.", "As a reminder of this honor code, you will be asked for every homework assignment to aﬃrm the following statement “I have neither given nor received aid on this homework assignment, nor have I concealed a violation of the Honor Code.”", "In‐person Lectures Except in Case of Medical Need", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 25, "course_code": "MSE 555", "course_name": "MSE555 - Scheduling: Theory and Practice (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["11:30AM -", "Students will be introduced to the theoretical background in these areas, but the emphasis will be placed on modelling and solving scheduling problems in practice.", "Students will apply these concepts in design activities in assignments and a course project.", "In this course, we look at practical scheduling problems, solution techniques, and algorithms in both manufacturing and service industries.", "We apply our knowledge to investigate one case study concerning real world scheduling problems and learn from one guest speaker who discusses interesting scheduling challenges and opportunities.", "Modeling and solving scheduling problems", "Analyzing scheduling related data and deriving insights into the problem", "Understanding the main challenges in real world scheduling problems", "Submit", "Introduction", "Administration", "Introduction: Scheduling Problems", "4.4", "4.4", "Dispatch Rules and Shifting Bottleneck", "Solution Techniques", "Introduction to Service Scheduling", "Workforce Scheduling", "Queueing & Scheduling", "Queueing & Scheduling (continue …)", "Queueing & Scheduling (continue …)", "TBA", "“Planning and Scheduling in Manufacturing and Services,” Michael L. Pinedo (Springer).", "Total"]}, {"course_id": 30, "course_code": "AE 392", "course_name": "AE392 - Economics and Life Cycle Cost Analysis (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Economics and Life Cycle Cost Analysis Winter 2025", "AE 392", "09:30AM - 10:50AM ARC 1101", "Email:    bruce.hellinga@uwaterloo.ca", "Sorour Yekeh", "Project financing, life-cycle cost analysis, time value of money, sensitivity analyses, tax, financial implications of infrastructure projects, quantitative decision-making, financial aspects of a business plan.", "View requirements for AE 392", "Appraise and compare the financial implications of potential infrastructure projects", "Judge the attractiveness of public sector infrastructure projects and monetize non-monetary costs and benefits if necessary", "Construct a cash flow diagram to summarize the timing and magnitude of cash flows over time Determine and compare the present worth, future worth, annual worth, internal rate of return, payback period, and benefit-cost ratio of alternative projects", "Implement sensitivity analysis to consider uncertainty in decision making", "Introduction & Engineering Decision Making", "2. Time Value of Money & Depreciation", "3. Cash Flow Analysis", "6. Financial Accounting and Business Plans", "Inflation", "Public Sector Decision Making", "This course includes the independent development and practice of specific skills, such as engineering economic evaluation and decision making.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 31, "course_code": "BME 364", "course_name": "BME364 - Engineering Biomedical Economics (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Notice of Recording", "Engineering Biomedical Economics Fall 2024", "09:30AM - 10:20AM E5 6006", "10:30AM - 12:20PM", "08:30AM - 09:20AM", "This course examines key economic issues in health care and biomedical industries.", "Topics include the market for medical care, health insurance, various models of healthcare delivery and competition and the role of government in policy, financing and delivery of health care.", "This course will train students to use economic analysis to model and understand the complex interactions between health care delivery, insurance markets, health innovators, governments, and firms.", "Articulate differences between healthcare systems and how incentives affect the system economics.", "Articulate differences between healthcare systems and how incentives affect the system economics.", "Investigate a research topic in the area of health economics.", "Apply cost-benefit analysis to aid in healthcare decision making.", "A knowledge base for engineering:   Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the biomedical engineering program.", "2. Problem analysis:  An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "Investigation:  An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "4. Design:  An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, and economic, environmental, cultural and societal considerations.", "7. Communication skills:  An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Professionalism:   An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Such ability includes an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society, the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Life-long learning:  An ability to identify and to address their own educational needs in a changing world in ways sufficient to maintain their competence and to allow them to contribute to the advancement of knowledge.", "The Labor Market for Physicians", "7. Demand for Insurance", "Adverse Selection in Real Markets", "Pharmaceuticals and the Economics of Innovation", "The Economics of Health Externalities", "*", "The Contribution and Effects of the Country’s Healthсare Sector on its GDP", "Healthcare as a Basic Human Right: The Pros and Cons of Providing Free Healthcare", "A Look at the Feasibility of a Universal Health Care System", "Methods to Reduce the Risk of Adverse Selection", "The Differences between Moral Hazard and Adverse Selection and their Effects on Health Economics", "The Need to Educate Patients on the Costs Added to their Medical Bills", "The Role of Medical Resources in Increasing Life Expectancy Numbers", "Reasons Patients Should Select Larger Medical Facilities to Avoid Costly Treatments", "The Adverse Effects of an Unplanned Influx in Health Care on the Overall Economic Balance", "The Role of a Stronger Health Care System and Nutrition Programs on the Throughput of the Employed Masses", "Notice of Recording"]}, {"course_id": 32, "course_code": "CIVE 392", "course_name": "CIVE392 - Economics and Life Cycle Cost Analysis (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Economics and Life Cycle Cost Analysis Spring 2024", "08:30AM - 09:50AM DC 1350", "Email:  chris.bachmann@uwaterloo.ca", "Email: cglehmannskelton@uwaterloo.ca", "Marley Dowling", "Email: mkldowling@uwaterloo.ca", "Nastaran Mosavari Nezamabad", "Email: nastaran.mosavari.nezamabad@uwaterloo.ca", "Email: enkichiy@uwaterloo.ca", "Project financing, life-cycle cost analysis, time value of money, sensitivity analyses, tax, financial implications of infrastructure projects, quantitative decision-making, financial aspects of a business plan.", "Appraise and compare the financial profitability of potential infrastructure projects", "3. Judge the attractiveness of public sector infrastructure projects and monetize non-monetary costs and benefits if necessary", "4. Construct a cash flow diagram to summarize the timing and magnitude of cash flows over time", "Identify sources of capital for governments and businesses, and calculate the associated cost of capital for financing their projects", "Exam Period", "Cash Flow Analysis", "Comparison Methods", "Public Sector Decision Making", "Inflation", "Public Sector Decision Making, Taxes, Inflation", "Engineering economics: Financial decision making for engineers (5th ed.)."]}, {"course_id": 33, "course_code": "ENVE 392", "course_name": "ENVE392 - Economics and Life Cycle Cost Analysis (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Economics and Life Cycle Cost Analysis Spring 2024", "08:30AM - 09:50AM DC 1350", "Email:  chris.bachmann@uwaterloo.ca", "Email: cglehmannskelton@uwaterloo.ca", "Marley Dowling", "Email: mkldowling@uwaterloo.ca", "Nastaran Mosavari Nezamabad", "Email: nastaran.mosavari.nezamabad@uwaterloo.ca", "Email: enkichiy@uwaterloo.ca", "Project financing, life-cycle cost analysis, time value of money, sensitivity analyses, tax, financial implications of infrastructure projects, quantitative decision-making, financial aspects of a business plan.", "Appraise and compare the financial profitability of potential infrastructure projects", "3. Judge the attractiveness of public sector infrastructure projects and monetize non-monetary costs and benefits if necessary", "4. Construct a cash flow diagram to summarize the timing and magnitude of cash flows over time", "Identify sources of capital for governments and businesses, and calculate the associated cost of capital for financing their projects", "Exam Period", "Cash Flow Analysis", "Comparison Methods", "Public Sector Decision Making", "Inflation", "Public Sector Decision Making, Taxes, Inflation", "Engineering economics: Financial decision making for engineers (5th ed.)."]}, {"course_id": 34, "course_code": "GEOE 392", "course_name": "GEOE392 - Economics and Life Cycle Cost Analysis (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Economics and Life Cycle Cost Analysis Spring 2024", "08:30AM - 09:50AM DC 1350", "Email:  chris.bachmann@uwaterloo.ca", "Email: cglehmannskelton@uwaterloo.ca", "Marley Dowling", "Email: mkldowling@uwaterloo.ca", "Nastaran Mosavari Nezamabad", "Email: nastaran.mosavari.nezamabad@uwaterloo.ca", "Email: enkichiy@uwaterloo.ca", "Project financing, life-cycle cost analysis, time value of money, sensitivity analyses, tax, financial implications of infrastructure projects, quantitative decision-making, financial aspects of a business plan.", "Appraise and compare the financial profitability of potential infrastructure projects", "3. Judge the attractiveness of public sector infrastructure projects and monetize non-monetary costs and benefits if necessary", "4. Construct a cash flow diagram to summarize the timing and magnitude of cash flows over time", "Identify sources of capital for governments and businesses, and calculate the associated cost of capital for financing their projects", "Exam Period", "Cash Flow Analysis", "Comparison Methods", "Public Sector Decision Making", "Inflation", "Public Sector Decision Making, Taxes, Inflation", "Engineering economics: Financial decision making for engineers (5th ed.)."]}, {"course_id": 35, "course_code": "MSE 261", "course_name": "MSE261 - Engineering Economics: Financial Management for Engineers (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Engineering Economics: Financial Management for Engineers Winter 2025", "10:30AM -", "12:20PM RCH 306", "S. Mortazavian Farsani", "10:30AM - 11:20AM RCH 306", "Depreciation models and asset replacement analysis.", "View requirements for MSE 261", "Engineers are often required by society to make responsible decisions on complex issues that have financial, economic, political and environmental elements.", "This course presents engineering economics as a key part of an engineer’s decision-making mandate.", "Engineering Economics focuses on basic principles and applications of economic decision-making between alternatives encountered in engineering systems projects.", "Apply basic financial calculations, useful in personal life and business [", "4. Recognize the impact of inflation and taxation in making engineering economics decisions [11b]", "Analyze the public centered projects by their costs and benefits (dis-benefits) to society and environment [9a, 9b, 11b]", "Understand and analyze the components of financial statements and use them in investment decisions and preparing business plans [1c, 11b]", "The course will be dynamic and hence, the weekly schedule provided in this document is tentative and subject to slight changes in order to adapt to the needs and conditions the class may face.", "Week of", "Introduction", "Cash Flow Analysis", "-", "Replacement Analysis", "Inflation", "Public Sector Decision Making", "Introduction to Project Management", "Engineering Economics: Financial Decision Making for Engineers (7th Edition).", "Engineering Economic Analysis (4th Canadian Edition).", "Quizzes are non-cumulative while midterm and final exams are cumulative in the sense that final exam covers whatever covered after the midterm content.", "In case of any technical issues uploading the files, please email the TAs right away.", "All assessments will be also submitted online in that case.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 36, "course_code": "SYDE 262", "course_name": "SYDE262 - Engineering Economics of Design (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Notice of Recording", "Engineering Economics of Design Fall 2024", "jessie.ma@uwaterloo.ca", "11:30AM - 12:20PM E7 4433", "jessie.ma@uwaterloo.ca", "Jessie Ma | jessie.ma@uwaterloo.ca | E7-6304", "Topics include microeconomics, supply, demand and external costs in the context of systems design.", "Evaluate and compare alternatives for an engineering firm's financial decisions (GA 11a, 11b)", "Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)", "Create a business plan for an engineering firm, accounting for uncertainty in economic and environmental aspects (GA 9a, 9b)", "Identify external costs in the context of systems design, including the use of sustainability indicators (GA 9a, 9b)", "1 Sep 2 Introduction Introduction", "3 Sep 16   Decision Making - Cash Flow Series Patters Assignment 1 posted Evaluate and compare alternatives for an engineering firm's financial decisions (GA 11a, 11b) Excel", "4 Sep 23   Decision Making 2 - Basic Evaluation Methods   Evaluate and compare alternatives for an engineering firm's financial decisions (GA 11a, 11b) Excel", "5 Sep 30   Decision Making 3 - Analysis Period & Project Lives; Risk Analysis Assignment 1 due Oct 4 Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)  Excel", "6 Oct 7 2. Context - Looking Outside Entrepreneurship   Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)", "9 Oct 28   Intrapreneurship; Evaluation of Complex Projects (Replacement Analysis, Life Cycle Costs, Benefit-Cost Analysis) Group Project posted Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)", "Identify external costs in the context of systems design, including the us of sustainability indicators (GA 9a, 9b)", "Identify external costs in the context of systems design, including the us of sustainability indicators (GA 9a, 9b)", "12 Nov 18   Business Plans; Markets   Create a business plan for an engineering firm, accounting for uncertainty in economic and environmental aspects (GA 9a, 9b) Excel", "Notice of Recording", "Sign your email with your first and last name and your student number.", "There could be a need to make alternate arrangements for in-person course activities.", "This alternate arrangement could be for a short period of time (e.g., one week) or a more sustained disruption to in-person course activities.", "Impacted in-person deliverables will be handled on a case-by-case basis with notification provided as soon as possible (see COVID-19-Related Absences and Short-Term Absences below).", "They will review your case and coordinate a reasonable and fair plan in consultation with appropriate others.", "Laptops, Tablets, and Electronic Devices", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.", "A.A.S. also offers learning strategy supports to all students that can be accessed through:", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 37, "course_code": "BET 450", "course_name": "BET450 - Leadership (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Notice of Recording", "My goal is to respond within 24 - 48 hours and I expect the same from each student.", "Leaders make things happen.", "Leaders make things possible.", "Course topics will be enriched through a critical study of leadership exemplars in popular media.", "Awareness, Behaviours, and Choices and how these impact our decisions.", "DEVELOPMENT ACTIVITY", "Leadership: Vision & Values     Take-home 1: Leadership Statement", "Mindset     Take-home 2: Comfort Zone", "Change Leadership: Envision & Inspire     Take-home 3: Leadership Statement", "Culture: Design & Impact     Take-home 6: Leadership Song", "Share & Tell", "Self-Evaluation 50%", "Self-Evaluation:", "Team Member Evaluations:", "Receiving feedback from your peers can help to develop your level of personal awareness on how you impact others and your work environment.", "This course includes the independent development and practice of specific skills.", "Notice of Recording"]}, {"course_id": 39, "course_code": "CS 480", "course_name": "CS480 - Introduction to Machine Learning (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Introduction to Machine Learning Winter 2025", "10:00AM - 11:20AM DWE 1501", "Introduction to modelling and algorithmic techniques for machines to learn concepts from data.", "Optimization-based learning: loss minimization. regularization.", "This is especially useful in complex tasks such as natural language processing, information retrieval, data mining, computer vision and robotics where it is not practical for a programmer to enumerate all possible situations in order to specify suitable instructions for all situations.", "The course will introduce the basics of machine learning and data analysis, and demonstrate how machine learning techniques have impacted life and society.", "The course starts with some classical tasks and algorithms in machine learning, then transitions to modern advances and successful applications in real life, and finally ends with discussions on the societal impact that machine learning has generated.", "A significant part of the course will be devoted to raising students' awareness on such ethical issues, including how to make machine learning algorithms fair and unbiased, how to protect individual privacy without compromising learning, how machine learning algorithms might be attacked, how to measure and improve the security of machine learning algorithms, and how to make machine learning algorithms explainable and interpretable.", "Recognize and formalize a task as a machine learning problem", "Identify suitable algorithms to tackle different machine learning problems", "Understand and implement a plethora of foundational machine learning algorithms", "Apply machine learning algorithms to real datasets", "Become aware of potential ethical and safety issues of machine learning on society", "Introduction (first lecture: Jan 7, 2025)", "Linear Regression", "Reproducing Kernels", "Multi-layer Perceptron", "Deep Neural Networks", "Attention", "Decision Trees", "Flow Models", "Variational Autoencoders", "Diffusion Models"]}, {"course_id": 40, "course_code": "ECE 457B", "course_name": "ECE457B - Fundamentals of Computational Intelligence (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Fundamentals of Computational Intelligence Winter 2025", "ECE 457B", "Monday, Friday -", "10:00AM - 11:20AM E7 5353", "04:00PM - 05:20PM", "Da Saem Lee : ds3lee@uwaterloo.ca", "Communication and Discussion", "If you really have a critical time issue, or you don't want the TA's to see the message (for any reason at all), then you should send Prof. Crowley a direct message on Teams chat in addition to email.", "Model-based prediction and classification.", "Multiple examples and case studies such as autonomous driving, intelligent manufacturing, natural language understanding, speech recognition, computer vision, stock market prediction, disease early detection and diagnosis.", "View requirements for ECE 457B", "It encompasses a broad spectrum of supervised learning topics, including nonparametric and parametric models, linear and nonlinear approaches, deep learning paradigms, and probabilistic models.", "Theoretical knowledge is translated into practice through tutorials on industry-standard tools such as PyTorch and Keras.", "Interactive classroom discussions will pivot around both the practical trade- offs inherent in real-world applications and the theoretical underpinnings that provide an intuitive grasp of the field.", "These topics are an outline, and each year some subset of non-core topics will be skipped due to time constraints and in order to benefit students through deeper focus.", "Classification I", "Distance based - k-Nearest Neighbours (kNN)", "Fundamentals of Parameter Estimation and Learning", "MAP Implementation as Classification: Naive Bayes Algorithm", "Dimensionality Reduction and Manifold Learning", "Vector Embeddings : TF-IDF, Word2Vec, BERT", "Kernel Methods and Latent Models", "k-Means Algorithm, DBScan Algorithm", "Anomaly Detection: Classification, Outlier, Density, and Isolation based", "Classification III : Data, Image and Time-series classification using Deep Learning", "Representation Learning II: Auto-encoders and Variational Auto-Encoders", "Attention and Transformer Networks", "Some additional information and links might be here for older courses.", "A visual grading tool for pdfs submissions of tests and assignments, allows limited online test with mark-down text entry and multiple choice questions.", "Some assignments and tests might be made available online for submission using this tool as well.", "Arxiv Tutorials - pdfs will be posted to hypothes.is and others links will be provided to a number of detailed tutorials on some course topics.", "The first half covers many of basics of this course, while the second half focusses on Deep Learning only.", "Exams", "Completing the assignments will require multiple skills:", "familiarity with statistical, probabilistic analysis of data and results", "logical design and clear description of a expeirmental methodology", "programming various algorithms for processing, training and analysis of data to achieve given tasks (programming will be in Python using libraries such as sci-kit learn and tensorflow, pytorch, pandas)", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 41, "course_code": "MSE 446", "course_name": "MSE446 - Introduction to Machine Learning (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Introduction to Machine Learning Winter 2025", "04:00PM - 05:20PM", "Topics covered may include data cleaning and transformation, overfitting and generalization, n-fold cross validation, regression, decision trees, neural networks, rule finding, and clustering.", "View requirements for MSE 446", "Problem Analysis]", "Jan. 6   Introduction", "Mar. 31   Advanced topics", "Apr. 2   Advanced topics", "https://web.stanford.edu/~jurafsky/slp3/ Includes language models No 0", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 42, "course_code": "SYDE 522", "course_name": "SYDE522 - Foundations of Artificial Intelligence (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["The objective of this course is to introduce students to fundamental concepts of artificial intelligence.", "Understand the basic concepts in Artificial Intelligence (CEAB requirements: 1d)", "Discuss how basic concepts lead to modern AI systems (CEAB requirements: 1d)", "Integrate ethical considerations when using AI (CEAB requirements: 10)", "Instruction", "Course slides and code notebooks will be posted on LEARN.", "W Sept 4 Introduction and Definitions", "M Sept 9 Perceptrons and Delta Rule", "M Sept 16 Evaluation Metrics and Experimental Validation", "M Sept 23 Linear SVMs", "M Nov 25  Extra Topics: Genetic Algorithms", "Late policy: If students have reasons for an assignment to be submitted late, they need to contact the instructor and accommodations can be made on a case-by-case basis.", "Course and Departmental Expectations", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.", "A.A.S. also offers learning strategy supports to all students that can be accessed through:"]}, {"course_id": 43, "course_code": "ECON 201", "course_name": "ECON201 - Microeconomic Theory for Business and Policy (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Microeconomic Theory for Business and Policy Winter 2025", "ECON 201", "10:00AM - 11:20AM DWE 2527", "Email: pacurry@uwaterloo.ca", "Topics include consumer choice, production, price and output under perfect and imperfect competition, price discrimination and two part pricing, vertical and horizontal firm boundaries and integration, and market structure.", "View requirements for ECON 201", "Possess skills that enable an evaluation of the societal effects of government policy decisions and understand why governments choose to intervene in markets", "1 Demand and Supply", "Economics Department Deferred Final Exam Policy", "Applications for Accommodation", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued."]}, {"course_id": 45, "course_code": "MSE 211", "course_name": "MSE211 - Organizational Behaviour (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Sofiia Doroshenko <sdoroshenko@uwaterloo.ca>", "Introduction to the concepts of learning, person perception, attitudes, and motivation in an organization.", "Discussion of power, control, leadership, and management in light of the above concepts.", "The basic objective of the course is to help you to develop both theoretical and practical approaches for analyzing and making sense of individual and group behaviour in organizational situations.", "Demonstrate understanding of basic theories/concepts of organizational behaviour.", "2. Demonstrate understanding of factors that affect the behaviour of individuals and groups in organizations.", "3. Demonstrate understanding of factors affecting communication effectiveness in organizations.", "Introduction                                            Ch 1", "Personality & Intelligence                     Ch 3", "Lewin’s field theory                               Handouts", "Groups & Teams                                    Ch 11", "Communication                                      Ch 20", "This course includes the independent development and practice of specific skills, such as analyzing and writing about organizational situations.", "In cases where there is further clear evidence of plagiarism regardless of AI% score, the work will be submitted to the Associate Dean as a potential academic integrity offence.", "Keep copies of your pre- and post- grammar-corrected drafts in case we ask to see them.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 0, "course_code": "ECE 405C", "course_name": "ECE405C - Programming of Quantum Computing Algorithms (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Programming of Quantum Computing Algorithms Winter 2025", "ECE 405C / ECE 730", "Monday, Friday -", "04:00PM - 05:20PM", "ECE 730 002", "Monday, Friday -", "04:00PM - 05:20PM", "Email: nayoung.kim(at)uwaterloo.ca", "The course will teach basic elements to create quantum circuits in quantum computers: qubits, single-qubit gates, two-qubit gates, quantum operators, and measurements.", "View requirements for ECE 405C", "ECE 730:", "View requirements for ECE 730", "Learn the basic elements of quantum circuits", "Learn the fundamentals of representative quantum algorithms", "Learn how to program quantum circuits and quantum algorithms via quantum computers or quantum cloud services", "Introduction to Quantum Computing - Qubits", "Quantum Circuits and Queries", "Quantum Algorithms", "Quantum Programming", "Study Break", "Phase Estimation Algorithm", "Quantum Simulation", "Quantum Error Correction", "Qiskit tutorials for quantum machine learning: https://qiskit.org/learn/course/machine-learning-course/"]}, {"course_id": 1, "course_code": "AMATH 373", "course_name": "AMATH373 - Quantum Theory 1 (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Basic concepts of quantum mechanics: observables, wavefunctions, Hamiltonians, and the Schroedinger equation.", "Simple applications to finite and extended one-dimensional systems, harmonic oscillator, rigid rotor, and hydrogen atom.", "Explain how the mathematical formalism of quantum theory an be applied to describe elementary quantum systems.", "Introduction to Quantum Mechanics, 3rd Edition, David Griffiths and Darrell Schroeter Yes 87.00"]}, {"course_id": 2, "course_code": "CHEM 356", "course_name": "CHEM356 - Introductory Quantum Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Introductory Quantum Mechanics Fall 2024", "Historical background; the differential equation approach to quantum mechanics; treatments of solvable problems such as the particle-in-a-box, harmonic oscillator, rigid rotator and the hydrogen atom; introduction to approximation methods for more complicated systems.", "This theoretical framework will lead us to understand deeply some very basic concepts in chemistry and physics.", "In this course we will focus on model problems that can be solved with 'relatively little' effort and which illustrate the nature of the quantum world and will introduce you to thinking 'quantum'.", "Moreover these simple models often lead to surprisingly quantitative understanding of observed excitations of atoms, molecules and materials.", "A major theme concerns the electronic structure of atoms and simple molecules.", "Operator techniques will be introduced as a powerful tool to solve a variety of problems in an elegant and uniform manner.", "It contains short summaries (Mathchapters) of mathematical methods that can serve as either brief reviews of or introductions to the material.", "Problems and Solutions for McQuarrie's Quantum Chemistry,", "A free pdf of the McQuarrie book is available here", "Understand the essential formulation of quantum mechanics: States, Superpositions, Eigenstates, Operators, Probabilities.", "Understand (at a basic level)", "History: Relativity, Planck’s radiation law, Einstein Photo-electric effect,", "Time-dependent Schrödinger equation and Ehrenfest theorem.", "Variational principle and basis set expansions, matrix formulations quantum mechanics.", "Problems and Solutions for McQuarrie's Quantum Chemistry,ISBN 9781891389528 This is a solution manual for problems in McQuarrie No", "In particular we will discuss the postulates of quantum mechanics and their 'ensemble Interpretation'.", "There will also be a handout discussing the most basic H atom, using angular momentum theory in operator form.", "I plan to introduce a section on quantum computing.", "TBA"]}, {"course_id": 3, "course_code": "ECE 305", "course_name": "ECE305 - Introduction to Quantum Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Notice of Recording", "Introduction to Quantum Mechanics Fall 2024", "ECE 305", "11:30AM -", "04:00PM - 05:20PM", "Introduction to quantization, wave-particle duality, and the uncertainty principle.", "Introduction to approximation methods including time-independent perturbation theory.", "View requirements for ECE 305", "Learn basic mathematics for quantum mechanics", "Understand the fundamental concepts of quantum mechanics: quantization, wave-particle duality, the uncertainty principles", "Learn how to solve Schrödinger equations for exemplary problems: particle-in-a-box, finite-height potential, a harmonic oscillator", "Learn modern applications of quantum mechanics", "Make-Up-F", "Tutorial-Th", "Introduction", "Stern-Gerlach", "Math/Matrix Notation", "Quantum State Vectors", "Linear Algebra", "Ch. 2.3-2.4", "Expectation Values", "Calculating expectation values", "Expectation values", "Schrödinger Equation", "Schrödinger Equation", "Spin Precession", "Energy Eigenvalue Equation", "Schrödinger Equation", "Wavefunction", "Wavefunction", "Wavefunction", "Nov.11-15", "Nov.18-22", "Finite Squarewell", "Nov.25-29", "Quantum Cryptography", "Quantum Mechanics: A Paradigms Approach by David H. McIntyre Yes", "Linear Algebra Lecture Material: https://ece.uwaterloo.ca/~ne112/Lecture_materials/.", "Notice of Recording"]}, {"course_id": 4, "course_code": "NE 332", "course_name": "NE332 - Quantum Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Quantum Mechanics Spring 2024", "04:00PM - 05:20PM", "04:00PM - 05:20PM QNC 1502", "Historical background; the differential equation approach to quantum mechanics; treatments of solvable problems such as the particle-in-a-box, harmonic oscillator, rigid rotor, and the hydrogen atom; introduction to approximation methods for more complex systems; application to solid state problems, including band theory.", "This theoretical framework will lead us to understand deeply some very basic concepts in chemistry and physics.", "In this course we will focus on model problems that can be solved with 'relatively little' effort and which illustrate the nature of the quantum world and will introduce you to thinking 'quantum'.", "Moreover these simple models often lead to surprisingly quantitative understanding of observed excitations of atoms, molecules and materials.", "A major theme concerns the electronic structure of atoms and simple molecules.", "Operator techniques will be introduced as a powerful tool to solve a variety of problems in an elegant and uniform manner.", "It contains short summaries (Mathchapters) of mathematical methods that can serve as either brief reviews of or introductions to the material.", "Problems and Solutions for McQuarrie's Quantum Chemistry,", "A free pdf of the McQuarrie book is available here", "Understand the essential formulation of quantum mechanics: States, Superpositions, Eigenstates, Operators, Probabilities.", "Understand (at a basic level)", "History: Relativity, Planck’s radiation law, Einstein Photo-electric effect,", "Time-dependent Schrödinger equation and Ehrenfest theorem.", "Variational principle and basis set expansions, matrix formulations quantum mechanics.", "Introduction Gaussian: Optimization + Frequency (tut.)", "Problems and Solutions for McQuarrie's Quantum Chemistry,ISBN 9781891389528 This is a solution manual for problems in McQuarrie No", "In particular we will discuss the postulates of quantum mechanics and their 'ensemble Interpretation'.", "There will also be a handout discussing the most basic H atom, using angular momentum theory in operator form.", "I plan to introduce a section on quantum computing.", "TBA"]}, {"course_id": 5, "course_code": "PHYS 233", "course_name": "PHYS233 - Introduction to Quantum Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Introduction to Quantum Mechanics Winter 2025", "Email: rbudakian@uwaterloo.ca", "Email: pppritampriyadarsi@uwaterloo.ca", "Introduction to quantization, wave-particle duality and the uncertainty principle The Schroedinger equation and solvable examples.", "Introduction to approximation methods including time-independent perturbation theory.", "Background: understanding why we need a quantum theory", "Learning the building blocks of a quantum theory: state vectors and operators", "Learning how to use quantum mechanics to compute probabilities for outcomes of measurements", "Competency with the following mathematical concepts:", "Complex numbers", "Basic probability", "Linear algebra", "Differential equations", "Classical description of a magnetic moment", "Stern-Gerlach Experiment I", "The quantum state vector", "Representation of the quantum state vector", "Generalized quantum systems", "Representation of S = 1/2 angular momentum operators", "Projection operators", "Expectation value of operators", "Time evolution of superposition of eigenstates", "Quantum mechanics in the position basis", "Infinite square well potential", "Quantum harmonic oscillator I", "Hydrogen atom I", "The remaining 2/3 will be spent answering questions related to the lectures and getting into small groups and problem solving."]}, {"course_id": 6, "course_code": "PHYS 234", "course_name": "PHYS234 - Quantum Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["11:30AM - 12:20PM DC 1351", "K. Islam", "Introduction to formalism of quantum physics.", "Introduction to operators.", "Background: understanding why we need a quantum theory", "Learning the building blocks of a quantum theory: state vectors and operator", "Jan 06, 08, 10 Introduction to Quantum Physics, Stern-Gerlach experiments 1", "Jan 20, 22, 24 Matrix notation, general quantum systems, operators 2", "Mar 10, 12, 14 Continuous quantum systems – formalism, infinite potential well,", "Mar 17, 19, 21 Continuous quantum systems – infinite potential well (continued), finite potential well 5", "Mar 24, 26, 28 Continuous quantum systems – quantum harmonic oscillator 9", "Mar 31, Apr 02, 04 Continuous quantum systems (continued), Review", "Students should start checking for posted exam dates:", "Everyone needs a support system.", "Every student in PHYS 234 is expected to treat their peers and their instructor with kindness, fairness, tolerance, and respect.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 7, "course_code": "ECE 405A", "course_name": "ECE405A - Quantum Information Processing Devices (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Quantum Information Processing Devices Fall 2024", "This course introduces physical implementations of quantum computers with an emphasis on common and connecting themes.", "The course topics include the review of quantum mechanics, criteria to build quantum computers, quantum circuit models, and four quantum hardware platforms (nuclear magnetic resonance, optical photons, trapped ions, and superconducting systems) in terms of qubit definition, universal gate sets, initialization, measurement strategies, and decoherence processes.", "View requirements for ECE 405A", "Introduction to quantum computing", "Topics: History of quantum computing, DiVincenzo criteria, quantum circuits, computational complexity, quantum error correction", "Special Topic: Repetition code", "Review of quantum mechanics", "Spins", "Special Topic: Silicon-based spins", "Optics", "Topics: Electromagnetic field quantization, single-photon sources/detectors, Knill-Laflamme-Milburn protocol, dual-rail encoding, linear optical elements, probabilistic gates, measurement-based and continuous variable quantum computing", "Topics: Ion traps, trapped ion motion, electronic states, Lamb-Dicke regime, ion-laser interactions, Cirac-Zoller and Molmer-Sorensen gates", "Superconducting circuits", "Identify the advantages of quantum computing over classical computing.", "Use quantum mechanics to model each of the studied implementations of quantum computing.", "Map quantum operations onto various hardware platforms.", "Assess how different implementations of quantum computing satisfy the DiVincenzo criteria.", "Compare and contrast different methods of quantum computing.", "Evaluate historical and modern quantum computing literature.", "Week Dates Theme Monday Wednesday Book Sections Deliverables", "5 Sep 30, Oct 2 Spins Initialization & Noise Silicon-Based Spins 3.6, 3.7, 3.8 Project Topic", "6 Oct 7, 9 Optics EM Field Quantization Sources & Detectors 4.1, 4.2, 4.3 Assignment 2", "8 Oct 21, 23 Optics Gates & BB84 QKD Measurement & CV Based QC 4.4, 4.5, 4.6, 4.7, 4.8, 4.9 Abstract", "11 Nov 11, 13 SC Circuits Superconducting Circuits Circuit QED & Control 6.1, 6.2, 6.3, 6.4, 6.5, 6.6 Assignment 4", "12 Nov 18, 20 SC Circuits Measurement & Noise Bosonic Qubits 6.7, 6.8, 6.9", "Building Quantum Computers: A Practical Introduction by Shayan Majidy, Christopher Wilson, and Raymond Laflamme Virtual copies of the textbook chapters will be provided in the event hard copies are unavailable.", "Priority given on a \"first-come, first-served\" basis", "Presentation slots will be assigned on a \"first-come, first-served\" basis", "Penalty-free extensions will be considered for extenuating circumstances at the discretion of the instructor.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 8, "course_code": "PHYS 468", "course_name": "PHYS468 - Introduction to the Implementation of Quantum Information Processing (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Introduction to the Implementation of Quantum Information Processing Fall 2024", "02:30PM - 05:20PM", "Zachary Mann zmann@uwaterloo.ca", "This course gives an introduction to physical implementations of quantum computers with an emphasis on common and connecting themes.", "-understand some of the basic physics ideas behind quantum technologies such as quantum computers", "-undertand how the theoretical ideas of quantum information science can be implemented in real devices", "-ability to evaluate and assess the quality of quantum information devices", "Brief introduction to quantum information processing", "Review of Quantum Mechanics:", "State vectors and operators; Dirac notation; time-evolution and the Hamiltonian; The quantum harmonic oscillator; The 2-level system (spin 1/2); Coupling between a Harmonic Oscillators and two level systems", "3. Spin-based Quantum Computing", "Nuclear magnetic resonance; qubits; single and two qubit gates; measurement; state preparation; noise", "Superconducting Qubits", "Trapping ions; qubits; single and two qubit gates; measurement; state preparation; noise", "7. Benchmarking quantum computers", "An Introduction to Quantum Computing, P. Kaye and al.", "This course includes the independent development and practice of specific skills, such as solvinf problems and writing.", "Library for research-based assignments"]}, {"course_id": 10, "course_code": "ECE 405D", "course_name": "ECE405D - Superconducting Quantum Circuits (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Superconducting Quantum Circuits Winter 2025", "Monday, Friday -", "11:30AM -", "04:00PM - 05:20PM", "This course offers applications of superconductivity in quantum information devices and circuits at microwave frequencies.", "Introducing the basic physics of superconductivity, superconducting transmission lines and cavity resonators are presented as the elementary passive components in quantum circuits.", "Josephson junctions as an active element in superconducting electronics is introduced and it is shown how a qubit can be constructed based on various two-level system manipulated in Josephson junctions.", "Single qubit operation and qubit coupling in the form of circuit cavity electrodynamics and their associated qubit readout are discussed.", "Some existing quantum computers such as IBM Q System One and Google Sycamore are briefly introduced.", "View requirements for ECE 405D", "Week 1/2: Basics of superconductivity (BCS theory, two fluid model, microwave propagation in superconductors)", "Week 11/12: Quantum systems (introduction to IBM Q system, Google Sycamore)", "Principles of Superconducting Quantum Computers by Daniel D. Stancil, Gregory T. Byrd Yes free", "Building Quantum Computers, A Practical Introduction by SHAYAN MAJIDY, CHRISTOPHER WILSON, AND RAYMOND LAFLAMME No"]}, {"course_id": 11, "course_code": "AE 223", "course_name": "AE223 - Differential Equations and Balance Laws (0.50)", "term_name": "List 1", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Differential Equations and Balance Laws Fall 2024", "09:00AM - 11:50AM CPH 1319", "Adham Elmalky Instructor aelmalky@uwaterloo.ca", "An introduction to ordinary differential equations with applications to mass and energy balance problems in engineering.", "Standard methods of solution of first and second order linear equations with constant coefficients.", "Numerical methods for solving ordinary differential equations.", "Impose appropriate boundary and initial conditions for given a mathematical problem statement expressed in terms of a linear differential equation.", "Understand and apply standard methods for solving ODEs and PDEs.", "Have the means to think critically about a mathematical problem and evaluate the validity of results from mathematical methods.", "The first week covers an introduction to the course, class goals, and an overview of general concepts and definitions.", "Students will study the first part of first-order equations, focusing on general and particular solutions, boundary and initial conditions, as well as integrable and separable solutions.", "In the third week, first-order equations continue with discussions on autonomous and exact equations, and integrating factors.", "This week covers numerical methods, particularly Euler’s method.", "The focus will be on the applications of linear first-order equations.", "Applications of PDEs are discussed this week.", "Lebl, Jiří, “Notes on Diffy Qs: Differential Equations for Engineers” (2022)."]}, {"course_id": 12, "course_code": "CIVE 222", "course_name": "CIVE222 - Differential Equations (0.50)", "term_name": "List 1", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Differential Equations Spring 2024", "10:00AM - 11:20AM STC 0010", "An introduction to linear and partial differential equations.", "Standard methods of solution, applications to physical and engineering problems, linear equations with constant coefficients, basic systems of differential equations, partial differential equations.", "2. Problem Analysis: Formulate problem statement; Rehearse Problem Solving skills; Solve moderately complex problems", "Introduction, p.1", "1.2         General Concepts and Definitions, p.6", "First-Order and Simple Higher-Order Differential Equations, p.16", "2.3         Exact Differential Equations and Integrating Factors, p.31", "2.3.1      Exact Differential Equations, p.32", "2.4         Linear First-Order Equation, p.55", "2.4.1      Linear First-Order Equations, p.55", "2.6         Simple Higher-Order Differential Equations, p.68", "Applications of First-Order Differential Equations, p.87", "3.2         Motion of a Particle in a Resisting Medium, p.91", "3.3.2      Cable under Self-Weight, p.102", "Linear Differential Equations, p.140", "4.1         General Linear Ordinary Differential Equations, p.140", "4.2         Complementary Solutions, p.143", "Applications of Linear Differential Equations, p.188", "5.1         Vibration of a Single Degree-of-Freedom System, p.188", "5.1.2       Response of a Single Degree-of-Freedom System, p.193", "Systems of Linear Differential Equations, p.300", "Applications of Systems of Linear Differential Equations, p.357", "Partial Differential Equations, p.457", "11.1       Simple Partial Differential Equations, p.457", "Wei-Chau Xie, 2010, Differential Equations for Engineers, Cambridge University Press, ISBN 978-0-521-19424-2, TA347.D45X54 2010"]}, {"course_id": 13, "course_code": "ECE 205", "course_name": "ECE205 - Advanced Calculus 1 for Electrical and Computer Engineers (0.50)", "term_name": "List 1", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Advanced Calculus 1 for Electrical and Computer Engineers Winter 2025", "ECE 205", "ECE 205 001", "11:30AM - 12:20PM E7 4043", "10:30AM - 11:20AM E7 4043", "E7 4043", "03:30PM - 04:20PM E7 4043", "ECE 205 101", "04:30PM - 05:20PM E7 4043", "ECE 205 102", "04:30PM - 05:20PM E7 4043", "Applications to linear electrical systems.", "View requirements for ECE 205", "First order differential equations", "Second order differential equations", "Linear first and second order partial differential equations with constant coefficients.", "Solve first order differential equations by means of separation of variables and integrating factor", "Solve second order both homogeoneous and non-homogeneous differential equations with constant coefficients", "Compute the Fourier series of the given function", "Solve the linear heat and wave equations using method of separation of variables", "First order differential equations  [", "1.1-1.3,", "2.1-2.2,", "2.5-2.6,", "-", "6.1-6.2", "A1", "A2", "8.1-8.7", "A4", "A6", "Mar. 24 - 28", "Linear PDEs", "Linear PDEs (cont) See above", "This will be a closed book exam and no calculators allowed.", "This will be a closed book exam and no calculators allowed.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 14, "course_code": "ENVE 223", "course_name": "ENVE223 - Differential Equations and Balance Laws (0.50)", "term_name": "List 1", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Differential Equations and Balance Laws Winter 2025", "10:00AM - 11:20AM RCH 309", "08:30AM - 09:20AM", "An introduction to ordinary differential equations with applications to mass and energy balance problems in engineering.", "Standard methods of solution of first and second order linear equations with constant coefficients.", "Numerical methods for solving ordinary differential equations.", "Many practical physical and engineering problems can be analyzed using mathematical models formulated in terms of ordinary differential equations; these often arise from the application of mass, momentum, or energy balance laws.", "The objective of this course is to equip engineering students with a working knowledge of the methods which are used to solve these equations.", "Differential equations are introduced, along with standard methods of solution for first and second order linear equations with constant coefficients.", "identify and differentiate between the various types of differential equations; with this knowledge, be able to identify the most appropriate method of solution", "pose appropriate boundary or initial conditions and solve that equation using standard methods for given a mathematical problem statement expressed in terms of a linear differential equation", "check whether a solution to a differential equation is correct", "think critically about a mathematical problem and evaluate the validity of results from mathematical methods", "appreciate the utility and value of having an education in mathematics as part of their training as an engineer", "Canadian Engineering Accreditation Board", "Piazza – Wiki-style Q&A; primary way to get & give text-based help in ENVE/GEOE 223", "Drop-in Hours", "Students are very welcome and encouraged to meet with the teaching team in scheduled drop-in hours.", "1 Jan 6-10 CH1: Introductory concepts and definitions, simply integrable and separable solutions", "2 Jan 13-17 CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties, substitution", "3 Jan 20-24 CH3: Applications of linear first-order ODEs", "4 Jan 27-31 CH4: Solving homogeneous linear higher-order ODEs with constant coefficients A1, Jan 28", "6 Feb 10-14 CH6: Applications of linear higher-order linear ODEs", "Reading Week & Family Day", "7 Feb 24-28 CH7: Slope fields and numerical solution of first-order ODEs A2, Feb 25", "Notes of Diffy Qs, Differential Equations for Engineers, Jiří Lebl, Creative Commons, 2024.", "Calculus for Engineers (4e), Donald Trim, Pearson, 2007.", "Common first-year calculus text.", "CH1: Introductory concepts & definitions, simply integrable & separable solutions 0.2,3; 1.1,3 15.1,2", "CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties; substitution 1.4", "CH3: Applications of linear first-order ODEs 1.4 15.2,3,5", "CH4: Solving homogeneous linear higher-order ODEs with constant coefficients 2.1-3 15.6-8", "CH5: Solving non-homogeneous linear higher-order ODEs with constant coefficients using the method of undetermined coefficients 2.5 15.9", "CH6: Applications of linear higher-order linear ODEs  2.4 15.10", "CH7: Slope fields and numerical solution of first-order ODEs 1.2,7", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "extenuating circumstance", "This course includes the independent development and practice of engineering specific skills.", "Campus Supports", "Library for research-based assignments"]}, {"course_id": 15, "course_code": "GEOE 223", "course_name": "GEOE223 - Differential Equations and Balance Laws (0.50)", "term_name": "List 1", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Differential Equations and Balance Laws Winter 2025", "10:00AM - 11:20AM RCH 309", "08:30AM - 09:20AM", "An introduction to ordinary differential equations with applications to mass and energy balance problems in engineering.", "Standard methods of solution of first and second order linear equations with constant coefficients.", "Numerical methods for solving ordinary differential equations.", "Many practical physical and engineering problems can be analyzed using mathematical models formulated in terms of ordinary differential equations; these often arise from the application of mass, momentum, or energy balance laws.", "The objective of this course is to equip engineering students with a working knowledge of the methods which are used to solve these equations.", "Differential equations are introduced, along with standard methods of solution for first and second order linear equations with constant coefficients.", "identify and differentiate between the various types of differential equations; with this knowledge, be able to identify the most appropriate method of solution", "pose appropriate boundary or initial conditions and solve that equation using standard methods for given a mathematical problem statement expressed in terms of a linear differential equation", "check whether a solution to a differential equation is correct", "think critically about a mathematical problem and evaluate the validity of results from mathematical methods", "appreciate the utility and value of having an education in mathematics as part of their training as an engineer", "Canadian Engineering Accreditation Board", "Piazza – Wiki-style Q&A; primary way to get & give text-based help in ENVE/GEOE 223", "Drop-in Hours", "Students are very welcome and encouraged to meet with the teaching team in scheduled drop-in hours.", "1 Jan 6-10 CH1: Introductory concepts and definitions, simply integrable and separable solutions", "2 Jan 13-17 CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties, substitution", "3 Jan 20-24 CH3: Applications of linear first-order ODEs", "4 Jan 27-31 CH4: Solving homogeneous linear higher-order ODEs with constant coefficients A1, Jan 28", "6 Feb 10-14 CH6: Applications of linear higher-order linear ODEs", "Reading Week & Family Day", "7 Feb 24-28 CH7: Slope fields and numerical solution of first-order ODEs A2, Feb 25", "Notes of Diffy Qs, Differential Equations for Engineers, Jiří Lebl, Creative Commons, 2024.", "Calculus for Engineers (4e), Donald Trim, Pearson, 2007.", "Common first-year calculus text.", "CH1: Introductory concepts & definitions, simply integrable & separable solutions 0.2,3; 1.1,3 15.1,2", "CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties; substitution 1.4", "CH3: Applications of linear first-order ODEs 1.4 15.2,3,5", "CH4: Solving homogeneous linear higher-order ODEs with constant coefficients 2.1-3 15.6-8", "CH5: Solving non-homogeneous linear higher-order ODEs with constant coefficients using the method of undetermined coefficients 2.5 15.9", "CH6: Applications of linear higher-order linear ODEs  2.4 15.10", "CH7: Slope fields and numerical solution of first-order ODEs 1.2,7", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "extenuating circumstance", "This course includes the independent development and practice of engineering specific skills.", "Campus Supports", "Library for research-based assignments"]}, {"course_id": 17, "course_code": "MATH 213", "course_name": "MATH213 - Signals, Systems, and Differential Equations (0.50)", "term_name": "List 1", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Signals, Systems, and Differential Equations Winter 2025", "D. Davison", "04:30PM - 05:20PM", "D. Davison", "Instructor Dan Davison", "EIT-3114", "Zhong Fang", "Laplace transform methods for: solving linear ordinary differential equations, classical signals, and systems.", "Transfer functions, poles, and zeros; system stability.", "Frequency response of linear systems and its log-scale representation (Bode plot).", "Applications in areas of interest for software engineers and computer scientists.", "Brief introduction to Fourier transforms in the context of signals and systems.", "Course pre-requisites:", "You should have a good working knowledge of differentiation, integration, and complex numbers.", "Course objective:  The main objective of the course is to develop a conceptual and mathematical framework that allows us to model, analyze, and design dynamical systems.", "(4) Solve first-order ordinary differential equations using the phase-portrait approach, the separation of variables approach, and the exact differential approach (Chapter 2)", "(6) Apply Laplace transform methods to solve a constant-coefficient linear ODE and explain the structure of the general solution (Chapter 3)", "(9) Manipulate block diagrams and explain how feedback is used to achieve tracking in a control system (Chapter 4)", "(10) Define and construct the Fourier series or Fourier integral to show how a signal can be decomposed into a sum or integral of sinusoids (Chapter 5)", "\"Investigation\"", "\"Design\"", "\"Impact of engineering on society and the environment\"", "\"Economics and project management\"", "You can send a print request online at https://wstore.uwaterloo.ca/pages/w-print-student.", "Summary of marked components", "Tests and final exam", "Due to limited TA resources, only a small subset of exercises will be graded in detail for correctness.", "For the most part, calculations should be done manually with the help of a basic calculator."]}, {"course_id": 18, "course_code": "MATH 217", "course_name": "MATH217 - Calculus 3 for Chemical Engineering (0.50)", "term_name": "List 1", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["11:30AM - 12:20PM E2 1736", "10:30AM - 11:20AM E2 1736", "the \"soft skill\" of email communication is one you will use daily in your future roles as a professional engineer, and it is best to develop good email communication habits in university before entering the workforce).", "Amirhossein Dehghanizadeh: a8dehgha@uwaterloo.ca", "Vector fields, divergence and curl.", "Vector integral calculus: Green's theorem, the Divergence theorem and Stokes' theorem.", "Applications in engineering are emphasized.", "Jan. 13 - 17 Unit 2: Vector-valued and multivariable functions", "Feb. 10 - 14 Unit 5 Part II: Optimization continued", "Mar. 10 - 14 Unit 8: Vector fields and line integrals", "Mar. 31 - Apr. 4 Unit 11: Gradient vector fields", "If the grader cannot read or make sense of your work, your mark may be reduced as a result.", "help you study for exams because the explanations are in your own words,", "develop technical communication skills that will serve you in your future roles as a professional engineer.", "A grade of INC will be considered on a case-by-case basis.", "Human readers may be used to monitor plagiarism."]}, {"course_id": 19, "course_code": "MATH 218", "course_name": "MATH218 - Differential Equations for Engineers (0.50)", "term_name": "List 1", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Differential Equations for Engineers Spring 2024", "10:30AM - 12:20PM MC 2038", "10:30AM - 11:20AM MC 2038", "First order equations, second order linear equations with constant coefficients, series solutions, the Laplace transform method, systems of linear differential equations.", "Applications in engineering are emphasized.", "convert various real-world physical scenarios to common differential equations and systems of DEs (e.g. Newton's law of cooling, mixing tanks, oscillators).", "navigate new solution techniques often based on unusual substitutions.", "describe theoretical concepts with a math or engineering emphasis (e.g. existence, uniqueness, transfer functions, resonance, unit impulse).", "Differential Equations for Engineers, Course Notes for Math 218 by J.Wainwright and J. West Main text Yes", "Students should attempt all assigned questions, but we may decide to only mark a subset of questions."]}, {"course_id": 20, "course_code": "ME 203", "course_name": "ME203 - Ordinary Differential Equations (0.50)", "term_name": "List 1", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Ordinary Differential Equations Fall 2024", "First and higher order differential equations.", "Linear equations with constant and variable coefficients.", "Systems of linear equations.", "Applications involving simple dynamical systems and principles of mass, momentum and heat conservation will emphasize the role of ordinary differential equations in understanding the behaviour of physical systems.", "Introduction to the Laplace transform method for solving ordinary differential equations.", "Specifically, we define what ordinary differential equations are and how they relate to the physical problems encountered in simplified engineering systems.", "Techniques for solving first and higher order differential equations, linear equations with constant and variable coefficients, and non-linear equations are introduced.", "Applications involving simple dynamical systems and principles of mass, momentum, and heat conservation will emphasize the role of ordinary differential equations in understanding the behaviour of physical systems.", "Classify a differential equation with respect to order and form", "Understand what it means for a function to be a solution to a ODE/IVP", "Use appropriate analytical method(s) to find a solution to different types of ODE problem", "Select appropriate analytical method(s) to solve ODEs", "Formulate simplified models which represent the behaviour of simplified engineering systems", "Find solutions to said simplified models and provide a meaningful interpretation of found solution", "a) Classify a differential equation with respect to order and form", "b) Understand what it means for a function to be a solution to a ODE/IVP", "2. Find explicit solutions to specific classes", "a) Be able to find explicit solutions for particular first or second order ODES and systems of first order equations using a range of approaches which includes the Laplace transform", "b) Determine the correct solution technique to solve a problem", "3. Effectively apply the concepts of differential equations in the analysis of simplified engineering systems", "a) Formulate simplified models which represent the behaviour of simplified engineering systems", "b) Find solutions to said simplified models and provide a meaningful interpretation of found solution", "Linear Independence (Wronskian, Variation of Parameters, & Reduction of Order) ~ 5 Lectures", "Cauchy-Euler & Variable Coefficient ODEs ~ 2 Lectures", "Systems of 1st order ODEs ~ 4 Lectures", "Giordano and Weir:  Differential Equations: A Modelling Approach, Addison-Wesley", "You will be permitted calculators and a single sided (US letter page - 8.5 by 11 inches) cheat sheet where you can write anything you want except worked examples.", "Solutions to these problem sets will be available on LEARN the following Monday.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}]