[{"course_id": 208, "course_code": "GEOG 101", "course_name": "GEOG101 - Human Geographies: People, Space and Change (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["04:00PM - 05:20PM", "E-mail: bdoberst@uwaterloo.ca", "An introduction to human geography through key subfields of the discipline, examining population change, the rise of cities, our relationship to nature, social inequalities, economic forms, cultural difference and environmental change at the local and global scale.", "So-called “food geography” is then explored, followed by an examination of the geographic basis of patterns of urbanization, and an exploration of global economic activity.", "The course concludes with a short unit on hazards geography, analysis of global development patterns and processes, and an assessment of human impacts on and sustainability in terrestrial and marine environments.", "For Winter 2025, course content will be delivered through a combination of in-class lectures and self-viewed readings and videos.", "Compare and contrast Human Geography theory with real-world expressions of Human Geography", "Construct solutions which apply Human Geography concepts and skills to real-world sustainability problems", "Course Introduction", "Introduction/Course Overview", "Nature of Geography/Human Geography & Key concepts", "Regions and places", "Spatial Analysis & Interaction", "Mental maps", "Movement, Migration & Environmental refugees", "Population control & EcoFootprints", "Geography of Health & Disease", "Health & Disease", "Food systems and impacts", "Environmental impacts of food", "Food deserts, food miles & lower impact food", "Development theories Economic/Non-economic", "Development Indicators & Development aid", "Urban systems and urban structures", "Urban Sustainability", "Urbanization in Developing Countries/Informal settlements", "Economic Geography", "Economic Activity: Primary sector", "Geography of hazards and disasters", "-Other valid reasons beyond the control of the student (to be approved on a case-by-case basis at the discretion of the instructor).", "Directions:", "Explain why you chose the SDG that you chose.", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Other valid reasons beyond the control of the student (to be approved on a case-by-case basis at the discretion of the instructor).", "In case you are still not convinced, imagine you have an online quiz, begin the quiz, realize you need to check something in the lecture notes, and the system is “down”!", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 209, "course_code": "GEOG 202", "course_name": "GEOG202 - Geography of the Global Economy (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["An introduction to globalization of the world economy through an examination of its causes, patterns, and consequences in a variety of geographic contexts.", "GEOG202 is an introduction to the global economy and the discipline of economic geography.", "We then explore several contexts that have given rise to the global economic system and consider the evolving spatial distribution of its industrial sectors.", "We conclude with a discussion of the present and future implications of economic globalization for both developed and less developed nations.", "Describe the current state of the global economy, including knowledge of key economic indicators and their strengths and limitations", "Define the central comments necessary for understanding contemporary global economic issues.", "Critically analyze economic issues from a geographic point of view, emphasizing spatial differences and the importance of national, political, social and cultural context", "Evaluate the importance of geography, space and difference in the global economy", "CH9 & CH10 selected pages  Film review*", "9 March 12  Environment: Does global climate change everything?", "Mini presentation*", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 210, "course_code": "GEOG 203", "course_name": "GEOG203 - Environment and Development in a Global Perspective (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Environment and Development in a Global Perspective Fall 2024", "08:30AM - 09:50AM HH 1101", "Farah El-shayeb (felshaye@uwaterloo.ca)", "Examines the interface between human development and the environment in a global context.", "In this course, we will examine some of the most pressing environmental and development issues facing our world today, as well as international development efforts to address these.", "These efforts include interventions to help individuals and communities adapt to change through climate resilient agriculture, biodiversity, and clean energy transition.", "Several international development practitioners working in these areas will visit our class as guest speakers to share insights about some of the challenges and opportunities they face in implementing their work.", "Understand the historical evolution of international development and its linkages to globalization and economic growth.", "Translate international development ideas into practical strategies via a grant writing exercise.", "Enhance your professional development and communication skills through interactions with international development practitioners.", "Global trade and development", "Guest speakers: Tiffanie Rainville and Kerry Max, Global Affairs Canada", "Adaptation and development", "FAO 2017", "This course includes the independent development and practice of specific skills.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 211, "course_code": "GEOG 207", "course_name": "GEOG207 - Climate Change Fundamentals (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Climate Change Fundamentals Winter 2025", "Climate change is one of the most profound environmental and social issues affecting communities, nations and individuals.", "Climate change is a pervasive and challenging phenomenon that can be viewed through a multitude of lenses.", "A scientific lens, for instance, reveals altered ecosystems and climatic tipping points while the lens of ethics raises the question of the right to develop and influence the well-being of others while doing so.", "By carefully laying the scientific foundations, we will explore creative, positive, nuanced visions of the future that are rooted in scientific understanding of earth systems but also capture (or at least begins a conversation about) core human values, such as equity, compassion, innovation, and connection.", "Demonstrate understanding of key elements of the climate system, and how these elements are being altered by the human emission of greenhouse gases.", "Carefully consider the impacts of climate change on both human and natural systems.", "Articulate the difference between climate change adaptation and mitigation, and understand a portfolio of actions that communities can take to respond to climate change.", "Understand the key issues at play in international climate change negotiations, as well as recent Canadian policy proposals.", "Investigate futures that are fundamentally sustainable, low-carbon, and resilient to climate change impacts.", "Week 2: Introduction to the climate system, discussion activity, quiz", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Understanding Climate Change - Digital Version", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 213, "course_code": "GEOG 219", "course_name": "GEOG219 - How Pandemics Change the World (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["How Pandemics Change the World Winter 2025", "In 2019 - 2021, the world experienced its second global pandemic in a century.", "Students will be exposed to a range of theoretical perspectives and debates and engage in a range of innovative assessment activities to illustrate their learnings.", "You will see these identified in each of the 12 learning modules; they are:", "Do (there will typically be an exercise or a case study for you to engage in that allows you to see the application of the concepts being discussed in the module)", "Define key terms related to pandemics;", "Illustrate theoretical framings and understandings of a global health pandemic;", "Value their role as a global citizen.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 214, "course_code": "GEOG 222", "course_name": "GEOG222 - Geographical Study of Canada (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["08:30AM - 09:50AM EV3 1408", "sanjay.nepal@uwaterloo.ca", "How physical, demographic, and economic geographies have combined to create unique regions within Canada.", "This course is designed to facilitate your understanding of Canada’s physical and human geographies, and to demonstrate how their intersection contributes to the creation of unique regional economic identities.", "Gain foundational knowledge about Canada's geographical, socio-economic, cultural and environmental characteristics", "2. Examine key geographic concepts which facilitate the understanding of the main regional differences across Canada", "3. Develop critical thinking and writing about space, place and the environment, with emphasis on ideas about inter-relationships, inter-dependencies and transformations in Canadian contexts", "8th edition The content will be complemented with the instructor’s research interests and experiences in the field.", "Students can rent the textbook from VitalSource at https://www.vitalsource.com/en- ca/products/the-regional-geography-of-canada-robert-m-bone-v97801990378343", "New coverage of the COVID-19 pandemic highlights the impact on Canada's health-care system, changes in tourism, and how manufacturers mass produce medical products during times of need.", "New coverageof Indigenous issues—including the impact of colonization on Indigenous communities, the Truth and Reconciliation Commission, and Indigenous governance and land claim negotiations.", "Updated chapteron the Canadian economy explores the national and global economic forces-such as NAFTA, income inequality, and the shift to clean energy-that have shaped Canada's regions.", "You may view the power point slides and complete the readings at your own pace during the identified weeks.", "This course includes the independent development and practice of specific skills, such as [developing case studies].", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 215, "course_code": "GEOG 225", "course_name": "GEOG225 - Global Environment and Health (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Students will be exposed to a range of theoretical perspectives and debates, and engage in innovative assessment activities to illustrate their learnings.", "We will then develop a keen understanding of the foundational concepts we need to be able to explore the measurement, evaluation and implications of human health-environment interactions.", "You will see these steps identified in each of the 11 learning modules as:", "Do: There will typically be an exercise or a case study for you to engage in that allows you to see the application of the concepts being discussed in the module.", "Discuss: We will engage weekly with each other through online discussion forums in order to facilitate peer learning; you should also discuss this material with others in your working and/or social worlds – what do they think about what you’re learning?", "Define key terms in environment and health.", "Illustrate theoretical framings and understandings of environment and health.", "Critically assess the reporting of environment and health relationships in the media as well as the peer-reviewed literature.", "Value their role as a global citizen.", "Introduce Yourself Discussion", "This course includes the independent development and practice of specific skills, such as written communication, demonstrating the understanding of course concepts, and developing critical thought.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 216, "course_code": "GEOG 233", "course_name": "GEOG233 - Geography of Tourism (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["08:30AM - 09:50AM AL 211", "Geographical approaches to the study of tourism and contemporary frameworks relevant to human behavior and actions in touristic landscapes will serve as the foundations to understanding tourist spaces, places and identities.", "The course will address travel and tourism at levels from local to international, with a particular emphasis on the impacts of tourism from a societal perspective (economic, environmental, socio-cultural).", "Appreciate the historical development of the travel and tourism sector, identifying key factors that influence its continued development today and into the future;", "Recognize and describe the nature of tourism from a systems perspective;", "Understand the varying types and functions of tourism organizations at an international, national, regional and local level;", "Describe the structure, content and process of a typical destination tourism policy, as well as the increasing importance of 'sustainability'; and", "B: Wednesday Sept 11 Tourism System", "Week 3 A: Monday Sept 16 Historical Development", "Week 8 A: Monday Oct 28 Travel Experiences and Sociology", "B: Wednesday Oct 30 Tourism and Death", "B: Wednesday Nov 13 Impacts: Socio-Cultural", "B: Wednesday Nov 20 Crises and Disasters", "Current Event - Video and Participation", "A", "Sept 24-27", "B-C", "D", "E-G", "H-K", "L-M", "N-R", "S-T", "U-Z", "Write a 2000-word paper that describes, explores and critically examines the attraction, incorporating materials, themes and concepts learned during the course.", "All sources must be properly identified and referenced using an appropriate citation format.", "This course includes the independent development and practice of specific skills, such as critical assessment, personal reflection, and communication.", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 217, "course_code": "GEOG 302", "course_name": "GEOG302 - Geographies of Work and Employment (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["10:00AM - 11:20AM EV1 132", "10:00AM - 11:20AM EV3 4408", "Dr. Daniel Cockayne", "To identify some of the major topics of import in the economic geography of work", "To evaluate how work can be thought of as political", "To develop primary research skills through an interview-based assignment", "Introduction to GEOG302", "September 13/14", "Cockayne", "September 20/21", "Cockayne", "Labor, class & unionization: Spotlight on Uber", "September 27/28", "Domestic labour & social reproduction", "Labour & globalization: Spotlight on the Caribbean", "Temporary work & unfreedom: Spotlight on migration", "Cockayne", "Neoliberalism & precarity: Spotlight on Gig work", "Cockayne", "Cockayne", "Spotlight on COVID-19 & the Future of Work", "Worth and Cockayne", "December 6", "Labor by Andrew Herod Available as an e-book in the UW library Yes", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 218, "course_code": "GEOG 306", "course_name": "GEOG306 - Human Dimensions of Natural Hazards (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Human Dimensions of Natural Hazards - GEOG 306 Winter 2025", "08:30AM - 09:50AM B1 271", "E. Mohammadi", "E-mail:            elham.mohammadi@uwaterloo.ca", "The physical nature of a wide range of geophysical and biophysical hazards will be explored, paying particular attention to the ways in which hazards become dangerous to humans, and the pathways by which humans can either increase or decrease their vulnerability in the face of natural hazards.", "Natural hazards and associated disasters are, in part, a product of inappropriate human modifications or management of the natural landscape.", "Throughout the course, case studies and examples drawn from countries and regions around the world will be used to clarify conceptual and methodological issues.", "Appreciate the physical processes associated with various natural hazards, with a focus on geophysical, meteorological, and hydrological hazards.", "Appreciate the key components of preparing for disasters.", "Apply knowledge to compare hazards theory with real-world case studies.", "Theme 1: Introduction", "Introduction to Course, Natural Hazards, and Disasters", "Defining and Measuring Disasters", "Theme 3: Prevention and Mitigation of Disasters", "Theme 3: Prevention and Mitigation of Disasters", "Theme 3: Prevention and Mitigation of Disasters", "Disasters in the Media and Risk Perception", "Disasters in the Media and Risk Perception Cont'd + Hazard focus: Wildfires", "Key Considerations in BBB", "Livelihoods & Psychological Recovery", "Comparative Analysis of Responses to Specific Disasters 20%", "Please note that these activities are designed to reinforce key concepts and promote collaboration.", "Description: Engage with the concept of vulnerability by crafting a compelling narrative that could be used in a media piece (e.g., news).", "Select and compare two disaster response efforts for similar events across different regions.", "The exam will take the form of multiple choice and short/medium-length written answer questions.", "Short-Term Absence Declarations", "This essentially removes the need for a short-term absence declaration, since a longer, three-day grace period has already been applied.", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 219, "course_code": "GEOG 307", "course_name": "GEOG307 - Societal Adaptation to Climate Change (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Societal Adaptation to Climate Change Winter 2025", "Recognizing that dangerous climate change cannot be avoided through greenhouse gas emissions reductions alone, adaptation to climate change has emerged as a central component of global climate policy.", "An in depth understanding of the diverse impacts of climate change on communities, economic sectors and society will provide a foundation for examining adaptation strategies to build resilience to accelerated climate change.", "Examples will draw from multiple sectors in both developed and developing world contexts, with an emphasis on solutions and the limits to adaptation.", "Understand the types of response options human societies have in light of present and future climate change", "Be aware of the differential impacts and vulnerabilities introduced by climate change, and how these interact with development outcomes.", "Critically examine the ways in which we communicate climate change", "Articulate the way climate change-related impacts, adaptation and vulnerability affect various sectors and locations", "Adaptation in the energy sector", "Guest speaker: Dr. Kitinya Kirina", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 220, "course_code": "GEOG 314", "course_name": "GEOG314 - Climate Services (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Email peter.crank@uwaterloo.ca", "This course provides an overview of the key concepts related to climate services (i.e., useful, timely, and robust information about climatic trends that can support decision-making) and the development of the United Nations' Global Framework for Climate Services.", "The value of climate-informed decision-making across diverse sectors of the economy are examined, both for climate variability and extremes today and in an era of accelerating climate change.", "The scientific and practical challenges of utilizing climate information for decision-making in government policy, community planning, business operations, and international development, as well as the technical standards and professional ethics associated with providing climate services, are examined.", "Students gain practical experience in the development and application of climate services through climate data assembly and interpretation.", "Articulate what climate models are, and how they are formulated and tuned.", "Use a hierarchy of models helps to answer critical problems in climate science.", "Apply climate models and data to a diverse range of sectors and problems.", "Skills learned will be applicable to those pursuing graduate school in a physical science discipline as well as other advanced climate research topics, including:", "The development of the Global Framework for Climate Services", "Climate variability assessment", "Climate-informed decision-making across societal sectors", "Professional ethics in providing climate services", "Global Framework for Climate Services & WG1 CH12)", "Global Framework for Climate Services", "Decadal and interannual variability", "Station data & homogenization", "IPCC WG3 Ch. 2.2-2.3", "Groups identified for TikTok-style videos", "Scenarios and global impacts", "Climate services in different sectors", "Professional ethics/standards, co-production and interpretation of climate information", "Final Project Paper - First Draft 10", "Students will need to respond to and discussion 5 posts through the term regarding the climate science and/or the sectors of climate services presented in class and via guest lectures.", "Students will be asked to used generative AI to explore how large language models are interpreting the varying opinions on climate change in the Canadian context and compare to the scientific evidence of climate change.", "To demonstrate knowledge of the climate science and data, students will be required to work in teams of 3-5 to develop Instagram Reels/TikToks which depict the current knowledge of climate science, climate models, and climate change.", "This creative content should be directed toward the general public and/or peers to educate others on the current knowledge of this field.", "To demonstrate knowledge of the application of climate services, students will need to create an infographic which describes the importance of climate data in a sector & region of the world.", "Students will work in teams of 2-3 undergraduate students with one graduate student to explore the climate services used in a particular sector of the economy/society.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 221, "course_code": "GEOG 323", "course_name": "GEOG323 - Tourism Impacts - International Perspectives (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Tourism Impacts - International Perspectives Winter 2025", "08:30AM - 09:50AM EV3 1408", "sanjay.nepal@uwaterloo.ca", "The course examines the nature, significance, and costs and benefits of tourism in the context of tourism destinations in developed and developing countries.", "It employs an international perspective to assess the economic, environmental, social, and cultural impacts of tourism in diverse settings.", "Understand broader social-science concepts relevant to the study of tourism", "Understand key concepts used in assessing and measuring the impacts of tourism", "Determine the costs and benefits of global tourism on the economy, environment, society and institutions", "Evaluate global tourism impacts at a specific destination (i.e., country) in the context of COVID-19", "Assignment – Case studies in tourism impacts", "The nature and significance of tourism", "Scope of tourism and its relationships with other sectors; changing patterns of international tourism", "21/23   Jan       Tourism Impacts - Concepts and Frameworks", "Elements of tourism; spatial and temporal concerns; frameworks for understanding the impacts of tourism", "Post-Pandemic Travel and Destinations", "Tourism Settings", "Internal and External considerations", "Tourism and Resilience", "Alternative Tourism Concepts", "Gig economy in current economic realities", "Feb 13 – Student case studies of economic impacts", "27 Feb             Environmental Impacts: Tourism-environment relationship, environmental impacts, climate change and resilience", "11/13 Mar      Environmental Impacts – Transportation and Aviation", "Mar 20 – Student case studies of environmental impacts", "Ethical and social dilemmas in tourism", "3 April          Student case studies of social/cultural impacts", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 222, "course_code": "GEOG 325", "course_name": "GEOG325 - Geographies of Health (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "02:30PM - 05:20PM", "Dr. Emily Shantz", "Email: emily.shantz@uwaterloo.ca", "Email: rcurtypereira@uwaterloo.ca", "Richard Adeleke", "Email: radeleke@uwaterloo.ca", "A critical examination of major themes related to the distribution, diffusion, determinants and delivery of health and health care with a particular emphasis on the roles of space, place and environment.", "Apply geographical concepts and theories to public health issues.", "Debate global public health issues using utilizing geographical concepts and theories.", "We will have several guest speakers in attendance throughout the term.", "These people are experts in their field and are outstanding contributors to the science around the geographies of health and health care.", "Students may lead a maximum of twice during the term.", "4 January 30 Systems of care and inequalities in access Textbook: Chapters 7, 8 E. Shantz", "11 March 27 Debate   R. Curty Pereira & E. Shantz", "12 April 3 Emerging trends in health geography & Conclusion   R. Curty Pereira & E. Shantz", "These deadlines vary, so stay tuned!", "Debate: Students will be organized into teams for an in-class debate (pro and con) about a current public health issue.", "Late policy: There will be a grace period of two days following each deadline where assignments will be accepted for marking without penalty.", "Notice of Recording", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 223, "course_code": "GEOG 336", "course_name": "GEOG336 - Space, Power, and Politics: Citizenship in a Changing World (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Space, Power, and Politics: Citizenship in a Changing World Winter 2024", "I aim to respond to emails within two business days.", "This course uses international case studies to examine how people interact with the state.", "Develop critical writing and research skills through a position paper assignment", "Mobility and transnational citizenship", "Community & citizenship", "Citizenship education and youth politics", "Citizenship & exclusion", "Environmental citizenship", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 224, "course_code": "GEOG 349", "course_name": "GEOG349 - Urban Form and Spatial Structure (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["An examination of the major factors giving rise to distinctive styles of urban spatial organization.", "The best planning practices from developing countries are being used in some western industrialized countries, and vice versa.", "Based on current globalization and learning from best planning practices worldwide, this course will offer comparative analysis of urban spatial structure and urban form, as well as administrative and regulatory implications of urbanization around world.", "Be aware of the evolution of the urban systems in each world region", "Understand the common urban problems and their possible solutions in many cities", "Become familiar with urban form and internal urban structure and how they may be demonstrated in different world cities", "Appreciate a comprehensive set of tools for understanding the changing urban forms", "Become familiar with critical thinking in urban problems and internal structure", "They can expect to learn the elements of clear thinking and to be nurtured in their development to be careful, critical, and innovative thinkers.", "Global knowledge of urban issues and overseas experience: Students should be able to demonstrate an awareness of the environmental, economic, social diversities and interdependences that exist among nations and regions.", "Advanced writing skills: Students should be able to communicate ideas clearly and cogently.", "General Introduction – World Urban Development; Concepts and Definitions", "Introduction to Cities.", "Introduction to Cities.", "WEEK 3. Cities of Middle America; Cities and Systems", "World cities under conditions of financialized globalization: Towards an augmented world city hypothesis.", "Introduction to Cities.", "Chapter 3: Social Theories of Urban Space and Place: Perspectives in the Post-World War II era.", "Introduction to Cities.", "Recommended readings: Introduction to Cities.", "Inequality and Diversity in the Post-World War II Metropolis.", "Introduction to Cities.", "Cities of Sub-Saharan Africa; Integrated transportation and land use planning", "Introduction to Cities.", "Cities of Southeast Asia; Peri-urbanism and Metropolitan Regions", "The real estate turn in policy and planning: Land monetization and the political economy of peri-urbanization in Asia.", "Introduction to Cities.", "Urbanization and Cities in Developing-country Cities.", "Cities of East Asia; Urban heritage and conservation planning", "Heritage conservation and the politics of difference.", "Heritage conservation through planning: A comparison of policies and principles in England and China.", "Cities of Australia and the Pacific Islands; Urban Poverty Alleviation", "Financial development and poverty reduction nexus: A cointegration and causality analysis in Bangladesh.", "The track of this global expedition weaves through nine major regions of the world, exploring significant urban patterns, processes, and internal spatial structure.", "Students are asked to relate the principles of sustainable urban forms to the reflections, since these principles provide a powerful framework for constructing ideas and discussions.", "The concept of urban form and principles of sustainable urban forms should be discussed in the assignment.", "A strong reflection will summarize key course concepts and principles and apply them to personal experience and perceptions.", "Discuss how these experiences have shaped your awareness of the impact of certain urban forms on people’s experience with cities in the countries that we cover in Week 2 to Week 4, your personal values, and your approach to planning/geography.", "Formatting:", "Problem-solving mentalities and skills are crucial for planners and geographers.", "These five categories of tools include 1) planning and building regulation (e.g. intensification); 2) fiscal and non-fiscal incentivization (e.g. special economic zone); 3) direct provision by public and/or voluntary sectors (e.g. public sector involvement); 4) education and awareness-raising (e.g. planning-related open houses); and 5) promotion of behavioral change (e.g. pedestrian friendly public space and TOD design).", "Please note that students must focus on one planning tool for an in-depth evaluation, even if multiple tools are involved in the chosen case.", "A strong report will comprehensively evaluate the chosen planning tool (including its functions, implementations, strengths and weaknesses, and socioeconomic consequences).", "Introduction (2 marks)", "A brief and general reflection on the comprehension and implementations of planning tools (3 marks)", "At least five references regarding the chosen planning tool should be cited.", "Formatting:", "Web searches may be helpful in identifying up-to-date factual material and empirical illustrations, but do not qualify towards an item count of reference materials].", "The essay should at least consist of an introduction, a middle portion presenting major findings, and a summary or conclusion.", "The purpose of the analysis is to present a synthesis and critical analysis of the readings and/or your own reference resources.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 225, "course_code": "GEOG 361", "course_name": "GEOG361 - Food Systems and Sustainability (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Food Systems and Sustainability Spring 2024", "S. Scott", "sdscott@uwaterloo.ca", "Instructor: Steffanie Scott", "sdscott@uwaterloo.ca", "Specific themes covered in the course include technological and genetic change in food production, resource depletion and wider environmental impacts of the industrial food system, and policy, market-oriented, and civil society initiatives to bring about change in the food system, including organic production and localizing food systems.", "No other human activity has a greater ecological impact than our food system.", "Socio-cultural, economic, and political dimensions also shape the sustainability and resilience of our food system.", "Understanding many sides of an issue places you in a stronger position to determine and defend your own ideas.", "Food system change is a topic fraught with debate, particularly in relation to balancing socio-economic and ecological considerations.", "Explain the historical development of the contemporary food system, and associated main concepts and models (e.g., community-based/regional versus globalized/industrial food systems), and", "Specifications grading scheme & grade pathway requirements", "You can always move to a lower-level grade pathway.", "Grade A Pathway Grade B Pathway Grade C Pathway Grade D Pathway Re-submissions allowed?", "*only one of the Assignment 3 options can be used", "Re-submissions", "Extensions and Late Submissions", "We will follow these instructions and automatically assess your late penalty upon grading.", "Please anticipate technical problems and leave yourself at least a 1-2 hour buffer before the deadline in case something happens when you try to submit your work.", "Save multiple versions of your work as you write in case you accidentally overwrite your file.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "This course includes the independent development and practice of specific skills, such as food systems analysis.", "Library for research-based assignments", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 226, "course_code": "GEOG 368", "course_name": "GEOG368 - Ecology and Conservation for Planning (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Ecology and Conservation for Planning Winter 2025", "02:30PM - 05:20PM", "This course provides students with a critical understanding of the relationship between human development and natural environments.", "Students will develop an understanding of core ecological principles and how these can be taken up in plans and policies to promote nature conservation in urban and rural environments.", "The course will include examples of how planners mitigate the environmental impacts of development of land, allotment of open space and parks, and conservation of sensitive areas and species in both urban and rural contexts.", "understand biophysical and ecological processes in urban areas", "plan for biophysical and ecological process when developing and managing the built environment", "Overview of syllabus and foundational concepts", "Get into groups and choose case study for weekly activities and final project", "Spatial patterns and mosaics", "Urban water systems and water bodies", "Urban habitat and vegetation", "Urban features", "Readings", "The ecological and evolutionary consequences of systemic racism in urban environments.", "ECOLOGICAL URBANISM: A FRAMEWORK FOR THE DESIGN OF RESILIENT CITIES Yes 0", "Each quiz corresponds to the theme for each week.", "The first will critically engage with a recent and important contribution from Schell et al.", "Each Reflection Paper should be approximately 500 to 1,000 words and should answer the following questions:", "The case study should describe each of the focal ecological components of the city and develop a plan to improve or enhance the sustainability of these components.", "These will vary week to week, but are designed to prepare students to complete their case study assignment.", "The complete style outline can be found in the Publication Manual of the American Psychological Association, located in the reference section in Dana Porter Library, or on sale in the Book Store.", "APA Frequently Asked Questions - http://www.apastyle.org/learn/faqs/", "University of Wisconsin-Madison Writing Centre: http://www.writing.wisc.edu", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 227, "course_code": "GEOG 411", "course_name": "GEOG411 - The Digital Economy (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["02:30PM - 05:20PM", "Email:                                       daniel.cockayne@uwaterloo.ca", "Email:               s32zaman@uwaterloo.ca", "Beginning with the infrastructures that supports digital systems and entrepreneurship, and with a close focus on entrepreneurial digital media production in Silicon Valley, this course explores the numerous ways that digital systems implicate economic systems, examining social media, attention economies, the sharing economy, digital work platforms, and influencer economies.", "Describe the digital infrastructures and systems that support the digital economy and the geographic histories of their emergence.", "Critically analyze the economic systems that are necessary conditions for modern-day digital media technologies.", "Theorize these phenomena in relation to geographical concepts including the international division of labor and difference in the global economy.", "Topics and reading", "Introduction of the course topics, assignments, and expectations.", "Producing The Digital Economy I: Silicon Valley & San Francisco", "How do we measure ‘success’ in the digital media sector?", "Recode/Decode", "Producing The Digital Economy II: Venture Capital and Inequality", "What are some of the historical and structural implications of venture capital as a financial mechanism?", "Rethinking the venture capital model.", "Social Media and Attention Economies", "Advertising and data allow these companies to run - how do they keep people interested?", "What are some of the perhaps unintended impacts of the rise of social media?", "The Culture of Connectivity: A Critical History of Social Media.", "The Gig Economy - Uber and Airbnb", "How have ‘gig economy’ platforms like Uber and Airbnb changed sectors and industries?", "Are these platforms really different from prior forms of economic activity?", "How does the gig economy relate to concepts like precarity?", "Algorithmic labor and information asymmetries: a case study of Uber drivers.", "The internet allows people to create personas online, and many have found ways to monetize these platforms for themselves, through procuring idealized performances of the self.", "Streamers and influencers make money through sponsorship and through cuts of platforms’ ad revenue.", "What are some of the implications of these shifts?", "Self-enterprising eSports: Meritocracy, precarity, and disposability of eSports players in China.", "What are some of the darker sides of entrepreneurship and privilege that characterize a many digital companies?", "How do these factors affect and implicated offline economies too?", "Content and readings TBD", "Short Analytical Essay Due", "Producing Digital Economies III: Work Platforms and The Planetary Labor Market", "Difference and dependence amongst digital workers: the case of Amazon Mechanical Turk.", "These networks are essential for the functioning of the digital economy as we know it - but they are often unthought and unspoken.", "What outsources and offshored forms of work are necessary to produce computers and smartphones?", "How are race and gender relevant for understanding our daily usage of advanced technologies?", "Indigenous circuits: Navajo women and the racialization of electronic manufacture.", "Whither labor geography and the rise of the robots?", "Social & Cultural Geography 18(3): 435-442.", "This will primarily be in the form of discussion during the weekly seminar framed around the instructor presentation and readings", "You’ll be in groups of 3-4 for discussion - the make-up of these groups may vary throughout the term", "The paper should be primarily critical/analytical in nature – it should not be primarily descriptive/summative", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 228, "course_code": "GEOG 423", "course_name": "GEOG423 - Sustainable Tourism (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["02:30PM - 05:20PM", "sanjay.nepal@uwaterloo.ca", "A broad perspective is adopted involving economic, environmental, socio-cultural sustainability and institutional sustainability.", "Critique, evaluate and articulate current sustainable tourism (ST) practices as examined through selected case studies", "Develop research, synthesis and evaluation skills", "Determine and critique sustainable tourism framework of assessment", "Date Topic Instruction Format", "Introduction and Rationale for “Out of the Box” approach to teaching and learning about ST.", "Sustainable Tourism: A Critical Assessment", "Developing a framework for ST assessment", "Lecture & Workshop", "Developing a framework for ST assessment", "Developing a framework for ST assessment", "Case study - Template development", "Selected Practices in sustainability", "Selected Practices in sustainability", "Selected Practices in sustainability", "Selected Practices in sustainability", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 229, "course_code": "GEOG 432", "course_name": "GEOG432 - Health and the Built Environment (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["08:30AM - 09:50AM EV2 2002", "Dr. Adrian Buttazzoni", "Students will learn the history and evolution of both public health and urban planning professions and academic disciplines and gain an appreciation of the theories and methods used in each.", "Introduction", "This course will trace the history and evolution of both professions, academic disciplines, and will compare both theory and methods used.", "Compare planning and public health perspectives on: history and the evolution of the disciplines; theory; methods; power and jurisdiction", "Identify and analyze interactions between natural and built environment characteristics and human health and disease", "Demonstrate interdisciplinary collaboration skills and articulate the benefits of interdisciplinary group work", "Articulate equity considerations of planning decisions and explain the extent to which equity may or may not be important in planning", "Gather and synthesize evidence and develop data-driven predictions of future urban trends.", "Online lecture material covers conceptual and empirical examples/case studies of environment and health relationships.", "Students are responsible for completing the required readings each week, and for keeping informed about course information through LEARN.", "Readings have been selected to provide a balance of breadth and depth into important course concepts.", "Jan 8 Module 1: Introduction to the Course, Equity", "Module 2: History and Evolution of Planning and Public Health", "Introduction to the Future Cities Institute", "Module 3: Theory in Planning and Public Health", "Feb 10, 12 Module 6: Cardiovascular, Muscular, and Skeletal Systems and the Built Environment", "Feb 24, 26 Module 7: Digestive System and the Built Environment", "Mar 17, 19 Module 10: Climate Change and Physiological Systems", "The role of behavioral science theory in development and implementation of public health interventions.", "Commentary: alternative cultures in planning research—from extending scientific frontiers to exploring enduring questions.", "Should planners create hierarchies of evidence?", "The value of Twitter data for determining the emotional responses of people to urban green spaces: A case study and critical evaluation.", "Supervised injection facilities in Canada: past, present, and future.", "Rather than reading on your own, we will be using Perusall – a software designed for collaborative reading where you will be annotating, questioning, and commenting on the assigned readings in groups of students.", "The completion of readings and your level and quality of engagement establish your grade.", "Remember you are communicating a complex topic to a general audience, so you will want to find a balance between the depth and accessibility of information presented.", "Be creative!", "The purpose of this exercise is to familiarize students with having to analyze and communicate complex environment and health topics to general (i.e., non-expert) audiences that in contemporary society often do not read policy reports but rather engage fact sheets, infographics, executive summaries, and other forms of high-level communications.", "Examples of fact sheets/infographics can be found on the CDC website (Spotlight Infographic section) or via these links to infographics about heart disease, adolescent health, and health status and determinants.", "You will be presenting the findings of your final reports to a guest panel of Future Cities Representatives.", "*Detailed assignment instructions can be found on LEARN", "Fact Sheet and Issue Summary", "Short-term absence declarations will be dealt with in the following ways:", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Reading the syllabus: Professors spend a LOT of time and energy creating syllabi that we think are clear, and let students know what to expect and how to prepare.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 230, "course_code": "GEOG 460", "course_name": "GEOG460 - Sustainable Food: Regional Case Study (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["08:30AM - 09:50AM B2 350", "S. Scott", "sdscott@uwaterloo.ca", "Socio-cultural, economic, and political dimensions also shape the sustainability and resilience of our global and local food systems.", "Who are the key players?", "Improved skills in systems thinking, critical reflection, diverse ways of knowing, practical application, multi-context communication, teamwork, collective action, and advocacy for sustainable food systems", "Knowledge of the evolution and contemporary characteristics of Waterloo Region’s food system, its resources, demographic and economic shifts, governance approaches, and key challenges and opportunities", "An appreciation of the legacy of colonialism on Indigenous foodways and on our ecosystem and system of food production", "An understanding of contemporary principles and approaches to sustainable food systems, and how they apply to the case study region", "Tabitha Robin, Sarah Rotz & Adrianne Xavier. 2023.", "Indigenous Food Sovereignty in Ontario: A Study of Exclusion at the Ministry of Agriculture, Food & Rural Affairs.", "If people’s needs are met in compassionate and simple ways, the environment surrounding them will prosper.", "Self-reliance becomes more feasible when we focus on non-material well-being, taking care of ourselves and others without producing or consuming unnecessary material resources.", "Also prepare a short reflection based on this video:", "à This week we will also determine groups & topics for term projects", "Exploring experiences of the food environment among immigrants living in the Region of Waterloo, Ontario.", "Life stories of food agency, health, and resilience in a rapidly gentrifying urban centre: Building a multidimensional concept of food access.", "Michel Desjardins and Ellen Desjardins. 2009.", "Earth Care can be taken to mean caring for the living soil.", "The state of the soil is often the best measure for the health and well-being of society.", "By reducing our consumption of ‘stuff’, we reduce our impact on the environment, which is the best way to care for all living things", "From cultural genocide and ecocide to food sovereignty", "National Film Board & Gary Farmer (director).", "This documentary examines the role of corn in the lives of Indigenous peoples in the Americas.", "It was respected and revered as a critical part of creation.", "Dollars & Sense: Opportunities to Strengthen Southern Ontario's Food System.", "Key findings include:", "The report makes the case for investing in the development of regional food systems and providing the supportive regulatory environment, infrastructure, and distribution networks required for these systems to flourish.", "A Call to Action for Resilient Seed Systems in Canada.", "An Exploration of the Local & Organic Food System in Perth-Waterloo-Wellington.", "Nikola Barsoum & Jodi Koberinski.", "Gardening in a Changing Climate: Understanding the Impacts of a Changing Climate in and Around the Greenbelt.", "MODULE 3 - FAIR SHARE (Set limits and redistribute surplus)", "The growth in human consumption and the accelerating extinction of species make clear the impossibility of continuous growth.", "Sometimes we need to make hard decisions and consider what enough is.", "Farmers Breakfast Panel: Discussion with Ontario Mennonites in Agriculture.", "Gardens for Healthy Schools: A Scan of School Gardens in Waterloo Region.", "-- See section with Chef Thompson Tran (of The Wooden Boat Food Company) and Court Desautels (of The Neighbourhood Group & Borealis restaurant) (the last two speakers in this panel; 0:49:19 to 1:23:28).", "Generating change: multisectoral perspectives of key facilitators and barriers to food system policy making.", "Journal of Hunger & Environmental Nutrition, 7(2-3), pp.137-148.", "Carbon footprint of dietary patterns in Ontario, Canada: A case study based on actual food consumption.", "Incorporating policies for a healthy food system into land use planning: The case of Waterloo Region, Canada.", "Assessment & Specifications Grading", "The rationale for specifications grading is five-fold:", "Re-submission opportunities encourages risk-taking, creativity, and \"outside the box\" thinking.", "Specifications grading is typically preferred by students over the traditional grading systems due to these factors:", "it feels more like coaching, and", "Earning a high mark in this course means that you demonstrated competency across multiple learning outcomes and objectives.", "Re-submissions", "Term project: If any parts of your term project submissions do not receive a \"credit\" the first time, you will be given one chance (for each part) to resubmit without penalty.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 231, "course_code": "GEOG 462", "course_name": "GEOG462 - Global Food and Agricultural Politics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["04:00PM - 05:20PM", "Email: cmmcglad@uwaterloo.ca", "Demonstrate a working knowledge of the history of the industrialization of food and agriculture.", "Demonstrate knowledge of the main features of the issues and actors in global food politics from production to consumption.", "Identify the main features and scales of food security and food sovereignty and explain how they are changing with reference to global politics and governance processes.", "Assess the significance of global actors, and their impacts within specific issue-areas", "Facing the Food Systems Summit - Panel Recording; found here: https://www.youtube.com/watch?v=9uE_AdSB5qk", "“Sustainably Sourced Junk Food?", "Agriculture and Human Values 33 (3): 537-48.", "“The Dynamics of the Contemporary Governance of the World’s Food Supply and the Challenges of Policy Redirection.", "Global Environmental Politics", "Toward Indigenous visions of nature-based solutions: an exploration into Canadian federal climate policy.", "identified the key elements of the review; and", "A class reflection of food systems transformation and global food politics.", "No Assigned Readings", "Assigned readings should be read before the relevant classes.", "CFS and Issue Analysis Report 25", "A weekly summary involves outlining the following components for each article or chapter assigned for that week’s readings.", "A list of key concepts and terms with definitions (five to seven in total).", "A summary of the author’s main argument(s) (four sentences maximum) stated in your own words (for each reading that week).", "Critical analysis of the readings will follow in class during discussions.", "Summaries should be roughly 500 words in total, with a maximum of 750 words.", "This may involve describing unique aspects of the papers, simplifying any technical elements of the papers and asking questions to spark discussion.", "As the discussion unfolds, the discussants will be responsible for synthesizing points made by their peers and steering the discussion in a fruitful manner.", "The report should be between 2000 – 2500 words and should include works cited in APA format.", "This assignment should be approximately 2500-3000 words in length (excluding references).", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments consider students' well-being to be extremely important."]}, {"course_id": 232, "course_code": "GER 100", "course_name": "GER100 - Zeitgeist and Popular Culture (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Zeitgeist and Popular Culture Fall 2023", "10:00AM - 11:20AM EV3 3412", "Email: pmalone@uwaterloo.ca", "An introduction to life, society, and culture in the German-speaking countries, particularly modern Germany and Austria, focussing on popular culture since 1945 and its response to the historical and social context.", "DEFINE the term \"popular culture\" and contrast different theoretical approaches to it", "TRACE how different media developed in the postwar German-speaking countries", "IDENTIFY and REMEMBER some key facts of postwar political development in German-speaking Europe", "UNDERSTAND cultural activities and products, and thus members of the culture, as shaped by historical events, outside cultural influence, and specific discourses", "2a 13 Sept.  The Adenauer Era; Americanization and Anti-Americanism  Nolan;", "5a 4 Oct. Singer-Songwriters in West Germany; Regulating Popular Music in East Germany Schmidt; Littlejohn;", "6a 18 Oct.  Television: Police Dramas and Science Fiction in West Germany Mattson;", "The Eighties and Nineties", "Stehle and Weber]", "Readings in square brackets are optional.", "Two Short Papers", "There are four options:", "The final exam is “factual” in the sense that it tests your retention and understanding of information presented in both the readings and the lectures.", "The questions for the exam will be given out in the final class of term so that you can prepare your answers.", "UW is a Mask-Friendly Campus: You are strongly encouraged to wear a mask when you are in close contact with others.", "In case cancellation of further in-person classes becomes necessary (whether for the particular course or University-wide), GER 100 will be taught synchronously online via Zoom during the regular teaching times for the remainder of the term.", "Intellectual property includes items such as:", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "This course includes the independent development and practice of specific skills, such as historical knowledge and critical thinking.", "Library for research-based assignments"]}, {"course_id": 233, "course_code": "GER 120", "course_name": "GER120 - Once Upon a Fairy Tale: Fairy Tales, Then and Now (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Describe the specific features of folk fairy tales (elements common to many types of folk fairy tales, elements specific to particular types of folk fairy tales)", "Regular Deadlines", "bask in the satisfaction of completing a task on time", "Sometimes life gets in the way of your studies.", "Do you want professors and interviewers to call you by a different first name?", "Counselling Services: Counselling Services provides in-person services as well as through phone and video.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 235, "course_code": "GER 200", "course_name": "GER200 - Transcultural Studies (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Prof. James Skidmore", "This term we’ll be exploring transculturality in two ways: we’ll examine different aspects of transcultural theory on their own terms, and we’ll use these ideas to analyze some fictional narratives about migration and cultural interaction.", "describe the key concepts of transcultural studies.", "analyze complex cultural issues with greater precision and insight.", "I HAVE QUESTIONS!", "I HAVE ANSWERS!", "Cross-listed courses", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 236, "course_code": "GER 230", "course_name": "GER230 - Vikings! (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Now known in contemporary popular culture chiefly as raiders, in this time period Norse culture expanded in Europe and the North Atlantic by means of trading and raiding, meddling and settling, and in the process changing in profound ways the shape of the medieval world and so the shape of the world today.", "by reading a wide variety of sources;", "by means of formal and informal writing; and", "Students will increase their proficiency in reading English prose and in writing well-supported, fair-minded, accurate, and cogent English prose.", "Introduction and Perspectives Week 1: Introduction to Learning About Vikings!", "Week 3: Introduction to Icelandic Family Sagas Week 3 Discussion"]}, {"course_id": 249, "course_code": "GERON 201", "course_name": "GERON201 - Aging and Health (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["04:00PM - 05:20PM", "A basic understanding of the physical aging process is explored, distinguishing between pathological states/illness and normal change.", "Blended courses are designed to integrate online activities and face-to-face class time to leverage the advantages of each type of instructional modality.", "Evidence supports blended learning as an effective way to learn because it:", "Describe population aging and its impact on society in Canada and worldwide.", "Collaboration", "A slip day is a 24-hour grace period.", "Students can self-declare the following types of absences in Quest.", "This implies that these are integral components of a successful higher education:", "If necessary, you are responsible to seek training in these skills at campus workshops.", "In the case of a submission discrepancy you will be required to provide that email as proof of submission.", "Students who believe they provided valid answers that have not been addressed by the TA are invited to make a case to the instructor after an initial discussion with the TA.", "This course includes the independent development and practice of specific skills, such as searching and identifying relevant information and images, synthesizing ideas, developing logical arguments, and clearly and accurately communicating your ideas.", "Library for research-based assignments", "If you have a name and/or set of pronouns that differ from those that appear in your official university record; and", "You may experience stressors that can impact your personal well-being and academic experience, but there are multiple supports and resources available to you on and off-campus.", "As students, you and those close to you may experience a range of issues that can cause barriers to well-being and learning.", "Everyone needs a support system.", "Accommodations for Racial Trauma", "Have you experienced impacts of racism, racial trauma, racial violence, and are looking for academic accommodation options related to those experiences and impacts?", "A land acknowledgement is a small step towards reconciliation and needs to followed by actions, such as education.", "We recognize aging as an embedded personal history, and the impact of history in the lived experience of older adults, particularly those with past and present histories of oppression and colonialism.", "We acknowledge the historical and current presence and land rights of Indigenous peoples within Canada.", "Intellectual Property and Copyright", "Intellectual property includes items such as:"]}, {"course_id": 252, "course_code": "GERON 245", "course_name": "GERON245 - Canadian Health Systems (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Canadian Health Systems Winter 2025", "10:00AM - 11:20AM EXP 1689", "Accommodation requests", "Email: eneiterman@uwaterloo.ca", "Email: mbneeb@uwaterloo.ca.", "Many of us are critical of the Canadian health care system, but probably just as many have a strong sense of pride in Medicare.", "Utilizing social theory, we will explore how health systems are organized in Canada and what factors shape the development and implementation of health services.", "Describe social factors that shaped the distribution of labour among health care professionals in Canada;", "Describe and critically assess Canadian approach to growing aging population;", "Identify factors shaping Canadians’ access to formal and informal health care services; and", "Describe the major reforms in the Canadian health care systems.", "You are in the Spotlight", "You are in the Spotlight", "You are in the Spotlight", "You are in the Spotlight", "You are in the Spotlight", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 253, "course_code": "GERON 352", "course_name": "GERON352 - Sociology of Aging (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Email: eneiterman@uwaterloo.ca", "Email: smakarim@uwaterloo.ca", "Email: s5leslie@uwaterloo.ca", "Elizabeth Wang", "Email: e69wang@uwaterloo.ca", "Email:  t4joshi@uwaterloo.ca", "KIN 352: View requirements for KIN 352", "REC 362: View requirements for REC 362", "In the first part of the course, we will learn to understand aging as a socially constructed phenomenon.", "In the final part of the course, we will critically assess the social and financial supports available to older adults in our society.", "Explain why aging can be considered a socially constructed phenomenon", "Explain why Canadian population is aging and what contributes to this trend", "Identify and summarize some of the theories in social gerontology", "Describe major sources of social inequalities that impact individuals in old age", "Describe how major social institutions shape the aging process", "Define and explain healthy and successful aging", "Explain the role of family and social support in the lives of older adults", "Identify major challenges in the end-of-life issues experienced by older adults", "Enhance research, writing, and critical appraisal skills", "Introduction to Course Course Outline", "Sociological Perspectives and Aging Theories", "Immigration and Aging", "Physical and social activity in later life", "Older Persons and their Family Roles", "I can ask you questions that test your understanding of the readings, lectures, and class discussions, and assess your level of comprehension in relation to that of your peers.", "The goal of this assignment is to explore how the aging process is shaped by social and individual factors and to try yourself as a researcher in the field of social gerontology.", "Letter of Information and Consent Form", "Interview guide", "We will practice the technique of semi-structured qualitative interviewing during the workshop in class.", "If this is the case, students must clearly identify each interviewer, as each student will receive an individual grade for the assignment", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 255, "course_code": "HLTH 101", "course_name": "HLTH101 - Introduction to Health 1 (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Health 1 Fall 2024", "K. Bishop-Williams", "Instructor: Kate Bishop-Williams", "This course will be of interest to students pursuing careers in health and those with a general interest in health and health care.", "Emphasis is on understanding the origins, factors and conditions that determine health throughout the lifespan, how these factors influence one another and the role/impact of health care.", "The Association of Faculties of Medicine in Canada (AFMC)", "As students, you and those close to you may experience a range of issues that can cause barriers to well-being and learning.", "Accommodations for Racial Trauma", "Have you experienced impacts of racism, racial trauma, racial violence, and are looking for academic accommodation options related to those experiences and impacts?", "Athletics and Recreation", "Empower Me - Student Assistance Program", "Office of Equity, Diversity, Inclusion & Anti-racism (EDI-R)", "Sexual Violence Prevention & Response Office", "You cannot split up each 24-hour slip day into a smaller number of hours amongst the assignments.", "Missed Discussions", "If you completely miss a week of one of these LEARN Discussions, you cannot make up the missed discussion.", "This discussion will simply be dropped and not counted towards your overall course grade.", "I acknowledge that most of the knowledge in health sciences taught in this course and others has been historically based a subset of privileged (mostly white, male) voices."]}, {"course_id": 256, "course_code": "HLTH 102", "course_name": "HLTH102 - Introduction to Health 2 (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Health 2 Winter 2025", "08:30AM - 09:50AM M3 1006", "This course expands upon the general concepts introduced in HLTH101 while extending the discussion to include issues such as: additional barriers to health; disease prevention; and methods used to plan, monitor, and improve individual and population health.", "Understand and define fundamental concepts underlying public health practice;", "Analyze the relationships between determinants of health and health status, using core public health principles;", "Examine and apply theories, concepts and models of health promotion in addressing determinants of health;", "Understand the major modifiable determinants of chronic disease in Canada and the impact that those chronic diseases have on individual and population health;", "Describe how the environments and group characteristics can affect the health of individuals and populations; and,", "Understand the breadth of health interventions and the difference between clinical interventions, individual behaviour change interventions, and population-level interventions.", "January 7                 Topic 1 - Introduction", "January 16 Topic 4 - Alcohol and Cannabis", "February 11 No class - study for your mid-term", "February 25 Topic 11 - Social Determinants of Health", "March 13 Topic 16 - Diabetes", "April 3 No class - study for your final exam", "WEEK 3 (January 20-24) Tutorial 2 – Important Information for First-Year Health students", "Exams", "These exams are designed to assess comprehension and understanding of the core concepts covered for each course topic, which include both lecture and reading materials.", "Final examination: In most situations, you will need to write a make-up final exam during the registrar-scheduled make-up exam days.", "Anti-racism Statement", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Additionally, University life can be difficult with multiple demands.", "You may experience stressors that can impact your personal well-being and academic experience, but there are multiple supports and resources available to you on and off-campus.", "Intellectual property includes items such as:"]}, {"course_id": 257, "course_code": "HLTH 201", "course_name": "HLTH201 - Aging and Health (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["04:00PM - 05:20PM", "A basic understanding of the physical aging process is explored, distinguishing between pathological states/illness and normal change.", "Blended courses are designed to integrate online activities and face-to-face class time to leverage the advantages of each type of instructional modality.", "Evidence supports blended learning as an effective way to learn because it:", "Describe population aging and its impact on society in Canada and worldwide.", "Collaboration", "A slip day is a 24-hour grace period.", "Students can self-declare the following types of absences in Quest.", "This implies that these are integral components of a successful higher education:", "If necessary, you are responsible to seek training in these skills at campus workshops.", "In the case of a submission discrepancy you will be required to provide that email as proof of submission.", "Students who believe they provided valid answers that have not been addressed by the TA are invited to make a case to the instructor after an initial discussion with the TA.", "This course includes the independent development and practice of specific skills, such as searching and identifying relevant information and images, synthesizing ideas, developing logical arguments, and clearly and accurately communicating your ideas.", "Library for research-based assignments", "If you have a name and/or set of pronouns that differ from those that appear in your official university record; and", "You may experience stressors that can impact your personal well-being and academic experience, but there are multiple supports and resources available to you on and off-campus.", "As students, you and those close to you may experience a range of issues that can cause barriers to well-being and learning.", "Everyone needs a support system.", "Accommodations for Racial Trauma", "Have you experienced impacts of racism, racial trauma, racial violence, and are looking for academic accommodation options related to those experiences and impacts?", "A land acknowledgement is a small step towards reconciliation and needs to followed by actions, such as education.", "We recognize aging as an embedded personal history, and the impact of history in the lived experience of older adults, particularly those with past and present histories of oppression and colonialism.", "We acknowledge the historical and current presence and land rights of Indigenous peoples within Canada.", "Intellectual Property and Copyright", "Intellectual property includes items such as:"]}, {"course_id": 260, "course_code": "HLTH 245", "course_name": "HLTH245 - Canadian Health Systems (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Canadian Health Systems Winter 2025", "10:00AM - 11:20AM EXP 1689", "Accommodation requests", "Email: eneiterman@uwaterloo.ca", "Email: mbneeb@uwaterloo.ca.", "Many of us are critical of the Canadian health care system, but probably just as many have a strong sense of pride in Medicare.", "Utilizing social theory, we will explore how health systems are organized in Canada and what factors shape the development and implementation of health services.", "Describe social factors that shaped the distribution of labour among health care professionals in Canada;", "Describe and critically assess Canadian approach to growing aging population;", "Identify factors shaping Canadians’ access to formal and informal health care services; and", "Describe the major reforms in the Canadian health care systems.", "You are in the Spotlight", "You are in the Spotlight", "You are in the Spotlight", "You are in the Spotlight", "You are in the Spotlight", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 262, "course_code": "HLTH 260", "course_name": "HLTH260 - Social Determinants of Health (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Social Determinants of Health Winter 2025", "Dominique Basque    dbasque@uwaterloo.ca", "These inequalities can be seen across various axes including gender, ethnicity, and access to material resources.", "3) Construct and practice engaging in conversations that effectively articulate/explain the social determinants of health and their impacts", "6) Practice using the concepts of respectful dialogue and discussion with peers/class", "Introduction", "Feb 3 Drug Addiction", "'The Life you Want' Addiction and the Far North", "-15 min)", "Prison, Police, and the Carceral System", "Climate and SDH:"]}, {"course_id": 263, "course_code": "HLTH 301", "course_name": "HLTH301 - Applied Health Promotion: Theory and Community Engagement (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Email:  eneiterman@uwaterloo.ca", "This course introduces health promotion history, theories, and change strategies that address individual-level behaviour plus sociocultural, economic, political, and environmental conditions and resources for health that impact communities and foster engagement, empowerment, and functional collaborations.", "During the first part of the course, you will be introduced to the history, theories, and models of health promotion.", "Summarize the key points in history of health promotion in Canada", "Describe current developments in health promotion policy and practice", "Identify social, economic, political, and cultural factors influencing health promotion", "Describe and critically appraise various models and theories used in health promotion", "11 Mar 25, 27 Health Promotion in Surveillance Society Engagement # 10   2.5%", "For instance, you would need to remember the key concepts from Health Belief Model or Stages of Change theory.", "I can ask you questions that test your understanding of the readings, lectures, and class discussions, and assess your level of comprehension in relation to that of your peers.", "Quizzes will be “open-book”, but I expect you to do them individually and not collaborate with your peers when answering the questions.", "I grew up in an education system where oral examination and open-ended questions were the norm.", "Eventually, I managed to find my own “system” of doing multiple choice questions.", "Each week, we will be working on a case study or another engagement activity to deepen your understanding of the learned material.", "You will be working in groups and submit your work for evaluation.", "I want this course to be relevant to your future careers and to your personal lives.", "PROJECT DELIVERABLES AND DUE DATES:", "Library for research-based assignments"]}, {"course_id": 264, "course_code": "HLTH 352", "course_name": "HLTH352 - Sociology of Aging (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Email: eneiterman@uwaterloo.ca", "Email: smakarim@uwaterloo.ca", "Email: s5leslie@uwaterloo.ca", "Elizabeth Wang", "Email: e69wang@uwaterloo.ca", "Email:  t4joshi@uwaterloo.ca", "KIN 352: View requirements for KIN 352", "REC 362: View requirements for REC 362", "In the first part of the course, we will learn to understand aging as a socially constructed phenomenon.", "In the final part of the course, we will critically assess the social and financial supports available to older adults in our society.", "Explain why aging can be considered a socially constructed phenomenon", "Explain why Canadian population is aging and what contributes to this trend", "Identify and summarize some of the theories in social gerontology", "Describe major sources of social inequalities that impact individuals in old age", "Describe how major social institutions shape the aging process", "Define and explain healthy and successful aging", "Explain the role of family and social support in the lives of older adults", "Identify major challenges in the end-of-life issues experienced by older adults", "Enhance research, writing, and critical appraisal skills", "Introduction to Course Course Outline", "Sociological Perspectives and Aging Theories", "Immigration and Aging", "Physical and social activity in later life", "Older Persons and their Family Roles", "I can ask you questions that test your understanding of the readings, lectures, and class discussions, and assess your level of comprehension in relation to that of your peers.", "The goal of this assignment is to explore how the aging process is shaped by social and individual factors and to try yourself as a researcher in the field of social gerontology.", "Letter of Information and Consent Form", "Interview guide", "We will practice the technique of semi-structured qualitative interviewing during the workshop in class.", "If this is the case, students must clearly identify each interviewer, as each student will receive an individual grade for the assignment", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 265, "course_code": "HLTH 380", "course_name": "HLTH380 - Applied Public Health Ethics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Email:  eneiterman@uwaterloo.ca", "The course begins by considering canonical ethical theories and frameworks for applying these theories to population health.", "In health, we often have to make moral and ethical decisions related to allocation of health services, development of policies and practices, or management and provision of care.", "Describe classical ethical theories and explain their importance for public health ethics", "Apply ethical theories to the analysis of public health issues in Canada", "Identify the conflict between public health practice and individual autonomy", "Connect public health and professional practice to ethics-related considerations", "Identify the challenges of ethical provision of public health services to communities experiencing oppression and marginalization", "Explain the relevance of social structures to ethical decision-making in public health", "2 Sep 9-11 Ethical theory and its role in public health ethics  Chapter 1", "4 Sep 23-25 Communication in public health and clinical encounters  Chapter 3", "Bioethics in Canada: A Philosophical Introduction.", "In this class, we will be tackling a lot of complex bioethical issues that are best dealt with in open discussions.", "Each week, we will be working on a case study or another engagement activity to deepen your understanding of the learned material.", "You will be working in groups and submit your work for evaluation."]}, {"course_id": 267, "course_code": "HLTH 420", "course_name": "HLTH420 - Health and the Built Environment (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["08:30AM - 09:50AM EV2 2002", "Dr. Adrian Buttazzoni", "Students will learn the history and evolution of both public health and urban planning professions and academic disciplines and gain an appreciation of the theories and methods used in each.", "Introduction", "This course will trace the history and evolution of both professions, academic disciplines, and will compare both theory and methods used.", "Compare planning and public health perspectives on: history and the evolution of the disciplines; theory; methods; power and jurisdiction", "Identify and analyze interactions between natural and built environment characteristics and human health and disease", "Demonstrate interdisciplinary collaboration skills and articulate the benefits of interdisciplinary group work", "Articulate equity considerations of planning decisions and explain the extent to which equity may or may not be important in planning", "Gather and synthesize evidence and develop data-driven predictions of future urban trends.", "Online lecture material covers conceptual and empirical examples/case studies of environment and health relationships.", "Students are responsible for completing the required readings each week, and for keeping informed about course information through LEARN.", "Readings have been selected to provide a balance of breadth and depth into important course concepts.", "Jan 8 Module 1: Introduction to the Course, Equity", "Module 2: History and Evolution of Planning and Public Health", "Introduction to the Future Cities Institute", "Module 3: Theory in Planning and Public Health", "Feb 10, 12 Module 6: Cardiovascular, Muscular, and Skeletal Systems and the Built Environment", "Feb 24, 26 Module 7: Digestive System and the Built Environment", "Mar 17, 19 Module 10: Climate Change and Physiological Systems", "The role of behavioral science theory in development and implementation of public health interventions.", "Commentary: alternative cultures in planning research—from extending scientific frontiers to exploring enduring questions.", "Should planners create hierarchies of evidence?", "The value of Twitter data for determining the emotional responses of people to urban green spaces: A case study and critical evaluation.", "Supervised injection facilities in Canada: past, present, and future.", "Rather than reading on your own, we will be using Perusall – a software designed for collaborative reading where you will be annotating, questioning, and commenting on the assigned readings in groups of students.", "The completion of readings and your level and quality of engagement establish your grade.", "Remember you are communicating a complex topic to a general audience, so you will want to find a balance between the depth and accessibility of information presented.", "Be creative!", "The purpose of this exercise is to familiarize students with having to analyze and communicate complex environment and health topics to general (i.e., non-expert) audiences that in contemporary society often do not read policy reports but rather engage fact sheets, infographics, executive summaries, and other forms of high-level communications.", "Examples of fact sheets/infographics can be found on the CDC website (Spotlight Infographic section) or via these links to infographics about heart disease, adolescent health, and health status and determinants.", "You will be presenting the findings of your final reports to a guest panel of Future Cities Representatives.", "*Detailed assignment instructions can be found on LEARN", "Fact Sheet and Issue Summary", "Short-term absence declarations will be dealt with in the following ways:", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Reading the syllabus: Professors spend a LOT of time and energy creating syllabi that we think are clear, and let students know what to expect and how to prepare.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 268, "course_code": "HRM 200", "course_name": "HRM200 - Basic Human Resources Management (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Reviews the role of human resources administration in organizations and the manner in which human resources executives contribute to the well-being of a total enterprise.", "For students who are pursuing the Certified Human Resources Professional (CHRP) certification, this is a core course.", "HR policies and practices significantly impact the bottom line and an organization’s overall performance.", "The course will examine the evolution of HR from a primarily administrative function to a strategic partner and decision maker in the organization.", "Increase your understanding and appreciation of the Human Resources function and its role in an organization.", "Identify Human Resource issues facing organizations and line managers through textbook examples and real-life experiences of the instructor and develop insights on what it is like to work in the Human Resource profession.", "Readings", "Module 2: HR Technology and Designing and Analyzing Jobs Chapter 3", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Reference", "There are two written Case Applications in HRM 200 and I want to make it very clear that these written assignments are to be your own original work which means that:", "This course includes the independent development and practice of specific skills, such as Communication, Listening, Conflict Resolution, Cultural Awareness & Sensitivity, Decision Making, Employee Relations and Employment Law & Legislation.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 270, "course_code": "HRTS 201", "course_name": "HRTS201 - Foundations and Critiques of Human Rights (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Foundations and Critiques of Human Rights Fall 2024", "08:30AM - 09:50AM UTD 201A", "A historical and cross-cultural overview and critique of the bases for human rights.", "Students will be introduced to a variety of interdisciplinary perspectives through which they will develop an understanding of philosophical and political critiques of human rights.", "Are these the best questions to ask?", "compare and contrast different approaches to human rights", "Introduction", "Make a clear overarching argument.", "Using the 7th edition of the APA manual, correct as many errors as you can find in the course outline’s readings!", "Rubric", "Bentham, J. Anarchical Fallacies: A Critical Examination of the Declaration of Rights", "Monday 30th Sept", "In Defense of the Indians", "https://www.jackyfleming.co.uk/cartoons/", "Mary Wollstonecraft (1792) Excerpt from A Vindication of the Rights of Woman", "1,500-2,500 words excluding title page and reference section.", "Your essay cannot pass if it is below the minimum word count!", "Rubric", "APA compliance                                                                       10", "Total                                                                                        90", "Elizabeth Zechenter, E 1997 “In the Name of Culture: Cultural Relativism and the Abuse of the Individual", "Xiarong Li Asian Values and the Universality of Human Rights Report from the Institute for Philosophy and Publick Policy 16:2                    18-23", "Have a clear overarching argument.", "Ensure APA 7th edition compliance.", "2,000-3,500 words excluding title page and references.", "Your essay cannot pass if it is below the minimum word count!", "Rubric", "APA compliance                                               10", "Clarity and quality of four main points               15", "What are its strengths and weaknesses?", "The African human rights system: A critical evaluation."]}, {"course_id": 274, "course_code": "HRTS 302", "course_name": "HRTS302 - Critical Approaches to Contemporary Human Rights Issues (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Critical Approaches to Contemporary Human Rights Issues Winter 2023", "This course offers students an opportunity to engage in advanced critical examination of philosophical, legal, and political debates underpinning some key contemporary human rights issues.", "To this end, this course focuses on three contemporary issues: the ramifications of technology, the internet and social media for privacy and personal control over one’s own information; sexual and gender identity; and the growing jurisprudence around the relationships between humans and non-humans at a time of climate destruction.", "The first issue involves a right not to be, a right to be forgotten or erased.", "ideas about rights as freedoms, freedoms and rights, and conceptualising these within heterodox demands for a society predicated on care and relationships rather than property and profit", "queer and feminist theory and activism", "Summarise facts", "Week 1                       Introduction", "Are freedoms rights?", "Is freedom without care possible?", "The Right to be “Forgotten”", "How can we fight Big Data?", "African scholars and activists expose presumptions (colonial and nationalist) about sexual orientation and gender identity (SOGI).", "The Right to Exist, Persist and Regenerate", "What are the differences between an anthropocentric and a biocentric conceptualisation of the law and of rights?", "Data and the Right not to Be", "The right to be forgotten - worth remembering?", "Data retention and the panoptic society: the social benefits of forgetfulness.", "Children and the “Right to be Forgotten”: what the right to erasure means for European children, and why Australian children should be afforded a similar right.", "Gender transition: is there a right to be forgotten?", "A critical analysis of the “Right to be forgotten” in Big Data practice.", "Same-sex marriage and the (re)making of hegemonic masculinities and femininities in South Africa.", "Nongayindoda: moving beyond gender in a South African context.", "Conceptualizing gender: The Eurocentric foundations of feminist concepts and the challenges of African epistemologies.", "Natural Resources & Environment, 32(4).", "In a minimum of 120 and a maximum of 220 words, what is it about?", "In a minimum of 120 and a maximum of 220 words, what is it about?", "In a minimum of 150 and a maximum of 250 words, what is it about?", "Choice, understanding and integration of news story                        20", "Understanding, application and synthesis of readings                       20", "What is the significance of the rights of nature?", "Understanding, application and synthesis of readings                       20", "https://www.rightsofnaturetribunal.org/"]}, {"course_id": 284, "course_code": "INDEV 100", "course_name": "INDEV100 - Introduction to International Development (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to International Development Fall 2023", "Students obtain an overview of the multi-dimensional and transdisciplinary nature of development.", "Themes include theories and strategies of development; history of development; relevance of context (culture, economics, and politics); the impact of law and international regulatory bodies; environmental influences; urbanization; the factors of health, literacy and violence; development agencies.", "Reference is made to particular development problems in specific developing countries.", "Discriminatory and intolerant language is unacceptable, but openness about these complicated issues is encouraged using thoughtful and respectful language.", "You can expect the instructor to respond to emails within 48 hours exclusive of weekends and holidays.", "To identify and critique the history of International Development concepts, theories, actors, and institutions.", "To explain and assess key development issues in the field of International Development.", "Is International Development legitimate?", "Tentative guest speakers are also indicated in the schedule below.", "Sep 21 Colonialism and Post-Development   Haslam et al.", "Nov 24 Tutorial: The City Water Index & the multi-facetedness of development issues.", "12 Nov 28 Democracy in Development   Haslam et al.", "Introduction to International Development: Approaches, Actors, Issues and Practices.", "Participation is defined in this course as frequent and relevant contributions to in-class discussions, in the form of either questions or comments, that provide new critical insight or knowledge and foster an environment of inclusivity and respect in the classroom.", "Each quiz has 20 multiple-choice questions which cover the main concepts and ideas of the section of the curriculum.", "Do not email the instructor until you have read and completed the following.", "Please be sure to read the rubric before starting your assignment.", "your name and student number;", "**Please note that your mark can be raised, lowered, or remain the same through a re-grade**", "*", "*", "* Please submit your paper for consideration by email to the instructor no later than one week following your receipt of the decision by the TA.", "Include a formal business letter that includes the following information:", "your name and student number;", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 285, "course_code": "INDEV 101", "course_name": "INDEV101 - Issues in International Development (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Issues in International Development Winter 2024", "The impacts of poverty manifest differently depending on culture, technology, geo-political factors and globalization.", "To provide students with a strong foundation in a broad range of issues in international development", "To initiate a critical analysis and assessment of these issues through the application of critical concepts.", "Week 1 January 08: The theory and practice of Development", "83-88", "235-243", "Week 4 January 29: Environment and Development", "Week 8 February 26: Sustainable Development", "Week 11 March 18: Entrepreneurship and Innovation", "Week 12 March 25: Decolonizing Development", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 286, "course_code": "INDEV 200", "course_name": "INDEV200 - The Political Economy of Development (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["The Political Economy of Development Fall 2024", "E-mail: imorales@uwaterloo.ca", "This course develops students' understanding of how the complex interplay of international economic and political economy factors influence development initiatives and outcomes.", "How is it that you came to be a political economist?", "Well, if you believe in ‘development’ it logically follows that you believe in change: changing from an undesirable condition to an improved condition is commonly thought of as ‘development’.", "Effecting change in such a situation requires a combination of social acceptance and economic capacity.", "Your approach may emphasize one or the other, but without the buy-in of key social actors your plan will fail no matter how well-equipped you are financially, technologically, or in terms of the resource base; conversely, without the ability to marshal key resources, all the buy-in in the world cannot lead to successful implementation of your plan.", "In effect, you are theorizing about the relationship between and among your key variables: you are constructing a theory of political economy!", "Or perhaps you feel that without a fundamental alteration in the political structure of a society or with the current unequal allocation of resources, there can be no broad-based positive change.", "What’s a development practitioner to do?!", "In this course you will be introduced to political economy’s (i) key concepts; and (ii) different theoretical approaches in historical and contemporary context.", "We do this not just to give you an overall description of the world of international development, but to assist you in understanding why things are the way they are, why different actors have tried to change the situation in particular ways, and what perhaps still remains to be done.", "(a) a solid understanding of political economy;", "(b) a good general knowledge of the main issues in the political economy of international development;", "(c) a good general knowledge of the key actors, forces and factors in international development;", "(f) an improved skill set for informing better policy making, be it for a state, a civil society organization or a private sector company.", "Introductory Overview: Models and Tools of Political Economy", "Social Organization and Development", "WEEK 7               Oct 24                Civil Society & Social Movements", "WEEK 9               Nov 7                 Civil Society/Social Movements/Private Sector case study", "The readings consist of peer-reviewed journal articles selected specifically for each topic.", "The readings are not meant to be just a colourful background to the lectures.", "Please read the Discussion Rubric at the end of the syllabus for guidance on how to perform in a seminar-style class.", "What developmental challenge concerns you?", "This prestep requires you to send the instructor an email with a working title of your research paper and a one sentence motivation regarding the topic.", "• Write three or four sentences under each topic heading, outlining what information will appear here and why, citing links to the sources that you will use in gathering the information shown here;", "The essay should be approximately 2000-2500 words in length.", "A first class essay reflects the format of a first-class peer-reviewed journal article.", "EXCELLENT", "The paper takes a clear position on a well articulated issue", "Relevance and sufficiency", "The paper focuses on the topic and covers significant areas sufficiently to support the argument", "The argument and analysis are logically laid out and easily followed", "EXCELLENT", "The essay is well-organised in terms of its basic shape, use of headings and sub-headings, use of adequate and proper footnotes or endnotes, and bibliography", "Paragraph construction", "The paper’s shape and form mirrors research papers as published in scientific journals", "Discussion Interaction", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 287, "course_code": "INDEV 212", "course_name": "INDEV212 - Problem-Solving for Development (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Email: rob.gorbet@uwaterloo.ca", "Collaboration and teamwork are essential for solving complex, real-world problems and are therefore in high demand by employers.", "View requirements for INTEG 210", "Students will obtain an understanding of the fundamental features of creative thinking, decision-making and problem-solving from both a descriptive and a normative point of view.", "Techniques for analyzing problem-solving and decision-making by individuals and groups with particular attention to the impact of cultural difference among individuals and within teams.", "Techniques for improving problem-solving and decision-making in a community development context will be considered.", "Effective negotiation in different cultural contexts will be studied.", "Collaboration is essential for solving complex, real-world problems.", "What problems do teams most commonly face and how can those problems be minimized?", "How can productive conflict increase creativity and productivity, and how can destructive conflict be reduced?", "Understand the importance and value of interdisciplinary collaboration in problem solving", "Apply appropriate theory and best practices to cultivate positive group dynamics", "Cultivate a collaborative mindset: appreciate the benefits of diversity, embrace productive conflict, develop epistemic humility, cultivate empathy, and be open-minded", "Better understand who you are as a collaborator and how you can help yourself and others be more effective collaborators", "Introduction & course overview", "Strengths & weaknesses in a team setting (individual)", "Psychological safety", "Conflict styles & conflict management", "Conflict style results & brief reflection (individual)", "Diversity in teams", "User-Centred Design Thinking", "Design: Problem Finding", "Design: Divergent Thinking  & Ideation", "Ideation Output due (group)", "Design: Convergent Thinking & Selection", "Design:", "Prototyping & Feedback", "Feedback summaries & annotated", "Design: Iteration & Sharing", "Course reflection & wrap-up", "Respectful Behavior", "Anti-racism Statement", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 288, "course_code": "INDEV 262", "course_name": "INDEV262 - Introduction to Global Emerging Cities (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Introduction to Global Emerging Cities Fall 2024", "08:30AM - 09:20AM", "UTD 201A", "09:30AM - 10:20AM UTD 201A", "10:30AM - 11:20AM UTD 201A", "08:30AM - 09:20AM", "UTD 201A", "09:30AM - 10:20AM UTD 201A", "10:30AM - 11:20AM UTD 201A", "Articulate the causes, as well as the opportunities and consequences, of urban development globally", "Explain the differing global contexts in which urban policy and planning are contextualized and the differing ways in which planning and policy have been employed", "Identify how the physical characteristics that make up a city can produce patterns of inequality", "Recognize how marginalized groups engage with processes of social inclusion and exclusion", "Demonstrate the connection between urban infrastructure and urban livability", "2 The forces that shape cities", "3 The role of the state in development", "5 Alternative paths to economic growth", "6 Smart cities: The role of technology in urban planning and governance", "8 Seeing the city through the eyes of women and youth", "10 ‘Green’ infrastructure in emerging cities", "11 Physical infrastructure in emerging cities", "Urbanization in a Global Context.", "Read relevant textbook chapters before lectures.", "Notice of Recording", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 289, "course_code": "INDEV 300", "course_name": "INDEV300 - Culture and Ethics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["08:30AM - 11:20AM UTD 201A", "Can two competing ethical viewpoints both be right?", "How can we negotiate the difficulties that such differences pose for our practical judgment and moral theorizing?", "Students will engage these questions by reading texts in philosophical ethics and meta-ethics, and by applying what they have learned in case studies of ethical differences among cultures.", "View requirements for INDEV 300", "This course examines the politics and politicization of human differences, and the politics and politicization of “culture”.", "understand and argue issues from multiple perspectives", "understand the politics and consequences of a particular argument", "advocate and lobby", "Monday 6th January                Topic: International Development and the Body", "Medical Anthropology Quarterly, 18(1), 77–103. https://doi.org/10.1525/maq.2004.18.1.77", "Medical Anthropology Quarterly, 1(1), 6-41. https://doi.org/10.1525/maq.1987.1.1.02a00020", "With reference to Pfeiffer, Douglas, and Lock and Scheper-Hughes, critically examine why international development should pay attention to the significance of the human body.", "APA compliance (0.5 deducted for each type of error)     20", "Legislating against culture: Efforts to end pharaonic circumcision in the Anglo-Egyptian Sudan.", "Genital cutting: The past and present of a polythetic category.", "Plastic Surgery", "Towards a biopolitics of beauty: Eugenics, aesthetic hierarchies and plastic surgery in Brazil.", "Design a campaign for OR against a Body Modification Bill.", "In what year was it passed?", "APA compliance (0.5 deducted for each type of error)     20", "Monday 24th February and Monday 3rd March", "‘The stubborn persistence of patriarchy?’", "Find a creative format and way to make FOUR main points and ONE overarching argument about the similarities and differences between:", "Huntington and Tsing", "To put it another way, find a news story about a development project that addresses culture in some way.", "Make the story central to your essay.", "Rubric", "Clarity and quality of four main points                                       20", "APA compliance (0.5 deducted for each type of error)                 10", "Total", "Many texts No much much less than a ticket to a Taylor Swift concert", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 290, "course_code": "INDEV 302", "course_name": "INDEV302 - Development Agents (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["This course examines the nature, variety and inter-relationships of and among organizations, institutions, agencies and individuals involved in contemporary development activity.", "The many and various legal, political and financial factors that affect the organization and operation of development agents are studied with respect to implications for business model, management skills, governance oversight and public policy.", "View requirements for INDEV 302", "Here, it may well be an ethical imperative to think about the structures themselves and to examine the differences and tensions between structures and relationships.", "compare and contrast the predicates and consequences of large global development agents, humanitarian interventions, and social movements", "critically assess the work and impact of development agents", "grapple with theories of power and violence", "NB Guest Speakers TBA – their talks might shift our schedule", "Development and Agency", "Bretton Woods Institutions", "Trickle-down gender at the International Monetary Fund: The contradictions of “femina economica” in global capitalist governance.", "The anti-politics machine: “Development”, depoliticization and bureaucratic power in Lesotho.", "Humanitarian Interventions", "Humanitarianism as a politics of life.", "More details to come closer to the time!", "Make a clear overarching argument and three main points.", "understanding and application of Foucault/ Galtung                         20", "understanding and analysis of Fassin/ Finnstrőm                              20", "APA compliance (half a mark deduction for each kind of error)      20", "With reference to at least two readings on the TAC, how does this news story illustrate the significance of this organization as a “development agent”?", "Have a clear overarching argument and make four main points.", "understanding and application of Farmer/ Foucault/ Galtung                                    20", "understanding and application of course readings                                                     20", "APA 7th edition compliance (half a mark deduction for each kind of error)             20", "clarity and coherence of explanation              20", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 291, "course_code": "INDEV 308", "course_name": "INDEV308 - Introduction to Social Entrepreneurship (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["B. Wylie-Toal", "Email: bwylieto@uwaterloo.ca", "This course uses the case study method to examine the challenges of starting, funding and operating an early-stage social change venture in a developing country.", "Students explore the complexities of managing and sustaining growth, the role of governing boards, and the role of private sector partnerships and resources.", "Environmental issues, including climate change, are some of the most pressing concerns of the 21st Century.", "The first investigates the concept of green entrepreneurship.", "The second part of this course explores the role of strategy and business models in helping to create financial value for the entrepreneur while simultaneously redressing the environmental problem at the core of the business.", "Understand the central concepts of entrepreneurship in general, and green entrepreneurship more specifically", "Apply that knowledge and gain experience in entrepreneurship by identifying, developing and proposing a concept for a new green venture", "Recognize the challenges of navigating ambiguity and gain experience in self-managing your learning", "Course Overview and Introduction to Entrepreneurship", "Foundations: Systems Change, Social Innovation, and Green Entrepreneurship", "Foundations: New venture life cycles and managing venture development", "Milestones: The importance of problems and opportunity recognition", "Milestones: Business strategy and business models", "Milestones: Perceived legitimacy and the start-up pitch", "Five of these activities will be for final grades and will be pass-fail.", "As a class, we will use a stage-gate process to track and manage the progress of each start-up team, giving the whole class visibility into the pace of progress and lessons learned by you and your peers.", "As part of the challenge, each team will complete a problem and solution brief, an overview of the strategy and logic behind the business, as well a business model for the new enterprise.", "In addition to summarizing these details in a final report, each team will pitch their business to the class at the end of the term.", "However, the team contract is due in September and the Pitch is due November 29th.", "Approved Self-Declared Absence Exception to Late Submission Policy:", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 292, "course_code": "INDEV 404", "course_name": "INDEV404 - International Development Theory (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["E-mail: c2mccord@uwaterloo.ca", "This course emphasizes both theoretical and conceptual frameworks, techniques, practices and methods for analysis of development, focusing in particular on the development - environment interface and questions of sustainability.", "View requirements for INDEV 602", "This course emphasizes both theoretical and conceptual frameworks, techniques, practices and methods for analysis of development, focusing in particular on the historical and spatial trajectory of international development through an examination of seminal texts.", "View requirements for INDEV 404", "The course involves a mix of lectures and seminars that will involve weekly discussions of the assigned readings linked to case studies.", "This course is designed to provide students with a critical understanding of: 1.", "The meaning of theory", "The meaning of development to different people, agencies and cultures", "The ‘nexus’ between development theory and practice", "5. Key scholars in the field of international development and their philosophical stances", "The role and scope of different actors in international development practice", "Understand the problem motivating the field of sustainable development", "A Primer on Systems Thinking, Reflexivity and Critical Thought.", "Establish the parameters for defining theory", "Critically examine the nexus between theory and practice", "Develop skills in systems thinking, reflexivity, and critical thinking", "In pursuit of this aim, we will review systems thinking, reflexivity, and critical thinking as cognitive schemas to help us understand and evaluate these two dimensions of international development scholarship.", "Investigate the construction of well-being as a concept", "Critique the relationship between economic growth and well-being", "Analyze the link between poverty and well-being", "Overview: The subjectivity of well-being can make us feel confident that we know what well-being is when we see it, but that determination is entrenched in cultural presuppositions about the nature of well-being and the ways that well-being can be pursued.", "In this week, we will explore different understandings of what well-being is and how that conceptualization of well-being can influence development theory and practice.", "Understand the multidimensionality of development", "Critique the relationship between economic growth and development", "The reasons underlying this difficulty often stem from our own assumptions about the nature of development.", "Those assumptions, very often, not only dictate the definition ascribed to development but also direct the path we choose in pursuit of that development.", "During this week, we will confront the various definitions and dimensions of development and investigate how they relate to development theory and practice.", "Understand the historical development of international development", "Identify the precursors to sustainable development", "Critique the trajectory of theories underlying international development", "As a result, the history of development theory can feel like a swinging pendulum with revolutions, reactions and re-inventions defining the trajectory of the field.", "During this week, we will explore the ideas and theories that have come to define the trajectory of development theory and how this history has defined the current conceptualization of sustainable development.", "Evaluate sustainability definitions and criteria", "Define sustainable development and its implications for development practice", "In order to understand sustainability, and its relationship to sustainable development, there are certain cognitive schemas (like systems thinking) that can help to emphasize the often hidden implications of these two terms.", "During this week, we will explore sustainability definitions and their relationship to sustainable development theory and practice.", "Explain the relationship between disaster risk reduction and sustainable development", "Evaluate the theoretical models underpinning disaster risk reduction", "We will then critique the ways in which these concepts align and conflict with sustainable development practice.", "Explain concepts used in sustainability assessment", "Understand the role of community-based methods in sustainability assessment", "Overview: How do we know if our current development practices are sustainable?", "How do we take the theories, frameworks, and criteria that define sustainability and make them practical in our assessment tools?", "As a means of guiding this discussion, we will use the frameworks available in community-based research and development methods.", "As we will see in future weeks, the methods and approaches subsumed by community-based methods can provide a helpful guide for managing and monitoring sustainable development projects.", "Discuss how power shapes development practice", "Investigate the role of democratization in shaping development", "Evaluate the role of community-based methods in shaping development governance", "In this week, we will delve into this discussion and try to define power and its implications for development practice and thought.", "This discussion will form the basis of our investigations into sustainable development governance and management.", "Evaluate governance approaches in shaping sustainable development practice", "Understand the importance of multi-level governance in sustainable development", "Assess strategies for governing and managing sustainable development", "Overview: So far in this course, we have established the complexity of sustainable development and the challenge of achieving the diverse criteria which have come to define sustainability.", "As we have seen so far in this course, a systems approach to this challenge will be essential for understanding and appreciating the approaches discussed during this week in the course.", "Apply established theory and ethical frameworks to the role of the development agent", "Reflect on the appropriate skills and dispositions that the development agent should carry", "Understand effective strategies for working with groups as a development agent", "This week, we will explore how the theories and practices that define development can inform our own roles as development agents.", "Understand the importance of futures thinking", "Learn to apply futures thinking methods in sustainable development", "Discuss the future of sustainable development practice", "Overview: This week, we will look at the future of sustainable development by exploring an emerging technique that has important implications for development practice.", "Futures thinking is a reorientation of our conceptualization of the future.", "With this framing in mind, futures thinking seeks to orient our current choices towards the better and more sustainable future that we are working towards.", "Solution Analysis 20%", "Solution Analysis 20%", "In other words:", "Maximum Possible Score", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online.", "In case of difficulties, contact uwacehelp@ist.uwaterloo.ca.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see http://iris.uwaterloo.ca/ethics/", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 293, "course_code": "INDEV 475", "course_name": "INDEV475 - Contemporary Development Issues (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["-", "E-mail: pnayak@uwaterloo.ca", "Individuals, communities and nations in all regions of the world are experiencing the effects of climate and human induced changes in their physical and social environments.", "The highest and the most direct impact of these changes are seen in the case of commons (e.g., fisheries, shellfish beds, coastal spaces, lagoons, mangroves, range lands, forests, groundwater, freshwater systems, irrigation systems, urban spaces, etc.) upon which humans depend for their social, cultural and economic needs.", "In a similar sense we all, as humans, are linked to some form of commons in our daily lives - we either impact the commons or get impacted by it or experience both.", "Within the community, rights to the resource are unlikely to be either exclusive or transferable; they are often rights of equal access and use, and held as a collective under well-defined institutional arrangements and rule system.", "In other words, in a commons situation, the exclusion or the control of access of potential users is difficult and each user is capable of subtracting from the welfare of all other users.", "Both these characteristics of commons add to their complexity, generate new contestations and help explain various critical perspectives and dynamic processes associated with the commons.", "Important to note here that commons are influenced by the prevalent social, cultural, economic, ecological and political history and traditions of the specific contexts within which they are situated and impacts of several internal and external drivers across multiple scales.", "This makes the commons dynamic over time, consistent with the literature that suggests that commons institutions may go through processes of development and decline.", "At the end of this course, students will have (a) a firm grasp of the meaning and complexity of commons and its various components through studying theory, concepts, scholars and practice; (b) a critical understanding of interdisciplinary / multidisciplinary approaches to the study of commons; (c) a good grasp of the main issues involved in the debates around commons; (d) an analytical knowledge of the key drivers and actors influencing the making or breaking of the commons; (e) a solid understanding of the links between commons and its role in sustainable development; (f) a capacity to critically analyze challenges facing the commons in different parts of the world and the nature of struggles, strategies adopted by communities, governments and civil society to deal with it; (g) a solid perspective on how to sustain the commons and carry them into the future through appropriate governance arrangements.", "The basic pedagogy of the course will include an interesting mix of conceptual and empirical information delivered through evidence-based learning methods and structured lectures.", "First half of the class time will be devoted to dealing with the conceptual aspects of the topic mainly through a mix of interactive lecture and facilitated seminar and the remaining half of the class time will be used to discuss an empirical case study or guest speakers that can offer practical examples to help explain selected commons topics more succinctly.", "Class seminars and discussions will also revolve around a set of required and recommended readings wherein students will be encouraged to participate in a meaningful way.", "At the end of this course, students will have (a) a firm grasp of the meaning and complexity of commons and its various components through studying theory, concepts, scholars and practice; (b) a critical understanding of interdisciplinary / multidisciplinary approaches to the study of commons; (c) a good grasp of the main issues involved in the debates around commons; (d) an analytical knowledge of the key drivers and actors influencing the making or breaking of the commons; (e) a solid understanding of the links between commons and its role in sustainable development; (f) a capacity to critically analyze challenges facing the commons in different parts of the world and the nature of struggles, strategies adopted by communities, governments and civil society to deal with it; (g) a solid perspective on how to sustain the commons and carry them into the future through appropriate governance arrangements.", "At the end of this course, students will have (a) a firm grasp of the meaning and complexity of commons and its various components through studying theory, concepts, scholars and practice; (b) a critical understanding of interdisciplinary / multidisciplinary approaches to the study of commons; (c) a good grasp of the main issues involved in the debates around commons; (d) an analytical knowledge of the key drivers and actors influencing the making or breaking of the commons; (e) a solid understanding of the links between commons and its role in sustainable development; (f) a capacity to critically analyze challenges facing the commons in different parts of the world and the nature of struggles, strategies adopted by communities, governments and civil society to deal with it; (g) a solid perspective on how to sustain the commons and carry them into the future through appropriate governance arrangements.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 299, "course_code": "INDG 301", "course_name": "INDG301 - Critical Theories of Indigeneity in a Global Perspective (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Critical Theories of Indigeneity in a Global Perspective Winter 2025", "08:30AM - 11:20AM UTD 201A", "This cross-cultural and interdisciplinary course critically examines the definitions of, and debates surrounding, indigeneity, drawing on both Indigenous and non-Indigenous theorists.", "The course covers a range of themes, from constitutions and peoplehood to epistemologies and ontologies, and draws on a variety of examples from around the globe.", "View requirements for INDG 301", "I thank Dr Rowland Robinson, former interim Director of the Indigenous Studies minor at United College, for his counsel.", "define Indigeneity cross-culturally", "Wednesday 8th January                       Introduction", "Choose one of the following comedy sketches.", "Current Anthropology,44(3), 389-402", "Ensure APA 7th edition compliance.", "understanding and application of Mignolo/Kuper                        15", "understanding and application of Cusicanqui/Kenrick                 15", "The deployment of a “sacred song” in violence in Zimbabwe: The case of the song “Zimbabwe Ndeye Ropa Ramadzibaba” (Zimbabwe was/is Born of the Blood of the Fathers/Ancestors) in Zimbabwean politics.", "“New nationalism” and nativism in Zimbabwe and South Africa.", "Wednesday 26th February and 5th March        Mexico", "Naming ourselves: Recognising racism and mestizaje in Mexico.", "Friday 7th March", "In a minimum of 120 and a maximum of 220 words, what is it about?", "Ensure APA 7th edition compliance.", "In what ways is Zimbabwe a cautionary tale about indigeneity?", "In what ways is indigeneity in Mexico radical?", "understanding and application of Zimbabwe/ Mexico readings     20", "understanding and application of theorist                                   20", "APA compliance                                                           20 (half mark deduction for each type of error)", "“I still call Australia home”: Indigenous belonging and place in a white post-colonising society.", "Governing Indigenous citizenship in Australia: From objects and partial subjects to coexisting sovereign citizens?", "What are the complexities of Indigenous identities and politics inAustralia?", "Ensure APA 7th edition compliance.", "Rubric", "Understanding and application of relevant readings         20", "APA compliance                                                           20 (half mark deduction for each type of error)", "www.ibtimes.co.uk.pictures-President-Zimbabwe-Robert-Mugabes-Rise-Fall-1647387", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 302, "course_code": "INTEG 120", "course_name": "INTEG120 - The Art and Science of Learning (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["EV2 2069", "katie.plaisance@uwaterloo.ca", "EV2 2069", "katie.plaisance@uwaterloo.ca", "Email: kplaisan@uwaterloo.ca Email: m247chan@uwaterloo.ca", "Student drop-in hours: T & Th, 4-5pm Email: ig2kelly@uwaterloo.ca", "First, you will learn about how the mind processes information, and will begin developing new habits to facilitate clear and critical thinking in complex, messy, and stressful circumstances.", "You will use this knowledge to identify opportunities and develop strategies for learning, and for the integration and synthesis of different types of knowledge.", "View requirements for INTEG 120", "** Updated Course Description for Fall 2024 **", "We will discuss how to develop “smart” goals, deploy effective learning strategies, identify and reduce cognitive biases, cultivate a growth mindset, and improve self-regulation to become a more effective learner.", "Describe effective learning strategies + Employ those strategies to improve your own learning", "Distinguish between fixed vs. growth mindset + Cultivate more growth-oriented thoughts", "Identify ways to enhance a learning environment + Design a learning environment that works for you", "Articulate the concept of metacognition + Improve your own metacognitive abilities", "Explain the relationship between learning & self-care + Practice self-care and enhance your wellbeing", "Identify techniques and resources that can be used to successfully navigate university + Leverage techniques and resources to thrive during your time in university (and beyond!)", "Welcome & Intro – no readings or assignments!", "** Fall Reading Week Break **", "Read New Science of Learning, chapters 10 & 11 – \"Sleep & Exercise to Enhance Learning\"", "You must purchase electronic copies of these books through Perusall(other copies will not work in Perusall).", "Exams", "Excused Absences & Academic Accommodations", "Self-declared absence: Students can self-declare one 48-hour absence for any reason via Quest.", "(These will be approved or denied on a case-by-case basis.)", "The late window will stay open for one week.", "Respectful Behavior", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 303, "course_code": "INTEG 220", "course_name": "INTEG220 - Nature of Scientific Knowledge (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Nature of Scientific Knowledge Fall 2024", "INTEG 220", "INTEG 220 001", "EV2 2069", "Email: Mathieu.feagan@uwaterloo.ca", "The course features significant input from scientific practitioners in the form of guest lectures.", "View requirements for INTEG 220", "We will also talk with scientific experts about how they practice science and how those practices relate to the philosophical issues we’ve discussed.", "Explain different views of the nature of scientific knowledge", "2. Describe and discuss key issues regarding science and society", "3. Critically analyze a relevant epistemological issue", "Apply a course concept, theory, or idea to a real-world context", "Week 1: Introduction & Course Overview", "Earth systems science and the ozone crisis (Angus chapter 4 and 5)", "Week 6: Science & Values", "Week 12+: Course Reflection & Wrap-up", "Other activities are welcome!", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 304, "course_code": "INTEG 221", "course_name": "INTEG221 - The Social Nature of Knowledge (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["EV2 2069", "katie.plaisance@uwaterloo.ca", "INTEG 221 001", "EV2 2069", "katie.plaisance@uwaterloo.ca", "Email: kplaisan@uwaterloo.ca", "Office hours: Tues & Thurs, 4:00-4:45pm", "INTEG 221:", "This course examines social aspects of knowledge, including ways that characteristics of individual knowers and their communities affect the acquisition, interpretation, production, and transfer of knowledge.", "The course features significant input from researchers in the humanities and social sciences in the form of guest lectures.", "View requirements for INTEG 221", "Explain objections to traditional epistemology", "Describe feminist and social epistemology, and some of their key concepts", "Apply the concept of situated knowledge to yourself", "Connect a concept or theory you learned in class to a real-world context", "Practice and refine your communication and critical thinking skills", "Week 1: Introduction & Course Overview (Jan 6-10)", "Read handouts on doing philosophy & reading charitably", "Read Code, “Is the Sex of the Knower Epistemologically Significant?”", "Read Dotson", "Week 9: Epistemic Bubbles & Echo-Chambers (Mar 10-14)", "No reading due – time in class for design charrette", "We will be using Perusall, a free online tool for social reading, for all assigned readings.", "Who am I as a knower? 15%", "Respectful Behavior", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 305, "course_code": "INTEG 240", "course_name": "INTEG240 - Bullshit, Bias, and Bad Arguments (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["I'm Dr. John McLevey.", "I'm an Associate Professor in the Department of Knowledge Integration (Faculty of Environment).", "I'm also a member of Sociology & Legal Studies, and Geography & Environmental Management.", "Email: john.mclevey@uwaterloo.ca", "The course will cover a broad range of issues from a social scientific perspective, including comparisons of different types of deceptive information; the role that cognitive biases and social networks play in shaping our perceptions of truth and reality; the importance of data rights, privacy, and governance models for social media platforms and other digital communications; misrepresentations of science; and how influence campaigns undermine political deliberation and democratic institutions.", "This course will provide students with knowledge and fundamental skills that are important for countering bullshit, biases, and bad arguments.", "Explain the role that our social networks play in shaping our individual and collective beliefs and behaviours", "Describe the social mechanisms that enable true and false beliefs to spread, and how we can better understand these mechanisms using quasi-experimental designs and computational simulations", "Explain what philosophers and sociologists of science mean when they refer to 'truth' and 'false beliefs'", "Explain how the science of complex contagions and social scientific research on identity and political polarization offers insights into possible solutions to the problems of misinformation and disinformation", "However, Knowledge Integration students will note many (intentional) connections to content introduced in other first and second year KI courses.", "Concepts and theories introduced in this course will also help prepare students for other KI courses, including \"Research Methods and Design,\"  \"Computational Social Science,\" and a wide variety of other electives.", "The schedule below tells you what readings to complete each week.", "Welcome!", "Week 1 is not a full module; its purpose is to give you a sense of what to expect over the course of the semester.", "Complete the first open book test.", "For example, you can start the first open book test anytime you want between January 31 and February 4.", "Intellectual property includes items such as:"]}, {"course_id": 306, "course_code": "INTEG 251", "course_name": "INTEG251 - Creativity and Innovation (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Creativity and Innovation Fall 2024", "10:00AM - 11:20AM EV2 2069", "Students will learn to identify and explain key ideas and historical figures in the study and practice of creative thinking.", "View requirements for INTEG 251", "The concepts and practices you develop in this course will help you exercise creative thinking and innovation in other classes, projects, and work beyond the university too.", "2) Situate creativity and innovation in a history of changing working conditions across sectors.", "3) Apply key concepts and practices to your own projects inside and outside academia.", "Phases", "Welcome and overview", "Theory and Practice", "Creative Thinking: Def. & Structure", "Discussion: Conscious Creative by Kelly Small (Intro + you pick any 3 ethical practices from the remaining chapters)", "No classes this week", "Design Project", "Wed Oct 23: Brainstorming project options & Group formation", "Wed Oct 30: Ideate possible interventions", "Wed Nov 13: Explicitly linking interventions & designs", "Review, clarifying questions & next steps", "Participation self-evaluation part 2", "What might you learn from these efforts?", "How might you learn from this experience moving forward?", "Each case study comes with different possible readings to be discussed in a short written analysis (approximately 1000-1500 words in essay form):", "Open topic – Propose another case study topic of interest to you; make sure it includes at least two new relevant readings and poses a question that you can answer in a 1000-1500 word essay, drawing on your learning in the course.", "What designs and patterns do you think were shaping what creativity and innovation meant in the context of the project?", "Demonstrate familiarity with concepts and practices from class (5%)", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 308, "course_code": "KIN 352", "course_name": "KIN352 - Sociology of Aging (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Email: eneiterman@uwaterloo.ca", "Email: smakarim@uwaterloo.ca", "Email: s5leslie@uwaterloo.ca", "Elizabeth Wang", "Email: e69wang@uwaterloo.ca", "Email:  t4joshi@uwaterloo.ca", "KIN 352: View requirements for KIN 352", "REC 362: View requirements for REC 362", "In the first part of the course, we will learn to understand aging as a socially constructed phenomenon.", "In the final part of the course, we will critically assess the social and financial supports available to older adults in our society.", "Explain why aging can be considered a socially constructed phenomenon", "Explain why Canadian population is aging and what contributes to this trend", "Identify and summarize some of the theories in social gerontology", "Describe major sources of social inequalities that impact individuals in old age", "Describe how major social institutions shape the aging process", "Define and explain healthy and successful aging", "Explain the role of family and social support in the lives of older adults", "Identify major challenges in the end-of-life issues experienced by older adults", "Enhance research, writing, and critical appraisal skills", "Introduction to Course Course Outline", "Sociological Perspectives and Aging Theories", "Immigration and Aging", "Physical and social activity in later life", "Older Persons and their Family Roles", "I can ask you questions that test your understanding of the readings, lectures, and class discussions, and assess your level of comprehension in relation to that of your peers.", "The goal of this assignment is to explore how the aging process is shaped by social and individual factors and to try yourself as a researcher in the field of social gerontology.", "Letter of Information and Consent Form", "Interview guide", "We will practice the technique of semi-structured qualitative interviewing during the workshop in class.", "If this is the case, students must clearly identify each interviewer, as each student will receive an individual grade for the assignment", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 309, "course_code": "KIN 354", "course_name": "KIN354 - Psychology of Physical Activity (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "KIN 354", "KIN 354 001", "Email: mogrodnik@uwaterloo.ca", "This course will provide an overview of the field of sport and exercise psychology and examine how various factors impact our interest, passion, and commitment to sport, exercise, and physical activity.", "View requirements for KIN 354", "Welcome to KIN 354: Psychology of Physical Activity!", "Examine relationships between psychological factors and human behaviour in sport and physical activity contexts.", "Effectively communicate (read, write, discuss) psychological theories and concepts related to exercise, sport, and health psychology.", "Week 2: Sept 9 Motivation & Behaviour Change", "Week 3: Sept 16 Personality in Sport and Exercise", "Week 4: Sept 23 Aggression and Moral Behaviour in Sport", "Week 6: Oct 7 Anxiety in Sport and Exercise", "Week 9: Oct 28 Group Cohesion in Sport and Exercise", "Week 12: Nov 18 Body Image in Sport and Exercise", "Self-Evaluation and Course Engagement 10%", "Engaging in these activities will be incorporated into your overall course engagement score.", "Application Response", "Notice of Recording", "We support hundreds of students across multiple courses; sometimes we might be a little late or the email may get lost.", "Library for research-based assignments", "Wellness in KIN 354", "You may experience stressors that can impact your personal well-being and academic experience, but there are multiple supports and resources available to you on and off-campus.", "Office of Indigenous Relations Office of Equity, Diversity, Inclusion and Anti-racism", "Students may choose to participate in some course activities that fall during the short-term absence, and still record an absence for other activity in that period.", "During the 2-day academic consideration period, the instructor cannot require completion of any of the missed academic responsibilities.", "Only one short-term absence can be self-declared per academic term.", "Students can self-declare one COVID-19-related absence in an academic term.", "Death of a family member: a copy of the death certificate, a copy of the obituary or a link to the online obituary.", "Broadly, in any case where you anticipate missed work the overall golden rule: communicate with your TA or instructor as early as you can!", "In KIN 354, our classroom functions under the assumption of respect.", "Faculty are indeed presumed to be the Intellectual Property Owners of the course materials.", "Intellectual property includes items such as:", "Co-op Interviews", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 310, "course_code": "LAT 202", "course_name": "LAT202 - Selections from Latin Authors (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "LAT 202", "LAT 202 001", "Email: acoskun@uwaterloo.ca", "explain the main functions of Latin cases and of the subjunctive mood", "explain the syntactical relation of the words in a Latin sentence", "translate basic and intermediate Latin sentences into English and basic English sentences into Latin", "This week’s motto: Nonne vides etiam guttas in saxa cadendo pertundere illa saxa?", "Notice of Recording", "Intellectual property includes items such as:"]}, {"course_id": 315, "course_code": "MGMT 220", "course_name": "MGMT220 - Entrepreneurship and the Creative Workplace (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Email: r8mclean@uwaterloo.ca", "The first explores entrepreneurship as a key input to economic activity.", "The design of an appropriate strategy and the implementation of this strategy through appropriate controls and structure are considered in the context of the innovative firm.", "Develop entrepreneurial and intrapreneurial skills for personal and professional development.", "Apply strategic design principles to business plans.", "2. Understand and apply fundamental aspects of entrepreneurial thinking across disciplines and as a means of personal and professional development.", "3. Explain concepts, theories, and practices employed in entrepreneurship and the role entrepreneurship plays in the global economy and society.", "5. Evaluate new venture opportunities to determine their strengths, weaknesses, and overall business potential.", "Sept 11: Entrepreneurship & economic activity", "Sept 16: Finding Opportunities & Blue Oceans", "Week Five – Financial Requirements and Market Feasibility", "Week Ten – Business Plans and Business Models", "Week Eleven – Existing Business Models", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page."]}, {"course_id": 316, "course_code": "MGMT 244", "course_name": "MGMT244 - Principles of Marketing (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Students will gain an understanding of how organizations identify the needs of potential consumers and create and deliver value to these consumers through the marketing process.", "Certain concepts from business and economics including market responsiveness, decision-making process, willingness to purchase, product differentiation, and advertising will be incorporated into the development of a strategic marketing plan.", "In addition to teaching central concepts and models from both marketing and economic theory, students will be placed in a forum where they can apply these concepts in a 'real world' marketing situation.", "Describe the basic principles of marketing, the marketing process, and its economic foundation.", "Demonstrate how marketing discovers and satisfies consumer needs and wants.", "Analyze internal and external factors contributing to the current state of organizations.", "Demonstrate the use of marketing tools including branding, positioning, and segmentation.", "Integrate the marketing mix elements into a strategic marketing plan.", "Missing a Discussion Posting", "If a student has an ongoing medical issue over the long run that would cause missing more than two discussion boards, the student should bring official documentation stating their condition at the beginning of the term.", "In the case of contribution issues, non-contributor's marks will be penalized based on their peer evaluation scores.", "In the case of illness or emergencies, students are responsible for contacting their group members ahead of deadlines and arranging for re-distribution of their responsibilities.", "This course includes the development and practice of specific skills, such as collecting, synthesizing and analyzing information, creating recommendations and practicing writing skills.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 317, "course_code": "MGMT 345", "course_name": "MGMT345 - Marketing Strategy (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["S. Villers", "S. Villers", "S. Villers", "Sheila Patterson", "Email: s6patterson@uwaterloo.ca", "Building on the fundamentals introduced in Principles of Marketing, students are given an opportunity to apply these concepts to real world situations in an interactive learning environment.", "Using cases and simulated markets, students make strategic decisions, defend their decisions, and see the repercussions in real time.", "Apply the marketing concepts taught in ARBUS 302 / MGMT 244;", "2. Develop skills in the areas of marketing analysis, marketing decisions, and strategy formation;", "January 6* Introduction: Syllabus, Marketing Fundamentals Chapter 1 In-Person", "January 20* Marketing Mix: Product Chapters 7-8 In-Person", "March 3* Consumer Behaviour Chapter 3 In-person", "Manual recording will be used for in-person classes.", "In appreciation of the fact that some people are introverted, there will be multiple recorders and multiple notetakers per class.", "Notetakers will supply recorders with class notes via email – the email must be received to count for a participation mark.", "Groups must notify the team member and the instructor of this termination.", "The work is expected to be completed professionally and on time every week – even if that means working beyond the 80 minutes of class time provided.", "Students must complete each course assessment by the due date specified above.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "A held-with course will also only count towards program and breadth requirements of the subject code under which it is taken, unless it is cross-listed with the subject code of its’ held-with course.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 319, "course_code": "MSE 211", "course_name": "MSE211 - Organizational Behaviour (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Sofiia Doroshenko <sdoroshenko@uwaterloo.ca>", "Introduction to the concepts of learning, person perception, attitudes, and motivation in an organization.", "Discussion of power, control, leadership, and management in light of the above concepts.", "The basic objective of the course is to help you to develop both theoretical and practical approaches for analyzing and making sense of individual and group behaviour in organizational situations.", "Demonstrate understanding of basic theories/concepts of organizational behaviour.", "2. Demonstrate understanding of factors that affect the behaviour of individuals and groups in organizations.", "3. Demonstrate understanding of factors affecting communication effectiveness in organizations.", "Introduction                                            Ch 1", "Personality & Intelligence                     Ch 3", "Lewin’s field theory                               Handouts", "Groups & Teams                                    Ch 11", "Communication                                      Ch 20", "This course includes the independent development and practice of specific skills, such as analyzing and writing about organizational situations.", "In cases where there is further clear evidence of plagiarism regardless of AI% score, the work will be submitted to the Associate Dean as a potential academic integrity offence.", "Keep copies of your pre- and post- grammar-corrected drafts in case we ask to see them.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 321, "course_code": "MSE 311", "course_name": "MSE311 - Organizational Design and Technology (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Organizational Design and Technology Winter 2025", "MSE 311", "The instructor Kenneth McKay can be reached via email kmckay@uwaterloo.", "The focus of this course is on the procedures and variables involved in the design and redesign of organizations.", "View requirements for MSE 311", "understand underlying concepts and models which help to explain the impact of technology on organizational design decisions and how these choices can impact organizational performance, short and long term", "understand organizational design in practice", "apply organizational design concepts to student situations", "understand organizational design in the current context", "Knowledge base (D) - 1d - demonstrate understanding of specialized knowledge needed to understand and design organizational structures", "Design (D) - 4a - follow an engineering design methodogy suitable for designing organizational structures", "Use of engineering tools (D) - 5a, 5b, 5c - select, modify, use suitable tools and models for designing organizational structures", "Ethics and equity (D) - 10a - identify ethical and unethical behaviour in the organizational design and use of technology such as AI", "Overview and introduction", "Organizational evolution and design dimensions", "Drivers, criteria for design decisions", "Design constraints and limitations", "Governance and oversight", "Start-ups, small organizations", "Risk management considerations", "The major concepts outlined below illustrate the strategy being used and it is expected that the final assessment scheme will be close to the descriptions below.", "The requirements and process for self-assessment will be shared in the first week.", "The specific AI usage guidelines and requirements will be shared in the first week.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 324, "course_code": "MSE 442", "course_name": "MSE442 - Impact of Information Systems on Organizations and Society (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Impact of Information Systems on Organizations and Society Winter 2025", "MSE 442", "This course is designed to familiarize the student with issues related to the impact of computer-based technologies on individual jobs, organizations, and broader societal level.", "View requirements for MSE 442", "Identify the role(s) of information technology in society in a number of different fields.", "Identify and explain the advantages and drawbacks of a particular information technology case in society.", "Synthesize ‘for’ and ‘against’ cases and highlight the strengths and weaknesses of these beliefs.", "Present well-constructed arguments using sound knowledge and evidence supporting the case.", "Describe the impact of information technology in society with reference to potential future occupations.", "The survey can be accessed with the following link: https://www.surveymonkey.com/r/HMGHBKF", "Each team will create 5 questions for the opposing team and post these by Wednesday at noon of the debate week.", "A maximum of 100 words is allowed for each question.", "A maximum of 200 words is allowed for the response to each question received.", "Do the questions effectively challenge the opposing team?", "Do the answers to the questions received reflect good understanding of the case that the team is presenting?", "Are the arguments presented in the answers well constructed and is the evidence presented relevant and convincing?", "Inclusion of the main issues in the public debate on the topic", "Each review should be a maximum of 1000 words.", "Each review should be a maximum of 1000 words.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 325, "course_code": "MSE 454", "course_name": "MSE454 - Technical Entrepreneurship (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "MSE 454", "MSE 454 001", "MSE 454:", "Technical entrepreneurship is examined considering the role of independent business, entrepreneurial behaviour, types of business and enterprises, business structure, sources of venture concepts and capital, company operation and control, and business start up.", "View requirements for MSE 454", "Formulate an initial business pitch including a concise description of the concept and potential market and/or consumer.", "Analyze the value proposition, market, and particular product characteristics.", "Design the characteristics of a product using the technology adoption life cycle.", "Week 6: Your Business Model", "Assignment Due: Your Introduction Strategy - The Sales OR Innovative Change Roadmap (20 marks)", "Your Business Model – the Business Model Canvas 20", "Your Introduction Strategy – The Sales OR Innovative Change Roadmap 20", "A passing grade for your group does not necessarily result in a passing grade for each group member.", "Notice of Recording"]}, {"course_id": 327, "course_code": "MUSIC 110", "course_name": "MUSIC110 - How Music Matters (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["10:00AM - 11:20AM CGR 1208", "Identify broad categories of music’s functions across cultures", "Describe the uses, functions, and meanings of music in diverse cultures and eras and identify explain how these may relate to your own experiences", "Apply a holistic approach to musical across cultures", "Compare and contrast connections across cultures", "M2.1 Music in Everyday Life", "Introduction to European Art Music", "Introduction to European Art Music", "Introduction to European Art Music", "Music and Aesthetics", "Music and Aesthetics", "Music and Utopia", "Music and Utopia", "Music for Utopia", "*one-week automatic extension", "Further instructions on how, when and where these will be assessed will be given by each instructor.", "Unit Quiz: Each unit quiz comprises multiple choice questions to check knowledge of basic concepts and terms.", "Unit Test: Each unit test includes listening identification and description, short answer questions, and a brief essay question applying concepts learned in each unit.", "This course includes the independent development and practice of specific skills, such as listening to and describing specific musical phenomena.", "Library for research-based assignments", "Intellectual property includes items such as:", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 331, "course_code": "MUSIC 240", "course_name": "MUSIC240 - Introduction to Jazz (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Jazz Winter 2025", "06:00PM -", "B. Lefresne", "A survey of the development of jazz schools and individual styles as well as a study of melodic, harmonic, and rhythmic improvisation.", "Identify and be coversant in the main/periods styles of jazz from c. 1900 to the present day", "Identify and understand the major figures in jazz", "Listen to jazz and identify two main forms and types of jazz songs: the blues and 32-bar popular song", "Be aware of current trends in jazz performance", "An understanding of the history of the history of jazz and jazz studies as an academic discipline", "Swing Era Begins", "Rhythm in Transition", "6 March Jazz Composition; Miles Davis & John Coltrane  Jazz: Chapters 13-14", "Fusion Jazz", "Scott DeVeaux & Gary Giddins, Jazz, 2nd ed.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 333, "course_code": "MUSIC 253", "course_name": "MUSIC253 - Cathedral and Court: Music to 1600 (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Email: ksteiner@uwaterloo.ca", "A study of major developments in western music during the Middle Ages and Renaissance, including Gregorian chant, mass, secular songs, instrumental music, and other musical genres that flourished under courtly and church patronage from the early Christian church to 1600.", "We will consider 1) major changes in the sounds of music 2) major developments in the ways music was recorded 3) major changes in the roles music played in societies 4) topics related to issues today that help us compare and contrast medieval and Renaissance society with contemporary Canada.", "To learn the basic theory, history and culture of music of the medieval and Renaissance eras in the West.", "To apply theoretical, historical and cultural knowledge of early music to music listening and analysis.", "325-329", "Counter-Reformation Polyphony", "NHWM 241-253/226-240", "NHWM 259-271/269-281", "Exam period", "Analysis of a recording 15%", "Record yourself performing the chant with your eyes closed and submit in the Dropbox on Learn.", "Library for research-based assignmentsI", "Intellectual property includes items such as:", "Cross-listed courses"]}, {"course_id": 346, "course_code": "MUSIC 363", "course_name": "MUSIC363 - The Church's Song (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Students will practice methods of song analysis, assess musical meaning, value and effects in various cultural contexts, and reflect on written and oral transmission of music.", "recall the major figures and movements in church history that contribute to contemporary hymns and songs", "articulate the benefits of singing for the life of a church community", "analyze hymns and songs for form and style", "connect cultural movements in Christian history with hymn and song styles", "utilize research tools for context and interpretation of individual hymns and songs", "Readings", "xxv-xlvii;", "“‘Do It Again’: Chart-Topping Worship Songs and the Churches Behind Them.”", "Christian Doctrine in the Hymn", "Biblical Interpretation", "Song-writing Workshop: Dr. Karen Sunabacka", "Melody and Identity", "Songs for Song Analysis", "Evangelism", "Intimacy", "Song Analysis Preparation Worksheet", "Song Analysis March 18 30%", "Local", "vis a vis “Where should our song be going?:", "New Songs of Celebration Render: Congregational Song in the Twenty-First Century.", "Available in the UWaterloo Bookstore", "Songs for Song Analysis 5", "Song Analysis Preparation Worksheet 15", "Song Analysis 15", "Memorize a song: choose a song (at least eight lines long) not discussed in class to memorize and present to the class.", "The Songs for Song Analysis and Preparation Worksheet are preparatory pieces for this paper.", "Term Paper: A research paper examining the hymn repertory of a particular congregation.", "Each student will choose a song to introduce and then sing together.", "This course includes the independent development and practice of specific skills, such as analyzing text and music, and applying contextual study to song interpretation and performance.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 347, "course_code": "MUSIC 364", "course_name": "MUSIC364 - Worship and its Music (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["02:30PM - 05:20PM", "Email: ksteiner@uwaterloo.ca", "Field trips to services of various traditions.", "CMW 364: View requirements for CMW 364", "The first part of the course examines Christian worship as a public ritual and the ritual functions of music in Christian worship with an emphasis on Indigenous and Black perspectives.", "The second part of the course gives a brief introduction to worship in Christian history, focusing on specific cultural issues.", "Students will integrate history and ritual study into observation and analysis of two Christian worship services, and practice identifying the ritual functions of music through the creation of a worship playlist.", "Describe relationships between ritual, belief, and life", "2. Identify functions of music in Christian worship", "1 Jan 10 Introduction to Worship", "4 Jan 31 Ritual language and culture", "Articles and Chapters", "Teresa Berger, “Ecology and Worship,” in Theological Foundations of Worship: Biblical, Systematic, and Practical Perspectives, ed.", "J-Glenn Murray, \"The Liturgy of the Roman Rite and African American Worship\" Readings in Afrcan American Church Music, vol.", "“This Is My Daily Bread: Toward a Sacramental Theology of Evangelical Praise and Worship.”", "Major Worship Analysis and Presentation 35%", "This course includes the independent development and practice of specific skills, such as observation and analysis of rituals and music.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 348, "course_code": "NE 109", "course_name": "NE109 - Societal and Environmental Impacts of Nanotechnology (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Societal and Environmental Impacts of Nanotechnology Fall 2024", "09:30AM - 10:20AM RCH 302", "09:30AM - 10:20AM STC 0040", "02:30PM - 03:20PM", "Howard Siu", "Nanotechnology in society; health and environmental sustainability; introduction to environmental life cycle assessments; engineering ethics, policies, and regulations; Canadian legal system, tort, and intellectual property; examples of nanotechnology innovation and commercialization.", "An introduction to the field of nanotechnology and its ability to impact society and affect sustainability.", "How utilization of nanotechnology has simultaneously improved societal standards of living and introduced new ethical, health, and environmental concerns will be examined.", "Topics covered will include: the history of changing perceptions of and attention devoted to developments in nanotechnology; special health and environmental concerns associated with nanomaterials; the development and means of implementation of regulations to deal with the use of nanomaterials; ethical issues associated with nanotechnology and its applications.", "Relevant case studies will be presented and discussed.", "Analyze case study problems from regulatory, ethical, and legal perspectives", "Be familiar with the concepts of intellectual property and, more specifically, the patenting process", "Impact on the Environment: Forms of man-made pollution, their effects upon the environment, and standard methods of waste-water treatment.", "Applications of nanotechnology in medicine will also be examined.", "Regulating Nanotechnology:  An examination of the purpose of regulations, including the concepts of life-cycle analyses, environmental management systems, risk assessment, cost-benefit analyses, and the precautionary principle.", "Science & Technology and Politics: A quick introduction on how government policies can influence the development of science and technology.", "Ethics: Types of ethics, ethics pertaining specifically to professional engineering and science, as illustrated through a number of case studies.", "Tort Law: Canadian legal system, criteria for a tort, potential nanotechnology torts in the near future, and examination of several case studies.", "Intellectual Property: Types of intellectual property, application for patents in Canada, potential concerns facing patent applications for nano-enabled inventions.", "Business Structure: Pros and cons of sole ownership, partnership, incorporation.", "Top Hat may require a paid subscription, and a full breakdown of all subscription options available can be found here: www.tophat.com/pricing.", "This course includes the independent development and practice of specific skills, such as sustainability impact analysis.", "Library for research-based assignments"]}, {"course_id": 349, "course_code": "PLAN 100", "course_name": "PLAN100 - Urbanization Today: Introduction to Cities and Regions (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Urbanization Today: Introduction to Cities and Regions Fall 2024", "10:30AM - 12:20PM EXP 1689", "B. Doucet", "Dr. Brian Doucet firmly believes that academic knowledge should be shared with wider audiences to enhance not only scholarly debates, but also political, policy, planning and public discussions about cities and communities.", "He is a frequent commentator in the media and has experience and expertise speaking with a wide range of audiences about many important urban topics.", "Dr Doucet’s first full-length documentary film Thinking Beyond the Market: a film about genuinely affordable housing, will be released in fall 2024.", "His interest in cities and transportation began at an early age; his childhood home was within earshot of the Yonge subway line and as a child, he spent many hours watching trains from the bridge over the tracks!", "He is particularly interested in the relationship between new transit lines and processes of gentrification and displacement.", "His first book Why Detroit Matters (2017, Policy Press) examined counternarratives and inspiring visions in Detroit.", "He was previously a competitive curler and represented the Netherlands at the European Curling Championships in 2008, 2010 and 2011.", "This course considers the history of urbanization, models of urban and regional development, and ideals of good urban form in Canadian and global contexts.", "Students will develop a critical perspective on the historical and contemporary relationships between processes of urbanization and broader societal trends and structures.", "Introduction", "We will explore different models of urban development, the role that shifting economic and social forces have played on the growth and development of cities, and different eras of urbanization.", "Rather than only describing these changes, this course will introduce a critical perspective on the impacts of urbanization and urban change on marginalized groups.", "The course will be taught through a combination of thematic lectures and case studies of challenges facing particular cities.", "A key component of this course is to encourage and challenge students to look differently at the world around them in order to examine planning’s role in what we see visible (and invisible) in our cities.", "Part One, The Growth and Development of Cities (weeks 1-6) explores different ideas and practices about how cities developed over time, as well as introducing different parts of the city (downtowns, inner cities, suburbs, mid-sized cities etc).", "Learning Modes and Expectations:", "The lectures will be given by Dr Brian Doucet and will introduce and explain key concepts, issues and examples.", "The tutorials will be divided into smaller groups of around 25-30 students and held in the days following each lecture.", "We understand that most of you are first-year students entering a new phase of your studies and that university education comes with very different expectation than other places of learning.", "One of the main goals of this course is to develop critical thinking and observation skills in order to start your journey towards ‘thinking like a planner.’", "As a result, we are more interested in your own thoughts, ideas and knowledge about a topic and how these can all grow throughout the course, rather than what you can find and produce through a generative AI software program.", "Learn about the growth and development of cities through the history of urbanization and planning", "Learn about the different parts of the Canadian urban system and how they have changed over time", "Understand the impacts of key structures and processes in contributing towards social and spatial inequality", "Develop skills related to note taking, lecture and reading comprehension", "Develop skills related to observing aspects of change and aspects of the planning process within the built environment.", "History of planning in Canada and other countries (History & Principles of Planning)", "Forms, scales and settings of human settlements (Human Settlements)", "Processes and factors of change in human settlements (Human Settlements)", "Schedules", "Student Drop-in Hours, LEARN Discussion Boards and Email Consultation", "Note that I do not regularly check my email in the evenings, weekends and during Reading Week", "If you are unable to attend in person, please send me an email request to arrange a time during these drop-in hours", "PART 1: The Growth and Development of Cities", "Introduction", "Evolution of Cities", "Models of Urban Development", "Neighbourhood change in central Halifax, 1951–2011.", "Midtern Test", "Enduring features of the North American suburb: Built form, automobile orientation, suburban culture and political mobilization.", "--Curb Cuts Episode 308. 99& Invisible Podcast", "Climate change and urban life", "It will be a closed-book test.", "Students will take one of the topics from weeks 4 - 6 and explore a particular issue in more detail.", "This review should explain how the topics and examples covered in the podcast are related to some of the key themes and topics in this course.", "The review should end with a broader reflection on how planning can influence the selected topic and/or case study.", "Episode 388", "The final exam will be a cumulative test of the main content for this course.", "It will be closed book and held during the exam period.", "Late Penalties and Extension Requests", "5% for the first 24 hours", "Students should plan ahead and look carefully at all the deadlines for their courses; and requests for extensions must be written in an email.", "Other Important Information", "Intellectual property includes items such as:", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "If the development of your research proposal consists of research that involves humans as participants, then please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CECA provide an interview conflict procedure to manage these situations.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "This course includes the independent development and practice of specific skills.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 350, "course_code": "PLAN 262", "course_name": "PLAN262 - Introduction to Global Emerging Cities (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Introduction to Global Emerging Cities Fall 2024", "08:30AM - 09:20AM", "UTD 201A", "09:30AM - 10:20AM UTD 201A", "10:30AM - 11:20AM UTD 201A", "08:30AM - 09:20AM", "UTD 201A", "09:30AM - 10:20AM UTD 201A", "10:30AM - 11:20AM UTD 201A", "Articulate the causes, as well as the opportunities and consequences, of urban development globally", "Explain the differing global contexts in which urban policy and planning are contextualized and the differing ways in which planning and policy have been employed", "Identify how the physical characteristics that make up a city can produce patterns of inequality", "Recognize how marginalized groups engage with processes of social inclusion and exclusion", "Demonstrate the connection between urban infrastructure and urban livability", "2 The forces that shape cities", "3 The role of the state in development", "5 Alternative paths to economic growth", "6 Smart cities: The role of technology in urban planning and governance", "8 Seeing the city through the eyes of women and youth", "10 ‘Green’ infrastructure in emerging cities", "11 Physical infrastructure in emerging cities", "Urbanization in a Global Context.", "Read relevant textbook chapters before lectures.", "Notice of Recording", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 351, "course_code": "PLAN 341", "course_name": "PLAN341 - Ecology and Conservation for Planning (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Ecology and Conservation for Planning Winter 2025", "02:30PM - 05:20PM", "This course provides students with a critical understanding of the relationship between human development and natural environments.", "Students will develop an understanding of core ecological principles and how these can be taken up in plans and policies to promote nature conservation in urban and rural environments.", "The course will include examples of how planners mitigate the environmental impacts of development of land, allotment of open space and parks, and conservation of sensitive areas and species in both urban and rural contexts.", "understand biophysical and ecological processes in urban areas", "plan for biophysical and ecological process when developing and managing the built environment", "Overview of syllabus and foundational concepts", "Get into groups and choose case study for weekly activities and final project", "Spatial patterns and mosaics", "Urban water systems and water bodies", "Urban habitat and vegetation", "Urban features", "Readings", "The ecological and evolutionary consequences of systemic racism in urban environments.", "ECOLOGICAL URBANISM: A FRAMEWORK FOR THE DESIGN OF RESILIENT CITIES Yes 0", "Each quiz corresponds to the theme for each week.", "The first will critically engage with a recent and important contribution from Schell et al.", "Each Reflection Paper should be approximately 500 to 1,000 words and should answer the following questions:", "The case study should describe each of the focal ecological components of the city and develop a plan to improve or enhance the sustainability of these components.", "These will vary week to week, but are designed to prepare students to complete their case study assignment.", "The complete style outline can be found in the Publication Manual of the American Psychological Association, located in the reference section in Dana Porter Library, or on sale in the Book Store.", "APA Frequently Asked Questions - http://www.apastyle.org/learn/faqs/", "University of Wisconsin-Madison Writing Centre: http://www.writing.wisc.edu", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}]