[{"course_id": 571, "course_code": "SCI 252", "course_name": "SCI252 - Quantum Mechanics for Everyone (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Quantum Mechanics for Everyone Fall 2024", "This course offers an introduction to the basic concepts of quantum mechanics from a historical and philosophical perspective.", "SCI 252: View requirements for SCI 252", "Explain how quantum physics differs from classical physics", "Identify and summarize scientific results described in advanced popular science accounts presented in a variety of media (e.g., print, videos)", "Formulate appropriate critical questions in response to philosophical and historical texts and multimedia materials", "A current version of the Schedule of Topics and Readings is available on LEARN.", "This course includes the independent development and practice of specific skills, such as formulating and evaluating arguments.", "Library for research-based assignments", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Cross-listed courses"]}, {"course_id": 572, "course_code": "SDS 150R", "course_name": "SDS150R - Lifespan Processes (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["This course is an introduction to human development that spans conception to death.", "View requirements for SDS 150R", "This course is an introductory to human development that spans conception to death.", "It provides an overview of events which occur throughout the life course and consideration for how these may impact healthy development.", "The course applies a bio-psycho-social perspective and a scientific approach to understanding lifespan development.", "Human growth will be explored according to how biological and psychological determinants as well as how social environment impacts development.", "Describe key life events from conception to death", "Identify and describe major lifespan phases", "Define key changes and characteristics of each phase of life", "Implement the bio-psycho-social perspective and a scientific approach to lifespan issues", "Relate developmental theories and lifespan concepts to real-life situations", "Connect lifespan concepts to yourself and others, considering their implications", "1 Jan 6-10 Orientation, Introduction, and Basic Concepts Chapter 1", "2 Jan 13-17 Theories and Methods Corresponding chapters for your group presentation", "Class Attendance/Contribution and Peer Review 25%", "Class Attendance/Contribution and Peer Evaluation", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Anti-racism statement", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 573, "course_code": "SDS 250R", "course_name": "SDS250R - Social Statistics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["SDS 250R", "In this introductory level statistics course students will learn when and how to apply basic principles in the collection, manipulation, presentation, and analysis of numerical social science data.", "Students will build capacity to be informed consumers of quantitative and hypothesis testing information in social science research.", "View requirements for SDS 250R", "The primary goal of this course is to help students become informed consumers of quantitative information in social science research.", "identify variables in a data set and the level of measurement for each variable;", "describe the logic of hypothesis testing procedures and the use of inferential statistics in social research;", "read with ease basic quantitative information, including tables and graphs, and research \"findings,\" including hypothesis testing results in academic journals and the general media.", "Introduction and Basic Concepts", "Frequency of Distributions", "z-Scores and Central Limit Theorem", "The Correlation Coefficient", "Linear Regression", "Probability and Hypothesis Testing", "Probability and Hypothesis Testing", "t-Test and Confidence Intervals", "Online Midterms", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 574, "course_code": "SDS 251R", "course_name": "SDS251R - Social Research (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["SDS 251R", "SDS 251R 081", "SDS 251R:", "This course provides students with a fundamental grounding in social science research.", "View requirements for SDS 251R", "This course will provide students with a fundamental grounding in social research methods.", "Special emphasis will be placed on cultivating skills that are practical for research, as well as useful in the critical analysis of existing research.", "Understand all phases of the research process, including the formulation of the research questions and/or hypotheses, study design, and data collection.", "Identify the strengths and weakness of various qualitative and quantitative methodological approaches and become familiar with a number of practical concerns with social research.", "Use a critical perspective when examining the application of the various methodological approaches in the research and popular literature.", "Understand ethical issues in research conduct.", "Gain experience in developing survey instruments and interview guides.", "In the event that there are non-responsive members in the group:", "A case can be made for this action until one week before the due date."]}, {"course_id": 588, "course_code": "SOC 221", "course_name": "SOC221 - Research Methods (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Research Methods Spring 2023", "Email: adam.mursal@uwaterloo.ca", "An introductory survey of the research techniques commonly employed by sociologists, criminologists, and legal studies researchers.", "The formulation of research designs appropriate to various kinds of intellectual problems in social science is stressed.", "Comprehend fundamental research concepts and methodology (e.g., quantitative and qualitative research methods).", "Readings and Videos", "Introduction + General Research Orientations", "Research Designs", "Quantitative Analysis", "Structured Observation and Content Analysis", "Social Research Methods 6th Edition (Canadian Edition): 2022 Authors: Edward Bell; Alan Bryman; Steven Kleinknecht Yes", "*An older Canadian edition of the textbook can be used, however, students are responsible for ensuring the appropriateness of course context and matching the related chapters to assigned weekly readings.", "Assignment prompts: Must be 700-800 words in length, and are responses to a specific question provided as part of the lecture series.", "Prompt 1 Question: What are factors that may influence what a person decides to research in the social sciences?", "What are factors that might influence what you will propose to research in this course?", "In your response, please provide a clear argument and discussion either for or against the use of covert research methods in the social sciences.", "Students will create a study on a sociological/legal topic of their choosing that is both viable and realistic given the course context.", "Cross-listed courses", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website"]}, {"course_id": 589, "course_code": "SOC 229", "course_name": "SOC229 - Selected Topics in Criminology (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Selected Topics in Criminology Spring 2024", "F. Desroches", "Instructor: Fred Desroches", "Email and Posting Etiquette", "Please be considerate and polite in your postings and emails to the instructor.", "The vast majority of students are considerate in their communications but there are always a few who are impatient and impolite.", "Motivation, modus operandi, and the social characteristics of offenders will be examined in relation to such specific crimes as drug and sexual offenses, theft, robbery, murder, organized crime, and/or other criminal activities.", "A sociological analysis of research and theory on selected criminal activities.", "The course examines the motivation, modus operandi, and social characteristics of offences and offenders in relation to such crimes as robbery, prison riots, murder and hostage taking in prison, impersonal sex in public places, drug trafficking, and organized crime.", "Robbery and bank robbery,", "define and explain the nature of inmate “undesirables”,", "explain the reluctance of most inmates to participate in prison riots,", "critically discuss why prison guards are seldom injured in prison riots, and", "describe and explain the various patterns in prison riots,", "explain why guards are protected and seldom injured in prison riots,", "explain why inmates despise sex offenders/child molesters,", "compare and contrast the treatment of guards versus undesirables,", "critically analyze the powder keg theory of prison riots,", "describe the sample and research methodology used in Force and Fear,", "discuss variables that relate to a victim's decision to report a robbery offence,", "explain why robbery offenders agreed to be interviewed for this study.", "critically discuss laws related to robbery,", "explain why robbery is viewed as a serious offence, and", "differentiate between the three types of robberies,", "discuss the characteristics of robbery,", "discuss and explain characteristics of robbery offenders,", "discuss the causal effects of drug usage, gambling, and socioeconomic status,", "differentiate between initial motivation and the motivation to continue,", "explain and critically discuss the various motivational components in robbery,", "critically analyze the role of the media in the motivation to robbery,", "discuss the lifestyle and spending habits of robbery offenders, and", "describe and analyze the three types of bank robbery based on M.O.,", "explain key choices that bank robbers make related to weapons, getaway, and partners, and", "explain the location of tearooms and how they are discovered, and", "discuss and analyze the rules of the game and the function these rules serve,", "explain the various roles of the participants in tearoom sexual encounters,", "critically analyze the insertee and insertor roles and the aging crisis,", "outline how tearoom participants communicate through non-verbal gestures,", "explain how these gestures work and their function in protecting participants, and", "outline the characteristics of \"trade\" and \"closet queens,\"", "analyze these types in relation to the insertee/insertor roles.", "compare Humphreys' and Desroches' findings dealing with the breastplate of righteousness,", "critique Humphreys' protection hypothesis,", "explain and analyze the reaction formation hypothesis,", "explain and analyze the self-validation hypothesis, and", "compare and contrast the two research methodologies discussed,", "compare participants in both studies in relation to age and occupational status,", "compare participants in both studies in relation to marital status, and", "explain why bisexuals and closet queens frequent tearooms,", "explain why relatively few gay men participate in tearoom sex,", "explain the nature of drug trafficking and supply chains,", "critically discuss the effect of drug prohibitions,", "compare and contrast retail versus higher-level drug trafficking,", "explain how economic models can shed light on organized crime and drug trafficking,", "compare and contrast legitimate business versus illegitimate business,", "compare and contrast “businessman” versus “criminal” drug traffickers,", "critically analyze and explain the morality and egos of higher level dealers,", "discuss the lifestyle and spending of higher level dealers,", "critically discuss the reasons why dealers fail to get out of crime.", "critically analyze the various techniques dealers use for security purposes.", "define fronts and why drug traffickers use them,", "discuss risks and other problems related to drug debts,", "critically explain the use and non-use of violence in relation to drug debts and biker gangs, and", "Module 09: Modus Operandi and Robbery", "Module 12: A Typology of Tearoom Participants", "TRAFFICKING AND", "Module 19: Modus Operandi – Marketing and Security", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 591, "course_code": "SOC 280", "course_name": "SOC280 - Social Statistics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Statistics for Arts Students Fall 2024", "Email: ogallupe@uwaterloo.ca", "Division of email duties", "A-Bh Dhanju", "Bo-Ki Eatock", "Ko-Ry Karimi", "Sa-Z Legault-Leclaire", "Email: jdhanju@uwaterloo.ca", "Email: keatock@uwaterloo.ca", "TA: Nima Karimi", "Email: n4karimi@uwaterloo.ca", "Email: j4legaul@uwaterloo.ca", "Covers a range of statistical techniques including t-tests, one-way ANOVA, Chi square, and bivariate correlation/regression.", "A basic course in statistics used in social science research including sampling, central tendency, probability, and covariance, as illustrated in specifically sociological and criminological data.", "Students will be expected to learn how to recognise and match the correct test to a given research question.", "Assumptions of statistical tests and correct interpretation will be stressed in this course.", "The course will start with a basic overview of important statistical concepts and progress through descriptive and bivariate statistics and end with multivariate analysis.", "Students should do the readings in advance of each lecture.", "Continuity of Education Plan", "6 Statistical models 38-48", "10 Comparing two means 326-356", "11 Nov 18– 22 14 Linear regression 276-323 (just give a quick skim of 315-319)", "https://uwaterloo.atlassian.net/wiki/spaces/ACOHD/pages/819858617/Remote+access+to+software  Alternatively, if you want a copy of SPSS on your own computer, you can get a six month rental for $69.58 (IBM SPSS Statistics Standard GradPack 29).", "Students can choose to submit via email if they do not want their work scanned by Turnitin, but they must notify the instructor by the end of the first week of the term if they are choosing this option.", "Intellectual property includes items such as:", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "This course includes the independent development and practice of specific skills, such as statistical analyses.", "Library for research-based assignments"]}, {"course_id": 592, "course_code": "SOC 322", "course_name": "SOC322 - Field Research Methods (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Field Research Methods Winter 2024", "08:30AM - 09:50AM AL 105", "Email: kkpadda@uwaterloo.ca", "** Please note that I won't be answering any questions regarding course material (for example - definitions of concepts, differences between theoretical perspectives, etc.) over email.", "I believe that these types of questions are best discussed in person.", "Office Hours: By appointment & via Zoom", "This course provides a critical evaluation of research techniques in sociology, criminology, and legal studies with an emphasis on learning and applying qualitative fieldwork approaches.", "Antireq: SDS 351R", "Explain the nature and purpose of qualitative research in the field of Sociology and Criminology", "Formulate research questions and draw connections to theoretical constructs that emerge from the data.", "Recognize and critically evaluate ethical issues and considerations in qualitative interdisciplinary research and the implications of ethical decisions on participants, researchers, and communities.", "Demonstrate understanding of theoretical, practical, and critical aspects of qualitative research.", "By experimenting with different qualitative research methods, you'll develop an invaluable toolkit of knowledge and experiences that will be useful in the future - whether you're heading to graduate school, working in research settings, or designing projects in the workplace.", "Readings", "Introduction to the course", "Introduction to Qualitative Research Methods + Asking Questions and Identifying Goals", "Chapter 1: Introduction", "Strategies for Designing Research", "Chapter 3: Strategies for Designing Research", "Ethical Issues in Research", "23-Jan", "Ensuring Quality in Qualitative Research", "Sample sizes for saturation in qualitative research: A systematic review of empirical tests.", "On science and the logic of case selection in field-based research.", "Interview partners + contracts", "Indigenous and Decolonizing Research Methodologies I", "Social Identity Map: A Reflexivity Tool for Practicing Explicit Positionality in Critical Qualitative Research.", "Field Methods 34(2): 181–88. 1525822X221093824.", "Interview I", "Chapter 6: In-Depth Interviewing", "Interview III", "Interpreting Qualitative Data I", "A Pragmatic Introduction to Doing GT Research.", "Sociological Methods & Research.", "Interpreting Qualitative Data II", "NVivo Analysis + mid-semester check-in", "Interpreting Qualitative Data III", "Visualizing qualitative data in evaluation research.", "On-line serial], 2(3).https://doi.org/10.46743/2160-3715/1995.2061", "Unobtrusive Methods/ Digital Ethnography I", "Digital Ethnography II", "Ethnography and Observation I", "A Decolonizing Method of Inquiry: using institutional ethnography to facilitate community-based research and knowledge translation.", "doi:10.1177/1466138113513526", "Ethnography and Observation II", "No Magic!", "Ethnoscripts 23: 92–115.", "Ethnography and Observation III", "Ethnography and Observation IV", "Unlock the power of qualitative research and potential challenges", "*Qualitative Research Findings leading Machine Learning and other big-data research", "Drop-in office hours", "Drop-in office hours", "----", "Students will complete the Tri-Council Policy Statement CORE-2022 course, which provides them with an institutionally recognized certificate of completion.", "You will be conducting a preliminary analysis, including identifying themes and making connections to your existing disciplinary knowledge.", "The research question should be something that can be observed, and you need to take detailed descriptive and analytic notes during the observation.", "You will be formulating a research question that can be explored through online non-participant observation.", "You will be revisiting your initial proposal submission and will be incorporating the feedback you received and the knowledge you have gained since the original submission.", "As a final component of the course, you will be asked to submit a comprehensive reflection, which is open-ended and allows you to discuss your learning, challenges faced during the course, future goals, skills developed, and how you can communicate these skills to different audiences, be it academic or non-academic.", "This course includes the independent development and practice of specific skills, such as critical thinking; synthesizing and analyzing information; developing and practicing writing skills.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 611, "course_code": "STV 201", "course_name": "STV201 - Society, Technology and Values: Special Topics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["E5 6111", "Study of the interaction of society, technology and values in a particular topic area under tutorial guidance by visiting or adjunct faculty.", "The course does not require advanced technical knowledge and encourages students of all faculties to enroll.", "understand and apply a pluriversal perspective to technological and social considerations in their field of study.", "describe the social and environmental consequences of the current economic models of the Global North in the 21st century.", "facilitate meaningful conversations/encounters that allow for multiple ways of knowing and seeing the world to be expressed and valued.", "Translation and the power of language in structuring worlds/ontologies.", "Colonialism and Amazonia.", "Small groups will facilitate a workshop on a topic of their choosing from a selected set of themes/resources.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 614, "course_code": "SWREN 250R", "course_name": "SWREN250R - Social Statistics (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Social Statistics Spring 2024", "This introductory level statistics course will emphasize the collection, manipulation, descriptive presentation, and statistical analysis of social research data.", "The primary goal of this course is to help students become informed consumers of quantitative information in social science research.", "identify variables in a data set and the level of measurement for each variable;", "describe the logic of hypothesis testing procedures and the use of inferential statistics in social research;", "read with ease basic quantitative information, including tables and graphs, and research \"findings,\" including hypothesis testing results in academic journals and the general media.", "Introduction and Basic Concepts", "Frequency of Distributions", "z-Scores and Central Limit Theorem", "The Correlation Coefficient", "Linear Regression", "Probability and Hypothesis Testing", "Probability and Hypothesis Testing", "t-Test and Confidence Intervals", "Online Midterms"]}, {"course_id": 615, "course_code": "SWREN 251R", "course_name": "SWREN251R - Social Research (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["SDS 251R / SWREN 251R", "Introduction to the philosophy and methodology of applied social science research, including treatment of the problems and strategies of research design and execution.", "This course will provide students with a fundamental grounding in social research methods.", "Special emphasis will be placed on cultivating skills that are practical for research, as well as useful in the critical analysis of existing research.", "Understand all phases of the research process, including the formulation of the research questions and/or hypotheses, study design, and data collection.", "Identify the strengths and weakness of various qualitative and quantitative methodological approaches and become familiar with a number of practical concerns with social research.", "Use a critical perspective when examining the application of the various methodological approaches in the research and popular literature.", "Understand ethical issues in research conduct.", "Gain experience in developing survey instruments and interview guides.", "In the event that there are non-responsive members in the group:", "A case can be made for this action until one week before the due date."]}, {"course_id": 622, "course_code": "COMMST 100", "course_name": "COMMST100 - Interpersonal Communication (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["jclausen@uwaterloo.ca (please do not use the D2L email system)", "I monitor my email M-F, 9:00 am - 5:00 pm.", "Focuses on the one-to-one, face-to-face communication in both the personal and professional realms.", "Such topics as verbal and non-verbal interactions, listening, and the better management of interpersonal communication will be studied.", "In this course, we will work to understand more fully how we communicate (and are communicated to) in the world we live in and to develop the tools to research, apply, and practice key interpersonal communication concepts in our everyday lives.", "Students will be encouraged to identify, negotiate, and challenge existing communicative norms as they explore a range of interpersonal and intrapersonal issues that include culture, identity, and power.", "Understand the complexity of communication as a human process of shared meaning- making in the context of power, history, and culture", "Increase your capacity to recognize and enhance yours and others’ agency – the ability to make a difference in the world for yourself and others – and understand the implications of your communication behaviours for yourself and others", "Understand communication as a practice and improve your critical and creative communication competencies by developing your ability to use writing and other media of communication to create meaning", "This entails opportunities for student-directed inquiry, challenge and risk-taking, and reflection on your roles and responsibilities", "Reflect on your role in fostering the public good (the multifaceted well-being of individuals and groups), begin to imagine a better future, and make decisions in your communication that can transform the communities to which you belong", "Recognize diverse linguistic practices and modes of expression as resources for writers and speakers", "Introduction", "Read: Meaning as Co-Created", "Read: “Cultural and Historical Influences: Communication Competence in Context”", "Exceeds assignment guidelines; strong and consistently applied definition of audience and purpose; thoughtful and innovative adaptation of the subject to the audience’s needs; subject developed and organized at every level for listener comprehension; speaker uses language appropriately, effectively and even inventively; maintains relaxed, inviting delivery free of verbal fillers and distractions; cites sources appropriately both in spoken and written work; submits well prepared required materials.", "Your entries should be roughly two typewritten, double- spaced pages each although they can go slightly over.", "While the amount you write under each heading may change week to week, this format allows you to address each area regularly.", "Decide how often you will communicate and in what manner.", "Decide how you will divide the workload and handle conflicts.", "Handing in a clear contract will earn 5%.", "Your job will be to engage the class and apply what we are reading to people’s own opinions, experience, etc. Sign up for this assignment is on a first-come/first-served basis starting during week two of classes.", "Group Presenation 2: Final Presenation You and your group will create a fifteen-minute videotaped presentation exploring a problem in interpersonal communication and proposing a solution for that problem.", "This presentation will involve research into a specific issue related to interpersonal communication and creating good reasons for following your proposed solution.", "This course includes the independent development and practice of specific skills, such as self reflection, critical thinking skills and interpersonal communication.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 625, "course_code": "COMMST 191", "course_name": "COMMST191 - Communication in the Engineering Profession (AE, CIVE, ENVE, GEOE) (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["jclausen@uwaterloo.ca (please do not use the D2L email system)", "I monitor my email M-F, 9:00 am - 5:00 pm.", "I am teaching multiple communication courses, and especially early in the sememster, I cannot always quickly know whch course you are referring to just from your email.", "In this course students in Architectural, Civil, Environmental, and Geological Engineering will enhance oral and written communication competencies in contexts relevant to the engineering profession.", "In this course, you will work to enhance your written and oral technical communication competencies in contexts relevant to the engineering profession as well as to your future career.", "More generally, in this course, you should anticipate learning what professional norms of technical communication and dominant forms of sharing knowledge prevail within and across the fields of engineering.", "Yet this course also attempts to impart awareness and appreciation for how these communicative forms are matters of social context and sites of negotiation and contestation.", "By extension, this progression also encourages you to find a place and voice in the conversations within your fields of study and to reflect upon the meaning and shape of available forums for technical communication.", "I perceive our classroom as a co-constructed space, in which readings and discussions may frequently challenge your attitudes, your unconsciously held beliefs, or your positions on current issues.", "To ensure a safe and open space in which all can converse and learn productively, it is vital that we conduct our relationships with respect and an ethic of care.", "Describe and apply conventions, genres, norms, and values of communication in an engineering discipline;", "Compose persuasive, audience-specific technical arguments;", "Analyze and summarice technical content in clear and concise ways;", "Deliver effective oral presentations; and", "Appraise and reflect on their own compositions, and those of their peers, to strategically revise and edit documents and presentations", "Objectives for Students of Communication Studies", "You (students) will understand the complexity of communication as a human process of shared meaning-making in the context of power, history, and culture.", "You will increase your capacity to recognize and enhance yours and others’ agency – the ability to make a difference in the world for yourself and others – and understand the implications of your communication behaviors for yourself and others.", "Recognize diverse linguistic practices and modes of communication as resources for writers and speakers.", "You will understand communication as a practice, and improve your critical and creative communication competencies by developing your ability to use writing, speaking, and other media of communication to create effective and engaging artifacts.", "Your will reflect on your role in fostering the public good (the multifaceted well-being of individuals and groups), begin to imagine a better future, and make decisions in your communication that can transform the communities to which you belong.", "Introduction to Communication/What is this course about?", "Audience Analysis", "Demographics and Professional Audiences", "Researching and Describing Technical Subjects", "Chapter 11: Technical Definitions and Descriptions", "In-class Oral Proposals", "Document Design and Models of Communication", "Feb 15-21  R    E    A    D    I    N    G      W    E    E    K", "March 4: Research Abstract", "Stakeholder Analysis and Persuasion", "“Identifying and Analyzing Stakeholders and Their Interests” (Online)", "Nov. 14:  Stakeholder Analysis In-class Activity", "Ethics", "Joy Buolamwini, “How I’m Fighting Bias in Algorithms,” TED (Video)", "Engagement and contribution is demonstrated in a number of ways.", "At the end of the term you will have a chance to make the case for what grade you believe you should receive with a self-assessment.", "Did I contribute something for each of the activities (if any) listed for that week?", "Did I make my contributions available to my peers in a timely manner that they can respond and engage with it?", "In this assignment, you will choose a specific topic related to civil engineering and identify an overarching problem to produce a project proposal.", "In this assignment you will creating a proposal in response to an imagined request for proposals (RFP) from a contractor in the industry, and presenting that proposal in a short three-minute pitch for your classmates, who will consider the persuasiveness of your proposal.", "Failures of retaining walls", "Failures of suspension bridges", "Importance and justification of arches", "Role of surveying in engineering", "In groups of 2 or 3, you will provide a technical summary of that element for a public, non-specialist audience.", "You will present a summary of the project element as a poster presentation on a standard 24x36 inch poster board using a combination of written and graphic communication.", "We may be involved in a public displaying of the posters we create, alongside students from other sections of Engineering Communication on evening in February over in one of the Engineering buildings.", "Part 2: Research Abstract", "The abstract should provide information relevant to solutions to the problem you articulated in your proposal and continue to advocate for a particular solution/recommendations.", "For the final project you will create a policy brief aimed at a clear stakeholder audience.", "Instructions", "A formal policy brief includes the following sections:", "Executive summary", "Explanation of results", "identify and address a specific policy-making audience", "explain the current research on this topic in clear, non-technical language", "highlight the features of the research most relevant for policy makers and stakeholders", "make one or two recommendations based on your synthesis of the research", "Natural Resource Development", "Climate Change Impact", "Mass Transportation Design", "Communicative competencies will play a significant role in distinguishing the most successful engineers from others who are equally skilled technicians but who lack the ability to communicate effectively.", "You will hand-in a 200 word individual reflection on the process of translating engineering concepts for a public non-expert audience.", "You should reflect on what skills, competencies and concepts you used in creating your final project.", "What do you think are your strengths and weaknesses in communicative competencies?", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 626, "course_code": "COMMST 192", "course_name": "COMMST192 - Communication in the Engineering Profession (COMPE, ELE, MGTE) (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["D. Shakespeare", "In this course students in Computer, Electrical, and Management Engineering will enhance oral and written communication competencies in contexts relevant to the engineering profession.", "By participating in classes and completing course assignments, you will practice genres of communication crafted for audiences that might include employers, clients, peer groups, technical staff, public audiences, and regulatory and policy-focused stakeholders.", "By focusing on genre, design, and audience, you will come to better understand concepts including meaning-making, perception, and responsibility.", "More generally, in this course, students can and should learn professional norms of technical communication and dominant forms of sharing knowledge within the fields of engineering.", "Yet this course also attempts to teach students how these communicative forms are matters of social context and sites of negotiation and contestation.", "We also hope students will find their place and voice in the conversations in their fields of study and reflect on the meaning and shape of available forums for technical communication.", "describe and apply conventions, genres, and norms, and values of communication in an engineering discipline", "compose persuasive, audience-specific technical arguments", "analyze and summarize technical content in a clear and concise way", "You (students) will understand the complexity of communication as a human process of shared meaning-making in the context of power, history, and culture.", "You will increase your capacity to recognize and enhance yours and others’ agency – the ability to make a difference in the world for yourself and others – and understand the implications of your communication behaviours for yourself and others.", "You will recognize diverse linguistic practices and modes of communication as resources for writers and speakers.", "You will understand communication as a practice, and improve your critical and creative communication competencies by developing your ability to use writing, speaking, and other media of communication to create effective and engaging artifacts.", "You will reflect on your role in fostering the public good (the multifaceted well-being of individuals and groups), begin to imagine a better future, and make decisions in your communication that can transform the communities to which you belong.", "4 September Introduction to the Course \"The Art of Communicating Science\" (TED) acquire course text", "9 September Introduction to Rhetoric; Facts, Evidence, and Opinions Crowley & Hawhee; McBrayer read assigned texts", "18 November Ethics for Engineers in-class texts", "27 November Discourse and Power", "Late assignments will be penalized at a rate of 3% per day, including weekends and holidays.", "To record your efforts, you will be given a participation sheet that you will complete at the end of each session: you'll rate yourself for your performance and describe your in-class activities.", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website"]}, {"course_id": 628, "course_code": "COMMST 223", "course_name": "COMMST223 - Public Speaking (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["In the case of service interruptions to the LEARN system, please see the LEARN Service Interruption Policy https://uwaterloo.ca/secretariat-general-counsel/service-interruptions-online-learning-environment-guidelines", "A workshop course involving design and delivery of various kinds of speeches, and the development of organizational, vocal, listening, and critical skills.", "Apply speech communication concepts in designing and delivering public speeches and digital productions", "Understand and negotiate cultural assumptions and expectations in public address", "Foundations of a public speaking performance", "Your first speech: Informing about your language", "First speech workshop: a life story of the language I speak (voice, body, presence)", "First speech presentation 1", "First speech presentation 2", "Oct. 3: Read: Evaluating speeches critically (Zarefsky & Engels)", "First speech presentation 3", "Discussion and Introduction to Second Speech Assignment: Persuading a local audience", "(and Choosing your topic -CH 6 .Zarefsky & Engels)", "Your second speech: persuading a local audience", "(Ch 14 and Ch 16 -up until 16.5-, Zarefsky & Engels)", "Second Speech Development", "Exercise # 2: Describe a local situation and evaluate it as a problem for your peers - 90 sec. speech", "Mediated public speaking: Persuading a Digital Audience", "Read; Appendix B, Ch. 16, Zarefsky & Engels", "Development & Research of your project", "Nov. 26 &", "Second Speech: Persuading a Local Audience 30%", "Third Speech: Persuading a Digital Audience 30%", "First Speech: Informing about your language", "The goal of this speech is for you to inform your audience about how your mother tongue  background, individual experience, and culture impact your self-concept, language use, sense of audience perceptions, constraints stemming from communicative norms, and methods you employ to negotiate various rhetorical situations.", "Second Speech: Persuading a Local Audience", "Third Speech: Persuading a Digital Audience", "3 short speech excercises: 3.33% each for a total of 10%", "You should also write a few brief notes on why you chose each quotation.", "How does it relate to the class?", "The moderator is responsible for running the class in an efficient and creative manner: introducing speakers, organizing the discussions with the evaluators, initiating class comments, and generally making sure that the session runs smoothly and according to schedule.", "90-Second Short Speech Exercises  (3 total, marked for completion):", "These public speaking exercisesintroduce students to fundamental rhetorical concepts and strategies.", "Over the course of the semester, you will present three exercises as 90-second speeches in front of the class or in small groups.", "For the first and second major assignments of the term, you will offer and accept productive feedback and produce brief analyses of your peers’ speeches in two-page, double-spaced papers (one each for the first and second major speech rounds).", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 638, "course_code": "CROAT 101", "course_name": "CROAT101 - Elementary Croatian 1 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Write simple sentences and short compositions in Croatian.", "Grasp how language reflects and shapes cultures and communication styles.", "Razgovarajte s nama!", "Udžbenik hrvatskoga jezika za razine A1-A2 prvo izdanje.", "Razgovarajte s nama!", "Vježbenica hrvatskoga jezika za razine A1-A2 prvo izdanje.", "I strongly suggest you enrol and take advantage of this free course.", "In exceptional situations, extension requests within the 24-hour period may be considered.", "This course includes the independent development and practice of specific skills, such as language learning skills, comprehension of the new language, written and oral production in the new language.", "Library for research-based assignments"]}, {"course_id": 639, "course_code": "CROAT 102", "course_name": "CROAT102 - Elementary Croatian 2 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["A continuation of CROAT 101.", "Write simple sentences and short compositions in Croatian", "Grasp how language reflects and shapes cultures and communication styles", "Razgovarajte s nama!", "Udžbenik hrvatskoga jezika za razine A1-A2 prvo izdanje.", "Razgovarajte s nama!", "Vježbenica hrvatskoga jezika za razine A1-A2 prvo izdanje.", "I strongly suggest you enrol and take advantage of this free course.", "In exceptional situations, extension requests within the 24-hour period may be considered.", "This course includes the independent development and practice of specific skills, such as language learning skills, comprehension of the new language, written and oral production in the new language.", "Library for research-based assignments"]}, {"course_id": 640, "course_code": "DAC 203", "course_name": "DAC203 - Designing Digital Sound (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Designing Digital Sound Winter 2025", "DAC 203 / ENGL 304", "DAC 203 / ENGL 304 001", "10:00AM - 11:20AM ECH 2113", "In the case of service interruptions to the LEARN system, please see the LEARN Service Interruption Policy https://uwaterloo.ca/secretariat-general-counsel/service-interruptions-online-learning-environment-guidelines", "DAC 203: View requirements for DAC 203", "ENGL 304: View requirements for ENGL 304", "My background is in oral history-based theatre and performance.", "We will explore issues and debates in sound studies and related fields through the discussion of regular readings; we will also hone our skills in class through projects and assignments.", "Analyze and understand recorded sound through close listening and application of key concepts.", "Conduct effective peer review in support of iterative sound design processes, including reflection and revision.", "Apply concepts in sound studies to the analysis of existing audio recordings and the creation of new ones.", "Understand the function of genre and media in the creation and reception of sound works.", "Basic Concept: Sound,", "A brief history of recording by Beardsley and Leech-Wilkinson:", "Getting started - import and play + label, Save and open a project", "(3) Storytelling in radio and podcasts, Chapter 1, Section 1.4 Narrative Audio: Create a Sonic Experience, p. 13 - 19;", "First project creation workshop - Doing a good quality voice recording", "Watch: What is a field recording https://youtu.be/7dUy8pkyYg8?si=7vXLA8XDf-gNmKT1", "First project creation workshops", "Field recorders, microphones, the sound booth", "Do field recordings and develop your first project", "Read: Chapter 2 - Current generation  audio hardware in Sound and Music for Games.", "Audio - Vision", "Second Audio Project Development", "Second Audio Project Development", "Planning a larger digital audio  project", "Proposal & workshops", "Sound as a medium of art.", "Research & Development", "Topic, Reading tbc: Editing & Mastering", "The Sony MDR-7506 and Audio Technica ATH-A700X are recommended.", "A cheaper model is the Audio Technica ATH-T400.", "This written assignment is meant to scaffold your understanding of what might be some of the functions of genre and media in the creation and reception of sound works (see Learning Outcomes).", "However, if you follow a podcast or know of one that catches your attention, you may also use it as a case study for your reflection.", "In your own words, describe its overall sound design.", "A rubric in LEARN will give you a sense of how I will grade your essay.", "Using a field recorder, record sounds that characterize that place.", "Speak in the first person singular and the present tense.", "For instance: \"I am standing next to the first building where I slept when I first landed in Canada.\"", "Or, \"This is the walk-in clinic where a doctor saw me when I had terrible abdominal pain and did not have a family doctor.\"", "Although I will not assess your skills as a storyteller, a clear story will be a bonus.", "( I will share the OneDrive folder later)", "Create a \"soundtrack\" for a short film clip (2 - 3 minutes long) of your choice.", "( I will share the OneDrive folder later)", "( I will share the OneDrive folder later)", "Participation: to achieve the highest grades for participation, you must attend all classes; show up having done the assigned readings; and actively engage in discussions and activities in ways that enhance learning for yourself and others.", "This course includes the independent development and practice of specific skills, such as critical writing skills and digital audio production, including voice overs for your content.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 642, "course_code": "DUTCH 101", "course_name": "DUTCH101 - Elementary Dutch 1 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Instructor: Margreet de Rooij-Mohle", "Your instructor checks email and the Ask the Instructor discussion topic frequently and will make every effort to reply to your questions within 24–48 hours, Monday to Friday.", "Introduction to aspects of Dutch culture.", "introducing oneself and others;", "ordering drinks and food; and", "The discussion areas are a safe environment to try things, make errors, and learn from them!", "Since no language exists in isolation, this course does offer an introduction in Dutch culture and society as it pertains to the language functions introduced.", "I will provide you with a number of links to external websites which might be of interest to you as well.", "Have a basic conversation in Dutch on familiar topics", "Understand basic communications in spoken or written Dutch", "Understand some basic cultural aspects of Dutch society", "Nederlands in gang.", "Library for research-based assignments"]}, {"course_id": 643, "course_code": "DUTCH 102", "course_name": "DUTCH102 - Elementary Dutch 2 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Instructor: Margreet de Rooij-Mohle", "Your instructor checks email and the Ask the Instructor discussion topic frequently and will make every effort to reply to your questions within 24–48 hours, Monday to Friday.", "A continuation of DUTCH 101.", "The focus of this course is on continuing the development of basic communicative competence in Dutch.", "shopping and clothes", "homes and furniture", "bikes and getting things fixed", "asking for and giving directions", "The discussion areas are a safe environment to try things, make errors, and learn from them!", "Since no language exists in isolation, this course does offer an introduction in Dutch culture and society as it pertains to the language functions introduced.", "I will provide you with a number of links to external websites which might be of interest to you as well.", "Nederlands in gang."]}, {"course_id": 644, "course_code": "ENGL 109", "course_name": "ENGL109 - Introduction to Academic Writing (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Academic Writing Winter 2025", "View requirements for ENGL 109", "You will learn about different forms of academic writing, as well as the processes that great writers engage in to create their best work.", "Even programs like engineering, or accounting, or geography include major writing assignments, especially in upper years, in part because they recognize that careers in those fields require far more writing than students might expect.", "Because we value learning as a social activity, and thus recognize that writers and readers learn from one another, much of your work in English 109 will involve different kinds of collaboration with your peers.", "think critically and communicate effectively;", "These quick interactive elements provide opportunities to test your understanding of course concepts but are not graded.", "Standard of Work", "Every member of this course—instructors as well as students—has rights and responsibilities to ensure a pleasant and productive experience for all.", "Online Etiquette", "Exemptions from late penalties can only be given where there are significant extenuating circumstances.", "Intellectual property includes items such as:", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 645, "course_code": "ENGL 119", "course_name": "ENGL119 - Communications in Mathematics and Computer Science (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "ENGL 119: Communications in Mathematics and Computer Science Winter 2025", "10:00AM - 11:20AM B2 350", "Technical Support: If you experience a technical issue in LEARN, then email learnhelp@uwaterloo.ca", "This course aims to build students' oral and written communication skills to prepare them for academic and workplace demands.", "Working independently and in collaboration with others, students will analyze and produce various written and spoken forms of communication.", "View requirements for ENGL 119", "COURSE DESCRIPTION AND DESIGN", "Design:", "Demonstrate critical thinking, reading, and writing skills;", "Research, cite, and produce written communications on STEM-related topics;", "(At the time of writing this note, there is also a second option of printing a poster via the Waterloo Public Library—Eastside Branch, which has a large-format printer [", "The content and instructions for each knowledge check will be revealed in class on the specified due date.", "The knowledge checks will require students to apply or discuss what they have learned in each unit, drawing on the course materials in their answers, and completing them by the end of the class session.", "In essence, students can choose between two options: either write a traditional speech and record a simple video of themselves delivering it while standing up OR write a podcast-style script and record a video of themselves sitting down that incorporates some creative elements too (e.g., free music clips, visual aids, or other engaging features).", "Notice of Recording", "Notice of Recording", "Major assignments submitted late may incur a penalty of 2 marks deducted (e.g., as a general example, a grade of 19/25", "Assigned Letter Grades Percentage Values Average Calculation Values", "A 85–89 89", "Exceeds Expectations: A numeric grade in the 80–100% range corresponds to the A-level and indicates that the quality of the student’s work exceeds standard expectations for the major assignment.", "Meets Expectations: A numeric grade in the 70–79% range corresponds to the B-level and indicates that the quality of the student’s work meets standard expectations for the major assignment.", "Misses Expectations: A numeric grade in the 50–59% range corresponds to the D-level and indicates that the quality of the student’s work misses standard expectations for the major assignment.", "Exceptions will be considered on a case-by-case basis to ensure fairness and consistency, but there is no guarantee that a student’s circumstance will be considered extenuating/unforeseen and warrant such an accommodation.", "Please be aware that GenAI is known to falsify references to other work and may fabricate facts and inaccurately express ideas.", "On-campus supports:", "Off-campus supports:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 648, "course_code": "ENGL 191", "course_name": "ENGL191 - Communication in the Engineering Profession (AE, CIVE, ENVE, GEOE) (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["e-mail: cgiannak@uwaterloo.ca", "In this course students in Architectural, Civil, Environmental, and Geological Engineering will enhance oral and written communication competencies in contexts relevant to the engineering profession.", "View requirements for ENGL 191", "Students will enhance their critical-thinking skills and creative competencies to better understand meaning-making, perception, and responsibility.", "Explain the role of reports, the press, advertising, video and other communications media in engineering [", "Demonstrate command of appropriate writing skills and style [", "Construct a persuasive technical argument [", "Week 1: Professional Communication in Engineering", "- Introduction to Course; Writing Email/Letters for the Workplace; Loss Control Bulletin/Saving Email; Intro to Assignment 1: Pitch Email", "Week 2: Communicating Problems in Engineering", "- Swales CARS model of Engineering Articles; Info-Seeking Module; Proposal Pre-Research Exercise; Bibliographies", "- Engineering Case Studies; Cases: Responding and Reporting; Usability Testing; Introduction to Assignment 3: Engineering Proposal; Week 6 Check-In", "- Introduction to Engineering Proposals; Writing Winning Proposals; Charts & Budgets", "- Audience and Appeals; Applying rhetorical and persuasive techniques; Applying Swales CARS to the proposal genre; Introduce Assignment 4: Reflection", "Week 9: Designing Documents & Layouts", "Writing in the Technical Fields: A Practical Guide.", "You will be able to access and complete key components of the course at a week-to-week pace online.", "Content for each week will be delivered in the form of modules.", "The main assignments in the course function as parts of a whole: the pitch, progress report, proposal, and reflection form a course-long project whose theme and structure you should consider from the start of the term.", "The proposal, in addition to being a well-conceived, clearly structured, and persuasive document, is intended to communicate an engineering idea you wish to pursue, an idea you will first present through the pitch email.", "We will discuss how to do this in our first weeks together.", "Assessment & Accommodation", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 649, "course_code": "ENGL 192", "course_name": "ENGL192 - Communication in the Engineering Profession (COMPE, ELE, MGTE) (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["In this course students in Computer, Electrical, and Management Engineering will enhance oral and written communication competencies in contexts relevant to the engineering profession.", "Students will enhance their critical-thinking skills and creative competencies to better understand meaning-making, perception, and responsibility.", "Explain the role of reports, the press, advertising, video and other communication media in engineering", "Demonstrate the command of appropriate writing skills and style", "Construct a persuasive technical argument", "Organize and deliver a persuasive oral presentation", "• Audience, Purpose, & Genre", "Thursday, January 9 • Show & Tell: Controversial Tech", "• Choose team members and case study for assignments 1 & 2", "• Familiarize yourself with IEEE citation standards", "• Technical Reports", "• Show & Tell: Useless Tech", "Due in class: Draft of Op-Ed", "• Relax!", "You’re done!!!", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "A held-with course will also only count towards program and breadth requirements of the subject code under which it is taken, unless it is cross-listed with the subject code of its’ held-with course.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 653, "course_code": "ENGL 210G", "course_name": "ENGL210G - Genres of Fundraising Communication (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["10:00AM - 11:20AM PAS 1237", "Describe genre concepts grounded in rhetoric and technical communication research", "Apply concepts from genre studies to fundraising genres", "Write into genres of fundraising in a persuasive manner", "Lynn & Wahlin; refer to Learn.", "Budgets and their Justification", "Reading Week Break", "Reading Week Break", "In the case of an emergency, Professor Mehlenbacher will discuss options for missed deadlines with you, so please always ensure to first attend to your wellbeing.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 656, "course_code": "ENGL 210J", "course_name": "ENGL210J - Technical Editing (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["ENGL 210J", "11:30AM -", "Email: clive.forrester@uwaterloo.ca", "View requirements for ENGL 210J", "Participants will finally be introduced to the basics of working with editing software.", "Edit and improve overall readability of a variety of document types", "Describe the different levels of editing", "Create original material for use in editing demonstrations", "Reading & Assignment", "Introduction", "Types and Purposes of Technical Editing", "Course Introduction", "Methods of assessment", "Expectations", "Practice exercise in editing", "Levels of Editing & Ethics", "Communication in the technical arena", "Ethical considerations in professional editing", "Editing for Product manuals", "Editing product manuals", "Editing operational and maintenance instructions", "Sample editing workshop", "Editing for Journalism and the Media", "Editing in the media", "Style and function of media writing", "Editing for social impact", "Fact-checking stories", "45-51", "Editing in the legal field", "Legalese and communication in the law", "Converting legal writing to plain English", "Readability & User Experience:", "Scientific language - style, conventions and usage", "Editing scientific language for accuracy", "Editing scientific work for public consumption", "Editing Workshop - Science", "Keeping in Touch With Me"]}, {"course_id": 657, "course_code": "ENGL 304", "course_name": "ENGL304 - Designing Digital Sound (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Designing Digital Sound Winter 2025", "DAC 203 / ENGL 304", "DAC 203 / ENGL 304 001", "10:00AM - 11:20AM ECH 2113", "In the case of service interruptions to the LEARN system, please see the LEARN Service Interruption Policy https://uwaterloo.ca/secretariat-general-counsel/service-interruptions-online-learning-environment-guidelines", "DAC 203: View requirements for DAC 203", "ENGL 304: View requirements for ENGL 304", "My background is in oral history-based theatre and performance.", "We will explore issues and debates in sound studies and related fields through the discussion of regular readings; we will also hone our skills in class through projects and assignments.", "Analyze and understand recorded sound through close listening and application of key concepts.", "Conduct effective peer review in support of iterative sound design processes, including reflection and revision.", "Apply concepts in sound studies to the analysis of existing audio recordings and the creation of new ones.", "Understand the function of genre and media in the creation and reception of sound works.", "Basic Concept: Sound,", "A brief history of recording by Beardsley and Leech-Wilkinson:", "Getting started - import and play + label, Save and open a project", "(3) Storytelling in radio and podcasts, Chapter 1, Section 1.4 Narrative Audio: Create a Sonic Experience, p. 13 - 19;", "First project creation workshop - Doing a good quality voice recording", "Watch: What is a field recording https://youtu.be/7dUy8pkyYg8?si=7vXLA8XDf-gNmKT1", "First project creation workshops", "Field recorders, microphones, the sound booth", "Do field recordings and develop your first project", "Read: Chapter 2 - Current generation  audio hardware in Sound and Music for Games.", "Audio - Vision", "Second Audio Project Development", "Second Audio Project Development", "Planning a larger digital audio  project", "Proposal & workshops", "Sound as a medium of art.", "Research & Development", "Topic, Reading tbc: Editing & Mastering", "The Sony MDR-7506 and Audio Technica ATH-A700X are recommended.", "A cheaper model is the Audio Technica ATH-T400.", "This written assignment is meant to scaffold your understanding of what might be some of the functions of genre and media in the creation and reception of sound works (see Learning Outcomes).", "However, if you follow a podcast or know of one that catches your attention, you may also use it as a case study for your reflection.", "In your own words, describe its overall sound design.", "A rubric in LEARN will give you a sense of how I will grade your essay.", "Using a field recorder, record sounds that characterize that place.", "Speak in the first person singular and the present tense.", "For instance: \"I am standing next to the first building where I slept when I first landed in Canada.\"", "Or, \"This is the walk-in clinic where a doctor saw me when I had terrible abdominal pain and did not have a family doctor.\"", "Although I will not assess your skills as a storyteller, a clear story will be a bonus.", "( I will share the OneDrive folder later)", "Create a \"soundtrack\" for a short film clip (2 - 3 minutes long) of your choice.", "( I will share the OneDrive folder later)", "( I will share the OneDrive folder later)", "Participation: to achieve the highest grades for participation, you must attend all classes; show up having done the assigned readings; and actively engage in discussions and activities in ways that enhance learning for yourself and others.", "This course includes the independent development and practice of specific skills, such as critical writing skills and digital audio production, including voice overs for your content.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 658, "course_code": "ENGL 306A", "course_name": "ENGL306A - Introduction to Linguistics (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Linguistics Winter 2025", "ENGL 306A", "Introduction to linguistics and the principles of linguistic analysis through an examination of English phonology, forms, syntax, and discourse.", "View requirements for ENGL 306A", "Introduction and Overview", "English 306A, Introduction to Linguistics, covers the core areas of linguistics: phonology, morphology, syntax, and semantics.", "Linguistics is a very diverse field, and the course brushes on many other topics, but it is organized around these central areas, exploring the units and the structures that make up human languages.", "Phonology studies the units and structures of sound in language; morphology, the units and structures of words; syntax, of sentences; semantics, of meaning.", "We study what it means for a native speaker to know and use a language: they need to know the sounds, the words, the way words group together, and how those word groups fit into a web of meaning.", "That's a lot just to get someone to pass you the salt or agree that the Leafs sucked last night, but you deploy those systems effortlessly every day.", "You should also know the general ways in which those elements combine—the types rules and processes that arrange the basic building blocks.", "Some of the tools you should acquire are the ability to analyze words and sentences at a general level, and to transcribe sounds broadly.", "You won't quite be ready to go into the jungles of Borneo and completely describe the grammar of an unknown language, but you should know in a basic way how someone who can perform that feat does it.", "You should also come to a fuller awareness of the rules in your own head: how it is that your brain stores and retrieves and decodes language.", "Dirven and Verspoor, Cognitive Exploration of Language and Linguistics.", "Dirven and Verspoor, Cognitive Exploration of Language and Linguistics.", "There may be many important conversations to be had first for non-Indigenous people looking to connect with or do research involving Indigenous communities, and many of these organizations put on open public events, or take donations.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 659, "course_code": "ENGL 306B", "course_name": "ENGL306B - How English Grammar Works (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["ENGL 306B", "Office hours: Online, Microsoft Teams drop-in Available in Microsoft Teams: T/Th, 1:15-2:30pm.", "We can arrange a time that fits both our schedules", "The course then examines English-language change, and considers grammar in pedagogical and multicultural contexts.", "Office hours: I will sit in my video call for office hours for the first 15 minutes.", "Understand a thorough representation of the most common conventions of English written and oral communication.", "Analyze a diversity of English communications to ascertain the structure and infer the intended effects of communicator’s grammatical choices.", "Evaluate English communications for their use of common grammatical conventions.", "Compare and describe the grammatical structure of texts written in different styles and varieties of English.", "Apply common grammatical conventions to combine and compose English written communications.", "Explain the difference between prescriptive and descriptive approaches to grammatical analysis of sample communications.", "Critique grammatical feedback for its application of common conventions and its reflection of understanding vs. perceived correctness.", "Write persuasive and well-informed arguments about the grammatical structure of a communication, its use of common conventions, and to what extent the communicator’s choices influence the intelligibility of the communication.", "General timings in this course:", "Lesson materials released: Mondays (except first week)", "Lesson 1: Labelling words and phrases", "Beyond traditional parts of speech", "Non-verbal phrase units", "Introductory survey", "Discussion board introductions", "Usage conventions and grammar puzzles in noun phrases", "Modifier switches", "Multiple negatives", "Case inflections and agreement", "Readings: specific textbook entries are defined in the lesson and in the assignment.", "Verbs and verb phrases", "Illocutionary force of verbs", "Aspect and tense", "Readings: specific textbook entries are defined in the lesson and in the assignment.", "Strong and weak verbs", "Puzzling past participles", "Verbal mood: subjunctives", "Conditional sequences", "Readings: specific textbook entries are defined in the lesson and in the assignment.", "Unit 2: Clauses and Non-Finite Verbal Phrases: Sentences, connecting sentences, and converting sentences to subordinate structures.", "Dependent clauses and sub-types", "Relative clauses and complex combining problems", "Nominal clauses and formations outside of conversational usage", "Inversions in English at the clause level.", "Readings: specific textbook entries are defined in the lesson and in the assignment.", "Non-finite verbal phrases: adjectives & nouns", "Participles", "Readings: specific textbook entries are defined in the lesson and in the assignment.", "Non-finite verbal phrases: beyond", "Tenses of non-finite verbal phrases", "Verb-phrase complements", "Extraposition and non-finite verbals", "Readings: specific textbook entries are defined in the lesson and in the assignment.", "Connecting clauses and beyond", "Ending sentences", "Commas and advanced rules", "Semi-colons and historical change", "Readings: specific textbook entries are defined in the lesson and in the assignment.", "Punctuation and defining structures", "Advanced sentence combining problems", "Readings: specific textbook entries are defined in the lesson and in the assignment.", "Unit 4: Usage Manuals and Comparison Problems: employing a usage manual to resolve problems with parallel structures and words in context.", "Numeric and syllabic rules", "Parallelism problems", "Instrumental comparisons", "Zeugma and conventions", "Readings: specific textbook entries are defined in the lesson and in the assignment.", "Words in context", "Word formation", "Foreign borrowings", "Readings: specific textbook entries are defined in the lesson and in the assignment.", "Varieties of English", "Readings: specific textbook entries are defined in the lesson and in the assignment.", "After each weekly lesson, you will complete a task that reviews previous material and asks you to practise the material from the week.", "Grade challenges: You may re-submit an assignment for regrading only if you provide a detailed letter explaining why the concepts and criteria of the course justify a different grade.", "This course includes the independent development and practice of specific skills, such as syntactic, lexical, and linguistic analysis and application.", "Library for research-based assignments", "Counselling Services provides support free-of-charge and protects your privacy.", "The Student Success Office also provides support free-of-charge and protects your privacy.", "Writing and Communication Specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence."]}, {"course_id": 666, "course_code": "ENVS 131", "course_name": "ENVS131 - Communications for Environmental Professions (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Communications for Environmental Professions Winter 2025", "02:30PM - 03:20PM", "DWE 3522", "Room EV1-356/356A", "This course provides an introduction to strategies and tools that enhance the effectiveness and impact of communications for environmental professionals.", "View requirements for ENVS 131", "This course introduces strategies and tools that enhance the effectiveness and impact of communications for environmental professionals.", "We consider communications across a range of fields in which environmental professionals find themselves working: academia; journalism; business; government; advocacy and activism; and the creative arts.", "The course focuses on practical topics such as: clear and persuasive writing techniques; critical reading and writing; effective presentation methods in small or large group settings; digital presentation techniques; media relations; oral communication skills; and corporate communications strategies.", "Use environmental communications theories to critically analyze socio-ecological processes and problems:", "-Deconstruct narratives about nature and the environment and how they relate to political ideologies; Illustrate how risk communication theory helps explain societal responses to environmental crises;", "2. Identify and evaluate strategies and tactics for marketing, environmental advocacy and the communication of environmental science/risk;", "3. Develop and deliver informed opinions about controversial environmental issues by critically examining multiple perspectives:", "-deliver a persuasive and well-supported argument through writing and oral presentation;", "-feel more confident and capable of engaging in respectful and fruitful oral discussions and debates about contentious environmental topics;", "Identify and appreciate different forms of communication in your academic and professional careers, civic life and inter-personal relationships;", "i. Distinguish between argumentative, analytical and expository writing styles;", "Distinguish between, and describe the limits of, academic freedom, free speech, freedom of expression;", "Paraphrase the ideas of others into your own words;", "Feel confident engaging in “small talk;”", "Compare and contrast marketing, advertising and public relations;", "This Week", "Readings", "Environmental communication", "Zotero Citation Software", "Please create account and install software before tutorial.", "Zotero Bibliographies", "Guest Lecture: Tim Ireland and Agnes Zientarska-Kayko", "Political Ideologies", "Rhetorical Analysis", "A Pathway]", "Strategic communications:", "Framing Environmental Conflicts", "Email & Business Letter", "Logical fallacies", "Feb.5", "Strategic Business Communications", "A & B Pathways]", "Required for A & B Path]", "Environmental Advocacy & Activism", "Late Assignments for weeks 1-6 must be submitted before reading week to be given TA feedback]", "Feb.24", "Environmental Comics", "A & B Path]", "(All four chapters) 1h33m", "Discourses of Nature", "Hot Topics: Critical Discussion Introduction", "Creative Project: Creative Brief & Ideation", "A & B Paths]", "Gender & Communications", "Film: Gender and Communication: Male-Female Differences in Language and Nonverbal Behavior", "Science & Risk Communication", "Creative Project Storyboard & Script", "A & B Paths]", "Critical discussion worksheet Teams A & B", "Critical discussion worksheet Teams C & D", "A & B Paths]", "Required Texts & Readings", "Students interested in the field of environmental communications are encouraged to read: Environmental Communication and the Public Sphere (6th edition) by Phaedra Pezzullo & Robert Cox.", "The rationale for specifications is five-fold:", "By choosing a grade pathway, you are choosing the learning outcomes/objectives for which you wish to demonstrate competency and then working with the instructor to reach this goal (e.g., through revision and resubmission, if necessary).", "Pathway", "D", "C", "B", "A", "9 Creative Group Project: Creative Brief & Ideation Mar.7     x x", "11 Creative Group Project: Storyboard & Script Mar.21     x x", "Pathway", "D", "C", "B", "A", "9 Creative Group Project: Creative Brief & Ideation Mar.7     x x", "11 Creative Group Project: Storyboard & Script Mar.21     x x", "Time management is an important skill that you will be assessed on in this course as a core learning outcome.", "Keep track of how you managed these situations as you will need to reference them when you discuss your time management grade.", "Demonstrated Competency in Oral Communication", "Notice of Recording", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 667, "course_code": "ERS 318", "course_name": "ERS318 - Photography for Sustainability (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "E-mail: EV2 2029", "View requirements for ERS 318", "How can we use photography to communicate and engage people about sustainability?", "In this course, you’ll learn how to use photographs to communicate and engage people about sustainability.", "Everything you learn will come together in a major project, where you'll use photographs and text to communicate ideas relating to a sustainability topic of your choice.", "In-person sessions focus on skills building through practising concepts and techniques discussed in readings and pre-recorded material.", "Through three skills-building assignments, described below, you’ll develop your technical skills and practice idea-driven photography using groups of pictures.", "To complete this assignment, you’ll choose and research a topic, conduct independent background research, develop a portfolio of images designed to communicate and engage people about sustainability or unsustainability, and prepare supporting text.", "Peer mentoring and support are critical during the course, not only during critique sessions (where we help each other strengthen our images and ideas) but also during workshops and labs.", "The course runs on a blended in-person and online format.", "Students meet each week for one in-person class session in the Faculty of Environment Design Studio (EV3 2402).", "Develop greater fluency in the language of photography and visual communication", "Gain a better understanding of the strengths and limitations of photography as a tool for communicating ideas about sustainability", "Learn basic digital photography and image process skills using Adobe Lightroom", "Practice printing and curation skills in support of photography projects", "I will let you know in advance.", "This is a preparation-heavy course.", "You have to fill gaps in your knowledge through the readings I suggest, and through your own reading.", "Computing Equipment and Software", "You are personally responsible for storing and managing your own Lightroom catalogues and image files, including making backups.", "The project culminates in an in-person open house in the SERS hallway during the lab slot of the last week of classes.", "The graded sub-components of the Major Project include the following:", "Additionally, I’ll expect you to offer thoughtful, constructive insights into the work your peers are producing during critique sessions, project share-out sessions and workshops.", "Notice of Recording", "Consultation", "Please don’t drop in on these days unless it’s a dire emergency.", "Violation of these rules may be deemed academic misconduct under University of Waterloo Policy 71.", "Microsoft Teams", "Pre-recorded lecture material", "Week-by-week overview of topics covered, along with readings and copies of slides from lectures", "Writing in the Technical Fields: A Practical Guide, 3rd edition.", "This is an excellent, comprehensive, and practical writing guide that covers various kinds of professional writing and provides sound advice for professional presentations.", "This course includes the independent development and practice of specific skills relating to photography and writing.", "Library for research-based assignments", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 668, "course_code": "FINE 130", "course_name": "FINE130 - Introduction to Digital Imaging (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Digital Imaging Winter 2025", "Email", "Etiquette Tips for E-mailing Your Professors", "Discussions", "View requirements for FINE 130", "FINE 130: Introduction to Digital Imaging is a studio-based Fine Arts course taught asynchronously online.", "Students are encouraged to produce creative image-based projects throughout the term.", "This course gives students introductory instruction and experience in creating original artwork using digital imaging tools and software and helps students develop a visual language to discuss their own work through artist statements.", "While students will attain a degree of familiarity and comfort with the tools and techniques used to create digital artwork, there is a strong emphasis on content, conceptualization, and originality.", "Through online lectures, tutorials and discussions, students will gain an understanding of the language used to discuss digital technologies and a critical context for the politics, power, and history of digital technologies and image making, and the impact of technologies on contemporary art practices.", "Demonstrate successful use of core digital imaging tools and techniques like image compositing, masking, retouching, text, painting and drawing tools, and various other tools through hands on experience with industry standard digital imaging software.", "Assess and critique digital imaging strategies and techniques in peer assessment writing assignments.", "Develop a critical eye in relation to the elements and principles of design and contemporary image making techniques and practices.", "Develop a critical eye in relation to the elements and principles of design and contemporary image making techniques and practices.", "Discuss the historical precedents and artistic movements that continue to influence the explosion and ubiquity of images in our digitally saturated culture.", "Adobe Creative Cloud is a subscription-based delivery system for Adobe Creative Suite.", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Instructions for accessing the Web Edition can be found in the textbook introduction.", "System Requirements", "Students Studying Outside of Canada", "Please also email your instructor so your instructor can help you match the list of tutorials in each module to the resources in the textbook.", "You can contact them with your questions regarding citations and image use.", "Fine Arts Plagiarism and Copyright", "For example, making a drawing in pencil based on a photograph that you find in a magazine may constitute plagiarism and be an infringement of copyright.", "GenAI and related technologies are subject to existing laws and regulations in Canada, such as intellectual property, copyright and privacy laws, among others.", "A note on copyright free and Creative Commons:", "In this case, the authors decide how you can use their images.", "This course includes the independent development and practice of specific skills related to digital imaging.", "These include tools and techniques like image compositing, masking, retouching, text, painting and drawing tools, and various other tools through hands on experience with industry standard digital imaging software.", "Library for research-based assignments", "By using AI generative software you are complicit in teaching AI algorithms and are participating in copyright infringement.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 669, "course_code": "FINE 150", "course_name": "FINE150 - Appreciation and Expression (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Appreciation and Expression Winter 2025", "Email: mlychek@uwaterloo.ca", "The course delivers an introduction to a variety of basic techniques and concepts relevant to contemporary 2D, 3D, and digital art practices, through a series of structured studio exercises and assignments.", "View requirements for FINE 150", "Build fundamental skills/knowledge of Elements of Art and Principles of Design", "Cultivate critical thinking and creative innovation related to 2D, 3D, conceptual art", "Introduction to Assignment 1: Kilometer Project", "Reminders for Next Week's Life Drawing Sessions", "Introduction to Assignment 4: Artist Remake", "Work Period: Artist Remake and in-progress feedback", "Introduction to Assignment 5: Artist Multiple", "Work Period: Artist Multiple – brainstorming concepts", "Work Period: Artist Multiple - wrapping things up", "Work Period: Artist Multiple - wrapping things up", "DUE: Assignment 5: Artist Multiple - Critique", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 670, "course_code": "FR 101", "course_name": "FR101 - Beginner French (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["be able to recognise and identify basic parts of speech,", "understand and use familiar everyday expressions and basic phrases in French aimed at the satisfaction of needs of a concrete type,", "introduce himself/herself and others and can ask and answer questions about personal details such as where he/she lives, people he/she knows and things he/she has, and", "Who can enroll in FR 101?", "Basic French Placement Rules:", "*** Students with university credits in French must consult the Department before registering in any French courses.", "Diplomas and Programs in French", "Diplomas in French language", "Degree requirements", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 671, "course_code": "FR 151", "course_name": "FR151 - Basic French 1 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Basic French 1 Winter 2025", "Emphasizes comprehension, grammar, and basic speaking skills.", "Students are exposed to cultural aspects of life in France, French Canada and other French-speaking countries.", "learn to communicate in written French and to understand spoken and written French,", "study chapters Première étape to 4 in Deux mondes: A Communicative Approach,", "Deux Mondes: A Communicative Approach, 8th edition – Print Version", "Deux Mondes: A Communicative Approach, 8th edition - 6 Month Digital Subscription", "Deux Mondes: A Communicative Approach, 8th edition - 24 Month Digital Subscription", "VERBIX: verb study and reference", "Diplomas in French language", "Degree requirements", "Nous tenons à souligner que nous nous trouvons sur le territoire traditionnel des peuples attawandaron (Neutres), anishinabé et haudenosaunee.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 672, "course_code": "FR 152", "course_name": "FR152 - Basic French 2 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Basic French 2 Winter 2025", "Emphasizes comprehension, grammar, and basic speaking skills.", "Students are exposed to cultural aspects of life in France, French Canada and other French-speaking counties.", "learn to communicate in French and to understand spoken and written French;", "study Chapters 5 to 9 in Deux mondes: A Communicative Approach;", "listen to the vocabulary audio files provided for each chapter;", "Deux Mondes: A Communicative Approach, 8th edition – Print Version", "Deux Mondes: A Communicative Approach, 8th edition - 6 Month Digital Subscription", "Deux Mondes: A Communicative Approach, 8th edition - 24 Month Digital Subscription", "VERBIX: verb study and reference", "Diplomas in French language", "Degree requirements", "Nous tenons à souligner que nous nous trouvons sur le territoire traditionnel des peuples attawandaron (Neutres), anishinabé et haudenosaunee.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 673, "course_code": "FR 192A", "course_name": "FR192A - French Language 1: Module 1 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["This course is designed to further develop the student's skills in reading and aural comprehension, as well as written and spoken expression.", "Understand, and interpret authentic films and documentaries;", "Enhance their understanding of French and improve written and spoken expression;", "Deepen their knowledge about various aspects of Francophone culture;", "The package includes an access code for online resources: SupersitePlus and WebSAM.", "These online resources are essential for success in the course.", "All cheating and plagiarism will be brought to the attention of the Associate Dean of the Faculty of Arts and penalized accordingly.", "This course includes the independent development and practice of specific skills, such as synthesizing, and analyzing information, developing and practicing writing and oral skills in French.", "Library for research-based assignments", "An INC grade may not be used to complete the entire course.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 674, "course_code": "FR 192B", "course_name": "FR192B - French Language 1: Module 2 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Strengthen their comprehension of authentic films and documentaries;", "Enhance their understanding of French and improve written and spoken expression;", "Deepen their knowledge about various aspects of Francophone culture;", "The package includes an access code for online resources: SupersitePlus and WebSAM.", "These online resources are essential for success in the course.", "All cheating and plagiarism will be brought to the attention of the Associate Dean of the Faculty of Arts and penalized accordingly.", "This course includes the independent development and practice of specific skills, such as synthesizing, and analyzing information, developing and practicing writing and oral skills in French.", "Library for research-based assignments", "An INC grade may not be used to complete the entire course.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 676, "course_code": "FR 250", "course_name": "FR250 - Intermediate Spoken French (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "10:00AM - 11:20AM EV3 4408", "Présenter un projet avec fluidité en intégrant des recherches culturelles authentiques.", "Présentation du cours et des objectifs", "Présentation générale", "Focus sur des influenceurs français", "Débat", "Le passé simple", "Travail sur le vocabulaire", "Bien que tous les contenus soient accessibles en ligne, la présence en classe est obligatoire, car le temps du cours est essentiellement consacré :", "Le travail à la maison, c’est-à-dire les devoirs à réaliser entre chaque cours, privilégient les contenus que l’apprenant.e peut travailler à son rythme à l’aide d’activités", "Seules les absences pour maladie justifiées par un formulaire VIF seront acceptées comme valides : https://uwaterloo.ca/health-services/sites/ca.health-services/files/uploads/files/VIF-online.pdf", "Notice of Recording", "La méconnaissance du calendrier ou des devoirs pourrait avoir des conséquences significatives sur la réussite dans ce cours.", "Notez que partir en vacances ne constitue pas une raison valable.", "Remise des travaux", "An INC grade may not be used to complete the entire course.", "Courriels", "Veuillez noter que l’enseignant répondra aux courriels dans un délai de 24h, mais à des heures raisonnables durant la semaine seulement.", "Artificial Intelligence", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 677, "course_code": "FR 251", "course_name": "FR251 - French Language 2: Module 1 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Savoir correctement utiliser les structures étudiées dans un texte écrit.", "Module 04: Le compte rendu critique", "Intégrité académique", "La tricherie comprend tout usage d’aide non-autorisée et toute collaboration non-autorisée, mais ne s’y limite pas.", "This course includes the independent development and practice of specific skills, such as finding and selecting sources, synthesizing, and analyzing information, developing and practicing writing skills in French.", "Library for research-based assignments", "Nous tenons à souligner que nous nous trouvons sur le territoire traditionnel des peuples attawandaron (Neutres), anishinabé et haudenosaunee.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 678, "course_code": "FR 252", "course_name": "FR252 - French Language 2: Module 2 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["savoir correctement utiliser les structures étudiées dans un texte écrit;", "voir des rapports d'interdépendance existant entre différents éléments de la phrase;", "Introduction", "Les pronoms relatifs", "Les pronoms relatifs", "Intégrité académique", "La tricherie comprend tout usage d’aide non-autorisée et toute collaboration non-autorisée, mais ne s’y limite pas.", "This course includes the independent development and practice of specific skills, such as finding and selecting sources, synthesizing, and analyzing information, developing and practicing writing skills in French.", "Library for research-based assignments", "Nous tenons à souligner que nous nous trouvons sur le territoire traditionnel des peuples attawandaron (Neutres), anishinabé et haudenosaunee.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 679, "course_code": "FR 255", "course_name": "FR255 - Business French 1 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["A French language course designed to enable the student to carry on standard business practice in spoken and written French.", "Débouchés professionnels", "Écrire une lettre de suivi", "Commenter et analyser les graphiques", "Intégrité académique", "La tricherie comprend tout usage d’aide non-autorisée et toute collaboration non-autorisée, mais ne s’y limite pas.", "This course includes the independent development and practice of specific skills, such as finding and selecting sources, synthesizing, and analyzing information, developing and practicing writing and oral skills in French.", "Library for research-based assignments", "An INC grade may not be used to complete the entire course.", "Diplomas in French", "Diplomas in French language", "Programs", "Nous tenons à souligner que nous nous trouvons sur le territoire traditionnel des peuples attawandaron (Neutres), anishinabé, et haudenosaunee."]}, {"course_id": 680, "course_code": "FR 303", "course_name": "FR303 - Introduction to Linguistics (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Linguistics Fall 2024", "An introduction to the basic principles of linguistic analysis (as opposed to traditional grammar) applied to the sounds, vocabulary and sentence structure of contemporary standard French and certain features of current Canadian French.", "Le fait de partir en vacances n’est pas une raison valable.", "Remise des travaux", "All cheating and plagiarism will be brought to the attention of the Department Chair of French Studies and the Associate Dean of the Faculty of Arts and penalized accordingly.", "This course includes the independent development and practice of specific skills, such as finding and selecting sources, synthesizing, and analyzing information, developing and practicing writing and oral skills in French.", "Library for research-based assignments", "An INC grade may not be used to complete the entire course.", "Nous tenons à souligner que nous nous trouvons sur le territoire traditionnel des peuples attawandaron (Neutres), anishinabé, et haudenosaunee."]}, {"course_id": 683, "course_code": "FR 355", "course_name": "FR355 - Business French 2 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["A French language course designed to enhance written and oral expression through the study of economic and business topics in the social and economic contexts of Canada and France.", "Manuel obligatoire", "Présentez-vous non noté", "Le fait de partir en vacances n’est pas une raison valable.", "Remise des travaux", "Intégrité académique", "La tricherie comprend tout usage d’aide non autorisée et toute collaboration non autorisée, mais ne s’y limite pas.", "This course includes the independent development and practice of specific skills, such as finding and selecting sources, synthesizing, and analyzing information, developing and practicing writing skills in French.", "Library for research-based assignments", "Nous tenons à souligner que nous nous trouvons sur le territoire traditionnel des peuples attawandaron (Neutres), anishinabé, et haudenosaunee.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 685, "course_code": "FR 452", "course_name": "FR452 - Advanced French Language (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Advanced French Language Winter 2025", "Des ateliers permettront à l’étudiant.e d’améliorer son écriture et de développer des techniques et des stratégies pour corriger des textes en français.", "Pour cette raison, le programme des points à l’étude pourra évoluer selon les besoins des étudiant.e.s.", "Utiliser une méthodologie précise pour corriger eux-mêmes des textes en français", "La concordance des temps", "Pronoms relatifs", "Expressions idomatiques", "Écriture épicène", "Phrases complexes", "Présentations orales", "La tricherie comprend tout usage d’aide non-autorisée et toute collaboration non-autorisée, mais ne s’y limite pas.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 688, "course_code": "GENE 415", "course_name": "GENE415 - Special Directed Non-Technical Studies (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["A Practical Analysis of Student Leadership Experience Winter 2025", "10:00AM - 11:20AM CPH 2376H", "Instructor/Mentor Pronouns Email Teams Chat", "Title: Practical Analysis of Student Leadership Experiences", "This course provides student leaders with a practical framework to analyze and understand their role in their service organization, either in Waterloo Engineering or outside, to become better leaders in the future.", "In-Person Seminars, and Individual Project Mentoring", "Engineering Graduate Attribute]", "Relationships between Engineering Graduate Attributes & Intended Learning Outcomes & Assessments", "Knowledge Base for Engineering", "4. Design", "Impact of Engineering on Society and the Environment", "Economics & Project Management", "Scheduling of topics will be flexible to allow for the availability of guests and to respond to the needs of our group as a community of learners.", "Jan 28 10:00 - 11:20 am SLICC work & consultations", "Jan 30 10:00 - 11:20 am SLICC work & consultations SLICC Proposal Draft", "Mar 4 10:00 - 11:20 am SLICC work & consultations Progress Check-ins with", "Mar 6 10:00 - 11:20 am SLICC work & consultations Mentors", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 689, "course_code": "GEOG 417", "course_name": "GEOG417 - Climate Change Communication (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Climate change is a complex phenomenon at the intersection of social and ecological systems.", "An understanding of the fundamental science of climate change is only part of the challenge; evidence-based decision-making depends on communicating science effectively, and engaging diverse perspectives.", "This course introduces the fundamentals of climate change communication, moving from linear to dynamic, context-dependent models of communication that draw directly from our knowledge of climate change.", "Design a communication intervention based on theories reviewed in the course.", "Tailor climate messaging to a variety of audiences.", "Describe various heuristics and biases that are relevant to climate communication.", "Engage in persuasive techniques designed to overcome motivated reasoning.", "Design data visualizations relevant to climate change using best practice in the field.", "Identify misinformation and suggest methods for overcoming misinformation.", "Describe how journalistic norms can negatively impact public perceptions of climate change.", "Communicate on technical topics without the use of field-specific jargon.", "Design a questionnaire with attention given to question order, proper wording, and avoiding common survey pitfalls.", "What subconscious biases guide environmental decision making?", "How do these biases influence our risk perceptions and our support of different technologies?", "How can we apply understanding of environmental psychology to better improve climate communication for the purpose of achieving our climate goals?", "Broad overview of critical concepts including: motivated reasoning, audience segmentation, messaging frames, and deep canvassing.", "Assessing the scope and importance of misinformation and evaluating strategies to combat misinformation.", "How do we communicate uncertainty?", "How can we improve at making probabilistic statements?", "Do scientists who advocate for climate action or make political statements lose credibility?", "********* Feb 17 Reading Week *******", "Feb 24 Data visualization", "What pitfalls should we avoid when visualizing climate data?", "March 3 Climate in the media", "How do journalistic norms influence climate change communication?", "What incentives motivate journalistic choices?", "Climate data visualization 10%", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 690, "course_code": "GER 101", "course_name": "GER101 - Elementary German 1 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["understand and speak German with a good degree of accuracy and confidence;", "Methods and Other Goals", "Learning a language at a distance can be a challenge, and time management is crucial.", "And do take advantage of additional opportunities for oral practice, for example the regular online Conversation Hour!", "Das Leben A1: Kursbuch/Arbeitsbuch - Cornelsen - Print Version", "This level of access is for children in grade-school and will not provide you with full access to the e-textbook.", "Dictionaries", "If you prefer, you can also buy an electronic dictionary with a similar number of entries or use a free online dictionary such as:", "LEO English-German Dictionary", "dict.cc Online-Wörterbuch Englisch-Deutsch", "You can also order a German-English glossary for the complete A1 level of the textbook Das Leben in print or PDF format.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 691, "course_code": "GER 102", "course_name": "GER102 - Elementary German 2 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["In 102, you will learn to understand and use basic German language forms and patterns in meaningful contexts.", "You will also learn about cultural topics in German-speaking environments and improve your language learning skills.", "Above all, we hope you will enjoy discovering a new language, and gaining insight into the experiences of speakers of that language.", "Build your vocabulary to the A1 level (i.e., a working vocabulary of about 700 words)", "Das Leben A1: Kursbuch/Arbeitsbuch - Cornelsen - Print Version", "There are no extensions given for quizzes and discussion board tasks.", "If you use one of these services, your instructor will know because the service will inevitably use vocabulary and grammatical structures beyond your current level of knowledge.", "If you use one of these services, your instructor will know because the service will inevitably use vocabulary and grammatical structures beyond your current level of knowledge.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 692, "course_code": "GER 201", "course_name": "GER201 - Intermediate German 1 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["In 201, you will learn to understand and use a variety of German language forms and patterns in meaningful contexts.", "You will also learn more about cultural topics in German-speaking environments and improve your language learning skills.", "Above all, we hope you will enjoy discovering more about the German language and cultural topics and gaining insight into the experiences of speakers of that language.", "learn to understand and use a variety of German language patterns in meaningful contexts, thus advancing your language and interaction skills,", "hear/read about and discuss cultural topics in German-speaking environments, and", "gain insight into the experiences of people living in German-speaking countries through engaging with different media and expressing yourself creatively in writing and visually.", "develop your reading strategies in German,", "practice language structures and vocabulary in regular individual creative tasks, and", "build a community of language learners through working together regularly on reading-related tasks.", "Alles wird kompliziert ... die Suche nach Georg Woche 6 Activity: Discussion Board: Träume", "Definitely a treasure chest for Deutsch 201!", "For GER 201 in particular, this means:", "Some basic rules for writing assignments:", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 693, "course_code": "GER 202", "course_name": "GER202 - Intermediate German 2 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["View requirements for GER 202", "GER 202 is organized around three topics that develop your knowledge and understanding of German-speaking people and their everyday life.", "read shorter, straightforward factual texts on subjects related to your chosen field and interest with a satisfactory level of comprehension.", "follow short films and other video clips in which visuals and action carry much of the storyline, and which are delivered clearly in straightforward language.", "understand some fundamental characteristics of spoken interaction (e.g., the connection of verbal language and gesture), as well as differences between spoken and written German.", "use some structures of German that are specific to spoken language in appropriate oral contexts.", "collate short pieces of information from several sources and summarize them for somebody else.", "topic-relevant knowledge of vocabulary and language structures, awareness of difference between different linguistic ways of expressing them in different languages; e.g., passive voice, subordinate clauses, da-/wo-compounds,", "cultural knowledge about contemporary Germany: meaning and relevance of, e.g., popular music, common images in every-day life,", "awareness of stereotyping in everyday cultural encounters, and knowledge of auto- and hetero-stereotypes about Germans, Canadians, others, and", "Engagement & Interaction 39%", "Quizzes & Tests 27%", "Engagement & Interaction", "Quizzes & Tests", "All quizzes and other tests in this course are closed-book by default, unless otherwise specified in the quiz/test instructions.", "This document will help you understand what the possibilities and limitations are of different types of tools for learning words and word meaning (as well as word pronunciation) and how to make the most of them in your language learning!", "Bask in the satisfaction of completing a task on time.", "In these situations, you can take advantage of the Extended Deadline.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 708, "course_code": "GRK 331", "course_name": "GRK331 - Advanced Studies in Greek: Prose (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Advanced Studies in Greek: Prose Winter 2025", "11:30AM -", "R. Kroeker", "11:30AM -", "R. Kroeker", "11:30AM -", "R. Kroeker", "Ron Kroeker", "Email: r3kroeke@uwaterloo.ca", "A selection of material from one author or several authors within the field of Greek prose.", "January 6 Introduction to the course", "1.1-1.10", "1.11-16  (Read 2.1-4.28 in translation)", "8.23-31", "February 24 Introduction to Plato’s Symposium", "Each student may choose his/her own topic within these parameters, but this topic must be approved by the instructor.", "Synthesis, including the clarity, precision and significance of your thesis, how well you draw larger conclusions from individual observations, and how well you structure the paper as a whole.", "This course includes the independent development and practice of specific skills, such as searching for the best scholarly sources on a given topic and arranging scholarly content in logical order.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "A held-with course will also only count towards program and breadth requirements of the subject code under which it is taken, unless it is cross-listed with the subject code of its’ held-with course.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 712, "course_code": "HEALTH 100", "course_name": "HEALTH100 - Foundations of a Healthy Lifestyle (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Email: l4williams@uwaterloo.ca", "I now have the honour of living and working on the traditional territory of the Neutral, Anishinaabeg, and Haudenosaunee peoples in what we now call Kitchener-Waterloo Region.", "As a settler, I thank the traditional and continuing stewards of these lands and waters, and I am grateful for the teachings I have received, and the sharing of experiences and truths.", "We recognize that our unique lived experiences and identities provide a valuable foundation for our discussions and interactions.", "By centering our conversations on these diverse perspectives, we aim to create a space where every voice is valued and every individual feels seen, heard, and respected.", "Critically appraise their own lifestyle and compare it to the norms of what is considered a healthy lifestyle", "Appreciate that human health exists in numerous dimensions, that health in each of these dimensions occurs on a continuum, and that these dimensions of health also interact to impact our overall health and wellness", "Discuss the benefits of physical activity & exercise to an array of health & wellness dimensions", "Week Dates Module Assessments & Due Dates Weighting", "In HEALTH 100, our classroom functions under the assumption of respect.", "Please also note that dropboxes within LEARN can lag when multiple submissions are occurring at the same time (which tends to happen when many submissions occur near the deadline).", "Moral of the story – submit early!", "The same is true if you choose to make multiple submissions.", "Submission of the blank template file will result in a mark of zero", "I love hearing from students!", "Email:", "The overall golden rule: please communicate with me as early as you can and as often as necessary!", "Student Absences & Extensions / Accommodations", "Poor internet connection - please read through the points below:", "This course is a fully online course.", "That said, ensure that you will have a stable and sufficient internet connection for where you will be while taking the course.", "During the two-day academic consideration period, instructors cannot require completion of any academic responsibilities.", "I want my students to know that in my classes I aim to create a space where religious or spiritual observances of any kind will be respected and will not impact academic success.", "If you are a student registered with AAS and you need to make use of the accommodations identified, please complete and submit the accommodation form through AAS rather than making arrangements with me directly.", "The reason that I ask this of you is so that AAS has the correct data for student use of their services.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Faculty are indeed presumed to be the Intellectual Property Owners of the course materials.", "Intellectual property includes items such as:", "You may experience stressors that can impact your personal well-being and academic experience, but there are multiple supports and resources available to you on and off-campus.", "Academic Integrity Office of Equity, Diversity, Inclusion, and Anti-racism", "Here 24 Seven", "On-campus exams end April 25, 2025"]}, {"course_id": 713, "course_code": "HEALTH 105", "course_name": "HEALTH105 - Mental Health Literacy (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Email: l4williams@uwaterloo.ca", "I now have the honour of living and working on the traditional territory of the Neutral, Anishinaabeg, and Haudenosaunee peoples in what we now call Kitchener-Waterloo Region.", "As a settler, I thank the traditional and continuing stewards of these lands and waters, and I am grateful for the teachings I have received, and the sharing of experiences and truths.", "We recognize that our unique lived experiences and identities provide a valuable foundation for our discussions and interactions.", "By centering our conversations on these diverse perspectives, we aim to create a space where every voice is valued and every individual feels seen, heard, and respected.", "Recognize how approaches and attitudes to mental health and well-being are shaped by social determinants and intersecting personal and cultural identities,", "Describe barriers and facilitators of help-seeking for mental health concerns,", "Recognize empathetic ways to respond to and support others,", "Critically reflect on the meaning of resilience and social ecological models of resilience,", "Describe intersecting factors that contribute to stigma and how stigma affects mental health,", "Develop skills and capacities that enable you to apply course concepts to your own mental well-being, and", "1 Jan 6-12 Module 1: Introduction to Mental Health Literacy", "Board - 5%", "11 March 24-30 Module 11: Spiritual Well-Being", "12 March 31-April 6 Module 12: Social Well-Being and Course Wrap-Up", "In HEALTH 105, our classroom functions under the assumption of respect.", "Please also note that dropboxes within LEARN can lag when multiple submissions are occurring at the same time (which tends to happen when many submissions occur near the deadline).", "Moral of the story – submit early!", "The same is true if you choose to make multiple submissions.", "Submission of the blank template file will result in a mark of zero", "I love hearing from students!", "Email", "The overall golden rule: please communicate with me as early as you can and as often as necessary!", "Student Absences & Extensions / Accommodations", "Poor internet connection - please read through the points below:", "This course is a fully online course.", "That said, ensure that you will have a stable and sufficient internet connection for where you will be while taking the course.", "During the two-day academic consideration period, instructors cannot require completion of any academic responsibilities.", "I want my students to know that in my classes I aim to create a space where religious or spiritual observances of any kind will be respected and will not impact academic success.", "If you are a student registered with AAS and you need to make use of the accommodations identified, please complete and submit the accommodation form through AAS rather than making arrangements with me directly.", "The reason that I ask this of you is so that AAS has the correct data for student use of their services.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Faculty are indeed presumed to be the Intellectual Property Owners of the course materials.", "Intellectual property includes items such as:", "You may experience stressors that can impact your personal well-being and academic experience, but there are multiple supports and resources available to you on and off-campus.", "Academic Integrity Office of Equity, Diversity, Inclusion, and Anti-racism", "Here 24 Seven", "On-campus exams end April 25, 2025"]}, {"course_id": 716, "course_code": "INTEG 210", "course_name": "INTEG210 - Making Collaboration Work (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["INTEG 210", "Email: rob.gorbet@uwaterloo.ca", "Collaboration and teamwork are essential for solving complex, real-world problems and are therefore in high demand by employers.", "View requirements for INTEG 210", "Collaboration is essential for solving complex, real-world problems.", "What problems do teams most commonly face and how can those problems be minimized?", "How can productive conflict increase creativity and productivity, and how can destructive conflict be reduced?", "This offering of the course is designed explicitly for students enrolled in a parallel interdisciplinary capstone project (iCapstone), to help prepare them to be more effective collaborators in that context.", "In the first half of the course, you will learn about factors which influence group dynamics and effectiveness, such as conflict styles, psychological safety, and the importance of trust.", "As you do so, you’ll have a chance to reflect on your own strengths and weaknesses in team settings and use feedback from your peers to improve your collaborative skills.", "By providing timely content on team and collaboration science and process, it equips students to be successful in their interdisciplinary capstone teams.", "Apply appropriate theory and best practices to cultivate positive group dynamics", "Cultivate a collaborative mindset: appreciate the benefits of diversity, embrace productive conflict, develop epistemic humility, cultivate empathy, and be open-minded", "Better understand who you are as a collaborator and how you can help yourself and others be more effective collaborators", "Introduction & course overview", "Strengths & weaknesses in a team setting (individual)", "Psychological safety", "Conflict styles & conflict management", "Conflict style results & brief reflection (individual)", "Diversity in teams", "Respectful Behavior", "Anti-racism Statement", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations."]}, {"course_id": 717, "course_code": "INTEG 410", "course_name": "INTEG410 - Interdisciplinary Collaboration (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["EV2 2069", "katie.plaisance@uwaterloo.ca", "EV2 2069", "katie.plaisance@uwaterloo.ca", "EV2 2069", "katie.plaisance@uwaterloo.ca", "Email: kplaisan@uwaterloo.ca", "Critical evaluation and discussion of topics and procedures in biology that are not covered in existing graduate courses.", "Critical evaluation and discussion of topics and procedures in biology that are not covered in existing courses.", "When are interdisciplinary approaches appropriate and what benefits do they bring?", "What are the barriers and challenges to working across disciplines?", "How can we foster and evaluate the success of interdisciplinary collaboration?", "How might we teach others how to ‘make collaboration work’?", "This course is open to graduate students in Biology and Environment (as well as 4th year students in Knowledge Integration).", "One of the areas of scholarship we’ll look at during the Winter 2022 offering is the emerging field of “the Science of Team Science,” which focuses on collaboration in science teams.", "Identify barriers to interdisciplinary research and/or collaboration, and how they might be overcome", "Create useful resources related to interdisciplinary collaboration", "Improve your critical thinking and written/verbal communication skills", "Help to create a respectful and engaging learning community by collaborating with others and providing constructive feedback", "Week 2: Introduction to multi, inter, and transdisciplinarity", "Week 6: Interdisciplinary research & writing"]}, {"course_id": 718, "course_code": "LAT 101", "course_name": "LAT101 - Introductory Latin 1 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["08:30AM - 09:20AM", "R. Kroeker", "09:30AM - 10:20AM MC 4063", "R. Kroeker", "Although the teaching approach emphasizes exposure to simple texts as soon as possible, students desiring minimal competence in reading should go on to do LAT102.", "View requirements for LAT 101", "identify the parts of speech of any simple Latin sentence and describe its grammatical structure, and apply this knowledge to the grammatical description of English sentences.", "appreciate some of the interesting aspects of Roman history, literature, and society.", "vii-xii", "This course includes the independent development and practice of the reading and writing of Latin.", "Library for research-based assignments", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 719, "course_code": "LAT 102", "course_name": "LAT102 - Introductory Latin 2 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["08:30AM - 09:20AM", "R. Kroeker", "Instructor: Ron Kroeker", "Email: r3kroeke@uwaterloo.ca", "Email: mshahidi@uwaterloo.ca", "View requirements for LAT 102", "Build a working vocabulary (Latin to English and English to Latin) of about 250 common Latin words in addition to the vocabulary learned in Latin 101.", "This knowledge will enable students to translate simple sentences from Latin to English and from English to Latin and to describe the grammar of a Latin sentence using standard grammatical concepts and terminology.", "Develop a more accurate understanding of how language in general works (grammar) and from this gain a more precise knowledge of how the English language in particular works", "Learn many aspects of the everyday lives and culture of the ancient Romans.", "Readings and Vocabulary", "Perf", "Nearly Weekly Quizzes: These tests will normally include vocabulary and grammar components as well as the translation of sentences both from Latin to English and English to Latin.", "These quizzes will normally be written during the last part of the tutorial classes.", "This course includes the independent development and practice of specific skills, such as memorization and translation.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 720, "course_code": "LAT 201", "course_name": "LAT201 - Intermediate Latin (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["02:30PM - 03:20PM", "R. Kroeker", "translate a wide range of English expressions into Latin", "analyze and explain Latin-derived English words, expressions and grammatical structures through the recognition of their derivation", "September 6 Introduction and Review", "September 18 Grammar: Caput XXII, 5th Declension; Ablative Uses", "40-41", "*Test 1 covering Capita XXI & XXII", "*Test 2 covering Capita XXIII & XXIV", "*Test 3 covering Capita XXV-XXVI", "*Test 4 covering Capita XXVII & XXVIII", "*Test 5 covering Capita XXIX & XXX", "Intellectual property includes items such as:", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website"]}, {"course_id": 727, "course_code": "MUSIC 111", "course_name": "MUSIC111 - Fundamentals of Music Theory (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Email: twagler@uwaterloo.ca", "An introduction to the primary skills of music practice emphasizing the reading and writing of musical notation.", "Employ music notation in simple and compound meters using appropriate rhythmic values of notes and rests with bar lines and beaming.", "3. Identify and create major and minor scales, modes and key signatures.", "A general week will be as follows:", "(These are always due following our Monday class, in case there are last-minute questions.)", "Regular practice is vital for fluidity in reading and performing music.", "These will be short videos asking you to complete a few tasks that demonstrate the ways you are engaging and performing the newly learned course materials.", "Please email Prof. Wagler when you need an assignment extended.", "But note that in each category at least one assignment can be dropped.", "Week & Dates TOPICS AND CHAPTERS ASSIGNMENTS", "Introduction to Course & Online Resources", "Note & Rest Values", "Larger and smaller note values", "Dots and ties", "Flags and beams", "Musicianship Skills", "Octave designation", "Diatonic Pitches", "Diatonic and Chromatic half steps", "Musicianship skills", "Beat Division and Subdivision", "Beaming", "Conducting & Musicianship skills", "Augmented and Diminished Intervals", "Interval Inversion", "Compound Intervals", "Study Break: February 15-23", "February 24-28", "Note Values in Compound Meters", "Beaming in Compound Meters", "Borrowed Division", "Major and Minor Modes", "Variations in minor", "March 24-28", "Triad and Chord Identification", "Roman-Numeral Analysis", "Diatonic triads in major and minor keys", "Melodic Function", "Harmonic Function", "Harmonic Analysis", "Artusi: You MUST purchase a four-month student subscription to this online program ($34.99USD).", "Once you’ve registered, enter the following code to enroll in the course:", "the-university-of-wa_funda", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 732, "course_code": "MUSIC 270", "course_name": "MUSIC270 - Music Theory 1 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Instructor: Dr Karen Sunabacka", "Email: karen.sunabacka@uwaterloo.ca", "Any assignment changes will be given in the email and announcement.", "The study of basic melodic, harmonic, and voice leading concepts including an introduction to figured bass and functional harmony.", "View requirements for MUSIC 270", "This course is the first of four theory/skills courses offered as part of the music program.", "Identify, classify, and employ music notation, the church modes and major and minor scales.", "3. Identify and create melodic figures to decorate melodies in duple and triple meters.", "Perform basic melodies and harmonies in group and keyboard performances.", "The TWA assignments MUST be submitted ONLINE to KRITIK and submitting this completes the first \"Create\" stage of the KRITIK assignment.", "There are 5 performance assignments - three in the first half of the term, and 2 in the second half, plus a Midterm Performance Exam in week 7 and a Final Performance Exam during the exam period (by sign-up.)", "Quiz-Dictations (QD) will also happen during Friday classes, where we are focussing on sight-singing and ear training.", "There are 5 Quiz-Dictation assignments - three in the first half of the term, and two in the second half, plus a midterm in week 7, and a final Quiz-Dictation that happens during the Final Exam slot during the exam period.", "Week/Module Topics Chapters and Class Meetings ASSIGNMENTS DUE", "Introduction to Course & Technology, Theory Rudiments", "Artusi", "MuseScore", "Review of Rhythm & Intervals", "Introduction to Performance Assignments - Practice and division into groups.", "Chapter 5 - Melodic Design", "Analysis of the Cantus and the church modes", "Complete Analysis", "Rules and steps for composing a cantus", "Composing a Cantus", "Chapter 6 - Duple Paraphrase", "Analysis of Duple Paraphrase", "Complete Analysis", "Rules and steps for composing a duple paraphrase", "Composing a Duple Paraphrase", "Quiz-Dictation-01", "Analysis of Harmonic Framework", "Composing a Harmonic Framework (aka first species counterpoint!)", "DUE Monday January 27", "TWB-03 – Composing a Duple Paraphrase", "Chapter 8 - Chordal Succession", "Analysis of Modal Homophony", "Complete Analysis", "Rules for composing a Chordal Succession starting with Cadence", "In-Class Quiz-Dictation PRACTICE", "Analysis of Melodic Dialogue", "TWB-05 – Analysis and final cadence", "Quiz-Dictation-03", "Analysis of Triple Paraphrase", "DUE Friday February 28", "MIDTERM Quiz-Dictation", "Chapter 11 - Vocal Duet", "Setting Text & Analysis of a Vocal Duet", "Composing a Vocal Duet", "Chord Names & Qualities", "The Cadential Six-Four chord", "Quiz-Dictation practice", "READ Ch 12, pp195-197 & 219-225", "Chord Names & Qualities", "Chordal Vocabulary & Melody Analysis", "Chords of Dominant Function", "DUE Friday March 21", "Quiz-Dictation-05", "Mar. 24-31", "READ Ch 12, pp211-219 & p226", "DUE Friday March 28", "Complete Evaluations in KRITIK for TWA-10", "Chapter 13 - Suspensions and Syncopations", "Suspensions", "Analysis of Tonal Melodic Dialogue", "Artusi Music - https://www.artusimusic.com/ You MUST purchase a four-month student subscription to this online program ($34.99USD).", "Once you’ve registered, enter the following code to enroll in the course: the-university-of-wa_music-4 Yes $39.99 USD = approx.", "KRITIK You MUST purchase a four-month subscription to this online peer assessment program ($29.00CAD).", "MuseScore - https://musescore.org/en This is a FREE notation program Yes FREE", "Pencils and erasers You will need pencils and erasers for completing in-class quiz dictations - A set of 5 mechanical pencils with erasers can be purchased at W-Store for following price Yes $3.99", "To order the access code and receive it instantly, please follow the first link below.", "The printed book can be ordered online from wstore.ca.", "Evaluations", "The lowest grades in this category will be dropped.", "Regular practice is vital for fluidity in reading and performing music.", "These quizzes can be taken during the Friday performance classes (the classes where we focus on sight-singing and ear training with a bit of keyboard skills!", "More details will be given in-class and in the final module on LEARN.", "This course includes the independent development and practice of specific skills, such as composing your own original music.", "Library for research-based assignments", "Do you want professors and interviewers to call you by a different first name?", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 733, "course_code": "MUSIC 271", "course_name": "MUSIC271 - Music Theory 2 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Monday, Friday -", "11:30AM - 12:20PM CGR 1208", "Email: karen.sunabacka@uwaterloo.ca", "Its principal focus is music theory and completes the discussion of diatonic harmony begun in Music 270.", "Week 2: Jan 15-22: Chapter 12 Review AND Introduction to Chapter 14 - Tonicization", "Week 8: Mar 4-11: Chapters 17, 18 & Intro to 20 - Instrumental Melodic Figures and Instrumental Music", "You MUST purchase a four-month student subscription to this online program ($29.99USD).", "Once you’ve registered, enter the following code to enroll in the course: the-university-of-wa_music-5", "Kritik - https://www.kritik.io/ You MUST purchase a four-month subscription to this online peer assessment program ($24.00CAD).", "MUSESCORE – FREE online notation program: https://musescore.org/en", "Then you will be required to evaluate four of your peers work using a rubric and written evaluation.", "There are seven of these and the lowest grade in this category will be dropped.", "Regular practice is vital for fluidity in reading and performing music.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 736, "course_code": "MUSIC 370", "course_name": "MUSIC370 - Music Theory 3 (19th Century) (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["10:00AM - 11:20AM CGR 1302", "Instructor: Dr Karen Sunabacka", "Email: karen.sunabacka@uwaterloo.ca", "Any assignment changes will be given in the email and announcement.", "The study of chromatic harmony as well as melodic and formal aspects of 19th-century music.", "Its principal focus is music theory and completes the discussion of diatonic harmony begun in Music 270.", "Compose and decorate original melodies and harmonies following the styles of the romantic music era.", "5. Harmonize and realize romantic tonal melody in two to four parts from a given soprano and/or a given bass using proper voice leading and proper phrase structures for romantic music.", "Aurally recognize and notate romantic chord progressions and chromatic melodies that utilize romantic era conventions.", "Week 8: Mar 3-10: Chapter 28 - Secondary Mixture", "Week 10-11: Mar 17-31: Work on final project - both in-class and outside of class", "MuseScore - https://musescore.org/en FREE notation program: Yes FREE", "The Analysis of Musical Form We will use parts of this textbook towards the end of class, when we start to focus more on Musical Form and Analysis No $139.99", "To order the access code and receive it instantly, please follow the first link below.", "The printed book can be ordered online from wstore.ca.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 738, "course_code": "MUSIC 376", "course_name": "MUSIC376 - Composition Seminar (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Instructor: Dr Karen Sunabacka", "Email: karen.sunabacka@uwaterloo.ca", "Topics include choral, chamber ensemble, and orchestral techniques; electronic music; and charting for popular music.", "The course includes both score preparation and opportunities for recital performances of original works.", "An exploration of music composition and arranging through regular listening, discussion and music creation.", "4. Examine and prepare compositional sketches.", "Introduction to Music Composition and to Course", "Sept. 18 & 20", "Harmonizing and Arranging", "Sept. 25 & 27", "Oct. 16 & 18", "Experimental Text  October 18 - Biography DUE", "Oct. 23 & 25", "Nov. 6 & 8", "Electronic Music", "Nov. 20 & 22", "Nov. 27 & 29", "Notice of Recording", "As a class we may decide to record compositions for each composer.", "This course includes the independent development and practice of specific skills, such as original composition and critical and thoughtful observations of live music.", "Library for research-based assignments", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website"]}, {"course_id": 748, "course_code": "SPAN 101", "course_name": "SPAN101 - Introduction to Spanish 1 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Spanish 1 (Blended)", "02:30PM - 03:20PM", "Luis Jaimes-Domínguez", "Focus will be given to the development of skills in listening/comprehension, speaking, reading, and writing.", "Students will be expected to use them in the multimedia language centre and at home.", "Express possession and describe people and things.", "Have a basic understanding of the difference betwen SER and ESTAR", "Complete online activities as indicated in the Viva Supersite", "Complete online activities as indicated in the Viva Supersite", "Complete online activities as indicated in the Viva Supersite", "24-27", "32-33", "Complete online activities as indicated in the Viva Supersite", "34-41", "Complete online activities as indicated in the Viva Supersite", "Complete online activities as indicated in the Viva Supersite", "Telling time for particular events", "Complete online activities as indicated in the Viva Supersite", "Complete online activities as indicated in the Viva Supersite", "Use Estar + location & well being", "Stem-changing verbs: e-ie, o-ue, verbs e-i.", "No classes!", "VER and OIR", "Grammar Tutorials: 4.2, 4.3 & 4.4 – pp.", "Complete online activities as indicated in the Viva Supersite", "ESTAR with conditions and emotions.", "Complete online activities as indicated in the Viva Supersite", "Complete online activities as indicated in the Viva Supersite", "Describe yourself and your family.", "Complete online activities as indicated in the Viva Supersite", "128-129", "Complete online activities as indicated in the Viva Supersite", "Complete online activities as indicated in the Viva Supersite", "Complete online activities as indicated in the Viva Supersite", "Complete online activities as indicated in the Viva Supersite", "154-157", "Complete online activities as indicated in the Viva Supersite", "Complete online activities as indicated in the Viva Supersite", "5th ed with SuperSite Plus code package", "See the How do I enroll in my instructor's course?", "Also, make sure you use the same last and first name in the Viva Supersite as the one on LEARN.", "Only buy books that include the required Supersite code!", "Always check that what you are buying includes the code.", "The theme of this composition will be given the day of the assignment.", "This course includes the independent development and practice of specific skills, such as memorization of Spanish vocabulary and development of Spanish grammar skills..", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 749, "course_code": "SPAN 102", "course_name": "SPAN102 - Introduction to Spanish 2 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Spanish 2 (Blended)", "11:30AM - 12:20PM", "Students will be provided with a range of opportunities to gain practical insights into the customs and cultural contexts of the contemporary Spanish-speaking world.", "SPAN 102 is still an introductory course designed both to continue presenting the fundamentals necessary for understanding, speaking, reading and writing correct Spanish and to provide a range of opportunities for students to gain practical insights into the customs and cultural contexts of the contemporary Spanish-speaking world.", "Communicate both orally and in writing in simple and complex, complete sentences with a vocabulary of at least 1000 words.", "Double object pronouns and comparatives.", "Imperative forms and Subjuntive mood.", "Introduction to Course.", "Lección 8: ¡A comer!", "Double object pronouns", "Grammar Tutorials 8.1 & 8.2 – pp. 176", "-179  Introduction to tutorials.", "Grammar Tutorials 8.3 & 8.4 – pp. 180", "204", "& ¿Cuál?", "200-201", "- p 223", "224-225", "226-227", "Lectura: El consultorio - pp. 233", "No classes!", "in-class)", "268-269", "268-275", "The subjunctive in adjective clauses", "306-308", "314-315", "Viva!", "Edition Maestro-Supersite SUPERSITE CODE FOR VIVA 4TH ED (WITHOUT PAPER TEXTBOOK)", "7 Homework submissions in Viva Supersite (If you do not have access to this site talk to your instructor for alternate choices)", "Electronic Device Policy", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 750, "course_code": "SPAN 201A", "course_name": "SPAN201A - Intermediate Spanish 1 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["SPAN 201A", "11:30AM - 12:20PM", "Email: veraquin@uwaterloo.ca", "Email: rmarsuez@uwaterloo.ca", "The primary goals are to build communicative competence and enhance social and cultural awareness of the Spanish-speaking world.", "View requirements for SPAN 201A", "In addition every student is enrolled in a tutorial section, which is a requirement and meets once per week for a one hour period.", "Employ various grammatical concepts of the Spanish language such as present and past tenses, the subjunctive mood and future tenses.", "Analyze cultural expressions using a variety of tools, and applying critical thinking.", "Incorporate and use a more complex vocabulary to their everyday speech.", "Better understand the use of Spanish grammar and language in the written and oral word.", "Semana", "Discusión y ejercicios", "El subjuntivo en cláusulas nominales:", "99-101", "Escuchar los podcasts hechos en los grupos.", "12 de oct - 20 de oct - Semana de lectura - ¡No hay clases!", "Decidir si van seguir o van a cambiar grupos de 3-4 para la tarea final: video", "108-109", "124-125", "162-163", "Ver el cortometraje1 Eclipse", "Discusión del cortometraje - pág.166", "3 Homework - VHL Supersite", "18 month valid code.", "Participation - Class participation is of utmost importance in a language course.", "Homework (online)- Your textbook, Imagina 5th edition, brings with it a code to access the online component of our course at Vista Higher Learning (vhlcentral.com); note that this code is also used in SPAN 201B during the winter term.", "Make sure to sign the attendance sheet; it’s the only proof of your attendance!", "The topics of these assignments must be related to any aspect of the Hispanic culture and presented in Spanish.", "Groups will be formed during the first tutorial class in order to submit the podcast within the following four weeks, and the video four weeks later.", "Remember to have a lot of fun doing these audiovisual assignments!", "Electronic Device Policy", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website"]}, {"course_id": 751, "course_code": "SPAN 201B", "course_name": "SPAN201B - Intermediate Spanish 2 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["The primary goals of the course are the further enhancement of communicative competence, and social and cultural awareness.", "View requirements for SPAN 201B", "Conversation classes are also used to increase understanding and speaking skills.", "Conversation sessions or tutorials are also used to increase understanding and speaking skills, and application of grammatical structures learned this term.", "This is a blended course, which means students have one hour per week to prepare before we meet in person once a week for 1 hour and 50 min lecture.", "• Incorporate new and more complex vocabulary into their daily speech.", "• Analyze the dynamics of cultural expressions.", "Fecha", "Antes de la clase & la tutoría", "Actividades del Supersite", "200 & Ver en VHL el cortometraje Justo", "El subjuntivo en cláusulas adverbiales: Discusión y ejercicio", "Actividades del Supersite", "Actividades del Supersite", "238 & Ver en VHL el cortometraje La jaula", "Actividades del Supersite", "Actividades del Supersite", "-291", "Usos del infinitivo: Discusión y ejercicio", "Sobre cortometraje El clon", "En marzo", "Conversación individual", "Actividades del Supersite", "306", "314-317", "Actividades del Supersite", "324-325", "En marzo", "Conversación individual", "Actividades del Supersite", "340", "Actividades del Supersite", "348-351", "360-362", "¡Última tutoría!", "Despedida", "En marzo", "Conversación individual", "Actividades del Supersite", "342-343 & Ver en VHL el cortometraje La boda", "Preparar preguntas sobre todos los temas gramaticales que hemos estudiado en las anteriores diez semanas", "Communication Assignments (composition & conversation winstructor) 15%", "Make sure to sign the attendance sheet; it’s the only proof of your attendance!", "Online Homework (20%): Your textbook, Imagina 5th edition, brings with it a code to access the online component of our course at Vista Higher Learning (vhlcentral.com); note that you used this code in SPAN 201A during the last term.", "These exercises will prepare you for tests and include vocabulary, grammar and cultural aspects.", "While cultural aspects included in each lesson are not part of these tests, they will be intertwined in the different exercises.", "Please, do not wait until the last minute to do your online tests!", "For the first one, you will write a composition of no less than 350 words to demonstrate your ability to express yourself in writing.", "These assignments are meant to give you practice in the art of written and oral communications in Spanish.", "Individual assignments can happen any time after reading week and before the last week of classes.", "Remember: Don’t stress out and have a lot of fun doing these communication assignments!", "Electronic Device Policy", "I insist that you have to make an appointment via email so that I can set aside a block of time for you during office hours, especially if you want to talk in private.", "First request, first served.", "If there are no appointments during office hours, then first request via email, first served.", "Please, make your consultations clearly & succinctly so that I can help you better.", "I am positive we can always find a time suitable for you & me for a virtual meeting outside office hours.", "This course includes the independent development and practice of specific skills, such as synthesizing and analyzing information, and research presentation in a written format with a high degree of personal creativity and critical thinking.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 752, "course_code": "SPAN 210", "course_name": "SPAN210 - Spanish Conversation (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["11:30AM -", "Email: drozotto@uwaterloo.ca", "In this course, students will continue to develop and hone their Spanish speaking and listening skills through discussions of current topics in Spanish-speaking countries.", "Reproduce the Spanish language sounds that are most challenging to speakers of other languages.", "Continue to develop critical thinking as they acquire a better comprehension of cultural differences in the Hispanic world.", "Design verbal messages in Spanish to communicate in public a topic of their choosing.", "Encuentros rápidos para conocernos un poco", "¡Únete a TalkAbroad!", "¡Únete a TalkAbroad!", "Puedes hacer que suene en tu móvil o pedir que la pongamos en clase para que todos la oigamos.", "¡Un gran día!", "¿Cómo está el medioambiente en Canadá? ¿Cómo está el medioambiente en otros países? ¿Qué sabes del cambio climático? ¿Qué haces para contribuir al mejoramiento del medioambiente?", "A held-with course will also only count towards program and breadth requirements of the subject code under which it is taken, unless it is cross-listed with the subject code of its’ held-with course.", "Electronic Device Policy", "I insist that you must make an appointment via email so that I can set aside a block of time for you during office hours, especially if you want to talk in private.", "First request for a meeting, first served.", "If there are no appointments during office hours, then first request via email, first served.", "Please, make your consultations clearly & succinctly so that I can help you better.", "I am positive we can always find a time suitable for you & me for a virtual meeting outside office hours.", "This course includes the independent development and practice of specific skills, such as synthesizing and analyzing information, and research presentation in a written format with a high degree of personal creativity and critical thinking.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 754, "course_code": "SPAN 301A", "course_name": "SPAN301A - Spanish in Context 1 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["SPAN 301A", "Email: a2bilode@uwaterloo.ca", "Students are encouraged to communicate concerns and questions regularly with the professor through email and/or personally during office hours.", "Availability for meetings", "online drop-in hours – on Monday and Wednesday, 4.30-5.00pm", "in-person drop-in hours – on Tuesday and Thursday, 2.30-3.30pm", "I will monitor/answer once a day during week days.", "This course promotes students' oral and written abilities, as well as their critical understanding of Latin American history and culture.", "This course will be conducted entirely in Spanish through oral, writing and listening comprehension exercises in LEC and LAB classes.", "The content and activities covered are meant to be relevant to real-life situations.", "Increase their fluency and accuracy in oral and written communications in Spanish, by 1) overcoming the “I think” syndrome, 2) basing their interactions on facts and arguments, and, 3) referring to the materials studied (texts, movies, academic papers).", "Improve their listening comprehension skills, by 1) understanding a variety of unmediated, real-life speech situations (media clip, vox pop on the streets with background noises), and 2) recognizing and understanding various accents used in real-life situations.", "Consolidate their knowledge of, and properly use specific advanced grammatical concepts, 1) Differentiate the uses of the four past tenses; 2) Interpret the nuances between the various uses of the subjunctive mood, (more specifically, contrary to fact statements).", "Reflect on their own progression and identify gaps in their knowledge.", "A note: feel free to email me, but if you think your peers might have the same question, post it in the FAQ discussion.", "Sign-up sheet: SPAN 301A - Presentación oral individual o en grupo de 2.xlsx", "Semana", "Fecha", "Actividades & Tareas", "Oral: La guerra sucia en Chile", "Oral: Análisis del poema", "Oral: Análisis del cuento", "Cuento – Desaparición de una familia", "Oral: Análisis del cuento", "If experience serves, you’ll have midterms in your other courses!", "24-29 de octubre", "Entrevista ¡Sorpresa!", "Oral: Ángeles Mastretta", "Cuento – El otro círculo", "It comes with an access code for an online practice space called “Edelsa Zona Estudiante”.", "If you happen to find a second-hand / cheaper version online, you can purchase it.", "Grammar quizzes & oral evaluation around grammar 15%", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Intellectual property includes items such as:"]}, {"course_id": 755, "course_code": "SPAN 301B", "course_name": "SPAN301B - Spanish in Context 2 (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["11:30AM -", "This course further develops the development of critical understanding of Latin American history and culture.", "Course components include: assigned readings in a variety of genres, critical cultural analysis, in-class discussions, written essays, and the viewing of films.", "This course further promotes students’ oral and written abilities, as well as their critical understanding of the history and culture of the Spanish-speaking regions.", "Methodology: As in SPAN 301A, this course will also be conducted entirely in Spanish through oral, writing and listening comprehension exercises in LEC and TUT classes.", "The content and activities covered are meant to be relevant to real-life situations.", "Gain greater fluency and accuracy in oral and written communications in Spanish;", "Improve their listening comprehension sills;", "Expand their knowledge of specific advanced grammatical concepts;", "Increase their vocabulary for academic and everyday usage;", "Obtain a critical understanding of certain areas of the history and culture of the Hispanic world.", "Leer sobre proyectos finales y decidir", "ESTRUCTURAS Subjuntivo en cláusulas subordinadas sustantivas p. 104", "Actividades en Supersite", "Actividades en Supersite", "Actividades en Supersite", "TERTULIA: Las empresas multinacionales: ¿A favor o en contra?", "ESTRUCTURAS El subjuntivo en cláusulas subordinadas adjetivas p. 134", "Actividades en Supersite", "ESTRUCTURAS El subjuntivo en cláusulas subordinadas adverbiales p. 135", "Actividades en Supersite", "Actividades en Supersite", "Actividades en Supersite", "ESTRUCTURAS SI con indicativo p. 164", "Actividades en Supersite", "TIRA CÓMICA: “Teléfono, una enfermedad celular” por Maitena", "Actividades en Supersite", "Actividades en Supersite", "¡Última tutoría!", "Actividades en Supersite", "“Homework” exercises will prepare you for LEC & TUT participation, carry a mark and include vocabulary, grammar and cultural aspects.", "There will also be activities for “Preparation” which, together with other in-class activities (e.g., taller de escritura), do not carry a mark as they are for you to solidify your Spanish knowledge and be prepared for classes, and are a for-credit component that, at the discretion of the Instructor, could help boost marks in case someone needs support to get to a higher grade (say, from 79 to 80).", "Compositions are related to class topics, lexicon and grammar studied, with the added challenge of using some required grammatical concepts and terminology so that students can practice the language concepts learned, and freely express their opinions as practiced during discussions.", "Each test will be at the end of a textbook lesson, as indicated in the Course Outline.", "If you miss a test for whatever circumstances, even if you present a valid absence through the Absence Database, you must suggest a suitable solution to your missing test situation: no solution suggested, no consideration granted.", "All suggestions will be taken into careful consideration.", "Students will also receive help in the preparation of other evaluation components such as directing discussions, compositions, test practicing, and/or final project.", "This evaluation component takes into account the fact that every person learns in different ways, and is stronger in some areas, and not so strong in others.", "Final projects can be selected from the following:", "A digital story in Spanish (videorecorded)", "Instructions for each modality will be available in LEARN as of the first week of classes.", "Supervised grammar classes will happen outside SPAN 301B class time and during the last month of the term.", "A held-with course will also only count towards program and breadth requirements of the subject code under which it is taken, unless it is cross-listed with the subject code of its’ held-with course.", "Electronic Device Policy", "I insist that you must make an appointment via email so that I can set aside a block of time for you during office hours, especially if you want to talk in private.", "First request for a meeting, first served.", "If there are no appointments during office hours, then first request via email, first served.", "Please, make your consultations clearly & succinctly so that I can help you better.", "I am positive we can always find a time suitable for you & me for a virtual meeting outside office hours.", "This course includes the independent development and practice of specific skills, such as synthesizing and analyzing information, and research presentation in a written format with a high degree of personal creativity and critical thinking.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 770, "course_code": "THPERF 343", "course_name": "THPERF343 - Stage Management (0.50)", "term_name": "List D", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Stage Management Fall 2024", "T.A. - Katie Honek", "Email - kjhonek@uwaterloo.ca", "THPERF 343 offers an introduction to stage management for the theatre and a variety of other live performance genres.", "Techniques will be studied and practiced through lectures, workshops, guest speakers and off-site trips.", "The main goal of the course is to develop an understanding of what stage managers do and how vital their roles are to successful productions.", "Discuss the role of stage manager in the Canadian Theatre landscape from beginning to end of a production process in multiple genres.", "Demonstrate knowledge of the rules of conduct as outlined in the Canadian Theatre Agreement.", "Build competence in oral, written, and visual communication for difference production scenarios.", "Demonstrate empathetic, detailed, and timely communication and problem-solving while adapting the strategy, language, and tone as necessary.", "* Job description & Characteristics of a Stage Manager", "* Production book set-up", "* Paperwork / Templates", "* Production Analysis", "* Distributions Lists", "* Taping a floor", "* Taping a floor exercise in TofA", "Production Analysis", "* Scheduling concepts", "** Last day to drop the course is Sept 24 **", "* Minis / Blocking page", "* Script preparation", "Scene Division & Breakdown", "**No Janelle**", "HEALTH & SAFETY", "* Extraordinary Risk Riders", "* Guest Speaker - Janet Sellery, Health & Safety Consultant", "* First day of rehearsal", "- introductions/design presentation/read through", "- Equity Deputies", "* Rehearsal models", "* Blocking", "* Methods of Communication", "Blocking page", "** READING WEEK – NO CLASSES**", "* Set-up dressing rooms", "* Set-up backstage", "* Set-up onstage", "* Safety Walk", "* Spike charts", "* Dealing with stress", "* Preset lists / running lists", "Prompt book set up", "* 1st rehearsal onstage / spacing", "* Tech run / Dress Rehearsal", "* Putting Qs in book   Wardrobe Tracking", "* Calling a Show", "* Show reports", "* Dealing with FOH", "* Archiving", "* Strike", "* Petty Cash Reconciliation", "* In-class blocking exercise   Running list", "Nov 13 Problem-solving", "** Drop with WD ends Nov 19 **", "** CLASS CANCELLED for TH’OWXIYA Matinee **", "10 minutes each", "EXAM BREAK Hands on evaluations   Final Prompt book & rationale for final mark", "Stage Management Basics: A Primer for Performing Arts Stage Managers by Emily Roth, Jonathan Allender-Zivic, and Katy McGlaughlin will be referred to as BASICS in the readings Yes", "Stage Managing the Arts in Canada Can be purchased directly from the instructor No", "The Backstage Guide to Stage Management - 3rd Edition by Thomas A. Kelly No", "Supplies", "3 ring binder for prompt script No", "Dividers / tabs for prompt script Yes", "- Production Analysis **", "- Daily Schedule", "- Production calendar **", "- Rehearsal Note **", "- Wardrobe tracking", "- Running list", "SM Interview reflection", "SM Shadowing experience", "Students will be given a section of script in class and will complete an exercise of putting the cues in their prompt script.", "Everyone in the class has multiple and competing responsibilities, and a finite amount of time in which to meet them.", "Electronic Device Policy", "“These sense experiences create contact between different parts of the brain and open the brain up for learning” (Audrey van der Meer).", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "Library for research-based assignments"]}, {"course_id": 0, "course_code": "COMMST 100", "course_name": "COMMST100 - Interpersonal Communication (0.50)", "term_name": "List 1", "program_name": "Degree Requirements", "program_id": 45, "major_id": 4, "major_name": "Bachelor of Computer Science Degree Requirements", "topics": ["jclausen@uwaterloo.ca (please do not use the D2L email system)", "I monitor my email M-F, 9:00 am - 5:00 pm.", "Focuses on the one-to-one, face-to-face communication in both the personal and professional realms.", "Such topics as verbal and non-verbal interactions, listening, and the better management of interpersonal communication will be studied.", "In this course, we will work to understand more fully how we communicate (and are communicated to) in the world we live in and to develop the tools to research, apply, and practice key interpersonal communication concepts in our everyday lives.", "Students will be encouraged to identify, negotiate, and challenge existing communicative norms as they explore a range of interpersonal and intrapersonal issues that include culture, identity, and power.", "Understand the complexity of communication as a human process of shared meaning- making in the context of power, history, and culture", "Increase your capacity to recognize and enhance yours and others’ agency – the ability to make a difference in the world for yourself and others – and understand the implications of your communication behaviours for yourself and others", "Understand communication as a practice and improve your critical and creative communication competencies by developing your ability to use writing and other media of communication to create meaning", "This entails opportunities for student-directed inquiry, challenge and risk-taking, and reflection on your roles and responsibilities", "Reflect on your role in fostering the public good (the multifaceted well-being of individuals and groups), begin to imagine a better future, and make decisions in your communication that can transform the communities to which you belong", "Recognize diverse linguistic practices and modes of expression as resources for writers and speakers", "Introduction", "Read: Meaning as Co-Created", "Read: “Cultural and Historical Influences: Communication Competence in Context”", "Exceeds assignment guidelines; strong and consistently applied definition of audience and purpose; thoughtful and innovative adaptation of the subject to the audience’s needs; subject developed and organized at every level for listener comprehension; speaker uses language appropriately, effectively and even inventively; maintains relaxed, inviting delivery free of verbal fillers and distractions; cites sources appropriately both in spoken and written work; submits well prepared required materials.", "Your entries should be roughly two typewritten, double- spaced pages each although they can go slightly over.", "While the amount you write under each heading may change week to week, this format allows you to address each area regularly.", "Decide how often you will communicate and in what manner.", "Decide how you will divide the workload and handle conflicts.", "Handing in a clear contract will earn 5%.", "Your job will be to engage the class and apply what we are reading to people’s own opinions, experience, etc. Sign up for this assignment is on a first-come/first-served basis starting during week two of classes.", "Group Presenation 2: Final Presenation You and your group will create a fifteen-minute videotaped presentation exploring a problem in interpersonal communication and proposing a solution for that problem.", "This presentation will involve research into a specific issue related to interpersonal communication and creating good reasons for following your proposed solution.", "This course includes the independent development and practice of specific skills, such as self reflection, critical thinking skills and interpersonal communication.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 1, "course_code": "COMMST 223", "course_name": "COMMST223 - Public Speaking (0.50)", "term_name": "List 1", "program_name": "Degree Requirements", "program_id": 45, "major_id": 4, "major_name": "Bachelor of Computer Science Degree Requirements", "topics": ["In the case of service interruptions to the LEARN system, please see the LEARN Service Interruption Policy https://uwaterloo.ca/secretariat-general-counsel/service-interruptions-online-learning-environment-guidelines", "A workshop course involving design and delivery of various kinds of speeches, and the development of organizational, vocal, listening, and critical skills.", "Apply speech communication concepts in designing and delivering public speeches and digital productions", "Understand and negotiate cultural assumptions and expectations in public address", "Foundations of a public speaking performance", "Your first speech: Informing about your language", "First speech workshop: a life story of the language I speak (voice, body, presence)", "First speech presentation 1", "First speech presentation 2", "Oct. 3: Read: Evaluating speeches critically (Zarefsky & Engels)", "First speech presentation 3", "Discussion and Introduction to Second Speech Assignment: Persuading a local audience", "(and Choosing your topic -CH 6 .Zarefsky & Engels)", "Your second speech: persuading a local audience", "(Ch 14 and Ch 16 -up until 16.5-, Zarefsky & Engels)", "Second Speech Development", "Exercise # 2: Describe a local situation and evaluate it as a problem for your peers - 90 sec. speech", "Mediated public speaking: Persuading a Digital Audience", "Read; Appendix B, Ch. 16, Zarefsky & Engels", "Development & Research of your project", "Nov. 26 &", "Second Speech: Persuading a Local Audience 30%", "Third Speech: Persuading a Digital Audience 30%", "First Speech: Informing about your language", "The goal of this speech is for you to inform your audience about how your mother tongue  background, individual experience, and culture impact your self-concept, language use, sense of audience perceptions, constraints stemming from communicative norms, and methods you employ to negotiate various rhetorical situations.", "Second Speech: Persuading a Local Audience", "Third Speech: Persuading a Digital Audience", "3 short speech excercises: 3.33% each for a total of 10%", "You should also write a few brief notes on why you chose each quotation.", "How does it relate to the class?", "The moderator is responsible for running the class in an efficient and creative manner: introducing speakers, organizing the discussions with the evaluators, initiating class comments, and generally making sure that the session runs smoothly and according to schedule.", "90-Second Short Speech Exercises  (3 total, marked for completion):", "These public speaking exercisesintroduce students to fundamental rhetorical concepts and strategies.", "Over the course of the semester, you will present three exercises as 90-second speeches in front of the class or in small groups.", "For the first and second major assignments of the term, you will offer and accept productive feedback and produce brief analyses of your peers’ speeches in two-page, double-spaced papers (one each for the first and second major speech rounds).", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 2, "course_code": "EMLS 101R", "course_name": "EMLS101R - Oral Communications for Academic Purposes (0.50)", "term_name": "List 1", "program_name": "Degree Requirements", "program_id": 45, "major_id": 4, "major_name": "Bachelor of Computer Science Degree Requirements", "topics": ["& Location:", "Email:                         christa.schuller@uwaterloo.ca", "Designed specifically for students for whom English is not the first language, this course introduces group discussion strategies and presentation skills.", "A focus on pronunciation and vocabulary assists learners to better engage in conversations and listen to and deliver English presentations.", "This is achieved with the focus on gambits, voice quality, and speech clarity, which assist learners in developing strategies to better engage in discussions, and listen to and deliver English presentations in both remote and face-to-face contexts.", "Create and organize discussions and presentations", "Use a clear and appropriate format", "Develop relevant and well formatted materials (PowerPoint slides and discussion notes)", "Select effective introductions and conclusions to engage the audience", "Clearly express their ideas verbally and non-verbally", "Use communication gambits and signpost language effectively during discussions as well as individual and team presentations", "Use body language and space on stage to enhance the expression of ideas", "Listen for main ideas and details of some selected TED talks to form opinions on current socio-cultural, educational, environmental, and technological issues", "Critically evaluate various sources of information and then incorporate these sources in oral communication to create strong, academic support for their ideas", "Topics & Activities In-class Activities & Assignments Home                 Assignments", "Nonverbal communication- Importance of body language", "Introduction to group discussion assignment", "Analysis of non-verbal communication of selected presenters", "Small talk & non-verbal communication practice", "Main ideas and brief summary of TED Talks", "Question types for semi-formal discussion", "Discussion facilitation and gambits", "Non-verbal communication during a discussion", "Discussion skills", "Introduction to informative presentation introductions and conclusions", "Introduction to individual  presentations: thesis statement and format", "Chunking, pausing and focus words", "Writing thesis statements", "Pausing and focus words", "Effective PowerPoint slide design & APA citations", "Opening and closing a presentation", "Practice designing a slide and presenting its content", "Sample presentation", "Submitting PPT and Outline", "Submitting PPT and Outline", "Introduction to product review", "Inventions and innovations; product features", "Brainstorming for main ideas", "March 24 - 28", "Product review development – outline and slides", "Sample product review slides & outline", "Search for support materials, content development & slide design", "Product review presentations", "You will also need to watch the presentations of the other students and actively participate in the Q & A sessions following these presentations.", "A self-reflection on your preparation for the presentation, its delivery, and the Q & A will follow.", "A brief Q & A session will then follow.", "You will also need to watch the presentations of the other students and actively participate in the Q & A sessions following these presentations.", "These quizzes will cover the concepts related to academic and professional presentations, both individual and co-delivered, as well as discussions.", "Electronic Device Policy", "This course includes the independent development and practice of specific skills, such as collecting, synthesizing, and analyzing information; developing and practicing oral skills; critically evaluating and elaborating on ideas.", "Library for research-based assignments", "You can earn an EMLS Diploma by completing four EMLS courses and earning a cumulative average of 65%.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 3, "course_code": "EMLS 102R", "course_name": "EMLS102R - Clear Communication in English Writing (0.50)", "term_name": "List 1", "program_name": "Degree Requirements", "program_id": 45, "major_id": 4, "major_name": "Bachelor of Computer Science Degree Requirements", "topics": ["Clear Communication in English Writing Winter 2025", "K. Williams", "k33willi@uwaterloo.ca", "Designed specifically for students for whom English is not the first language, this course offers sentence-level instruction in grammar and idiom to teach students to produce, evaluate, and edit writing under time constraints.", "It emphasizes readability and error reduction in sentences and paragraphs.", "Identify sentence organization patterns and use them accurately and appropriately.", "Consider the importance of purpose and audience for specific writing tasks.", "In the case of emergency that may result in late submission, please contact the course instructor(s) to discuss potential extensions.", "You can earn an EMLS Diploma by completing four EMLS courses and earning a cumulative average of 65%.", "This course includes the independent development and practice of specific skills, such as writing sentences with grammatical accuracy and sentence structure, being able to edit writing for grammatical errors, developing and increasing vocabulary skills, and writing required organization patterns.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 4, "course_code": "EMLS 129R", "course_name": "EMLS129R - Written Academic English (0.50)", "term_name": "List 1", "program_name": "Degree Requirements", "program_id": 45, "major_id": 4, "major_name": "Bachelor of Computer Science Degree Requirements", "topics": ["Designed specifically for students for whom English is not the first language, this writing skills course provides instruction in grammar, sentence and paragraph structure, elements of composition, and academic essay writing, including a focus on theme, development of central ideas, exposition, and argumentation.", "The course provides instruction in grammatical accuracy, written fluency, and conventional essay patterns.", "This writing course is for students whose first language is not English.", "recognize and write conventional patterns of essay organization such as definition, compare-contrast and argument,", "use appropriate grammar structures to achieve accuracy in writing,", "draft and edit to achieve fluency in writing,", "Library for research-based assignments"]}]