[{"course_id": 29, "course_code": "PHYS 121", "course_name": "PHYS121 - Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 1, "major_name": "Science (Bachelor of Science - Honours)", "topics": ["An introductory course in physics for students intending to concentrate their future studies in the physical sciences, optometry, or mathematics; includes vectors (dot and cross products), particle kinematics and dynamics, forces in nature, work and energy, conservation of energy and linear momentum, rotational kinematics and dynamics, and conservation of angular momentum.", "Doing Physics - quantities, dimensions, units", "Point Dynamics - force, motion, Newton's laws", "Conservation of Energy - work and energy, conservative systems", "Conservation of linear Momentum - momentum and systems of particles", "Understand the following concepts:", "- Linear kinematics: the relationship between distance, velocity and acceleration.", "- Linear dynamics: a consequence of forces and momentum, and how they interrelate.", "- Kinetic energy, potential energy, work, and their interrelationships.", "We will also re-examine these concepts in a rotating coordinate frame using angular kinematic variables along with torque and angular momentum.", "6 Module 06:  Kinetic and Potential Energy", "7 Module 06:  Kinetic and Potential Energy", "8 Module 07:  Linear Momentum", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- eText + Student Access Code", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- Print Format + Student Access Code"]}, {"course_id": 30, "course_code": "PHYS 121L", "course_name": "PHYS121L - Mechanics Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 1, "major_name": "Science (Bachelor of Science - Honours)", "topics": ["Mechanics Laboratory Fall 2024", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "Julian Meunier", "Soorna Choheili", "Reza Asadi", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "complete introductory surveys", "complete introductory surveys,", "Complete end-of-term surveys", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 31, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 1, "major_name": "Science (Bachelor of Science - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 32, "course_code": "PHYS 122L", "course_name": "PHYS122L - Waves, Electricity and Magnetism Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 1, "major_name": "Science (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 2 - Circuits", "Experiment 5 - Magnetic Fields of a Coil", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 34, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 1, "major_name": "Science (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 0, "course_code": "BIOL 110", "course_name": "BIOL110 - Biodiversity, Biomes, and Evolution (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["Notice of Recording", "Labs begin the week of **Sept. 9**", "(Any issues in laboratory should contact Dr. Wolff)", "Monitor LEARN for important information", "A survey of organisms that inhabit a range of aquatic and terrestrial ecosystems (e.g., coral reefs, lakes, forests).", "Evolutionary and ecological frameworks will be used to explore how organisms diversify and are considered distinct species.", "The laboratory for this course is integrated with the lecture (unlike some of your other first year courses) - you will need to be sure to read the lab exercises before attending, and come prepared for our outdoor labs where appropriate shoes and clothing are necessary for the weather.", "I teach courses in ecology, evolution and genetics.", "I have been teaching evolution and ecology at the University of Waterloo for 7 years, and I hope to share with students my enthusiasm for phylogenetics.", "List themes and characteristics that differentiate the major groups of eukaryotes.", "Identify specific animals that facilitate and/or endanger human society.", "Construct and evaluate phylogenetic trees using parsimony", "Introduction", "Phylogeny and the modern view of biological relatedness", "Ecosystems and Resource Flux", "**Oct. 28  Midterm**", "Concepts in Diversity", "Activities will include using microscopes and drawing what you see, dissections of preserved animals, and collecting benthic invertebrates from the local stream and identifying them using pictoral keys.", "Note: You can also choose to do neither and forego the bonus mark altogether, as this is voluntary.", "Participation in Research Study", "Reminder, as participation in this study is voluntary, and it is a bonus mark, students may also decide to not do either activity and forego the bonus mark altogether.", "Notice of Recording", "In the case of an unwritten final exam, your course mark will be entered as DNW (32% for calculation of overall average)."]}, {"course_id": 1, "course_code": "BIOL 130", "course_name": "BIOL130 - Introductory Cell Biology (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["S. Ruffell", "An introduction to the concepts of cell biology with emphasis on (1) the structural organization of the cell and (2) the function of critical molecular processes that are characteristic of living organisms.", "Explain the fundamental elements of cells, the chemistry of life, and the major classes of biological macromolecules.", "Describe metabolism, the role of enzymes in chemical reactions, and how cells can capture, and utilize, energy.", "Explain how cells respond to signals and form cellular communities.", "Module 1 - Introduction to Cell Biology & The Cell Theory", "Module 2 - Molecules of Life", "2 Module 3 - Cells and Membranes  In-class case study", "3 Module 4 - Nucleic Acids & Information Flow", "4 Module 5 - Protein Structure, Function & Synthesis  In-class case study", "6 Module 7 - Cellular Respiration In-class case study", "In-class case study", "9 Module 9 - Cell Signalling", "10 Module 10 - Cell & Tissue Form", "and In-class case study", "11 Module 11 - DNA Replication & Cell Division Case study due", "12 Module 11 - DNA Replication & Cell Division  Term Test 1", "Official Grades and Course Access", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each module for the achieve assignments and term tests.", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines", "Library for research-based assignments"]}, {"course_id": 2, "course_code": "BIOL 150", "course_name": "BIOL150 - Organismal and Evolutionary Ecology (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["Organismal and Evolutionary Ecology Fall 2023", "11:30AM - 12:20PM RCH 101", "Learn Discussion Board", "Email and Appointment Requests", "Coverage includes hypothesis testing and the nature of scientific inquiry, basic population genetics, physiological ecology, life histories, dispersal, basic population and community ecology, macroevolution, systematics and classification, as well as functional morphology.", "The theory of evolution unites the whole of biology and all living organisms into a coherent body of knowledge, allowing comparisons across all forms of life.", "Ecology describes how organisms interact with their environment and each other to create interdependent systems from microscopic to global scales.", "These disciplines are fundamentally tied together: evolution is the primary mechanism by which species adapt to their environment; ecological interactions and environmental variability drive natural selection.", "You will also carry out simulated lab assignments to test the principles of evolution, design ecological experiments to test alternate hypotheses about the conservation of species and manipulate demographic parameters to test their influence on population growth.", "Understand the principles of scientific methodology", "Define ecological and evolutionary terms, such as the niche, adaptation, and altruism", "Illustrate these mechanisms in the context of course examples", "Explain how ecological interactions and evolution are interconnected", "Sign code of conduct and upload to LEARN.", "2) Sept 8 Evolution for Ecology Section 1: Evolution and Ecology are Intertwined", "4) Sept 13 Evolution for Ecology", "5) Sept 15 Evolution for Ecology Section 3: Genetics and Evolution", "6) Sept 18 Evolution for Ecology Section 4: Managing the Evolution of Resistance", "9) Sep 25 Physiological Ecology Section 1: Trade-offs and Species Distributions", "15) Oct 9-13 Holiday – No classes Understanding Experimental Design Simulation due by Oct 16, 11:59 pm", "16) Oct 16 Empiricism in Ecology Understanding Experimental Design Simulation due by 11:59 pm (best 2/3 for 10%)", "It is important that you review the information below before you subscribe to the SimUText for Organismal Ecology and Evolution - Chapters at University of Waterloo.", "SimUText Application Installers", "SimUText Application Installers", "At the end of every unit, you will work individually to develop a concept map using Cmap Cloud to visually display the relationships among what you consider the key concepts in the unit.", "These should represent your personal comprehension of how the concepts relate to each other, and no two should be identical.", "Also, class will entail a lot of discussion that won’t be represented in PPT slides.", "The simulations include one on Evolution in Ecology, one on Experimental Design in Ecology and one on Population Growth.", "The learning outcome for the unit tests is to demonstrate your recall and comprehension of the material covered in the units and to incentivize keeping up with the readings and attending lectures and reviewing for the final exam.", "The learning outcome is to demonstrate recall, synthesis and integration of material learned during the course.", "The final exam will consist of multiple-choice, T/F, solve the equation type of questions and integration questions that are designed to test your basic and deeper understanding of the course concepts.", "Important note regarding tests and exams", "Unit tests will be completed for the first 4 units of the course.", "Ensure you have a reliable internet connection and functional computer to complete them – technical challenges encountered during remote completion are not an excuse for missed tests.", "I will have a limited number of printed back-ups for students in class who experience technical difficulties.", "You will need to have a reliable internet connection and functional computer to complete the exams.", "Emails can be received 24 hours per day.", "If you miss a make-up exam for any reason, you will be given a DNW, and must petition the Associate Dean of Science if you feel you missed it for a valid reason.", "At the discretion of the instructor, you may be permitted to write a make-up exam.", "The timing will be conveyed to you via e-mail if you are eligible for a make-up.", "If you follow these steps,", "I will consider granting an extension", "Students are responsible for their own behavior and should be mindful of the impact that their actions have on the wellbeing of others.", "Act in a respectful and open manner when listening to the views and ideas of others.", "Participate fully in the discussion boards: make sure your answers are to the best of your ability and that you respond to others’ posts.", "Signature"]}, {"course_id": 3, "course_code": "BIOL 165", "course_name": "BIOL165 - Diversity of Life (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["S. Ruffell", "An introduction to the diversity of living organisms from simple prokaryotes to complex eukaryotes.", "The characteristics that define these phyla", "Be able to compare and contrast life histories", "Introduction and Cell Biology", "Phylogeny and Classification", "Bacteria and Archaea", "Protists", "Library for research-based assignments"]}, {"course_id": 4, "course_code": "BIOL 201", "course_name": "BIOL201 - Human Anatomy (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["09:30AM - 10:20AM STC 1012", "Email messages not adhering to these conditions will not be read and will be deleted.", "This course takes a systems approach to study the structure of the human body and its relationship to function.", "Structural features of organ systems will be explored through lectures and laboratory exercises.", "Note that these recordings are NOT guaranteed nor are these recordings meant to be a replacement for in-person learning.", "Develop a vocabulary to effectively communicate anatomical concepts", "Recognize and identify the anatomical structures of all of the organ systems of the human body", "Demonstrate an understanding of anatomical structures through laboratory sessions", "Week 1 Introduction to Human Anatomy & the Integumentary System", "Week 3 Bones and the Skeleton - part 2 & Skeletal Muscle", "Week 8 Endocrine System & Circulatory System - part 1", "Week 10 Respiratory System & Digestive System", "Official Grades and Course Access", "This will be followed by an exploration into the appendages of the skin.", "Initially basic structure, location, and classification of bones will be explored.", "This will be followed by an examination of select major skeletal muscles of the body.", "The basic divisions of the nervous system will be introduced in the unit.", "A gross overview of the nervous system anatomy will precede further discussion on the anatomy of the central nervous system (CNS) and peripheral nervous system (PNS).", "Unit 6 – Endocrine System (Chapter 17)", "This will be followed by an examination of the major endocrine organs and other structures associated with the endocrine system of the body.", "The circulatory system will be discussed in this unit.", "The anatomy of the respiratory system will be examined in this unit.", "This will be followed by the anatomy of the upper and lower respiratory components.", "The anatomy of the digestive system will first be examined in this unit.", "This will be followed by the anatomy of the urinary system will be examined including the kidneys followed by the ureters and the urinary bladder.", "Expectations for Change"]}, {"course_id": 5, "course_code": "BIOL 211", "course_name": "BIOL211 - Introductory Vertebrate Zoology (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["10:30AM - 11:20AM M3 1006", "An introduction to the structure, evolution, and development of vertebrate organ systems, explored through lectures and laboratory exercises.", "Understand the diversity of vertebrates that exist in the world", "Know some of the anatomy, physiology, reproductive strategies, behaviour and ecology of vertebrates", "Be familiar with the basic techniques of dissection through laboratory sessions", "Introduction to vertebrate zoology", "Bony fishes", "Adaptations of synapsids & sauropsids", "Turtles", "Tuatara, lizards & snakes", "Bird origins & adaptations", "Lab Manual Introduction to Vertebrate Zoology Available at bookstore Yes 28", "Call number UWD 1528"]}, {"course_id": 6, "course_code": "BIOL 220", "course_name": "BIOL220 - Introduction to Plant Structure and Function (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["Introduction to Plant Structure and Function Winter 2025", "11:30AM - 12:20PM RCH 101", "S. Schoor", "I will make my best effort to respond to emails within 24 hrs.", "An introduction to plant diversity, and the anatomy and physiology of vascular plants.", "Understand the importance of the relationship between plants and humans in the environment and appreciate the species richness and diversity of plants", "Recognize and identify various cell types and how they account for the structure and function of tissues and organs", "Plant Evolution: Structure and Reproduction", "Focus will be applied to the adaptive strategies employed by algae to move from water to land, the development of complex tissues and organs and the role of reproduction strategies in plant success.", "Cellular composition of plant tissues and what role they play in their function will be studied; with particular interest in the relationship between vascular tissue and water transport.", "Additionally, students will study how hormones and growth regulators regulate plant development, tropic movement and plant response to biotic and abiotic stressors, as well as learn of their many uses in agriculture.", "Week 1 Jan 6 (1) Introduction & The Plant Cell (Ch 1,3) No labs this week", "Laboratory Mark Distribution", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline)."]}, {"course_id": 7, "course_code": "BIOL 239", "course_name": "BIOL239 - Genetics (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["11:30AM - 12:20PM", "10:30AM - 11:20AM STC 1012", "You can!", "Chromosomal mechanisms in mitosis and meiosis.", "Natural selection and the evolution of genetic systems.", "Describe the fundamentals of gene structure, function and transmission in prokaryotic and eukaryotic cells and organisms.", "Describe the various ways mutations can arise and how mutations may affect gene expression and phenotypic outcomes.", "Describe recombinant DNA technology in bacteria and its role in biotechnology.", "Effectively work with others, discussing, evaluating, and communicating genetics concepts and synthesizing ideas in a group.", "Readings", "textbook 1.1-1.2", "Mendelian genetics and probability", "Modification of Mendelian ratios", "textbook 3.2-3.3, 4.2-4.4, 15.1", "Mitosis, meiosis, and chromosome numbers", "DNA and the genetic code", "textbook 9.2-9.3", "T4: Mitosis and meiosis", "DNA cloning", "T5: Testing genetic ratios", "Cancer genetics", "T9: Population genetics", "Exam period", "- write the final exam and achieve a grade of at least 50% on the cumulative test and exam section", "Online learning activities: These activities are designed to test your knowledge of several important concepts explained by the lecture presentations in this course, and should be completed after the portion of the course when they are covered in lecture.", "They are all due toward the end of the term but can be completed as many times as you like to help you work on these concepts.", "Read the instructions carefully before attempting these as a completion quiz (in the quiz section) must also be completed to obtain credit.", "In this case, the weight of the missed submission will be transferred to the final exam.", "The dates affected and degree of incapacitation will be used to determine follow-up action."]}, {"course_id": 8, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}, {"course_id": 9, "course_code": "BIOL 241", "course_name": "BIOL241 - Introduction to Applied Microbiology (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["Notice of Recording", "Introduction to Applied Microbiology Winter 2025", "RCH 101", "Course Lecturer: Dr. Kesen Ma; kma@uwaterloo.ca; office hours & virtual meetings (Zoom) by appointment only", "Laboratory Instructor: Dr. Cheryl Duxbury; cduxbury@uwaterloo.ca; office hours & virtual meetings (Microsoft Teams) by appointment only", "Introduction to microbial ecology, environmental microbiology, food microbiology, and medical microbiology explored through lectures and laboratory exercises.", "Topics in environmental microbiology include biogeochemical cycling and biological treatment of wastes and pollutants.", "Topics in medical microbiology include concepts of immunology and host-pathogen relationships.", "microbial ecology", "bacteria-bacteriophage interactions", "biodegradation and bioremediation • sewage treatment", "industrial microbiology", "host-parasite relationships - factors in microbial pathogenicity, innate barriers in the host", "immunology - innate, adaptive", "immunization; immune response diseases", "Extend Biol 240 and cover topics such as the diversity of microbial metabolism and habitat, the importance of microbes in nutrient cycling, biological treatment of pollution, use of microorganisms for the production of food, pharmaceuticals, and the role of microbes in human disease.", "Know the importance of microbes to life as we know it, and the applications of useful microbial characteristics.", "Enhance understanding of the roles that microbes play in the natural world .", "Learn more skills in aseptic laboratory techniques and know how to conduct some classical microbial testing of food, water, and soil.", "Lecture topics and relevant textbook chapters", "2021 & 2017.", "Microbial Ecology", "2. Bacteria-Bacteriophage Interactions", "Terrestrial & Aquatic Environments", "5. Biodegradation & Bioremediation", "Food & Industrial Microbiology", "(spoilage & preservation", "food & industrial processes)", "Immunology", "(innate, adaptive immunity,immunization & immune response diseases)", "Infectious Disease", "*note: this is the same textbook as used in BIOL 240 & BIOL 240L. The new 3rd edition of the book can be accessed via a subscription through Wiley ($57 for 150-day subscription, $134.95 for a lifetime subscription:", "This manual cannot be ordered online and must be purchased in person prior to your first lab.", "Both exams will be in a multiple-choice format (e.g., multiple choice, true/false, matching questions, fill in the gap).", "Notice of Recording", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Allowed", "Allowing under certain conditions", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 10, "course_code": "BIOL 251", "course_name": "BIOL251 - Fundamentals of Ecology (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["02:30PM - 05:20PM B2 151", "02:30PM - 05:20PM B2 151", "Mike Allen", "Email: mike.allen@uwaterloo.ca", "Email: brwolff@uwaterloo.ca", "Claire Schon", "Email: d4andradepereira@uwaterloo.ca", "This course provides students with an introduction to the breadth of the ecology discipline, including laboratory and field components.", "It covers hypothesis testing and the nature of scientific inquiry, organismal, population, community, and ecosystem levels of ecology.", "Lab 2: Prepare test populations of bean beetles to use in a population estimation exercise; set up a capture/mark/recapture experiment using the Lincoln-Peterson Method; examine the results of the experiment using basic statistics to determine the reliability of the Lincoln-Peterson Method under these conditions; prepare a short report conveying the results, along with comments on the experimental design etc.", "Lab 4: Understand the life history of goldenrod, gall flies and their predators; be able to dissect galls and identify larvae using a dichotomous key; collect gall/larval data and hypothesize about any interactions between the species involved.", "12 Nov 18-22 Eutrophication Analysis"]}, {"course_id": 11, "course_code": "BIOL 266", "course_name": "BIOL266 - Introduction to Computational Biology (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["Introduction to Computational Biology Fall 2022", "Instructor: Prof. Andrew Doxey", "This course provides an introduction to computational methods in biology, including exploration of bioinformatics databases and tools, analysis of protein and DNA sequences, and computer-aided modelling of biological systems.", "Explore online bioinformatic databases to interact with DNA, protein, gene expression, structural, and systems biology data", "Compute optimal alignments between pairs of sequences using dynamic programming algorithms", "Perform multiple sequence alignments", "Perform 3D structural modelling and visualization of proteins", "Examine and analyze gene expression data from microarrays and RNA-seq experiments", "Understand the fundamentals of systems biology including network analysis and visualization of interactomes", "Data Type", "Introduction   None", "Molecular evolution I Trees Lab #4 - Phylogenetics I 2.2%", "Molecular evolution II Trees MIDTERM 30%", "Molecular evolution III Trees Lab #5 - Phylogenetics II 2.2%", "Structural modelling and biophysics Structures Lab #6 - Structural Modeling 2.2%", "Networks and Systems Biology Networks Lab #9 - Exploring the STRING database 2.2%"]}, {"course_id": 12, "course_code": "BIOL 273", "course_name": "BIOL273 - Principles of Human Physiology 1 (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["Notice of Recording", "10:00AM - 11:20AM M3 1006", "M. Bording-Jorgensen", "Dr. Vivian Dayeh - Tuesdays 11:30 am -12:30pm in B1-277.", "The physiology of major organ systems of the human body.", "Topics include neurophysiology and peripheral nervous system, muscle, the cardiovascular system, the components of blood, respiratory system, and immune system.", "The combination of BIOL273 and BIOL373 covers all of the major topics of human physiology.", "Identify the components/structures of the following organ systems: nervous, muscular, cardiovascular, respiratory, and immune.", "Describe how these five organ systems are organized in the human body.", "Explain the function of each of these five organ systems.", "Demonstrate the integration of these five organ systems in maintaining homeostasis.", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Official Grades and Course Access", "Corresponding Silverthorn textbook chapters in parentheses for each unit.", "This unit serves as an introduction to the study of the function of the five organ systems examined in this course (nervous, muscular, cardiovascular, respiratory, and immune).", "Unit 1 will introduce how the organ systems work together to maintain homeostasis within the body.", "The organization of the nervous system will be explored in this unit.", "The types of cells found in the central and peripheral nervous system serve as a starting point to discuss their function within the nervous system.", "Initially gross structure of skeletal muscle including the structure of a muscle fibre and myofibrils will be examined.", "An exploration into the muscle contraction mechanism via excitation-contraction coupling will be examined to explain how muscles work.", "This unit will start with an introduction into the heart and components of the cardiovascular system, which will be followed by cardiac muscle contraction mechanism.", "In this unit we will examine the structure and function of the respiratory system, incorporating gas laws and ventilation.", "Pulmonary function through lung compliance and elastance as well as the control of ventilation will be examined.", "This unit will start with the general function of immune system and introduction to the types of pathogens that infect the body.", "The anatomy of the immune system will be discussed returning to the role of haematopoiesis.", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each unit for the assignments and term tests.", "Required for the Mastering A&P Online Assignments and Dynamic Study Modules.", "Course website Waterloo Learn https://learn.uwaterloo.ca - includes general course information, language of physiology online assignment, review sheets for each unit, and links to the Mastering A&P Online Assignments.", "Emails can be received 24 hours per day.", "Students should carefully consider the wisdom of missing a test or assignment.", "Mastering A&P assignments handed in late will receive a deduction of 5%/day for the first five late days after which a grade of zero (0) will be recorded.", "Notice of Recording", "Don’t waste your time with these requests!", "Expectations for Change", "This course includes the independent development and practice of specific skills, such as multiple choice question creation.", "Library for research-based assignments", "Disability-related Policies"]}, {"course_id": 13, "course_code": "CHEM 120", "course_name": "CHEM120 - General Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["General Chemistry 1 Winter 2025", "RCH 101", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "The second part of this course is concerned with explaining periodicity and trends in chemical reactivity in terms of the electronic structure of atoms and molecules.", "Topics covered in this part of the course include the quantum theory of the hydrogen atom; electron configurations in multi-electron atoms; ionic and covalent bonding; Lewis structures, valence shell electron repulsion theory and molecular geometry; quantum mechanical bonding theories, including valence bond theory and molecular orbital theory.", "Additional topics may include an introduction to electron-transfer reactions, including the assignment of oxidation states and the balancing of oxidation-reduction reactions.", "assess the greenness of a chemical reaction using Atom Economy and E-Factor metrics.", "describe the electronic structure of atoms in terms of quantum theory using atomic orbitals and quantum numbers.", "justify the organization of the periodic table and predict trends in the properties of the elements.", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and explain molecular shape and stability in terms of electron count.", "describe the interactions of molecules in solids, liquids, and gases to compare physical and reactive properties.", "Course Structure and Continuity Plans", "No extensions will be granted for Participation Challenges, but each student can drop one participation challenge from their overall grade.", "Printed spiral bound copies of the course notes can be purchased online from the UW bookstore https://wstore.uwaterloo.ca/", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare pandemic-related illnesses on Quest (Information at this link)", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 14, "course_code": "CHEM 120L", "course_name": "CHEM120L - General Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["General Chemistry Laboratory 1 Fall 2024", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Be sure to record their name and contact information in your lab manual.", "Skillfully perform basic procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "1,3,5,7,9,11", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Sept 19 - 24", "1,3,5,7,9,11", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "1,3,5,7,9,11", "- studying cis and trans isomers", "Oct 24-29", "1,3,5,7,9,11", "Titration as an Analysis Tool", "- identify an unknown solid acid", "1,3,5,7,9,11", "Introduction to Chromatography", "- quantify a cation using ion exchange", "1,3,5,7,9,11", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 15, "course_code": "CHEM 123", "course_name": "CHEM123 - General Chemistry 2 (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["General Chemistry 2 Winter 2025", "09:30AM - 10:20AM STC 1012", "Introduction to chemical equilibria.", "Describe the energy and entropy changes that accompany physical and chemical changes.", "Calculate the equilibrium constant for a reaction using the standard thermodynamic properties of reactants and products.", "Predict the direction of spontaneous change for a given set of initial conditions for a variety of chemical systems.", "Apply equilibrium principles to a variety of chemical reaction types including gas-phase reactions, acid-base reactions, precipitation reactions, complexation reactions and redox reactions.", "Analyze oxidation-reduction reactions and identify species being oxidized and reduced.", "Explain the basic construction of, uses of, and the differences between galvanic and electrolytic cells.", "CHEM 120 and CHEM 123 comprise a full-year course in introductory chemistry.", "Course Structure and Continuity Plans", "Chemistry Study Hall:  Starting the 2nd week of classes, there will be a first-year study hall on Tuesdays and Thursdays at 5:30 pm - 6:50 pm in STC 1012.", "You can attend as many Study Hall Sessions as you would like - grab your friends and connect with your TAs!", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 16, "course_code": "CHEM 123L", "course_name": "CHEM123L - General Chemistry Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["General Chemistry Laboratory 2 Winter 2025", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- a real life analysis", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 17, "course_code": "CHEM 121", "course_name": "CHEM121 - Physical and Chemical Properties of Matter (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["Physical and Chemical Properties of Matter Fall 2024", "B. Power", "A first-year chemistry course for students in chemistry-based programs.", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "describe the energy levels of the H atom in terms of atomic orbitals and quantum numbers", "describe the electronic structure of atoms and justify the organization of the periodic table", "predict trends in the properties of the elements", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and understand molecular shape and stability in terms of electron count", "describe the behaviour and interactions of molecules in gases", "predict the effects of intermolecular interactions on the properties of gases and liquids", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "You must submit the University of Waterloo Verification of Illness (VIF) form  by emailing a clear scanned copy to bothyour instructor and science.advisor@uwaterloo.ca", "This course includes the independent development and practice of specific skills, such as problem solving in a chemical and scientific context.", "Library for research-based assignments"]}, {"course_id": 18, "course_code": "CHEM 121L", "course_name": "CHEM121L - Chemical Reaction Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Contact:  Drop in questions are welcome during the hours stated above.", "Questions sent in the wee hours of the morning, the day your report is due, may not receive a response in time!", "Record their name and contact information in your lab manual.", "The CHEM 121L course is an in-depth introduction to the chemistry laboratory environment and provides an opportunity to develop basic lab skills, as well as introducing some basic aspects of experimental design.", "Skillfully perform procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Determine appropriate tools for required accuracy of a given analysis", "Evaluate and follow scientific protocols, and modify them as required to complete an analysis, design and test experimental protocols", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Section", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "- studying cis and trans isomers", "Qualitative and Quantitative Analysis", "Introduction to Chromatography", "- quantify a cation using ion exchange", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 19, "course_code": "CHEM 125", "course_name": "CHEM125 - Chemical Reactions, Equilibria and Kinetics (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["CHEM 125 is a first-year Chemistry course for students in Chemistry-based programs.", "A first-year chemistry course for students in chemistry-based programs.", "Introduction to chemical equilibria.", "Describe the energy and entropy changes that accompany physical and chemical changes.", "Calculate the equilibrium constant for a reaction using the standard thermodynamic properties of reactants and products.", "Predict the direction of spontaneous change for a given set of initial conditions for a variety of chemical systems.", "Apply equilibrium principles to a variety of chemical reaction types including gas-phase reactions, acid-base reactions, precipitation reactions, complexation reactions and redox reactions.", "Analyze oxidation-reduction reactions and identify species being oxidized and reduced.", "Explain the basic construction of, uses of, and the differences between galvanic and electrolytic cells.", "CHEM 121 and CHEM 125 comprise a full-year course in introductory chemistry.", "Course Structure and Continuity Plans", "Chemistry Study Hall:  Starting the 2nd week of classes, there will be a first-year study hall on Tuesdays and Thursdays from 5:30 pm - 6:50 pm in STC 1012.", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 20, "course_code": "CHEM 125L", "course_name": "CHEM125L - Chemical Reaction Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and to modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Section", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- analysing real world samples and", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 21, "course_code": "EARTH 121", "course_name": "EARTH121 - Introductory Earth Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["Introductory Earth Sciences Fall 2024", "Students will learn to think like a geoscientist by adopting four ways of thinking that take into account a systems approach, a variety of spatial and temporal scales, and field thinking.", "Recognize the dynamic nature of Earth through an examination of the interactive components of the Rock Cycle.", "Extrapolate meaning from everyday geologic material and predict occurrence and origin.", "Week 1: Introduction and Four Ways of Thinking 1a and 1b Discussion: Introduce Yourself", "Week 2: Introduction to Rocks 2a Field Notes Journal 2: Are minerals important?", "Week 3: Introduction to the Rock Cycle 2b Field Notes Journal 3: What do you see in the video?", "Week 4: Introduction to the Rock Classification 2c Field Notes Journal 4: Is this depiction of the Rock Cycle complete and accurate?", "Week 5: Geologic Time and Geologic Time Scale 3a and 3b Field Notes Journal 5: How do I create a simplified Geologic Time Scale?", "Please note emails can be received 24 hours per day", "Short-term Absence", "Covid-19-related Absence", "Intellectual property includes items such as:"]}, {"course_id": 22, "course_code": "EARTH 121L", "course_name": "EARTH121L - Introductory Earth Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["Introductory Earth Sciences Laboratory Fall 2024", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Email: keith.delaney@uwaterloo.ca", "Sahar Soltani - sahar.soltani@uwaterloo.ca / LABS 001 & 003", "By far, the majority of people qualified as geologists spend their time using their knowledge working 'in the field', or in exploration, putting principles learned in theory and in the laboratory, into practice.", "Identify common mineral and rocks based on their identification properties", "Understand the rock cycle and how minerals and rocks are formed", "Understand the theory of plate tectonics and how it has shaped the Earth's surface over time", "Qualitatively and Quantitatively describe earthquakes and some of their processes", "Read and interpret data from both topographic and geologic maps", "Understand the immense history and geologic record of our planet", "Understand the factors influencing climate change and quantify how the planet is changing", "Will assess Mineral and Rock Identification knowledge with real samples.", "Lab 8 Earth Structures", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "Situation where VIFs are not Appropriate"]}, {"course_id": 23, "course_code": "EARTH 122", "course_name": "EARTH122 - Introductory Environmental Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["Introductory Environmental Sciences Winter 2025", "08:30AM - 09:50AM STC 1012", "I hold a PhD in Earth & Environmental Sciences from the University of Waterloo (2014) and an HBSc in Earth & Environmental Sciences from McMaster University (2006).", "You might notice I'm looking pretty pregnant!", "I'm conveniently due on April 27 BUT in the unlikely even that I have a baby really early, the excellent Dr. Keith Delaney (who has taught this class for many years) will step in at the end.", "Discussions", "Questions of a personal nature", "Office: EIT 2051D (very back of Earth & Environmental Sciences main office)", "Email: msrosamo@uwaterloo.ca", "Grad TA contact info can be found in the EARTH 122L syllabus.", "Course topics include sustainable development and the availability and use of natural resources, principles of ecology and environmental science, biogeochemical cycles, climate and climate change, soils and food supply, energy systems, surface water and groundwater, waste generation and management, pollution, and catastrophic natural processes.", "Describe common global environmental issues and the role of environmental science in identifying, understanding, and solving these issues.", "Interpret and manipulate simple box models of environmental systems", "Interpret scientific diagrams and graphs pertaining to environmental science", "1 January 06 - 10 Intro to Environmental Science & Matter, Energy and Physical Environment Chps 1 & 2", "2 January 13 - 17 Earth Systems/Ecosystems & Evolution, Biodiversity, Population Ecology Chps 3 & 4", "3 January 20 - 24 Species Interactions/Community Ecology & Human Population Chps 5 & 6", "Soils & Soil Resources*", "8 February 24 - 28 Freshwater Systems/Water Resources & Marine, Coastal Systems, Fisheries Chps 11 & 12 Quiz 6 - Chapters 11 & 12 Content Mon. Mar 3  5:00PM 3", "10 March 10 - 14 Global Climate Change & Fossil Fuels: Energy Use/Impacts Chps 14 & 15", "Energy Alternatives & Mineral Resources & Mining", "Quiz 8 - Chapters 15 & 16 & 17 Content*", "12 March 24 - 28 Managing our Waste & Environmental Health Hazards Chps 18 & 19 Quiz 9 - Chapters 18 & 19 Content Mon. Mar 31 5:00PM 3", "A Look at Environmental Science and Natural Hazards & Final Exam Study Guide / Discussion", "following these guidelines: https://uwaterloo.ca/science-undergraduate-office/academic-policies-and-procedures/accommodation-illness-or-other-extenuating-circumstances."]}, {"course_id": 24, "course_code": "EARTH 122L", "course_name": "EARTH122L - Introductory Environmental Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["Notice of Recording", "Introductory Environmental Sciences Laboratory Winter 2025", "EARTH 122L", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Sana Ahmad has a BSc degree in Honours Co-op Environmental Science with a Geoscience Specialization from the University of Waterloo.", "Discussions", "Questions of a personal nature", "Office: EIT 2046 (within the Earth & Environmental Sciences main office)", "Email: s76ahmad@uwaterloo.ca", "Please put EARTH 122L in your email subject line so I don't miss it!", "Please do not send them personal emails!", "View requirements for EARTH 122L", "Use GPS devices and GIS software to locate points of interest and create a map", "ALL LABS ARE HELD IN ROOM: EIT 1013 (ground floor of EIT  - same building as Earth Sciences Museum)", "8 February 24 - 28 Coastal Processes and Problems: Loving Our Coasts to Death?", "10 March 10 - 14 On-Campus Water Sampling and GPS Data Collection Field Sampling and Data Collection Lab around UW Campus", "13 March 31 - April 03 Landscape Geology: Glaciers and Deserts & Climate Change: Pleistocene Records, Milankovitch Cycles Lab 8: Landscape Geology and Climate Change End of Lab 7%", "Note used copies are also fine!", "The format of the final exam will be run digitally through the LEARN Quiz system in the last week of the course, not during the formal exam period.", "Notice of Recording", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "These can be completed digitally now!", "This official verification is necessary before any action can be taken and can be downloaded from the Health Services website.", "Situation where VIFs are not Appropriate", "Example citations:", "\"References"]}, {"course_id": 25, "course_code": "PHYS 111", "course_name": "PHYS111 - Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["An introduction to physics for students intending to concentrate their further studies in biology, dentistry, medicine and paramedicine; includes particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.", "The main physics principles and laws covered in PHYS 111 include: “Particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.”", "PHYS 111 focuses on basic physics principles and laws, on conceptual understanding and problem-solving skills, and an appreciation for the power of physics in explaining how nature works, in the contexts of both the physical and life sciences.", "Physics Principles and Laws: By the end of the course, students will be able to construct scientifically sound explanations of a variety of basic physical phenomena by applying basic physics principles/laws.", "define linear momentum, and calculate and compare momenta of various real-life objects;", "define and calculate impulse, and establish the conditions for conservation of linear momentum; and", "apply the laws of conservation of momentum and energy to collisions.", "Problem-Solving Skills and Strategies: By the end of the course, students will be able to creatively apply a variety of structured problem-solving strategies:", "interpret, visualize and convert the problem into a physical model (e.g., draw a free body diagram);", "evaluate the result — does it make sense?", "These problem-solving skills are useful in the students’ own disciplines and beyond.", "More detailed information about the course elements which contribute to the final grade will be given in the learn sight and in future outline updates", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 26, "course_code": "PHYS 111L", "course_name": "PHYS111L - Physics 1 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "Derin Erisoglu-Akyildiz", "Saba Karimi", "Do Yun Park", "jbschrie@uwaterloo.ca", "s38karim@uwaterloo.ca", "first for minor issues", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "12 & 13", "Complete end-of-term surveys before Dec. 3", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 27, "course_code": "PHYS 112", "course_name": "PHYS112 - Physics 2 (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["Notice of Recording", "10:30AM - 11:20AM DC 1350", "S. Idziak", "08:30AM - 09:20AM", "Email: idziak@uwaterloo.ca", "Email: james.forrest@uwaterloo.ca", "A continuation of PHYS111; includes simple harmonic motion, electrostatic force and potential, electric current and power, DC circuits, magnetic field and induction, wave motion, sound, and optics.", "To develop the ability to solve problems in areas related to oscillations and waves, electricity and magnetism, and optics", "Understand physical concepts associated with oscillations, waves, sound, electricity and magnetism, and optics", "Apply concepts of force and energy and recognize when acceleration is not constant", "Solve simple physical systems using physical concepts", "Draw relevant sketches from information given in word problems", "Develop physically relevant equations from information given in word problems", "Convert complex problems into a series of sub-problems and solve", "Topic Textbook Chapters                                                                            Number of lectures", "Electric Forces & Fields (Serway) Chapter 15: 1-5", "Electric Potential & Energy (Serway) Chapter 16", "Current and Resistance (Serway) Chapter 17: 1-6", "Magnetic Flux & Induction   1", "College Physics: A Strategic Approach by Jones, Knight, and Field This was suggested for 111.", "I do not find that these books are great but they are available for no cost.", "Please help to create a welcoming and inclusive environment.", "An exam-like problem will be posted each week on LEARN.", "2 points will be given for each clicker response with an additional 1 point for each correct response.", "What happens if I join the course late:", "Missed a regular assignment:", "Emails can be received 24 hours per day.", "Remember that falsely claiming you are ill can result in academic polices per Policy 71.", "Email communications:", "Notice of Recording"]}, {"course_id": 28, "course_code": "PHYS 112L", "course_name": "PHYS112L - Physics 2 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Sean Dougherty", "Aney Kapadia", "Kayra Erisoglu-Akyildiz", "jbschrie@uwaterloo.ca", "s2doughe@uwaterloo.ca", "Course Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"'", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 3 - Circuits", "Experiment 4 - Circuits", "Experiment 5 - Circuits", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 29, "course_code": "PHYS 121", "course_name": "PHYS121 - Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["An introductory course in physics for students intending to concentrate their future studies in the physical sciences, optometry, or mathematics; includes vectors (dot and cross products), particle kinematics and dynamics, forces in nature, work and energy, conservation of energy and linear momentum, rotational kinematics and dynamics, and conservation of angular momentum.", "Doing Physics - quantities, dimensions, units", "Point Dynamics - force, motion, Newton's laws", "Conservation of Energy - work and energy, conservative systems", "Conservation of linear Momentum - momentum and systems of particles", "Understand the following concepts:", "- Linear kinematics: the relationship between distance, velocity and acceleration.", "- Linear dynamics: a consequence of forces and momentum, and how they interrelate.", "- Kinetic energy, potential energy, work, and their interrelationships.", "We will also re-examine these concepts in a rotating coordinate frame using angular kinematic variables along with torque and angular momentum.", "6 Module 06:  Kinetic and Potential Energy", "7 Module 06:  Kinetic and Potential Energy", "8 Module 07:  Linear Momentum", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- eText + Student Access Code", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- Print Format + Student Access Code"]}, {"course_id": 30, "course_code": "PHYS 121L", "course_name": "PHYS121L - Mechanics Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["Mechanics Laboratory Fall 2024", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "Julian Meunier", "Soorna Choheili", "Reza Asadi", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "complete introductory surveys", "complete introductory surveys,", "Complete end-of-term surveys", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 31, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 32, "course_code": "PHYS 122L", "course_name": "PHYS122L - Waves, Electricity and Magnetism Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 2 - Circuits", "Experiment 5 - Magnetic Fields of a Coil", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 34, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 2, "major_name": "Science (Bachelor of Science - Three-Year General)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 0, "course_code": "BIOL 110", "course_name": "BIOL110 - Biodiversity, Biomes, and Evolution (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["Notice of Recording", "Labs begin the week of **Sept. 9**", "(Any issues in laboratory should contact Dr. Wolff)", "Monitor LEARN for important information", "A survey of organisms that inhabit a range of aquatic and terrestrial ecosystems (e.g., coral reefs, lakes, forests).", "Evolutionary and ecological frameworks will be used to explore how organisms diversify and are considered distinct species.", "The laboratory for this course is integrated with the lecture (unlike some of your other first year courses) - you will need to be sure to read the lab exercises before attending, and come prepared for our outdoor labs where appropriate shoes and clothing are necessary for the weather.", "I teach courses in ecology, evolution and genetics.", "I have been teaching evolution and ecology at the University of Waterloo for 7 years, and I hope to share with students my enthusiasm for phylogenetics.", "List themes and characteristics that differentiate the major groups of eukaryotes.", "Identify specific animals that facilitate and/or endanger human society.", "Construct and evaluate phylogenetic trees using parsimony", "Introduction", "Phylogeny and the modern view of biological relatedness", "Ecosystems and Resource Flux", "**Oct. 28  Midterm**", "Concepts in Diversity", "Activities will include using microscopes and drawing what you see, dissections of preserved animals, and collecting benthic invertebrates from the local stream and identifying them using pictoral keys.", "Note: You can also choose to do neither and forego the bonus mark altogether, as this is voluntary.", "Participation in Research Study", "Reminder, as participation in this study is voluntary, and it is a bonus mark, students may also decide to not do either activity and forego the bonus mark altogether.", "Notice of Recording", "In the case of an unwritten final exam, your course mark will be entered as DNW (32% for calculation of overall average)."]}, {"course_id": 1, "course_code": "BIOL 130", "course_name": "BIOL130 - Introductory Cell Biology (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["S. Ruffell", "An introduction to the concepts of cell biology with emphasis on (1) the structural organization of the cell and (2) the function of critical molecular processes that are characteristic of living organisms.", "Explain the fundamental elements of cells, the chemistry of life, and the major classes of biological macromolecules.", "Describe metabolism, the role of enzymes in chemical reactions, and how cells can capture, and utilize, energy.", "Explain how cells respond to signals and form cellular communities.", "Module 1 - Introduction to Cell Biology & The Cell Theory", "Module 2 - Molecules of Life", "2 Module 3 - Cells and Membranes  In-class case study", "3 Module 4 - Nucleic Acids & Information Flow", "4 Module 5 - Protein Structure, Function & Synthesis  In-class case study", "6 Module 7 - Cellular Respiration In-class case study", "In-class case study", "9 Module 9 - Cell Signalling", "10 Module 10 - Cell & Tissue Form", "and In-class case study", "11 Module 11 - DNA Replication & Cell Division Case study due", "12 Module 11 - DNA Replication & Cell Division  Term Test 1", "Official Grades and Course Access", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each module for the achieve assignments and term tests.", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines", "Library for research-based assignments"]}, {"course_id": 2, "course_code": "BIOL 150", "course_name": "BIOL150 - Organismal and Evolutionary Ecology (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["Organismal and Evolutionary Ecology Fall 2023", "11:30AM - 12:20PM RCH 101", "Learn Discussion Board", "Email and Appointment Requests", "Coverage includes hypothesis testing and the nature of scientific inquiry, basic population genetics, physiological ecology, life histories, dispersal, basic population and community ecology, macroevolution, systematics and classification, as well as functional morphology.", "The theory of evolution unites the whole of biology and all living organisms into a coherent body of knowledge, allowing comparisons across all forms of life.", "Ecology describes how organisms interact with their environment and each other to create interdependent systems from microscopic to global scales.", "These disciplines are fundamentally tied together: evolution is the primary mechanism by which species adapt to their environment; ecological interactions and environmental variability drive natural selection.", "You will also carry out simulated lab assignments to test the principles of evolution, design ecological experiments to test alternate hypotheses about the conservation of species and manipulate demographic parameters to test their influence on population growth.", "Understand the principles of scientific methodology", "Define ecological and evolutionary terms, such as the niche, adaptation, and altruism", "Illustrate these mechanisms in the context of course examples", "Explain how ecological interactions and evolution are interconnected", "Sign code of conduct and upload to LEARN.", "2) Sept 8 Evolution for Ecology Section 1: Evolution and Ecology are Intertwined", "4) Sept 13 Evolution for Ecology", "5) Sept 15 Evolution for Ecology Section 3: Genetics and Evolution", "6) Sept 18 Evolution for Ecology Section 4: Managing the Evolution of Resistance", "9) Sep 25 Physiological Ecology Section 1: Trade-offs and Species Distributions", "15) Oct 9-13 Holiday – No classes Understanding Experimental Design Simulation due by Oct 16, 11:59 pm", "16) Oct 16 Empiricism in Ecology Understanding Experimental Design Simulation due by 11:59 pm (best 2/3 for 10%)", "It is important that you review the information below before you subscribe to the SimUText for Organismal Ecology and Evolution - Chapters at University of Waterloo.", "SimUText Application Installers", "SimUText Application Installers", "At the end of every unit, you will work individually to develop a concept map using Cmap Cloud to visually display the relationships among what you consider the key concepts in the unit.", "These should represent your personal comprehension of how the concepts relate to each other, and no two should be identical.", "Also, class will entail a lot of discussion that won’t be represented in PPT slides.", "The simulations include one on Evolution in Ecology, one on Experimental Design in Ecology and one on Population Growth.", "The learning outcome for the unit tests is to demonstrate your recall and comprehension of the material covered in the units and to incentivize keeping up with the readings and attending lectures and reviewing for the final exam.", "The learning outcome is to demonstrate recall, synthesis and integration of material learned during the course.", "The final exam will consist of multiple-choice, T/F, solve the equation type of questions and integration questions that are designed to test your basic and deeper understanding of the course concepts.", "Important note regarding tests and exams", "Unit tests will be completed for the first 4 units of the course.", "Ensure you have a reliable internet connection and functional computer to complete them – technical challenges encountered during remote completion are not an excuse for missed tests.", "I will have a limited number of printed back-ups for students in class who experience technical difficulties.", "You will need to have a reliable internet connection and functional computer to complete the exams.", "Emails can be received 24 hours per day.", "If you miss a make-up exam for any reason, you will be given a DNW, and must petition the Associate Dean of Science if you feel you missed it for a valid reason.", "At the discretion of the instructor, you may be permitted to write a make-up exam.", "The timing will be conveyed to you via e-mail if you are eligible for a make-up.", "If you follow these steps,", "I will consider granting an extension", "Students are responsible for their own behavior and should be mindful of the impact that their actions have on the wellbeing of others.", "Act in a respectful and open manner when listening to the views and ideas of others.", "Participate fully in the discussion boards: make sure your answers are to the best of your ability and that you respond to others’ posts.", "Signature"]}, {"course_id": 3, "course_code": "BIOL 165", "course_name": "BIOL165 - Diversity of Life (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["S. Ruffell", "An introduction to the diversity of living organisms from simple prokaryotes to complex eukaryotes.", "The characteristics that define these phyla", "Be able to compare and contrast life histories", "Introduction and Cell Biology", "Phylogeny and Classification", "Bacteria and Archaea", "Protists", "Library for research-based assignments"]}, {"course_id": 4, "course_code": "BIOL 201", "course_name": "BIOL201 - Human Anatomy (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["09:30AM - 10:20AM STC 1012", "Email messages not adhering to these conditions will not be read and will be deleted.", "This course takes a systems approach to study the structure of the human body and its relationship to function.", "Structural features of organ systems will be explored through lectures and laboratory exercises.", "Note that these recordings are NOT guaranteed nor are these recordings meant to be a replacement for in-person learning.", "Develop a vocabulary to effectively communicate anatomical concepts", "Recognize and identify the anatomical structures of all of the organ systems of the human body", "Demonstrate an understanding of anatomical structures through laboratory sessions", "Week 1 Introduction to Human Anatomy & the Integumentary System", "Week 3 Bones and the Skeleton - part 2 & Skeletal Muscle", "Week 8 Endocrine System & Circulatory System - part 1", "Week 10 Respiratory System & Digestive System", "Official Grades and Course Access", "This will be followed by an exploration into the appendages of the skin.", "Initially basic structure, location, and classification of bones will be explored.", "This will be followed by an examination of select major skeletal muscles of the body.", "The basic divisions of the nervous system will be introduced in the unit.", "A gross overview of the nervous system anatomy will precede further discussion on the anatomy of the central nervous system (CNS) and peripheral nervous system (PNS).", "Unit 6 – Endocrine System (Chapter 17)", "This will be followed by an examination of the major endocrine organs and other structures associated with the endocrine system of the body.", "The circulatory system will be discussed in this unit.", "The anatomy of the respiratory system will be examined in this unit.", "This will be followed by the anatomy of the upper and lower respiratory components.", "The anatomy of the digestive system will first be examined in this unit.", "This will be followed by the anatomy of the urinary system will be examined including the kidneys followed by the ureters and the urinary bladder.", "Expectations for Change"]}, {"course_id": 5, "course_code": "BIOL 211", "course_name": "BIOL211 - Introductory Vertebrate Zoology (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["10:30AM - 11:20AM M3 1006", "An introduction to the structure, evolution, and development of vertebrate organ systems, explored through lectures and laboratory exercises.", "Understand the diversity of vertebrates that exist in the world", "Know some of the anatomy, physiology, reproductive strategies, behaviour and ecology of vertebrates", "Be familiar with the basic techniques of dissection through laboratory sessions", "Introduction to vertebrate zoology", "Bony fishes", "Adaptations of synapsids & sauropsids", "Turtles", "Tuatara, lizards & snakes", "Bird origins & adaptations", "Lab Manual Introduction to Vertebrate Zoology Available at bookstore Yes 28", "Call number UWD 1528"]}, {"course_id": 6, "course_code": "BIOL 220", "course_name": "BIOL220 - Introduction to Plant Structure and Function (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["Introduction to Plant Structure and Function Winter 2025", "11:30AM - 12:20PM RCH 101", "S. Schoor", "I will make my best effort to respond to emails within 24 hrs.", "An introduction to plant diversity, and the anatomy and physiology of vascular plants.", "Understand the importance of the relationship between plants and humans in the environment and appreciate the species richness and diversity of plants", "Recognize and identify various cell types and how they account for the structure and function of tissues and organs", "Plant Evolution: Structure and Reproduction", "Focus will be applied to the adaptive strategies employed by algae to move from water to land, the development of complex tissues and organs and the role of reproduction strategies in plant success.", "Cellular composition of plant tissues and what role they play in their function will be studied; with particular interest in the relationship between vascular tissue and water transport.", "Additionally, students will study how hormones and growth regulators regulate plant development, tropic movement and plant response to biotic and abiotic stressors, as well as learn of their many uses in agriculture.", "Week 1 Jan 6 (1) Introduction & The Plant Cell (Ch 1,3) No labs this week", "Laboratory Mark Distribution", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline)."]}, {"course_id": 7, "course_code": "BIOL 239", "course_name": "BIOL239 - Genetics (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["11:30AM - 12:20PM", "10:30AM - 11:20AM STC 1012", "You can!", "Chromosomal mechanisms in mitosis and meiosis.", "Natural selection and the evolution of genetic systems.", "Describe the fundamentals of gene structure, function and transmission in prokaryotic and eukaryotic cells and organisms.", "Describe the various ways mutations can arise and how mutations may affect gene expression and phenotypic outcomes.", "Describe recombinant DNA technology in bacteria and its role in biotechnology.", "Effectively work with others, discussing, evaluating, and communicating genetics concepts and synthesizing ideas in a group.", "Readings", "textbook 1.1-1.2", "Mendelian genetics and probability", "Modification of Mendelian ratios", "textbook 3.2-3.3, 4.2-4.4, 15.1", "Mitosis, meiosis, and chromosome numbers", "DNA and the genetic code", "textbook 9.2-9.3", "T4: Mitosis and meiosis", "DNA cloning", "T5: Testing genetic ratios", "Cancer genetics", "T9: Population genetics", "Exam period", "- write the final exam and achieve a grade of at least 50% on the cumulative test and exam section", "Online learning activities: These activities are designed to test your knowledge of several important concepts explained by the lecture presentations in this course, and should be completed after the portion of the course when they are covered in lecture.", "They are all due toward the end of the term but can be completed as many times as you like to help you work on these concepts.", "Read the instructions carefully before attempting these as a completion quiz (in the quiz section) must also be completed to obtain credit.", "In this case, the weight of the missed submission will be transferred to the final exam.", "The dates affected and degree of incapacitation will be used to determine follow-up action."]}, {"course_id": 8, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}, {"course_id": 9, "course_code": "BIOL 241", "course_name": "BIOL241 - Introduction to Applied Microbiology (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["Notice of Recording", "Introduction to Applied Microbiology Winter 2025", "RCH 101", "Course Lecturer: Dr. Kesen Ma; kma@uwaterloo.ca; office hours & virtual meetings (Zoom) by appointment only", "Laboratory Instructor: Dr. Cheryl Duxbury; cduxbury@uwaterloo.ca; office hours & virtual meetings (Microsoft Teams) by appointment only", "Introduction to microbial ecology, environmental microbiology, food microbiology, and medical microbiology explored through lectures and laboratory exercises.", "Topics in environmental microbiology include biogeochemical cycling and biological treatment of wastes and pollutants.", "Topics in medical microbiology include concepts of immunology and host-pathogen relationships.", "microbial ecology", "bacteria-bacteriophage interactions", "biodegradation and bioremediation • sewage treatment", "industrial microbiology", "host-parasite relationships - factors in microbial pathogenicity, innate barriers in the host", "immunology - innate, adaptive", "immunization; immune response diseases", "Extend Biol 240 and cover topics such as the diversity of microbial metabolism and habitat, the importance of microbes in nutrient cycling, biological treatment of pollution, use of microorganisms for the production of food, pharmaceuticals, and the role of microbes in human disease.", "Know the importance of microbes to life as we know it, and the applications of useful microbial characteristics.", "Enhance understanding of the roles that microbes play in the natural world .", "Learn more skills in aseptic laboratory techniques and know how to conduct some classical microbial testing of food, water, and soil.", "Lecture topics and relevant textbook chapters", "2021 & 2017.", "Microbial Ecology", "2. Bacteria-Bacteriophage Interactions", "Terrestrial & Aquatic Environments", "5. Biodegradation & Bioremediation", "Food & Industrial Microbiology", "(spoilage & preservation", "food & industrial processes)", "Immunology", "(innate, adaptive immunity,immunization & immune response diseases)", "Infectious Disease", "*note: this is the same textbook as used in BIOL 240 & BIOL 240L. The new 3rd edition of the book can be accessed via a subscription through Wiley ($57 for 150-day subscription, $134.95 for a lifetime subscription:", "This manual cannot be ordered online and must be purchased in person prior to your first lab.", "Both exams will be in a multiple-choice format (e.g., multiple choice, true/false, matching questions, fill in the gap).", "Notice of Recording", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Allowed", "Allowing under certain conditions", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 10, "course_code": "BIOL 251", "course_name": "BIOL251 - Fundamentals of Ecology (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["02:30PM - 05:20PM B2 151", "02:30PM - 05:20PM B2 151", "Mike Allen", "Email: mike.allen@uwaterloo.ca", "Email: brwolff@uwaterloo.ca", "Claire Schon", "Email: d4andradepereira@uwaterloo.ca", "This course provides students with an introduction to the breadth of the ecology discipline, including laboratory and field components.", "It covers hypothesis testing and the nature of scientific inquiry, organismal, population, community, and ecosystem levels of ecology.", "Lab 2: Prepare test populations of bean beetles to use in a population estimation exercise; set up a capture/mark/recapture experiment using the Lincoln-Peterson Method; examine the results of the experiment using basic statistics to determine the reliability of the Lincoln-Peterson Method under these conditions; prepare a short report conveying the results, along with comments on the experimental design etc.", "Lab 4: Understand the life history of goldenrod, gall flies and their predators; be able to dissect galls and identify larvae using a dichotomous key; collect gall/larval data and hypothesize about any interactions between the species involved.", "12 Nov 18-22 Eutrophication Analysis"]}, {"course_id": 11, "course_code": "BIOL 266", "course_name": "BIOL266 - Introduction to Computational Biology (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["Introduction to Computational Biology Fall 2022", "Instructor: Prof. Andrew Doxey", "This course provides an introduction to computational methods in biology, including exploration of bioinformatics databases and tools, analysis of protein and DNA sequences, and computer-aided modelling of biological systems.", "Explore online bioinformatic databases to interact with DNA, protein, gene expression, structural, and systems biology data", "Compute optimal alignments between pairs of sequences using dynamic programming algorithms", "Perform multiple sequence alignments", "Perform 3D structural modelling and visualization of proteins", "Examine and analyze gene expression data from microarrays and RNA-seq experiments", "Understand the fundamentals of systems biology including network analysis and visualization of interactomes", "Data Type", "Introduction   None", "Molecular evolution I Trees Lab #4 - Phylogenetics I 2.2%", "Molecular evolution II Trees MIDTERM 30%", "Molecular evolution III Trees Lab #5 - Phylogenetics II 2.2%", "Structural modelling and biophysics Structures Lab #6 - Structural Modeling 2.2%", "Networks and Systems Biology Networks Lab #9 - Exploring the STRING database 2.2%"]}, {"course_id": 12, "course_code": "BIOL 273", "course_name": "BIOL273 - Principles of Human Physiology 1 (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["Notice of Recording", "10:00AM - 11:20AM M3 1006", "M. Bording-Jorgensen", "Dr. Vivian Dayeh - Tuesdays 11:30 am -12:30pm in B1-277.", "The physiology of major organ systems of the human body.", "Topics include neurophysiology and peripheral nervous system, muscle, the cardiovascular system, the components of blood, respiratory system, and immune system.", "The combination of BIOL273 and BIOL373 covers all of the major topics of human physiology.", "Identify the components/structures of the following organ systems: nervous, muscular, cardiovascular, respiratory, and immune.", "Describe how these five organ systems are organized in the human body.", "Explain the function of each of these five organ systems.", "Demonstrate the integration of these five organ systems in maintaining homeostasis.", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Official Grades and Course Access", "Corresponding Silverthorn textbook chapters in parentheses for each unit.", "This unit serves as an introduction to the study of the function of the five organ systems examined in this course (nervous, muscular, cardiovascular, respiratory, and immune).", "Unit 1 will introduce how the organ systems work together to maintain homeostasis within the body.", "The organization of the nervous system will be explored in this unit.", "The types of cells found in the central and peripheral nervous system serve as a starting point to discuss their function within the nervous system.", "Initially gross structure of skeletal muscle including the structure of a muscle fibre and myofibrils will be examined.", "An exploration into the muscle contraction mechanism via excitation-contraction coupling will be examined to explain how muscles work.", "This unit will start with an introduction into the heart and components of the cardiovascular system, which will be followed by cardiac muscle contraction mechanism.", "In this unit we will examine the structure and function of the respiratory system, incorporating gas laws and ventilation.", "Pulmonary function through lung compliance and elastance as well as the control of ventilation will be examined.", "This unit will start with the general function of immune system and introduction to the types of pathogens that infect the body.", "The anatomy of the immune system will be discussed returning to the role of haematopoiesis.", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each unit for the assignments and term tests.", "Required for the Mastering A&P Online Assignments and Dynamic Study Modules.", "Course website Waterloo Learn https://learn.uwaterloo.ca - includes general course information, language of physiology online assignment, review sheets for each unit, and links to the Mastering A&P Online Assignments.", "Emails can be received 24 hours per day.", "Students should carefully consider the wisdom of missing a test or assignment.", "Mastering A&P assignments handed in late will receive a deduction of 5%/day for the first five late days after which a grade of zero (0) will be recorded.", "Notice of Recording", "Don’t waste your time with these requests!", "Expectations for Change", "This course includes the independent development and practice of specific skills, such as multiple choice question creation.", "Library for research-based assignments", "Disability-related Policies"]}, {"course_id": 13, "course_code": "CHEM 120", "course_name": "CHEM120 - General Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["General Chemistry 1 Winter 2025", "RCH 101", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "The second part of this course is concerned with explaining periodicity and trends in chemical reactivity in terms of the electronic structure of atoms and molecules.", "Topics covered in this part of the course include the quantum theory of the hydrogen atom; electron configurations in multi-electron atoms; ionic and covalent bonding; Lewis structures, valence shell electron repulsion theory and molecular geometry; quantum mechanical bonding theories, including valence bond theory and molecular orbital theory.", "Additional topics may include an introduction to electron-transfer reactions, including the assignment of oxidation states and the balancing of oxidation-reduction reactions.", "assess the greenness of a chemical reaction using Atom Economy and E-Factor metrics.", "describe the electronic structure of atoms in terms of quantum theory using atomic orbitals and quantum numbers.", "justify the organization of the periodic table and predict trends in the properties of the elements.", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and explain molecular shape and stability in terms of electron count.", "describe the interactions of molecules in solids, liquids, and gases to compare physical and reactive properties.", "Course Structure and Continuity Plans", "No extensions will be granted for Participation Challenges, but each student can drop one participation challenge from their overall grade.", "Printed spiral bound copies of the course notes can be purchased online from the UW bookstore https://wstore.uwaterloo.ca/", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare pandemic-related illnesses on Quest (Information at this link)", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 14, "course_code": "CHEM 120L", "course_name": "CHEM120L - General Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["General Chemistry Laboratory 1 Fall 2024", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Be sure to record their name and contact information in your lab manual.", "Skillfully perform basic procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "1,3,5,7,9,11", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Sept 19 - 24", "1,3,5,7,9,11", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "1,3,5,7,9,11", "- studying cis and trans isomers", "Oct 24-29", "1,3,5,7,9,11", "Titration as an Analysis Tool", "- identify an unknown solid acid", "1,3,5,7,9,11", "Introduction to Chromatography", "- quantify a cation using ion exchange", "1,3,5,7,9,11", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 15, "course_code": "CHEM 123", "course_name": "CHEM123 - General Chemistry 2 (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["General Chemistry 2 Winter 2025", "09:30AM - 10:20AM STC 1012", "Introduction to chemical equilibria.", "Describe the energy and entropy changes that accompany physical and chemical changes.", "Calculate the equilibrium constant for a reaction using the standard thermodynamic properties of reactants and products.", "Predict the direction of spontaneous change for a given set of initial conditions for a variety of chemical systems.", "Apply equilibrium principles to a variety of chemical reaction types including gas-phase reactions, acid-base reactions, precipitation reactions, complexation reactions and redox reactions.", "Analyze oxidation-reduction reactions and identify species being oxidized and reduced.", "Explain the basic construction of, uses of, and the differences between galvanic and electrolytic cells.", "CHEM 120 and CHEM 123 comprise a full-year course in introductory chemistry.", "Course Structure and Continuity Plans", "Chemistry Study Hall:  Starting the 2nd week of classes, there will be a first-year study hall on Tuesdays and Thursdays at 5:30 pm - 6:50 pm in STC 1012.", "You can attend as many Study Hall Sessions as you would like - grab your friends and connect with your TAs!", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 16, "course_code": "CHEM 123L", "course_name": "CHEM123L - General Chemistry Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["General Chemistry Laboratory 2 Winter 2025", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- a real life analysis", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 17, "course_code": "EARTH 121", "course_name": "EARTH121 - Introductory Earth Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["Introductory Earth Sciences Fall 2024", "Students will learn to think like a geoscientist by adopting four ways of thinking that take into account a systems approach, a variety of spatial and temporal scales, and field thinking.", "Recognize the dynamic nature of Earth through an examination of the interactive components of the Rock Cycle.", "Extrapolate meaning from everyday geologic material and predict occurrence and origin.", "Week 1: Introduction and Four Ways of Thinking 1a and 1b Discussion: Introduce Yourself", "Week 2: Introduction to Rocks 2a Field Notes Journal 2: Are minerals important?", "Week 3: Introduction to the Rock Cycle 2b Field Notes Journal 3: What do you see in the video?", "Week 4: Introduction to the Rock Classification 2c Field Notes Journal 4: Is this depiction of the Rock Cycle complete and accurate?", "Week 5: Geologic Time and Geologic Time Scale 3a and 3b Field Notes Journal 5: How do I create a simplified Geologic Time Scale?", "Please note emails can be received 24 hours per day", "Short-term Absence", "Covid-19-related Absence", "Intellectual property includes items such as:"]}, {"course_id": 18, "course_code": "EARTH 121L", "course_name": "EARTH121L - Introductory Earth Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["Introductory Earth Sciences Laboratory Fall 2024", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Email: keith.delaney@uwaterloo.ca", "Sahar Soltani - sahar.soltani@uwaterloo.ca / LABS 001 & 003", "By far, the majority of people qualified as geologists spend their time using their knowledge working 'in the field', or in exploration, putting principles learned in theory and in the laboratory, into practice.", "Identify common mineral and rocks based on their identification properties", "Understand the rock cycle and how minerals and rocks are formed", "Understand the theory of plate tectonics and how it has shaped the Earth's surface over time", "Qualitatively and Quantitatively describe earthquakes and some of their processes", "Read and interpret data from both topographic and geologic maps", "Understand the immense history and geologic record of our planet", "Understand the factors influencing climate change and quantify how the planet is changing", "Will assess Mineral and Rock Identification knowledge with real samples.", "Lab 8 Earth Structures", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "Situation where VIFs are not Appropriate"]}, {"course_id": 19, "course_code": "EARTH 122", "course_name": "EARTH122 - Introductory Environmental Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["Introductory Environmental Sciences Winter 2025", "08:30AM - 09:50AM STC 1012", "I hold a PhD in Earth & Environmental Sciences from the University of Waterloo (2014) and an HBSc in Earth & Environmental Sciences from McMaster University (2006).", "You might notice I'm looking pretty pregnant!", "I'm conveniently due on April 27 BUT in the unlikely even that I have a baby really early, the excellent Dr. Keith Delaney (who has taught this class for many years) will step in at the end.", "Discussions", "Questions of a personal nature", "Office: EIT 2051D (very back of Earth & Environmental Sciences main office)", "Email: msrosamo@uwaterloo.ca", "Grad TA contact info can be found in the EARTH 122L syllabus.", "Course topics include sustainable development and the availability and use of natural resources, principles of ecology and environmental science, biogeochemical cycles, climate and climate change, soils and food supply, energy systems, surface water and groundwater, waste generation and management, pollution, and catastrophic natural processes.", "Describe common global environmental issues and the role of environmental science in identifying, understanding, and solving these issues.", "Interpret and manipulate simple box models of environmental systems", "Interpret scientific diagrams and graphs pertaining to environmental science", "1 January 06 - 10 Intro to Environmental Science & Matter, Energy and Physical Environment Chps 1 & 2", "2 January 13 - 17 Earth Systems/Ecosystems & Evolution, Biodiversity, Population Ecology Chps 3 & 4", "3 January 20 - 24 Species Interactions/Community Ecology & Human Population Chps 5 & 6", "Soils & Soil Resources*", "8 February 24 - 28 Freshwater Systems/Water Resources & Marine, Coastal Systems, Fisheries Chps 11 & 12 Quiz 6 - Chapters 11 & 12 Content Mon. Mar 3  5:00PM 3", "10 March 10 - 14 Global Climate Change & Fossil Fuels: Energy Use/Impacts Chps 14 & 15", "Energy Alternatives & Mineral Resources & Mining", "Quiz 8 - Chapters 15 & 16 & 17 Content*", "12 March 24 - 28 Managing our Waste & Environmental Health Hazards Chps 18 & 19 Quiz 9 - Chapters 18 & 19 Content Mon. Mar 31 5:00PM 3", "A Look at Environmental Science and Natural Hazards & Final Exam Study Guide / Discussion", "following these guidelines: https://uwaterloo.ca/science-undergraduate-office/academic-policies-and-procedures/accommodation-illness-or-other-extenuating-circumstances."]}, {"course_id": 20, "course_code": "EARTH 122L", "course_name": "EARTH122L - Introductory Environmental Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["Notice of Recording", "Introductory Environmental Sciences Laboratory Winter 2025", "EARTH 122L", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Sana Ahmad has a BSc degree in Honours Co-op Environmental Science with a Geoscience Specialization from the University of Waterloo.", "Discussions", "Questions of a personal nature", "Office: EIT 2046 (within the Earth & Environmental Sciences main office)", "Email: s76ahmad@uwaterloo.ca", "Please put EARTH 122L in your email subject line so I don't miss it!", "Please do not send them personal emails!", "View requirements for EARTH 122L", "Use GPS devices and GIS software to locate points of interest and create a map", "ALL LABS ARE HELD IN ROOM: EIT 1013 (ground floor of EIT  - same building as Earth Sciences Museum)", "8 February 24 - 28 Coastal Processes and Problems: Loving Our Coasts to Death?", "10 March 10 - 14 On-Campus Water Sampling and GPS Data Collection Field Sampling and Data Collection Lab around UW Campus", "13 March 31 - April 03 Landscape Geology: Glaciers and Deserts & Climate Change: Pleistocene Records, Milankovitch Cycles Lab 8: Landscape Geology and Climate Change End of Lab 7%", "Note used copies are also fine!", "The format of the final exam will be run digitally through the LEARN Quiz system in the last week of the course, not during the formal exam period.", "Notice of Recording", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "These can be completed digitally now!", "This official verification is necessary before any action can be taken and can be downloaded from the Health Services website.", "Situation where VIFs are not Appropriate", "Example citations:", "\"References"]}, {"course_id": 21, "course_code": "PHYS 111", "course_name": "PHYS111 - Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["An introduction to physics for students intending to concentrate their further studies in biology, dentistry, medicine and paramedicine; includes particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.", "The main physics principles and laws covered in PHYS 111 include: “Particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.”", "PHYS 111 focuses on basic physics principles and laws, on conceptual understanding and problem-solving skills, and an appreciation for the power of physics in explaining how nature works, in the contexts of both the physical and life sciences.", "Physics Principles and Laws: By the end of the course, students will be able to construct scientifically sound explanations of a variety of basic physical phenomena by applying basic physics principles/laws.", "define linear momentum, and calculate and compare momenta of various real-life objects;", "define and calculate impulse, and establish the conditions for conservation of linear momentum; and", "apply the laws of conservation of momentum and energy to collisions.", "Problem-Solving Skills and Strategies: By the end of the course, students will be able to creatively apply a variety of structured problem-solving strategies:", "interpret, visualize and convert the problem into a physical model (e.g., draw a free body diagram);", "evaluate the result — does it make sense?", "These problem-solving skills are useful in the students’ own disciplines and beyond.", "More detailed information about the course elements which contribute to the final grade will be given in the learn sight and in future outline updates", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 22, "course_code": "PHYS 111L", "course_name": "PHYS111L - Physics 1 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "Derin Erisoglu-Akyildiz", "Saba Karimi", "Do Yun Park", "jbschrie@uwaterloo.ca", "s38karim@uwaterloo.ca", "first for minor issues", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "12 & 13", "Complete end-of-term surveys before Dec. 3", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 23, "course_code": "PHYS 112", "course_name": "PHYS112 - Physics 2 (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["Notice of Recording", "10:30AM - 11:20AM DC 1350", "S. Idziak", "08:30AM - 09:20AM", "Email: idziak@uwaterloo.ca", "Email: james.forrest@uwaterloo.ca", "A continuation of PHYS111; includes simple harmonic motion, electrostatic force and potential, electric current and power, DC circuits, magnetic field and induction, wave motion, sound, and optics.", "To develop the ability to solve problems in areas related to oscillations and waves, electricity and magnetism, and optics", "Understand physical concepts associated with oscillations, waves, sound, electricity and magnetism, and optics", "Apply concepts of force and energy and recognize when acceleration is not constant", "Solve simple physical systems using physical concepts", "Draw relevant sketches from information given in word problems", "Develop physically relevant equations from information given in word problems", "Convert complex problems into a series of sub-problems and solve", "Topic Textbook Chapters                                                                            Number of lectures", "Electric Forces & Fields (Serway) Chapter 15: 1-5", "Electric Potential & Energy (Serway) Chapter 16", "Current and Resistance (Serway) Chapter 17: 1-6", "Magnetic Flux & Induction   1", "College Physics: A Strategic Approach by Jones, Knight, and Field This was suggested for 111.", "I do not find that these books are great but they are available for no cost.", "Please help to create a welcoming and inclusive environment.", "An exam-like problem will be posted each week on LEARN.", "2 points will be given for each clicker response with an additional 1 point for each correct response.", "What happens if I join the course late:", "Missed a regular assignment:", "Emails can be received 24 hours per day.", "Remember that falsely claiming you are ill can result in academic polices per Policy 71.", "Email communications:", "Notice of Recording"]}, {"course_id": 24, "course_code": "PHYS 112L", "course_name": "PHYS112L - Physics 2 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Sean Dougherty", "Aney Kapadia", "Kayra Erisoglu-Akyildiz", "jbschrie@uwaterloo.ca", "s2doughe@uwaterloo.ca", "Course Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"'", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 3 - Circuits", "Experiment 4 - Circuits", "Experiment 5 - Circuits", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 25, "course_code": "CS 100", "course_name": "CS100 - Introduction to Computing Through Applications (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["Introduction to Computing Through Applications Winter 2025", "Friday -", "Friday", "10:30AM - 12:20PM MC 3005", "10:30AM - 12:20PM MC 3027", "Dave Tompkins", "E-mail: dtompkins@uwaterloo.ca", "E-mail: cs100@uwaterloo.ca", "Introduction to the Internet, World Wide Web, HTML, and XML.", "Algorithms underlying the functional components of web search engines and their influence on data access.", "CS 100: Introduction to Digital Information, Computers, the Internet and Applications", "Explain the emerging computing technologies introduced in the course.", "Digital Information", "Computer + Network organization", "Dynamic web pages and web applications", "Privacy and security", "Emerging Topics", "Distributed networking and \"big data\"", "Artificial intelligence", "ChatGPT and large language models", "Social media and monetization", "A1 released", "Laptops, Devices and Software", "Library for research-based assignments"]}, {"course_id": 26, "course_code": "MATH 103", "course_name": "MATH103 - Introductory Algebra for Arts and Social Science (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["Notice of Recording", "Introductory Algebra for Arts and Social Science Winter 2025", "Email: jen.nelson@uwaterloo.ca", "Topics will be chosen from linear equations, systems of linear equations, linear inequalities, functions, set theory, permutations and combinations, binomial theorem, probability theory.", "The course begins with a review of operations with real numbers and fundamental algebra skills.", "The solutions of polynomial equations, both linear and quadratic, in one and two variables and their graphical representation are studied.", "An extension is made to linear systems with their solutions being expressed both algebraically and graphically.", "To solve linear systems, matrices and the associated row reduction strategies are used.", "The relationship between exponential functions and logarithmic functions is examined.", "The basic properties of logarithms are introduced and used to solve logarithmic and exponential equations.", "Various applications involving exponential growth and decay and logarithmic scales are presented.", "Concepts in set theory and counting theory support the study of probability theory.", "Perform operations with real numbers and algebraic expressions.", "Solve linear equations and inequalities in one variable, including those involving absolute value, and represent the solutions algebraically and graphically.", "Solve a system of linear equations using matrix operations, introducing a free variable, or parameter as appropriate.", "Solve quadratic equations in one variable.", "Recognize that the solutions to a quadratic equation in two variables lie on a curve known as a parabola and analyze the properties of a parabola.", "Describe the relationship between an exponential function and a logarithmic function.", "Use the properties of logarithms to solve logarithmic and exponential equations, and to solve problems involving exponential growth and decay, and logarithmic scales.", "Use the appropriate symbols and language in set theory to perform set operations, represent sets and subsets using Venn diagrams, and apply the counting principles for sets in real-life situations.", "1.1 Real Numbers", "1.2 Order of Operations", "1.3 Fundamental Algebraic Skills", "Unit 2: Equations and Inequalities", "2.1 Equations in One Variable", "Unit 2: Equations and Inequalities Continued", "2.3 Multivariate Equations", "Unit 3: Systems of Linear Equations and Matrices", "3.1 Systems of Linear Equations", "3.2 Introduction to Matrices and Elementary Row Operations", "Unit 3: Systems of Linear Equations and Matrices Continued", "3.3 Applications", "3.4 Systems With No Solutions and Systems With an Infinite Number of Solutions", "Unit 4: Quadratic Equations and Functions", "4.1 Quadratic Equations in One Variable", "4.2 Quadratic Equations in Two Variables and the Parabola", "4.3 Quadratic Functions", "4.4 Applications", "Unit 5: Exponential and Logarithmic Functions", "5.1 Exponential Functions and Equations", "5.2 Exponential Functions and Logarithmic Functions", "Unit 5: Exponential and Logarithmic Functions Continued", "5.4 Solving Logarithmic and Exponential Equations", "5.5 Applications", "6.1 Introduction to Sets", "6.2 Set Operations", "6.3 Counting Principles for Sets", "7.2 Combinations of Simple Events — Compound Events", "7.4 An Introduction to Random Variables and Probability Functions", "8.1 Counting Principles and Probability", "8.3 Combinations — Unordered Selections", "8.4 Binomial Models", "A non-programmable, non-graphing scientific calculator.", "Assignments may be screened by a human for evidence of plagiarism or the inappropriate use of resources.", "Notice of Recording", "instructor in advance in order to facilitate class participation.)"]}, {"course_id": 27, "course_code": "SCI 250", "course_name": "SCI250 - Environmental Geology (0.50)", "term_name": "Required Courses", "program_name": "Science", "program_id": 144, "major_id": 3, "major_name": "Science (Joint Honours with Arts Major)", "topics": ["Environmental Geology Winter 2024", "Include Earth 221 in the subject line and your full name and student ID# in the text.", "An introduction to geological concepts; the influence of geological factors on the natural environment; Earth processes and natural hazards; Earth resources, including water, energy and mineral resources; waste disposal and pollution; global climatic and environmental change.", "Environmental Geology refers to how geologic processes interact with and influence human activities and vice versa.", "The goal is to introduce you to basic geologic concepts in order to better understand your natural physical surroundings, such as earthquakes, volcanoes, surface water and glacial processes.", "You will also learn about resource availability such as groundwater and fossil fuels and how we impact the environment via waste disposal and other forms of pollution.", "As the population of the Earth grows, there is increased demand for limited supplies of natural resources, a growing release of pollutants, and increased development in geologically unstable parts of the world.", "These issues result in a variety of hazards and potential problems that societies need to understand and deal with in ways that are beneficial for the Earth and local populations.", "Explain the geologic/earth science connections to certain environmental issues", "Use geologic terminology and concepts when describing environmental issues", "Critique the use of scientific information in the public domain (e.g., media) regarding geologically-related environmental issues", "6 13-Feb Ice & Glaciers; Wind & Deserts Ch 9    15-Feb Climate Ch 10   Q5 (Ch 9,10)", "Older print versions could also be used but there may be some slight differences with the newest version, particularly for case studies or specific events.", "Exams will be a mix of multiple choice, fill in the blank, and written questions.", "Start checking for posted exam dates in the middle of February", "Extensions and other accommodations", "Extensions and other accommodations will only be considered on a case-by-case basis."]}, {"course_id": 0, "course_code": "AVIA 100", "course_name": "AVIA100 - Introduction to Aviation (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Introduction to Aviation Fall 2024", "S. Kearns", "03:30PM - 04:20PM", "S. Kearns", "10:30AM - 11:20AM EV1 350", "S. Kearns", "04:30PM - 05:20PM", "S. Kearns", "10:30AM - 11:20AM EV3 4408", "S. Kearns", "Instructor: Dr. Suzanne Kearns", "Email: suzanne.kearns@uwaterloo.ca", "The nature and impact of each of these topics is explored through a combination of lecture, class discussion and activities, and student presentations.", "View requirements for AVIA 100", "• Demonstrate their understanding of key elements critical to the aviation industry in Canada and Internationally.", "• Describe a range of professional and safety issues, give examples of domestic and international regulatory and labour issues, and examine environmental concerns associated with aviation.", "October 21 Navigation", "However, the library's license limits the number of simultaneous users.", "There is no exception to this and make-up grades are not available as completing quizzes during their assigned window is an element of professionalism within the course.", "You are expected to prepare a single slide for your element of the presentation, and combine them into a single presentation file for your entire group.", "Quizzes are in multiple-choice format.", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 4, "course_code": "AVIA 310", "course_name": "AVIA310 - Human Factors in Aviation (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Human Factors in Aviation Winter 2025", "An exploration of aviation non-technical skills and their impact on aviation safety and operational performance.", "This course offers an in-depth exploration of key human factors in aviation, focusing on the interaction between human capabilities, limitations, and aviation environments.", "Emphasizing the roles of psychology, physiology, and ergonomics in pilot performance and safety, students will analyze human limitations and collaborate to address critical issues in aviation human factors.", "Explain the scope and fundamentals of human factors science and describe its relationship to aviation", "Evaluate the role of aircraft design and automation on human capabilities and limitations", "Assess human factors in training, situational awareness", "Explore strategies for managing stress, workload and fatigue", "Communicate contemporary aviation human factors insights through research and content creation", "Introduction", "-The scope of human factors science", "-Visual system", "January 20 Human Information Processing", "-Model of information processing", "-Cognition", "January 27 Design and Automation", "-Cockpit design", "-Automation and human-centered automation", "-Human body and variability", "-Design for human anthropometry", "-Work physiology and cost of work", "Please be in the classroom at 11:30am, latest.", "February 24 Managing Human Performance in Aviation", "-Health Maintenance and lifestyle", "-Fatigue HF Spotlight Project Plan Submission", "- Issues and factors involved in situational awareness", "- Situational awareness and decision making", "March 10 Stress and Social Influence", "- Stress and performance", "- Stress management", "- The influence of others on the flight deck", "- Obedience and conformity in aviation Trivia Question Submission", "March 24", "Please be in the classroom at 11:30am, latest.", "March 31 Human Factors Spotlight Presentations", "Test format may include multiple choice, fill-in-the-blanks, short answer, and/or essay questions.", "Make-up sessions will be arranged for students who miss a test for valid reasons.", "Human Factors Spotlight: This is a team* assignment.", "This assignment is to encourage you to think critically and creatively, applying your knowledge of human factors to communicate effectively in a social media format.", "The objective of teamwork in this assignment is to foster collaboration, improve organization and communication skills, and leverage diverse perspectives to create a comprehensive and impactful analysis of the chosen topic.", "You are expected to submit a summary of your chosen topic, a plan for content creation, and a description of the roles and responsibilities of each team member.", "Late submissions will incur a penalty of 1 point for each hour past the due date.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 6, "course_code": "AVIA 417", "course_name": "AVIA417 - Aviation Safety (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM RCH 105", "Office: EV1-227", "Understand the key concepts in aviation safety.", "Evaluate the physiological, psychological, and environmental factors that impact human performance in aviation safety.", "Explain the basic concepts of safety culture and its components.", "Understand the evolution and significance of Safety Management Systems (SMS) in aviation, including its core pillars.", "Explore the historical evolution and importance of Crew Resource Management (CRM) principles in aviation.", "Introduction", "-Basic concepts in aviation safety", "“Introduction to Commercial Aviation Safety.”  in Commercial Aviation Safety. 6th ed.", "Human Factors & Safety", "-Human performance & Limitations", "-Sensory Aspects", "-Factors affecting human performance", "-Basic concepts in safety culture", "-Components of positive safety culture", "Human Error & Violations", "-Components of Human Error", "-Classification of Human Error", "Measuring and Monitoring Safety", "-Brief History of CRM", "-Non-Technical Skills", "CRM Scenario Submission", "Pros and Cons: AI and Automation in Aviation", "Resource Sharing on Automation in Aviation", "-Evolution of SMS", "-Four Pillars of SMS", "Accident Investigation", "-Diversity in Aviation Safety", "-Inclusion in Aviation Safety", "Slogan Submission", "CRM in Action Presentations", "Scenario Response Submission", "CRM in Action Presentations", "There is no exception to this and make-up grades are not available as completing quizzes during their assigned window is an element of professionalism within the course.", "Late submissions will incur a penalty of 1 point for each hour past the due date.", "First section: Respond to given questions based on a provided case study on aviation safety.", "Second section: Find a relevant and recent case on aviation safety.", "Provide a comprehensive and informative summary based on the given questions.", "Late submissions will incur a penalty of 1 point for each hour past the due date.", "* You will design realistic aviation scenarios where CRM principles are critical for ensuring safety.", "You will work in groups to develop and respond to realistic CRM scenarios, promoting teamwork, creativity, and application of CRM skills in aviation contexts.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 7, "course_code": "GEOG 181", "course_name": "GEOG181 - Designing Effective Maps (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Designing Effective Maps Winter 2025", "Topics covered include geographic coordinate systems, map projections, mapping quantitative data, developing online maps, and the impact of maps on society.", "Students will learn computer techniques to produce effective maps based on established principles of cartographic design.", "Identify and distinguish different geographic co-ordinate systems and map projections", "Identify and apply the computer-based techniques for the production of quantitative maps", "Recognize and apply the principles of map design to the creation and evaluation of maps.", "Week of", "Principles of Map Projections", "24 - Feb.", "Choropleth Maps", "Choropleth Maps", "Principles of Map Design", "Map Design / Cartographic Abstraction", "A link to the 4th edition of the textbook can be found in in the content section of the Learn pages for this course.", "The Scope of Cartography                                           Introduction and Chapter 1", "Choropleth Maps                                                         Chapter 8", "Principles of Map Design                                             Chapter 6 & 7", "Map Design/Elements                                                 Chapter 9, 10 & 12", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 8, "course_code": "GEOG 309", "course_name": "GEOG309 - Physical Climatology (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Office Hours and email communications: TBA (each TA will be responsible for particular assignment)", "Topics include radiation and energy balances, general circulation patterns, synoptic development and micro-climatology.", "Climate change and climate variability", "Fundamentals of global warming", "The concepts of feedbacks", "Climate change and human dimensions", "How to explain the issues of climate change and variability ideas to others with confidence and persuasion", "Climate Change and Variability", "Human Dimension", "Weather Systems and Synoptic Development (Part 1) 273-295 299-325 262-285 287-313 Ch. 9,10", "Weather Systems and Synoptic Development (Part 2)", "Any earlier edition is good but the page numbers in the outline will not be correct for other editions than the fifth and seventh.", "Understand physical processes of climate and weather Lectures and Text readings", "Analysis of Weather events during the course", "Analysis of Sequence of Weather Maps", "(Working as groups of 6-8 and explain the sequence and processes of weather in Southern Ontario)", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "This course includes the independent development and practice of specific skills, such as Assess public debate on Climate Change and Variability.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 9, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 10, "course_code": "ARBUS 202", "course_name": "ARBUS202 - Professional and Business Ethics (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["11:30AM -", "V. Fernandes", "Study of ethical and moral issues that typically arise in professional and business activity.", "In the context of this course we will look specifically at ethical issues and principles of conduct that are relevant to professionals and business people.", "Topics include: fundamentals of moral and political theory, ethical decision-making, professional responsibility, corporate social responsibility, and equality, among other things.", "Like many other courses in philosophy, this series of lectures, readings, and discussions will deal with a critical analysis of many and varied views regarding life, existence, values, religious belief, etc.", "Form an opinion on the importance of ethical reasoning in business and professional contexts.", "Identify ethical problems in complex professional and business related situations.", "Apply ethical concepts to particular business and professional situations.", "Explain the roles of professional codes of conduct and codes of ethics in real world contexts.", "1 Jan 6 - 10 Introduction", "Module 2 Check-in", "3 Jan 20 - 24 Ethical Decision Making", "Module 3 Check-in", "5 Feb 3 - 7 Equality & Discrimination", "Module 6 Check-in", "7 Feb 24 - 28 Markets & the Environment", "Module 7 Check-in", "Module 9 Check-in", "Module 10 Check-in", "11 Mar 24 - 28 Whistle-blowing and Codes of Ethics", "Module 11 Check-in", "Module 12 Check-in", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 11, "course_code": "FR 151", "course_name": "FR151 - Basic French 1 (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Basic French 1 Winter 2025", "Emphasizes comprehension, grammar, and basic speaking skills.", "Students are exposed to cultural aspects of life in France, French Canada and other French-speaking countries.", "learn to communicate in written French and to understand spoken and written French,", "study chapters Première étape to 4 in Deux mondes: A Communicative Approach,", "Deux Mondes: A Communicative Approach, 8th edition – Print Version", "Deux Mondes: A Communicative Approach, 8th edition - 6 Month Digital Subscription", "Deux Mondes: A Communicative Approach, 8th edition - 24 Month Digital Subscription", "VERBIX: verb study and reference", "Diplomas in French language", "Degree requirements", "Nous tenons à souligner que nous nous trouvons sur le territoire traditionnel des peuples attawandaron (Neutres), anishinabé et haudenosaunee.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 12, "course_code": "GEOG 371", "course_name": "GEOG371 - Advanced Remote Sensing Techniques (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Advanced Remote Sensing Techniques Winter 2025", "08:30AM - 10:20AM EV3 4408", "Advanced image processing techniques of digital remote sensing measurements (e.g. radar systems, optical and infrared systems) from ground, aircraft and satellite instrument systems.", "It is used for global environmental change studies and for more local scale applications such as urban landscape mapping, precision farming and hazard mapping.", "This course introduces and develops student understanding and skill at using remote sensing information extraction techniques to provide information about human and physical environments.", "The course builds on the fundamentals of remote sensing science and Earth observation systems (e.g. visible-infrared and microwave satellite and airborne observing systems) introduced in GEOG271.", "It focuses on current information extraction approaches, such as image enhancement and transformations, classification / pattern recognition techniques (including machine learning), and geospatial statistics models, along with accuracy assessment to evaluate retrieved information quality.", "The methods are presented and explored using active and passive remote sensing systems.", "This course focuses on the use of remote sensing to map key environmental states.", "Emphasis is placed on the application of remote sensing methods and data processing for analysis of physical and human environments.", "The course presents advanced techniques for further remote sensing and Earth observation work and gives the student a strong basis from which to develop their analytical skills.", "understand different satellite and airborne remote sensing observation approaches to monitoring and mapping the Earth surface", "be able to apply judiciously a range of information extraction methods to create knowledge about specific Earth environments.", "These methods include image transformations, classification/pattern recognition and geospatial models; classification/pattern recognition and geospatial models", "be able to evaluate quantitatively the error/uncertainty about the information created from the remote sensing extraction methods and reflect critically on the procedures adopted", "master the use of industry-standard remote sensing software (PCI Geomatica) for information extraction and also develop their applied skills", "understand of the applicability and limitations of remote sensing information for knowledge creation and to critically reflect on how this information can be used for environmental management", "Assign-ment", "MLP1", "Image enhancements Spatial filters & convolution", "Image Classification I: linear classifiers  Supervised and unsupervised linear classification.", "A1 (20%)", "Remote sensing imagery in vegetation mapping: a review.", "Image classification II: non-linear classifiers  Non-linear classifiers", "Image classification III: Object-based image analysis (OBIA) and Accuracy assessment OBIA and Accuracy Assessment", "Object based image analysis for remote sensing.", "Per-pixel vs. object-based classification of urban land cover extraction using high spatial resolution imagery.", "A2", "Comparison of laser and field measurements of vegetation height and canopy cover.", "Radar Remote Sensing: image analysis SAR analysis", "ALOS PALSAR: A pathfinder mission for global-scale monitoring of the environment.", "Python Scripting in RS analysis Python scripting in RS", "Cloud-based processin Cloud-based processing – the Google Earth Engine environment", "MLP4", "Exam Period", "Lectures are shaded in light blue)", "Richards, J.A. 2022 Remote Sensing Digital Image Analysis An Introduction (6th Edition).", "MLP1 Introduction/", "refresher", "MLP2 Image enhancement", "A1 Image Classification", "A2 Lidar remote sensing", "A3 Synthetic aperture radar analysis", "MLP3 Python for image analysis", "MLP4 Google Earth Engine", "Exam period", "In person", "In addition, you will be directed to core readings so you can keep up with the lecture content.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 13, "course_code": "GEOG 381", "course_name": "GEOG381 - Advanced Geographic Information Systems (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Advanced Geographic Information Systems Winter 2025", "08:30AM - 10:20AM AL 124", "Email:                     dtrobins@uwaterloo.ca", "Email:                     hayden.lam@uwaterloo.ca", "Students learn theoretical and operational approaches to advanced spatial analysis using geographical information systems.", "Emphasis is placed on the use of automation procedures using models and programming to address a variety of topics that may include but are not limited to digital terrain modeling, suitability analysis, network analysis, and cell-based models.", "Understand the components of multi-criteria analysis and how to operationalize them using spatial data and software or computer code", "Interpret and create methods for automation of spatial data management, manipulation, and analysis", "Recognize and critique ways to analyse results from multiple outcomes (e.g., sensitivity analysis)", "Communicate when statistical and non-statistical techniques can be used to aid human decision-making about location suitability or susceptibility", "The lecture will be used to introduce the theory and concepts behind advanced GIS methods as well as to demonstrate techniques that will aid the completion of lab assignments.", "Feb 13 Visual Scripting and Model Builder", "7  Feb 27 Sensitivity Analysis", "Notice of Recording", "Community of Learners", "A goal for this course is that we shall all contribute to a climate that promotes a Community of Learners.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "This course includes the independent development and practice of specific skills, such as analyzing spatial data, summarizing data for reporting results, or putting together statistical models.", "Library for research-based assignments", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}]