[{"course_id": 67, "course_code": "CHE 565", "course_name": "CHE565 - Synthetic Biology Project Design (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Synthetic Biology Project Design Fall 2024", "B. Ingalls", "B. Ingalls bingalls@uwaterloo.ca", "Synthetic biology involves developing new approaches, based on engineering principles, for genetic engineering of biological systems.", "Students will prepare a comprehensive research proposal for a synthetic biology project of their own design, under the supervision of a faculty member.", "BIOL 349: View requirements for BIOL 349", "CHE 565: View requirements for CHE 565", "The goal is to prepare a research proposal for a synthetic biology project and to make a strong case for its adoption by the iGEM team.", "Each", "Each", "week, the presenter for the following week will make a short presentation outlining two", "This proposal should be", "literature should be cited and reviewed, followed by a rationale for the project, and a", "methodological detail for the project to be carried out in the laboratory by a team of", "The paper must also contain references, figures / charts", "The main part of the text should be a maximum of 10,000", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 68, "course_code": "CHE 571", "course_name": "CHE571 - Industrial Ecology (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Industrial Ecology Fall 2024", "04:00PM - 05:20PM", "Industrial ecology is a rapidly growing field that systematically examines local, regional, and global uses and flows of materials and energy in products, processes, industrial sectors, and economies.", "It focuses on the potential role of industry in reducing environmental burdens throughout the product life cycle from the extraction of raw materials to the production of goods, to the use of those goods and to the management of the resulting wastes.", "This course will review the environmental issues associated with chemical industries and the roles of engineers to manage these issues.", "The principles and philosophy of green chemistry will be addressed including pollution prevention in unit operations.", "The concepts and practices of environmental life cycle analysis and accounting will be addressed in detail, together with the basics of risk assessment, management and communication.", "View requirements for CHE 571", "Introduction to sustainability and industrial ecology", "Brief overview of the scientific evidence for climate change", "Environmental Law in Canada; due diligence as a defence", "Climate legislation in Canada; carbon trading", "Describe the key principles of industrial ecology, sustainable development and sustainability engineering [1d,8a,9a].", "Explain the science of global warming and climate change [", "Apply carbon accounting standards to develop greenhouse gas emission and reduction estimates for inventories and reduction projects [", "Describe key environmental legislation in Ontario and Canada [8b,9a]", "Basics of sustainability and industrial ecology.", "Introduction to greenhouse gas (GHG) accounting.", "Week 5 GHG accounting - offset systems.", "A timed multiple-choice component.", "3.0 points - solutions are complete, correct and well-presented.", "2.0-2.5 points - solutions are mostly complete and well-presented but have minor errors, missing information.", "Intellectual property includes items such as:", "Graduate Attribute Program Indicators", "A knowledge base for engineering: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "1a Demonstrate understanding of concepts in mathematics.", "1b Demonstrate understanding of concepts in natural science.", "1c Demonstrate understanding of engineering fundamentals.", "1d Demonstrate understanding of specialized engineering knowledge.", "2. Problem Analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "3a Create investigative studies of complex engineering problems.", "3b Gather information from relevant sources to address complex engineering problems.", "4. Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "4a Define design requirements and specifications for complex, open-ended engineering problems.", "4b Critically evaluate and compare design choices.", "7. Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "8a Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Impact of Engineering: An ability to analyze social and environmental aspects of engineering activities.", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "10a Identify ethical and unethical behavior in professional situations.", "10b Identify how an engineer is accountable to multiple stakeholders in engineering practice.", "Life-long Learning: An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge.", "12a Identify gaps in their knowledge, skills and abilities.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 69, "course_code": "CHE 572", "course_name": "CHE572 - Air Pollution Control (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["CHE 572", "CHE 572 001", "CHE 572:", "Design of industrial particulate capture systems using cyclones, electrostatic precipitators, filters, scrubbers.", "Design of organic compound emissions control using incineration, biofiltration, adsorption and absorption.", "View requirements for CHE 572", "Recognize air emission and air quality issues and impacts, and the rationale for their regulation and control.", "Model simple air dispersion problem scenarios and evaluate the significance of the results.", "Identify, rank and select appropriate emission control technologies for a variety of scenarios.", "Perform preliminary process design and cost estimation for a variety of common emission control technologies, and recommend next steps.", "Recognize and recommend mitigation strategies for environmental and safety issues associated with air pollution control.", "Assess indoor air quality concerns and identify potentially useful mitigation techniques.", "Introduction, structure & composition of the atmospheres.", "Indoor air quality & investigations.", "Infection transmission control methods.", "The notes will be required for use in design calculations in almost every class, and exams.", "Comparing answers and discussing reasons for differences", "The following levels of collaboration are not acceptable:", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 70, "course_code": "CHE 574", "course_name": "CHE574 - Industrial Wastewater Pollution Control (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["S. Meunier", "sarah.meunier@uwaterloo.ca", "Dr. Sarah Meunier", "sarah.meunier@uwaterloo.ca", "Sarah Rezaei", "E6-1102", "Principles and design of treatment methods: chemical treatment, precipitation, coagulation and flocculation, ion exchange and membrane separation.", "View requirements for CHE 574", "4. Propose techniques to reduce and treat waste in a variety of industrial processes [1d,2a,2b,3a,3b,6a,6b,7a,7b,7c].", "Assignment 4 5% Topics 6 & 7 - Membrane Separations & Ion Exchange April 4", "Examinations", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 71, "course_code": "CHE 499", "course_name": "CHE499 - Elective Research Project (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["E. Boghaert", "Eline Boghaert", "E6 - 5020", "View requirements for CHE 499", "The course is a full technical elective, and the level of effort and complexity is expected to be equivalent of a Technical Elective in Chemical Engineering.", "Perform a comprehensive literature search to identify relevant and useful information (3b, 12a).", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 72, "course_code": "EARTH 456", "course_name": "EARTH456 - Numerical Methods in Hydrogeology (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Numerical Methods in Hydrogeology Winter 2025", "An introduction to the theory and practice of groundwater flow and contaminant transport modeling.", "Topics related to variably-saturated flow will focus on derivation of Richard's equation, a control volume finite difference discretization, assembly and solution of the flow equation, material balance error, truncation error analysis, stability and monotonicity.", "Explain the fundamental theory behind groundwater flow and contaminant transport modeling", "Apply numerical techniques, including control volume finite difference discretization, to solve groundwater flow and contaminant transport equations.", "Analyze numerical model accuracy, including material balance error, truncation error, stability, and monotonicity in variably-saturated flow and contaminant transport problems.", "Use a modeling software to model variably-saturated flow and contaminant transport.", "Interpret and visualize groundwater flow and contaminant transport model results and communicate findings effectively.", "Identify the concepts of groundwater and solute transport modeling and their real-world applications.", "Section 1.1 Derivation of Richards' Equation", "Section 1.2 Derivation of Richards 'Equation – Pressure Head Formulation", "Section 1.3 Three-Dimensional Groundwater Flow", "Derive and interpret three-dimensional groundwater flow dynamics and their mathematical representation.", "Section 1.4 Control Volume Finite Difference Discretization for Flow", "Section 1.5 A Rigorous Derivation of the Control Volume Finite Difference Discretization", "Develop, apply, and justify control volume finite difference discretization techniques for groundwater flow problems, demonstrating a rigorous understanding of mathematical principles.", "Assemble and implement saturated groundwater flow equations in numerical models using discretized formulations.", "Assemble the saturated groundwater flow equation using control volume discretization.", "Analyze groundwater flow material balance errors and their implications for numerical model accuracy.", "Section 1.8 Truncation Error Analysis", "Section 1.8 Truncation Error Analysis", "Section 1.9 Stability and Monotonicity", "Section 2.1 Derivation of the Contaminant Transport Equation", "Analyze the stability and monotonicity of numerical methods for groundwater flow models.", "Derive the contaminant transport equation and articulate its role in modeling solute movement through porous media.", "Section 2.1 Derivation of the Contaminant Transport Equation", "Section 2.2 Control Volume Finite Difference Discretization of the Contaminant Transport Equation", "Section 2.3 Central Spatial Weighting of Advective Flux", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Apply control volume finite difference discretization to the contaminant transport equation for numerical modeling.", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Section 2.4 Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.5 Upstream Spatial Weighting of Advective Flux", "Section 2.5.1 Truncation Error of Upstream Spatial Weighting", "Section 2.6 Crank-Nicolson Temporal Weighting with Upstream Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.7 Assembly of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.7.1 Monotonicity of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.8 Assembly of Fully-Implicit Temporal Weighting with Upstream Spatial Weighting", "Section 2.8.1 Monotonicity of Upstream Spatial Weighting with Fully-Implicit Temporal Weighting", "Section 2.9 Boundary Conditions for Transport Coupled to Flow", "Analyze the accuracy of various contaminant transport weighting schemes and their impact on numerical model performance.", "Apply boundary conditions for contaminant transport coupled with groundwater flow and assess material balance errors to ensure reliable numerical simulations.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "The total maximum bonus points that can be earned across all five assignments is five.", "Students can earn bonus points by actively participating in discussions or helping their peers understand the course material and assignments.", "Explaining a challenging concept to peers in a collaborative study session.", "A maximum of five contributions will be allowed per assignment."]}, {"course_id": 73, "course_code": "EARTH 458", "course_name": "EARTH458 - Physical Hydrogeology (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrogeology Fall 2024", "08:30AM - 09:50AM DWE 3519", "An introduction to the principles and theories of mineral deposit genesis.", "Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered.", "View requirements for EARTH 458L", "Applied geophysics provides geoscientists with a wide-range of non-invasive methods for characterizing the Earth's interior.", "This course is an introduction to the physical principles underlying field acquisition, processing, and data interpretation for commonly used applied geophysical techniques (seismic, electrical, electromagnetic induction, gravity, and magnetic methods).", "This course is not only pertinent for geoscientists but also for engineers and others interested in learning how physics can be used to explore the Earth's interior or perform non-destructive testing.", "Near-surface geophysics is used to characterize the shallow subsurface for a wide-spectrum of applications.", "This application-oriented course covers current methodology in near-surface geophysics, including electrical, electromagnetic, ground penetrating radar, seismic refraction, and well-logging methods.", "Techniques for geophysical data acquisition and interpretation are studied and applied to field data.", "Examples of the application of geophysical techniques to archeological, forensics, geotechnical, glaciology, and hydrogeological problems are examined.", "View requirements for EARTH 461", "A field-oriented course on current methodology in the general area of geotechnical or engineering geophysics as applied to environmental problems.", "Typical topics covered: well logging and time domain electromagnetic surveys for groundwater supply; magnetic and terrain conductivity surveys for waste materials; ground penetrating radar applications to stratigraphy and contamination; streaming potential surveys of dam leakage.", "A pre-lab quiz must be completed before attending each field lab.", "Labs will be completed in groups with field data recorded in field books or datasheets.", "These data will be used to a complete individual lab assignment.", "This site contains over 100 groundwater monitoring wells.", "Field lab activities involve:", "(3) Measurement of in-situ hydraulic conductivity using single-well response tests", "Each lab will provide you with a unique dataset that you will use to develop a conceptual site model of the local groundwater flow system.", "• Properly construct and interpret soil core logs using United Soil Classification System, and make lithostratigraphic interpretations using geophysical logs", "• Assess and interpret water level measurements through the construction of water table maps and flownets", "• Interpret single-well response tests including falling and rising head (slug) tests to determine in-situ hydraulic conductivity", "• Interpret hydraulic pumping tests to determine aquifer transmissivity and storage parameters and assess water resource vulnerability", "Each module will contain a series of recorded lecture slides and video demonstrations reviewing core concepts and guidelines for the upcoming field lab.", "Please include “Earth 458L” in the subject line of all e-mail communications as well as your Full Name and Student ID# in the text of the email.", "Hydrogeological equipment to make measurements and collect data (temporary use)", "Specialized hydrogeological software to complete certain assignments", "Datasheet to record field data", "Other data should be recorded in your field books and distributed to your group members as needed.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Notice of Recording", "Participation in Field Labs:", "These quizzes are designed to keep you on schedule and prepare you for the in-person field lab and assigned activities.", "There will be a 48-hour grace period to finalize the submission of your assigned activities without incurring any late penalty."]}, {"course_id": 74, "course_code": "EARTH 459", "course_name": "EARTH459 - Chemical Hydrogeology (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 11:20AM PHY 150", "10:30AM - 11:20AM MC 4042", "View requirements for EARTH 459", "Overall learning objective: To provide an understanding of the basic principles of chemical hydrogeology as they relate to problem solving in various applications of geochemistry.", "Develop the skills to collect accurate and reliable physical, geochemical and microbiological measurements from groundwater flow systems", "Analyze geochemical and hydrogeological data to identify the processes that affect groundwater quality and cause groundwater contamination", "Develop management and remediation systems to protect groundwater quality and protect human and ecosystem health", "Part 1: Chemical principles and processes of water-rock interaction", "Introduction to chemical hydrogeology:", "Mineral-water interaction:", "Mineral-water interaction:", "Development of natural groundwater chemical sequences in flow systems:", "Redox reactions, redox sequences in groundwater flow systems", "Development of natural groundwater chemical sequences in flow systems:", "Introduction to chemical modelling:", "Case studies of groundwater contamination and remediation.", "Introduction to common scenarios of groundwater contamination and classes of contaminants considered in this course.", "Non-Aqueous Phase Liquids – dissolution and contamination patterns, vapour transport, implications for clean-up.", "Acid generating mine wastes and inorganic contaminants:", "Selected topics in chemical hydrogeology:", "Natural attenuation and in-situ remediation: Inorganic contaminants and radionuclides, approaches and case studies.", "Emerging contaminants in groundwater: Fate of pharmaceutical compounds and other emerging compounds in septic system and landfill plumes.", "Environmental Isotopes in Hydrogeology Authors: I.D. Clark and P. Fritz No 250", "This course includes the independent development and practice of specific skills, such as geochemical calculations.", "Library for research-based assignments"]}, {"course_id": 75, "course_code": "ENVE 376", "course_name": "ENVE376 - Biological Processes (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 09:50AM RCH 204", "Quantitatively describe common biological substrates in environmental engineering", "2. Quantitatively describe the microbiology and chemistry associated with common biological processes employed in environmental engineering systems", "3. Develop mass balance-based biological process models", "Apply process models for analysis and design of environmental engineering systems", "Introduction to Biological Processes, types of pollutants, applications  Week 1", "Process Configurations and Biomass Morphology, suspended growth systems, fixed film, aggregation Week 3", "Modeling of Biochemical Transformations, growth and substrate utilization, endogenous processes, hydrolysis, matrix representation of biochemical processes  Weeks 4−6", "Calculator Standard requirement for engineering courses Yes", "Evaluating Natural Source Zone Depletion at Sites with LNAPL, Interstate Technology & Regulatory Council, Washington, DC (2009)", "In cases where the number of students does not divide evenly into groups of two, students may form groups of three.", "Laboratory activities and reports are completed and submitted in groups of three.", "In cases where the number of students does not divide evenly into groups of three, students may form groups of four.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 76, "course_code": "ENVE 573", "course_name": "ENVE573 - Contaminant Transport (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["DWE 3518", "02:30PM - 03:20PM", "DWE 3518", "Types of contaminants; transport phenomena with a focus on advection-dispersive transport; development of governing equations; types and utility of boundary and initial conditions; and mass balance considerations.", "Review of completely mixed systems including lakes, streams, source functions, feedback systems, and toxic substance models.", "Model calibration, sensitivity, and uncertainty; methods and approaches.", "Solute transport models and solution techniques including random walk, method of characteristics, finite difference method and finite volume method.", "Introduction to mass removal technologies for remediation of soil and groundwater systems.", "One of the key responsibilities of the environmental engineering profession is to monitor, assess, and clean up environmental contamination in the soil, water, and air.", "Engineers are tasked to develop, implement, and design technology and best management practices to mitigate contamination, interpret uncertain environmental data to determine the source(s) and or fate of environmental contaminants, and make predictions about how past and future pollution may pose a health threat to humans and ecosystems.", "The objective of this course is to introduce you to theoretical and practical aspects of mass transport in natural environmental systems, and to learn how to model mass transport processes.", "describe various types of contaminants and their behaviour in a variety of media", "formulate and apply a mathematical mass transport model in response to an environmental problem statement (i.e., select appropriate ICs & BCs, recognize appropriate processes to include, and solve the problem using appropriate mathematical methods)", "explain the physics and mathematical treatment of key transport processes and be able to distinguish and prioritize their role in the transport and remediation of contaminants", "justify the use of assumptions used in contaminant transport models", "interpret observation data in conjunction with model results and critically evaluate model results subject to (often significant) uncertainty", "To satisfy the above outcomes, you will hone your programming skills, a necessary tool for solving the types of problems addressed in this course.", "Canadian Engineering Accreditation Board", "Piazza – Wiki-style Q&A; primary way to get & give text-based help in ENVE 573", "The first tutorial will be held in the second week of the term.", "Drop-in Hours", "Students are very welcome and encouraged to meet with the teaching team in scheduled drop-in hours.", "Water Balance in Completely Mixed Systems", "Suspended Solids Balance in Lakes", "Suspended Solids Balance in Lakes & Sediments", "Single-Species Irreversible Reactions", "Generalized Least-Squared Fitting", "Dissolved Phase Balance in Completely Mixed Systems", "Quantifying Multiphase Systems", "Multiphase Toxicant Balance in Lake & Sediments", "Additional Coupled Mixed Systems", "Advective Transport in Rivers & Streams", "BOD Transport in Rivers & Streams", "Dissolved Oxygen Transport in Rivers & Streams", "Dispersion", "Steady 1D Advection-Dispersion-Reaction Equation (ADRE)", "Dispersion in 2D & 3D", "3D & 2D Advective-Dispersive Transport with Boundary Conditions", "Calibration and Sensitivity", "Uncertainty Analysis", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "extenuating circumstance", "This course includes the independent development and practice of engineering specific skills.", "Campus Supports", "Library for research-based assignments"]}, {"course_id": 77, "course_code": "ENVE 577", "course_name": "ENVE577 - Engineering for Solid Waste Management (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Attention is given to the engineering design and operational aspects of the control of generation, storage, collection, transfer and transport, processing and disposal of solid wastes in landfill site.", "Design of natural attenuation sites and system reliability features for landfill designs.", "Topics include waste characterization, collection systems, transportation, treatment technologies, landfill design, recycling, waste-to-energy systems, greenhouse gas impacts, and policy frameworks.", "Understand the composition and generation rates of solid waste", "Analyze waste collection, segregation, and treatment methods", "Design components of solid waste management systems (e.g., landfills, composting systems)", "Explore innovative technologies for resource recovery, recycling, and waste-to-energy processes", "Module 1: Introduction to Solid Waste Management", "Definition and types of solid waste", "Examples of waste management systems from different regions", "Calculate the waste generation rate (WGR) per capita for a given dataset and project future WGR trends using population growth models", "Jan 9 Waste Generation and Characteristics", "Physical, chemical, and biological characteristics", "Typical components and composition of waste", "Hazardous wastes and recycling streams", "Introduction to waste composition audits", "Calculate the environmental impact using simplified LCA metrics for waste scenarios", "Jan 16 Lifecycle Analysis and Waste Hierarchy", "Jan 21   Waste Collection Systems", "Door-to-door collection", "Community bins and transfer stations", "Equipment used in collection", "Estimate transportation costs for different modes of waste transfer (e.g., by truck, rail) based on distance, fuel costs, and waste tonnage", "Operations and routing strategies", "Design and function of transfer stations", "Jan 28   Temporary Storage Solutions", "Design of storage bins and containers", "Safety considerations", "Calculate the capacity needs of storage containers", "based on waste generation rates and collection frequency", "Role of public awareness", "Estimate biogas yield from anaerobic digestion of organic waste using stoichiometric calculations", "Process design and optimization", "Applications and challenges", "Incineration: principles and applications", "Pyrolysis and gasification", "Calculate energy recovery from the incineration of municipal solid waste using calorific values", "Design of Material Recovery Facilities (MRFs)", "Challenges in recycling", "Technical, environmental, and economic considerations", "Assess the efficiency of a WTE plant using energy balance equations", "Definitions and frameworks", "Composting and anaerobic digestion as mitigation techniques", "Site selection and design", "Leachate and gas management", "Design a landfill’s leachate collection system based on given permeability and rainfall data", "Operational strategies", "Post-closure monitoring and land reuse", "Environmental and health impacts", "Strategies for remediation", "*TBD", "Mar 13 Analysis and Design of Solid Waste Management Infrastructure", "Design and operation of materials recovery facilities", "Overview of thermal methods and biological processes", "Mar18                          Digital and Smart Solutions for SWM", "Data analytics for waste tracking", "*TBD", "Tools and methodologies", "Challenges and solutions", "Innovations in SWM policies", "** Note:", "Design Project 25%", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, such as practical analysis and critical thinking.", "Library for research-based assignments"]}, {"course_id": 78, "course_code": "ME 362", "course_name": "ME362 - Fluid Mechanics 2 (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Fluid Mechanics 2 Winter 2025", "Email: cdevaud@uwaterloo.ca", "Email: fhatiesm@uwaterloo.ca", "Email: jdchateauneuf@uwaterloo.ca", "All lectures will be recorded and made available on Learn, unless there is a technical issue preventing the recording.", "Basic equations of two-dimensional flow, potential flow, exact viscous solutions.", "Introduction to lubrication, boundary layers, turbulence, and compressible flow.", "The material in ME 362 is an extension of ME 351 – Fluids I covering topics in theoretical and applied fluid mechanics.", "Since we will not be able to allocate time to review all of these concepts during class time, please brush up on these topics as required.", "The first part of the course will focus on the theoretical side, and involves the derivation and solution of the coupled, nonlinear partial differential equations that govern multi-dimensional fluid motion.", "The second part includes applied topics such as compressible flow using approaches and tools similar to those presented in the Fluids 1 course.", "Classify fluid flows and select appropriate quantitative methods for evaluation.", "Develop quantitative models for common fluid flows in engineering applications.", "Solve practical fluids engineering problems by applying appropriate assumptions and fluid mechanics principles.", "Course chapters Relevant textbook sections", "Review and Introduction", "Classification of flows", "Forces in fluids", "Control volume analysis", "Dimensional analysis and similarity", "The differential equations of conservation", "Velocity field visualization", "The governing pdes of fluid flow", "Continuity equation", "Navier-Stokes equations", "1.11", "4.1", "4.2", "4.10", "4.10", "Conservation equations for inviscid flow", "Irrotational and potential flow and 2D potential flow equations", "Examples of common fundamental flows", "Method of images", "Example: Potential flow around a Rankine half-body", "4.9", "8.2 - 8.4", "8.6", "4.10", "Some definitions", "Boundary layer equations", "Blasius solution for a flat plate", "Momentum integral equation", "Turbulent boundary layer over a smooth plate", "7.1", "7.2", "7.1", "7.3", "7.4", "7.2", "7.4", "Introduction to compressible flow", "Steady, 1D, frictionless, adiabatic conservation equations", "Speed of sound and flow Mach number", "Velocity behaviour in nozzles and diffusers", "Stagnation properties", "Normal shock waves", "9.2", "9.4", "9.4", "9.4", "9.4", "9.4", "Ungraded homework:    Each week problems requiring in depth application of the course concepts will be assigned.", "Each group must submit a short and clear description of their project (one page maximum, including their selected sport, objectives and methodology) by email to Akira Tiesma (TA).", "The project report has a firm submission deadline.", "In order to perform well on examinations in this course, you must not only understand how to solve new problems in fluid mechanics, but also be comfortable with the basic concepts.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as engineering model development, data presentation, and technical report writing.", "Library for research-based assignments"]}, {"course_id": 79, "course_code": "ME 435", "course_name": "ME435 - Industrial Metallurgy (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 11:20AM MC 4064", "Maryam Soleimani", "Email: m7soleim@uwaterloo.ca", "Office: E3-3173", "This course is intended for those students interested in acquiring a working knowledge of metallurgy.", "It covers: metals and alloy systems, iron-carbon alloys, heat treatment and the function of alloying elements in steel, corrosion and scale resistant alloys, copper and nickel base alloys, light metals and their alloys; casting, hot and cold working of metals; soldering, brazing and welding; corrosion and oxidation; metal failure analysis.", "Identify the alloy in a component by conducting a metallographic analysis and materials testing.", "Describe the typical uses and properties for various alloys, and recognize their designations and naming systems.", "Introduction and Background", "Elements of Metallurgy and Engineering Alloys F.C. Campbell, “Elements of Metallurgy and Engineering Alloys,” ASM International, 2008 No"]}, {"course_id": 80, "course_code": "ME 452", "course_name": "ME452 - HVAC Load Analysis and Design Fundamentals (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "HVAC Load Analysis and Design Fundamentals Winter 2025", "11:30AM - 12:20PM RCH 305", "Email: hasan.habib@uwaterloo.ca", "Duct design and fan selection.", "Heating and cooling load calculations.", "Infiltration and exfiltration.", "B. Be able to fully design an air conditioning and ventilation system", "C. Be able to perform heating and cooling load, and preliminary energy use calculations for buildings", "D. Have developed the ability to apply their knowledge in a real-world setting (practical experience)", "E. Be capable of communicating effectively with industry professionals and clients", "F. Have developed the skills to research and interpret information needed to remain current in the field", "Module 1: Introduction to HVAC:  History, ASHRAE, Unit Systems (chap.", "Module 2: Air Conditioning and Ventilation: Fundamental Concepts of HVAC/Air Conditioning Systems (chap.", "3), Fans and Air Distribution Systems (chap. 16).", "A tentative checklist of material to be reviewed each week will be posted in Learn.", "Midterm Exam: will be held in two parts during scheduled lecture time.", "You can also present case studies of interesting buildings or even a biographical review of someone who made an impact to HVAC.", "A) Develop an appreciation and understanding for the various codes, standards, and guidelines that determine HVAC design practices X    X", "B) Fully specify and design an air conditioning and ventilation system   X", "C) Perform heating and cooling load, and preliminary energy use calculations for buildings     X", "F) Develop the skills to research and interpret information needed to remain current in the field X", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 81, "course_code": "ME 459", "course_name": "ME459 - Energy Conversion (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Energy Conversion Fall 2024", "10:00AM - 11:20AM E5 3102", "Design of fossil-fuel central power plants, including boiler efficiency calculations and advanced steam and binary cycles.", "Review of atomic physics including fission and fusion energy.", "Design of nuclear fission power plants including design of reactor core for critical conditions, fuel cycles and radiation hazards.", "Design considerations for solar energy conversion devices including: availability of solar energy, solar-thermal converters, thermal storage and photovoltaics.", "Principles of fuel cells and some aspects of their design.", "We look at the way Canada, and the world, use energy, where the energy comes from, the finite nature of some reserves, and the impact of this energy use on the environment.", "Sustainability and the security of energy supply are also discussed.", "We review conventional energy systems from an efficiency and global warming perspective.", "From the study of these various factors, it will become clear that new energy technologies will need to be adopted in the future.", "We then study energy conversion devices and systems not studied in previous courses: for example, nuclear reactors, MHD, fuel cells, solar energy conversion(s), wind energy conversion, co-generation, hydroelectricity, ethanol, methanol, geothermal, ocean thermal, wave, tidal, thermoelectric.", "The objective is to broaden the students’ understanding of energy, both in a technical sense and in an environmental and socio-economic sense.", "6 Entropy and Availability", "8 Coal and Combustion", "9 Nuclear Energy", "11 Ethanol for Vehicles", "12 Methanol for Vehicles", "14 Solar Energy", "17 Wind Power", "18 Wave Power", "19 Tidal Power", "22 Thermoelectric", "Students must research in depth one topic in energy conversion and present their findings in a 7500 - 10000 word or so (~15-20 pages, … … or so) report.", "Project topics will be allocated in the first few lectures on a first-come, first-served basis.", "To select a topic, send me an email request, with alternatives in case your primary request is taken.", "However, the socio-economic and environmental aspects of the topic, and some indication of the magnitude of its possible impact on the demand for energy and on global-warming should also be considered."]}, {"course_id": 82, "course_code": "ME 531", "course_name": "ME531 - Physical Metallurgy Applied to Manufacturing (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Please do check your email regularly to make sure you do not miss anything", "This course will allow the student to develop a more in depth knowledge of physical metallurgy and its application in understanding and solving relevant manufacturing problems.", "It will begin with a treatment of solid-state diffusion, mass transport and the principles of solidification including constitutional supercooling.", "The course will include case studies aimed at providing the students with an opportunity to apply their knowledge in a practical way.", "Explain the cause of the microstructure development during various metallurgical processes using the fundamentals of thermodynamic", "Phase and Phase Equilibria for Multi-Component Systems (Section 1.3 to 1.5)", "Energy Aspect of Diffusion (Section 2.2 to 2.4 and 2.7, 2.8)", "Relating these concepts to heat treatments we know (Sections 5.4 to 5.6, 5.8)2", "1These two sections are going to be intertwined and these sections would also be intertwined", "We will take the concepts in this course and apply it to deepen our understanding of these microstructure formation", "Engineering Materials 2 - An Introduction to Microstructures and Processing (4th Edition).", "These includes the lab.", "We will also play around with a software name Thermocalc, which is free for students if you sign up here:", "https://thermocalc.com/academia/free-educational-package/", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 83, "course_code": "ME 533", "course_name": "ME533 - Non-Metallic and Composite Materials (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["11:30AM - 12:20PM DWE 2402", "Please do check your email regularly to make sure you do not miss anything", "The structure and properties of polymers and ceramics in bulk form and as matrices and reinforcements in composites will be covered.", "The geometrical arrangement of fibres within laminae and their influences on elastic and strength properties of composites will be described based on suitable micromechanical models.", "The role of the matrix and fibre/matrix interface in determining composite properties will be described.", "Explain the interaction of the reinforcement phase and the matrix phases in various types of structural composite and their roles within the composites.", "Devise simple structural composites using the fundamental understanding in order to achieve the desired properties.", "What is a Composite and the rationale behind them?", "A Primer on Polymer Science", "Carbon-Carbon Bond and the Carbon backbone", "Carbon fibers and the source of its properties", "Polymer structure and how it affects strength", "Chain Length, Molecular Weight, and Degree of Polymerization", "Crystallinity, Defects, Properties & Behaviour", "A Primer on Ceramics", "Difficulty in Processing and its relations to Properties & Behaviour", "The Matrix Phase and the need for Reinforcements", "Micromechanics of Continuous Fiber Reinforced Composites", "Various orientation of fibers", "Micromechanics of Discontinuous Fiber Reinforced Composites", "Modifying the rule of mixture", "The importance of interfaces", "Extending these to macro-composites", "Manufacturing and Processing", "Manufacturing of Fibers", "Extending these to composites", "End-of-Life, recyclability, and environmental concerns", "Design tools for Composites", "More Advanced topics in Composites", "Fracture and Failure of Polymers and Ceramics", "Natural and Advanced composites", "Carbon/carbon composites", "Nanocomposites and dispersion strengthened composites", "Woods and other natural composites", "*", "John Wiley & Son available in the Davis Library: TA403 .C23 2006, *recommended for review of fundamental of materials science No", "*recommended for review of fundamental of materials science No", "Engineering Materials 2 - An Introduction to Microstructures and Processing (4th Edition).", "*recommended for review of fundamental of materials science No", "Materials Selection in Mechanical Design (4th Edition).", "These assessments will be administered online and students will be given some period of time (usually a week or so) to complete the task.", "During the first week of the final exam period, there will be a final assessment with one or both a numerical and a conceptual assessment.", "These includes the lab.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 84, "course_code": "ME 559", "course_name": "ME559 - Finite Element Methods (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Finite Element Methods Fall 2024", "03:30PM -", "DWE 2402", "Email: kinal@uwaterloo.ca", "Name: Johann Barry Scheepers", "Email: jbscheepers@uwaterloo.ca", "A course presenting the fundamental ideas involved in conventional finite element analysis in mechanical engineering.", "Interpret the philosophy behind principles, design and modelling considerations in using the finite element method (FEM).", "Derive the equations of motion from interpretations of various physical systems (trusses, beams, plates, etc.)", "Obtain analytical solutions to simple finite element problems (e.g., static truss networks).", "Develop an understanding of commercial finite element software packages (ANSYS, ABAQUS, etc.) for use in linear-elastic equilibrium problems and modal analyses.", "Communicate the most important methods, results and conclusions in a brief technical report.", "- Concept of stiffness analyses for simple spring systems", "- direct equilibrium approach", "- application of boundary conditions", "- solution of linear algebraic equations", "- discretization and interpolation", "- element stiffness equations using virtual work formulation", "- assembly into global stiffness equations", "- boundary conditions and solution", "- post-processing for strain and stress", "- higher order elements", "- meshing practice", "- convergence studies", "- imperfection analyses", "- solvers", "Thermal and fluid flow analysis:", "Basic Introduction No", "Advanced No"]}, {"course_id": 85, "course_code": "ME 566", "course_name": "ME566 - Computational Fluid Dynamics for Engineering Design (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Computational Fluid Dynamics for Engineering Design Fall 2024", "01:30PM - 03:20PM", "DWE 2402", "Current lecture delivery plans", "All lectures will be recorded and made available on Learn, unless there is a technical issue preventing the recording.", "A course to develop the understanding required to simulate complex fluid flows, such as those found in turbo-machines, duct systems, and other engineering hardware.", "Course topics include the physics of complex viscous fluid flows, first- and second-order finite control volume discretization methods, iterative algorithms for the solution of sparse matrix equation sets, including multi-grid acceleration, boundary condition modelling, two-equation and Reynolds stress turbulence models, and grid generation techniques.", "Computational fluid dynamics software is used throughout the course to simulate and analyze complex fluid flows relevant to engineering applications.", "Introduce the major approximations implied in CFD analysis of complex turbulent flows and the methods for controlling the resulting errors.", "Develop a familiarity with the steps required to complete a flow analysis project: (c) Communicate the findings of a CFD analysis in a complete and concise report", "Develop an enriched understanding of the physics of complex fluid flows: (a) Analyze a simulated or measured flow field to determine the most significant flow processes using quantitative analysis [", "Introduce the major approximations implied in CFD analysis of complex turbulent flows and the methods for controlling the resulting errors: (a) Describe the basic computational methods used to obtain a solution and the relationship between CFD model specification and the CFD simulation", "Develop an enriched understanding of the physics of complex fluid flows: (a) Analyze a simulated or measured flow field to determine the most significant flow processes using quantitative analysis [", "Develop an enriched understanding of the physics of complex fluid flows: (c) Select an optimal flow design from a set of flow design alternatives", "Develop an enriched understanding of the physics of complex fluid flows: (b) Identify how the significant flow processes impact flow design performance", "Introduce the major approximations implied in CFD analysis of complex turbulent flows and the methods for controlling the resulting errors: (b) Generate a CFD simulation.", "(c) Evaluate a CFD simulation to determine the sensitivity of the simulation to the model components and parameters", "Introduce the major approximations implied in CFD analysis of complex turbulent flows and the methods for controlling the resulting errors: (c) Evaluate a CFD simulation to determine the sensitivity of the simulation to the model components and parameters.", "1.3 Application to a simple pipe network", "1.4 Role of goal in CFD simulation process", "2.2 Boundary conditions", "2.3 Tutorial", "The Governing Equations of Fluid Dynamics", "3.1 Flow kinematics", "3.2 Conservation of mass", "3.3 Conservation of momentum", "3.4 Generic form of governing equations", "4.1 1-D steady-state diffusion", "4.2 Example", "5. Convection-Diffusion problems", "5.1 steady 1-D equation - no source", "5.3 Upwind Differencing Scheme", "Solution of discretized equations", "6.1 Direct methods", "6.2 Indirect methods", "6.3 Multigrid methods", "7.1 Implicit vs Explicit scheme", "7.2 Implicit Scheme", "7.3 Explicit Scheme", "Turbulence models", "8.2 Reynolds averaged Navier Stokes equations", "8.3 Eddy viscosity models", "8.4 Wall corrections", "8.5 Advanced models", "An Introduction to Computational Fluid Dynamics: The Finite Volume Method, 2nd Edition, H.K. Versteeg and W. Malalasekera, 2007, Pearson Prentice Hall.", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as learning a new CFD package and in-depth understanding of the models and numerical methods with their limitations used in CFD.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 87, "course_code": "MSE 332", "course_name": "MSE332 - Fundamentals of Optimization (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Fundamentals of Optimization Fall 2024", "E-mail:    sghadimi@uwaterloo.ca", "This course focuses on solution methods in linear, integer, and nonlinear optimization.", "Topics include the theory and algorithms of linear optimization, branch-and-bound, network algorithms, convexity, and optimality conditions.", "View requirements for MSE 332", "This course builds on the material covered in MSE 331 Introduction to Optimization.", "It covers advanced topics in deterministic optimization with application to Management Engineering decision problems.", "The goal of the course is to develop the ability to formulate fairly complex decision problems, and to design solutions using advanced methods.", "The main topics are advanced linear and integer optimization, dynamic programming, heuristics and metaheuristics, and nonlinear optimization.", "Recognize the major capabilities and limitations of deterministic optimization models and methods as applied to Management Engineering decision problems (Knowledge Base).", "2. Formulate deterministic optimization models: objectives, decisions and constraints (Problem Analysis).", "3. Describe the theory behind available solution methods and apply exact and heuristic algorithms (Design).", "4. Describe a problem related to deterministic optimization by placing it in its general context and framework (Problem Analysis).", "6. Develop an exact or heuristic solution methodology to solve a model (Design).", "The list of all graduate attributes expected by the Canadian Engineering Accreditation Board (CEAB), can be found here.", "Introduction & Review of Linear Algebra", "Theory of Linear Programming (LP)", "Revised Simplex Method", "LP Duality and Dual Simplex Method", "Sensitivity Analysis and Goal programming", "I: Introduction  & Modeling", "NLP II: Unconstrained Optimization", "NLP III: Constrained Optimization", "Dynamic Programming I", "Dynamic Programming II", "Introduction to Game Theory", "Introduction to Operations Research (9th Edition) F.S.", "Operations Research: Applications and Algorithms (4th Edition) Wayne L. Winston, ISBN-10: 0534380581 No", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 88, "course_code": "MSE 431", "course_name": "MSE431 - Stochastic Models and Methods (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Stochastic Models and Methods Winter 2025", "MSE 431", "S. Erenay", "TAs    Atahan Bayir", "Introduction to operations research models and methods for problems with random, stochastic, and probabilistic components.", "Applications include the design, modelling, and analysis of service and manufacturing systems, with emphasis on important functions such as queueing, inventory, reliability, equipment replacement, and maintenance.", "View requirements for MSE 431", "Understand/use the key elements of probability theory and simple stochastic models [", "Critique and propose areas of improvement for Markov chain models by addressing weak points and unrealistic issues.", "Develop and use probabilistic models to analyze and address the needs of real-life systems.", "Basic Concepts of Queuing Theory (week11-12) (new topics)", "You will be given around 30-50 minutes to complete each quiz.", "You will be given a problem definition and asked to apply an advanced stochastic modeling approach to address the problem.", "You are expected to a) model the problem as a stochastic process, b) solve the corresponding problem, and c) gain insights from the solutions and discuss how these insights can be used for more educated decision-making.", "If necessary, a softcopy can be sent to the instructor’s email address before the deadline and a hard copy can be submitted the next day to catch the deadline.", "Illness During the Term", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 89, "course_code": "MSE 432", "course_name": "MSE432 - Production and Service Operations Management (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Production and Service Operations Management Winter 2025", "Introduction to management, planning, and control decisions in manufacturing and service settings using quantitative approaches.", "Students are exposed to a number of examples and case studies, and work on a project that involves analysis and discussion of improved designs.", "Develop understanding of the impact of services and production operations in organizations [PA]", "Employ decision-making tools used by operations managers [", "Impact]", "Introduction to OM and Demand Forecasting (I)", "Demand Forecasting (II) and Product Design", "Capacity Planning and Process Design/Facility Layout", "Chapters 11", "Aggregate Operation Planning", "Just-in-Time Production and Project Management", "Demand Forecasting", "Capacity Planning and Process Design/Facility Layout", "Aggregate Operations Planning", "JIT & Project Management"]}, {"course_id": 90, "course_code": "MSE 551", "course_name": "MSE551 - Quality Management and Control (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "S. Dimitrov", "09:00AM - 09:50AM CPH 3681", "yekta.amirkhalili@uwaterloo.ca", "Yekta Amirkhalili  yekta.amirkhalili@uwaterloo.ca", "Accurately summarize the parts of a quality management system", "Assess a system for quality improvement opportunities", "Create a quality management system for a process", "Evaluate a quality management system for a process", "Apply documentation, and analytical techniques related to quality", "Last 1/2 to 2/3 of the course we cover up to 4 cases designed by the Waterloo Cases in Design Engineering.", "We will be using case studies prepared with the help of the Waterloo Cases in Design Engineering team.", "In each of the case studies you will be solving a quality problem or designing a quality management system.", "Case studies have been shown to help students develop skills in problem solving, using qualitative and quantitative methods problem solving, dealing with complex situations and dealing with ambiguities.", "We will discuss more about the exact format for our case study discussion and the case study reports as the term moves forward.", "My goal to make the case study portion of our course a fun and exciting way to learn and apply quality engineering concepts.", "Introduction to Statistical Quality Control, (8th edition).", "Notice of Recording", "Email Correspondence", "In the case the question is deemed of interest to multiple individuals.", "As a reminder of this honor code, you will be asked for every homework assignment to aﬃrm the following statement “I have neither given nor received aid on this homework assignment, nor have I concealed a violation of the Honor Code.”", "In‐person Lectures Except in Case of Medical Need", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 91, "course_code": "NE 352", "course_name": "NE352 - Surfaces and Interfaces (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 11:20AM RCH 105", "08:30AM - 09:50AM RCH 105", "Surfaces and interfaces in microelectronics and nanofabrication.", "Capillary phenomena and molecular self-assembly.", "Describe the origin of a variety of interfacial phenomena", "Calculate surface/interfacial forces and potential energies of micro- and nano-scale systems", "Design experiments to measure interfacial tension, including the selection of appropriate tools", "Analyze experimental data to determine surface characteristics", "Design surfaces to create stable or unstable dispersions", "4 Sept 25th 3 Electric double layer: Poisson-Boltzmann, Gouy-Chapman-Stern theories", "10 Nov 6th 6 Polymers and surfaces, adsorption phenomena, stabilization vs. flocculation mechanisms", "13 Nov 27th 8 Surface area and pore-size analysis", "I encourage you to buy one of these as it will be helpful for future reference.", "Intermolecular and Surface Forces, By Jacob N. Israelachvili, 3rdedition", "Intellectual property includes items such as:", "Graduate Attribute Program Indicators", "A knowledge base for engineering: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "1a Demonstrate understanding of concepts in mathematics.", "1b Demonstrate understanding of concepts in natural science.", "1c Demonstrate understanding of engineering fundamentals.", "1d Demonstrate understanding of specialized engineering knowledge.", "2. Problem Analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "3a Create investigative studies of complex engineering problems.", "3b Gather information from relevant sources to address complex engineering problems.", "4. Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "4a Define design requirements and specifications for complex, open-ended engineering problems.", "4b Critically evaluate and compare design choices.", "7. Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "8a Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Impact of Engineering: An ability to analyze social and environmental aspects of engineering activities.", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "10a Identify ethical and unethical behavior in professional situations.", "10b Identify how an engineer is accountable to multiple stakeholders in engineering practice.", "Life-long Learning: An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge.", "12a Identify gaps in their knowledge, skills and abilities."]}, {"course_id": 92, "course_code": "NE 451", "course_name": "NE451 - Simulation Methods (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Simulation Methods Fall 2024", "10:00AM - 11:20AM RCH 105", "08:30AM - 09:50AM DWE 3518", "This course provides an introduction to and an overview of computational methods that are currently employed for the simulation of structural and bulk properties of matter, particularly as applied to physical and biological systems at the nanometer scale.", "Topics to be covered in this course include energy functions and force fields, geometry optimization, normal mode analysis, and reaction--path techniques at the molecular level, and an introduction to the simulation of static and dynamic properties of substances via both Monte Carlo and molecular dynamics (MD) methodologies.", "Simulation Methods is a comprehensive course that covers a wide range of computational techniques used to simulate the structural and bulk properties of materials in physical and biological systems at the nanometer scale.", "By mastering these techniques, students can contribute to advancements in materials science and engineering, enabling them to tackle complex challenges in nanoscale materials research.", "In addition to theoretical concepts, each module includes a lab component where students gain hands-on experience with different software, practical simulation applications, and coding examples.", "This practical approach helps students apply the learned concepts to real-world material systems and build their computational skills", "Analyze and articulate the benefits and drawbacks of different computational methods", "Use High-performance computing for materials design", "Choose suitable computational approaches for addressing specific material properties and processing challenges", "Critically assess scientific literature that employs computational techniques", "Foundations and Theorems of DFT: Including the Hohenberg-Kohn Theorems.", "Kohn-Sham Method and Cycle: Understanding the Kohn-Sham approach and its practical applications.", "Exchange-Correlation Approximations: Various methods for approximating exchange-correlation.", "Basis Sets and Pseudopotentials: Gaussian and plane wave basis sets, and the theory of pseudopotentials.", "Module 2: Molecular Dynamics Simulation", "Newtonian Dynamics and Interaction Potentials: Basic principles and types of potentials (e.g., pair, Tersoff, ionic).", "MD Simulation Algorithms: Various algorithms such as Verlet, leapfrog, and Beeman's algorithms.", "Thermodynamic Equilibrium and Ensemble Averages: Concepts of equilibrium, ensemble averages, and thermostat methods.", "Boundary Conditions and Pressure Control: Handling boundary conditions and controlling pressure in simulations.", "Module 3: Introduction to Monte Carlo Method in Science and Engineering", "Basic Principles of Monte Carlo Methods: Introduction and foundational concepts.", "Metropolis-Hastings Algorithm: Including the simulation of the Ising model.", "Kinetic Monte Carlo Simulations: Basic principles and specific problems.", "Introduction to Graph Neural Networks (GNNs): Basics and importance in materials science.", "Structure and Function of GNN Layers: Including message passing and aggregation techniques.", "hands-on  Lab 3: Molecular Dynamics Simulations", "Internet connection Yes", "Linux Basic Commands", "Statistical Thermodynamics", "Required Software and Tools", "conda", "Quantum ESPRESSO", "LAMMPS Molecular Dynamics Simulator", "These assignments are designed to assess your ability to apply the skills and knowledge gained during the lab, reinforcing key concepts and contributing to your overall course grade", "Below are the key components of our assignment screening process:", "Identical submissions (whether it be", "This collaborative approach promotes a deeper understanding of the subject matter and nurtures critical evaluation skills among students.", "These tools allow students to run and test their programs efficiently, facilitating accurate assessments of their coding skills and simulation results."]}, {"course_id": 0, "course_code": "CHEM 121", "course_name": "CHEM121 - Physical and Chemical Properties of Matter (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Physical and Chemical Properties of Matter Fall 2024", "B. Power", "A first-year chemistry course for students in chemistry-based programs.", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "describe the energy levels of the H atom in terms of atomic orbitals and quantum numbers", "describe the electronic structure of atoms and justify the organization of the periodic table", "predict trends in the properties of the elements", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and understand molecular shape and stability in terms of electron count", "describe the behaviour and interactions of molecules in gases", "predict the effects of intermolecular interactions on the properties of gases and liquids", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "You must submit the University of Waterloo Verification of Illness (VIF) form  by emailing a clear scanned copy to bothyour instructor and science.advisor@uwaterloo.ca", "This course includes the independent development and practice of specific skills, such as problem solving in a chemical and scientific context.", "Library for research-based assignments"]}, {"course_id": 1, "course_code": "CHEM 121L", "course_name": "CHEM121L - Chemical Reaction Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Contact:  Drop in questions are welcome during the hours stated above.", "Questions sent in the wee hours of the morning, the day your report is due, may not receive a response in time!", "Record their name and contact information in your lab manual.", "The CHEM 121L course is an in-depth introduction to the chemistry laboratory environment and provides an opportunity to develop basic lab skills, as well as introducing some basic aspects of experimental design.", "Skillfully perform procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Determine appropriate tools for required accuracy of a given analysis", "Evaluate and follow scientific protocols, and modify them as required to complete an analysis, design and test experimental protocols", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Section", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "- studying cis and trans isomers", "Qualitative and Quantitative Analysis", "Introduction to Chromatography", "- quantify a cation using ion exchange", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 2, "course_code": "CHEM 125", "course_name": "CHEM125 - Chemical Reactions, Equilibria and Kinetics (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["CHEM 125 is a first-year Chemistry course for students in Chemistry-based programs.", "A first-year chemistry course for students in chemistry-based programs.", "Introduction to chemical equilibria.", "Describe the energy and entropy changes that accompany physical and chemical changes.", "Calculate the equilibrium constant for a reaction using the standard thermodynamic properties of reactants and products.", "Predict the direction of spontaneous change for a given set of initial conditions for a variety of chemical systems.", "Apply equilibrium principles to a variety of chemical reaction types including gas-phase reactions, acid-base reactions, precipitation reactions, complexation reactions and redox reactions.", "Analyze oxidation-reduction reactions and identify species being oxidized and reduced.", "Explain the basic construction of, uses of, and the differences between galvanic and electrolytic cells.", "CHEM 121 and CHEM 125 comprise a full-year course in introductory chemistry.", "Course Structure and Continuity Plans", "Chemistry Study Hall:  Starting the 2nd week of classes, there will be a first-year study hall on Tuesdays and Thursdays from 5:30 pm - 6:50 pm in STC 1012.", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 3, "course_code": "CHEM 125L", "course_name": "CHEM125L - Chemical Reaction Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and to modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Section", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- analysing real world samples and", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 4, "course_code": "CHEM 140", "course_name": "CHEM140 - Introduction to Scientific Calculations (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Introduction to Scientific Calculations Winter 2025", "jake.fisher@uwaterloo.ca", "The application of numeric computing software to perform basic calculations, data analysis, regression analysis, plotting of scientific graphs, data manipulation, and equation solving will be covered in this course, with an emphasis placed upon chemical and biochemical concepts and applications.", "These exercises draw on examples from chemistry, biochemistry, and other scientific disciplines, showcasing the many ways Excel can be used as a problem-solving and analytical tool for scientific investigations and tasks.", "Key Scientific and Analytical Concepts Covered:", "Overviews of the basic use and application of Excel", "Scientific plotting and graphs", "Advanced spreadsheet topics", "Statistical analysis in science", "Regression analysis in science", "Solving equations", "Basic calculus and algebraic operations", "Data exchange and manipulation", "Engage students in scientific exercises that enhance their understanding of concepts discussed in other courses.", "5 Session 04 Linear Regression Analysis Pre‐Lab Exercise 04 Friday, Jan 31, 2025 at 5:30 PM ET Friday, Feb 7, 2025 at 5:30 PM ET", "Excel Skills Test", "All In-Class Exercises can be found in the CHEM140 Course Notes and Exercises Manual", "Adobe Acrobat Reader", "Spreadsheet Skills Test 20%", "Please refer to the Introduction section of the CHEM 140 Course Notes and Exercises manual for details.", "Please refer to Electronic Submissions section of the CHEM 140 Course Notes and Exercises manual for details.", "Supporting documentation will be considered on a case by case basis.", "The pre-lab exercises will be accessible for a period of one week.", "Students are given one week to complete the pre-lab exercise and in-class exercises for a given Chem 140 session.", "A student must provide credible evidence that their in-class exercise was completed BEFORE the specified deadline.", "If a resolution between the student and teaching assistant cannot be found, the instructor will re-grade the entire in-class exercise, upon request of the student.", "There are no make-up Skills Test."]}, {"course_id": 5, "course_code": "CHEM 200", "course_name": "CHEM200 - Introduction to Laboratory Techniques (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Introduction to Laboratory Techniques Fall 2024", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Design experiments that highlight the theory and application of synthetic laboratory techniques", "Formulate an action plan within safety scenarios using material safety data", "Identify relevant information from scientific databases and peer-reviewed literature", "Learn and apply proven study strategies", "Create and peer review short writing pieces", "The seminar is held weekly, with different topics introduced each week; a more specific schedule can be found on LEARN.", "General Policies", "Safety scenarios in the lab assignment:", "Grading: TA should be contacted first; if concern not resolved, then please contact course instructor", "Expectation of the Students in the Lab", "General Information", "Students that cannot find a partner before the first lab session will be assigned a partner at the start of the first lab session.", "Students will be assigned to a locker the first lab session and continue working in that location throughout the term.", "Glassware and equipment must be cleaned after use (please refer to basic lab techniques for glassware cleaning procedures)."]}, {"course_id": 6, "course_code": "CHEM 212", "course_name": "CHEM212 - Structure and Bonding (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Structure and Bonding Spring 2024", "An introduction to the principles of chemical structure and bonding, with emphasis on their application to inorganic systems.", "Topics include atoms, orbitals, and periodicity; localized bonding models; symmetry and group theory; and molecular orbital theory.", "0.1 Improve general analytical and problem solving skills.", "0.2 Improve physical conceptualization and 3-dimensional visualization.", "1.1 Understand and use mathematical and graphical descriptions of atomic orbitals.", "1.3 Understand and use orbital models and effective nuclear charge in the description of polyelectronic atoms.", "1.4 Rationalize the physical origins of periodic properties and trends, and use these explanations predictively.", "2.1 Construct Lewis structures from molecular formulae and predict stereochemistry using the VSEPR model.", "2.2 Understand mathematical basis and properties underlying valence bond hybrid orbitals.", "2.3 Construct valence bond hybrid orbitals corresponding to observed geometries.", "3.1 Identify and mathematically define 3-D point symmetry operations.", "4.2 Construct MO energy level diagrams for diatomic and polyatomic species using manual and symmetry-defined approaches.", "Introduction MF&T Ch. 1", "a.   quantum mechanics and hydrogenic atoms", "Geometric structure and localized bonding models MF&T Ch. 3**", "a.   stereochemical nomenclature and drawing (also Appendix D", "b.   Lewis structures in the 3rd edition)", "d.   valence bond theory ***", "a.   molecular point symmetry", "Molecular orbital theory MF&T Ch. 5", "a.   homonuclear diatomics", "b.   heteronuclear diatomics", "c.   monocentric molecules", "d.   polycentric molecules", "Molecular models are useful for visualizing structures and symmetries.", "The most useful kits for inorganic chemistry allow the construction of trigonal bipyramidal and octahedral geometries, in addition to tetrahedral stereocenters.", "A 10-minute in-person quiz will be given at the end of each tutorial problem solving session.", "A 2.5-hour in-person final exam covering the entire course will be given during the final exam period, with times and conditions set by the Registrar.", "(5) Students who miss the final exam for legitimate reasons will write a make-up final exam following completion of an INC agreement.", "Normally, this make-up exam will be written by the second week of the following term in a special session scheduled by the Faculty of Science."]}, {"course_id": 7, "course_code": "CHEM 220", "course_name": "CHEM220 - Intro Analytical Chemistry (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Intro Analytical Chemistry Fall 2024", "09:30AM - 10:20AM EXP 1689", "10:30AM - 11:20AM EXP 1689", "C2-275A", "For issues regarding grades/absences please email Stacey", "Emphasis on planning and decision-making in the analytical process.", "Introduction to Analytical Chemistry Chapter 1: 1-13", "Significant Figures", "Experimental Error", "Statistics", "Statistical Analysis", "Calibration Methods", "Calculations in Statistics and Calibration Methods", "Gravimetric and Combustion Analysis", "Monoprotic and Polyprotic Acid-Base Equilibria", "Gravimetric and Chemical Equilibria Problems", "Titrations – Introduction", "Instrumentation for Spectroscopy", "Absorption Spectrometry", "Fluorometry", "Introduction to Analytical Separations Chapter 29: 821-855 Work on Questions at end of course notes and provided on OWL platform.", "870-882", "Electrochemistry and", "Electroanalytical Techniques", "Applications of Analytical Chemistry", "Applications of Analytical Chemistry", "Students who do not write a test and who do not provide a valid reason, will have that test recorded as zero.", "Students who miss a test with an approved absence will not be provided a make-up test.", "Additional practice problems can be found at the end of each section of course notes.", "Notice of Recording", "Suggested practice problems will be posted via the textbook online system and at the end of each section of course notes.", "This course focusses on the independent development and practice of specific skills related to analytical chemistry.", "Intellectual property includes items such as:"]}, {"course_id": 8, "course_code": "CHEM 220L", "course_name": "CHEM220L - Quantitative Chemical Analysis Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Quantitative Chemical Analysis Laboratory Fall 2024", "08:30AM - 11:20AM C2 273", "08:30AM - 11:20AM C2 273", "Stacey Lavery", "C2-275A", "Feel free to email and set up a meeting.", "Please make sure to email the GC and HPLC TAs for questions regarding those experiments.", "Basic analytical principles are illustrated through chemical analysis of several “unknown” samples.", "Be familiar volumetric titrations, gravimetric analysis, spectrophotometry, gas and liquid chromatography", "Sept. 24-26", "Oct. 22-24", "Values submitted with a greater number of significant figures than required will have one mark deducted from the accuracy mark.", "Values submitted with less significant figures than required will be assigned a grade of 3/10 until the correct values are submitted.", "Resubmissions will result in a one-mark deduction from the newly assigned mark.", "This course focusses on the independent development and practice of specific skills related to analytical chemistry.", "Intellectual property includes items such as:"]}, {"course_id": 9, "course_code": "CHEM 221", "course_name": "CHEM221 - Multi-Component Analysis (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Introduction to Analytical Chemistry: Multi‐component analysis Winter 2025", "CHEM 221", "08:30AM - 09:50AM PHY 150", "•   Alexander Sweett", "Emphasis on planning and decision-making in the analytical process."]}, {"course_id": 10, "course_code": "CHEM 233", "course_name": "CHEM233 - Fundamentals of Biochemistry (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Evgeniy Panzhinskiy", "Additional office hours can be booked in person or online upon request", "The fundamental chemical and physical properties of amino acids, nucleic acids, carbohydrates and lipids are then discussed in detail.", "The organization of these building blocks into more complex structures such as proteins, enzymes, polynucleotides, polysaccharides, and biological membranes will be described.", "The structure and function of representative proteins such as myoglobin and hemoglobin and enzymes such as chymotrypsin will also be discussed.", "Applications and importance of the above to real world situations will be provided.", "Develop an understanding of the importance of aqueous solutions in biochemical processes.", "Understand the basic thermodynamic principles that govern the chemistry of biological processes in both qualitative and quantitative examples", "Calculate a charge of amino acids and proteins as a function of pH", "Analyze the kinetic properties using the Michaelis-Menten model of enzyme kinetics", "Draw the organic mechanisms for representative enzyme catalyzed reactions", "Unerstand simple carbohydrate chemistry and some representative glycoprotein and glycolipid structures as well as their functions", "Illustrate chemical basis of nucleotide pairing and identify different structural forms of DNA and RNA", "Predict the flow of information from DNA to RNA", "Compare the structure and physical properties of lipids and fatty acids, and understand their role in the formation of membrane bilayers", "Take all the information learned this term and develop a deeper understanding of the chemical processes that lead to life as we know it", "Suggested supplementary reading in \"Biochemistry Free for All\" (BFA)", "VVP Chapter 1.3 Thermodynamics", "BFA: Introduction: Basic Chemistry, pages 25-31", "BFA: Introduction: Water and Buffers, pages 34-49", "VVP chapter 3 Amino Acids and Polypeptides", "VVP Chapters 4.1 - 4.3 Secondary, Tertiary and Quaternary Structure", "BFA: Protein Structure: pages 74-108", "VVP Appendix A.1 and A.2", "BFA: Basic Techniques: pages 857-870, 894-895", "Week 6: Protein folding and Introduction to hemoglobin", "VVP Chapter 4.4 Protein Folding and Unfolding", "Week 8: Enzyme Kinetics", "BFA Catalysis Basic Principles: pages 337-380", "BFA Mechanisms: pages 381-395", "BFA Structure and Function of Carbohydrates: pages 190-217", "BFA Structure and Function of Nucleic Acids: pages 167-189", "BFA Structure and Function of Lipids: pages 222-233; Membranes: pages 269-336", "A virtual textbook can be found at https://bio.libretexts.org/Bookshelves/Biochemistry/Fundamentals_of_Biochemistry_(Jakubowski_and_Flatt)", "Notice of Recording", "Emails can be received 24 hours per day.", "This official verification is necessary before any action can be taken.", "Students should carefully consider the wisdom of missing a test or an exam.", "Expectation of Academic Integrity", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 12, "course_code": "CHEM 250L", "course_name": "CHEM250L - Physical Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM C2 168", "jake.fisher@uwaterloo.ca", "02:30PM - 05:20PM C2 168", "jake.fisher@uwaterloo.ca", "08:30AM - 11:20AM C2 168", "jake.fisher@uwaterloo.ca", "02:30PM - 05:20PM C2 168", "jake.fisher@uwaterloo.ca", "E-mail:   jake.fisher@uwaterloo.ca", "Students will be introduced to techniques and instruments used in modern chemical research.", "Selected experiments include topics such as the examination of binary-liquid systems, the spectrophotometric determination of the pKa, determination of dissociation constants via conductivity, oxygen bomb calorimetry, and an experimental examination of quantum mechanics.", "To provide the fundamental knowledge and practical experience in the area of physical chemistry.", "To gain an appreciation and understanding of the more complex problems", "A", "B", "C", "D", "E", "F", "I", "Sept 24 Sept 26", "I", "A", "B", "C", "D", "E", "F", "I", "A", "B", "C", "D", "E", "F", "Oct 22 Oct 24 G H I J A B C D E F", "I", "A", "B", "C", "D", "C", "D", "E", "F", "I", "A", "B", "Please refer to the Introduction section of the CHEM 250L Laboratory Manual for details.", "Email a scanned copy of the VIF to the laboratory instructor.", "Supporting documentation will be considered on a case by case basis.", "Equations should be created using the Equation Editor found in MS-Word or a comparable equation editor.", "Re-grading Reports:  If there a concern related as to how a lab report was graded, the student should first consult the teaching assistant responsible for marking the report.", "If a resolution between the student and teaching assistant cannot be found, the laboratory instructor will re-grade the entire report."]}, {"course_id": 13, "course_code": "CHEM 254", "course_name": "CHEM254 - Introductory Chemical Thermodynamics (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["08:30AM - 09:20AM", "RCH 306", "B. Power", "Instructor: Bill Power", "An introduction to the first, second, and third laws of thermodynamics and the application of these laws to ideal systems, mixtures, and chemical reactions.", "Thermodynamic principles are used to study changes in state, including phase changes, and to establish the link between the equilibrium constant and the properties of the substances involved in a chemical reaction.", "This course is a basic introduction to thermodynamics with emphasis on applications in chemistry.", "The course provides the necessary background to study changes in state of many physical and chemical systems.", "Define and apply the four laws of thermodynamics", "Identify, describe and ultimately design a variety of physical and chemical systems through their internal changes and/or interactions with their surroundings", "Quantify internal energy U, heat q, work w, enthalpy H, entropy S and Gibbs energy G in that same variety of physical and chemical systems", "Predict spontaneous change in systems of varying complexity", "Explain and quantify transformations involving both pure substances and mixtures using thermodynamic concepts", "There will be online and in-class assignments, on a rotating interval of about two weeks.", "It will occur in a 2.5 hour time slot sometime between April 9 and April 25 (I have no control over this scheduling).", "I will have a copy on reserve in the library (https://www.reserves.uwaterloo.ca/ares/ares.dll?Action=10&Form=50&Value=222108) and the price listed here is for a one-year electronic subscription.", "In addition, I have prepared a number of narrated powerpoint lectures, which I hope you will find useful in learning the material.", "Each lecture also has notes that provide written transcripts of what I am speaking, in case that helps you to learn some of the terms.", "One will be tutorial assignments which you will complete the first half of the problem individually, then work on an extension of the problem in groups of 4.", "CHEM 254 - Winter 2025 | General | Microsoft Teams", "I will provide any materials there as well as on LEARN, just in case one or the other has access issues.", "Four of the assignments, involving both individual and group work in a team-based learning (TBL) format, should help you to be able to assess different thermodynamic systems and learn to use the appropriate thermodynamic tools.", "The other four assignments, to be completed individually and much broader in scope and effort required, will help you to apply those skills to more complex and realistic physical and chemical systems.", "These may cover several chapters at a time.", "This course includes the independent development and practice of specific skills, such as problem solving in a chemical and scientific context.", "Library for research-based assignments"]}, {"course_id": 14, "course_code": "CHEM 264", "course_name": "CHEM264 - Organic Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Structure and bonding in organic chemistry.", "Isomerism and stereoisomerism in organic compounds.", "Name basic organic molecules", "Draw resonance structures and identify major and minor contributors.", "Draw organic molecules in three dimensions and identify the lowest and highest energy conformations.", "Understand the reactivity of a variety of molecules containing a variety of functional groups.", "Nomenclature: 2.1- 2.3", "Chapter 1.1 and 1.3", "Module 6 Acids and Bases", "Module 6 Acids and Bases", "Held in OPT 347", "Oct. 21", "Held in OPT 347", "Exam Period** Comprehensive Exam All course material", "Organic Chemistry I & II: A Live Interactive Textbook Textbook Yes", "When you sign into the textbook, you will see the chapter models in the left window.", "If a student posts a question in the Ace dialog box, students engage in a private conversation with the AI agent.", "In these conversations, Ace can have a back-and-forth with a single user, and that conversation will only be visible to the poster.", "Molecular Modelling Kits: Students are encouraged to use molecular modeling kits during tests and exams.", "The SUO schedules make-up exams.", "After 1 year, the INC converts"]}, {"course_id": 15, "course_code": "CHEM 265", "course_name": "CHEM265 - Organic Chemistry 2 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM RCH 305", "09:30AM - 10:20AM RCH 112", "Aromaticity and simple MO theory of conjugated systems.", "Applications of spectroscopic techniques in organic chemistry.", "The emphasis of this course is on the development of problem-solving skills in the context of structure elucidation, synthesis and mechanism of reaction of organic compounds.", "This course aims to reinforce the fundamental aspects of organic chemistry and show how these can be used to explain physical properties and reactivity patterns of organic molecules.", "To understand the mechanisms of common reactions of carbonyl containing compounds.", "Here are some tips to ensuring you do not violate this policy:", "Do not “snip” drawings from online sources, either draw them yourself using a chemical drawing program or by hand.", "Notice of Recording", "Here are some tips to ensuring you do not violate this policy:", "Do not “snip” drawings from online sources, either draw them yourself using a chemical drawing program or by hand."]}, {"course_id": 16, "course_code": "CHEM 265L", "course_name": "CHEM265L - Organic Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "Design experiments that highlight the theory and application of synthetic laboratory techniques and select organic reactions from CHEM 264 and 265", "Analyze experimental data including experimental properties and spectroscopic data obtained in the lab or provided by the instructor to draw conclusions about the experiment", "Safety glasses can be re-used from a previous course as long as they cover the front and sides of the eyes or can be purchased from any available source ($5-30).", "The plan of action for each unit is due the first day you plan to start that unit.", "Prelab notebook work for each unit is due the first day you plan to start that unit.", "Illness and Short-Term Absence Policies:", "Students can not use the 48-hour short term absence to miss a laboratory session.", "Students that cannot find a partner before the first lab session will be assigned a partner at the start of the first lab session.", "Students will be assigned to a locker the first lab session and continue working in that location throughout the term.", "Glassware and equipment must be cleaned after use (please refer to basic lab techniques for glassware cleaning procedures)."]}, {"course_id": 17, "course_code": "CHEM 313L", "course_name": "CHEM313L - Inorganic Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["CHEM 313L", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "E-mail:   ch2siu@uwaterloo.ca", "Introduction to synthetic inorganic chemistry.", "Students will be introduced to techniques and instruments used in modern chemical research.", "Selected experiments include topics such as molecular orbital calculations of fullerenes and the syntheses and characterization of quantum dots, high-temperature superconductors, and silicon compounds.", "Provide the student with the fundamental knowledge and practical experience in the area of inorganic chemistry", "Gain an appreciation and understanding of the more complex problems in which they may encounter further in their future chemistry careers", "Illustrate the principles and theories of structure and bonding of inorganic compounds", "Syntheses of Silicon Compounds", "Molecular Orbital and Infrared Spectra Calculations of a Lewis Acid:Base Adduct BF3:NH3", "Molecular Orbital Calculation and Electrochemistry of Fullerenes", "Syntheses and UV-Vis of ZnS Quantum Dots", "Solid State Synthesis of High-Temperature YBa2Cu3O7-d (0 < d < 0.5) Superconductor"]}, {"course_id": 18, "course_code": "CHEM 356", "course_name": "CHEM356 - Introductory Quantum Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Introductory Quantum Mechanics Fall 2024", "Historical background; the differential equation approach to quantum mechanics; treatments of solvable problems such as the particle-in-a-box, harmonic oscillator, rigid rotator and the hydrogen atom; introduction to approximation methods for more complicated systems.", "This theoretical framework will lead us to understand deeply some very basic concepts in chemistry and physics.", "In this course we will focus on model problems that can be solved with 'relatively little' effort and which illustrate the nature of the quantum world and will introduce you to thinking 'quantum'.", "Moreover these simple models often lead to surprisingly quantitative understanding of observed excitations of atoms, molecules and materials.", "A major theme concerns the electronic structure of atoms and simple molecules.", "Operator techniques will be introduced as a powerful tool to solve a variety of problems in an elegant and uniform manner.", "It contains short summaries (Mathchapters) of mathematical methods that can serve as either brief reviews of or introductions to the material.", "Problems and Solutions for McQuarrie's Quantum Chemistry,", "A free pdf of the McQuarrie book is available here", "Understand the essential formulation of quantum mechanics: States, Superpositions, Eigenstates, Operators, Probabilities.", "Understand (at a basic level)", "History: Relativity, Planck’s radiation law, Einstein Photo-electric effect,", "Time-dependent Schrödinger equation and Ehrenfest theorem.", "Variational principle and basis set expansions, matrix formulations quantum mechanics.", "Problems and Solutions for McQuarrie's Quantum Chemistry,ISBN 9781891389528 This is a solution manual for problems in McQuarrie No", "In particular we will discuss the postulates of quantum mechanics and their 'ensemble Interpretation'.", "There will also be a handout discussing the most basic H atom, using angular momentum theory in operator form.", "I plan to introduce a section on quantum computing.", "TBA"]}, {"course_id": 19, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 20, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 22, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 23, "course_code": "PHYS 111", "course_name": "PHYS111 - Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["An introduction to physics for students intending to concentrate their further studies in biology, dentistry, medicine and paramedicine; includes particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.", "The main physics principles and laws covered in PHYS 111 include: “Particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.”", "PHYS 111 focuses on basic physics principles and laws, on conceptual understanding and problem-solving skills, and an appreciation for the power of physics in explaining how nature works, in the contexts of both the physical and life sciences.", "Physics Principles and Laws: By the end of the course, students will be able to construct scientifically sound explanations of a variety of basic physical phenomena by applying basic physics principles/laws.", "define linear momentum, and calculate and compare momenta of various real-life objects;", "define and calculate impulse, and establish the conditions for conservation of linear momentum; and", "apply the laws of conservation of momentum and energy to collisions.", "Problem-Solving Skills and Strategies: By the end of the course, students will be able to creatively apply a variety of structured problem-solving strategies:", "interpret, visualize and convert the problem into a physical model (e.g., draw a free body diagram);", "evaluate the result — does it make sense?", "These problem-solving skills are useful in the students’ own disciplines and beyond.", "More detailed information about the course elements which contribute to the final grade will be given in the learn sight and in future outline updates", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 24, "course_code": "PHYS 111L", "course_name": "PHYS111L - Physics 1 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "Derin Erisoglu-Akyildiz", "Saba Karimi", "Do Yun Park", "jbschrie@uwaterloo.ca", "s38karim@uwaterloo.ca", "first for minor issues", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "12 & 13", "Complete end-of-term surveys before Dec. 3", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 25, "course_code": "PHYS 121", "course_name": "PHYS121 - Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["An introductory course in physics for students intending to concentrate their future studies in the physical sciences, optometry, or mathematics; includes vectors (dot and cross products), particle kinematics and dynamics, forces in nature, work and energy, conservation of energy and linear momentum, rotational kinematics and dynamics, and conservation of angular momentum.", "Doing Physics - quantities, dimensions, units", "Point Dynamics - force, motion, Newton's laws", "Conservation of Energy - work and energy, conservative systems", "Conservation of linear Momentum - momentum and systems of particles", "Understand the following concepts:", "- Linear kinematics: the relationship between distance, velocity and acceleration.", "- Linear dynamics: a consequence of forces and momentum, and how they interrelate.", "- Kinetic energy, potential energy, work, and their interrelationships.", "We will also re-examine these concepts in a rotating coordinate frame using angular kinematic variables along with torque and angular momentum.", "6 Module 06:  Kinetic and Potential Energy", "7 Module 06:  Kinetic and Potential Energy", "8 Module 07:  Linear Momentum", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- eText + Student Access Code", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- Print Format + Student Access Code"]}, {"course_id": 26, "course_code": "PHYS 121L", "course_name": "PHYS121L - Mechanics Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Mechanics Laboratory Fall 2024", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "Julian Meunier", "Soorna Choheili", "Reza Asadi", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "complete introductory surveys", "complete introductory surveys,", "Complete end-of-term surveys", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 27, "course_code": "PHYS 112", "course_name": "PHYS112 - Physics 2 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:30AM - 11:20AM DC 1350", "S. Idziak", "08:30AM - 09:20AM", "Email: idziak@uwaterloo.ca", "Email: james.forrest@uwaterloo.ca", "A continuation of PHYS111; includes simple harmonic motion, electrostatic force and potential, electric current and power, DC circuits, magnetic field and induction, wave motion, sound, and optics.", "To develop the ability to solve problems in areas related to oscillations and waves, electricity and magnetism, and optics", "Understand physical concepts associated with oscillations, waves, sound, electricity and magnetism, and optics", "Apply concepts of force and energy and recognize when acceleration is not constant", "Solve simple physical systems using physical concepts", "Draw relevant sketches from information given in word problems", "Develop physically relevant equations from information given in word problems", "Convert complex problems into a series of sub-problems and solve", "Topic Textbook Chapters                                                                            Number of lectures", "Electric Forces & Fields (Serway) Chapter 15: 1-5", "Electric Potential & Energy (Serway) Chapter 16", "Current and Resistance (Serway) Chapter 17: 1-6", "Magnetic Flux & Induction   1", "College Physics: A Strategic Approach by Jones, Knight, and Field This was suggested for 111.", "I do not find that these books are great but they are available for no cost.", "Please help to create a welcoming and inclusive environment.", "An exam-like problem will be posted each week on LEARN.", "2 points will be given for each clicker response with an additional 1 point for each correct response.", "What happens if I join the course late:", "Missed a regular assignment:", "Emails can be received 24 hours per day.", "Remember that falsely claiming you are ill can result in academic polices per Policy 71.", "Email communications:", "Notice of Recording"]}, {"course_id": 28, "course_code": "PHYS 112L", "course_name": "PHYS112L - Physics 2 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Sean Dougherty", "Aney Kapadia", "Kayra Erisoglu-Akyildiz", "jbschrie@uwaterloo.ca", "s2doughe@uwaterloo.ca", "Course Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"'", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 3 - Circuits", "Experiment 4 - Circuits", "Experiment 5 - Circuits", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 29, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 30, "course_code": "PHYS 122L", "course_name": "PHYS122L - Waves, Electricity and Magnetism Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 2 - Circuits", "Experiment 5 - Magnetic Fields of a Coil", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 31, "course_code": "CHEM 266", "course_name": "CHEM266 - Basic Organic Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "11:30AM -", "Structure, nomenclature, and reactions of important classes of organic compounds.", "Stereochemistry and its role in reaction mechanisms.", "Name basic organic molecules", "Draw resonance structures and identify major and minor contributors", "Identify and describe the acidity and basicity of various molecules", "Draw organic molecules in three dimensions and identify the lowest and highest energy conformations", "Describe the stereochemical relationship between different molecules", "Explain chemical reactions using energy diagrams", "Understand the reactivity of a variety of molecules containing a variety of functional groups", "Molecular Modelling Kit No", "Notice of Recording"]}, {"course_id": 32, "course_code": "CHEM 266L", "course_name": "CHEM266L - Organic Chemistry Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["CHEM 266L", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "CHEM 266L 006", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Answers can be expected within 24 hours.", "Piazza is available for clarification questions but I will only provide quick answers as I prefer having longer conversations in person.", "View requirements for CHEM 266L", "Topics include acid-base chemistry, substitution reactions, Grignard reactions, liquid-liquid extraction, product isolation and purification.", "Be proficient with basic organic laboratory techniques including selecting proper glassware, measuring small and large quantities of solids and liquids, designing the setup required for simple synthetic reactions, filtration, and basic characterization.", "Understand and be able to design and execute a liquid-liquid extraction processes for the separation of ionizable acidic, ionizable basic, and non-ionizable (neutral) substances.", "Demonstrate independent thinking by answering questions in your own words, showing critical reflection beyond the initial description of observations and facts.", "Laboratory performance marks will be given by the Teaching Assistants and Lab Instructor and averaged for each in-person lab period.", "This is not directly the case; we do expect students to need a lot of clarifications when working in the lab for the first time.", "Laboratory Worksheets and Reports", "Questions similar to the pre-laboratory quizzes and reports will be used, but may be modified to be multiple choice.", "Human rights must be centered in our pedagogical practice to ensure students feel safe and respected into our instructional spaces.", "We also acknowledge that speaking of underrepresented groups in Science is a misnomer and we should speak of historically excluded persons as Black, Indigenous, Queer and Persons of Colour have contributed to chemical research since the inception of the field.", "Scheduling issues", "General Policies", "Aside from LEARN, we will use various software to facilitate the delivery of the laboratory.", "Important note: Since the manual is printed months before delivery of the lab, we may need to make corrections during the term.", "Expectation of Academic Integrity", "Be especially careful with sharing diagrams and mechanisms, as we often detect excessive collaboration when students share images.", "None-the-less all violations of academic misconduct will be dealt with be taken seriously and dealt with according to the consequences outlines in Policy 71."]}, {"course_id": 33, "course_code": "CHEM 267", "course_name": "CHEM267 - Basic Organic Chemistry 2 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["A continuation of the concepts of CHEM266, including material on amines, aromatics, enols and enolates, and nucleophilic addition and substitution at the carbonyl group.", "Introduction to nuclear magnetic resonance and infrared spectroscopy.", "CHEM 267 is a continuation of the study of fundamental aspects of organic chemistry begun in CHEM 266.", "The emphasis of the course is on the development of problem solving skills in the context of reaction mechanisms, structure-reactivity relationships and structure elucidation.", "The course will require you to understand why some molecular features lead to certain reactivity patterns and use that knowledge to make sound predictions in different but related systems.", "Topics include a description of chemical and physical properties of carbonyl, aromatic, and nitrogen compounds and an introduction to spectroscopic methods for the identification of organic molecules.", "Identify reagents and reaction conditions for the preparation of simple organic molecules.", "Explain synthetic pathways and devise simple synthetic strategies for the preparation of organic compounds", "Analyze IR and NMR spectra to identify simple organic compounds", "Introduction", "Conjugated p systems", "Reaction of Aromatic compounds", "Reaction of Aromatic compounds", "- Amines", "- Reaction of Aromatic compounds - Amines", "- Aldehydes and ketones", "CH 21.4.6 & 21.4.7", "Aldehydes and ketones", "Condensations and Alpha Substitutions of Carbonyl Compounds", "Condensations and Alpha Substitutions of Carbonyl Compounds", "- Condensation", "- Amines", "When you sign into the Textbook, you will see the chapter models in the left window.", "Purchase online or entering an access code purchased at your campus bookstore**", "Solving problems–making connections–and recognizing patterns are key steps to succeeding in this Course.", "Drop one midterm", "(closed-book)", "Comprehensive Final Examination: There will be a 2.5-hour exam held during the exam period and scheduled by the Registrar's Office.", "The final is a closed-book exam.", "If you become ill while away from the University and miss a test or an exam as a result of that illness, then you may supply a Doctor’s certificate covering the precise period of absence, provided the certificate includes a classification of the illness as slight, moderate, or severe.", "Students should carefully consider the wisdom of missing a test or exam."]}, {"course_id": 34, "course_code": "CHEM 267L", "course_name": "CHEM267L - Organic Chemistry Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Answers can be expected within 24 hours.", "Experiments include the reduction of vanillin; an electrophilic aromatic substitution; the synthesis of a fragrant ester using Fischer esterification and preparation of a fluorescent laser dye, 3-acetyl-7-(diethylamino)-2H-1-benzopyran-2-one.", "The organic chemistry laboratory provides students with opportunities to carry out some of the organic synthesis reactions encountered in CHEM 267 in a real-world experience.", "Additionally, students will become versed in several basic organic chemistry laboratory techniques including: liquid-liquid extraction, distillation, one and two solvent recrystallization and melting point determination, to name a few.", "Be proficient with basic organic laboratory techniques including selecting proper glassware, measuring small and large quantities of solids and liquids, designing the setup required for simple synthetic reactions, filtration, and basic characterization.", "Understand and be able to design and execute a liquid-liquid extraction processes for the separation of ionizable acidic, ionizable basic, and non-ionizable (neutral) substances.", "Scheduling issues", "Fillable form online for Möbius support", "Laboratory performance marks will be given by the Teaching Assistants and Lab Instructor and averaged for each in-person lab period.", "To receive 10/10 in performance this term you must show self-sufficiency by either replacing empty acetone bottles at the sink, refilling the DI water, letting your TA know the bottles at your workstation need a top-up and cleaning shared areas beyond your own.", "This is not directly the case; we do expect students to need a lot of clarifications when working in the lab for the first time.", "Laboratory Worksheets and Reports", "General Policies", "Aside from LEARN, we will use various software to facilitate the delivery of the laboratory.", "Important note: Since the manual is printed months before delivery of the lab, we may need to make corrections during the term."]}, {"course_id": 35, "course_code": "CHEM 209", "course_name": "CHEM209 - Introductory Spectroscopy and Structure (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Introductory Spectroscopy and Structure Fall 2024", "11:30AM - 12:20PM RCH 309", "Email: afkennywilby@uwaterloo.ca", "The nature of electromagnetic radiation and an elementary outline of quantum mechanics in one dimension.", "For each of microwave, infrared, Raman, electronic, photoelectron, and nuclear magnetic resonance spectroscopy, the nature of the molecular energy levels involved and the type of molecular information that can be obtained using it are examined.", "Understand the electromagnetic spectrum and the energies, frequencies and wavelengths that characterize it; understand and apply the wave-particle duality of light and the concept of photons", "Recognize the various types of quantized energy in atomic and molecular systems and know their origins", "Understand basic molecular orbital theory for simple molecules, and the descriptions of symmetry applied to them", "Understand and apply the concepts of spectroscopy as an interaction between light and matter, including the Bohr resonance condition; Interpret atomic spectra in terms of the underlying structure of atoms in modern quantum theory", "Assign, interpret and predict the spectra arising from molecules interacting with electromagnetic radiation ranging from microwaves for molecular rotations, infrared for molecular vibrations, visible-ultraviolet for electronic transitions, to X-rays for photoelectronic transitions from molecular core orbitals", "Introduction to Spectroscopy (4 weeks): The electromagnetic spectrum, photon theory of light, interaction of light and molecules.", "Review of molecular orbital theory and electronic structure.", "Spectroscopy involving those levels.", "Combination of rotation and vibration in diatomics.", "Ionization of core electrons.", "7. Nuclear magnetic resonance (NMR) spectroscopy (1 week): Basic theory and practical applications of NMR for simple molecules.", "An Introduction to Spectroscopy and Quantum Structure, by W. Scott Hopkins (Cambridge Scholars Publishing, 2023) Recommended reading material No", "Physical Chemistry: A Molecular Approach by Donald A. McQuarrie and John D. Simon", "They are mostly meant to keep you follow the material and understand fundamental concepts.", "Homework assignments are a longer and more involving set of problems and will be given after we finish a given course unit (or midway through for longer units).", "If missed, a weighted final exam grade will be used for a mid-term grade."]}, {"course_id": 36, "course_code": "CHEM 224L", "course_name": "CHEM224L - Analytical Instrumentation Laboratory (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Analytical Instrumentation Laboratory Spring 2024", "Stacey Lavery", "C2-275A", "I will be working from home Tuesdays and Fridays", "Experiment 4 Spectrophotometric Analysis of Manganese in Steel", "Analysis of Preservatives in the Food Industry", "Sharpie© or other marker appropriate for glassware", "Values submitted with a greater number of significant figures than required will have one mark deducted from the accuracy mark.", "Values submitted with less significant figures than required will be assigned a grade of 3/10 until the correct values are submitted.", "Resubmissions will result in a one-mark deduction from the newly assigned mark.", "(Please use the same online form for Resubmits and make a comment of “Resubmit” – do not email the instructor your new values.)", "Students must submit their reports via Crowdmark.", "The book will be reviewed and initialed at the end of each lab period.", "Grading will be based off of observed analytical technique in the lab, accuracy of their unknown analysis, and completion of a mock lab book during the exam period.", "*", "Prelab quizzes must also be completed in preparation of the lab period.", "o This course focusses on the independent development and practice of specific skills related to analytical chemistry.", "Intellectual property includes items such as:"]}, {"course_id": 37, "course_code": "CHEM 310", "course_name": "CHEM310 - Transition Element Compounds and Inorganic Materials (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["The inorganic, organic, and solid state chemistry of the d-block elements.", "The structure and physical properties of co-ordination compounds and transition metal containing solids.", "The role of transition metal organometallics in catalysis.", "The first (and major) part of the course will cover the chemistry and electronic structure of simple coordination compounds; the effects of ligand fields on magnetism, electronic spectra, substitution and redox behaviour will be examined.", "In the second part, the properties of transition metal containing solids will be discussed along with the uses of these systems in, for example, lasers, and heterogeneous catalysts.", "• Understand the important roles that transition metal inorganic chemistry plays in materials and biological processes;", "• Describe and explain the bonding inherent to transition metal inorganic complexes;", "• Discuss the impact and influence of the unpaired electrons in the d-block elements in the spectroscopic, optical and magnetic properties of the materials and proteins that contain them;", "• Apply basic crystal field and molecular orbital concepts to explain the structures of coordination complexes.", "Configuration of d-elements, d-orbitals and shapes of coordination complexes.", "Crystal field effects in transition metal chemistry.", "Module 2: Symmetry, group theory, and character tables for inorganic complexes.", "Metal-ligand σ and π-bonding, and the origin of the spectro-electrochemical series.", "Module 4: Optical and Magnetic properties of TM complexes.", "Electronic and charge-transfer spectra of transition metal ions.", "Magnetic behaviour of metal ions.", "Descriptive chemistry of various geometries and the complexes that form them.", "Reduction and oxidation chemistry of the transition metal elements", "Substitutions; thermodynamic and kinetic stability; mechanisms of redox reactions in proteins.", "Carbonyl complexes and metallocenes.", "In the case of a missed final, the final can be taken the next time the course is offered."]}, {"course_id": 38, "course_code": "CHEM 310L", "course_name": "CHEM310L - Inorganic Chemistry Laboratory 2 (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Synthesis of transition and non-transition metal compounds.", "Possess a strong base of fundamental knowledge and practical experience in the area of inorganic chemistry", "Use specific specialized techniques to synthesize a variety of transition metal compounds.", "Characterize various properties of synthesized transition metal compounds using a variety of instruments and techniques.", "Library for research-based assignments"]}, {"course_id": 39, "course_code": "CHEM 313", "course_name": "CHEM313 - Main Group and Solid State Chemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Main Group and Solid State Chemistry Winter 2025", "08:30AM - 09:20AM", "This course provides a detailed examination of the structure and bonding in main group and solid state compounds, including valence bond and molecular orbital theory for describing electronic structures, Hueckel and extended Hueckel approximations.", "Structures of simple solids, including close packing of spheres and derived ionic lattice types; aspects of chemical crystallography, Bravais lattices, point groups, space groups, crystal planes, and X-ray diffraction; Ionic interactions in gases and solution; the thermodynamics of acid-base interactions; descriptive chemistry and characterization of main group element compounds.", "Apply bonding theories to interpret experimentally observed trends in acid-base interactions", "Communicate the basic principles of solid state structures", "Understand X-ray diffraction and its application to structural analysis of solid state materials", "Estimate electronic structure of solids", "3 weeks of solid state symmetry and electronic structure"]}, {"course_id": 40, "course_code": "CHEM 323", "course_name": "CHEM323 - Analytical Instrumentation (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Analytical Instrumentation Fall 2024", "08:30AM - 09:50AM MC 4041", "Prof. Vassili Karanassios", "Office: C2-277 (often in the labm C2-265)", "Introduction to chemometrics and to computer interfacing.", "To know how to employ spectrochemical insrtumentation for chemical analysis", "Week 08 and Week 09 - CHAPTER 08 - FLAMES, SAMPLE INTRODUCTION & GRAPHITE FURNACE", "Week 10 - ICP-AES & PLASMA MINIATURIZATION", "Week  11 and Week 12 - ICP-MS & MINIATURIZATION IN MASS SPECTROMETRY", "This course includes the independent development and practice of specific skills, such as [chemical analysis].", "Library for research-based assignments"]}, {"course_id": 41, "course_code": "CHEM 331", "course_name": "CHEM331 - Fundamentals of Metabolism 1 (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Dara Gilbert", "Email: d2gilber@uwaterloo.ca", "First we will cover general principles of thermodynamics and high energy compounds ( NTPs, NAD(P)+ and fats).", "And some general principles of the energy metabolism and the regulation of metabolic pathways.", "draw the chemical structures of the intermediates in these pathways and use this information to understand and ever predict similar pathways in other organisms", "draw the chemical mechanisms of the enzymes involved in these metabolic pathways and to use that information to apply it to new systems and the synthesis of starting materials for synthesis.", "understand the interconnection of these pathways and the basis, of the regulation and coordination of these pathways.", "see how disruptions in these pathways lead to different disease states", "predict new uses of these pathways for the synthesis of useful compounds such as biofuels", "Week 8-9: Fatty acid oxidation and biosynthesis and cholesterol metabolism   J and F chapter 17 and 21", "I will be using the online textbook", "Notice of Recording", "Re-creating test questions and answers without the express permission of the course instructor"]}, {"course_id": 42, "course_code": "CHEM 333", "course_name": "CHEM333 - Metabolism 1 (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["09:30AM - 10:20AM DWE 2527", "First we will cover general principles of thermodynamics and high energy compounds ( NTPs, NAD(P)+ and fats).", "And some general principles of the energy metabolism and the regulation of metabolic pathways.", "understand the logic of the pathways by being able to draw the chemical structures of the intermediates in these pathways.", "draw the chemical mechanisms of the enzymes involved in these metabolic pathways and to use that information to apply it to new systems.", "understand the interconnection of these pathways and the basis, of the regulation and coordination of these pathways.", "week ART Reading VVP reading and practice problems MVH", "1: Introduction to metabolism, review of Energy Metabolic Energy (410-429)", "6: Electron transport and oxidative phosphorylation Energy: Electron Transport & Oxidative Phosphorylation (430-471)", "10: Integration and coordinated regulation of the pathways metabolic disorders Signalling (828-855)", "Biochemistry Free for All https://biochem.oregonstate.edu/undergraduate/educational-resources Yes", "Fundamentals of Biochemistry 5th edition by Voet, Voet and Pratt Yes", "Online quizzes   10% of final mark These will be a combination of multiple choice and written answers."]}, {"course_id": 43, "course_code": "CHEM 340", "course_name": "CHEM340 - Introductory Computational Chemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["CHEM 340", "jake.fisher@uwaterloo.ca", "An introduction to the theory and practice of computational methods used in chemistry, through the use of molecular modeling software.", "The investigation of the structure and behavior of various chemical systems, including topics such as electronic structure, geometry of molecules, calculation of potential energy surfaces for reactions, will be explored.", "The course introduces the students to molecular modeling tools by working through a series of exercises using the molecular modeling software, Gaussian (from Gaussian Inc.).", "Examples are drawn from many areas of chemistry, illustrating the kinds of information obtainable from molecular mechanics and molecular orbital computational techniques.", "The modeling concepts that will be acquired through the course include the following:", "creation of Z-matrices", "single point energy calculations versus geometry optimization.", "To introduce students to common molecular modeling software that they can use throughout their chemistry studies and more advance molecular modeling courses", "To engage the students in molecular modeling exercises that will complement and enhance their understanding of concepts being discussed in other classes", "2 Session 01 Introduction to Molecular Modelling", "Computational Project Proposal", "8 Session 05 Modelling in Solution", "Adobe Acrobat Reader", "Supporting documentation will be considered on a case by case basis.", "Equations should be created using the Equation Editor found in MS-Word or a comparable equation editor.", "Re-grading Hand-in Exercises:  If there a concern related as to how a hand-in exercise was graded, the student should first consult the teaching assistant responsible for marking the hand-in exercise."]}, {"course_id": 44, "course_code": "CHEM 350", "course_name": "CHEM350 - Chemical Kinetics and Statistical Mechanics (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Chemical Kinetics and Statistical Mechanics Winter 2025", "10:00AM - 11:20AM QNC 2502", "Basic chemical kinetics; treatment of kinetic data; complex reaction mechanisms; fast reactions; the canonical ensemble and the canonical partition function; statistical mechanics applied to chemistry; statistical theory of reaction rates.", "Describe the principles of the kinetic theory of gases, with particular emphasis on the Maxwell-Boltzmann distribution, and use these principles to interpret gas behaviour.", "Demonstrate a clear understanding of basic probability theory, using it to analyze and predict the behavior of microscopic systems.", "Employ the canonical ensemble framework to derive and utilize the canonical partition function, understanding how it connects microscopic states to macroscopic thermodynamic properties.", "Apply statistical mechanics methods to analyze chemical processes, illustrating the connection between partition functions and the equilibrium constant.", "Integrate this understanding with statistical theories (e.g., transition state theory) to predict rate constants and assess factors that influence reaction speed.", "Interpret and treat kinetic data using appropriate mathematical models, critically analyze multi-step reaction mechanisms, and employ the necessary approximations (e.g., initial velocities, steady-state approximation) to derive reaction rate laws."]}, {"course_id": 45, "course_code": "CHEM 350L", "course_name": "CHEM350L - Physical Chemistry Laboratory 2 (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["jake.fisher@uwaterloo.ca", "jake.fisher@uwaterloo.ca", "E-mail:   jake.fisher@uwaterloo.ca", "This advanced laboratory builds upon fundamental knowledge of physical chemistry gained in the introductory physical chemistry laboratory, CHEM250L. The experiments are designed to illustrate the principles and theories of thermodynamics, kinetics, spectroscopy, and quantum mechanics.", "CHEM 350L is an subsequent physical chemistry laboratory following the introductory physical chemistry laboratory, CHEM 250L.", "The student will be introduced to techniques and instruments used in modern chemical research.", "CHEM 350L consists of a series of experiments designed to illustrate the concepts and theories of thermodynamics, kinetics, spectroscopy and quantum mechanics.", "To provide the fundamental knowledge and practical experience in the area of physical chemistry.", "To gain an appreciation and understanding of the more complex problems", "A", "B", "C", "D", "E", "F", "I", "A", "B", "C", "D", "E", "F", "I", "A", "B", "C", "D", "E", "F", "I", "A", "B", "C", "D", "I", "A", "B", "C", "D", "E", "F", "I", "A", "B", "E", "F", "I", "A", "B", "C", "D", "E", "F", "I", "C", "D", "E", "F", "I", "A", "B", "C", "D", "E", "F", "Please refer to the Introduction section of the CHEM 350L Laboratory Manual for details.", "Email a scanned copy of the VIF to the laboratory instructor.", "Supporting documentation will be considered on a case by case basis.", "Equations should be created using the Equation Editor found in MS-Word or a comparable equation editor.", "Re-grading Reports:  If there a concern related as to how a lab report was graded, the student should first consult the teaching assistant responsible for marking the report.", "If a resolution between the student and teaching assistant cannot be found, the laboratory instructor will re-grade the entire report."]}, {"course_id": 46, "course_code": "CHEM 357", "course_name": "CHEM357 - Physical Biochemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Physical Biochemistry Winter 2025", "10:30AM - 11:20AM RCH 307", "B. Power", "Instructor: Bill Power", "The use of diffusion, ultracentrifugation, osmotic pressure, electrophoresis and X-ray diffraction to study the properties of biopolymers.", "This course is meant to provide you with a basic introduction to physical chemistry as applied to the life sciences with emphasis on applications in biochemistry.", "This course will cover the basics of thermodynamics and their applications to biological molecules and systems, their transport properties, chemical and enzyme kinetics, and physical techniques used to establish and investigate the structures of biological macromolecules.", "I will aim to provide you with all the background necessary to cover the many topics in this course, from entropy and thermodynamic principles from the 18th century to modern applications such as AI which resulted in half of the the 2024 Nobel Prize in Chemistry going to Google's DeepMind leaders Demis Hassabis and John Jumper for their development of AlphaFold, a protein structure database (of 220 million structures!).", "In return you should have some familiarity with the basics of biochemistry and biological structures and terminology, as well as some comfort working with derivatives, including partial derivatives, integrals and differential equations.", "Understand the four laws of thermodynamics and their applications to biological systems", "Understand the importance of Gibbs free energy and chemical potential in describing physical and chemistry transformations", "Understand the basics of chemical kinetics and rate laws and mechanisms", "Be able to characterize enzyme kinetics using the Michaelis-Menten description and describe competition and inhibition in such mechanisms", "Know how to apply and interpret structural tools such as optical and NMR spectroscopy, X-ray diffraction and computational tools to biological macromolecules", "There will be online and in-class assignments, on a rotating interval of about two weeks.", "It will occur in a 2.5 hour time slot sometime between April 9 and April 25 (I have no control over this scheduling).", "Weeks 1 to 3:   Thermodynamics, its Laws and its Applications", "Week 10:            Biomolecular Structure; Optical Spectroscopy", "Weeks 11 to 12: NMR Spectroscopy; X-ray Diffraction; AI Methods and AlphaFold", "We will cover much of this book, though perhaps not in detail in some sections, and it should be a useful resource.", "I will have a copy on reserve in the library (https://www.reserves.uwaterloo.ca/ares/ares.dll?Action=10&Form=50&Value=222107) and the price listed here is for a one-year electronic subscription (https://www.pearson.com/en-ca/subject-catalog/p/physical-chemistry-principles-and-applications-in-biological-sciences/P200000006771/9780137612826).", "This course includes the independent development and practice of specific skills, such as problem solving in a chemical and scientific context.", "Library for research-based assignments"]}, {"course_id": 47, "course_code": "CHEM 360", "course_name": "CHEM360 - Organic Chemistry 3 (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["08:30AM - 09:50AM MC 2034", "Email: graham.murphy@uwaterloo.ca", "FMO theory, organometallics, and transition metal-catalyzed C-C bond formation.", "Chemistry 360 builds on the concepts and chemistry taught in CHEM 264 and CHEM 265.", "If you want to do well in CHEM 360, you should re-familiarize yourself with some of the material in your introductory organic chemistry courses.", "More specifically, CHEM 360 will familiarize students with some of the modern synthetic methods for the formation of carbon-carbon sigma bonds in organic compounds.", "An array of anionic, cationic, pericyclic, and organometallic methods will be introduced as part of three general sections, and the factors governing the mechanistic, stereochemical and regiochemical course of these processes will be presented and discussed as appropriate.", "Section 1 will cover enols and enolates, condensations and a-substitutions of carbonyl compounds (acid- and base-catalyzed), and conjugate addition to a,b-unsaturated carbonyl compounds (acid- and base-catalyzed).", "Section 2  will cover pericyclic reactions (cycloadditions under thermal and photochemical conditions), with an emphasis on how an appreciation of frontier molecular orbitals allows for prediction of the reactivity of the systems (thermal and photochemical conditions), as well as relative reaction rates, regiochemistry and stereochemistry.", "Section 3  will present transition-metal catalysis and organometallic reactions, with a particular emphasis on Pd-catalyzed cross-coupling reactions.", "1) To learn to use curve arrow formalism to “push” pairs of electrons in writing resonance forms and in sketching electron flow in chemical reactions.", "To be able to use the understanding of reactions mechanisms to predict the outcome of these chemical reactions (mechanistic reasoning to interpret pattern of reactivity).", "4) To be able to identify intermediates versus transition states in an energy diagram for all fundamental condensation reactions and be able to determine the difference between kinetically and thermodynamically controlled reactions, identify equilibrium and reaction rates, and relate to the energy of the transitions state, starting material, and final products.", "7) To be able to identify neutral cyclic transitions states, involving bond-forming and bond-breaking events, in cycloaddition reactions, under thermal and photochemical conditions.", "To be able to use frontier molecular orbitals (FMO’s) to predict the reactivity of cycloadditions under thermal and photochemical conditions, as well as relative reaction rates, regiochemistry and stereochemistry (Endo rule).", "11) To be able to generate catalytic cycles for common cross-coupling reactions, namely Suzuki, Stille, Heck, Sonogashira, and Buchwald-Hartwig (Buchwald-Hartwig amination), as well as variations involving carbon monoxide.", "No Free Online Access", "No e-textbook can be sourced from the publisher, starting from $49.49 USD", "The exams are in-person, and any conflicts with the timing of these exams should be brought to my attention ASAP for possible alternate exam scheduling.", "This will be 75 minutes in length and will be worth 25% of your course grade.", "This will be 75 minutes in length and will be worth 25% of your course grade.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 48, "course_code": "CHEM 360L", "course_name": "CHEM360L - Senior Organic Chemistry Laboratory (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["11:30AM - 05:20PM", "Selected microscale synthetic experiments for students in year three chemistry and biochemistry programs, including spectroscopic identification of organic compounds.", "Design experiments that highlight the theory and application of synthetic laboratory techniques and select organic reactions from CHEM 265 and CHEM 360", "Analyze experimental data including experimental properties and spectroscopic data obtained in the lab or provided by the instructor to draw conclusions about the experiment", "Prepare experimental procedures using journal-article formatting", "Prepare a technical report for a mock company", "Safety glasses can be re-used from a previous course as long as they cover the front and sides of the eyes or can be purchased from any available source ($5-30).", "All of these details can be found on LEARN.", "The plan of action for each unit is due the first day you plan to start that unit.", "Prelab notebook work for each unit is due the first day you plan to start that unit.", "Illness and Short-Term Absence Policies:", "Students can not use the 48-hour short term absence to miss a laboratory session.", "Students that cannot find a partner before the first lab session will be assigned a partner at the start of the first lab session.", "Students will be assigned to a locker the first lab session and continue working in that location throughout the term.", "Glassware and equipment must be cleaned after use (please refer to basic lab techniques for glassware cleaning procedures)."]}, {"course_id": 49, "course_code": "CHEM 363", "course_name": "CHEM363 - Organic Process Chemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["09:30AM - 10:20AM B2 350", "Determine what in-process assays and controls are necessary to regulate runaway reactions and minimizing impurities", "Introduction to process chemistry", "Safety", "Safety", "Safety", "Route selection", "Route selection", "Route selection", "Effects of Water", "In process controls", "Practical considerations for scale", "Continuous operations", "I have used the textbook as a guideline on what topics to teach and have used some of the examples given in the textbook.", "I'll form these groups and post them on LEARN after the first week of class.", "After researching multiple production processes, you'll write a paper that provides an overview of these methods and critically assesses their pros and cons based on the criteria and concepts covered in this course.", "Then, as a group, you'll compare and contrast these methods, ultimately recommending the most suitable option for scaled-up production."]}, {"course_id": 50, "course_code": "CHEM 370", "course_name": "CHEM370 - Introduction to Polymer Science (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Introduction to Polymer Science Fall 2024", "10:00AM - 11:20AM EIT 2053", "Basic definitions and polymer nomenclature, molecular weight distributions and averages, molecular weight measurements, step-growth and free radical chain-growth polymerization reactions, chain conformations, glass transition, crystallization, and mechanical properties of polymers.", "Understand the models and measurement of polymer chain dimensions.", "Know the general techniques to characterize polymer molecular weight and understand their principles.", "Remember the nature of step-growth polymerization and analyze the kinetics", "Differentiate chain-growth and step-growth polymerization and their kinetics", "Understand the key feature of controlled radical polymerization", "Know basic characterization methods and terms for polymer mechanical properties", "The whole course includes seven chapters, and each chapter will have a correlating assignment after it is completed.", "Introduction to Polymers (Third Edition) Robert J. Young and Peter A. Lovell No"]}, {"course_id": 51, "course_code": "CHEM 381", "course_name": "CHEM381 - Bioorganic Chemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["09:30AM - 10:20AM DWE 3517", "Learn methods for the racemic and enantioselective syntheses of amino acids,", "Learn peptide synthesis", "Learn about the basic reactions of monosaccharides", "Learn how to make the glycosidic bond", "Learn about the basic of the synthesis of oligosaccharides", "learn how nucleotides and nucleic acids are used as drugs,", "two midterms each worth 15% for a total of 30%"]}, {"course_id": 52, "course_code": "CHEM 382L", "course_name": "CHEM382L - Advanced Organic Synthesis Laboratory (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["A laboratory course intended for students in the Medicinal Chemistry Specialization of the Honours Chemistry plan.", "The purpose of this course is to introduce students to advanced laboratory techniques used in synthetic organic chemistry.", "Familiarize themselves with advanced organic synthesis and laboratory techniques used in synthetic organic chemistry.", "Implement procedural design and execution using guidelines", "Prepare and execute an oral presentation on a total synthesis", "The reactions in this unit will review techniques learned in previous organic chemistry lab courses and introduce new techniques.", "Unit 4: Synthesis Design"]}, {"course_id": 53, "course_code": "CHEM 383", "course_name": "CHEM383 - Medicinal Chemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["10:30AM - 11:20AM DWE 1515", "This course discusses the drug discovery process and drug synthesis. Topics include enzymes and receptors, hit and lead discovery, lead optimization, QSAR, prodrugs, drug delivery, drug metabolism, mechanisms of selected drugs, and laboratory and process scale synthesis of selected drugs.", "Prof. Scott Taylor", "Have a good understanding of the drug development process", "Topics related to drug discovery will be covered each week"]}]