[{"course_id": 44, "course_code": "BIOL 335L", "course_name": "BIOL335L - Molecular Biology Techniques (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Molecular Biology Techniques Winter 2025", "11:30AM - 12:20PM QNC 1506", "cheryl.duxbury@uwaterloo.ca", "STC 3019", "cheryl.duxbury@uwaterloo.ca", "STC 3019", "cheryl.duxbury@uwaterloo.ca", "Email – ljlemieux@uwaterloo.ca", "Email – cduxbury@uwaterloo.ca", "Selected experiments to provide students with a range of laboratory skills in recombinant DNA technology.", "Perform, troubleshoot and know theory of preparation, quantification, restriction analysis, cloning, transformation and pcr of DNA samples.", "2. Perform, troubleshoot and know theory of RNA preparation, analysis and detection via hybridization.", "3. Perform, troubleshoot and know theory of protein quantification, SDS-PAGE analysis and Western blotting analysis.", "Use CRISPR to genetically modify the chromosomal DNA of yeast.", "1 Jan 6-10  Lab skills: Exercise 1: Equipment use, Exercise 2: Preparation of solutions, Exercise 3: Preparation and Maintenance of Microbial cultures, and Exercise 4: Dilution series of both Fast Green and yeast cultures IN LAB MICROPIPETTING PRACTICAL", "2 Jan 13-17  Manipulating DNA: Exercise 1: Isolation of Genomic DNA from Calf Liver and Exercise 2: Restriction Enzyme Analysis of Lambda DNA, and Exercise 3: Preparing and running an agarose gel", "DNA Cloning I: Exercise 3: Restriction Digests of Plasmid and Insert DNA", "CRISPR I:  Exercise 5: Transformation of S. Pombe to Introduce CRISPR as a chromosomal mutagenesis tool", "PCR chromosomal DNA analysis: Exercise 1: DNA Isolation and PCR Reaction on DNA Isolated from Hair Follicle", "8 Mar 3-7         RNA Dot Blot I:  RNA Isolation, Analysis of RNA Quality by Formaldehyde Gel Electrophoresis, and dot blotting-includes the quantification of RNA by Nanodrop, preparation of membrane and spotting the RNA samples", "RNA Dot Blot II: Prehybridization and Hybridization of the Probe.", "Exercise 1: RNA Dot Blot Analysis from Arabidopsis", "10 Mar 17-21    SDS PAGE and Western blotting of Yeast Extracts: Exercise 1-5", "Emails can be received 24 hours per day.", "At the instructor's discretion, you may be permitted to take a make-up exam.", "The makeup exam may be in a different format than the missed examination (e.g. oral examination for the make-up).", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 45, "course_code": "BIOL 341", "course_name": "BIOL341 - Fundamentals of Immunology (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["B. Dixon", "Instructor   Dr. Brian Dixon    B2-250", "E-mail: bdixon@uwaterloo.ca", "This course will provide students with an understanding of the fundamental concepts of the vertebrate immune system.", "Topics will focus on the components of the immune system, innate and adaptive immunity, immune cell development, communication, and recognition of non-self leading to an immune response.", "How organisms regulate health versus disease is a central concept in the life sciences and has been the subject of intense study for over 100 years.", "Describe the physical, chemical, cellular and soluble mediators of the immune system and how they are generated", "Explain how pathogens are recognized by the immune system and how this recognition initiates innate and adaptive immunity", "Determine how the innate immune system activates and drives the type of immune response towards a pathogen", "Indicate how resolution of infection occurs and the cells and molecules involved", "Predict how a defect in an aspect of immunity or evasion of the immune system by a pathogen will impact components of the immune response and affect the resolution of an infection", "Jan 10 Innate immune cell development 2 33-37", "Jan 17 Innate cell function & PRRS 3,4,13 89-90, 133-147", "**RCH-101**", "Feb 28 B cell development 10 323-344", "Mar 17 Immune response in space and time 14 512-535", "50 minutes during “class time”, comprising multiple choice, matching terms, and/or definitions and written answer questions.", "Quiz 1: Introduction; innate immune cells; immune organs; innate immune cell development;", "Quiz 2: Innate barriers; pathogens and antigens; PRRs and PAMPs; innate immune cell function Lectures 4 - 6 Sun Feb 11, @ 11.30pm", "A ‘severe’ incapacitation indicates students are unable to attend class and engage in most academic studies during the period indicated.", "They should consider not writing tests/exams during the incapacitation period", "To create and promote a culture of academic integrity, the behavior of all members of the University of Waterloo should be based on honesty, trust, fairness, respect and responsibility.", "Additional information and tips for success", "Ask questions in class – this is a great way to clarify concepts in a timely manner.", "This course is challenging and requires the synthesis of concepts from several previous biology courses: Physiology, Genetics Cell Biology, Molecular Biology and Microbiology – it is not equivalent to a first or second year introductory course.", "Immunology also requires integration of separate concepts and builds rapidly on material covered in previous lectures."]}, {"course_id": 46, "course_code": "BIOL 348L", "course_name": "BIOL348L - Laboratory Methods in Microbiology (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Laboratory Methods in Microbiology Winter 2025", "cheryl.duxbury@uwaterloo.ca", "This is a laboratory course designed to provide students with individual hands-on experience in a wide range of microbial techniques.", "The course covers six basic laboratory topics:", "Methods for testing the presence and control of microorganisms", "3. Preparation of media and solutions", "4. Isolation of microorganisms", "Isolate characterization:       physical characteristics", "biochemical properties", "molecular analysis", "Molecular phylogeny", "Get hands-on experience in a wide range of microbial techniques.", "Learn methods for testing the presence and control of microorganisms.", "2 PM deadline in ESC 357F", "2 PM deadline in ESC 357F", "Evaluating antiseptics/hand sanitizers/antibiotics and characterizing microbial colonies", "Observing microbes using microscopic techniques", "Culture media preparation and sterilization", "Cell count and isolation of microorganisms from various samples", "Further testing of unknown sample and the use of litmus milk in the characterization of bacteria", "Characterization and identification of the isolate using Biolog and understanding bacterial growth characteristics", "Cell lysate and urease enzyme assay", "Genomic DNA isolation and amplification of 16S rRNA genes by PCR", "Gel electrophoresis of genomic DNA and PCR products", "Sequencing of the 16S rRNA gene and bioinformatic analysis of the data using online resources", "*Short preparation on Tuesday", "**Short preparation on Monday and Tuesday", "In the tutorial session, there will be a number of quizzes for recently studied tutorial material or experiments done, which will be part of the grade for the tutorial.", "Please note that the summary will not be everything what you did, but only those interesting points such as major questions, unusual observations, difficult explanation or unclear mechanisms, or excellent results supporting clear conclusions and etc..", "A medical certificate is required for excusing you entirely from the lab for a particular week and you will be responsible for making alternate arrangements (e.g. obtaining and analyzing data from another student).", "A copy of the medical certificate can be recovered from https://uwaterloo.ca/science-undergraduate-office/academic-policies-and-procedures/accommodation-illness-or-other-extenuating-circumstances.", "To make this happen, a flow chart for each lab session is required.", "The flow chart is similar to a “map” of doing your experiments for that lab session, which includes important information of the experimental steps and possible time management (which step(s) must be completed first and which can wait).", "All flow charts you make will be evaluated as your flowchart mark.", "However, the TAs will only do so for your first 3 flow charts, and the TAs will only sign the rest of the flow charts of the remaining lab sessions, which you have to make before each of the lab sessions.", "Please note that the TAs will not read those flow charts and a copy of those flow charts signed by your TAs has to be included in your corresponding lab notes.", "Execute the protocol(s) for any given week accurately", "Make careful observations during lab (e.g. colony morphology, results for diagnostic biochemical tests, times of incubation etc.)", "Always work in a safe manner in the lab.", "Experimental results", "Poor results were a reflection of not being prepared and poor execution", "Professionalism and Attitude", "Worked well as a team member: used equipment and reagents effectively for all participants", "WHO ARE YOU?", "This type of information allows you to get to know each other better.", "As a result, lab books are a critical major component of this course.", "Notice of Recording", "To create and promote a culture of academic integrity, the behaviour of all members of the University of Waterloo is based on honesty, trust, fairness, respect and responsibility.", "STATEMENT FOR STUDENTS WITH DISABILITIES", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Allowed", "Allowing under certain conditions", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 47, "course_code": "BIOL 354", "course_name": "BIOL354 - Environmental Toxicology (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Environmental Toxicology Fall 2024", "02:30PM - 05:20PM B2 351", "07:00PM - 09:50PM B2 351", "02:30PM - 05:20PM B2 351", "02:30PM - 05:20PM B2 351", "07:00PM - 09:50PM B2 351", "Please bring a reusable mug if you'd like a cup of tea.", "An introduction to the basic theories, principles, and techniques of environmental toxicology.", "A comparative study of the effects of specific groups of toxicants and how they can affect molecular, cellular, and organismal processes will be explored in lectures and through laboratory experiments.", "Know the basic theories, principles and techniques of environmental toxicology.", "Understand how different toxicants move from source to receptor, the concept of dose-response relationships and toxicokinetics.", "Understand the process of assessing toxicity using various toxicity test methods and the understand the physiological impacts of various classes of toxicants.", "Know the scientific terminology and knowledge base necessary to effectively communicate the impact of toxicants on target organisms through an in-person group presentation.", "Follow safety procedures as they relate to working in a toxicology laboratory and handling samples and organisms in the lab.", "Conduct toxicity tests using model organisms to assess the effects of pollutants.", "Describe how bioassays are used to estimate toxicity in environmental toxicology.", "Interpret and analyze the results of toxicity experiments, draw appropriate conclusions supported by the data in the format of a laboratory report.", "Week 2 Dose-Response Relationships & Toxicity Test Methods Chapter 4 Sections 4.3.2.", "no grade**", "no grade**", "Week 8 Survey of Toxic Substances - Inorganic & Organic Contaminants", "2,4-D", "2,4-D", "**", "Official Grades and Course Access", "Few are available on loan in the lab (first come, first served)", "WHMIS training checked for completion during the first lab Yes", "At the discretion of the instructor, you may be permitted to take a make-up exam.", "The make-up exam may be of different format than the missed examination (e.g. oral examination for the make-up).", "The Lecture Minute Paper activity will be followed by a discussion Indigenous Learning Circles that provide an opportunity for relational and reciprocal learning, fostering critical thinking, problem-solving skills, increased engagement, and community building.", "Lab Activities & Assessments", "Notice of Recording", "Don’t waste your time with these requests!", "Library for research-based assignments"]}, {"course_id": 49, "course_code": "BIOL 359", "course_name": "BIOL359 - Evolution 1: Mechanisms (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["A study of the processes of evolution; the differentiation of populations and the origin of new forms of life.", "Describe and explain the various agents of evolution", "Demonstrate how these processes may result in adaptation, speciation and extinction", "Analyze and interpret cases of evolution", "Apply evolutionary concepts of conservation biology", "Evidence for Evolution", "Natural Selection", "Variation", "Mendelian Genetics- selection and mutation", "Mendelian Genetics- gene flow, genetic drift and non-random mating", "Adaptation", "Evolution of Sex", "8.3", "Sexual Selection", "Evolution of Social Behavior", "Speciation"]}, {"course_id": 50, "course_code": "BIOL 361", "course_name": "BIOL361 - Biostatistics and Experimental Design (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Biostatistics and Experimental Design Winter 2025", "Question & Answer (Consultation) Sessions: Prof. Hall will be available for two 50-muinute remote sessions each week of classes to answer questions and provide advice.", "These sessions will be held every Tuesday @ 11:00 am -11:50 am & Friday @ 11:30-12:20 pm that you access via Teams at this link.", "You must bring your personal computer to each lab session capable of running the statistical software!", "An introduction to hypothesis testing and experimental design in biology.", "Topics will include exploratory data analysis, analysis of variance, categorical data analysis, correlation, linear regression, multiple linear regression, power analysis, and visualization tools.", "Statistical software will be used in computer laboratories to explore examples and applications.", "Biology 361 is a practical course in statistics and experimental design for students of the biological sciences.", "Provide you with a set of tools and techniques so you can perform your own data analysis and experimental design.", "The tools include statistical-analysis tools and graphical approaches to data analysis and display.", "This course offers training in data handling & analysis, hypothesis testing and experimental design in Biology.", "Topics will include: exploratory data analysis, two-sample tests, analysis of variance, categorical data analysis, correlation, linear regression, multiple linear regression, power analysis, experimental design, and data visualization tools and statistical software.", "The Course Schedule provides the list of topics covered during each week of the course.", "The lab sessions provide important skill development and practice for activities that students will use in the written assignments and tests of the course – so, the Lab sessions are the most important components of the course!", "Make sure to attend them!!!", "Effectively use a sophisticated statistical software package (e.g., IBM SPSS Statistics).", "Summarize and display data so you can learn what they show, and to communicate the key features to others.", "Gain confidence in solving problems and answering scientific questions with data (= evidence).", "This is a practical course that provides students with experiential learning opportunities to master skills in handling data (graphical and numerical summaries), statistical analysis and experimental design.", "Effectively use a sophisticated statistical software package (e.g., IBM SPSS Statistics).", "Summarize and display data so you can learn what they show, and to communicate the key features to others.", "Gain confidence in solving problems and answering scientific questions with data (= evidence).", "Lecture 1: Introduction to course/Intro to statistics", "Lecture 2: Data in Biology", "Lecture 3: Intro to Hypothesis Testing & Exp’tal Design", "Lab 1 – Intro to SPSS & Descriptive Statistics", "Lab 2 – Confidence Intervals & Hypothesis Testing", "Descriptive Statistics", "Lecture 10: Experimental Design I", "Lecture 11: Experimental Design II", "Lab 4 – Experimental Design", "Lecture 15: Categorical data analysis I", "Lab 7 – Categorical Data Analysis", "Lecture 18: Regression Analysis I", "Lab 8 - Correlation & Linear Regression", "Lecture 20: Multiple Linear Regression", "Lecture 21: Power Analysis", "Lab 9 – Simple & Multiple Linear Regression", "Lab 10 – Power Analysis", "Exam period", "exact timing To Be Announced", "STRONGLY RECOMMENDED 6-month rental No 50.62", "IBM SPSS Statistics (SPSS) is a sophisticated statistical software package that is widely used in research and business.", "Thus, I strongly urge students to use the first option - to purchase a copy of IBM SPSS Statistics for Students.", "There is a 12-month rental (extends well beyond end of the course: $ 84.50) if you have reason to use SPSS after the course ends: https://e5.onthehub.com/WebStore/OfferingDetails.aspx?o=adb263bd-0a39-ed11-814e-000d3af41938&pmv=4089c65e-9133-ed11-814e-000d3af41938&ws=4c3b92f6-3b32-e611-941d-b8ca3a5db7a1&vsro=8", "If you experience difficulties with Option 2 or do not see the software offering on the page, contact Science Computing via email at sci@uwaterloo.atlassian.net", "I have placed them on 1-day reserve in the UW Davis Library so students can access them.", "Excellent introductory biostatistics text that focuses on explaining the proper scientific interpretation of statistical tests rather on the mathematical logic of the tests.", "Biometry: The Principles and Practice of Statistics in Biological Research (3rd Edition).", "W.H. Freeman & Co. ISBN 0-7167-2411-1.", "Includes a full complement of statistical tables.", "Excellent resource for experimental methodology in the ecological sciences.", "Experimental Design for the Life Sciences.", "This course includes independent development and practice of specific skills by students, such as organizing data in spreadsheets for analysis by statistical software, making choices about the most effective graph and table style to display information (data), choosing the appropriate statistical test for a stated hypothesis and data set, drawing your own interpretations and conclusions from the data, and communicating your own understanding.", "•              Library for research-based assignments"]}, {"course_id": 51, "course_code": "BIOL 365", "course_name": "BIOL365 - Methods in Bioinformatics (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Methods in Bioinformatics Winter 2025", "10:30AM - 12:20PM MC 4060", "Email: molly.chen@uwaterloo.ca", "Topics include analysis of genome-scale gene and protein expression, construction of species and gene trees from molecular sequence data, and analysis of biological systems using bioinformatics tools.", "We will be using the R statistics package for some aspects of this course.", "Use computational tools for the analysis of biological data", "Understand the underlying theory and assumptions of bioinformatics tools", "Analyze DNA, RNA and protein sequences", "Understand and compare high throughput methods for DNA sequencing", "Week 2 - Alignments and scoring functions", "Week 3 - BLAST and search algorithms", "Week 5 - Multiple sequence alignments and HMMs", "Week 6 - High throughput sequencing and assembly", "Week 10 - Genome variation", "Week 11 - Gene expression and differential expression analysis", "Week 12 - Clustering and descriptive stats", "Week 13 - Current and emerging bioinformatics tools + review"]}, {"course_id": 53, "course_code": "ANTH 204", "course_name": "ANTH204 - Biological Anthropology (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Introduction to Biological Anthropology Winter 2023", "ANTH 204 102", "Instructor: Dr. Alexis Dolphin", "Email: adolphin@uwaterloo.ca", "We begin with an overview of the scientific method, the history of evolutionary thought and the genetic basis of short-term and long-term evolutionary change.", "The third segment will address issues surrounding the fossil record of human evolution and human origins.", "Finally, we will explore modern human adaptation and variation in their environmental context.", "C. Critically evaluate anthropological literature in terms of methodology and validity of resulting conclusions", "D. Demonstrate appropriate and ethical laboratory practices while applying quantitative and qualitative method to the analysis of hominin and primate casts, human remains, and artifacts", "Readings", "Introduction to Anthropology", "& Evolutionary Thought", "Natural Selection,", "Bio Basics & Inheritance", "Natural Selection", "Evolution", "Skeletal Anatomy", "Primates &", "Their Evolution", "Primate Behaviour", "Humans & Primate Evolution", "Chapters 9 &", "Chapters 10 &", "Bioarchaeology", "Human Osteology", "“A Human Voyage: Exploring Biological Anthropology” by Anne Keenleyside and Richard Lazenby.", "The format of the test may include multiple choice, fill-in-the-blank, true-false, matching and/or short answer questions.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page."]}, {"course_id": 55, "course_code": "CS 200", "course_name": "CS200 - Concepts for Advanced Computer Usage (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Concepts for Advanced Computer Usage Winter 2025", "10:30AM - 12:20PM MC 3027", "E-mail: barbara.daly@uwaterloo.ca", "E-mail: cs200@uwaterloo.ca", "Important concepts underlying major personal computer application categories; methodologies for learning and evaluating software; operating system and hardware design from the user's point of view, with implications for maintaining a personal computer.", "To develop an understanding of important intellectual concepts underlying major personal computer application categories, and the application of those concepts to problem solving.", "To develop an understanding of personal computer software and hardware appropriate for students who own and maintain their own machines.", "Introduction", "Word Processing", "A1", "Backups", "A2", "A4", "A6", "Database Intro", "Monday, Mar 10 Advanced Databases", "Examinations"]}, {"course_id": 59, "course_code": "HIST 209", "course_name": "HIST209 - Smallpox to Medicare: Canadian Medical History (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Email: matthew.wiseman@uwaterloo.ca", "Starting with Aboriginal medicine, the course examines topics such as the rise of the medical and nursing professions, changing public attitudes to health and disease, and the evolution of the Canadian health insurance system.", "Beginning with Indigenous traditional knowledge and medicine, we will study and consider topics such as colonization and disease transmission, the rise of the medical and nursing professions, changing public attitudes to health, and the evolution of the Canadian healthcare and health insurance system.", "Use historical methods to evaluate causal arguments and analyze assertions, assumptions, and explanatory evidence about the social and cultural roles of health and medicine.", "Communicate and discuss historical research while developing skills in digital literacy.", "This will be rigidly adhered to and extensions will be granted only for bona fide medical problems that shall be verified by submission of a completed and signed University of Waterloo Verification of Illness form.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:"]}, {"course_id": 60, "course_code": "HLTH 101", "course_name": "HLTH101 - Introduction to Health 1 (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Introduction to Health 1 Fall 2024", "K. Bishop-Williams", "Instructor: Kate Bishop-Williams", "This course will be of interest to students pursuing careers in health and those with a general interest in health and health care.", "Emphasis is on understanding the origins, factors and conditions that determine health throughout the lifespan, how these factors influence one another and the role/impact of health care.", "The Association of Faculties of Medicine in Canada (AFMC)", "As students, you and those close to you may experience a range of issues that can cause barriers to well-being and learning.", "Accommodations for Racial Trauma", "Have you experienced impacts of racism, racial trauma, racial violence, and are looking for academic accommodation options related to those experiences and impacts?", "Athletics and Recreation", "Empower Me - Student Assistance Program", "Office of Equity, Diversity, Inclusion & Anti-racism (EDI-R)", "Sexual Violence Prevention & Response Office", "You cannot split up each 24-hour slip day into a smaller number of hours amongst the assignments.", "Missed Discussions", "If you completely miss a week of one of these LEARN Discussions, you cannot make up the missed discussion.", "This discussion will simply be dropped and not counted towards your overall course grade.", "I acknowledge that most of the knowledge in health sciences taught in this course and others has been historically based a subset of privileged (mostly white, male) voices."]}, {"course_id": 61, "course_code": "HLTH 102", "course_name": "HLTH102 - Introduction to Health 2 (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Introduction to Health 2 Winter 2025", "08:30AM - 09:50AM M3 1006", "This course expands upon the general concepts introduced in HLTH101 while extending the discussion to include issues such as: additional barriers to health; disease prevention; and methods used to plan, monitor, and improve individual and population health.", "Understand and define fundamental concepts underlying public health practice;", "Analyze the relationships between determinants of health and health status, using core public health principles;", "Examine and apply theories, concepts and models of health promotion in addressing determinants of health;", "Understand the major modifiable determinants of chronic disease in Canada and the impact that those chronic diseases have on individual and population health;", "Describe how the environments and group characteristics can affect the health of individuals and populations; and,", "Understand the breadth of health interventions and the difference between clinical interventions, individual behaviour change interventions, and population-level interventions.", "January 7                 Topic 1 - Introduction", "January 16 Topic 4 - Alcohol and Cannabis", "February 11 No class - study for your mid-term", "February 25 Topic 11 - Social Determinants of Health", "March 13 Topic 16 - Diabetes", "April 3 No class - study for your final exam", "WEEK 3 (January 20-24) Tutorial 2 – Important Information for First-Year Health students", "Exams", "These exams are designed to assess comprehension and understanding of the core concepts covered for each course topic, which include both lecture and reading materials.", "Final examination: In most situations, you will need to write a make-up final exam during the registrar-scheduled make-up exam days.", "Anti-racism Statement", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Additionally, University life can be difficult with multiple demands.", "You may experience stressors that can impact your personal well-being and academic experience, but there are multiple supports and resources available to you on and off-campus.", "Intellectual property includes items such as:"]}, {"course_id": 63, "course_code": "HLTH 340", "course_name": "HLTH340 - Environmental Toxicology and Public Health (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Environmental Toxicology and Public Health Fall 2024", "Under the supervision of Dr. Richard Manderville, he synthesized fluorescent nucleobase analogs and incorporated them into mutation-prone DNA sequences to elucidate the mutation propensity of DNA adducts, specifically cyclic N-linked adducts.", "Dr. Manning has experience as a medical writer and has authored common technical documents for pharmaceutical clients during the drug development process.", "Her research interests include foodborne diseases and food safety, health policy, and knowledge translation in public health.", "An introduction to the basic biological and toxicological processes that determine the effects of environmental pollutants on human health.", "Describe environmental and host factors that may increase or decrease health risks in certain individuals under certain health effects, to determine human susceptibility factors.", "Describe the major classes of environmental toxicants - their properties, their actions in the body, and their health effects, especially those related to chronic long-term toxicity.", "The sample questions should be based upon the lecture materials and relevant readings for HLTH 340.", "The questions may take the form of multiple choice", "Students can only self-declare one covid-19-related absence in an academic term.", "Students can only declare one short-term absence per semester.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 64, "course_code": "HLTH 341", "course_name": "HLTH341 - Principles of Pathobiology (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Principles of Pathobiology Winter 2025", "08:30AM - 09:50AM STC 0010", "E-mail: njandu@uwaterloo.ca", "An introduction to the study of biological factors governing disease in humans that will use selected diseases to identify risk factors and illustrate pathogenic mechanisms.", "The role that behaviour has in modifying biological response to disease may also be considered.", "Evaluate the etiology of selected pathophysiological conditions and explain whether it is determined by internal human-host factors, external environmental factors or a combination of factors.", "Differentiate between modifiable versus non-modifiable risk factors that contribute to the onset illness and progression of disease of various pathophysiological conditions.", "There will be many opportunities to earn these points.", "Students are expected to abide by the honor system to complete these quizzes independently and without any resources.", "The purpose of these quizzes is for students to ‘self-check’ their understanding of the material that was covered during the class sessions.", "Students can complete the quiz at any point during that time-period.", "All written assessments that require submission via a dropbox will have a 48-grace period for submission.", "Provide supportive evidence of where and why marks were erroneously deducted.", "Notice of Recording", "Our in-person and on-campus lectures will be live and in-person without being recorded.", "This will allow for a more natural and dynamic learning atmosphere with a welcome environment for student comments, questions, and participation.", "Library for research-based assignments"]}, {"course_id": 65, "course_code": "KIN 301", "course_name": "KIN301 - Human Anatomy of the Central Nervous System (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Human Anatomy of the Central Nervous System Fall 2024", "KIN 301", "KIN 301 001", "11:30AM - 12:20PM", "KIN 301 101 [", "jeremy.roth@uwaterloo.ca", "KIN 301 102", "jeremy.roth@uwaterloo.ca", "KIN 301 103 [", "08:30AM - 10:20AM EXP 3683", "jeremy.roth@uwaterloo.ca", "KIN 301:", "Major functional systems, including somatosensory and motor pathways, special sense pathways, and integrative systems of the brain, will be examined through an understanding of anatomical connectivity.", "View requirements for KIN 301", "Identify the location of structures and pathways of the central nervous system (CNS) in cross-sectional specimens and images of the CNS.", "2. Illustrate the structural organization of sensory, motor and integrative systems of the CNS.", "The study of human neuroanatomy can be viewed as a travel-log; it is the study of the geography, language and culture or function of different regions of the central nervous system (CNS).", "Similar to the division of a continent into countries, provinces, regions and cities, the central nervous system is divided and subdivided into different regions that have specialized sensory, motor, cognitive and emotional functions.", "Overview of the Structural and Functional Organization of the CNS.", "Module 1 will present a general orientation to the structural and functional organization of the central nervous system (CNS), with a focus on the cerebral cortex.", "Each of these regions has specialized functions, which depend on their internal circuitry and connections to other regions of the CNS.", "Specialized functions of different regions of the CNS can be revealed by behavioural disorders resulting from a disruption of blood supply to a region.", "2. Knowing and Moving our Bodies: Organization of Somatic Sensory and Motor Systems", "Module 2 will explore the organization of the somatic sensory and motor systems.", "These sensations allow us to know the relative orientation and movements of our body parts (body schema) and to explore properties of objects that we contact.", "These sensory systems allow us to experience the external world and guide our movements as we interact with the external world.", "4. Integrative Systems of the Brain", "Module 4 will explore integrative systems of the brain: the cerebral cortex, basal ganglia and limbic system.", "These regions serve important functions of problem solving, storing memories, regulating emotions and automating movement.", "Lectures will be devoted to: providing context and relevance for each module, directing your attention to important facts and concepts in assigned readings, developing strategies for self-study outside of lectures and labs and analyzing the neuroanatomical basis of normal and abnormal experiences and behaviour using case studies.", "Labs will be devoted to building a map of the central nervous system by identifying the location of structures in specimens and images of cross sections of the central nervous system.", "If you prefer, there is a Kahoot app available for iOS and Android devices.", "Lab 1: Introduction to the CNS", "Autonomic Nervous System", "Lab 6: Auditory and Vestibular Systems", "On-campus exams end December 20, 2024", "Clean, white lab coat A rental can be provided by the School of Anatomy for a $7.50 fee.", "Lab Exams: will evaluate your ability to identify structures presented on embalmed cadaveric specimens, plastic models and images of cross sections of the central nervous system.", "Examinations", "School of Anatomy lab coats can be rented for the term for $7.50.", "Notice of Recording", "In rare circumstances, it may be possible for students to attend lectures virtually to accommodate a specific request (e.g., prolonged self-isolation).", "Requests for virtual attendance will only be considered on a case-by-case basis and may not be granted if appropriate recording equipment is not available – the lecture hall does not have recording equipment available for us to stream lectures.", "The resource is intended as a contingency in case of a switch to remote learning.", "Please inform the instructor if you must miss multiple lectures due to self-isolation.", "You may experience stressors that can impact your personal well-being and academic experience, but there are multiple supports and resources available to you on and off-campus.", "Office of Indigenous Relations                      Office of Equity, Diversity, Inclusion and Anti-racism", "Only one short-term absence can be self-declared per academic term.", "Students can self-declare one Covid-19-related absence in an academic term.", "Academic Regulations and Accommodations", "Death of a family member: a copy of the death certificate, a copy of the obituary or a link to the online obituary.", "Co-op Interviews"]}, {"course_id": 66, "course_code": "KIN 308", "course_name": "KIN308 - Cardiovascular and Pulmonary Physiology (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Cardiovascular and Pulmonary Physiology Fall 2024", "KIN 308", "KIN 308 001", "connor.doherty@uwaterloo.ca", "Examples of pathology and exercise will be used to reinforce basic physiological function.", "Contemporary research that spans from cell to organ to the integrated system level will be used to introduce lecture material.", "View requirements for KIN 308", "To provide an advanced understanding of heart and blood vessel physiology in normal health and in cardiovascular disease conditions.", "To provide an advanced understanding of pulmonary physiology in normal health and in pulmonary disease conditions.", "To provide mechanistic insight regarding prevention and treatment issues related to cardiopulmonary function; emphasizing physical activity and aging issues where appropriate.", "To provide senior students with modern perspectives on the relevant cardiopulmonary basic science and clinical issues by introducing contemporary research findings into the lecture discussions (thus to provide advanced training in reading and understanding biomedical research literature).", "Respiratory Mechanics", "Control of Breathing", "Important Dates for Co-op Students - https://uwaterloo.ca/co-operative-education/important-dates", "Cardiovascular Physiology Concepts, Second Edition by Richard E. Klabunde 2012 Lippincott Williams & Wilkins", "This course includes the independent development and practice of specific skills, such as literature evaluation.", "Library for research-based assignments", "As a reminder, in Quest, students can declare these types of absences:", "Supports and Resources", "You may experience stressors that can impact your personal well-being and academic experience, but there are multiple supports and resources available to you on and off-campus.", "Athletics and Recreation - http://warriors.uwaterloo.ca/", "Co-operative Education - https://uwaterloo.ca/co-operative-education/", "Empower Me – Mental Health Resources - https://wusa.ca/services/empower-me", "Office of Equity, Diversity, Inclusion, and Anti-racism - https://uwaterloo.ca/equity-diversity-inclusion-anti-racism/"]}, {"course_id": 67, "course_code": "KIN 312", "course_name": "KIN312 - Introduction to Neurological Disorders (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introduction to Neurological Disorders Winter 2025", "KIN 312", "KIN 312 001", "Alessandro Adorante a2adoran@uwaterloo.ca    TBA", "KIN 312:", "An introduction to selected neurological disorders and their implications for physical activity.", "The neurological disorders examined include those which accompany neuromuscular and perceptual-motor impairment, intellectual disability, cardiovascular and respiratory disease.", "View requirements for KIN 312", "2. To summarize the characteristics of healthy movement and healthy gait and appraise how impairments related to various neurological disorders may impact these characteristics.", "To describe, compare and contrast the pathophysiological mechanisms underlying the neurological disorders discussed in this course.", "To identify the components of a basic neurological assessment and relate the importance of normal and abnormal findings", "To describe the symptoms of various neurological disorders and their relationship to changes in the neuromuscular system.", "To describe the impact of neurological disorders and associated symptoms on movement and an individual's daily life activities.", "Week1  January 7 & 9 Introduction and background", "Week 12 March 25 & 27", "The test will include multiple choice and short answer questions.", "The exam will include multiple choice, short answer, and mid-length questions.", "The short and mid-length questions will test your synthesis and application of knowledge from across the term.", "Self-isolation", "Notice of Recording", "The following basic principles may give us some guidelines:", "Late arrivals and early departures are very disruptive and violate the first basic principle.", "I will try to make class as interesting and informative as possible, but I can’t learn the material for you.", "On-campus exams end April 26, 2024", "You may experience stressors that can impact your personal well-being and academic experience, but there are multiple supports and resources available to you on and off-campus.", "Illness and Documentation", "Self-declaration of influenza-like illness", "Self-declaration of short-term absence", "Academic Regulations and Accommodations", "Death of a family member: a copy of the death certificate, a copy of the obituary or a link to the online obituary.", "Co-op Interviews", "You can submit an Interview Conflict form by following these steps:", "Select the sub-category based on your current situation.", "Interview location accommodation required - interview at UW interview site other than my home campus (for Architectural Engineering and Architecture students)"]}, {"course_id": 68, "course_code": "KIN 343", "course_name": "KIN343 - Micronutrient Metabolism (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["KIN 343", "KIN 343 001", "KIN 343:", "This course examines the metabolism of vitamins and minerals in the context of normal human development and aging with an emphasis on disease prevention and understanding the pathogenesis of deficiencies and toxicities.", "The function and role of vitamins and minerals will be discussed in specific groupings.", "View requirements for KIN 343", "Describe the metabolism of specific vitamins and minerals in humans.", "Identify and understand roles that micronutrients play in normal human health.", "Some concepts are straightforward, but others have integrated components and are more complex.", "Introduction to Micronutrients, Dietary Reference Intakes", "Finish: Introduction to Micronutrients, Dietary Reference Intakes", "Vitamin D, Calcium", "Start: Fluoride, Magnesium, Phosphorus, Vitamin A & BCMO Polymorphism", "(Vitamin D and Calcium)", "Fluoride, Magnesium, Phosphorus, Vitamin A & BCMO Polymorphism", "(Vitamin D and Calcium)", "Fluoride, Magnesium, Phosphorus, Vitamin A & BCMO Polymorphism", "Finish: Fluoride, Magnesium, Phosphorus, Vitamin A & BCMO Polymorphism", "(Fluoride, Magnesium, Phosphorus, Vitamin A & BCMO Polymorphism)", "(Fluoride, Magnesium, Phosphorus, Vitamin A & BCMO Polymorphism)", "End-of-term", "The 6th edition is often available at a substantially reduced cost compared to the 7th edition, and on-line versions are available.", "You must start the test prior to the end of test period for that section, taking care to allow yourself sufficient time to complete the test before the test period closes.", "Library for research-based assignments"]}, {"course_id": 69, "course_code": "KIN 407", "course_name": "KIN407 - Cardiovascular Pathophysiology (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "KIN 407", "KIN 407 001", "E-mail: jncohen@uwaterloo.ca", "View requirements for KIN 407", "KIN 407 is an upper-year physiology course focused on the pathology, risk factors, and treatment strategies related to cardiovascular conditions.", "Major emphasis is placed on the physiological systems impacted by cardiovascular disease, as well as the pharmaceutical and lifestyle strategies to mitigate adverse changes.", "Students will apply knowledge from prerequisite courses in the context of cardiovascular disease, incorporating exercise and activity strategies in case-based scenarios throughout the term.", "Students will ultimately work towards basic skills in cardiovascular diagnostic evaluation, interpretation, and simple exercise prescription.", "Identify how cardiovascular systems are impacted by major chronic diseases/conditions", "Interpret common diagnostic tests to evaluate cardiovascular function", "Incorporate basic pharmaceutical knowledge to evaluate management of major chronic diseases/conditions at rest and during exercise", "Provide basic exercise recommendations to mitigate adverse consequences of diseases/conditions according to published guidelines", "Introduction and Epidemiology", "Electrocardiography", "12-lead ECG Abnormalities", "Coronary Artery Disease", "Ultrasound Experience in LEC", "Peripheral Artery Disease", "Peripheral Artery Disease", "PAD Response in LAB", "Standing response in LEC", "Manual BP in LEC", "Takotsubo + Suspension Syndromes", "Clinical Exercise Physiology 5th edition by Ehrman, Gordon, Visich & Keteyian This is an optional reference textbook.", "Using a standard report form from LEARN, you will systematically work your way through each lead to identify electrical features and provide general interpretation on the results.", "If multiple reports are submitted, only the first one will be graded.", "A limited number of spots will be available in each section on a first-come-first-serve basis.", "Sign-up for sessions will occur the second week of classes.", "Lab 2 - Journal article review: If it is not possible to attend one of the above experiences, students may instead submit a critical evaluation of a primary journal article investigating a new cardiovascular condition with relations to topics discussed in lecture.", "Each Test will be composed of multiple choice and short-answer questions.", "The multiple choice questions will be application-based and will require integration of knowledge from basic physiology to application in clinical populations.", "The short-answer questions will evaluate your critical thinking and extrapolation of the course content to related fields and scenarios.", "Notice of Recording", "All email communications should include the course title (KIN 407) in the subject line, as well as your full name in the body of the text."]}, {"course_id": 71, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 72, "course_code": "PSYCH 101", "course_name": "PSYCH101 - Introductory Psychology (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Email: nhwegenschimmel@uwaterloo.ca", "One challenge of online course work can be the absence of a social network.", "There are two discussion boards set up for you to communicate with your classmates to facilitate your success in the course.", "Please be generous in your participation on these discussion boards, returning occasionally to read and respond to your classmates.", "The goal here is to facilitate communication between students and to reduce redundancies in correspondence, which can be overwhelming in online formats.", "A general survey course designed to provide the student with an understanding of the basic concepts and techniques of modern psychology as a behavioural science.", "Introductory Psychology will introduce students to the fundamental theories, concepts, methods, and issues encountered in the field of psychology.", "In addition to learning the core concepts of the field, this course is also meant to instruct the student in the scientific method (as it is used in the social sciences), to give students insight into themselves and their relationships with others, and to develop skills that will help students be successful in university and beyond.", "Explain and apply the core concepts of psychology.", "This will provide a foundation of knowledge upon which you can build in upper year psychology courses.", "Gain greater insight into yourself, others, and the human condition: Apply core concepts to yourself and others; recognize and value human diversity.", "Module 10: Behaviour in Groups", "Introduction to psychology.", "Introduce Yourself Non-completion -2%", "Extensions for extenuating circumstances may be granted at the discretion of the instructor.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 73, "course_code": "PSYCH 101R", "course_name": "PSYCH101R - Introductory Psychology (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["10:00AM - 11:20AM REN 2106", "serena.mcdiarmid@uwaterloo.ca", "11:30AM -", "serena.mcdiarmid@uwaterloo.ca", "Instructor - Serena McDiarmid, MASc, BEd, Sessional Instructor, Social Development Studies", "serena.mcdiarmid@uwaterloo.ca Pronouns she/her", "“I went to the University of Waterloo for my undergraduate degree in health studies and even took some courses at Renison!", "I loved learning about people and ways I could help them, but I also felt a lot of pressure to get high grades and stand out.", "I realized that mistakes were okay and a normal part of learning, and that a bad grade didn't make me a bad person.", "Instructor - Cameron Smith, PhD, Sessional Professor, Social Development Studies", "“I began my university career in Mathematics and Business Administration.", "I remember feeling like I went from being a big fish in a little pond to being a guppy in the ocean.", "It honestly took me a few years before I really felt like I knew what I was doing and got used to studying at a university level.", "Q: Can I play the two professors off of each other like a sitcom Mom and Dad?", "A general survey course designed to provide the student with an understanding of the basic concepts and techniques of modern psychology as a behavioural science.", "We will explore topics ranging from human development throughout the lifespan, to learning and memory, to psychological disorders and the therapies that are used to treat them.", "Explain key concepts from across the discipline of psychology using appropriate terminology.", "Describe the methods of investigation used in psychology, and the strengths and limitations of these methods.", "Identify and communicate the influence of psychological concepts on behaviour and/or systems in everyday situations.", "Apply the findings of psychological research to your life and to important issues in our society and the world at large.", "Sept 11 & 13: Human Development", "Prof. Smith", "Sept 18 & 20: Research Methods", "Prof. Smith", "Sept 27: Senses & Perception", "Prof. Smith", "Prof. Smith", "Prof. Smith", "Prof. Smith", "It is available through a number of different avenues.", "Digital e-version can be purchased at https://uwaterloo-store.vitalsource.com/products/psychology-in-modules-david-g-myers-c-nathan-v9781319355487?term=9781319132095.", "Although we do not officially recommend it using the 12th edition, the differences in these editions are not major.", "From our experience, students can build their skills in note taking, studying, understanding concepts, and test-taking as the term goes on.", "Each quiz contributes to students’ grade enough to make the time and effort they put into it worthwhile, but not so much that a particularly challenging week in their lives will have a significant impact on their final grade.", "Quizzes are multiple choice", "If you want to help a friend succeed, there are other ways to do that without committing academic misconduct - such as studying together.", "*", "As students in this course, you will be exposed to many new ideas and concepts that other people in your life would find useful and interesting!", "In this assignment, your goal is to choose one of the concepts introduced in the first five weeks of class and teach someone else about it.", "Ideas of what videos could look like:", "A narrated slideshow", "A persuasive speech", "A doodle video", "Your co-workers", "The information must be accurate and demonstrate a depth of understanding about the meaning and significance of the concept/topic.", "You will also be exposed to new ideas that relate strongly to your own life.", "How was the concept/theory relevant to the situation?", "Sona Participation and Research Experience Marks", "Participation enables students to learn first-hand about psychology research and related concepts.", "Educational focus of participation in research", "To maximize the educational benefits of participating in research, students will receive feedback information following their participation in each study detailing the following elements:", "Provisions to ensure confidentiality of data", "Participation in remotely operated and in-person in lab studies has increment values of 0.5 participation credits (grade percentage points) for each 30-minutes of participation.", "**", "Identify the psychological concepts in the article and indicate the pages in the textbook that are applicable.", "Clearly evaluate the application or treatment of those concepts in the article.", "Accommodation for Students with Disabilities", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Do you want professors and interviewers to call you by a different first name?"]}, {"course_id": 74, "course_code": "PSYCH 261", "course_name": "PSYCH261 - Physiological Psychology (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Introduction to brain, basic physiological processes, and their roles in behaviour.", "Both experimental and clinical data are considered.", "Familiarise you with the theoretical and philosophical underpinnings of physiological psychology;", "Teach you about the physiological mechanisms underlying human sensory and perceptual systems; and", "Provide you with insights into the basic physiological and mechanisms involved in behaviour, cognition, emotion and consciousness.", "Week 1: Introduction and History", "Sona Participation and Research Experience Marks", "Students may complete any combination of these options to earn research experience grades.", "Credits for online courses can be earned through any combination of studies as noted above.", "Participation enables students to learn first-hand about psychology research and related concepts.", "Educational focus of participation in research", "To maximize the educational benefits of participating in research, students will receive feedback information following their participation in each study detailing the following elements:", "Provisions to ensure confidentiality of data", "**", "Identify the psychological concepts in the article and indicate the pages in the textbook that are applicable.", "Clearly evaluate the application or treatment of those concepts in the article.", "If such a conflict arises, the Associate Chair for Undergraduate Affairs is available for consultation and to mediate a resolution between the student and instructor."]}, {"course_id": 75, "course_code": "SDS 150R", "course_name": "SDS150R - Lifespan Processes (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["This course is an introduction to human development that spans conception to death.", "View requirements for SDS 150R", "This course is an introductory to human development that spans conception to death.", "It provides an overview of events which occur throughout the life course and consideration for how these may impact healthy development.", "The course applies a bio-psycho-social perspective and a scientific approach to understanding lifespan development.", "Human growth will be explored according to how biological and psychological determinants as well as how social environment impacts development.", "Describe key life events from conception to death", "Identify and describe major lifespan phases", "Define key changes and characteristics of each phase of life", "Implement the bio-psycho-social perspective and a scientific approach to lifespan issues", "Relate developmental theories and lifespan concepts to real-life situations", "Connect lifespan concepts to yourself and others, considering their implications", "1 Jan 6-10 Orientation, Introduction, and Basic Concepts Chapter 1", "2 Jan 13-17 Theories and Methods Corresponding chapters for your group presentation", "Class Attendance/Contribution and Peer Review 25%", "Class Attendance/Contribution and Peer Evaluation", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Anti-racism statement", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 76, "course_code": "SOC 101", "course_name": "SOC101 - Introduction to Sociology (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Introduction to Sociology Winter 2025", "**To best prepare for our meeting, please provide a brief description of the topic under consideration.", "An introduction to the basic concepts and frames of reference of sociological investigation and interpretation.", "You will be able to describe and explain the theoretical and methodological tools sociologists use to examine the social world.", "University of Waterloo: Introduction to Sociology – 2nd Canadian Edition", "Late assignments will result in a penalty of 5% for each 24-hour period.", "Late assignments will result in a penalty of 5% for each 24-hour period", "*Please note that confusion over submitting to the dropbox is not a valid reason for a late assignment."]}, {"course_id": 80, "course_code": "ARBUS 202", "course_name": "ARBUS202 - Professional and Business Ethics (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["11:30AM -", "V. Fernandes", "Study of ethical and moral issues that typically arise in professional and business activity.", "In the context of this course we will look specifically at ethical issues and principles of conduct that are relevant to professionals and business people.", "Topics include: fundamentals of moral and political theory, ethical decision-making, professional responsibility, corporate social responsibility, and equality, among other things.", "Like many other courses in philosophy, this series of lectures, readings, and discussions will deal with a critical analysis of many and varied views regarding life, existence, values, religious belief, etc.", "Form an opinion on the importance of ethical reasoning in business and professional contexts.", "Identify ethical problems in complex professional and business related situations.", "Apply ethical concepts to particular business and professional situations.", "Explain the roles of professional codes of conduct and codes of ethics in real world contexts.", "1 Jan 6 - 10 Introduction", "Module 2 Check-in", "3 Jan 20 - 24 Ethical Decision Making", "Module 3 Check-in", "5 Feb 3 - 7 Equality & Discrimination", "Module 6 Check-in", "7 Feb 24 - 28 Markets & the Environment", "Module 7 Check-in", "Module 9 Check-in", "Module 10 Check-in", "11 Mar 24 - 28 Whistle-blowing and Codes of Ethics", "Module 11 Check-in", "Module 12 Check-in", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 81, "course_code": "INDEV 300", "course_name": "INDEV300 - Culture and Ethics (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM UTD 201A", "Can two competing ethical viewpoints both be right?", "How can we negotiate the difficulties that such differences pose for our practical judgment and moral theorizing?", "Students will engage these questions by reading texts in philosophical ethics and meta-ethics, and by applying what they have learned in case studies of ethical differences among cultures.", "View requirements for INDEV 300", "This course examines the politics and politicization of human differences, and the politics and politicization of “culture”.", "understand and argue issues from multiple perspectives", "understand the politics and consequences of a particular argument", "advocate and lobby", "Monday 6th January                Topic: International Development and the Body", "Medical Anthropology Quarterly, 18(1), 77–103. https://doi.org/10.1525/maq.2004.18.1.77", "Medical Anthropology Quarterly, 1(1), 6-41. https://doi.org/10.1525/maq.1987.1.1.02a00020", "With reference to Pfeiffer, Douglas, and Lock and Scheper-Hughes, critically examine why international development should pay attention to the significance of the human body.", "APA compliance (0.5 deducted for each type of error)     20", "Legislating against culture: Efforts to end pharaonic circumcision in the Anglo-Egyptian Sudan.", "Genital cutting: The past and present of a polythetic category.", "Plastic Surgery", "Towards a biopolitics of beauty: Eugenics, aesthetic hierarchies and plastic surgery in Brazil.", "Design a campaign for OR against a Body Modification Bill.", "In what year was it passed?", "APA compliance (0.5 deducted for each type of error)     20", "Monday 24th February and Monday 3rd March", "‘The stubborn persistence of patriarchy?’", "Find a creative format and way to make FOUR main points and ONE overarching argument about the similarities and differences between:", "Huntington and Tsing", "To put it another way, find a news story about a development project that addresses culture in some way.", "Make the story central to your essay.", "Rubric", "Clarity and quality of four main points                                       20", "APA compliance (0.5 deducted for each type of error)                 10", "Total", "Many texts No much much less than a ticket to a Taylor Swift concert", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 82, "course_code": "PHIL 121", "course_name": "PHIL121 - Moral Issues (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Email: mdoucet@uwaterloo.ca", "Email: kwoodend@uwaterloo.ca", "This course surveys several controversial moral topics, and a range of philosophical views on each.", "This course explores several pressing moral issues and considers some of the ways that the tools of Philosophy can help us to better understand and address those issues.", "Second, I hope the course equips you with a range of philosophical skills and concepts with which to navigate these ethical challenges, and that these skills and concepts prove useful in studying topics other than ethics.", "To achieve them, I have several more specific learning objectives, which can be roughly grouped in three categories.", "Accurately summarize several contemporary moral issues", "Explain, in writing, key concepts and arguments in moral philosophy", "Analyze contested moral issues by applying concepts from moral philosophy", "Identify and assess the morally significant values and and competing interests at play in a range of contemporary debates", "Develop your own moral views", "Read and critically evaluate a range of philosophical texts", "Discuss and debate philosophical issues with your peers in small groups and in full class discussion", "Write clear, well-structured explanations and assessments of philosophical arguments", "Advance your on philosophical arguments, in writing and in discussion", "Recognize the importance of moral questions, and of moral philosophy in answering those questions", "Appreciate the complexity of moral problems, and the difficulty of solving them", "Identify, using philosophical tools and concepts, some previously overlooked real-world moral issues", "Most of the readings are relatively short, but some of them can be difficult.", "Jan 22 Broome, ‘The public and private morality of climate change’, Battersby, ‘Can humanity escape the tragedy of the commons?’", "Jan 29 Sinnott-Armstrong, ‘It’s not my fault: Global warming and individual moral obligations’", "Feb 3 Baatz, ‘Climate change and individual duties to reduce GHG emissions’", "March 5 Engel, ‘The commonsense case for ethical vegetarianism’", "March 10 Hsiao, ‘In defense of eating meat’", "March 17 Essay workshop Essay workshop", "March 24 TBD", "Summarize two different perspectives on a moral issue.", "Identify the main argument for each perspective.", "You need to submit two Argument Summaries over the course of the term, and you have a total of five opportunities: one for each topic we’ll discuss.", "You cannot submit Argument Summaries past the deadline for each topic.", "The test will assess your understanding of the material covered in the first two topics, and will include a mix of question formats, including multiple choice and longer multi-paragraph answers.", "The test will focus on assessing your understanding of the material covered since the midterm test (i.e. the final three topics), but some questions may still draw on concepts introduced in the first half of the course.", "The test will include a mix of question formats, including multiple choice and longer multi-paragraph answers.", "Library for research-based assignments", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 83, "course_code": "PHIL 215", "course_name": "PHIL215 - Professional and Business Ethics (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["11:30AM -", "V. Fernandes", "Study of ethical and moral issues that typically arise in professional and business activity.", "In the context of this course we will look specifically at ethical issues and principles of conduct that are relevant to professionals and business people.", "Topics include: fundamentals of moral and political theory, ethical decision-making, professional responsibility, corporate social responsibility, and equality, among other things.", "Like many other courses in philosophy, this series of lectures, readings, and discussions will deal with a critical analysis of many and varied views regarding life, existence, values, religious belief, etc.", "Form an opinion on the importance of ethical reasoning in business and professional contexts.", "Identify ethical problems in complex professional and business related situations.", "Apply ethical concepts to particular business and professional situations.", "Explain the roles of professional codes of conduct and codes of ethics in real world contexts.", "1 Jan 6 - 10 Introduction", "Module 2 Check-in", "3 Jan 20 - 24 Ethical Decision Making", "Module 3 Check-in", "5 Feb 3 - 7 Equality & Discrimination", "Module 6 Check-in", "7 Feb 24 - 28 Markets & the Environment", "Module 7 Check-in", "Module 9 Check-in", "Module 10 Check-in", "11 Mar 24 - 28 Whistle-blowing and Codes of Ethics", "Module 11 Check-in", "Module 12 Check-in", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 86, "course_code": "PHIL 221", "course_name": "PHIL221 - Ethics (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["The first three sections of the course use a combination of historical and contemporary texts to survey three of the major moral theories in the Western philosophical tradition: utilitarianism, deontology, and virtue ethics.", "Each theory articulates a very different vision of the good life, of the nature and value of happiness, and of what makes an action or a person morally good.", "Discussing these three theories—their content, their implications, and their pros and cons—provides an excellent introduction to some of the main trends and debates in moral philosophy, both historically and in the present day.", "In the final section of the course, we will take up a range of very different skeptical challenges to the project of moral philosophy as conceived in the tradition of the three dominant moral theories mentioned above.", "How (if at all) are race and gender relevant to our moral thinking?", "Second, this course should equip you with a range of philosophical skills and concepts with which to navigate these ethical challenges, some of which will likely prove useful in studying topics other than ethics as well.", "Summarize, explain, and apply some of the main objections to these moral theories.", "Critically evaluate the strengths, weaknesses, implications, and assumptions of core arguments in moral theory.", "Write clear, well-structured explanations and critical assessments of philosophical arguments.", "Advance, in clear and well-structured prose, your own well-reasoned moral arguments.", "Recognize the importance of many moral questions, and the importance of moral theory (broadly understood) as a means of answering those questions.", "Appreciate the complexity of moral problems, and the difficulty of solving them.", "A reliable internet connection and regular checking of the course site (at least twice a week) is therefore mandatory.", "This course involves the independent development and practice of specific skills, such as critical thinking, evaluation of ideas and arguments, and academic writing.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 88, "course_code": "PHIL 226", "course_name": "PHIL226 - Biomedical Ethics (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Biomedical Ethics Winter 2024", "I will have in-person drop-in office hours on Mondays and Wednesdays 1:15-2:15 in Hagey Hall 322A. You can also request an appointment by emailing me and letting me know your availability as well as whether you prefer virtual or in-person.", "If you are in a debate club, your goal is to defeat your opponent.", "Philosophy is not a debate club.", "First, I will describe the overall structure of the course.", "There will be a multiple choice Learn quiz on Unit 1.", "Third, we spend three classes learning about some general ethical concepts relevant to bioethics: utilitarianism, care ethics, and relational autonomy.", "One is a multiple choice Learn quiz on the readings from the first four classes of Unit 2.", "Just like in Unit 2, there will be a multiple choice Learn quiz on the readings from the first four classes, an in-class test that guides you into writing a first rough draft of your essay, and an essay assignment.", "Unit 1: Some Examples of Ethical Reasoning and Argumentation", "In-Class Test that will have questions that guide you into writing a first rough draft of Essay 1", "I will bring a small number of printed copies for borrowing.", "In A Companion to Bioethics, 2nd edition, edited by Helga Kuhse and Peter Singer, 85-90.", "In The Feminist Health Care Ethics Research Network, Susan Sherwin Coordinator, The Politics of Women’s Health: Exploring Agency and Autonomy, 19-47.", "“Conscientious Objection in Medicine: Accommodation versus Professionalism and the Public Good.”", "“The Best Interests Standard as a Logic of Empire: Unpacking the Political Dimensions of Parental Refusal.”", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Monday March 25", "It is a multiple choice quiz that should not take too long to complete.", "Instructions for the In-Class Tests", "An In-Class Test will have questions that guide you into writing a first rough draft of your essay", "You should study one reading from the first six classes of the relevant Unit", "I will bring a small number of printed copies for borrowing.", "A test that is assessed as Pass receives a grade of 50.", "A test that is assessed as Fail receives a grade of 0.", "Instructions for the Essays", "Introduction (about 75-125 words)", "You are not allowed to use GenAI during the In-Class Tests that guide you into writing a first rough draft of your essay, but you are allowed to use GenAI during the process of getting from your first draft to your final version of your Essay.", "Every philosopher I have met says this.", "Talking - Yes", "Getting Suggestions - No", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:"]}, {"course_id": 90, "course_code": "PHIL 319J", "course_name": "PHIL319J - Ethics of End-of-Life Care (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["PHIL 319J", "Email: adhstumpf@uwaterloo.ca", "What options does a person reaching the end of life have and how can they best be cared for?", "How can we balance patient autonomy with the expertise of the health-care provider and the demands of the health-care system?", "This course will help students think philosophically and critically about issues like these in their cultural, historical, and legal context.", "View requirements for PHIL 319J", "Understand the basic concepts of applied ethics in general and bioethics in particular", "Identify the central ethical issues in end of life care", "Appreciate diverse understandings of the significance of dying and death", "Assess the ethical arguments for and against assisted death", "Form creative and educated strategies for improving the end-of-life experience", "Week Topic(s) Readings*", "Health Care Ethics: History, Theory & Practice", "Advance Care Planning (ACP) & Substitute Decision-Making + Escape Room Activity", "The Meaning of Dying and Death", "“Death and Decisions”", "Assisted Death – Concepts & Context", "Stumpf & Rogalski, “Getting Real…”", "Biomedical Ethics, “Voluntary Active…”; Foley, “Compassionate Care…”; Snyder, Sulmasy & Mueller, \"Ethics and...\"", "Hospice / Palliative Care & MAID", "Herx & Ebru, \"Palliative Care and MAID\"", "Assisted Living & Long-Term Care", "Dementia and Person-Centred Care", "Please look them over online and decide which one you will acquire.", "I have a copy of each of these two books available on reserve in the St. Jerome's library.", "You can borrow one of these copies for a set amount of time.", "“Death and Decisions Regarding Life-Sustaining Treatment,” Chapter 5 of Biomedical Ethics, 7th edition, Mappes, DeGrazia and Brand-Ballard, eds.", "Snyder, Sulmasy L & Mueller PS, for the Ethics, Professionalism and Human Rights Committee of the American College of Physicians.", "Stumpf, A., Rogalski, D. “Getting Real About Killing and Allowing to Die: A Critical Discussion of the Literature,” Canadian Journal of Bioethics 2021, 4, 8-24; https//doi.org/10.7202/1084448ar.", "“Voluntary Active Euthanasia and Physician-Assisted Suicide,” section 5.3 of Biomedical Ethics: A Canadian Focus, 2nd edition.", "Each Assisted Death Quiz will cover a major aspect or angle of the debate over the ethical permissibility of \"Medical Assistance in Dying\" in Canada.", "The focus of the exam will be to consider ways in which end-of-life care can be improved, from an ethical point of view.", "The exam will contain a multiple-choice section and an essay question section.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Anti-racism statement", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "The Point: My goal is to see what you know and what you can produce, not what an AI generator “knows” and can “do.”", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 0, "course_code": "STAT 330", "course_name": "STAT330 - Mathematical Statistics (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Mathematical Statistics Winter 2025", "10:30AM - 11:20AM DC 1351", "This course provides a mathematically rigorous treatment for topics covered in STAT230 and 231, and to make essential extensions to the multivariate case.", "Topics covered include independence of random variables, conditional expectation and the determination of the distribution of functions of random variables using the cumulative distribution method, change of variable and moment generating functions.", "Asymptotic properties of the maximum likelihood estimator are examined and used to construct confidence intervals or regions.", "Tutorial: tutorials will be used for going over solutions of practice problem sets and holding term tests.", "Have a deep understanding of various mathematical aspects of Statistics and Probability.", "Week 4 Chapter 3. Expectation & M.G.F. Term Test 1 January 28th", "Asymptotic Distributions", "Introduction to Probability and Mathematical Statistics by Bain and Engelhardt, Second Edition No 112", "Arrangements for students with official conflicts will be handled on a case by case basis."]}, {"course_id": 1, "course_code": "STAT 331", "course_name": "STAT331 - Applied Linear Models (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Applied Linear Models Winter 2025", "08:30AM - 09:50AM MC 4020", "02:30PM - 03:20PM", "RCH 101", "Thursdays from 3:00-4:00pm in M3 3021", "Modelling the relationship between a response variable and several explanatory variables (an output-input system) via regression models.", "Model diagnostics and improvement.", "Algorithms for variable selection.", "Review of basic Normal theory, t, chi-squared, and F distributions.", "Simple linear regression.", "Analysis of variance.", "Multiple linear regression, variable selection techniques, indicator variables, diagnostics.", "Brief introduction to non-linear regression, factorial experimentation.", "Registered students can enroll in the class discussion board through Piazza.", "Search for your question first before posting.", "Do not expect a full solution to your question.", "To help maintain a safe, respectful, and productive community in which we – students and teaching team alike – can take risks in our learning/teaching, tackle challenging concepts, and ultimately grow as learners, we should endeavor to follow these mutual expectations:", "Explain the main concepts of linear regression models.", "Understand the methods of least squares and maximum likelihood estimation for model parameters.", "Interpret the model and its parameters (e.g., regression coefficients) in the context of any application.", "Draw inferences from a fitted model about the parameters of interest and make predictions.", "Apply the previous two outcomes when fitting linear models to real data using R.", "Assess model quality by diagnosing violations in underlying model assumptions (and identify strategies for improvement).", "Evaluate competing fitted models built using various model selection methods (and choose between them).", "Introduction", "The Straight Line Model", "Model formulation and interpretation", "Least squares estimation", "Mean response and residual variance estimation", "Introduction to R/RStudio", "Maximum likelihood estimation", "Estimators and their properties", "Important distributions", "Distributions of estimators", "Confidence intervals", "O - Ch. 2-4", "Straight Line Model in R", "Prediction intervals", "Intervals in R", "Hypothesis testing", "O - Ch. 4-5", "ANOVA and F test", "Model limits", "Data transformations", "O - Ch. 4-6", "O - Ch. 7", "A1 and Q1 Solutions", "Multivariate normal distribution", "The Linear Model", "Examples", "O - Ch. 8-9", "Estimation", "Estimators and their properties", "Distributions of estimators", "O - Ch. 9, 11, 12", "ANOVA and F test", "Significance tests", "General linear hypothesis", "O - Ch. 9, 11, 12", "A2 and Midterm Solutions", "Case Study: South African heart disease", "Nested models", "Additional sum of squares", "O - Ch. 12", "Outliers", "O - Ch. 13-14", "Influence", "O - Ch. 14-15", "A3 and Q2 Solutions", "One-variable-at-a-time selection methods", "Criteria-based selection methods", "O - Ch. 16", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solve exercises from the textbook on your own.", "Introduction to Regression Modeling by Abraham and Ledolter This textbook is an optional reference book (available for free on LEARN).", "R and R-Studio Free software.", "To serve as an opportunity to demonstrate your understanding, application, and integration of the course material, including practical application of the skills/concepts with the statistical software, R.", "Missed Assignment: The time window to complete these assessments are generous and, in general, a sickness lasting a couple of days will not be enough of a reason to ask for alternative accommodations and/or extension.", "Tips for Success", "Students should critically compare their work with available solutions and against the solutions of fellow classmates.", "Notice of Recording", "To help you decide if you should isolate, you can use the provincial self-assessment tool.", "In the scenario where we must transition back online the following contingencies will be used:", "These materials are made available for the personal use of students registered in the current offering of this course.", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical proofs and the fitting, interpretation, and assessment of linear models in real applications.", "Library for research-based assignments"]}, {"course_id": 2, "course_code": "STAT 332", "course_name": "STAT332 - Sampling and Experimental Design (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Sampling and Experimental Design Winter 2025", "Email: schonlau@uwaterloo.ca", "Designing sample surveys.", "Analysis of variance.", "Designing for comparison of groups.", "Sampling: explain the effect of the finite population correction", "Sampling: Design and analyze a stratified random sample", "Experimental: Explain factorial design", "Experimental: Compare and contrast experimental design and observational studies", "5 2025-01-21 6 regress A1 out", "15 2025-03-04 4 Anova/F-test", "Slides Online in learn Yes 0", "Slides:  I am reworking some slides and will post them one-by-one into learn before class.", "data collection) 2%", "Activities supporting in-class analysis: The in-class analysis will require data collection (and possibly other activities).", "All team members must meaningfully contribute to the analysis and to coding.", "Projects must not use data sets that one of the team members has used for similar projects in previous courses.", "You must write up solutions using your own words and write your own programs.", "Give a clear explanation as to why you think you deserve a different mark."]}, {"course_id": 3, "course_code": "STAT 333", "course_name": "STAT333 - Stochastic Processes 1 (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM DC 1350", "04:00PM - 05:20PM", "Erik Hintz: Fridays, 2:00pm - 3:00pm, in M3-2106", "Requests must be emailed to: sasugradadv@uwaterloo.ca", "Topics cover generating functions, conditional probability distributions and conditional expectation, discrete-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, applications including the random walk, the gambler's ruin problem, and the Galton-Watson branching process, an introduction to counting processes, connections between the exponential distribution and Poisson process, and non-homogeneous and compound Poisson processes.", "use moment generating functions as a tool to determine expected values and identify probability distributions of random variables;", "use the law of total expectation to calculate expected values and probabilities through the principle of conditioning;", "specify a discrete-time Markov chain (DTMC), in terms of its transition probability matrix and initial conditions, and calculate various transition probabilities;", "classify the states of a DTMC;", "define fundamental DTMC concepts including irreducibility, periodicity, and recurrence/transience;", "find limiting/stationary probability distributions for certain DTMCs through the use of the Basic Limit Theorem;", "calculate absorption probabilities and expected absorption times for DTMCs using the principle of conditioning with respect to the first transition;", "Week 11 March 24 - March 28 Chap 4: Exponential Distribution & Poisson Processes Tutorial Assignment 2", "Week 12 March 31 - April 4 Chap 4: Exponential Distribution & Poisson Processes Tutorial Test 3", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solving exercises from the Course Notes on your own.", "Introduction to Probability Models by Sheldon M. Ross (2019)"]}, {"course_id": 4, "course_code": "STAT 337", "course_name": "STAT337 - Introduction to Biostatistics (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Biostatistics Fall 2024", "This course will provide an introduction to statistical methods in health research.", "Topics to be covered include types of medical data, measures of disease prevalence and incidence, age and sex adjustment of disease rates, sensitivity and specificity of diagnostic tests, ROC curves, measures of association between risk factors and disease, major sources of medical data in the Canadian context including surveys, registries, and clinical studies such as cohort studies, clinical trials and case-control studies.", "Papers from the medical literature will be used throughout to illustrate the concepts.", "Introduction to SAS for data analysis and an introduction to database management tools.", "Quantify the morbidity and mortality in a population through the estimation and standard- ization of incidence and prevalence rates.", "Interpret the results from a study in the medical literature and identify the key components of a medical research question.", "Select an appropriate study design and outline the major design elements.", "Perform basic data management and analyses in SAS.", "Select an appropriate measure of association and statistics analysis methodology for a given design.", "Calculate estimates and conduct hypothesis testing.", "Communicate the results of a completed analysis to both statistician and non-statisticians.", "The goal of this tutorial is to equip students with a basic understanding of SAS so that as their statistical education progresses they can continue to perform more complex analyses.", "The exercises are designed to align with material from each module and highlight important concepts covered during that module.", "Wed Sep 18 M2.1 Introduction to study designs Ch 3, Ch 4", "Wed Oct 2 M3.1 Causation & confounding Ch 1, S6.6, S10.1-10.2, S10.5, S11.1, S11.3 A1 due 11:59 pm", "6 Mon Oct 7 M3.2 Multiple linear regression Ch 16 (except S16.3)", "Wed Oct 9 M4.1 Case-control studies S7.1-7.2, S7.4-7.5", "Fri Oct 11 T5 Linear regression T4 Due 12:30pm T4 due 12:30 pm", "Fri Oct 25 T6 Analysis of case-control studies   T5 due 12:30 pm", "11 Mon Nov 11 M6.1 Diagnostic testing & screening   A4 released week of Nov 11", "Wed Nov 20 M7.2 Clinical life tables", "Wed Nov 27 M7.4 Advanced topics", "Epidemiology and Biostatistics: An Introduction to Clinical Research.", "You can also access a digital copy from https://ocul-wtl.primo.exlibrisgroup.com/permalink/01OCUL_WTL/vk29fk/alma999986675044305162", "I am thus allowing each one of you a one time 1 or 2-day extension on an assignment with a reduced lateness penalty.", "Note for your circumstance to be deemed valid you must have been incapacitated for a significant portion of the three-week assignment window.", "Supporting documentation for illnesses refers to completing a Verification of Illness Form (VIF) or a self-declared short-term absence in Quest.", "This course includes the independent development and practice of specific skills, such as learning to use the SAS statistical software package, managing data with SAS, completing the statistical analysis of health and medical data, and interpreting results of the analysis.", "Library for research-based assignments"]}, {"course_id": 5, "course_code": "STAT 431", "course_name": "STAT431 - Generalized Linear Models and their Applications (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Generalized Linear Models and their Applications Winter 2025", "Review of the normal linear model and maximum likelihood estimation; regression models for binomial, Poisson and multinomial data; generalized linear models; and other topics in regression modelling.", "The primary objective of this course is to introduce students to generalized linear models.", "Attention will be mainly directed towards theory and applications involving binary, categorical, and count data, although the generalized linear model will be presented in its full generality for responses from the exponential family.", "This course introduces several useful regression techniques for the analysis of data arising in many different settings (ie， medicine, industry, psychology etc.).", "The intended audience consists of students interested in advanced regression modeling.", "The objectives are to help students develop an understanding of the statistical theory and to equip them with the ability to fit regression models for a wide range of problems.", "run generalized linear regression for binary, categorical and count data and have a deep understanding of the underlying theories.", "Week 7 Dose-Response Models Lecture 11", "An Introduction to Generalized Linear Models by Dobson, AJ and Barnett, AG, fourth edition No 92", "Software: Students are encouraged to use R for coding problems in assignments, but feel free to use any computing software you feel comfortable with.", "An introduction to R: https://cran.r-project.org/doc/manuals/r-release/R-intro.pdf.", "Arrangements for students with official conflicts will be handled on a case by case basis."]}, {"course_id": 6, "course_code": "STAT 437", "course_name": "STAT437 - Statistical Methods for Life History Analysis (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Statistical Methods for Life History Analysis Winter 2025", "Email: liqun.diao@uwaterloo.ca", "Email: y679zhao@uwaterloo.ca", "Statistical methods for the analysis of longitudinal data; hierarchical models, marginal models, and transitional models.", "Parametric and semiparametric methods for the analysis of survival data under censoring and truncation.", "This course covers a wide range of topics pertaining to the statistical analysis of data from prospective studies.", "For longitudinal data, likelihood-based methods will be covered based on hierarchical mixed effect models and transitional models.", "The material on event history analysis will primarily involve an introduction to the analysis of survival data with some introduction to the modeling of censoring, truncation and more complex sampling processes.", "Course Information Webpage", "Please do not send these questions via email.", "I expect everyone to be respectful to each other, any posts that do not meet the principles in Policy 33: Ethical Behaviour will be removed.", "Response time: You can expect a response within approximately 24-48 hours during the week.", "Email", "Continuity Plans", "Describe, interpret, and communicate results from the various estimation techniques for longitudinal models, contrasting interpretations across models.", "Know the features of time to event data, particularly with respect to censoring and truncation mechanisms.", "Understand parametric estimation for both discrete and continuous time to event models.", "Monday", "Friday", "Classes Begin", "Welcome, Introduction to Longitudinal Data", "A Review of Linear Regression, Linear Marginal Model", "A1 Released", "Linear Marginal Model", "Linear Marginal Model,", "A1 Due", "Mixed Effect Model", "Mixed Effect Model", "Mixed Effect Model", "Introduction to Survival Data", "A4 Released", "A4 Due", "Nonparametric and Semiparametric Methods", "Presentation Slides and Final", "Analysis of longitudinal data.", "Singer & Willett.", "Klein & Moeschberger.", "R Statistical Software", "The second column gives the weight of each component.", "Your overall grade will be computed as a weighted summation over your grades on all assessments.", "Notice of Recording", "Short-term absence", "COVID-19-related absence", "No limits on number of submissions per term and only available during the formal lecture period", "In particular:", "Please inform us of these at the start of the course.", "Generative AI: This course includes the independent development and practice of specific skills, such as the fitting, interpretation, and assessment of models in real applications, reviewing research papers, and writing reports.", "Library for research-based assignments"]}, {"course_id": 8, "course_code": "AMATH 231", "course_name": "AMATH231 - Calculus 4 (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "02:30PM - 03:20PM", "Vector integral calculus-line integrals, surface integrals and vector fields, Green's theorem, the Divergence theorem, and Stokes' theorem.", "Applications include conservation laws, fluid flow and electromagnetic fields.", "An introduction to Fourier analysis.", "Frequency analysis of signals.", "Notice of Recording"]}, {"course_id": 9, "course_code": "AMATH 242", "course_name": "AMATH242 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 10, "course_code": "AMATH 250", "course_name": "AMATH250 - Introduction to Differential Equations (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Differential Equations Winter 2025", "Solving linear differential equations: first- and second-order scalar equations and first-order vector equations.", "The main purpose of the course is to explore how first and second order differential equations (DEs) are used to model physical systems and predict their behaviour.", "first order linear DE models of compartment problems, atomic decay, and bodies in motion;", "first order separable DE models of population growth;", "a first order exact DE model of the electric dipole;", "second order linear DE models for oscillatory systems such as mass-spring-damper systems and electrical circuits;", "second order nonlinear DE models for suspended cables and rocket motion;", "linear vector DE models of multiple compartment problems and species interactions.", "Both analytical solution techniques and qualitative methods (direction field analysis, dimensional analysis, and phase portraits) will be presented as ways to gain information about system behaviour.", "We will investigate conditions for existence, uniqueness, and continuity of solutions of both first and second order initial value problems, and for systems in the plane.", "Maple will be used to generate numerical and graphical solutions, to illustrate concepts graphically, and to explore model behaviour.", "increase your comprehension of some of the many ways that differential equations can help us understand the real world;", "develop your ability to understand a mathematical model for a specific situation;", "explore analytical and qualitative solution methods for first and second order differential equations, and the use of Maple; and", "Please choose only one of the two options below.", "Submission Instructions", "Copyright Notice", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as solving differential equations.", "Library for research-based assignments"]}, {"course_id": 11, "course_code": "AMATH 251", "course_name": "AMATH251 - Introduction to Differential Equations (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Introduction to Differential Equations (Advanced Level)", "Email: cbauch@uwaterloo.ca", "Email: apunnavajhala@uwaterloo.ca", "This course offers a more theoretical treatment of differential equations and solution methods.", "In addition, emphasis will be placed on computational analysis of differential equations and on applications in science and engineering.", "Newton's enthusiasm was due to his success in using differential equations to give the first mathematical description of planetary orbits.", "Can you imagine what his reaction would be to the present widespread use of differential equations, with applications ranging from the space shuttle guidance system to epidemic models and neural networks?", "learn how to solve simple differential equations", "understand how differential equations can be applied in various fields", "We will cover portions of the following chapters from Boyce & DiPrima, in order:", "Chapter 1: Introduction to DEs", "Chapter 2: First-order differential equations", "Chapter 3: Second-order differential equations", "Chapter 7: Systems of linear equations", "Chapter 8: Numerical methods", "Chapter 9: Nonlinear differential equations and stability", "Elementary Differential Equations and Boundary Value problems.", "Assignments are to be brought to the start of lecture as a hard copy.", "Notice of Recording", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 12, "course_code": "AMATH 350", "course_name": "AMATH350 - Differential Equations for Business and Economics (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Differential Equations for Business and Economics Winter 2025", "11:30AM - 12:20PM MC 4045", "First order ordinary differential equations.", "Applications to continuous compounding and the dynamics of supply and demand.", "Higher order linear ordinary differential equations.", "Systems of linear ordinary differential equations.", "Introduction to linear partial differential equations.", "Ordinary differential equations and their applications", "Systems of linear ordinary differential equations", "Linear partial differential equations and Fourier transform", "Black-Scholes equation and solution", "(Jan 6-10) Introduction to Differential Equations (DEs), Separable Equations, Initial-Value Problems, Applications from Finance", "Dimensional Homogeneity, First-Order Linear Ordinary DEs, Use of Substitutions, Applications from Finance Chapter 2 Posting Assignment 1", "Introduction to Higher-Order Linear Equations: Theoretical Background", "Introduction to Systems of Ordinary Differential Equations, Method of Solution for Homogeneous Systems (Second Order)", "(Mar 3-7) Introduction to Partial Differential Equations, First-order Equations (Partial Integration, Method of Characteristics) Chapter 5", "Second-Order Linear PDEs: Classification, Solution by Partial Integration or Method of Characteristics Chapter 5", "Please submit your assignments early in case of unexpected technical difficulties."]}, {"course_id": 13, "course_code": "CS 371", "course_name": "CS371 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 14, "course_code": "MATH 239", "course_name": "MATH239 - Introduction to Combinatorics (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics Winter 2025", "11:30AM - 12:20PM MC 4059", "09:30AM - 10:20AM MC 4021", "P. Nelson", "08:30AM - 09:20AM QNC 1502", "S. Pfannerer-Mittas", "10:30AM - 11:20AM MC 4058", "11:30AM - 12:20PM MC 4058", "09:30AM - 10:20AM MC 4042", "02:30PM - 03:20PM", "10:30AM - 11:20AM PHY 150", "04:30PM - 05:20PM", "You should have no reason to contact them directly, but you can find their email addresses through Learn.", "First name Last name", "Guilherme Zeus Dantas E Moura", "Theodore Morrison", "Matthew Kroeker", "Introduction to graph theory: colourings, matchings, connectivity, planarity.", "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.", "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 15, "course_code": "MATH 249", "course_name": "MATH249 - Introduction to Combinatorics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics (Advanced Level)", "09:30AM - 10:20AM MC 2017", "For graph theory, while we will focus on the same topics covered in MATH 239 (planarity and bipartite matching), our coverage of those topics will differ substantially in depth and in the techniques that we employ; in particular, we will see striking applications of algebra.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 16, "course_code": "BIOL 239", "course_name": "BIOL239 - Genetics (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM", "10:30AM - 11:20AM STC 1012", "You can!", "Chromosomal mechanisms in mitosis and meiosis.", "Natural selection and the evolution of genetic systems.", "Describe the fundamentals of gene structure, function and transmission in prokaryotic and eukaryotic cells and organisms.", "Describe the various ways mutations can arise and how mutations may affect gene expression and phenotypic outcomes.", "Describe recombinant DNA technology in bacteria and its role in biotechnology.", "Effectively work with others, discussing, evaluating, and communicating genetics concepts and synthesizing ideas in a group.", "Readings", "textbook 1.1-1.2", "Mendelian genetics and probability", "Modification of Mendelian ratios", "textbook 3.2-3.3, 4.2-4.4, 15.1", "Mitosis, meiosis, and chromosome numbers", "DNA and the genetic code", "textbook 9.2-9.3", "T4: Mitosis and meiosis", "DNA cloning", "T5: Testing genetic ratios", "Cancer genetics", "T9: Population genetics", "Exam period", "- write the final exam and achieve a grade of at least 50% on the cumulative test and exam section", "Online learning activities: These activities are designed to test your knowledge of several important concepts explained by the lecture presentations in this course, and should be completed after the portion of the course when they are covered in lecture.", "They are all due toward the end of the term but can be completed as many times as you like to help you work on these concepts.", "Read the instructions carefully before attempting these as a completion quiz (in the quiz section) must also be completed to obtain credit.", "In this case, the weight of the missed submission will be transferred to the final exam.", "The dates affected and degree of incapacitation will be used to determine follow-up action."]}, {"course_id": 17, "course_code": "HLTH 101", "course_name": "HLTH101 - Introduction to Health 1 (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Health 1 Fall 2024", "K. Bishop-Williams", "Instructor: Kate Bishop-Williams", "This course will be of interest to students pursuing careers in health and those with a general interest in health and health care.", "Emphasis is on understanding the origins, factors and conditions that determine health throughout the lifespan, how these factors influence one another and the role/impact of health care.", "The Association of Faculties of Medicine in Canada (AFMC)", "As students, you and those close to you may experience a range of issues that can cause barriers to well-being and learning.", "Accommodations for Racial Trauma", "Have you experienced impacts of racism, racial trauma, racial violence, and are looking for academic accommodation options related to those experiences and impacts?", "Athletics and Recreation", "Empower Me - Student Assistance Program", "Office of Equity, Diversity, Inclusion & Anti-racism (EDI-R)", "Sexual Violence Prevention & Response Office", "You cannot split up each 24-hour slip day into a smaller number of hours amongst the assignments.", "Missed Discussions", "If you completely miss a week of one of these LEARN Discussions, you cannot make up the missed discussion.", "This discussion will simply be dropped and not counted towards your overall course grade.", "I acknowledge that most of the knowledge in health sciences taught in this course and others has been historically based a subset of privileged (mostly white, male) voices."]}, {"course_id": 20, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 21, "course_code": "MATH 247", "course_name": "MATH247 - Calculus 3 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Topology on RN: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. (~3 weeks)", "Differentiation: partial differentiability, differentiability, chain rule, [midterm likely here], Taylor polynomials, extreme value problems. (~4 weeks)", "Integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. (~3 weeks)", "Local properties of continuously differentiable functions:  open mapping theorem, inverse function theorem, implicit function theorem. (~2 weeks)", "11:30AM - 12:20PM QNC 2501", "Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem.", "Topology of real n-dimensional space: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. Differential calculus on multivariable functions: partial differentiability, differentiability, chain rule, Taylor polynomials, extreme value problems. Riemann integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem."]}, {"course_id": 0, "course_code": "AFM 112", "course_name": "AFM112 - Analytic Methods for Business 1 (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Analytic Methods for Business 1 Winter 2025", "AFM 112", "AFM 112 001", "Monday, Friday -", "11:30AM - 12:20PM ONLN - Online", "AFM 112 101", "Tuesday -", "The office hour on-campus location may change, please contact in advance for the exact room number", "AFM 112:", "This course introduces analytical methods commonly used in business for accounting and finance professionals.", "The course introduces students to the cross-industry standard process for data mining as an approach to business problem recognition and solving.", "Students also apply emerging technologies as a means to understand concepts such as variables, data types, subsets, formulas for creating derived variables, and simple models.", "View requirements for AFM 112", "This course introduces analytical methods commonly used in business for accounting and finance professionals.", "If you want to learn how the course fits the School of Accounting and Finance (SAF) data analytics curriculum, read How to Implement a Data Analytics Enabled Accounting Curriculum.", "Frame a business problem as a decision or question, applying CRISP-DM - step 1 in a simulated situation to identify required data elements.", "2. Develop an understanding of the data, applying CRISP-DM steps 2 & 3 in a simulated situation to describe the data and perform a simple statistical analysis of the data set.", "3. Build a spreadsheet-based model to solve a business problem, applying CRISP-DM - step 4 to run a modeling tool on a prepared data set.", "4. Build an R-based model to solve a business problem, applying CRISP-DM - step 4 to run a modeling tool on a prepared data set.", "5. Evaluate and communicate your analysis results in an engaging, attention-getting way, applying CRISP-DM - step 5 and visualization principles.", "Each of the School of Accounting and Finance’s Program Level learning outcomes identifies a knowledge, skill or value of a financial professional.", "These outcomes are organized into seven areas as reflected in the chart below.", "Knowledge Base for a Financial Professional Communication Capabilities Problem-Solving Capabilities Fluency in the Languages of Business, Entrepreneurship, and Technology Attributes / Qualities of a Financial Professional", "Frame a business problem as a decision or question, applying CRISP-DM - step 1 in a simulated situation to identify required data elements.", "X", "X", "X", "X", "2. Develop an understanding of the data, applying CRISP-DM steps 2 & 3 in a simulated situation to describe the data and perform a simple statistical analysis of the data set.", "X", "X", "3. Build a spreadsheet-based model to solve a business problem, applying CRISP-DM - step 4 to run a modeling tool on a prepared data set.", "X", "X", "X", "4. Build an R-based model to solve a business problem, applying CRISP-DM - step 4 to run a modeling tool on a prepared data set.", "X", "X", "X", "5. Evaluate and communicate your analysis results in an engaging, attention-getting way, applying CRISP-DM - step 5 and visualization principles.", "X", "X", "X", "X", "Frame a business problem as a decision or question, applying CRISP-DM - step 1 in a simulated situation to identify required data elements.", "2. Develop an understanding of the data, applying CRISP-DM steps 2 & 3 in a simulated situation to describe the data and perform a simple statistical analysis of the data set.", "3. Build a spreadsheet-based model to solve a business problem, applying CRISP-DM - step 4 to run a modeling tool on a prepared data set.", "4. Build an R-based model to solve a business problem, applying CRISP-DM - step 4 to run a modeling tool on a prepared data set.", "Week 4 Jan-24 - Jan-27 04 - Segment Analysis - Diagnostic Analytics Homework h4w03 Jan-24 7:00-8:20 pm", "Introduction to Data Analytics Process: From Spreadsheets to R and Python 1st", "Introduction to Data Analytics Process: From Spreadsheets to R and Python 1st", "Introduction to Data Analytics Process: From Spreadsheets to R and Python 1st", "R Code By: Prof. Ross Ihaka and Prof. Robert Gentleman Yes Free", "Team Peer Evaluations: At the end of the course you will be asked to complete a summative peer evaluation of each of the members of your team along with a self-evaluation.", "Written requests for re-grading a mid-term examination must normally be made within one week after the examination has been returned.", "Notice of Recording", "Second, accounting and financial professionals with AI will replace accounting and financial professionals.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 1, "course_code": "AFM 113", "course_name": "AFM113 - Analytic Methods for Business 2 (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Analytic Methods for Business 2 Winter 2025", "AFM 113", "04:00PM - 05:20PM", "10:00AM - 11:20AM EV3 1408", "AFM 113 005", "AFM 113 006", "04:00PM - 05:20PM", "AFM 113 201", "This is the second in a two-course sequence that introduces analytical and statistical methods commonly used in business for accounting and finance professionals.", "View requirements for AFM 113", "Throughout the course, we aim to answer an important question: How can we make reliable inferences about a population based on the limited information in a sample?", "Specifically, this course will introduce key statistical concepts, including probability distribution, sampling distribution, the central limit theorem, confidence intervals, hypothesis testing, and simple linear regression.", "Moreover, students will also apply these analytical and statistical methods using R in various accounting and finance contexts.", "Apply OLS regression to make informed accounting and financial decisions.", "Enhance critical thinking and the ability to interpret statistical results.", "Understand ethical considerations in statistical analysis, handle data responsibly, and present findings unbiasedly.", "By the end of the course, you will be able to: Knowledge Base for a Financial Professional Communication Capabilities Problem-Solving Capabilities Fluency in the Language of Business, Entrepreneurship, and Technology Ethical Conduct and Social Responsibility Leadership and Collaboration Attributes / Qualities of a Financial Professional", "Apply OLS regression to make informed decisions.", "X", "X", "X", "X", "X", "X", "X", "3. Conduct hypothesis testing and construct confidence interval to assess the reliability of statistical inference.", "X", "X", "X", "X", "X", "X", "X", "Enhance critical thinking and the ability to interpret statistical results.", "X", "X", "X", "X", "Understand ethical considerations in statistical analysis, handle data responsibly, and present findings unbiasedly.", "X", "X", "Apply OLS regression to make informed decisions.", "3. Conduct hypothesis testing and construct confidence interval to assess the reliability of statistical inference.", "Enhance critical thinking and the ability to interpret statistical results.", "Understand ethical considerations in statistical analysis, handle data responsibly, and present findings unbiasedly.", "W02: 01/13 - 01/17 Simple linear regression I", "W04: 01/27 - 01/31 Normal distribution I", "W12: 03/24 - 03/28 Simple linear regression II 2nd assignment is due*", "However, this can only be enforced during the midterm and final exams.", "Only a non-programmable, non-graphical, math faculty-approved calculator will be allowed for both exams.", "In these sessions, students will revisit the analysis presented in lectures.", "The first intends to assess students’ understanding of topics and concepts covered from Week 2 to Week 5.", "Each team (4 or 5 members) will work on a business analytics case and prepare a report to communicate the data analysis results to a non-technical audience.", "Written requests for re-grading a mid-term examination must normally be made within one week after the examination has been returned.", "Adverse weather", "In that case, we will transfer the weight of your midterm to the final exam.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 2, "course_code": "AFM 121", "course_name": "AFM121 - Introduction to Global Financial Markets (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Introduction to Global Financial Markets Winter 2025", "AFM 121", "AFM 121 001", "AFM 121 101", "AFM 121 102", "AFM 121 103", "08:30AM - 09:50AM PAS 1229", "AFM 121 104", "AFM 121 105", "AFM 121 106", "08:30AM - 09:50AM PAS 1229", "AFM 121 107", "08:30AM - 09:50AM EV3 4408", "AFM 121 108", "10:00AM - 11:20AM EV3 4408", "AFM 121 110", "Email: skiriwat@uwaterloo.ca", "AFM 121:", "This course is the first in a two-course sequence which offers an overview of global capital markets.", "The course describes the role of finance in the modern global economy, introduces the major classes of financial assets, and presents some basic foundational principles of financial decision-making.", "View requirements for AFM 121", "The 2:30 pm Monday online class can be accessed via Microsoft Teams:", "Please note: Students should not come to both Monday classes - online and in person.", "Email the instructors directly only for personal issues that cannot be shared in the public domain.", "Each of the School of Accounting and Finance’s Program Level learning outcomes identifies a knowledge, skill or value of a financial professional.", "These outcomes are organized into seven areas as reflected in the chart below.", "Knowledge Base for a Financial Professional Communication Capabilities Problem-Solving Capabilities Fluency in the Languages of Business, Entrepreneurship and Technology Ethical Conduct and Social Responsibility Leadership and Collaboration Attributes / Qualities of a Financial Professional", "Calculate the NPV of a series of cash flows utilizing annuity and perpetuity formulas in Excel.", "Explain and critique the purpose and function of financial markets.", "Demonstrate the ability to productively participate in team-based problem solving activities.", "X", "X", "Calculate the NPV of a series of cash flows utilizing annuity and perpetuity formulas in Excel.", "Explain and critique the purpose and function of financial markets.", "Demonstrate the ability to productively participate in team-based problem solving activities.", "Tutorial Financial Markets Chapters 1 - 3", "Tutorial Financial Assets Chapters 6 - 9, 11, 25", "Tutorial Financial Assets Chapters 6 - 9, 11, 25", "Tutorial Financial Assets Chapters 6 - 9, 11, 25", "March 17 (Monday) 10 Class Market Efficiency Chapters 15 - 16", "Tutorial Market Efficiency Chapters 15 - 16", "March 24 (Monday) 11 Class Market Efficiency Chapters 15 - 16", "Tutorial Market Efficiency Chapters 15 - 16", "The purpose of the classes is to review and discuss the concepts, theories and knowledge that are core to this course.", "The purpose of the tutorial sessions is to work through problems that provide application to these concepts, theories and knowledge via problem-based activities completed in teams.", "Stock Selection Presentation:", "Stock market indices", "Groups will present their findings and conclusions during the last tutorial.", "Maximum 5 minutes in length", "All team members must participate", "Analyze and comment on the movements in the stock prices picked by the experts vs. random stocks vs. stock market indices", "Maximum number of slides to be presented is 15; number of slides in the appendix available to support questions is unlimited", "Question period/defense of findings and conclusions", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 3, "course_code": "AFM 182", "course_name": "AFM182 - Foundations for Management Accounting (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM EXP 1689", "08:30PM - 09:50PM", "10:00AM - 11:20AM HH 280", "10:00AM - 11:20AM HH 280", "08:30AM - 09:50AM HH 280", "10:00AM - 11:20AM HH 227", "Email:  crbuchen@uwaterloo.ca", "Email:  j2hayton@uwaterloo.ca", "Email:  stephanie.hall@uwaterloo.ca", "This course continues the development of skills introduced in the foundational financial reporting course, with a greater focus on foundational analysis and forecasting, and expands the stakeholder context to public company stakeholders.", "The course enhances problem-solving skills through a problem-based learning delivery model.", "View requirements for AFM 182", "2. Prepare and forecast financial information, reports, and statements to meet the needs of internal and external stakeholders of public companies.", "3. Perform appropriate analysis to make decisions and solve business problems considering the appropriate business context.", "4. Identify ambiguity and provide a reasonable explanation to support your decisions in the preparation of financial statements and forecasts.", "Knowledge Base for a Financial Professional  Problem- Solving Capabilities  Fluency in the Languages of Business, Entrepreneurship and Technology  Attributes / Qualities of a Financial Professional", "X", "X", "2. Prepare and forecast financial information, reports, and statements to meet the needs of internal and external stakeholders of public companies.", "X", "X", "X", "3. Perform appropriate analysis to make decisions and solve business problems considering the appropriate business context.", "X", "X", "X", "4. Identify ambiguity and provide a reasonable explanation to support your decisions in the preparation of financial statements and forecasts.", "X", "X", "X", "Introduction to accounting for public companies (Ch. 1 PBL)", "Corporate governance & organizational structures (Ch. 4 PBL)", "Balance sheet analysis and planning", "Cash flow analysis and planning", "Performance management systems", "Total", "Answering each question correctly earns you 100%.", "There are questions for each chapter, for a total of 11 chapters.", "Academic Integrity expectations for examinations", "The final examination is comprehensive and cumulative, including all chapters covered during the term.", "You work in your team to complete the team case assignment.", "Notice of Recording", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 4, "course_code": "AFM 191", "course_name": "AFM191 - Foundations for Financial Reporting (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Foundations for Financial Reporting Winter 2025", "AFM 191", "AFM 191 001", "12:00AM - 12:00AM ONLN - Online", "AFM 191 002", "08:30AM - 09:50AM AL 105", "Email: crbuchen@uwaterloo.ca", "AFM 191:", "This course is a foundation for the practice of financial reporting.", "Students prepare financial statements and other financial reports designed to meet the needs of internal and external stakeholders of private companies.", "Students perform introductory financial analysis to inform business decisions and solve business problems considering the appropriate business context.", "The course develops problem-solving skills through a problem-based learning delivery model.", "View requirements for AFM 191", "Describe how and why the conceptual framework of accounting and generally accepted accounting principles provide relevant information to meet private company stakeholder needs.", "2. Prepare financial information, reports, statements to meet the needs of internal and external stakeholders of private companies at an introductory level.", "3. Perform appropriate analysis to make decisions and solve business problems considering the appropriate business context at an introductory level.", "Knowledge Base for a Financial Professional Communication Capabilities Problem-Solving Capabilities Fluency in the Languages of Business, Entrepreneurship and Technology Leadership and Collaboration Attributes / Qualities of a Financial Professional", "Describe how and why the conceptual framework of accounting and generally accepted accounting principles provide relevant information to meet private company stakeholder needs.", "X", "X", "2. Prepare financial information, reports, statements to meet the needs of internal and external stakeholders of private companies at an introductory level.", "X", "X", "X", "3. Perform appropriate analysis to make decisions and solve business problems considering the appropriate business context at an introductory level.", "X", "X", "X", "X", "X", "X", "2. Prepare financial information, reports, statements to meet the needs of internal and external stakeholders of private companies at an introductory level.", "3. Perform appropriate analysis to make decisions and solve business problems considering the appropriate business context at an introductory level.", "Important: This e-textbook will be used for both AFM 191 and AFM 182.", "Answering a question incorrectly earns you 50%, while answering correctly earns you 100%.", "The purpose of the lecture is to review and discuss more difficult concepts in each topic.", "The topic concepts are then applied in the tutorial sessions through problem-based/team-based activities.", "While the tutorial sessions are not directly part of the course evaluation, they comprise a critical component of the development of the course competencies.", "The attendance in tutorial sessions will be a critical component of your ability to be successful in the midterm exam.", "Written requests for re-grading a mid-term examination must normally be made within one week after the examination has been returned.", "The attendance in tutorial sessions will be a critical component of your ability to be successful in the final exam.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 11, "course_code": "AFM 321", "course_name": "AFM321 - Personal Financial Planning and Taxation (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Personal Financial Planning and Taxation Winter 2025", "AFM 321", "AFM 321 001", "Email: kaishu.wu@uwaterloo.ca", "AFM 321:", "This course integrates financial planning and taxes for individuals.", "It connects elements of planning, saving, spending, and reporting to budgeting and tax implications, as they evolve over an individual's lifetime.", "View requirements for AFM 321", "AFM 321 helps students develop a do-it-yourself (DIY) individual financial planning and tax mindset.", "Students will learn how to prepare and assess a basic financial plan for themselves, centered around the budget, across various life stages.", "Within each area of planning, saving, spending, and reporting, students will develop appreciation of important financial and tax considerations that will set them up for financial success.", "Prepare a financial plan and budget for various life stages using fore core elements (planning, saving, spending, and reporting)", "2. Analyze and recommend a financial plan/budget for various life stages", "3. Integrate tax implications and analysis within your plan/budget and each life stage", "4. Use data and analytical techniques to evaluate comparable investments", "3 individual budget and financial planning assignments 37%", "TopHat knowledge and reflection questions & Module practice problems 13%", "Individually or in groups, students will complete mini-cases requiring them to prepare a budget and all related documentation, including tax implications, related to planning, saving, spending, and reporting.", "Students will write a comprehensive final exam that builds on the previous budget and financial planning assignments and will require them to prepare or analyze a budget/financial plan, related schedules, and consider tax calculations and implications.", "The assignment will require a written report detailing the comparison and conclusions reached, as well as collection and analysis of data and a visualization of certain findings.", "To be awarded a grade for these components, you must enroll in TopHat using your UW username-specific email (no alias UW email address, or non-UW email address).", "GenAI use is not permitted for these problems.", "The instructor is a facilitator of the knowledge and discussion.", "9-10 if you attended classes throughout the term, and participated meaningfully in the discussion several times each week consistently throughout the term.", "Although rare, we will always make corrections for clear inconsistencies in your grade (i.e., specific feedback says you achieved one ranking, but assessment was checked for a lower ranking).", "Submission Times", "Due to the highly structured nature of the study plans and the fact that many SAF courses are offered on a limited basis, students should be aware that a penalty imposed as a result of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 13, "course_code": "AFM 341", "course_name": "AFM341 - Accounting Information Systems (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Accounting Information Systems Winter 2025", "AFM 341", "AFM 341 001", "08:30AM - 09:50AM HH 1102", "AFM 341 002", "10:00AM - 11:20AM RCH 308", "AFM 341 003", "AFM 341:", "Examines the planning, requirements analysis, acquisition, and evaluation of information systems, with an emphasis on accounting information systems.", "Introduces information systems assurance concepts, and considers the role of information technology in the improvement of business performance.", "View requirements for AFM 341", "- Define and use the terminology of accounting information systems (AIS) and explain characteristics of useful information in the context of accounting.", "- Define and apply the principles of AIS, including an understanding of the role of AIS professionals.", "- Recognize the roles of the accounting/finance function in business and why those roles require knowledge of technology and business processes.", "Each of the School of Accounting and Finance’s 16 Program Level learning outcomes identifies a knowledge, skill or value of a financial professional.", "These outcomes are organized into seven areas as reflected in the columns of the following table.", "Knowledge Base for a Financial Professional Communication Capabilities Problem-Solving Capabilities Fluency in the Languages of Business, Entrepreneurship and Technology Ethical Conduct and Social Responsibility Leadership and Collaboration Attributes / Qualities of a Financial Professional", "1. Define and use the terminology of accounting information systems (AIS) and explain characteristics of useful information in the context of accounting.", "X", "X", "X", "X", "X", "X", "X", "4. Recognize the roles of the accounting/finance function in business and why those roles require knowledge of technology and business processes.", "X", "X", "X", "-", "Thursday, Jan. 9 Enterprise Systems and Databases Romney Chapters 2 (pp.", "-", "Tuesday, Jan. 14 Systems Development Romney Chapters 22, 23", "-", "Thursday, Jan. 16 Systems Documentation Romney Chapter 3", "-", "-", "-", "-", "-", "-", "-", "-", "-", "AIS Frameworks, Risks & Controls", "Emerging AIS Tech Briefing due", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "Accounting Information Systems – 15th edition.", "Students must have name cards with their full first and last names clearly written and displayed in front of them for every class.", "Discussion board: A class portal-based discussion board will be used throughout the semester to interact regarding course concepts and to identify news items relevant to the course content.", "Please note that each student is free to choose their preferred participation option; this can be a balance of both in-person participation and discussion board participation.", "Each group will prepare a technology briefing on their topic, as well as an assessment of a case example from practice.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 15, "course_code": "AFM 373", "course_name": "AFM373 - Cases and Applications in Corporate Finance (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Cases and Applications in Corporate Finance Winter 2025", "AFM 373 / AFM 476", "AFM 373 001", "AFM 373 002", "AFM 373 003", "AFM 373 005", "Email: jdamato@uwaterloo.ca", "Email: b2loewen@uwaterloo.ca", "AFM 373:", "This course builds on the theory of financial management using cases to illustrate a variety of corporate financial decisions.", "View requirements for AFM 373", "The course builds on the theory of financial management using cases to illustrate a variety of corporate financial decisions.", "Where suitable, topics are treated from a mathematical and quantitative perspective.", "View requirements for AFM 476", "The objective is to broaden and deepen your understanding of the real decisions facing financial managers and investors.", "The course is grounded in corporate finance theory, providing cases and applications to develop your analytical and practical skills, business acumen, ability to communicate your understanding orally and in writing, and converse in mainstream issues relating to corporate finance in business.", "The classes encompass both case analysis and discussion of articles from practice-oriented academic journals.", "The material leads to a practical, in-depth application of many corporate finance competencies for decision-making purposes, including forecasting financing needs, the cost of capital, corporate performance measurement, capital budgeting, capital structure policy, securities issuance, dividend policy, valuation, M&A, and restructurings.", "The analysis incorporates a number of general themes in corporate finance, including managerial objectives, corporate governance and value creation.", "A seating chart will be used: in order to gain full credit for your contributions, you must i) sit in the same seat every class ii) display every class (visibly) a large, clear name tag containing the name you wish to be called.", "This involves making a meaningful contribution to the learning of the class.", "Attendance, Punctuality & Engagement", "Any deviation from these typesetting standards above will result in a mark deduction.", "They should be referenced and analyzed in the main report 1 pages (i.e., if you put verbal analysis in the appendix it will not be marked).", "Students should choose a format appropriate for each case, following these guidelines:", "The advance student slides will identify any specific requirements for each case.", "Unlike the case synopses, these assignments will be written under a time constraint and will involve answering specific questions regarding the particular case.", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 16, "course_code": "AFM 382", "course_name": "AFM382 - Cost Management Systems (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["AFM 382", "AFM 382 001", "08:30AM - 09:50AM HH 1108", "AFM 382 002", "AFM 382 003", "AFM 382 004", "AFM 382 201", "AFM 382 101", "Online meetings are also fine Email me to book a virtual or in-person meeting Email me to book a virtual or in-person meeting", "Email: j33tian@uwaterloo.ca lcarty@uwaterloo.ca j95yuan@uwaterloo.ca", "Email: jjdean@uwaterloo.ca", "AFM 382:", "Consideration of more complex topics in management planning and control.", "Emphasis is on traditional and contemporary cost accumulation systems and their application in modern day organizations.", "View requirements for AFM 382", "LO 2 Interpret the results of operating and strategic decisions using tools such as cost-volume-profit, relevant costing, and net present value.", "LO 3 Estimate product costs using tools such as job, process and activity-based costing and allocation methods related to period costs, joint costs and by-products.", "Each of the School of Accounting and Finance’s Program Level Learning Outcomes identifies a knowledge, skill or value of a financial professional.", "These outcomes are organized into seven areas as reflected in the chart below.", "Knowledge Base for a Financial Professional", "Fluency in Language of BET", "Ethical Conduct Social Responsibility", "Attributes / Qualities of a Financial Professional", "X", "X", "X", "X", "X", "X", "X", "X", "X", "X", "X", "X", "X", "X", "X", "X", "iClicker", "iClicker", "iClicker", "iClicker", "iClicker", "Session &", "Session &", "Cost Terms & Purposes", "Cost Behaviour (linear costs)", "Cost Behaviour (non-linear)", "Service Departments", "Cost-Volume-Profit", "Relevant Costing (linear programming)", "Variance Analysis", "Variance Analysis", "Capital Budgeting", "ESG Concerns for Management", "iClicker", "Much of the learning experience in this course will involve simple case material, and more complex problem solving, which will be developed by interaction among students and instructor.", "1. reading assigned chapters before class;", "The deadline and permitted time are pre-set in the system.", "I-clickers/Electronic Polling Tools", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "SAF Process for Missed Assessments - Read this section carefully so you undertand the implications of missing an assessment", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 18, "course_code": "AFM 433", "course_name": "AFM433 - Business Strategy (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "AFM433 Business Strategy Winter 2025", "AFM 433", "AFM 433 001", "AFM 433 002", "02:30PM - 05:20PM", "AFM 433 003", "AFM 433 101", "07:00PM - 08:50PM", "AFM 433:", "Managers contribute to the organization through their analytical and leadership capabilities as well as their technical expertise.", "The course provides a framework for developing and implementing strategy that fits the firm's environment, managerial values, and organization.", "View requirements for AFM 433", "Assess the alignment of an organization’s mission, vision, and values with its business strategy and its organizational accountability system", "Describe an organization’s governance structure and the specific roles of the board in strategic management", "Strengthen thinking and problem-solving skills by learning when, why, and how to apply strategy analysis concepts/tools and design thinking skills", "AFM433 Voice over PPT online lectures available on LEARN to be lsitened to in advance each week according to the detailed course schedule Yes free", "You will submit a one page writeup for five of these cases to count towards your individual case submission grade.", "Details will be provided on LEARN for the requirements for the submissions, but in general they will be one page in length and will be graded on a full credit or half-credit basis.", "Teams", "All members of a team normally receive the team’s grade for each component of the team assignments because strategy development and implementation are team efforts, not an individual activity.", "Your team will pick a company of interest and present a 10-minute overview of the company’s strategy and an assessment of their competitive advantage.", "Details of the assignment and criteria for choosing the company are posted in a separate document on LEARN.", "Your teams will be given a specific timeslot for your presentation closer to the date.", "The Midterm Exam is a case exam.", "You are expected to select and apply appropriate analytical models and communication skills to address the case role and requirement.", "The Final Exam is a 2.5-hour in person case exam and will cover all 11 modules of the course.", "Both the midterm and the final exam will require you to have a working laptop to complete.", "A separate Instruction sheet will be issued prior to the exam providing further details.", "A written request must be submitted that indicates your reasons for believing that the case solution was improperly graded.", "Notice of Recording", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 19, "course_code": "AFM 451", "course_name": "AFM451 - Audit Strategy (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "AFM 451", "AFM 451 001", "AFM 451 002", "Email: amitm.mehta@uwaterloo.ca", "AFM 451:", "An examination of elements of audit strategy and their interrelationships, including financial assertions, types and sources of audit assurance, and evidence-gathering procedures within a framework of professional judgment.", "View requirements for AFM 451", "The course will also give you a thorough understanding of auditing and its role in society, including why specific procedures or approaches are followed in conducting an audit, and help you learn how to take a position and defend that position (as these are critical skills needed to be an auditor).", "2. Identify the skills and traits needed to be an auditor and explain in your own words why they are essential and how the audit environment influences them.", "3. Evaluate how various business processes and information flows impact the audit process.", "4. Identify different types of internal controls within business processes and evaluate how controls impact the flow of information as well as the audit process.", "7. Explain the types of audit reports and opinions auditors can issue and explain when each is appropriate.", "Knowledge Base for a Financial Professional", "Problem-Solving Capabilities", "Fluency in the Languages of Business, Entrepreneurship and Technology", "Ethical Conduct and Social Responsibility", "Leadership and Collaboration", "Attributes / Qualities of a Financial Professional", "X", "X", "X", "2. Identify the skills and traits needed to be an auditor and explain in your own words why they are essential and how the audit environment influences them.", "X", "X", "X", "X", "X", "3. Evaluate how various business processes and information flows impact the audit process.", "X", "X", "X", "4. Identify different types of internal controls within business processes and evaluate how controls impact the flow of information as well as the audit process.", "X", "X", "X", "X", "X", "X", "X", "X", "X", "X", "X", "X", "7. Explain the types of audit reports and opinions auditors can issue and explain when each is appropriate.", "X", "X", "X", "X", "Practice through critical evaluations and classroom activities,", "showcasing real-life applications, and exploring leading research practices to facilitate practical understanding and internalization of critical concepts under each intended learning outcome", "2. Identify the skills and traits needed to be an auditor and explain in your own words why they are essential and how the audit environment influences them.", "3. Evaluate how various business processes and information flows impact the audit process.", "4. Identify different types of internal controls within business processes and evaluate how controls impact the flow of information and the audit process.", "7. Explain the types of audit reports and opinions auditors can issue and explain when each is appropriate.", "& Date*", "Relevant Readings", "Evaluations", "Introduction to Assurance", "Role of Assurance", "Demand for Assurance", "Types of Auditors and Assurance Services", "Reasonable Assurance", "Auditor’s Independence", "Code of Ethics", "Overview of Company Operations", "Nature of risks", "Role of risks", "Types of risks", "ESG Assurance", "Nature and role of financial statement assertions", "Types of controls", "Testing internal controls", "Impact of control failures", "Impact of audit risk and materiality on audit strategy", "Sufficient and appropriate evidence", "Evidence-gathering techniques", "Audit sampling", "Substantive Analytical Procedures and Substantive Testing", "Putting things in perspective: linking risks to financial statement assertions to internal controls to audit procedures", "LRN: Practice Questions and Answers", "Year-end Completion procedures", "Standard Audit Report", "Through this two-part assignment (part A is a group assignment, and part B is an individual assignment), you will engage creatively and critically with these concepts, fostering a comprehensive grasp of how biases can impact the audit process.", "This individual assignment aims to reinforce your knowledge of the course concepts by translating what you learned into your own words, hopefully leading you to better apply your understanding of course concepts in a real-life setting.", "Specifically, it requires you to review a provided detailed business process in a case study and perform necessary research and analyses to document relevant course concepts (such as process documentation, risks, assertions, internal controls, audit procedures, etc.)", "I reserve the right to re-grade the entire examination.", "This group assignment category will revolve around a comprehensive case study available on LEARN (Contents >>> Evaluations >>> Group Class Discussions) showcasing the background as well as processes for the Revenue cycle, Purchases cycle, and Greenhouse Gas (GHG) Emissions Reporting cycle of a hypothetical case study.", "During each of the Monday and Wednesday classes of weeks 9, 10, and 11, groups will lead class discussions on pre-assigned core concepts of the assurance framework in the context of the provided case study.", "These concepts are:", "Each of these concepts is to be discussed in the context of:", "The Revenue cycle (case study specific),", "The Purchases cycle (case study specific), and", "Here’s a schedule of the topics and groups assigned for each of these three weeks:", "Groups are responsible for informing the instructor if free riders exist.", "Each group will be assigned a unique, comprehensive case that simulates real-world audit scenarios.", "This project will require groups to approach the case as a professional audit team, addressing multiple components of an overall audit.", "The analysis will span the entire financial statement audit lifecycle, offering students the opportunity to demonstrate their understanding and application of auditing principles in a practical context.", "Research supports a deeper understanding of accounting’s impact on the business environment.", "Thus, research is a critical part of a vibrant university.", "In no case can this extra credit earn you an overall grade percentage greater than 100% of your semester grade.", "In no case can this extra credit earn you an overall grade percentage greater than 100% of your semester grade.", "Notice of Recording", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Any on-campus in-person assessments that require modification due to a university-mandated change connected to in-person gatherings will, if necessary, proceed in a manner that best achieves the intentions of the original assessment format.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 23, "course_code": "BIOL 130", "course_name": "BIOL130 - Introductory Cell Biology (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "An introduction to the concepts of cell biology with emphasis on (1) the structural organization of the cell and (2) the function of critical molecular processes that are characteristic of living organisms.", "Explain the fundamental elements of cells, the chemistry of life, and the major classes of biological macromolecules.", "Describe metabolism, the role of enzymes in chemical reactions, and how cells can capture, and utilize, energy.", "Explain how cells respond to signals and form cellular communities.", "Module 1 - Introduction to Cell Biology & The Cell Theory", "Module 2 - Molecules of Life", "2 Module 3 - Cells and Membranes  In-class case study", "3 Module 4 - Nucleic Acids & Information Flow", "4 Module 5 - Protein Structure, Function & Synthesis  In-class case study", "6 Module 7 - Cellular Respiration In-class case study", "In-class case study", "9 Module 9 - Cell Signalling", "10 Module 10 - Cell & Tissue Form", "and In-class case study", "11 Module 11 - DNA Replication & Cell Division Case study due", "12 Module 11 - DNA Replication & Cell Division  Term Test 1", "Official Grades and Course Access", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each module for the achieve assignments and term tests.", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines", "Library for research-based assignments"]}, {"course_id": 25, "course_code": "BIOL 239", "course_name": "BIOL239 - Genetics (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["11:30AM - 12:20PM", "10:30AM - 11:20AM STC 1012", "You can!", "Chromosomal mechanisms in mitosis and meiosis.", "Natural selection and the evolution of genetic systems.", "Describe the fundamentals of gene structure, function and transmission in prokaryotic and eukaryotic cells and organisms.", "Describe the various ways mutations can arise and how mutations may affect gene expression and phenotypic outcomes.", "Describe recombinant DNA technology in bacteria and its role in biotechnology.", "Effectively work with others, discussing, evaluating, and communicating genetics concepts and synthesizing ideas in a group.", "Readings", "textbook 1.1-1.2", "Mendelian genetics and probability", "Modification of Mendelian ratios", "textbook 3.2-3.3, 4.2-4.4, 15.1", "Mitosis, meiosis, and chromosome numbers", "DNA and the genetic code", "textbook 9.2-9.3", "T4: Mitosis and meiosis", "DNA cloning", "T5: Testing genetic ratios", "Cancer genetics", "T9: Population genetics", "Exam period", "- write the final exam and achieve a grade of at least 50% on the cumulative test and exam section", "Online learning activities: These activities are designed to test your knowledge of several important concepts explained by the lecture presentations in this course, and should be completed after the portion of the course when they are covered in lecture.", "They are all due toward the end of the term but can be completed as many times as you like to help you work on these concepts.", "Read the instructions carefully before attempting these as a completion quiz (in the quiz section) must also be completed to obtain credit.", "In this case, the weight of the missed submission will be transferred to the final exam.", "The dates affected and degree of incapacitation will be used to determine follow-up action."]}, {"course_id": 26, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}, {"course_id": 27, "course_code": "BIOL 240L", "course_name": "BIOL240L - Microbiology Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["BIOL 240L", "BIOL 240L 001", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 002", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 003", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 005", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 006", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 007", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 008", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 010", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 012", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 013", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 014", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 015", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 017", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 018", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 021", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "Email: cduxbury@uwaterloo.ca", "View requirements for BIOL 240L", "Main Objective Obtain a a good understanding of the basic techniques used in a microbiology lab to study and handle microorganisms safely.", "Apply staining techniques to differentiate and observe types of bacteria", "Appreciate proper aseptic technique while handling microorganisms in the lab and inoculating media", "Properly prepare slides for examination under the microscope", "Prepare and use dilutions to isolate pure cultures and to enumerate the number of organisms in a culture", "Exp 3: Basic Bacterial Shapes", "Exp 12: Pour-Plate Method", "Exp 14: Aseptic Technique in Pipette Handling", "Exp 15: Standard Plate Count Method", "Exp 17: Bacterial Flagella Stain", "Exp 19: Miniprep of Plasmid DNA", "Exp 20: Analysis of Plasmid and Genomic DNA", "Exp 21: Metabolic Activities of Bacteria", "Exp 30: Evaluation of Chemical Antimicrobial Agents", "Exp 31: Antibiotic Sensitivity Testing", "Exp 32: Isolation of Bacterial Mutants", "TBA", "Extra precautions must be taken to ensure the safety of yourself and those around us!", "Always be prepared for a quiz; they could be given at any time and they are cumulative!", "To make this happen, a flowchart for each experiment is required.", "The flowchart is similar to a \"map\" of your experiment and should be sufficiently detailed and include the most important information about the experimental steps and possible time management.", "The flowchart should NOT be a reiteration of the \"METHODS\" section in your manual.", "Please see Flowchart Help Sheet for a flowchart example.", "Your professionalism mark will be assigned by your TAs and will be assessed on the basis of your performance in the laboratory, attendance, and your degree of skill in microbiological techniques.", "More information will be given closer to date.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 28, "course_code": "BIOL 241", "course_name": "BIOL241 - Introduction to Applied Microbiology (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introduction to Applied Microbiology Winter 2025", "RCH 101", "Course Lecturer: Dr. Kesen Ma; kma@uwaterloo.ca; office hours & virtual meetings (Zoom) by appointment only", "Laboratory Instructor: Dr. Cheryl Duxbury; cduxbury@uwaterloo.ca; office hours & virtual meetings (Microsoft Teams) by appointment only", "Introduction to microbial ecology, environmental microbiology, food microbiology, and medical microbiology explored through lectures and laboratory exercises.", "Topics in environmental microbiology include biogeochemical cycling and biological treatment of wastes and pollutants.", "Topics in medical microbiology include concepts of immunology and host-pathogen relationships.", "microbial ecology", "bacteria-bacteriophage interactions", "biodegradation and bioremediation • sewage treatment", "industrial microbiology", "host-parasite relationships - factors in microbial pathogenicity, innate barriers in the host", "immunology - innate, adaptive", "immunization; immune response diseases", "Extend Biol 240 and cover topics such as the diversity of microbial metabolism and habitat, the importance of microbes in nutrient cycling, biological treatment of pollution, use of microorganisms for the production of food, pharmaceuticals, and the role of microbes in human disease.", "Know the importance of microbes to life as we know it, and the applications of useful microbial characteristics.", "Enhance understanding of the roles that microbes play in the natural world .", "Learn more skills in aseptic laboratory techniques and know how to conduct some classical microbial testing of food, water, and soil.", "Lecture topics and relevant textbook chapters", "2021 & 2017.", "Microbial Ecology", "2. Bacteria-Bacteriophage Interactions", "Terrestrial & Aquatic Environments", "5. Biodegradation & Bioremediation", "Food & Industrial Microbiology", "(spoilage & preservation", "food & industrial processes)", "Immunology", "(innate, adaptive immunity,immunization & immune response diseases)", "Infectious Disease", "*note: this is the same textbook as used in BIOL 240 & BIOL 240L. The new 3rd edition of the book can be accessed via a subscription through Wiley ($57 for 150-day subscription, $134.95 for a lifetime subscription:", "This manual cannot be ordered online and must be purchased in person prior to your first lab.", "Both exams will be in a multiple-choice format (e.g., multiple choice, true/false, matching questions, fill in the gap).", "Notice of Recording", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Allowed", "Allowing under certain conditions", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 29, "course_code": "BIOL 331", "course_name": "BIOL331 - Advanced Cell Biology (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Advanced Cell Biology Winter 2025", "10:00AM - 11:20AM STC 0060", "02:30PM - 05:20PM B2 351", "07:00PM - 09:50PM B2 351", "02:30PM - 05:20PM B2 351", "02:30PM - 05:20PM B2 351", "02:30PM - 05:20PM B2 351", "Email: njandu@uwaterloo.ca", "Email: jola.gurska@uwaterloo.ca", "Email", "We are available via email on a regular basis and check email frequently.", "The functional organization of cells with particular reference to cell-cell interaction, the structure, function, and development of organelles and the biological roles of cellular membranes.", "Laboratory exercises apply techniques for isolation and analysis of cellular components.", "Advanced Cell Biology focuses on the functional organization of the eukaryotic cell with an emphasis on exploring:", "the biological roles of cellular membranes;", "3. the mechanisms underlying cell architecture and cell-cell interactions.", "describe molecular level details of the inner workings of cellular structures in a variety of different cells.", "describe the molecular underpinnings of sub-cellular organelles - how they are formed and their functions – and their relationships to the physiology/anatomy of a variety of organisms.", "apply important concepts from key advances in molecular cell biology and utilize experimental approaches and tools used by cell biologists.", "integrate a fundamental understanding of cell biology and an appreciation of the intricate connections between cellular structure and function with human health and disease.", "The wide variety of pathologies associated with human diseases that can be explained by the underlying molecular cell defects are the topics for discussion in BIOL 472 (Cell Biology of Human Disease).", "practice and perform laboratory techniques that are commonly used by cell biologists to develop a deeper understanding of cellular structures and functions.", "continue to develop and improve upon previously learned techniques and skills such as microscopy, micropipetting, and spectroscopy.", "Instead of posting page numbers, I have created a list of topics that will be covered in each slide-set.", "In many cases you are learning entirely new concepts, which includes learning the language of cell biology.", "If you concentrate on concepts and the experimental approaches used to understand them, then the myriad of new terms will seem less onerous.", "Please make sure you are reading the textbook.", "The purpose of these quizzes is for students to ‘self-check’ their understanding of the course material.", "The exams will primarily test your understanding of concepts and not your ability to memorize, but given the nature of the topics, some memorization is inevitable.", "The labs focus on the use of yeast as a model system for understanding mitochondrial biogenesis and will feature subcellular fractionation and the use of different assays for identification and characterization of isolated mitochondria.", "Laboratories are important in biology and all students need to develop certain laboratory skills, recording keeping of your data, experimental observations and methods are some of those skills.", "Week Unit Schedule of Topics* Readings: MBoC Assessments LABS", "For each unit and part, relevant page numbers for readings in the text will be provided.", "Students should carefully consider the wisdom of missing an assessment.", "Notice of Recording", "Our in-person and on-campus lectures will be live and in-person without being recorded.", "This will allow for a more natural and dynamic learning atmosphere with a welcome environment for student comments, questions, and participation.", "Library for research-based assignments"]}, {"course_id": 30, "course_code": "BIOL 342", "course_name": "BIOL342 - Molecular Biotechnology 1 (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["10:30AM - 11:20AM RCH 211", "11:30AM - 12:20PM DWE 3518", "10:30AM - 11:20AM RCH 204", "E-mail: barb.katzenback@uwaterloo.ca", "The methods of recombinant DNA technology, molecular diagnostic systems for detecting diseases, and transgenic organisms will be examined in lectures and tutorial sessions.", "To apply the fundamentals of molecular biotechnology, primarily in the context of the methods that are employed in this field", "To demonstrate skill in designing of molecular approaches for biotechnology", "To express critical thinking skills", "To effectively communicate concepts and details learned.", "Introduction, History, Review of basic gene expression", "Synthetic DNA, PCR, DNA sequencing methods", "Molecular diagnostics - monoclonal antibodies, ELISA, molecular beacons", "Advantages of double digests, selection, cloning using pBR322 and pUC, designing a cloning vector", "Expression of cloned genes, calculation of colony # for a genomic library, vector choices", "Drawing products of PCR, designing PCR primers for cloning PCR products, producing protein products from libraries", "Designing E. coli expression vectors for tagged products, cloning cDNA into expression vectors", "Cloning genomic fragments and ORFs into pUC19", "Designing lateral flow tests for infectious agents and pesticides", "They are designed to facilitate note-taking and are not necessarily a complete set of lecture notes.", "In-class worksheets: Review and application of fundamental concepts will be an integral part of the course.", "You are expected to print these and bring them to class.", "As well, lectures present additional visual and oral material that is designed to stimulate thought and interest in the field of biotechnology.", "Compassionate leave (e.g., death in the immediate family) will be granted by the instructor/lecturer on a case-by-case basis and will normally require validation by documentation.", "Please make contact as soon as possible in this event so judgment can be made before the examination.", "The assignment in question will be given a mark of zero.", "Examples of plagiarism and excessive collaboration"]}, {"course_id": 31, "course_code": "BIOL 432", "course_name": "BIOL432 - Molecular Biotechnology 2 (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "TA- Aranksha Thakor - Monday 1-2:30 PM B1-377D. Email adthakor@uwaterloo.ca                                                                                                   Aranksha is focusing on Benchling and CRISR LA-4A-D", "Explain genetic engineering tools, existing biotech products, and mechanisms for delivery and improvement", "Investigate and design new biotech products to solve real world problems", "Design a CRISPR chromosomal mutation effectively using design software to choose an appropriate gRNA and ssDNA", "Effectively communicate experimental protocol details for the CRISPR chromosomal mutation", "Effectively read and follow directions", "Begin Date", "Introduction to Group work, LA1 and CRISPR Project Example: PIC2", "Due LA-1 group contracts in dropbox", "Due LA-2 Benchling sign-up individually in dropbox", "Study for exam", "Industrial and Environmental Microbiology", "Total", "Official Grades and Course Access", "The format for Term Test 1 and Test 2 will be true/false, fill-in-the-blank short and long-answer written exams, and possibly multiple choice.", "Emails can be received 24 hours per day.", "Topics will be granted on a first come first serve basis.", "Notice of Recording", "Expectations for Change", "Library for research-based assignments"]}, {"course_id": 32, "course_code": "BIOL 443", "course_name": "BIOL443 - Fermentation Biotechnology (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["11:30AM - 12:20PM B1 271", "S. Ruffell", "----", "E-mail: cduxbury@uwaterloo.ca", "Biology of industrial micro-organisms: fermentation systems; fermentation raw materials; downstream processing; biomass production; food fermentations; production of industrial chemicals, food additives, enzymes, and other products by fermentation.", "This course includes practical examples in the laboratory.", "Outline the key features necessary in an industrial fermentation used to produce commercial quantities of biological products", "Outline some downstream processing strategies used to recover and purify products from microbial cultures", "Describe the variety of regulatory systems that may control metabolism in wild type microbes, and how these may be altered in industrially important strains", "Use equations to describe microbial growth, substrate utilization and product yield", "Explain how several different types of fermentation systems work", "Conduct some of the assays used to monitor such processes", "Demonstrate effective, concise scientific writing", "Introduction and design", "Topic 3. Fermentation systems", "Downstream processing", "Healthcare and pharmaceuticals", "Current research", "Library for research-based assignments"]}, {"course_id": 33, "course_code": "CHEM 120", "course_name": "CHEM120 - General Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["General Chemistry 1 Winter 2025", "RCH 101", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "The second part of this course is concerned with explaining periodicity and trends in chemical reactivity in terms of the electronic structure of atoms and molecules.", "Topics covered in this part of the course include the quantum theory of the hydrogen atom; electron configurations in multi-electron atoms; ionic and covalent bonding; Lewis structures, valence shell electron repulsion theory and molecular geometry; quantum mechanical bonding theories, including valence bond theory and molecular orbital theory.", "Additional topics may include an introduction to electron-transfer reactions, including the assignment of oxidation states and the balancing of oxidation-reduction reactions.", "assess the greenness of a chemical reaction using Atom Economy and E-Factor metrics.", "describe the electronic structure of atoms in terms of quantum theory using atomic orbitals and quantum numbers.", "justify the organization of the periodic table and predict trends in the properties of the elements.", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and explain molecular shape and stability in terms of electron count.", "describe the interactions of molecules in solids, liquids, and gases to compare physical and reactive properties.", "Course Structure and Continuity Plans", "No extensions will be granted for Participation Challenges, but each student can drop one participation challenge from their overall grade.", "Printed spiral bound copies of the course notes can be purchased online from the UW bookstore https://wstore.uwaterloo.ca/", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare pandemic-related illnesses on Quest (Information at this link)", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 34, "course_code": "CHEM 120L", "course_name": "CHEM120L - General Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 1 Fall 2024", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Be sure to record their name and contact information in your lab manual.", "Skillfully perform basic procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "1,3,5,7,9,11", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Sept 19 - 24", "1,3,5,7,9,11", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "1,3,5,7,9,11", "- studying cis and trans isomers", "Oct 24-29", "1,3,5,7,9,11", "Titration as an Analysis Tool", "- identify an unknown solid acid", "1,3,5,7,9,11", "Introduction to Chromatography", "- quantify a cation using ion exchange", "1,3,5,7,9,11", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 35, "course_code": "CHEM 123", "course_name": "CHEM123 - General Chemistry 2 (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["General Chemistry 2 Winter 2025", "09:30AM - 10:20AM STC 1012", "Introduction to chemical equilibria.", "Describe the energy and entropy changes that accompany physical and chemical changes.", "Calculate the equilibrium constant for a reaction using the standard thermodynamic properties of reactants and products.", "Predict the direction of spontaneous change for a given set of initial conditions for a variety of chemical systems.", "Apply equilibrium principles to a variety of chemical reaction types including gas-phase reactions, acid-base reactions, precipitation reactions, complexation reactions and redox reactions.", "Analyze oxidation-reduction reactions and identify species being oxidized and reduced.", "Explain the basic construction of, uses of, and the differences between galvanic and electrolytic cells.", "CHEM 120 and CHEM 123 comprise a full-year course in introductory chemistry.", "Course Structure and Continuity Plans", "Chemistry Study Hall:  Starting the 2nd week of classes, there will be a first-year study hall on Tuesdays and Thursdays at 5:30 pm - 6:50 pm in STC 1012.", "You can attend as many Study Hall Sessions as you would like - grab your friends and connect with your TAs!", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 36, "course_code": "CHEM 123L", "course_name": "CHEM123L - General Chemistry Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 2 Winter 2025", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- a real life analysis", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 37, "course_code": "CHEM 237", "course_name": "CHEM237 - Introductory Biochemistry (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:20AM", "RCH 101", "10:30AM - 11:20AM RCH 101", "ESC 227", "Structure and properties of proteins and enzymes.", "develop a molecular level understanding of biological processes to achieve this the following learning outcomes will be", "in both qualitative and quantitative examples", "evaluate unknown thermodynamic parameters from given values of others.", "I equilibrium constants from standard free energy changes.", "qualitatively describe the composition of solutions of a weak acid or base as a function of pH.", "calculate the precise", "recognize the 20 amino acids that are commonly found in proteins and identify compounds derived from them", "calculate the charge on an amino acid side chain as a function of pH", "know the 4 levels of protein structure and the covalent and non covalent interactions that stabilize them", "explain how to purify proteins using the physical and chemical properties of the proteins", "determine the primary sequence of a protein given the appropriate data", "understand basic chemical kinetics and the application to biological systems", "determine the mechanism of inhibition of an enzyme using", "the structure of fatty acids and membrane lipids", "the structures of cell membranes and how the fatty acid composition of those membranes affects membrane structure and fluidity", "the structure of simple sugars and polysaccharides and the chemistry of the reactions in which they participate", "Suggested supplementary reading in \"Biochemistry Free for All\".", "Biochemistry free for all: Introduction Water and Buffers, pages 34-49", "VVP chapters 3 and 4.1", "Biochemistry free for all pages 53-70", "Appendix A.1 and A.2", "Chapter 4.2 and 4.3", "Biochemistry free for all.", "pp 74-108", "Week 6  Protein folding and Introduction to hemoglobin", "Chapter 4 - Biochemistry in focus", "Biochemistry free for all pages 128-141", "first kinetics Chapter 10 then mechanisms Chapter 9", "Biochemistry free for all pages 337-362", "Biochemistry free for all pp 190-217", "Biochemistry free for all pp 222-233", "Biochemistry free for all pp 287 - 312", "Notice of Recording"]}, {"course_id": 38, "course_code": "CHEM 266", "course_name": "CHEM266 - Basic Organic Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "11:30AM -", "Structure, nomenclature, and reactions of important classes of organic compounds.", "Stereochemistry and its role in reaction mechanisms.", "Name basic organic molecules", "Draw resonance structures and identify major and minor contributors", "Identify and describe the acidity and basicity of various molecules", "Draw organic molecules in three dimensions and identify the lowest and highest energy conformations", "Describe the stereochemical relationship between different molecules", "Explain chemical reactions using energy diagrams", "Understand the reactivity of a variety of molecules containing a variety of functional groups", "Molecular Modelling Kit No", "Notice of Recording"]}]