[{"course_id": 4, "course_code": "CS 136", "course_name": "CS136 - Elementary Algorithm Design and Data Abstraction (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["Elementary Algorithm Design and Data Abstraction Winter 2025", "08:30AM - 09:50AM MC 2017", "10:00AM - 11:20AM MC 2038", "10:00AM - 11:20AM MC 4059", "11:30AM -", "Monday -", "Monday", "07:00PM - 08:50PM", "This course builds on the techniques and patterns learned in CS135 while making the transition to use an imperative language.", "Topics discussed include iterative and recursive sorting algorithms; lists, stacks, queues, trees, and their application; abstract data types and their implementations.", "produce well-designed, properly formatted, documented and tested programs of a moderate size (200 lines) that can use basic I/O", "explain and demonstrate the use of the C memory model, including the explicit allocation and deallocation of memory", "explain and demonstrate the principles of modularization and abstraction", "implement, use and compare elementary data structures (structures, arrays, lists and trees) and abstract data type collections (stacks, queues, sequences, sets, dictionaries)", "If both exams are held in person", "If both exams must be held online", "If in-person exams cannot be held then they will be held online (if possible).", "You may also ask on the discussion forums in a private message.", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 5, "course_code": "CS 146", "course_name": "CS146 - Elementary Algorithm Design and Data Abstraction (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["Elementary Algorithm Design and Data Abstraction (Advanced Level)", "Monday -", "Monday", "07:00PM - 08:50PM", "02:30PM - 03:20PM", "Brad In-person MC 6427", "On-line Consulting Hours: Microsoft Teams", "CS 146: Elementary Algorithm Design and Data Abstraction (advanced version)", "To familiarize students with key concepts in introductory computer science from an imperative perspective and to contrast this with the functional perspective taken in CS 145;", "To allow students to complete the CS portion of their Math core requirements and, if desired, to continue on to second-year core courses in CS;", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "Introduction to C and elementary mutation in Scheme", "The memory model.", "Variable declaration, assignment and infix expressions in C. Basic I/O in C. Compilation.", "Algorithm analysis in C. File I/O in C and Scheme.", "Program organization and testing methods.", "Space analysis in C and Scheme.", "Mutable lists, queues, deques, and trees in C. Time-space tradeoffs among mutable and immutable ADT implementations.", "Low-level abstractions", "Pointer arithmetic in C. Arrays in C and vectors in Scheme.", "Strings in C. Elementary hashing.", "Libraries in C and Scheme.", "Implementing high-level abstractions", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "The provided slides are not a substitute for attendance in any first-year CS course, but in CS 146, there are no slides, and the lecture summaries made available after lecture are an even worse substitute for attendance.", "Lectures will involve the development of ideas summarized very tersely in the handouts, as well as on-the-fly development of code, analyses, and proofs.", "CS145 and CS146 were originally designed as a year-long unit of curriculum, but eventually the individual courses drifted in their own directions.", "1.1 A note on logistics", "1.2 Review of forms of recursion and associated proof techniques", "1.3 In preparation for side effects", "1.4 Output", "1.5 Input", "1.6 First Introduction to C", "1.8 Memoization", "1.9 Mutation in C", "1.11 Boxes in C", "1.12 Advanced mutation", "1.13 Aliasing in C", "1.14 Memory and vectors", "1.15 Vectors in Racket", "1.16 Arrays in C", "1.18 ADTs in C; Amortized Analysis", "2 SIMPL: a simple imperative language", "2.1 Syntax and informal semantics", "2.2 Examples in several languages", "2.3 Formal semantics", "2.5 Proving imperative programs correct", "A primitive imperative language", "3.1 A primitive imperative language", "3.2 The PRIMPL simulator", "3.4 The SIMPL to A-PRIMPL compiler", "3.6 Strings in C", "3.7 Adding functions to SIMPL", "3.8 Adding both arrays and functions to SIMPL", "3.9 Implementing lists in PRIMPL", "4 MMIX: a realistic instruction set", "4.1 A more realistic processor", "4.2 The MMIX architecture", "4.2.1 Branches and Jumps", "4.2.2 Example", "4.2.3 Software Interrupts", "4.2.5 A Problem with Branches and Jumps", "4.4 Towards a SIMPL to MMIX compiler", "5.1 Storing primitive values", "5.3 Managing memory", "5.4 Structural and pointer equality", "5.5 Function application in a Racket interpreter", "5.7 Justifying the cost of Racket primitives", "5.8 Moving towards implementation in an imperative language", "6.2 Zippers", "6.3 A continuation-passing interpreter", "6.6.2 Mark-and-sweep", "6.6.3 Copying garbage collection", "6.7 Heterogeneous Data in C", "6.8 Multidimensional Arrays in C", "6.10 Variable-length Argument Lists", "7.1 Continuation-passing style", "7.2 Exception handling", "7.3 Undelimited continuations", "7.4 Delimited continuations", "7.5 Racket’s implementation of continuations", "In CS 146, we will examine the imperative paradigm, and compare and contrast the way that efficient algorithms and data structures are designed in imperative and functional languages.", "Racket is a laboratory for current research on aspects of functional programming languages, and we will continue to look at interesting topics in this area, perhaps at the cost of some coherency in the flow of material.", "They will not be due each week on the same day, as is common in the other first-year CS courses and the first-year Math courses.", "Assignment questions are the main way to reinforce and deepen your understanding of the concepts and skills discussed in lecture.", "You will submit program files electronically to the Marmoset system , which runs tests on your code and informs you of the results fairly rapidly.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "(Please also note that we may use the trends in a student's submission history to estimate the likelihood of other forms of cheating as well.)", "Library for research-based assignments"]}, {"course_id": 6, "course_code": "MATH 106", "course_name": "MATH106 - Applied Linear Algebra 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["Applied Linear Algebra 1 Winter 2025", "Systems of linear equations.", "Introduction to vector spaces.", "We will see how to solve systems of linear equations using matrix methods before studying matrices as algebraic objects in their own right.", "Next, we will learn about the fundamental concepts of span, linear independence, and basis and learn how to determine whether a set is a subspace of Rn.", "After studying subspaces, we will study linear mappings, which map subspaces to subspaces.", "We will discuss the geometric interpretation of these mappings and study their fundamental subspaces.", "Finally, we will learn how to calculate the determinant of a matrix and use this knowledge to diagonalize square matrices.", "Provide a graphical and algebraic description of vectors, lines, and planes in R^n", "Model and solve mathematical and discipline-specific problems using systems of linear equations", "Perform basic algebraic operations on matrices", "Given a set of vectors in R^n, determine whether it is linearly independent, a spanning set of R^n, or a basis of R^n", "Given a basis and a vector in standard coordinates, use matrix methods to calculate its coordinate vectors", "Given a set in R^n, determine whether it is a subspace of R^n", "Given a mapping L: R^n --> R^m, determine whether it is linear", "Given a linear mapping, choose the appropriate algorithm find a basis for each of its fundamental subspaces", "Given a square matrix, calculate its determinant and provide a geometric interpretation of this value", "Communicate ideas and concepts relating to linear algebra using accurate mathematical language and notation", "Calculators", "Avoiding Academic Offences", "I am committed to creating a learning environment where diverse perspectives are recognized and valued as a source of strength.", "School-Life Conflict"]}, {"course_id": 7, "course_code": "MATH 136", "course_name": "MATH136 - Linear Algebra 1 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["Notice of Recording", "Linear Algebra 1 for Honours Mathematics Winter 2025", "08:30AM - 09:20AM MC 4061", "09:30AM - 10:20AM MC 4061", "10:30AM - 11:20AM QNC 2502", "11:30AM - 12:20PM MC 2065", "02:30PM - 03:20PM", "03:30PM - 04:20PM QNC 2502", "11:30AM - 12:20PM MC 4061", "10:30AM - 11:20AM B1 271", "Systems of linear equations, matrix algebra, elementary matrices, computational issues.", "Real n-space, vector spaces and subspaces, basis and dimension, rank of a matrix, linear transformations, and matrix representations.", "Master computational aspects of linear algebra, including matrix and vectors operations", "Solve systems of m linear equations in n unknowns", "Evaluate the inverse of a square matrix, when it exists", "Obtain the matrix representation of a linear transformation", "Evaluate the determinant of a square matrix", "Change co-ordinates and bases, and understand the effect on matrix representations", "Become familiar with operations and properties of abstract vector spaces", "While collaboration in understanding the material is encouraged, the work submitted must be your own, written independently.", "For example, submitting 60 minutes late will result in a maximum possible score of 40%, assuming a perfect score.", "Accommodation Requests", "Notice of Recording", "Allocate time appropriately towards the completion of the assignment which reduces the procrastination and cramming cycle", "Appreciate the importance of reviewing marked assignments", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as reading and writing proofs.", "Library for research-based assignments"]}, {"course_id": 8, "course_code": "MATH 146", "course_name": "MATH146 - Linear Algebra 1 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["Linear Algebra 1 (Advanced Level)", "Email: karigiannis@uwaterloo.ca", "This course is a rigorous treatment of the theory of finite dimensional vector spaces over an arbitrary field.", "We also cover the theory of determinants over an arbitrary commutative ring with identity, and some aspects of the theory of polynomials in one variable over a field.", "The ultimate goal is the Primary Decomposition Theorem, which characterizes a linear operator on a finite dimensional vector space in terms of invariant subspaces annihilated by the primary factors of its minimal polynomial.", "We will cover a large amount of difficult material at a fast pace.", "Understand and apply the concepts of the theory of abstract vector spaces and linear operators on finite-dimensional vector spaces.", "fields; systems of linear equations; matrices; row-reduced echelon form; matrix algebra; invertible matrices", "vector spaces; subspaces; bases and dimension; coordinates; row equivalence", "algebra of linear maps; isomorphism; representations by matrices; dual space; transpose of a linear map", "commutative rings; existence and uniqueness of determinants; multilinear maps; the exterior algebra", "eigenvalues; annihilating polynomials; invariant subspaces; simultaneous triangulation and diagonalization", "Much (but not all) of my lectures will closely follow the first six chapters of this book:", "“Linear Algebra: Second Edition” by Kenneth Hoffman and Ray Kunze; Prentice Hall, 1971.", "“Linear Algebra: Fourth Edition” by Friedberg, Insel, and Spence; Prentice-Hall, 2003.", "The assignments are an integral part of your evaluation in this course and I encourage everyone to take them very seriously.", "There will be no opportunity for a make-up midterm test."]}, {"course_id": 9, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 10, "course_code": "MATH 137", "course_name": "MATH137 - Calculus 1 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["Notice of Recording", "10:30AM - 11:20AM MC 4059", "Monday -", "Monday", "07:00PM - 08:50PM", "Absolute values and inequalities.", "Sequences and their limits.", "Introduction to series.", "Limits of functions and continuity.", "Applications of the Mean Value theorem, Taylor polynomials and Taylor's theorem, Big-O notation.", "We will study these ideas as they relate to sequences and functions.", "First, we will examine sequences and what it means for one to converge.", "Next, we will use our knowledge of sequences to discuss functions, including limits and derivatives.", "Write clear and well-organized mathematical solutions and proofs.", "Solve problems in Calculus through logical thinking and careful analysis.", "Determine if a recursively-defined sequence converges and prove it using mathematical induction.", "Compute the limits of various functions using both the formal definition of the limit, arithmetic rules for limits,and l'Hopital's Rule.", "Find solutions to optimization and related rates problems.", "Sketch curves by first analyzing a given function and its derivatives.", "4: Jan 27 - 31 2.1 - 2.2 Functions and their Limits, Sequential Characterization of Functions, Squeeze Theorem Quiz 3", "7: Mar 3 - 7 3.5 -  3.7 Linear Approximation, Newton's Method, IFT Quiz 6", "8: Mar 10 - 14 3.8 - 4.2 Implicit and Logarithmic Differentiation, Related Rates, Local & Global Extrema, EVT Quiz 7", "9: Mar 17 - 21 ‡ 4.3 - 4.6 MVT and its Applications, Shape of a Function via 1st and 2nd Derivatives Quiz 8", "FE: Mar 31 - Apr 4 4.9 - 4.10 Curve Sketching, Optimization Quiz 10", "Notice of Recording", "Phone: 519-884-0000 extension 213", "Please let us", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 11, "course_code": "MATH 147", "course_name": "MATH147 - Calculus 1 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["11:30AM - 12:20PM MC 4059", "04:30PM - 05:20PM", "Monday -", "Monday", "07:00PM - 08:50PM", "Introduction to mathematical proofs: Week 1;", "2. Sequences and Limits: Weeks 2 – 4;", "3. Functions and Continuity: Weeks 5–8;", "Introduction to Real Analysis, by R. Bartle and D. Sherbert No", "Any missed assignment will be given a score of zero.", "For any missed examination, you must have a valid reason and appropriate supporting documentation.", "In case VIF or STAD covers the midterm, the midterm may be excused, and its weight may be transferred to the final exam."]}, {"course_id": 12, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 13, "course_code": "MATH 138", "course_name": "MATH138 - Calculus 2 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["Notice of Recording", "08:30AM - 09:20AM", "09:30AM - 10:20AM MC 4059", "10:30AM - 11:20AM MC 4061", "E. Bembenek", "11:30AM - 12:20PM MC 4021", "cpthowel@uwaterloo.ca", "E. Yalcin", "02:30PM - 03:20PM", "08:30AM - 09:20AM QNC 2502", "Introduction to the Riemann integral and approximations.", "Antiderivatives and the fundamental theorem of calculus.", "Applications of the integral.", "Improper integrals.", "Linear and separable differential equations and applications.", "Binomial series, functions defined as power series and Taylor series.", "The goal of this course is to further expand your knowledge of calculus and its applications for one-variable functions.", "First, we will explore areas under curves and the Fundamental Theorem of Calculus, integration techniques, and applications of integration including finding the area between two curves, volumes of solids of revolution, and the average value of a function.", "We will study how to solve separable differential equations and linear differential equations as well as their applications to population growth and Newton's Law of Cooling.", "Write clear and well-organized mathematical solutions and proofs.", "Solve problems in Calculus through logical thinking and careful analysis.", "Set up and evaluate Riemann integrals for simple functions", "Apply various integration techniques including change of variable, integration by parts, trigonometric substitution, and partial fractions.", "Solve separable and first-order linear differential equations.", "Compute the radius and interval of convergence for power series.", "Compute Taylor Polynomials and Taylor series for many elementary functions.", "1: Jan 6 - 10 1.1 - 1.3 Riemann Sums, Definite Integrals, Average Value", "5: Feb 3 - 7 2.1 - 2.2.2, 2.3 Intro to DEs, Direction Fields, Separable and First-Order Linear DEs Quiz 4", "8: Mar 10 - 14 4.1 - 4.3 Intro to Power Series, Differentiation & Integration of Power Series Quiz 7", "FE: Mar 31 - Apr 4 4.8 Big-O Notation Quiz 10", "Notice of Recording", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 14, "course_code": "MATH 148", "course_name": "MATH148 - Calculus 2 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["08:30AM - 09:20AM", "Instructor: Michael Brannan", "E-mail: michael.brannan@uwaterloo.ca", "Week of", "3 Jan. 20 Fundamental Theorem of Calculus  A1", "4 Jan. 27 Techniques of Integration  A2", "5 Feb. 3 More Techniques and Improper Integration", "6 Feb. 10 Applications of Integration A3", "8 Mar. 3 Convergence Tests A4", "10 Mar 17 Sequences and Series of Functions A5", "11 Mar. 24 Power Series", "12 Mar. 31 Differential Equations A6", "Principles of Mathematical Analysis."]}, {"course_id": 15, "course_code": "MATH 135", "course_name": "MATH135 - Algebra for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["Algebra for Honours Mathematics Winter 2025", "An introduction to the language of mathematics and proof techniques through a study of the basic algebraic systems of mathematics: the integers, the integers modulo n, the rational numbers, the real numbers, the complex numbers and polynomials.", "Algebra for Honours Mathematics is a study of the basic number systems of mathematics.", "The course has two themes: Number systems and Mathematical language.", "The study of number systems will feel more familiar and will cover the integers, the integers modulo n, the complex numbers and polynomials.", "Gain practice in formulating conjectures and discovering proofs.", "Understand basic algebraic systems of mathematics: the integers, the integers modulo n, the rational numbers, the real numbers, the complex numbers and polynomials.", "MATH 135 Course Notes: Language and Proofs in Algebra, An Introduction Please see the Course Notes page in LEARN for the pdf No Free", "Generative AI: This course includes the independent development and practice of specific skills, such as proof discovery and proof writing.", "Library for research-based assignments", "In particular:"]}, {"course_id": 16, "course_code": "MATH 145", "course_name": "MATH145 - Algebra (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["02:30PM - 03:20PM", "E-mail: bmadill@uwaterloo.ca", "Topics include rings and subrings, integral domains and fields, homomorphism and isomorphism, quotient rings and modular arithmetic, isomorphism and the Chinese Remainder Theorem, irreducibility in integral domains, and field extensions.", "Week of", "1 Sept 5* Rings and Subrings", "3 Sept 19 Integral Domains and Fields A1", "7 Oct 24 FIT and CRT A3", "9 Nov 7 GCD's A4", "11 Nov 21 Field Extensions"]}, {"course_id": 17, "course_code": "MATH 207", "course_name": "MATH207 - Calculus 3 (Non-Specialist Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["Notice of Recording", "02:30PM - 03:20PM", "Multivariable functions and partial derivatives.", "Multiple integrals.", "Introduction to Fourier Series.", "Notice of Recording"]}, {"course_id": 18, "course_code": "MATH 229", "course_name": "MATH229 - Introduction to Combinatorics (Non-Specialist Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["Introduction to Combinatorics (Non-Specialist Level)", "11:30AM - 12:20PM RCH 205", "S. Pfannerer-Mittas", "Introduction to graph theory: colourings, connectivity, Eulerian tours, planarity.", "Introduction to combinatorial analysis: elementary counting, generating series, binary strings.", "We cover many of the same topics as MATH 239, but we also have a couple of topics they don't and we cover everything at a more intuitive and playful level.", "In the first half of the course you will be assigned to a family of combinatorial objects which will be your object.", "For each topic in the first half of the course you will work on examples which relate to your object.", "know some combinatorial objects intimately", "use modern techniques to enumerate them and learn things about them", "have a foundation in graph theory", "have increased mathematical maturity", "The first half is enumeration; the second half is graph theory", "A non-submission would be a 0 and thus considered one of the lowest marks.", "In the second half of the course you and your group are asked to give a short presentation on a family of graphs in the tutorials."]}, {"course_id": 19, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 20, "course_code": "MATH 239", "course_name": "MATH239 - Introduction to Combinatorics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["Introduction to Combinatorics Winter 2025", "11:30AM - 12:20PM MC 4059", "09:30AM - 10:20AM MC 4021", "P. Nelson", "08:30AM - 09:20AM QNC 1502", "S. Pfannerer-Mittas", "10:30AM - 11:20AM MC 4058", "11:30AM - 12:20PM MC 4058", "09:30AM - 10:20AM MC 4042", "02:30PM - 03:20PM", "10:30AM - 11:20AM PHY 150", "04:30PM - 05:20PM", "You should have no reason to contact them directly, but you can find their email addresses through Learn.", "First name Last name", "Guilherme Zeus Dantas E Moura", "Theodore Morrison", "Matthew Kroeker", "Introduction to graph theory: colourings, matchings, connectivity, planarity.", "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.", "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 21, "course_code": "MATH 247", "course_name": "MATH247 - Calculus 3 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["Topology on RN: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. (~3 weeks)", "Differentiation: partial differentiability, differentiability, chain rule, [midterm likely here], Taylor polynomials, extreme value problems. (~4 weeks)", "Integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. (~3 weeks)", "Local properties of continuously differentiable functions:  open mapping theorem, inverse function theorem, implicit function theorem. (~2 weeks)", "11:30AM - 12:20PM QNC 2501", "Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem.", "Topology of real n-dimensional space: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. Differential calculus on multivariable functions: partial differentiability, differentiability, chain rule, Taylor polynomials, extreme value problems. Riemann integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem."]}, {"course_id": 22, "course_code": "MATH 249", "course_name": "MATH249 - Introduction to Combinatorics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["Introduction to Combinatorics (Advanced Level)", "09:30AM - 10:20AM MC 2017", "For graph theory, while we will focus on the same topics covered in MATH 239 (planarity and bipartite matching), our coverage of those topics will differ substantially in depth and in the techniques that we employ; in particular, we will see striking applications of algebra.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 23, "course_code": "MATH 225", "course_name": "MATH225 - Applied Linear Algebra 2 (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["Applied Linear Algebra 2 Winter 2025", "Student Drop-In Hours", "Getting study ideas", "Linear transformations and matrices.", "Eigenvalues and eigenvectors.", "In this course, we will learn certain advanced topics in linear algebra.", "It turns out that the term “vector space” applies not only to the n-dimensional real vector space Rn, but also to collections of m-by-n matrices with real coefficients Mmxn(R) and polynomials of bounded degree PnR. We will see that such familiar terms as the dot product, norm, distance, orthogonality, and projection can be generalized in a natural way to these vector spaces.", "We will also extend the theory of matrix diagonalization to these new settings.", "The course will also touch upon some topics that find many real-world applications, such as the Method of Least Squares, Singular Value Decomposition and Linear Programming.", "Determine whether a linear mapping between vector spaces is an isomorphism.", "Diagonalize a linear mapping.", "Use the Fundamental Theorem of Linear Algebra to prove that the rowspace and the columnspace of a matrix are orthogonal to each other.", "Determine the best fitting polynomial for a collection of data points using the Method of Least Squares.", "Orthogonally diagonalize a symmetric matrix.", "Compute a Singular Value Decomposition of a matrix.", "Solve constrained optimization problems related to quadratic forms and linear mappings.", "Solve constrained optimization problems using linear programming.", "Calculators", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "Avoiding Academic Offences", "In this course, diverse perspectives are recognized and valued as a source of strength.", "School-Life Conflict"]}, {"course_id": 24, "course_code": "MATH 235", "course_name": "MATH235 - Linear Algebra 2 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["Linear Algebra 2 for Honours Mathematics Winter 2025", "Understand the definition of an abstract vector space and prove theorems about all vector spaces using the axioms.", "In the context of abstract vector spaces, understand and use the concepts of linear independence, spanning sets, bases, and dimension.", "Understand the definition of a linear transformation, and be able to prove whether or not a function is a linear transformation.", "Prove and apply the rank-nullity theorem.", "Understand and use the relationship between abstract linear transformations and matrices.", "Understand the axioms of an inner product, and use them to prove basic results about inner product spaces.", "Unitarily diagonalize a normal matrix.", "See schedule on Learn for a week-by-week breakdown of topics.", "Abstract Vector Spaces", "The definition of a vector space", "Subspaces", "Bases and dimension", "Linear Transformations", "Linear transformations between abstract vector spaces", "Rank and nullity", "Linear maps as matrices", "Change of coordinates", "Isomorphisms of vector spaces", "Eigenvectors", "Diagonalization", "Powers of matrices", "Inner product spaces", "Inner products", "Orthogonality and norm", "Orthonormal bases", "Projections", "Inner products and Gram matrices", "Singular value decomposition", "Singular values and singular vectors", "Singular value decomposition of matrices", "Singular value decomposition of linear maps", "You may complete these in groups of up to 3 students.", "You should be striving each week to understand the material on the assignments and the posted solutions.", "This will be a closed book exam, with no calculators permitted.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as writings proofs and communicating mathematical ideas.", "Library for research-based assignments"]}, {"course_id": 25, "course_code": "MATH 245", "course_name": "MATH245 - Linear Algebra 2 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["Linear Algebra 2 (Advanced Level)", "11:30AM - 12:20PM E2 1732", "E-mail: bmadill@uwaterloo.ca", "This is a second course in proof-based linear algebra.", "Particular emphasis will be placed on polynomials of linear operators, Jordan canonical form, and inner product spaces.", "Week of", "3 Sept. 16 Jordan Canonical Form I A1", "5 Sept. 30 Inner Product Spaces, Orthogonality T1", "A4", "10 Nov. 11 Singular Value Decomposition A6", "Linear Algebra by Friedberg, Insel, and Spence No"]}, {"course_id": 26, "course_code": "STAT 220", "course_name": "STAT220 - Probability (Non-Specialist Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["09:30AM - 10:20AM RCH 205", "Come with well-organized questions to make the best use of your time.", "Tutorial sections are listed above, except for the first week and the reading week.", "Class Discussion Board", "Joint, marginal, and conditional probability mass functions of two or more discrete random variables and functions of random variables are also discussed.", "Define a probability model and determine probabilities of events using counting techniques.", "Define and use probability mass functions/probability density functions and cumulative distribution functions to determine probabilities of events.", "Definitions of Probability; Review of Set Notation; Sample Space;", "Simple and Compound Events.", "2.1 - 2.4", "Addition and multiplication rules for Counting", "Permutations and Combinations", "2.5 - 2.6", "Discrete Random variables; Probability Functions, Cumulative Distribution Functions", "3.1 - 3.2", "Week 6 (Feb 10-14) Functions of a Random Variable; Expectation and its Properties; Variance and Standard Deviation 3.3", "5.1 - 5.4", "Week 9 (Mar 10-14) Expectation and Covariance for Multiple Random Variables; Linear Combinations of Random Variables 5.5 - 5.8", "Multinomial Distribution; Continuous Random Variables; Probability Density Function; Cumulative Distribution Function; Expected Value and Variance for Continuous Random Variables 5.8 - 5.9, 4.1-4.3", "Week 12 (Mar 31-Apr 4) Central Limit Theorem; Normal Approximation to the Binomial Distribution; Normal Approximation to the Poisson Distribution* 7.3, 7.5", "Learning primarily involves understanding the concepts and methods demonstrated in class to solve problems.", "Mathematical Statistics with Applications (Mendenhall, Wackerly, Scheaffer), 7th eddition A copy of the textbook is available for 3-hour loans in the DC library No", "This learning consists mostly of making sure you understand the concepts and steps that were introduced and used in class to solve examples and then solving problems on your own.", "Final Exam will be a 2.5-hour closed-book assessment held during the official exam period from April 9 to 25.", "For both Term Tests and the Final Exam, only non-programmable, non-graphical calculators approved by the Math faculty and marked with a pink-tie or blue-goggle sticker are allowed.", "Intellectual property includes items such as:", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills."]}, {"course_id": 27, "course_code": "STAT 230", "course_name": "STAT230 - Probability (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["03:30PM - 04:20PM MC 4045", "09:30AM - 10:20AM MC 4045", "02:30PM - 03:20PM", "03:30PM - 04:20PM MC 2017", "08:30AM - 09:20AM", "Pavel Shuldiner; E-mail: pavel.shuldiner@uwaterloo.ca; M3 4108", "Come with well-organized questions to make the best use of your time.", "Requests must be emailed to sasugradadv@uwaterloo.ca", "Joint probability functions, marginal probability functions, and conditional probability functions of two or more discrete random variables and functions of random variables are also discussed.", "Post-requisite:", "Define a probability model and determine probabilities of events using counting techniques.", "Define and use probability mass functions, probability density functions, and cumulative distribution functions to determine probabilities of events.", "Use moment generating functions as a tool to determine expected values.", "This learning consists of taking the time to carefully read the lecture notes on your own, ensuring you understand the concepts and steps demonstrated in the lectures to tackle examples, and then solving the end-of-section problems.", "Definitions of Probability", "Mathematical Probability Models", "1.1", "1.2", "Counting in Uniform Probability Models", "Addition and Multiplication Rules for Counting", "Permutations and Combinations", "Counting in Uniform Probability Models", "Addition and Multiplication Rules for Counting", "Permutations and Combinations", "Addition Rules for Unions of Events", "1.3", "2.1", "2.2", "2.3", "Conditional Probability and Product Rules for Intersections of Events", "Probability Mass Functions, Cumulative Distribution Functions", "Functions of Random Variables", "3.2", "Expectation of a Random Variable", "Expectation of a Function of a Random Variable, Properties of Expectation", "Moment Generating Functions", "3.3", "3.4", "3.5", "Basic Terminology and Techniques", "Joint Probability Mass Functions, Marginal Probability Mass Functions", "3.5", "4.1", "Multinomial Distribution", "Linear Combinations of Random Variables", "4.2", "4.4", "Linear Combinations of Random Variables", "Law of Total Expectation", "4.4", "4.5", "4.6", "Law of Total Expectation", "Cumulative Distribution Function, Probability Density Function", "Functions of Random Variables", "4.6", "Expectation of a Random Variable", "Moments of a Distribution, Moment Generating Functions, Mean, Variance, Standard Deviation", "Exponential Distribution", "Normal Distribution", "Exponential Distribution", "Normal Distribution", "Use of the Normal Distribution in Approximations", "Therefore, you should plan to spend between 3 and 6 hours each week in out-of-class learning.", "This learning consists mainly of ensuring you understand the concepts and steps used in class to solve problems and then solving exercises from the Course Notes on your own.", "A 2.5-hour final cumulative examination will be held during the final exam period in April.", "In the case of extenuating circumstances, you must provide sufficient documentation via e-mail to Divya Lala at divya.lala@uwaterloo.ca as soon as possible to verify your absence's circumstances.", "Re-mark Requests:", "Cancellation of In-Person Classes:", "Intellectual property includes items such as:", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "This course includes the independent development and practice of specific skills for solving real-life problems using introductory probability rules.", "Library for research-based assignments"]}, {"course_id": 29, "course_code": "STAT 221", "course_name": "STAT221 - Statistics (Non-Specialist Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["STAT 221", "11:30AM - 12:20PM MC 4064", "ilham.akhundov@uwaterloo.ca", "View requirements for STAT 221", "This course provides a systematic approach to empirical problem solving which will enable students to critically assess the protocol and conclusions of an empirical study including the possible sources of error in the study and whether evidence of a causal relationship can be concluded.", "The connection between the attributes of a population and the parameters in the named distributions covered in STAT 230 will be emphasized.", "Numerical and graphical techniques for summarizing data and checking the fit of a statistical model will be discussed.", "The method of maximum likelihood will be used to obtain point and interval estimates for the parameters of interest as well as testing hypotheses.", "The interpretation of confidence intervals and p-values will be emphasized.", "The Chi- squared and t distributions will be introduced and used to construct confidence intervals and tests of hypotheses including likelihood ratio tests.", "Contingency tables and Gaussian response models including the two sample Gaussian and simple linear regression will be used as examples.", "Use numerical and graphical summaries of a data set to describe the characteristics of a variate and to check the fit of a statistical model to the data;", "Use the steps of PPDAC to identify both the objectives and possible sources of error in an empirical study and to critically evaluate the conclusions;", "Identify the connection between attributes of a population and the parameters in the named distributions (Binomial, Poisson, Multinomial, Exponential, Normal).", "Define and use the likelihood function to obtain point estimates of the unknown parameters in a model particularly for the Binomial, Poisson, Multinomial, Exponential and Gaussian (Normal) models.", "Use a pivotal quantity to construct a confidence interval for a parameter in some specific cases, and interpret the confidence interval.", "Use the likelihood function to construct and conduct a test of hypothesis for an unknown parameter in a model.", "Interpret p-values and describe the connection with confidence intervals.", "Define the properties of the Chi-squared and t- distribution.", "Define a Gaussian response model including simple linear regression; determine point and interval estimates and conduct tests of hypotheses for the parameters in a Gaussian model.", "Use a Goodness of Fit test to test the fit of a model, independence in a two-way table and equality of proportions for two or more groups.", "Describe the importance of randomization and pairing in experimental design and be able to recognize whether a study design allows the researcher to conclude cause and effect.", "Instructions can be found on LEARN.", "This learning consists mostly of making sure you understand the concepts and steps that were introduced and used in class to solve examples and then solving problems from the Course Notes on your own.", "The purpose of these assignments is to introduce you to the free statistical software R.", "Only a non-programmable, non-graphical, Math-faculty approved calculator with a pink-tie or blue-goggles sticker will be permitted.", "A 2.5-hour cumulative final examination will be held during the final exam period (April 9 - 25, 2025).", "In the case of illness, you must first provide a completed University of Waterloo Verification of Illness form, please see: https://uwaterloo.ca/math/accommodations/submission", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 30, "course_code": "STAT 231", "course_name": "STAT231 - Statistics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["Notice of Recording", "03:30PM - 04:20PM DC 1350", "02:30PM - 03:20PM", "11:30AM - 12:20PM MC 1085", "03:30PM - 04:20PM", "10:30AM - 11:20AM EIT 1015", "09:30AM - 10:20AM EIT 1015", "Email: aslynko@uwaterloo.ca", "Email: liqun.diao@uwaterloo.ca", "Email: yangjc@uwaterloo.ca", "Email: henan.xu@uwaterloo.ca", "Funmilayo Adeku", "Email: fadeku@uwaterloo.ca", "This course provides a systematic approach to empirical problem solving which will enable students to critically assess the sampling protocol and conclusions of an empirical study including the possible sources of error in the study and whether evidence of a causal relationship can be reasonably concluded.", "The connection between the attributes of a population and the parameters in the named distributions covered in STAT230 will be emphasized.", "Numerical and graphical techniques for summarizing data and checking the fit of a statistical model will be discussed.", "The method of maximum likelihood will be used to obtain point and interval estimates for the parameters of interest as well as testing hypotheses.", "The interpretation of confidence intervals and p-values will be emphasized.", "The Chi-squared and t distributions will be introduced and used to construct confidence intervals and tests of hypotheses including likelihood ratio tests.", "Contingency tables and Gaussian response models including the two sample Gaussian and simple linear regression will be used as examples.", "Course Information Webpage", "Please do not send these questions via email.", "I expect everyone to be respectful to each other, any posts that do not meet the principles in Policy 33: Ethical Behaviour will be removed.", "Email", "Please send emails from uwaterloo.ca email address and include the session number and student ID number.", "Continuity Plans", "Use numerical and graphical summaries of a data set to describe the characteristics of a variate and to check the fit of a statistical model to the data.", "Use the steps of PPDAC to identify both the objectives and possible sources of error in an empirical study, and to critically evaluate the conclusions.", "Identify the connection between attributes of a population and the parameters in the named distributions (Binomial, Poisson, Multinomial, Exponential, Normal).", "Define and use the likelihood function to obtain point estimates of the unknown parameters in a model particularly for the Binomial, Poisson, Multinomial, Exponential and Gaussian (Normal) models.", "Use a pivotal quantity to construct a confidence interval for a parameter in some specific cases, and interpret the confidence interval.", "Use the likelihood function to construct and conduct a test of hypothesis for an unknown parameter in a model.", "Interpret p-values and describe the connection with confidence intervals.", "Define the properties of the Chi-squared and t distribution.", "Define a Gaussian response model including simple linear regression; determine point and interval estimates and conduct tests of hypotheses for the parameters in a Gaussian model.", "Use a Goodness of Fit test to test the fit of a model, independence in a two-way table and equality of proportions for two or more groups", "Describe the importance of randomization and pairing in experimental design and be able to recognize whether a study design allows the researcher to conclude cause and effect.", "This learning consists of taking the time to carefully read the course notes on your own, making sure you understand the concepts and steps demonstrated in the lectures to tackle examples, and then solving the end-of-chapter problems.", "Monday", "Friday", "Welcome", "1.1 Introduction to Statistical Sciences", "1.3 Numerical Data Summaries", "1.3 Graphical Summaries", "1.4 Probability Distributions and Statistical Models", "1.5 Data Analysis and Statistical Inference", "1.6 Introduction to R and RStudio", "2.1 Choosing a Statistical Model", "2.2 Estimation of Parameters", "2.3 Method of Maximum Likelihood", "2.4 Likelihood Functions for Multinomial Models", "2.5 Invariance Property of MLE", "2.6 Checking the Model", "3.1 Planing and Conducting Empirical Studies", "3.2 Steps of PPDAC", "3.3 Case Study", "4.1 Statistical Models and Estimation", "4.2 Estimators and Sampling Distributions", "4.4 Confidence Intervals and Pivotal Quantities", "4.5 The Chi-Squared and t Distributions", "4.6 Likelihood-Based Confidence Intervals", "4.7 Confidence Intervals for Parameters in the Gaussian model", "4.7 Confidence Intervals for Parameters in the Gaussian model (Continued)", "5.1 Introduction to Hypothesis Testing", "5.2 Test of Hypotheses for Parameters in the Gaussian Model", "Relationship Between Hypothesis Testing and Confidence Intervals", "5.3 Likelihood Ratio Test of Hypothesis - One parameter", "6.1 Gaussian Response Models", "6.2 Simple Linear Regression: Maximum Likelihood and Least Squares Estimates", "Confidence Interval for Parameters in the Model", "6.3 Checking Model Assumptions and Residual Plots", "Randomization, Paring, and Experimental Design", "7.1 Likelihood Ratio Test for the Multinomial Model", "7.2 Goodness of Fit Tests", "This learning consists mostly of making sure you understand the concepts and steps that were introduced and used in class to solve examples and then solving problems from the Course Notes on your own.", "R Statistical Software", "R and the RStudio development environment can be downloaded from here.", "All assessments are proctored, in-person, and closed-book exams.", "A 2.5-hour cumulative final examination will be held during the final exam period (April 9 - 25, 2025).", "If you have a question regarding the marking of an assessment, you should first check the posted solutions on LEARN.", "First and last name", "Session number", "Please be specific and explain your rationale for a remark.", "Notice of Recording", "Short-term absence", "COVID-19-related absence", "No limits on number of submissions per term and only available during the formal lecture period", "In particular:", "Please inform us of these at the start of the course.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 31, "course_code": "STAT 241", "course_name": "STAT241 - Statistics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 1, "major_name": "Mathematics (Bachelor of Mathematics, Three-Year General)", "topics": ["RCH 307", "Part I, Talking Probability: The statistical approach to analyzing data begins with a probability model to describe the data generating process; that’s why, to study statistics, one must first learn to speak the language of probability.", "10-11 Some \"standard\" statistical problems: categorical data analysis; two-sample comparisons, confounding factors, randomization, and blocking; simple linear regression.", "Midterms (M) 30 pts @ 15 pts each", "Final (F) (100 - A - M) pts", "Date & Time Location", "Then, his final exam will be worth 100-A-M=100-0-6=94 pts."]}, {"course_id": 0, "course_code": "CS 115", "course_name": "CS115 - Introduction to Computer Science 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Introduction to Computer Science 1 Winter 2025", "Diren Swayze", "An introduction to the fundamentals of computer science through the application of elementary programming patterns in the functional style of programming.", "As we are aware of the varied ways in which this material might be of use in the future, we have included concepts that are beautiful and universal.", "Because of the fundamental nature of the concepts taught in CS 115, the course can serve both students whose primary interest in computers is in their use in their chosen areas of study and students intending to minor in CS.", "Module 01: Introduction Monday January 6", "Module 03: Strings and Symbols Monday January 13", "Module 06: Structural Recursion Monday February 3", "Module 08: Local Evaluation Monday February 24", "Module 09: Higher-Order Functions Monday March 3", "Exams", "You can submit each of those files as many times as you like before the deadline.", "Every time you submit a file, we'll run some basic checks on it to make sure it looks valid, and send you preliminary feedback via email.", "Re-marking", "The forms will be in a Survey on Learn for each assignment for two weeks."]}, {"course_id": 1, "course_code": "CS 135", "course_name": "CS135 - Designing Functional Programs (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Designing Functional Programs Winter 2025", "Monday -", "Monday", "07:00PM - 08:50PM", "08:30AM - 09:20AM", "10:30AM - 11:20AM MC 2034", "Charlie Clarke", "Email: claclark@uwaterloo.ca", "Karen Anderson", "Email: kaanders@uwaterloo.ca", "Email: dbwolff@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "Sara Nayar", "Email: cs135@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "CS135 Problem-solving FAQ", "Assignment Marking Error: Submit a re-mark request, due within one week of release of marks.", "Read Me First", "We hope to guide you through a carefully designed curriculum that introduces you to core concepts in computer science.", "In a typical week, you will move through the following activities:", "You should get a feel for what information is where so you can find it quickly in the future.", "An introduction to the fundamentals of computer science through the application of elementary programming patterns in the functional style of programming.", "Syntax and semantics of a functional programming language.", "Linear and nonlinear data structures.", "Abstraction and encapsulation.", "CS 135 Designing Functional Programs", "CS 135 is for students who would prefer a more conceptual treatment of introductory computer science in a simple language that is educationally effective but not commercially relevant.", "Hardware and Software", "Student labs are equipped with the DrRacket integrated development environment running on networked personal computers.", "References", "How To Design Programs by Felleisen, Findler, Flatt, and Krishnamurthi, MIT Press, 2003.", "Definition of lists, designing functions to process and produce lists, recursive definition of natural numbers, recursive data definitions.", "Non-Linear Structures (6 hours)", "Multi-clausal recursive data definitions, trees, mutually referential data definitions, design methods for complex data, iterative refinement, multiplexing.", "Early development of electronic computers and programming languages.", "History of concepts covered in this course.", "have understanding and experience with the topics in the course outline above", "Drop deadline 25", "Reading Week Starts", "Slides Description", "L01 Values and expressions Prefix notation, exact numbers, Boolean expressions, constants", "L04 Lists List values and expressions, composite data, data definitions", "iClicker pilot", "2024-08-26: CS135 is participating in a pilot comparison of iClicker and Vevox.", "The iClicker subscription should be free.", "iClicker Account", "Racket and DrRacket", "It is also simple and clean enough that we cover computer science content many CS students do not see until later in their CS careers.", "If you submit code written under some other system and it does not work in our currently-supported version of DrRacket, then we consider that code incorrect even if it works for you at home.", "Your work in CS135 will be assessed in a variety of ways.", "Coverage", "Using such off-limits material generally results in a significant loss of marks.", "In general, the basic tests will try to warn you if inappropriate functions and special forms are used.", "Submitting a partially completed solution is a good idea, just in case you don’t get back to it before the due date and to serve as a backup in case your computer breaks or is stolen.", "Email Karen Anderson .", "Email the ISAs and ask them to “mark it for feedback”.", "Testing", "We do several kinds of testing on your submissions:", "Basic tests", "Each time you submit before the due date, we run a set of “basic tests” on your submission.", "It’s amazing how many fatal errors can appear during last-minute tidying up!", "Do not make your last submission immediately before the deadline – it gives you no time to check the Basic Test results and respond, if needed.", "The numeric mark appearing on the basic test marksheet is only for guidance.", "After the submission deadline we run a second set of tests to assess your code, including:", "These post-deadline tests and hand-marking form your mark for the assignment.", "If you procrastinate long enough, this rule can easily cause you to fail the course.", "We won’t rehash the above policies, but we do want to make them concrete for CS135.", "A specific assignment may give exceptions to the above.", "You are welcome to use these tools to help you understand the course material, but you should not:", "cut-and-paste your assignment code into them for debugging assistance.", "Also, these tools will not be available when you write the exam, so you need to understand how to solve these problems yourself in order to pass the course.", "attempting to run malicious code during the submission or marking process."]}, {"course_id": 2, "course_code": "CS 145", "course_name": "CS145 - Designing Functional Programs (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Designing Functional Programs (Advanced Level)", "10:00AM - 11:20AM MC 2017", "Monday -", "Monday", "07:00PM - 08:50PM", "Email: troy.vasiga@uwaterloo.ca", "Office Hours: Tues and Thur 1:00-2:00pm in MC 6212,", "Email: kaanders@uwaterloo.ca", "Email: cs145@uwaterloo.ca", "Fri 2:30-3:30pm in MC 4065,", "Email: cs145@uwaterloo.ca", "This course introduces students to key concepts in the field of Computer Science, prepares students to complete the CS portion of their Math core requirements and, if desired, continue on to second-year core courses in CS, provides top students with appropriate challenges and enrichment, and explores topics in greater depth than is possible in CS 135.", "Audience", "Demonstrate above-average communication skills (listening, reading, writing) due to the lack of textbook support for much of the enrichment material", "Given a clear and concise statement of a problem or task, write a program from scratch of up to a hundred lines of properly-formatted and documented code in a functional programming language to solve the problem or complete the task", "Use elementary data structures, such as lists and trees, in programs", "Use higher-order functions to improve readability and efficiency of programs", "Analyze the worst-case running time of programs and describe examples of data that demonstrate that the analysis cannot be improved", "Demonstrate their understanding of the implementation of functional programming language features by coding small interpreters for Scheme-like languages", "An introduction to functional programming", "Function application and definition", "Substitution model", "Types in Scheme", "Structures", "Recursion on lists and integers", "Unary representation of integers", "Proving properties of programs", "Algorithm analysis", "Functions as values", "Anonymous functions", "Higher-order functions", "Local definitions", "Simplifying the language", "Binary representation of integers", "Immutable abstract data types", "Association lists", "Leaf-labelled and node-labelled trees", "S-expressions", "Interpreters", "Limits to computation", "Efficiency", "Purely-functional data structures", "Priority Queue ADT and Braun heaps", "Efficient maps: treaps, red-black trees, AA trees", "They will not be due each week on the same day, as is common in the other first-year CS courses and the first-year Math courses.", "Assignment questions are the main way to reinforce and deepen your understanding of the concepts and skills discussed in lecture.", "You will submit program files electronically to the Marmoset system, which runs tests on your code and informs you of the results fairly rapidly.", "You can still get a great mark in the course.", "Questions and concerns can be sent to instructor or ISA emails.", "When asking questions, first check in case the question has already been answered using the search bar above the feed/list of posts.", "Walk-in consulting hours may still be available if course staff are able to book a sufficiently-large room to follow distancing guidelines."]}, {"course_id": 3, "course_code": "CS 116", "course_name": "CS116 - Introduction to Computer Science 2 (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Introduction to Computer Science 2 Winter 2025", "Monday -", "Monday", "07:00PM - 08:50PM", "E. Dupont", "E. Dupont", "E. Dupont", "10:00AM - 11:20AM MC 4045", "02:30PM - 03:20PM", "08:30AM - 09:20AM", "09:30AM - 10:20AM MC 4042", "10:30AM - 11:20AM MC 4060", "11:30AM - 12:20PM MC 4060", "02:30PM - 03:20PM", "This course builds on the techniques and patterns learned in CS115 while making the transition to use of an imperative language.", "Use higher-order functions to improve the readability and efficiency of programs", "Describe the basic memory model for mutation of basic types, lists, and objects in Python", "Distinguish between constant, linear, quadratic, and exponential running times of algorithms", "Write useful Python programs using console and file input and output for practical tasks", "All times are given in Eastern Time.", "Important!", "In order to maintain a level of success in the course, students should not miss the completion of any modules.", "Students should check their basic tests email to ensure that the code meets the specification exactly.", "Please make sure you do this often!", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 4, "course_code": "CS 136", "course_name": "CS136 - Elementary Algorithm Design and Data Abstraction (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Elementary Algorithm Design and Data Abstraction Winter 2025", "08:30AM - 09:50AM MC 2017", "10:00AM - 11:20AM MC 2038", "10:00AM - 11:20AM MC 4059", "11:30AM -", "Monday -", "Monday", "07:00PM - 08:50PM", "This course builds on the techniques and patterns learned in CS135 while making the transition to use an imperative language.", "Topics discussed include iterative and recursive sorting algorithms; lists, stacks, queues, trees, and their application; abstract data types and their implementations.", "produce well-designed, properly formatted, documented and tested programs of a moderate size (200 lines) that can use basic I/O", "explain and demonstrate the use of the C memory model, including the explicit allocation and deallocation of memory", "explain and demonstrate the principles of modularization and abstraction", "implement, use and compare elementary data structures (structures, arrays, lists and trees) and abstract data type collections (stacks, queues, sequences, sets, dictionaries)", "If both exams are held in person", "If both exams must be held online", "If in-person exams cannot be held then they will be held online (if possible).", "You may also ask on the discussion forums in a private message.", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 5, "course_code": "CS 146", "course_name": "CS146 - Elementary Algorithm Design and Data Abstraction (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Elementary Algorithm Design and Data Abstraction (Advanced Level)", "Monday -", "Monday", "07:00PM - 08:50PM", "02:30PM - 03:20PM", "Brad In-person MC 6427", "On-line Consulting Hours: Microsoft Teams", "CS 146: Elementary Algorithm Design and Data Abstraction (advanced version)", "To familiarize students with key concepts in introductory computer science from an imperative perspective and to contrast this with the functional perspective taken in CS 145;", "To allow students to complete the CS portion of their Math core requirements and, if desired, to continue on to second-year core courses in CS;", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "Introduction to C and elementary mutation in Scheme", "The memory model.", "Variable declaration, assignment and infix expressions in C. Basic I/O in C. Compilation.", "Algorithm analysis in C. File I/O in C and Scheme.", "Program organization and testing methods.", "Space analysis in C and Scheme.", "Mutable lists, queues, deques, and trees in C. Time-space tradeoffs among mutable and immutable ADT implementations.", "Low-level abstractions", "Pointer arithmetic in C. Arrays in C and vectors in Scheme.", "Strings in C. Elementary hashing.", "Libraries in C and Scheme.", "Implementing high-level abstractions", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "The provided slides are not a substitute for attendance in any first-year CS course, but in CS 146, there are no slides, and the lecture summaries made available after lecture are an even worse substitute for attendance.", "Lectures will involve the development of ideas summarized very tersely in the handouts, as well as on-the-fly development of code, analyses, and proofs.", "CS145 and CS146 were originally designed as a year-long unit of curriculum, but eventually the individual courses drifted in their own directions.", "1.1 A note on logistics", "1.2 Review of forms of recursion and associated proof techniques", "1.3 In preparation for side effects", "1.4 Output", "1.5 Input", "1.6 First Introduction to C", "1.8 Memoization", "1.9 Mutation in C", "1.11 Boxes in C", "1.12 Advanced mutation", "1.13 Aliasing in C", "1.14 Memory and vectors", "1.15 Vectors in Racket", "1.16 Arrays in C", "1.18 ADTs in C; Amortized Analysis", "2 SIMPL: a simple imperative language", "2.1 Syntax and informal semantics", "2.2 Examples in several languages", "2.3 Formal semantics", "2.5 Proving imperative programs correct", "A primitive imperative language", "3.1 A primitive imperative language", "3.2 The PRIMPL simulator", "3.4 The SIMPL to A-PRIMPL compiler", "3.6 Strings in C", "3.7 Adding functions to SIMPL", "3.8 Adding both arrays and functions to SIMPL", "3.9 Implementing lists in PRIMPL", "4 MMIX: a realistic instruction set", "4.1 A more realistic processor", "4.2 The MMIX architecture", "4.2.1 Branches and Jumps", "4.2.2 Example", "4.2.3 Software Interrupts", "4.2.5 A Problem with Branches and Jumps", "4.4 Towards a SIMPL to MMIX compiler", "5.1 Storing primitive values", "5.3 Managing memory", "5.4 Structural and pointer equality", "5.5 Function application in a Racket interpreter", "5.7 Justifying the cost of Racket primitives", "5.8 Moving towards implementation in an imperative language", "6.2 Zippers", "6.3 A continuation-passing interpreter", "6.6.2 Mark-and-sweep", "6.6.3 Copying garbage collection", "6.7 Heterogeneous Data in C", "6.8 Multidimensional Arrays in C", "6.10 Variable-length Argument Lists", "7.1 Continuation-passing style", "7.2 Exception handling", "7.3 Undelimited continuations", "7.4 Delimited continuations", "7.5 Racket’s implementation of continuations", "In CS 146, we will examine the imperative paradigm, and compare and contrast the way that efficient algorithms and data structures are designed in imperative and functional languages.", "Racket is a laboratory for current research on aspects of functional programming languages, and we will continue to look at interesting topics in this area, perhaps at the cost of some coherency in the flow of material.", "They will not be due each week on the same day, as is common in the other first-year CS courses and the first-year Math courses.", "Assignment questions are the main way to reinforce and deepen your understanding of the concepts and skills discussed in lecture.", "You will submit program files electronically to the Marmoset system , which runs tests on your code and informs you of the results fairly rapidly.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "(Please also note that we may use the trends in a student's submission history to estimate the likelihood of other forms of cheating as well.)", "Library for research-based assignments"]}, {"course_id": 6, "course_code": "MATH 106", "course_name": "MATH106 - Applied Linear Algebra 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Applied Linear Algebra 1 Winter 2025", "Systems of linear equations.", "Introduction to vector spaces.", "We will see how to solve systems of linear equations using matrix methods before studying matrices as algebraic objects in their own right.", "Next, we will learn about the fundamental concepts of span, linear independence, and basis and learn how to determine whether a set is a subspace of Rn.", "After studying subspaces, we will study linear mappings, which map subspaces to subspaces.", "We will discuss the geometric interpretation of these mappings and study their fundamental subspaces.", "Finally, we will learn how to calculate the determinant of a matrix and use this knowledge to diagonalize square matrices.", "Provide a graphical and algebraic description of vectors, lines, and planes in R^n", "Model and solve mathematical and discipline-specific problems using systems of linear equations", "Perform basic algebraic operations on matrices", "Given a set of vectors in R^n, determine whether it is linearly independent, a spanning set of R^n, or a basis of R^n", "Given a basis and a vector in standard coordinates, use matrix methods to calculate its coordinate vectors", "Given a set in R^n, determine whether it is a subspace of R^n", "Given a mapping L: R^n --> R^m, determine whether it is linear", "Given a linear mapping, choose the appropriate algorithm find a basis for each of its fundamental subspaces", "Given a square matrix, calculate its determinant and provide a geometric interpretation of this value", "Communicate ideas and concepts relating to linear algebra using accurate mathematical language and notation", "Calculators", "Avoiding Academic Offences", "I am committed to creating a learning environment where diverse perspectives are recognized and valued as a source of strength.", "School-Life Conflict"]}, {"course_id": 7, "course_code": "MATH 136", "course_name": "MATH136 - Linear Algebra 1 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Notice of Recording", "Linear Algebra 1 for Honours Mathematics Winter 2025", "08:30AM - 09:20AM MC 4061", "09:30AM - 10:20AM MC 4061", "10:30AM - 11:20AM QNC 2502", "11:30AM - 12:20PM MC 2065", "02:30PM - 03:20PM", "03:30PM - 04:20PM QNC 2502", "11:30AM - 12:20PM MC 4061", "10:30AM - 11:20AM B1 271", "Systems of linear equations, matrix algebra, elementary matrices, computational issues.", "Real n-space, vector spaces and subspaces, basis and dimension, rank of a matrix, linear transformations, and matrix representations.", "Master computational aspects of linear algebra, including matrix and vectors operations", "Solve systems of m linear equations in n unknowns", "Evaluate the inverse of a square matrix, when it exists", "Obtain the matrix representation of a linear transformation", "Evaluate the determinant of a square matrix", "Change co-ordinates and bases, and understand the effect on matrix representations", "Become familiar with operations and properties of abstract vector spaces", "While collaboration in understanding the material is encouraged, the work submitted must be your own, written independently.", "For example, submitting 60 minutes late will result in a maximum possible score of 40%, assuming a perfect score.", "Accommodation Requests", "Notice of Recording", "Allocate time appropriately towards the completion of the assignment which reduces the procrastination and cramming cycle", "Appreciate the importance of reviewing marked assignments", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as reading and writing proofs.", "Library for research-based assignments"]}, {"course_id": 8, "course_code": "MATH 146", "course_name": "MATH146 - Linear Algebra 1 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Linear Algebra 1 (Advanced Level)", "Email: karigiannis@uwaterloo.ca", "This course is a rigorous treatment of the theory of finite dimensional vector spaces over an arbitrary field.", "We also cover the theory of determinants over an arbitrary commutative ring with identity, and some aspects of the theory of polynomials in one variable over a field.", "The ultimate goal is the Primary Decomposition Theorem, which characterizes a linear operator on a finite dimensional vector space in terms of invariant subspaces annihilated by the primary factors of its minimal polynomial.", "We will cover a large amount of difficult material at a fast pace.", "Understand and apply the concepts of the theory of abstract vector spaces and linear operators on finite-dimensional vector spaces.", "fields; systems of linear equations; matrices; row-reduced echelon form; matrix algebra; invertible matrices", "vector spaces; subspaces; bases and dimension; coordinates; row equivalence", "algebra of linear maps; isomorphism; representations by matrices; dual space; transpose of a linear map", "commutative rings; existence and uniqueness of determinants; multilinear maps; the exterior algebra", "eigenvalues; annihilating polynomials; invariant subspaces; simultaneous triangulation and diagonalization", "Much (but not all) of my lectures will closely follow the first six chapters of this book:", "“Linear Algebra: Second Edition” by Kenneth Hoffman and Ray Kunze; Prentice Hall, 1971.", "“Linear Algebra: Fourth Edition” by Friedberg, Insel, and Spence; Prentice-Hall, 2003.", "The assignments are an integral part of your evaluation in this course and I encourage everyone to take them very seriously.", "There will be no opportunity for a make-up midterm test."]}, {"course_id": 9, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 10, "course_code": "MATH 137", "course_name": "MATH137 - Calculus 1 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Notice of Recording", "10:30AM - 11:20AM MC 4059", "Monday -", "Monday", "07:00PM - 08:50PM", "Absolute values and inequalities.", "Sequences and their limits.", "Introduction to series.", "Limits of functions and continuity.", "Applications of the Mean Value theorem, Taylor polynomials and Taylor's theorem, Big-O notation.", "We will study these ideas as they relate to sequences and functions.", "First, we will examine sequences and what it means for one to converge.", "Next, we will use our knowledge of sequences to discuss functions, including limits and derivatives.", "Write clear and well-organized mathematical solutions and proofs.", "Solve problems in Calculus through logical thinking and careful analysis.", "Determine if a recursively-defined sequence converges and prove it using mathematical induction.", "Compute the limits of various functions using both the formal definition of the limit, arithmetic rules for limits,and l'Hopital's Rule.", "Find solutions to optimization and related rates problems.", "Sketch curves by first analyzing a given function and its derivatives.", "4: Jan 27 - 31 2.1 - 2.2 Functions and their Limits, Sequential Characterization of Functions, Squeeze Theorem Quiz 3", "7: Mar 3 - 7 3.5 -  3.7 Linear Approximation, Newton's Method, IFT Quiz 6", "8: Mar 10 - 14 3.8 - 4.2 Implicit and Logarithmic Differentiation, Related Rates, Local & Global Extrema, EVT Quiz 7", "9: Mar 17 - 21 ‡ 4.3 - 4.6 MVT and its Applications, Shape of a Function via 1st and 2nd Derivatives Quiz 8", "FE: Mar 31 - Apr 4 4.9 - 4.10 Curve Sketching, Optimization Quiz 10", "Notice of Recording", "Phone: 519-884-0000 extension 213", "Please let us", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 11, "course_code": "MATH 147", "course_name": "MATH147 - Calculus 1 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["11:30AM - 12:20PM MC 4059", "04:30PM - 05:20PM", "Monday -", "Monday", "07:00PM - 08:50PM", "Introduction to mathematical proofs: Week 1;", "2. Sequences and Limits: Weeks 2 – 4;", "3. Functions and Continuity: Weeks 5–8;", "Introduction to Real Analysis, by R. Bartle and D. Sherbert No", "Any missed assignment will be given a score of zero.", "For any missed examination, you must have a valid reason and appropriate supporting documentation.", "In case VIF or STAD covers the midterm, the midterm may be excused, and its weight may be transferred to the final exam."]}, {"course_id": 12, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 13, "course_code": "MATH 138", "course_name": "MATH138 - Calculus 2 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Notice of Recording", "08:30AM - 09:20AM", "09:30AM - 10:20AM MC 4059", "10:30AM - 11:20AM MC 4061", "E. Bembenek", "11:30AM - 12:20PM MC 4021", "cpthowel@uwaterloo.ca", "E. Yalcin", "02:30PM - 03:20PM", "08:30AM - 09:20AM QNC 2502", "Introduction to the Riemann integral and approximations.", "Antiderivatives and the fundamental theorem of calculus.", "Applications of the integral.", "Improper integrals.", "Linear and separable differential equations and applications.", "Binomial series, functions defined as power series and Taylor series.", "The goal of this course is to further expand your knowledge of calculus and its applications for one-variable functions.", "First, we will explore areas under curves and the Fundamental Theorem of Calculus, integration techniques, and applications of integration including finding the area between two curves, volumes of solids of revolution, and the average value of a function.", "We will study how to solve separable differential equations and linear differential equations as well as their applications to population growth and Newton's Law of Cooling.", "Write clear and well-organized mathematical solutions and proofs.", "Solve problems in Calculus through logical thinking and careful analysis.", "Set up and evaluate Riemann integrals for simple functions", "Apply various integration techniques including change of variable, integration by parts, trigonometric substitution, and partial fractions.", "Solve separable and first-order linear differential equations.", "Compute the radius and interval of convergence for power series.", "Compute Taylor Polynomials and Taylor series for many elementary functions.", "1: Jan 6 - 10 1.1 - 1.3 Riemann Sums, Definite Integrals, Average Value", "5: Feb 3 - 7 2.1 - 2.2.2, 2.3 Intro to DEs, Direction Fields, Separable and First-Order Linear DEs Quiz 4", "8: Mar 10 - 14 4.1 - 4.3 Intro to Power Series, Differentiation & Integration of Power Series Quiz 7", "FE: Mar 31 - Apr 4 4.8 Big-O Notation Quiz 10", "Notice of Recording", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 14, "course_code": "MATH 148", "course_name": "MATH148 - Calculus 2 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["08:30AM - 09:20AM", "Instructor: Michael Brannan", "E-mail: michael.brannan@uwaterloo.ca", "Week of", "3 Jan. 20 Fundamental Theorem of Calculus  A1", "4 Jan. 27 Techniques of Integration  A2", "5 Feb. 3 More Techniques and Improper Integration", "6 Feb. 10 Applications of Integration A3", "8 Mar. 3 Convergence Tests A4", "10 Mar 17 Sequences and Series of Functions A5", "11 Mar. 24 Power Series", "12 Mar. 31 Differential Equations A6", "Principles of Mathematical Analysis."]}, {"course_id": 15, "course_code": "MATH 135", "course_name": "MATH135 - Algebra for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Algebra for Honours Mathematics Winter 2025", "An introduction to the language of mathematics and proof techniques through a study of the basic algebraic systems of mathematics: the integers, the integers modulo n, the rational numbers, the real numbers, the complex numbers and polynomials.", "Algebra for Honours Mathematics is a study of the basic number systems of mathematics.", "The course has two themes: Number systems and Mathematical language.", "The study of number systems will feel more familiar and will cover the integers, the integers modulo n, the complex numbers and polynomials.", "Gain practice in formulating conjectures and discovering proofs.", "Understand basic algebraic systems of mathematics: the integers, the integers modulo n, the rational numbers, the real numbers, the complex numbers and polynomials.", "MATH 135 Course Notes: Language and Proofs in Algebra, An Introduction Please see the Course Notes page in LEARN for the pdf No Free", "Generative AI: This course includes the independent development and practice of specific skills, such as proof discovery and proof writing.", "Library for research-based assignments", "In particular:"]}, {"course_id": 16, "course_code": "MATH 145", "course_name": "MATH145 - Algebra (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["02:30PM - 03:20PM", "E-mail: bmadill@uwaterloo.ca", "Topics include rings and subrings, integral domains and fields, homomorphism and isomorphism, quotient rings and modular arithmetic, isomorphism and the Chinese Remainder Theorem, irreducibility in integral domains, and field extensions.", "Week of", "1 Sept 5* Rings and Subrings", "3 Sept 19 Integral Domains and Fields A1", "7 Oct 24 FIT and CRT A3", "9 Nov 7 GCD's A4", "11 Nov 21 Field Extensions"]}, {"course_id": 17, "course_code": "MATH 207", "course_name": "MATH207 - Calculus 3 (Non-Specialist Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Notice of Recording", "02:30PM - 03:20PM", "Multivariable functions and partial derivatives.", "Multiple integrals.", "Introduction to Fourier Series.", "Notice of Recording"]}, {"course_id": 18, "course_code": "MATH 229", "course_name": "MATH229 - Introduction to Combinatorics (Non-Specialist Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Introduction to Combinatorics (Non-Specialist Level)", "11:30AM - 12:20PM RCH 205", "S. Pfannerer-Mittas", "Introduction to graph theory: colourings, connectivity, Eulerian tours, planarity.", "Introduction to combinatorial analysis: elementary counting, generating series, binary strings.", "We cover many of the same topics as MATH 239, but we also have a couple of topics they don't and we cover everything at a more intuitive and playful level.", "In the first half of the course you will be assigned to a family of combinatorial objects which will be your object.", "For each topic in the first half of the course you will work on examples which relate to your object.", "know some combinatorial objects intimately", "use modern techniques to enumerate them and learn things about them", "have a foundation in graph theory", "have increased mathematical maturity", "The first half is enumeration; the second half is graph theory", "A non-submission would be a 0 and thus considered one of the lowest marks.", "In the second half of the course you and your group are asked to give a short presentation on a family of graphs in the tutorials."]}, {"course_id": 19, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 20, "course_code": "MATH 239", "course_name": "MATH239 - Introduction to Combinatorics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Introduction to Combinatorics Winter 2025", "11:30AM - 12:20PM MC 4059", "09:30AM - 10:20AM MC 4021", "P. Nelson", "08:30AM - 09:20AM QNC 1502", "S. Pfannerer-Mittas", "10:30AM - 11:20AM MC 4058", "11:30AM - 12:20PM MC 4058", "09:30AM - 10:20AM MC 4042", "02:30PM - 03:20PM", "10:30AM - 11:20AM PHY 150", "04:30PM - 05:20PM", "You should have no reason to contact them directly, but you can find their email addresses through Learn.", "First name Last name", "Guilherme Zeus Dantas E Moura", "Theodore Morrison", "Matthew Kroeker", "Introduction to graph theory: colourings, matchings, connectivity, planarity.", "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.", "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 21, "course_code": "MATH 247", "course_name": "MATH247 - Calculus 3 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Topology on RN: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. (~3 weeks)", "Differentiation: partial differentiability, differentiability, chain rule, [midterm likely here], Taylor polynomials, extreme value problems. (~4 weeks)", "Integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. (~3 weeks)", "Local properties of continuously differentiable functions:  open mapping theorem, inverse function theorem, implicit function theorem. (~2 weeks)", "11:30AM - 12:20PM QNC 2501", "Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem.", "Topology of real n-dimensional space: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. Differential calculus on multivariable functions: partial differentiability, differentiability, chain rule, Taylor polynomials, extreme value problems. Riemann integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem."]}, {"course_id": 22, "course_code": "MATH 249", "course_name": "MATH249 - Introduction to Combinatorics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Introduction to Combinatorics (Advanced Level)", "09:30AM - 10:20AM MC 2017", "For graph theory, while we will focus on the same topics covered in MATH 239 (planarity and bipartite matching), our coverage of those topics will differ substantially in depth and in the techniques that we employ; in particular, we will see striking applications of algebra.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 23, "course_code": "MATH 225", "course_name": "MATH225 - Applied Linear Algebra 2 (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Applied Linear Algebra 2 Winter 2025", "Student Drop-In Hours", "Getting study ideas", "Linear transformations and matrices.", "Eigenvalues and eigenvectors.", "In this course, we will learn certain advanced topics in linear algebra.", "It turns out that the term “vector space” applies not only to the n-dimensional real vector space Rn, but also to collections of m-by-n matrices with real coefficients Mmxn(R) and polynomials of bounded degree PnR. We will see that such familiar terms as the dot product, norm, distance, orthogonality, and projection can be generalized in a natural way to these vector spaces.", "We will also extend the theory of matrix diagonalization to these new settings.", "The course will also touch upon some topics that find many real-world applications, such as the Method of Least Squares, Singular Value Decomposition and Linear Programming.", "Determine whether a linear mapping between vector spaces is an isomorphism.", "Diagonalize a linear mapping.", "Use the Fundamental Theorem of Linear Algebra to prove that the rowspace and the columnspace of a matrix are orthogonal to each other.", "Determine the best fitting polynomial for a collection of data points using the Method of Least Squares.", "Orthogonally diagonalize a symmetric matrix.", "Compute a Singular Value Decomposition of a matrix.", "Solve constrained optimization problems related to quadratic forms and linear mappings.", "Solve constrained optimization problems using linear programming.", "Calculators", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "Avoiding Academic Offences", "In this course, diverse perspectives are recognized and valued as a source of strength.", "School-Life Conflict"]}, {"course_id": 24, "course_code": "MATH 235", "course_name": "MATH235 - Linear Algebra 2 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Linear Algebra 2 for Honours Mathematics Winter 2025", "Understand the definition of an abstract vector space and prove theorems about all vector spaces using the axioms.", "In the context of abstract vector spaces, understand and use the concepts of linear independence, spanning sets, bases, and dimension.", "Understand the definition of a linear transformation, and be able to prove whether or not a function is a linear transformation.", "Prove and apply the rank-nullity theorem.", "Understand and use the relationship between abstract linear transformations and matrices.", "Understand the axioms of an inner product, and use them to prove basic results about inner product spaces.", "Unitarily diagonalize a normal matrix.", "See schedule on Learn for a week-by-week breakdown of topics.", "Abstract Vector Spaces", "The definition of a vector space", "Subspaces", "Bases and dimension", "Linear Transformations", "Linear transformations between abstract vector spaces", "Rank and nullity", "Linear maps as matrices", "Change of coordinates", "Isomorphisms of vector spaces", "Eigenvectors", "Diagonalization", "Powers of matrices", "Inner product spaces", "Inner products", "Orthogonality and norm", "Orthonormal bases", "Projections", "Inner products and Gram matrices", "Singular value decomposition", "Singular values and singular vectors", "Singular value decomposition of matrices", "Singular value decomposition of linear maps", "You may complete these in groups of up to 3 students.", "You should be striving each week to understand the material on the assignments and the posted solutions.", "This will be a closed book exam, with no calculators permitted.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as writings proofs and communicating mathematical ideas.", "Library for research-based assignments"]}, {"course_id": 25, "course_code": "MATH 245", "course_name": "MATH245 - Linear Algebra 2 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Linear Algebra 2 (Advanced Level)", "11:30AM - 12:20PM E2 1732", "E-mail: bmadill@uwaterloo.ca", "This is a second course in proof-based linear algebra.", "Particular emphasis will be placed on polynomials of linear operators, Jordan canonical form, and inner product spaces.", "Week of", "3 Sept. 16 Jordan Canonical Form I A1", "5 Sept. 30 Inner Product Spaces, Orthogonality T1", "A4", "10 Nov. 11 Singular Value Decomposition A6", "Linear Algebra by Friedberg, Insel, and Spence No"]}, {"course_id": 26, "course_code": "STAT 220", "course_name": "STAT220 - Probability (Non-Specialist Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["09:30AM - 10:20AM RCH 205", "Come with well-organized questions to make the best use of your time.", "Tutorial sections are listed above, except for the first week and the reading week.", "Class Discussion Board", "Joint, marginal, and conditional probability mass functions of two or more discrete random variables and functions of random variables are also discussed.", "Define a probability model and determine probabilities of events using counting techniques.", "Define and use probability mass functions/probability density functions and cumulative distribution functions to determine probabilities of events.", "Definitions of Probability; Review of Set Notation; Sample Space;", "Simple and Compound Events.", "2.1 - 2.4", "Addition and multiplication rules for Counting", "Permutations and Combinations", "2.5 - 2.6", "Discrete Random variables; Probability Functions, Cumulative Distribution Functions", "3.1 - 3.2", "Week 6 (Feb 10-14) Functions of a Random Variable; Expectation and its Properties; Variance and Standard Deviation 3.3", "5.1 - 5.4", "Week 9 (Mar 10-14) Expectation and Covariance for Multiple Random Variables; Linear Combinations of Random Variables 5.5 - 5.8", "Multinomial Distribution; Continuous Random Variables; Probability Density Function; Cumulative Distribution Function; Expected Value and Variance for Continuous Random Variables 5.8 - 5.9, 4.1-4.3", "Week 12 (Mar 31-Apr 4) Central Limit Theorem; Normal Approximation to the Binomial Distribution; Normal Approximation to the Poisson Distribution* 7.3, 7.5", "Learning primarily involves understanding the concepts and methods demonstrated in class to solve problems.", "Mathematical Statistics with Applications (Mendenhall, Wackerly, Scheaffer), 7th eddition A copy of the textbook is available for 3-hour loans in the DC library No", "This learning consists mostly of making sure you understand the concepts and steps that were introduced and used in class to solve examples and then solving problems on your own.", "Final Exam will be a 2.5-hour closed-book assessment held during the official exam period from April 9 to 25.", "For both Term Tests and the Final Exam, only non-programmable, non-graphical calculators approved by the Math faculty and marked with a pink-tie or blue-goggle sticker are allowed.", "Intellectual property includes items such as:", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills."]}, {"course_id": 27, "course_code": "STAT 230", "course_name": "STAT230 - Probability (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["03:30PM - 04:20PM MC 4045", "09:30AM - 10:20AM MC 4045", "02:30PM - 03:20PM", "03:30PM - 04:20PM MC 2017", "08:30AM - 09:20AM", "Pavel Shuldiner; E-mail: pavel.shuldiner@uwaterloo.ca; M3 4108", "Come with well-organized questions to make the best use of your time.", "Requests must be emailed to sasugradadv@uwaterloo.ca", "Joint probability functions, marginal probability functions, and conditional probability functions of two or more discrete random variables and functions of random variables are also discussed.", "Post-requisite:", "Define a probability model and determine probabilities of events using counting techniques.", "Define and use probability mass functions, probability density functions, and cumulative distribution functions to determine probabilities of events.", "Use moment generating functions as a tool to determine expected values.", "This learning consists of taking the time to carefully read the lecture notes on your own, ensuring you understand the concepts and steps demonstrated in the lectures to tackle examples, and then solving the end-of-section problems.", "Definitions of Probability", "Mathematical Probability Models", "1.1", "1.2", "Counting in Uniform Probability Models", "Addition and Multiplication Rules for Counting", "Permutations and Combinations", "Counting in Uniform Probability Models", "Addition and Multiplication Rules for Counting", "Permutations and Combinations", "Addition Rules for Unions of Events", "1.3", "2.1", "2.2", "2.3", "Conditional Probability and Product Rules for Intersections of Events", "Probability Mass Functions, Cumulative Distribution Functions", "Functions of Random Variables", "3.2", "Expectation of a Random Variable", "Expectation of a Function of a Random Variable, Properties of Expectation", "Moment Generating Functions", "3.3", "3.4", "3.5", "Basic Terminology and Techniques", "Joint Probability Mass Functions, Marginal Probability Mass Functions", "3.5", "4.1", "Multinomial Distribution", "Linear Combinations of Random Variables", "4.2", "4.4", "Linear Combinations of Random Variables", "Law of Total Expectation", "4.4", "4.5", "4.6", "Law of Total Expectation", "Cumulative Distribution Function, Probability Density Function", "Functions of Random Variables", "4.6", "Expectation of a Random Variable", "Moments of a Distribution, Moment Generating Functions, Mean, Variance, Standard Deviation", "Exponential Distribution", "Normal Distribution", "Exponential Distribution", "Normal Distribution", "Use of the Normal Distribution in Approximations", "Therefore, you should plan to spend between 3 and 6 hours each week in out-of-class learning.", "This learning consists mainly of ensuring you understand the concepts and steps used in class to solve problems and then solving exercises from the Course Notes on your own.", "A 2.5-hour final cumulative examination will be held during the final exam period in April.", "In the case of extenuating circumstances, you must provide sufficient documentation via e-mail to Divya Lala at divya.lala@uwaterloo.ca as soon as possible to verify your absence's circumstances.", "Re-mark Requests:", "Cancellation of In-Person Classes:", "Intellectual property includes items such as:", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "This course includes the independent development and practice of specific skills for solving real-life problems using introductory probability rules.", "Library for research-based assignments"]}, {"course_id": 29, "course_code": "STAT 221", "course_name": "STAT221 - Statistics (Non-Specialist Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["STAT 221", "11:30AM - 12:20PM MC 4064", "ilham.akhundov@uwaterloo.ca", "View requirements for STAT 221", "This course provides a systematic approach to empirical problem solving which will enable students to critically assess the protocol and conclusions of an empirical study including the possible sources of error in the study and whether evidence of a causal relationship can be concluded.", "The connection between the attributes of a population and the parameters in the named distributions covered in STAT 230 will be emphasized.", "Numerical and graphical techniques for summarizing data and checking the fit of a statistical model will be discussed.", "The method of maximum likelihood will be used to obtain point and interval estimates for the parameters of interest as well as testing hypotheses.", "The interpretation of confidence intervals and p-values will be emphasized.", "The Chi- squared and t distributions will be introduced and used to construct confidence intervals and tests of hypotheses including likelihood ratio tests.", "Contingency tables and Gaussian response models including the two sample Gaussian and simple linear regression will be used as examples.", "Use numerical and graphical summaries of a data set to describe the characteristics of a variate and to check the fit of a statistical model to the data;", "Use the steps of PPDAC to identify both the objectives and possible sources of error in an empirical study and to critically evaluate the conclusions;", "Identify the connection between attributes of a population and the parameters in the named distributions (Binomial, Poisson, Multinomial, Exponential, Normal).", "Define and use the likelihood function to obtain point estimates of the unknown parameters in a model particularly for the Binomial, Poisson, Multinomial, Exponential and Gaussian (Normal) models.", "Use a pivotal quantity to construct a confidence interval for a parameter in some specific cases, and interpret the confidence interval.", "Use the likelihood function to construct and conduct a test of hypothesis for an unknown parameter in a model.", "Interpret p-values and describe the connection with confidence intervals.", "Define the properties of the Chi-squared and t- distribution.", "Define a Gaussian response model including simple linear regression; determine point and interval estimates and conduct tests of hypotheses for the parameters in a Gaussian model.", "Use a Goodness of Fit test to test the fit of a model, independence in a two-way table and equality of proportions for two or more groups.", "Describe the importance of randomization and pairing in experimental design and be able to recognize whether a study design allows the researcher to conclude cause and effect.", "Instructions can be found on LEARN.", "This learning consists mostly of making sure you understand the concepts and steps that were introduced and used in class to solve examples and then solving problems from the Course Notes on your own.", "The purpose of these assignments is to introduce you to the free statistical software R.", "Only a non-programmable, non-graphical, Math-faculty approved calculator with a pink-tie or blue-goggles sticker will be permitted.", "A 2.5-hour cumulative final examination will be held during the final exam period (April 9 - 25, 2025).", "In the case of illness, you must first provide a completed University of Waterloo Verification of Illness form, please see: https://uwaterloo.ca/math/accommodations/submission", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 30, "course_code": "STAT 231", "course_name": "STAT231 - Statistics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["Notice of Recording", "03:30PM - 04:20PM DC 1350", "02:30PM - 03:20PM", "11:30AM - 12:20PM MC 1085", "03:30PM - 04:20PM", "10:30AM - 11:20AM EIT 1015", "09:30AM - 10:20AM EIT 1015", "Email: aslynko@uwaterloo.ca", "Email: liqun.diao@uwaterloo.ca", "Email: yangjc@uwaterloo.ca", "Email: henan.xu@uwaterloo.ca", "Funmilayo Adeku", "Email: fadeku@uwaterloo.ca", "This course provides a systematic approach to empirical problem solving which will enable students to critically assess the sampling protocol and conclusions of an empirical study including the possible sources of error in the study and whether evidence of a causal relationship can be reasonably concluded.", "The connection between the attributes of a population and the parameters in the named distributions covered in STAT230 will be emphasized.", "Numerical and graphical techniques for summarizing data and checking the fit of a statistical model will be discussed.", "The method of maximum likelihood will be used to obtain point and interval estimates for the parameters of interest as well as testing hypotheses.", "The interpretation of confidence intervals and p-values will be emphasized.", "The Chi-squared and t distributions will be introduced and used to construct confidence intervals and tests of hypotheses including likelihood ratio tests.", "Contingency tables and Gaussian response models including the two sample Gaussian and simple linear regression will be used as examples.", "Course Information Webpage", "Please do not send these questions via email.", "I expect everyone to be respectful to each other, any posts that do not meet the principles in Policy 33: Ethical Behaviour will be removed.", "Email", "Please send emails from uwaterloo.ca email address and include the session number and student ID number.", "Continuity Plans", "Use numerical and graphical summaries of a data set to describe the characteristics of a variate and to check the fit of a statistical model to the data.", "Use the steps of PPDAC to identify both the objectives and possible sources of error in an empirical study, and to critically evaluate the conclusions.", "Identify the connection between attributes of a population and the parameters in the named distributions (Binomial, Poisson, Multinomial, Exponential, Normal).", "Define and use the likelihood function to obtain point estimates of the unknown parameters in a model particularly for the Binomial, Poisson, Multinomial, Exponential and Gaussian (Normal) models.", "Use a pivotal quantity to construct a confidence interval for a parameter in some specific cases, and interpret the confidence interval.", "Use the likelihood function to construct and conduct a test of hypothesis for an unknown parameter in a model.", "Interpret p-values and describe the connection with confidence intervals.", "Define the properties of the Chi-squared and t distribution.", "Define a Gaussian response model including simple linear regression; determine point and interval estimates and conduct tests of hypotheses for the parameters in a Gaussian model.", "Use a Goodness of Fit test to test the fit of a model, independence in a two-way table and equality of proportions for two or more groups", "Describe the importance of randomization and pairing in experimental design and be able to recognize whether a study design allows the researcher to conclude cause and effect.", "This learning consists of taking the time to carefully read the course notes on your own, making sure you understand the concepts and steps demonstrated in the lectures to tackle examples, and then solving the end-of-chapter problems.", "Monday", "Friday", "Welcome", "1.1 Introduction to Statistical Sciences", "1.3 Numerical Data Summaries", "1.3 Graphical Summaries", "1.4 Probability Distributions and Statistical Models", "1.5 Data Analysis and Statistical Inference", "1.6 Introduction to R and RStudio", "2.1 Choosing a Statistical Model", "2.2 Estimation of Parameters", "2.3 Method of Maximum Likelihood", "2.4 Likelihood Functions for Multinomial Models", "2.5 Invariance Property of MLE", "2.6 Checking the Model", "3.1 Planing and Conducting Empirical Studies", "3.2 Steps of PPDAC", "3.3 Case Study", "4.1 Statistical Models and Estimation", "4.2 Estimators and Sampling Distributions", "4.4 Confidence Intervals and Pivotal Quantities", "4.5 The Chi-Squared and t Distributions", "4.6 Likelihood-Based Confidence Intervals", "4.7 Confidence Intervals for Parameters in the Gaussian model", "4.7 Confidence Intervals for Parameters in the Gaussian model (Continued)", "5.1 Introduction to Hypothesis Testing", "5.2 Test of Hypotheses for Parameters in the Gaussian Model", "Relationship Between Hypothesis Testing and Confidence Intervals", "5.3 Likelihood Ratio Test of Hypothesis - One parameter", "6.1 Gaussian Response Models", "6.2 Simple Linear Regression: Maximum Likelihood and Least Squares Estimates", "Confidence Interval for Parameters in the Model", "6.3 Checking Model Assumptions and Residual Plots", "Randomization, Paring, and Experimental Design", "7.1 Likelihood Ratio Test for the Multinomial Model", "7.2 Goodness of Fit Tests", "This learning consists mostly of making sure you understand the concepts and steps that were introduced and used in class to solve examples and then solving problems from the Course Notes on your own.", "R Statistical Software", "R and the RStudio development environment can be downloaded from here.", "All assessments are proctored, in-person, and closed-book exams.", "A 2.5-hour cumulative final examination will be held during the final exam period (April 9 - 25, 2025).", "If you have a question regarding the marking of an assessment, you should first check the posted solutions on LEARN.", "First and last name", "Session number", "Please be specific and explain your rationale for a remark.", "Notice of Recording", "Short-term absence", "COVID-19-related absence", "No limits on number of submissions per term and only available during the formal lecture period", "In particular:", "Please inform us of these at the start of the course.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 31, "course_code": "STAT 241", "course_name": "STAT241 - Statistics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 2, "major_name": "Mathematics (Joint Honours)", "topics": ["RCH 307", "Part I, Talking Probability: The statistical approach to analyzing data begins with a probability model to describe the data generating process; that’s why, to study statistics, one must first learn to speak the language of probability.", "10-11 Some \"standard\" statistical problems: categorical data analysis; two-sample comparisons, confounding factors, randomization, and blocking; simple linear regression.", "Midterms (M) 30 pts @ 15 pts each", "Final (F) (100 - A - M) pts", "Date & Time Location", "Then, his final exam will be worth 100-A-M=100-0-6=94 pts."]}, {"course_id": 0, "course_code": "CS 115", "course_name": "CS115 - Introduction to Computer Science 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Introduction to Computer Science 1 Winter 2025", "Diren Swayze", "An introduction to the fundamentals of computer science through the application of elementary programming patterns in the functional style of programming.", "As we are aware of the varied ways in which this material might be of use in the future, we have included concepts that are beautiful and universal.", "Because of the fundamental nature of the concepts taught in CS 115, the course can serve both students whose primary interest in computers is in their use in their chosen areas of study and students intending to minor in CS.", "Module 01: Introduction Monday January 6", "Module 03: Strings and Symbols Monday January 13", "Module 06: Structural Recursion Monday February 3", "Module 08: Local Evaluation Monday February 24", "Module 09: Higher-Order Functions Monday March 3", "Exams", "You can submit each of those files as many times as you like before the deadline.", "Every time you submit a file, we'll run some basic checks on it to make sure it looks valid, and send you preliminary feedback via email.", "Re-marking", "The forms will be in a Survey on Learn for each assignment for two weeks."]}, {"course_id": 1, "course_code": "CS 135", "course_name": "CS135 - Designing Functional Programs (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Designing Functional Programs Winter 2025", "Monday -", "Monday", "07:00PM - 08:50PM", "08:30AM - 09:20AM", "10:30AM - 11:20AM MC 2034", "Charlie Clarke", "Email: claclark@uwaterloo.ca", "Karen Anderson", "Email: kaanders@uwaterloo.ca", "Email: dbwolff@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "Sara Nayar", "Email: cs135@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "CS135 Problem-solving FAQ", "Assignment Marking Error: Submit a re-mark request, due within one week of release of marks.", "Read Me First", "We hope to guide you through a carefully designed curriculum that introduces you to core concepts in computer science.", "In a typical week, you will move through the following activities:", "You should get a feel for what information is where so you can find it quickly in the future.", "An introduction to the fundamentals of computer science through the application of elementary programming patterns in the functional style of programming.", "Syntax and semantics of a functional programming language.", "Linear and nonlinear data structures.", "Abstraction and encapsulation.", "CS 135 Designing Functional Programs", "CS 135 is for students who would prefer a more conceptual treatment of introductory computer science in a simple language that is educationally effective but not commercially relevant.", "Hardware and Software", "Student labs are equipped with the DrRacket integrated development environment running on networked personal computers.", "References", "How To Design Programs by Felleisen, Findler, Flatt, and Krishnamurthi, MIT Press, 2003.", "Definition of lists, designing functions to process and produce lists, recursive definition of natural numbers, recursive data definitions.", "Non-Linear Structures (6 hours)", "Multi-clausal recursive data definitions, trees, mutually referential data definitions, design methods for complex data, iterative refinement, multiplexing.", "Early development of electronic computers and programming languages.", "History of concepts covered in this course.", "have understanding and experience with the topics in the course outline above", "Drop deadline 25", "Reading Week Starts", "Slides Description", "L01 Values and expressions Prefix notation, exact numbers, Boolean expressions, constants", "L04 Lists List values and expressions, composite data, data definitions", "iClicker pilot", "2024-08-26: CS135 is participating in a pilot comparison of iClicker and Vevox.", "The iClicker subscription should be free.", "iClicker Account", "Racket and DrRacket", "It is also simple and clean enough that we cover computer science content many CS students do not see until later in their CS careers.", "If you submit code written under some other system and it does not work in our currently-supported version of DrRacket, then we consider that code incorrect even if it works for you at home.", "Your work in CS135 will be assessed in a variety of ways.", "Coverage", "Using such off-limits material generally results in a significant loss of marks.", "In general, the basic tests will try to warn you if inappropriate functions and special forms are used.", "Submitting a partially completed solution is a good idea, just in case you don’t get back to it before the due date and to serve as a backup in case your computer breaks or is stolen.", "Email Karen Anderson .", "Email the ISAs and ask them to “mark it for feedback”.", "Testing", "We do several kinds of testing on your submissions:", "Basic tests", "Each time you submit before the due date, we run a set of “basic tests” on your submission.", "It’s amazing how many fatal errors can appear during last-minute tidying up!", "Do not make your last submission immediately before the deadline – it gives you no time to check the Basic Test results and respond, if needed.", "The numeric mark appearing on the basic test marksheet is only for guidance.", "After the submission deadline we run a second set of tests to assess your code, including:", "These post-deadline tests and hand-marking form your mark for the assignment.", "If you procrastinate long enough, this rule can easily cause you to fail the course.", "We won’t rehash the above policies, but we do want to make them concrete for CS135.", "A specific assignment may give exceptions to the above.", "You are welcome to use these tools to help you understand the course material, but you should not:", "cut-and-paste your assignment code into them for debugging assistance.", "Also, these tools will not be available when you write the exam, so you need to understand how to solve these problems yourself in order to pass the course.", "attempting to run malicious code during the submission or marking process."]}, {"course_id": 2, "course_code": "CS 145", "course_name": "CS145 - Designing Functional Programs (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Designing Functional Programs (Advanced Level)", "10:00AM - 11:20AM MC 2017", "Monday -", "Monday", "07:00PM - 08:50PM", "Email: troy.vasiga@uwaterloo.ca", "Office Hours: Tues and Thur 1:00-2:00pm in MC 6212,", "Email: kaanders@uwaterloo.ca", "Email: cs145@uwaterloo.ca", "Fri 2:30-3:30pm in MC 4065,", "Email: cs145@uwaterloo.ca", "This course introduces students to key concepts in the field of Computer Science, prepares students to complete the CS portion of their Math core requirements and, if desired, continue on to second-year core courses in CS, provides top students with appropriate challenges and enrichment, and explores topics in greater depth than is possible in CS 135.", "Audience", "Demonstrate above-average communication skills (listening, reading, writing) due to the lack of textbook support for much of the enrichment material", "Given a clear and concise statement of a problem or task, write a program from scratch of up to a hundred lines of properly-formatted and documented code in a functional programming language to solve the problem or complete the task", "Use elementary data structures, such as lists and trees, in programs", "Use higher-order functions to improve readability and efficiency of programs", "Analyze the worst-case running time of programs and describe examples of data that demonstrate that the analysis cannot be improved", "Demonstrate their understanding of the implementation of functional programming language features by coding small interpreters for Scheme-like languages", "An introduction to functional programming", "Function application and definition", "Substitution model", "Types in Scheme", "Structures", "Recursion on lists and integers", "Unary representation of integers", "Proving properties of programs", "Algorithm analysis", "Functions as values", "Anonymous functions", "Higher-order functions", "Local definitions", "Simplifying the language", "Binary representation of integers", "Immutable abstract data types", "Association lists", "Leaf-labelled and node-labelled trees", "S-expressions", "Interpreters", "Limits to computation", "Efficiency", "Purely-functional data structures", "Priority Queue ADT and Braun heaps", "Efficient maps: treaps, red-black trees, AA trees", "They will not be due each week on the same day, as is common in the other first-year CS courses and the first-year Math courses.", "Assignment questions are the main way to reinforce and deepen your understanding of the concepts and skills discussed in lecture.", "You will submit program files electronically to the Marmoset system, which runs tests on your code and informs you of the results fairly rapidly.", "You can still get a great mark in the course.", "Questions and concerns can be sent to instructor or ISA emails.", "When asking questions, first check in case the question has already been answered using the search bar above the feed/list of posts.", "Walk-in consulting hours may still be available if course staff are able to book a sufficiently-large room to follow distancing guidelines."]}, {"course_id": 3, "course_code": "CS 114", "course_name": "CS114 - Principles of Computing for Science (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Principles of Computing for Science Winter 2025", "08:30AM - 09:50AM MC 4059", "Monday -", "Monday", "07:00PM - 08:50PM", "10:30AM - 11:20AM MC 4063", "Coordinator", "Student who make use of office hours usually get better grades; use them!", "Introduction to basic imperative programming principles; programming concepts including functions, flow control, lists, arrays; numerical accuracy and efficiency; data analysis and general-purpose algorithms.", "Introduction to object-oriented programming concepts.", "Describe the basic memory model for mutation of basic types, lists, and objects in Python.", "Identify situations where recursion is an appropriate tool, and use it.", "6 Feb 6-11 M4: Strings and Lists", "7 Feb 13-25 M5: Sorting and Dictionaries", "If both exams are held in person", "If in-person exams cannot be held then they will be held online (if possible).", "Students have the option of self-declaring a short-term absence, as described here: https://uwaterloo.ca/registrar/current-students/undergraduate-student-short-term-absences", "Students should check their basic tests email to ensure that the code meets the specification exactly.", "If ill, please complete a complete a Verification of Illness Form and contact the course coordinator to discuss alternate arrangements.", "Generative AI: This course includes the independent development and practice of specific skills, such as writing and reading code, tracing, and algorithm design.", "Library for research-based assignments"]}, {"course_id": 4, "course_code": "CS 116", "course_name": "CS116 - Introduction to Computer Science 2 (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Introduction to Computer Science 2 Winter 2025", "Monday -", "Monday", "07:00PM - 08:50PM", "E. Dupont", "E. Dupont", "E. Dupont", "10:00AM - 11:20AM MC 4045", "02:30PM - 03:20PM", "08:30AM - 09:20AM", "09:30AM - 10:20AM MC 4042", "10:30AM - 11:20AM MC 4060", "11:30AM - 12:20PM MC 4060", "02:30PM - 03:20PM", "This course builds on the techniques and patterns learned in CS115 while making the transition to use of an imperative language.", "Use higher-order functions to improve the readability and efficiency of programs", "Describe the basic memory model for mutation of basic types, lists, and objects in Python", "Distinguish between constant, linear, quadratic, and exponential running times of algorithms", "Write useful Python programs using console and file input and output for practical tasks", "All times are given in Eastern Time.", "Important!", "In order to maintain a level of success in the course, students should not miss the completion of any modules.", "Students should check their basic tests email to ensure that the code meets the specification exactly.", "Please make sure you do this often!", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 5, "course_code": "CS 136", "course_name": "CS136 - Elementary Algorithm Design and Data Abstraction (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Elementary Algorithm Design and Data Abstraction Winter 2025", "08:30AM - 09:50AM MC 2017", "10:00AM - 11:20AM MC 2038", "10:00AM - 11:20AM MC 4059", "11:30AM -", "Monday -", "Monday", "07:00PM - 08:50PM", "This course builds on the techniques and patterns learned in CS135 while making the transition to use an imperative language.", "Topics discussed include iterative and recursive sorting algorithms; lists, stacks, queues, trees, and their application; abstract data types and their implementations.", "produce well-designed, properly formatted, documented and tested programs of a moderate size (200 lines) that can use basic I/O", "explain and demonstrate the use of the C memory model, including the explicit allocation and deallocation of memory", "explain and demonstrate the principles of modularization and abstraction", "implement, use and compare elementary data structures (structures, arrays, lists and trees) and abstract data type collections (stacks, queues, sequences, sets, dictionaries)", "If both exams are held in person", "If both exams must be held online", "If in-person exams cannot be held then they will be held online (if possible).", "You may also ask on the discussion forums in a private message.", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 6, "course_code": "CS 146", "course_name": "CS146 - Elementary Algorithm Design and Data Abstraction (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Elementary Algorithm Design and Data Abstraction (Advanced Level)", "Monday -", "Monday", "07:00PM - 08:50PM", "02:30PM - 03:20PM", "Brad In-person MC 6427", "On-line Consulting Hours: Microsoft Teams", "CS 146: Elementary Algorithm Design and Data Abstraction (advanced version)", "To familiarize students with key concepts in introductory computer science from an imperative perspective and to contrast this with the functional perspective taken in CS 145;", "To allow students to complete the CS portion of their Math core requirements and, if desired, to continue on to second-year core courses in CS;", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "Introduction to C and elementary mutation in Scheme", "The memory model.", "Variable declaration, assignment and infix expressions in C. Basic I/O in C. Compilation.", "Algorithm analysis in C. File I/O in C and Scheme.", "Program organization and testing methods.", "Space analysis in C and Scheme.", "Mutable lists, queues, deques, and trees in C. Time-space tradeoffs among mutable and immutable ADT implementations.", "Low-level abstractions", "Pointer arithmetic in C. Arrays in C and vectors in Scheme.", "Strings in C. Elementary hashing.", "Libraries in C and Scheme.", "Implementing high-level abstractions", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "The provided slides are not a substitute for attendance in any first-year CS course, but in CS 146, there are no slides, and the lecture summaries made available after lecture are an even worse substitute for attendance.", "Lectures will involve the development of ideas summarized very tersely in the handouts, as well as on-the-fly development of code, analyses, and proofs.", "CS145 and CS146 were originally designed as a year-long unit of curriculum, but eventually the individual courses drifted in their own directions.", "1.1 A note on logistics", "1.2 Review of forms of recursion and associated proof techniques", "1.3 In preparation for side effects", "1.4 Output", "1.5 Input", "1.6 First Introduction to C", "1.8 Memoization", "1.9 Mutation in C", "1.11 Boxes in C", "1.12 Advanced mutation", "1.13 Aliasing in C", "1.14 Memory and vectors", "1.15 Vectors in Racket", "1.16 Arrays in C", "1.18 ADTs in C; Amortized Analysis", "2 SIMPL: a simple imperative language", "2.1 Syntax and informal semantics", "2.2 Examples in several languages", "2.3 Formal semantics", "2.5 Proving imperative programs correct", "A primitive imperative language", "3.1 A primitive imperative language", "3.2 The PRIMPL simulator", "3.4 The SIMPL to A-PRIMPL compiler", "3.6 Strings in C", "3.7 Adding functions to SIMPL", "3.8 Adding both arrays and functions to SIMPL", "3.9 Implementing lists in PRIMPL", "4 MMIX: a realistic instruction set", "4.1 A more realistic processor", "4.2 The MMIX architecture", "4.2.1 Branches and Jumps", "4.2.2 Example", "4.2.3 Software Interrupts", "4.2.5 A Problem with Branches and Jumps", "4.4 Towards a SIMPL to MMIX compiler", "5.1 Storing primitive values", "5.3 Managing memory", "5.4 Structural and pointer equality", "5.5 Function application in a Racket interpreter", "5.7 Justifying the cost of Racket primitives", "5.8 Moving towards implementation in an imperative language", "6.2 Zippers", "6.3 A continuation-passing interpreter", "6.6.2 Mark-and-sweep", "6.6.3 Copying garbage collection", "6.7 Heterogeneous Data in C", "6.8 Multidimensional Arrays in C", "6.10 Variable-length Argument Lists", "7.1 Continuation-passing style", "7.2 Exception handling", "7.3 Undelimited continuations", "7.4 Delimited continuations", "7.5 Racket’s implementation of continuations", "In CS 146, we will examine the imperative paradigm, and compare and contrast the way that efficient algorithms and data structures are designed in imperative and functional languages.", "Racket is a laboratory for current research on aspects of functional programming languages, and we will continue to look at interesting topics in this area, perhaps at the cost of some coherency in the flow of material.", "They will not be due each week on the same day, as is common in the other first-year CS courses and the first-year Math courses.", "Assignment questions are the main way to reinforce and deepen your understanding of the concepts and skills discussed in lecture.", "You will submit program files electronically to the Marmoset system , which runs tests on your code and informs you of the results fairly rapidly.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "(Please also note that we may use the trends in a student's submission history to estimate the likelihood of other forms of cheating as well.)", "Library for research-based assignments"]}, {"course_id": 7, "course_code": "MATH 106", "course_name": "MATH106 - Applied Linear Algebra 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Applied Linear Algebra 1 Winter 2025", "Systems of linear equations.", "Introduction to vector spaces.", "We will see how to solve systems of linear equations using matrix methods before studying matrices as algebraic objects in their own right.", "Next, we will learn about the fundamental concepts of span, linear independence, and basis and learn how to determine whether a set is a subspace of Rn.", "After studying subspaces, we will study linear mappings, which map subspaces to subspaces.", "We will discuss the geometric interpretation of these mappings and study their fundamental subspaces.", "Finally, we will learn how to calculate the determinant of a matrix and use this knowledge to diagonalize square matrices.", "Provide a graphical and algebraic description of vectors, lines, and planes in R^n", "Model and solve mathematical and discipline-specific problems using systems of linear equations", "Perform basic algebraic operations on matrices", "Given a set of vectors in R^n, determine whether it is linearly independent, a spanning set of R^n, or a basis of R^n", "Given a basis and a vector in standard coordinates, use matrix methods to calculate its coordinate vectors", "Given a set in R^n, determine whether it is a subspace of R^n", "Given a mapping L: R^n --> R^m, determine whether it is linear", "Given a linear mapping, choose the appropriate algorithm find a basis for each of its fundamental subspaces", "Given a square matrix, calculate its determinant and provide a geometric interpretation of this value", "Communicate ideas and concepts relating to linear algebra using accurate mathematical language and notation", "Calculators", "Avoiding Academic Offences", "I am committed to creating a learning environment where diverse perspectives are recognized and valued as a source of strength.", "School-Life Conflict"]}, {"course_id": 8, "course_code": "MATH 114", "course_name": "MATH114 - Linear Algebra for Science (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Notice of Recording", "Linear Algebra for Science Winter 2025", "09:30AM - 10:20AM MC 4041", "Vectors in 2- and 3-space and their geometry.", "Linear equations, matrices, and determinants.", "Introduction to vector spaces.", "Eigenvalues and diagonalization.", "Provide a graphical and algebraic description of vectors, lines, and planes in Rn", "Model and solve mathematical and discipline-specific problems using systems of linear equations", "Perform basic algebraic operations on matrices", "Given a set of vectors in Rn, determine whether it is linearly independent, a spanning set of Rn, or a basis of Rn", "Given a basis and a vector in standard coordinates, use matrix methods to calculate its coordinate vectors", "Given a set in Rn, determine whether it is a subspace of Rn", "Given a mapping L: Rn --> Rm, determine whether it is linear", "Given a linear mapping, choose the appropriate algorithm find a basis for each of its fundamental subspaces", "Given a square matrix, calculate its determinant and provide a geometric interpretation of this value", "Perform arithmetics with complex numbers", "Use properties of modulus and conjugate of a number to perform arithmetics with complex numbers", "Calculate the product of complex numbers using the polar form", "Use quadratic formula to solve quadratic equations with complex roots", "Communicate ideas and concepts relating to linear algebra using accurate mathematical language and notation", "Unit 1: Vectors in Rn", "Jan 13 - 17 Unit 2: Systems of Linear Equations Möbius Quiz 1 In-person, during", "Mar 3 - 7 Unit 6: Linear Mappings Möbius Quiz 6 In-person, during", "Notice of Recording"]}, {"course_id": 9, "course_code": "MATH 115", "course_name": "MATH115 - Linear Algebra for Engineering (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Linear Algebra for Engineering Fall 2024", "02:30PM - 03:20PM", "RCH 301", "RCH 301", "10:30AM - 11:20AM E7 5353", "02:30PM - 03:20PM", "E. Dupont", "03:30PM - 04:20PM E7 5343", "10:30AM - 12:20PM RCH 301", "10:30AM - 12:20PM", "PHY 313", "E. Dupont", "08:30AM - 09:20AM", "08:30AM - 10:20AM PHY 313", "08:30AM - 10:20AM RCH 309", "10:30AM - 11:20AM RCH 103", "11:30AM - 12:20PM RCH 103", "RCH 204", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "08:30AM - 10:20AM EV3 4412", "08:30AM - 10:20AM MC 4058", "02:30PM - 03:20PM", "09:30AM - 10:20AM RCH 302", "F. Al-Faisal", "10:30AM - 12:20PM MC 4063", "10:30AM - 12:20PM MC 4060", "10:30AM - 11:20AM RCH 110", "F. Al-Faisal", "03:30PM - 04:20PM", "02:30PM - 04:20PM MC 4060", "DWE 3522", "Tuesday -", "07:00PM - 08:50PM", "Linear equations, matrices, and determinants.", "Introduction to vector spaces.", "Eigenvalues and diagonalization.", "Present solutions to problems in a clear and logical manner with all steps being fully justified.", "Understand the basic operations of addition and scalar multiplication as they apply to vectors, matrices and linear transformations.", "Find the solution to a system of linear equations using matrices and elementary row operations.", "Understand matrix algebra and its connection to systems of equations.", "Have both a geometric and an algebraic understanding of span, linear independence, bases and subspaces.", "Recognize the link between matrices and linear transformations, and understand that many common geometric operations such as projections, reflections and rotations are linear transformations.", "Develop a basic algebraic and geometric understanding of complex numbers and complex polynomials.", "Determine the eigenvalues and eigenvectors of a matrix and diagonalize a matrix.", "1.1 Vectors in Rn", "1.2 Linear Combinations", "1.3 The Norm and the Dot Product", "1.4 Vector Equations of Lines and Planes", "1.5 The Cross Product in R3", "1.6 The Scalar Equation of Planes in R3", "1.7 Projections", "Chapter 2 Systems of Linear Equations", "2.1 Introduction and Terminology", "2.2 Solving Systems of Linear Equations", "2.3 Rank", "2.4 Homogeneous Systems of Linear Equations", "3.1 Matrix Algebra", "3.2 The Matrix-Vector Product", "3.3 The Matrix Equation Ax=b", "3.4 Matrix Multiplication", "3.5 Matrix Inverses", "4.1 Spanning Sets", "4.2 Geometry of Spanning Sets", "4.3 Linear Dependence and Linear Independence", "4.4 Subspaces of Rn", "4.5 Bases and Dimension", "4.6 Fundamental Subspaces of a Matrix", "Chapter 5 Linear Transformations", "5.1 Matrix Transformations and Linear Transformations", "5.2 Examples of Linear Transformations", "5.3 Operations on Linear Transformations", "5.4 Inverses of Linear Transformations", "5.5 The Kernel and the Range", "Chapter 6 Determinants", "6.1 Determinants and Invertibility", "6.2 Elementary Row and Column Operations", "6.3 Properties of Determinants", "7.1 Basic Operations", "7.2 Conjugate and Modulus", "7.3 Polar Form", "7.4 Complex Polynomials", "7.5 Complex nth Roots", "Chapter 8 Eigenvalues and Eigenvectors", "8.1 Introduction", "8.2 Computing Eigenvalues and Eigenvectors", "8.3 Eigenspaces", "8.4 Diagonalization", "8.5 Powers of Matrices", "Linear Algebra for Engineering Fall 2024 Course Notes Required text provided on LEARN Yes", "Linear Algebra with Applications by Keith Nicholson Optional text provided on LEARN No", "The Linear Algebra for Engineering Fall 2024 Course Notes is the required text for this course, and is available on LEARN.", "The text Linear Algebra with Applications is an optional text also available on LEARN for those students looking for an alternate exposition of the material and/or additional problems to work on.", "Students looking for extra practice beyond the course notes are welcome to attempt problems in the corresponding sections of the optional textbook.", "Python Assignments: Throughout the term, there will be 5 equally weighted assignments where students will use python to execute some prewritten code in an effort to explore some larger-scale applications of linear algebra.", "If you find yourself in a situation where you are missing multiple assessments, then you are advised to contact both your instructor and the First Year Engineering Office to make sure you have the proper supports in place to succeed in this courses.", "To be clear - such websites are not allowed to be used for the completion of any part of the course MATH 115, and students are not permitted to share questions from the course anywhere.", "Generative AI: This course includes the independent development and practice of specific skills, such as computations, problem solving and proof writing.", "Library for research-based assignments"]}, {"course_id": 10, "course_code": "MATH 116", "course_name": "MATH116 - Calculus 1 for Engineering (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["03:30PM - 04:20PM", "RCH 301", "RCH 301", "08:30AM - 09:20AM", "03:30PM - 04:20PM", "Monday, Friday -", "11:30AM - 12:20PM", "02:30PM - 03:20PM", "09:30AM - 10:20AM RCH 103", "11:30AM - 12:20PM RCH 103", "11:30AM - 12:20PM STC 0060", "02:30PM - 03:20PM", "02:30PM - 03:20PM", "10:30AM - 11:20AM RCH 101", "09:30AM - 10:20AM RCH 110", "03:30PM - 04:20PM", "07:00PM - 08:50PM", "RCH 204", "DWE 3516", "PHY 313", "02:30PM - 04:20PM DWE 3518", "08:30AM - 10:20AM RCH 204", "08:30AM - 10:20AM MC 4063", "08:30AM - 10:20AM MC 4060", "08:30AM - 10:20AM MC 4058", "02:30PM - 04:20PM MC 4060", "DWE 1515", "DWE 3522A", "Applications of the integral.", "Use trigonometric, exponential, and logarithmic functions to solve a variety of problems.", "Use differentiation to solve a variety of application problems including curve sketching, related rates, and optimization problems.", "Introduction and Review of Functions (Domain, Range, etc.)", "Compositions of Functions", "Inverses of Functions", "Odd and Even Functions, Transformations", "Piecewise and Heaviside Function", "Trigonometric and \"Inverse\" Trigonometric Functions", "Exponential and Logarithmic Functions", "Hyperbolic Trig Functions", "Limits", "Continuity", "§ 2.1-2.4", "Differentiation", "Implicit and Logarithmic Differentiation", "Curve Sketching Techniques", "Optimization Problems", "§ 4.2-4.8", "Linear Approximation, Differentials", "The Definite Integral", "Indefinite Integrals", "Integration by Substitution", "Integration by Parts", "In particular:"]}, {"course_id": 11, "course_code": "MATH 117", "course_name": "MATH117 - Calculus 1 for Engineering (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Notice of Recording", "Monday, Friday -", "11:30AM - 12:20PM E7 5353", "S. D'Alessio", "Friday -", "Friday", "04:30PM - 05:20PM E7 4053", "03:30PM - 04:20PM E7 5353", "Friday -", "Friday", "04:30PM - 05:20PM", "03:30PM - 04:20PM E7 5343", "02:30PM - 03:20PM", "08:30AM - 09:20AM", "S. D'Alessio", "09:30AM - 10:20AM STC 0060", "S. D'Alessio", "03:30PM - 04:20PM", "02:30PM - 04:20PM QNC 1506", "DWE 3522A", "DWE 3517", "08:30AM - 10:20AM DWE 1515", "08:30AM - 10:20AM DWE 3522A", "08:30AM - 10:20AM QNC 1506", "10:30AM - 12:20PM DWE 3522A", "10:30AM - 12:20PM MC 4058", "10:30AM -", "Functions of engineering importance; review of polynomial, exponential, and logarithmic functions; trigonometric functions and identities.", "Inverse functions (logarithmic and trigonometric).", "Limits and continuity.", "Applications of the derivative, max-min problems, Mean Value Theorem.", "Demonstrate skill in manipulating functions and performing calculations such as partial fraction decompositions and expressing piecewise defined functions in terms of Heaviside functions", "Read and use mathematical definitions", "Demonstrate skill in evaluation of limits, derivatives and integrals", "Use integration to calculate areas between and lengths of curves, find average values of functions, and calculating volumes of solids of revolution", "Sketch curves described in polar coordinates", "Use limits and derivatives to sketch graphs of functions or solve optimization problems", "Use integration to calculate areas enclosed by segments of curves in polar coordinates, and lengths of such curve segments", "Conic Sections", "Composition of Functions, Inverses and Symmetry", "Piecewise-Defined and Heaviside Functions", "Inequalities", "Partial Fractions", "Trigonometric, Hyperbolic and Inverse Trig Functions", "Sequences", "Limits and Proving Limits", "Continuity", "IVT/EVT", "Differentiation Rules, Implicit / Logarithmic Differentiation, Derivatives on Inverse Functions", "MVT, Constant/Increasing/Decreasing Functions", "Week 7: October 14 - 18 No classes and no tutorials   Thanksgiving & Reading Week", "Local/Global Extreme & Optimization Problems", "Curve Sketching", "The Definite Integral", "FTC1 & FTC2", "Indefinite Integrals", "Method of Substitution", "Integration by Parts (IBP)", "Areas between Curves, Average Values", "Trig Substitutions", "Integration of Rational Functions", "Arc Length, Surface Area and Volume of Revolution", "Improper Integrals", "Polar Coordinates, Areas and Arc Length in Polar Coordinates", "If working in a group, each group member must write and submit their own solutions in their own words.", "Exams", "Notice of Recording"]}, {"course_id": 12, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 13, "course_code": "MATH 118", "course_name": "MATH118 - Calculus 2 for Engineering (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["10:30AM - 11:20AM RCH 110", "02:30PM - 03:20PM", "RCH 306", "09:30AM - 10:20AM RCH 105", "RCH 306", "10:30AM - 11:20AM RCH 103", "RCH 204", "02:30PM - 03:20PM", "02:30PM - 04:20PM MC 4060", "Monday -", "Monday", "Linear and separable first order differential equations, applications.", "Parametric curves and polar coordinates, arc length and area.", "Get experience in writing well-organized and readable mathematical solutions, so that you will be able to communicate mathematical or technical ideas.", "Select an appropriate integration technique and apply it to solve indefinite or definite integrals.", "Find a power series representation of a function and find a closed form for a function represented by a power series.", "Understand the formal definition of the limit of a sequence and use it to prove basic limits.", "Understand the principle of mathematical induction and use it to prove some mathematical statements.", "Integration by substitution (review)", "Integration by parts (review)", "Trigonometric integrals", "Trigonometric substitution and completing the square", "Partial fractions", "Numerical integration", "Error bounds for numerical integration", "Improper integrals", "First make up lecture occurs", "Separable DEs, linear first-order DEs", "Applications of DEs", "Sequences, limits of sequences", "Recursively-defined sequences, mathematical induction", "Appendix A", "Integral test, p-series", "Comparison tests", "Second make up lecture occurs", "-", "Winter reading week", "-", "Absolute vs. conditional convergence", "Ratio and root tests", "Estimating sums", "Power series", "Taylor and Maclaurin series", "Sums of power series", "Applications of series", "Parametric equations", "Polar coordinates, polar curves", "Area and arc length of polar curves", "In particular:"]}, {"course_id": 14, "course_code": "MATH 119", "course_name": "MATH119 - Calculus 2 for Engineering (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Notice of Recording", "02:30PM - 03:20PM", "S. D'Alessio", "03:30PM - 04:20PM E7 5343", "09:30AM - 10:20AM STC 0040", "S. D'Alessio", "11:30AM - 12:20PM RCH 302", "08:30AM - 09:20AM", "S. D'Alessio", "04:30PM - 05:20PM", "Tuesday -", "08:30AM - 10:20AM DWE 1515", "08:30AM - 10:20AM QNC 1506", "08:30AM - 10:20AM DWE 3522A", "02:30PM - 04:20PM MC 4060", "02:30PM - 04:20PM QNC 1506", "02:30PM - 04:20PM QNC 1506", "02:30PM - 04:20PM QNC 1506", "Functions of several variables: partial derivatives, linear approximation and differential, gradient and directional derivative, optimization and Lagrange multipliers.", "Vector-valued functions: parametric representation of curves, tangent and normal vectors, line integrals and applications.", "Calculate derivatives of multivariate functions (including use of the general chain rule)", "Find maxima and minima of functions of two variables, with or without constraints", "Calculate integrals of multivariate functions over a variety of domains (the focus will be on two-variable problems)", "Estimate roots of functions using Newton’s Method", "Estimate values of integrals using Taylor Polynomials and Taylor’s Inequality", "Calculate Taylor Series efficiently for a variety of functions", "Test the convergence of infinite series", "Evaluate limits using Taylor Series", "Multivariable Functions, Level Curves,", "Contour Plots, Partial Derivatives", "Linear Approximation and Differentials,", "Parametric Equations,", "Optimization", "in Cartesian Coordinates", "Double Integrals in Polar Coordinates,", "Inequality", "Manipulating Power Series, Applications", "If working in a group, each group member must write and submit their own solutions in their own words.", "Exams", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 15, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 16, "course_code": "STAT 220", "course_name": "STAT220 - Probability (Non-Specialist Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["09:30AM - 10:20AM RCH 205", "Come with well-organized questions to make the best use of your time.", "Tutorial sections are listed above, except for the first week and the reading week.", "Class Discussion Board", "Joint, marginal, and conditional probability mass functions of two or more discrete random variables and functions of random variables are also discussed.", "Define a probability model and determine probabilities of events using counting techniques.", "Define and use probability mass functions/probability density functions and cumulative distribution functions to determine probabilities of events.", "Definitions of Probability; Review of Set Notation; Sample Space;", "Simple and Compound Events.", "2.1 - 2.4", "Addition and multiplication rules for Counting", "Permutations and Combinations", "2.5 - 2.6", "Discrete Random variables; Probability Functions, Cumulative Distribution Functions", "3.1 - 3.2", "Week 6 (Feb 10-14) Functions of a Random Variable; Expectation and its Properties; Variance and Standard Deviation 3.3", "5.1 - 5.4", "Week 9 (Mar 10-14) Expectation and Covariance for Multiple Random Variables; Linear Combinations of Random Variables 5.5 - 5.8", "Multinomial Distribution; Continuous Random Variables; Probability Density Function; Cumulative Distribution Function; Expected Value and Variance for Continuous Random Variables 5.8 - 5.9, 4.1-4.3", "Week 12 (Mar 31-Apr 4) Central Limit Theorem; Normal Approximation to the Binomial Distribution; Normal Approximation to the Poisson Distribution* 7.3, 7.5", "Learning primarily involves understanding the concepts and methods demonstrated in class to solve problems.", "Mathematical Statistics with Applications (Mendenhall, Wackerly, Scheaffer), 7th eddition A copy of the textbook is available for 3-hour loans in the DC library No", "This learning consists mostly of making sure you understand the concepts and steps that were introduced and used in class to solve examples and then solving problems on your own.", "Final Exam will be a 2.5-hour closed-book assessment held during the official exam period from April 9 to 25.", "For both Term Tests and the Final Exam, only non-programmable, non-graphical calculators approved by the Math faculty and marked with a pink-tie or blue-goggle sticker are allowed.", "Intellectual property includes items such as:", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills."]}, {"course_id": 17, "course_code": "STAT 221", "course_name": "STAT221 - Statistics (Non-Specialist Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["STAT 221", "11:30AM - 12:20PM MC 4064", "ilham.akhundov@uwaterloo.ca", "View requirements for STAT 221", "This course provides a systematic approach to empirical problem solving which will enable students to critically assess the protocol and conclusions of an empirical study including the possible sources of error in the study and whether evidence of a causal relationship can be concluded.", "The connection between the attributes of a population and the parameters in the named distributions covered in STAT 230 will be emphasized.", "Numerical and graphical techniques for summarizing data and checking the fit of a statistical model will be discussed.", "The method of maximum likelihood will be used to obtain point and interval estimates for the parameters of interest as well as testing hypotheses.", "The interpretation of confidence intervals and p-values will be emphasized.", "The Chi- squared and t distributions will be introduced and used to construct confidence intervals and tests of hypotheses including likelihood ratio tests.", "Contingency tables and Gaussian response models including the two sample Gaussian and simple linear regression will be used as examples.", "Use numerical and graphical summaries of a data set to describe the characteristics of a variate and to check the fit of a statistical model to the data;", "Use the steps of PPDAC to identify both the objectives and possible sources of error in an empirical study and to critically evaluate the conclusions;", "Identify the connection between attributes of a population and the parameters in the named distributions (Binomial, Poisson, Multinomial, Exponential, Normal).", "Define and use the likelihood function to obtain point estimates of the unknown parameters in a model particularly for the Binomial, Poisson, Multinomial, Exponential and Gaussian (Normal) models.", "Use a pivotal quantity to construct a confidence interval for a parameter in some specific cases, and interpret the confidence interval.", "Use the likelihood function to construct and conduct a test of hypothesis for an unknown parameter in a model.", "Interpret p-values and describe the connection with confidence intervals.", "Define the properties of the Chi-squared and t- distribution.", "Define a Gaussian response model including simple linear regression; determine point and interval estimates and conduct tests of hypotheses for the parameters in a Gaussian model.", "Use a Goodness of Fit test to test the fit of a model, independence in a two-way table and equality of proportions for two or more groups.", "Describe the importance of randomization and pairing in experimental design and be able to recognize whether a study design allows the researcher to conclude cause and effect.", "Instructions can be found on LEARN.", "This learning consists mostly of making sure you understand the concepts and steps that were introduced and used in class to solve examples and then solving problems from the Course Notes on your own.", "The purpose of these assignments is to introduce you to the free statistical software R.", "Only a non-programmable, non-graphical, Math-faculty approved calculator with a pink-tie or blue-goggles sticker will be permitted.", "A 2.5-hour cumulative final examination will be held during the final exam period (April 9 - 25, 2025).", "In the case of illness, you must first provide a completed University of Waterloo Verification of Illness form, please see: https://uwaterloo.ca/math/accommodations/submission", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 18, "course_code": "STAT 321", "course_name": "STAT321 - Regression and Forecasting (Non-Specialist Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Regression and Forecasting (Non-Specialist Level)", "10:00AM - 11:20AM E2 1732", "Modeling the relationship between a response variable and several explanatory variables via regression models.", "Model diagnostics and improvement.", "Identify situations and data for which a linear regression model might be an appropriate method of statistical analysis.", "Develop and fit linear models to datasets using the R programming language.", "Use graphical and numerical analyses to determine whether the fitted model is appropriate with respect to the underlying model assumptions.", "Interpret regression results and draw conclusions in the context of the study, and communicate these conclusions to disparate interest groups.", "Explain the mathematical theory behind the results and output from a regression analysis, including the derivation of the distributions of model parameter estimators.", "Apply linear regression models to time series data to model seasonal and trend components.", "Explain the mathematical theory behind the results and output from a regression analysis, including the derivation of the distributions of model parameter estimators.", "Apply linear regression models to time series data to model seasonal and trend components.", "Apply a first-order auto-regressive (AR(1)) model to stationary data, and interpret the results.", "Introduction/Overview", "Simple linear regression review:", "Graphical and numerical summaries of bivariate data", "The simple linear regression model", "Assumptions of the normal model", "Least squares estimation of β0 and β1", "Least squares estimation of σ2", "Interpretation of parameter estimates", "Distribution of", "Confidence intervals and hypothesis tests for β1", "Multiple linear regression:", "The normal model", "Least squares estimation of β", "The hat matrix", "Least squares estimation of σ2", "Distribution of", "Confidence intervals and hypothesis tests for β", "Confidence intervals for µnew and prediction intervals for Ynew", "Modelling categorical variables", "Inference for model parameters", "Analysis of Variance (ANOVA)", "ANOVA table and the F-test", "Additional sum of squares", "Analysis of Variance (ANOVA) (cont'd)", "Indicator variates and additional sum of squares", "General linear hypothesis", "Model Assumptions", "Addressing model inadequacies", "Distribution of e", "Leverage and influential observations", "Model selection", "Sequential methods of model selection", "Interaction", "Waterloo Faculty Salary case study", "Introduction to Forecasting:", "Introduction to time series", "Autocorrelation function (acf)", "Fitting linear models to time series data", "Stationary processes", "Forecasting with the AR(1) model", "Differencing", "Smoothing methods of forecasting", "Moving average smooth", "EWMA smooth", "Introduction to Regression Modelling, by B. Abraham and J. Ledolter (Brooks/Cole pub.)", "Answers to questions requiring verbal explanations must be in your own words.", "In-person concept quizzes will be replaced with online quizzes", "Instructor INC Policy for STAT 321: In the case of a missed final exam with supporting documentation, an INC grade will only be awarded if both the following conditions are satisfied:"]}]