[{"course_id": 156, "course_code": "BIOL 487", "course_name": "BIOL487 - Computational Neuroscience (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["SYDE 552 / BIOL 487 - Computational Neuroscience Winter 2025", "04:30PM - 05:20PM E7 4417", "04:30PM - 05:20PM E7 4417", "Instructors Email Meeting Times", "TA Email Meeting Times", "Introduction to modelling and analysis of neurophysiological systems.", "Prerequisites: At least 3B Systems Design Engineering OR at least 3B in the Faculty of Science and one of CS (115, 135, 200) and a 200-level STAT course.", "Course Objectives: There are far more topics in computational neuroscience than can be covered in a single course.", "Throughout the course, we will emphasize the relationship between computational models and biological structure.", "Simulate and manipulate a variety of neuron models, from LIF to Hodgkin-Huxley", "Describe the organization of the primate visual system and compare it to convolutional networks", "Describe the organization of the hippocampus and its role in cognition", "Describe the organization of the basal ganglia and compare it to modern reinforcement learning techniques", "It should be noted that the last hour of the Wednesday session is meant to be a Tutorial, which will be run mostly as a free-form discussion about the topics brought up in the course materials", "Introduction", "Neuron Models", "3. Simple Neuron Models", "Synapses", "Perceptrons and Regression", "Intermediate and High-level Visual Processing", "Backpropagation and Convolutional Neural Networks", "Role in Cognition", "Modelling memory", "Modelling spatial navigation", "Role in Cognition", "Models of BG - Functional", "Models of BG - Anatomical", "Ongoing Research Topics", "• Biophysics of Drugs and Disorders (?)", "MIT Press https://www.deeplearningbook.org/", "Late work may be submitted via email for reduced credit."]}, {"course_id": 157, "course_code": "CO 331", "course_name": "CO331 - Coding Theory (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["A first course in error-correcting codes.", "Linear block codes, Hamming-Golay codes, and multiple error-correcting BCH codes are studied.", "The mathematical ingredients for the course include linear algebra, groups, rings, ideals, and finite fields.", "Demonstrate a fundamental understanding of the binary symmetric channel, decoding strategies, and the challenges with designing good codes;", "Construct codes, and devise efficient encoding and decoding algorithms for them as a means of gaining exposure to the applications of linear algebra and abstract algebra;", "Analyze the properties of major families of algebraic codes including linear codes, Hamming codes, Golay codes, cyclic codes, BCH codes, and Reed-Solomon codes.", "An Introduction to Error Correcting Codes with Applications, by S.A. Vanstone and P.C. van Oorschot Available for free download from the UW library.", "The quizzes are each worth 7.5%, and can be taken between 8:00 am and 9:30 pm.", "You can submit solutions to a subset of questions by the assignment due date.", "The subset you submit must be comprised of solutions to full questions (not parts of questions), and need not be a proper subset.", "You may ask for general clariﬁcation about assignment questions.", "If you do collaborate, you must acknowledge your collaborators in the write-up for each problem.", "High workloads because of midterms and assignments in other courses will not qualify as a special circumstance.", "If you have any concerns with the marking of assignment questions, please email your instructor together with a clear and detailed description of your appeal(s).", "Intellectual property includes items such as:", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 158, "course_code": "CO 342", "course_name": "CO342 - Introduction to Graph Theory (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Introduction to Graph Theory Fall 2024", "08:30AM - 09:20AM", "An introduction to some of the key topics in graph theory: connectivity, planarity, and matchings.", "Prove Kuratowski's chatacterization of planar graph", "Efficiently decide whether a given graph is planar", "Efficiently find a maximum matching in a graph", "Prove the Tutte-Berge formula on the size of a maximum matching", "Prove Menger's Theorem on vertex-disjoint paths", "Week 1: Introduction to minors", "Separating and non-separating cycles", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words."]}, {"course_id": 159, "course_code": "CO 351", "course_name": "CO351 - Network Flow Theory (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["In case of (medical or other) emergencies, or private issues, send E-mail to the instructor.", "Network simplex and primal-dual algorithms.", "Applications to problems of transportation, distribution, job assignments, and critical-path planning.", "The course covers mathematical models for optimization problems on networks.", "The max-flow-min-cut theorem has many applications including its implication of the Menger theorem in graph theory.", "Additionally, the course presents several algorithms for solving optimization problems on networks.", "Linear programming and LP duality are central to the design and analysis of some of the algorithms.", "- maximum flows and minimum cuts (max-flow/min-cut theorem, preflow-push algorithm);", "- applications to problems in transportation, distribution, job assignments, and critical-path planning, etc.", "1 Sep. 4-6 Review linear programming and graph theory", "4 Sep. 23-27 Shortest di-paths problem A1", "11 Nov. 18-22 Minimum cost flow A4", "\"Network Flow Algorithms\" (grad-level book) by D.P.Williamson http://www.networkflowalgs.com/ No", "This is a closed-book exam.", "This is a closed-book exam.", "Students are advised to invest in a reliable internet connection and a reliable device (for a fraction of the cost of UW tuition).", "The answer to most common issues as well as how-to videos can be found at"]}, {"course_id": 160, "course_code": "CO 353", "course_name": "CO353 - Computational Discrete Optimization (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "Computational Discrete Optimization Winter 2025", "08:30AM - 09:50AM E2 1732", "Formulations of combinatorial optimization problems, greedy algorithms, dynamic programming, branch-and-bound, cutting plane algorithms, decomposition techniques in integer programming, approximation algorithms.", "A discrete optimization problem, broadly speaking, involves a discrete set of feasible solutions and a real-valued objective function that assigns a value to each solution.", "Discrete optimization problems are of immense practical importance, are solved every day (sometimes each hour or more frequently) by many Fortune 500 companies;  well-known problems in the class include", "This course provides an introduction to the broad field of discrete optimization and covers several classes of commonly used techniques for the design of algorithms, including:", "Dynamic programming,", "We will discuss algorithmic efficiency and introduce the basics of complexity theory.", "For NP-hard problems, we will explore the field of approximation algorithms, which provides efficient methods for computing solutions with guaranteed quality.", "Students will complete two practical projects as part of the course, where they will develop, implement, and test algorithms for specific discrete optimization problems.", "formulate discrete optimization problems;", "identify and apply algorithms that can be used to solve selected discrete optimization problems;", "prove correctness of above algorithms and results related to the structures of discrete optimization problems.", "\"The Design of Approximation Algorithms\" by David Williamson, David Shmoys No", "\"Approximation Algorithms\" by Vijay Vazirani No", "\"The Design of Approximation Algorithm\" by David Williamson, David Shmoys;", "\"Approximation Algorithms\" by Vijay Vazirani.", "Each collaboration and resource used to prepare the submission should be appropriately acknowledged in the submission.", "Projects are to be done in groups of two-three.", "Submissions not following the specified format might be assessed based only on their performance and correctness of their output without providing feedback.", "In case you are not able to participate in some of the assessments please visit this webpage to submit the required information.", "Notice of Recording", "If due to changes in regulations and guidelines, it becomes impossible for us to hold in-person lectures and office hours, the lectures and office hours will be held over Zoom."]}, {"course_id": 162, "course_code": "CO 456", "course_name": "CO456 - Introduction to Game Theory (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Introduction to Game Theory Fall 2024", "A broad introduction to game theory and its applications to the modeling of competition and cooperation in business, economics, and society.", "Classical game theory studies the competitive and cooperative behaviour of rational and self‐interested individuals in strategic environments.", "It speciﬁcally develops beautiful analytic tools to analyze and model situations in which a person’s welfare is a function not only of their own actions, but also those of others.", "This course is meant to be a broad and mathematical introduction to game theory and its appications.", "We will attempt to cover these topics:", "This class is meant to be a broad and mathematical introduction to game theory and its applications.", "Game Theory Basics, Bernhard von Stengel http://www.maths.lse.ac.uk/personal/stengel/lectnotes1-7.pdf No", "An Introduction to Game Theory, Martin J. Osborne https://www.economics.utoronto.ca/osborne/igt/ No", "Mechanism Design and Approximation, Jason D. Hartline http://jasonhartline.com/MDnA/ No", "As the title implies, a basic introduction to various topics in game theory.", "An introduction to game theory and equilibria from a computer science perspective.", "An Introduction to Game Theory, Martin J. Osborne.", "The text contains a section on game theory, and some chapters about matching games.", "Mechanism Design and Approximation, Jason D. Hartline.", "These notes were written for a graduate class, and cover mechanism design from an advanced perspective.", "Your submission must be clear and legible, and in the correct orientation.", "You are expected to work on the assignment problems and submit them well ahead of the deadline, in case of technical difficulty.", "You must write up your own solutions without seeking help from anyone, and list the names of your collaborators in each of the assignment problems involved.", "This is a closed-book exam, no aids are allowed.", "A missed test will be treated the same as a mark of zero.", "This is a closed-book exam, no aids are allowed.", "Re-marking policies", "Note that your solution will be very carefully examined during a re-mark.", "In case of serious illness during the final exam, you may be granted a grade of INC provided that", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as finding Nash equilibria and applying game theory to real life applications.", "Library for research-based assignments"]}, {"course_id": 163, "course_code": "CO 481", "course_name": "CO481 - Introduction to Quantum Information Processing (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Introduction to Quantum Information Processing Winter 2024", "Basics of computational complexity; basics of quantum information; quantum phenomena; quantum circuits and universality; relationship between quantum and classical complexity classes; simple quantum algorithms; quantum Fourier transform; Shor factoring algorithm; Grover search algorithm; physical realization of quantum computation; error-correction and fault-tolerance; quantum key distribution.", "This course aims to give a basic foundation in the field of quantum information processing (often just called \"quantum computing\").", "QIP is a multidisciplinary subject and therefore this course will introduce fundamental concepts in theoretical computer science and physics that will enable students to pursue further study in various aspects of QIP.", "Prerequisites: A solid background in basic linear algebra (e.g. a good performance in MATH 235 or MATH 114) is necessary.", "Explain the logical level functioning of quantum computers.", "Describe and analyze several elementary quantum algorithms.", "Introduction to Quantum Mechanics (6 hrs)", "Bloch sphere.", "Introduction to Computation and Computational Complexity (6 hrs)", "Quantum circuits.", "Basic complexity classes.", "Quantum Algorithms (9 hrs)", "Basic algorithms.", "Implementations of quantum information processors.", "An Introduction to Quantum Computing, by Kaye et al.", "Students may assist each other in working through assignment problems, as"]}, {"course_id": 164, "course_code": "CO 485", "course_name": "CO485 - The Mathematics of Public-Key Cryptography (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["The Mathematics of Public-Key Cryptography Fall 2024", "08:30AM - 09:50AM DWE 3517", "An in-depth study of public-key cryptography.", "Public-key encryption, digital signatures, key establishment, elliptic curve cryptography, post-quantum cryptography.", "An in-depth study of public-key cryptography, including: number-theoretic problems - prime generation, integer factorization, discrete logarithms; public-key encryption; digital signatures; key establishment; elliptic curve cryptography; post-quantum cryptography; and security proofs.", "An in-depth study of public-key cryptography and number-theoretic problems related to the efficient and secure use of public-key cryptographic schemes.", "Algorithmic number theory: Primality testing, integer factorization problem, discrete logarithm problem, elliptic curve discrete logarithm problem.", "Additional topics: Pairing-based cryptography, post-quantum cryptography.", "An Introduction to Mathematical Cryptography (2nd ed.), Hoffstein, Pipher, and Silverman.", "The quizzes are intended to reinforce basic concepts that are, in some sense, \"too easy\" to put in an assignment (e.g., definitions, simple calculations).", "Assignments: Right now I expect a total of 6 assignments in the course.", "Late assignments will be given a grade of 0 and I reserve the right not to grade them.", "Exception: Any student who self-declares a short-term absence overlapping with an assignment due date receives a 48-hour extension on the assignment without penalty, and assignments submitted within this extension period will be graded."]}, {"course_id": 165, "course_code": "CO 487", "course_name": "CO487 - Applied Cryptography (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Instructor: Samuel Jaques", "Email: sejaques@uwaterloo.ca", "Timothy Miller", "Nicolas Swanson", "A broad introduction to modern cryptography, highlighting the tools and techniques used to secure internet and messaging applications.", "It is one of the core technologies for securing the emerging information infrastructure.", "This course is a comprehensive introduction to modern cryptography that is aimed primarily at those interested in applications.", "In the area of public-key cryptography, topics will include an overview of specific systems (Diffie–Hellman, RSA, DSA, etc.) and a few advanced protocols.", "The security of these schemes and the use of public-key techniques for generating digital signatures will be described.", "Linear and differential cryptanalysis of ciphers.", "Define the main information security goals of confidentiality, integrity, authentication, and availability", "Explain the intended security properties of each cryptographic primitive and analyze relationships between security properties", "Explain mathematical techniques underlying standardized cryptographic algorithms", "Identify flaws in uses of cryptographic algorithms", "Determine which cryptographic algorithms can be used and combined to build systems with desired functionality and security", "Understand and contextualize the cryptography and security around them in daily life", "0 1 (Jan 6-8) Introduction", "Symmetric Encryption", "3.6 9 Elliptic Curve Cryptography 4 Yes", "4   Applications", "Understanding Cryptography: From Established Symmetric and Asymmetric Ciphers to Post-Quantum Algorithms, 2nd edition, Springer, 2024 Primary reference.", "A1: January 23", "A4: March 20", "This will be clearly indicated for each such question.", "In that case you are required to work independently.", "These questions will test your ability to identify the important concepts introduced in lectures, and your understanding of them.", "In particular:", "Please inform us of these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 166, "course_code": "CS 467", "course_name": "CS467 - Introduction to Quantum Information Processing (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Introduction to Quantum Information Processing Winter 2024", "Basics of computational complexity; basics of quantum information; quantum phenomena; quantum circuits and universality; relationship between quantum and classical complexity classes; simple quantum algorithms; quantum Fourier transform; Shor factoring algorithm; Grover search algorithm; physical realization of quantum computation; error-correction and fault-tolerance; quantum key distribution.", "This course aims to give a basic foundation in the field of quantum information processing (often just called \"quantum computing\").", "QIP is a multidisciplinary subject and therefore this course will introduce fundamental concepts in theoretical computer science and physics that will enable students to pursue further study in various aspects of QIP.", "Prerequisites: A solid background in basic linear algebra (e.g. a good performance in MATH 235 or MATH 114) is necessary.", "Explain the logical level functioning of quantum computers.", "Describe and analyze several elementary quantum algorithms.", "Introduction to Quantum Mechanics (6 hrs)", "Bloch sphere.", "Introduction to Computation and Computational Complexity (6 hrs)", "Quantum circuits.", "Basic complexity classes.", "Quantum Algorithms (9 hrs)", "Basic algorithms.", "Implementations of quantum information processors.", "An Introduction to Quantum Computing, by Kaye et al.", "Students may assist each other in working through assignment problems, as"]}, {"course_id": 167, "course_code": "MSE 343", "course_name": "MSE343 - Human-Computer Interaction (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Human-Computer Interaction Fall 2024", "10:00AM - 11:20AM QNC 2502", "10:00AM - 11:20AM QNC 2502", "11:30AM - 12:20PM QNC 2502", "This course is designed to provide in-depth exposure to the concepts of human-computer interaction and methods of interactive information system design.", "The course will focus on techniques for building information systems that meet human needs and capabilities by following a system development lifecycle: user requirements analysis, information and interaction design, prototyping and evaluation.", "View requirements for MSE 343", "Explain and justify the benefits and drawbacks of user-centred design", "Describe guidelines and models that can be applied to interface design", "Apply a variety of methods to involve the people who use an application in the design process", "Evaluate the usability of an interface", "Explain and justify the benefits and drawbacks of user-centred design 1 KB c) Demonstrate understanding of engineering fundamentals.", "Describe guidelines and models that can be applied to interface design 1 KB d) Demonstrate understanding of specialized engineering knowledge", "Apply a variety of methods to involve the people who use an application in the design process 4 Des b) Generate and implement solutions to complex open-ended problems", "Evaluate the usability of an interface 4 Des c) Evaluate/test solutions and refine designs to better meet requirements", "Process and Requirements", "Introduction to HCI Chapters 1 & 9", "User-centred design Course Notes", "Gathering Requirements and Task-centred design Chapter 10", "Designing Alternatives + Prototyping", "Interface Types & Graphical screen design Chapter 6", "Evaluate", "Evaluating Interfaces with Users: Qualitative Methods Chapters 13 & 7", "Analytical Evaluation: Heuristic Evaluation & Fitts’ Law Chapter 15", "Social & Emotional Interaction Chapter 4 & 5", "Psychology of everyday things & Cognition Chapter 3 & Notes", "Interaction Design: Beyond human computer interaction, 4th edition.", "You will be working in a team of three to five for all these milestones.", "There will be a set of online and in-person activities taking the place of the lab session in this course.", "You can complete these by simply attending class and participating in the activities; there will be a time limit to submit your materials.", "Up until the date of the final exam, you may submit any submitted material for regrading under the following conditions:", "(Ask them first!)", "Extensions", "No extensions will be given after a submission date.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 168, "course_code": "MSE 446", "course_name": "MSE446 - Introduction to Machine Learning (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Introduction to Machine Learning Winter 2025", "04:00PM - 05:20PM", "Topics covered may include data cleaning and transformation, overfitting and generalization, n-fold cross validation, regression, decision trees, neural networks, rule finding, and clustering.", "View requirements for MSE 446", "Problem Analysis]", "Jan. 6   Introduction", "Mar. 31   Advanced topics", "Apr. 2   Advanced topics", "https://web.stanford.edu/~jurafsky/slp3/ Includes language models No 0", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 170, "course_code": "MTE 544", "course_name": "MTE544 - Autonomous Mobile Robots (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "yue.hu@uwaterloo.ca", "11:30AM - 12:20PM E5 3102", "E3 3178", "yue.hu@uwaterloo.ca", "E3 3178", "yue.hu@uwaterloo.ca", "E3 3178", "yue.hu@uwaterloo.ca", "08:30AM - 11:20AM E3 3178", "yue.hu@uwaterloo.ca", "Location: E5 - 3102", "Fundamentals of autonomous mobile robotics, including both perception and planning for autonomous operation, sensor modelling, vehicle state estimation using Bayes Filters, Kalman Filters, and Particle Filters as well as onboard localization and mapping.", "Topics in planning include vehicle motion modelling and control, as well as graph based and probabilistic motion planning of (Micro Electro Mechanical Systems) MEMS devices.", "This course covers four fundamental topics of Autonomous Mobile Robotics; 1) modeling, 2) sensors and perception, 3) estimation (localization and mapping), 4) planning and navigation.", "Modeling covers kinematic models of various types of wheeled mobile robots.", "Sensors include various types and algorithms (for vision and range sensors).", "Estimation includes Bayesian estimation theory and its application to localization (and/or mapping).", "Topics in Planning include odometry motion models and graph-based and probabilistic motion planning as well as obstacle avoidance (reaction-based) methods.", "Discussions and questions - Piazza", "Sign-up link: https://piazza.com/uwaterloo.ca/fall2024/mte544, Access code: MTE544FALL2024.", "We have a few desktop computers (number subject to change depending on working conditions of the computers) that can be accessed remotely.", "User accounts are given on a per-request basis.", "A booking system will be set up for those choosing to use this solution.", "We have a total of 15 laptops (number subject to change depending on working conditions of laptops) that students can lend on a first-come-first-served basis.", "The lending time must not exceed one week each time.", "Develop kinematic models and controls for autonomous robots.", "Apply motion and measurement models to a variety of vehicles and sensors.", "Apply localization/mapping algorithms for perception within environments.", "Create collision free paths through environments based on maps.", "9/4 Course logistics and introduction", "9/4", "9/11 Kinematic models: 4 wheels, holonomic and omniwheel", "9/18 Introduction to sensors, Inertial sensors, Position Sensors", "9/24 Introduction to odometry, Range sensors (line-fit and RANSAC)", "-", "9/25", "10/1 Vision sensors and basics of image processing", "10/8 Introduction to localization, Discrete motion model", "10/29 Probabilistic Motion Model and Velocity Motion Model", "10/30 Probabilistic Measurement Model and Likelihood Field Model", "11/12 Introduction to planning, graph-based methods, Dijkstra", "11/13 A*, D*, introduction to random methods", "11/20 RRT*, Potential Field", "11/27 Explanation of take-home exam & course summary", "Fr1 Section: Friday 8:30-11:20 AM", "There will be a total of 4 in-person Lab sessions, taking place in E3-3178, in-person attendance is compulsory.", "If you need to switch to a different section, you need to inform the instructor and the TAs for the arrangement with one week notice (accommodations for late notices are allowed on a case-by-case evaluation basis).", "Lab#2 – Control the robot to follow a trajectory using a closed-loop controller.", "Lab#3 – Estimation and mapping: estimate robot motion from sensor data utilizing filters.", "The in-person lab is not meant for implementation but for testing and getting help from the TAs.", "Fail to submit a completed code will result in penalty on the lab report.", "Each member must demonstrate to have equally contributed to the report.", "Submit the report with a final version of your code, and attach a list of modifications made between the first version and the final version.", "About 2 weeks’ time will be given to complete each assignment.", "Notice of Recording", "In case of shutdown of in-person activities, the following arrangements will take place:", "This course includes the independent development and practice of specific skills, such as implementation of theory into practice (e.g. algorithms into code), knowledge of the mathematical models and algorithms, and being able to develop independent solutions for mobile robotics.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 171, "course_code": "MTE 546", "course_name": "MTE546 - Multi-Sensor Data Fusion (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Multi-Sensor Data Fusion Winter 2025", "DWE 2402", "Sensor data and information fusion systems.", "Sensor fusion approaches for estimation and decisions including weighted least squares, extended Kalman Filter, Dempster-Shafer evidential reasoning, artificial neural networks; Outlier rejection; Spatial and temporal registration.", "Course project involving independent study of one aspect of sensor data fusion.", "Discriminate between data, feature and decision fusion", "Use probability theory for uncertainty modeling, and decision fusion", "Classification and classifier fusion", "Evaluate the performance of decision making in discrete decision space (classification)", "Use Regression techniques to build model for sensors", "Perform model evaluation and model selection", "Detect and reject outliers using thresholding and clustering", "Implement weighted sum fusion", "Fuse measurement models and noisy data in Kalman filter framework", "Use Extended Kalman filter in fusing sensors and process model", "Use Unscented Kalman Filter in fusing sensors and process model", "Target tracking with Interactive Multiple Model Filters", "Use techniques such as OWA for decision fusion", "Use Fuzzy set theory and Fuzzy inference systems to fuse measurements and/or decisions", "Implement and use Artificial Neural Network to fuse multi-sensor/multi-feature data (regression and classification)", "Introduction, Basic definitions, Math review, Discrete decision fusion, Classifiers, Bayesian Classifier", "Tracking with Interactive Multiple Models (IMM), Ordered Weighted Averaging (OWA) fusion and Max-Entropy OWA fusion, Fuzzy set theory", "Fuzzy Logic, Fuzzy Inference system, Fuzzy fusion", "RBF networks,  examples of deep neural nets and their applications"]}, {"course_id": 172, "course_code": "PHYS 467", "course_name": "PHYS467 - Introduction to Quantum Information Processing (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Introduction to Quantum Information Processing Winter 2024", "Basics of computational complexity; basics of quantum information; quantum phenomena; quantum circuits and universality; relationship between quantum and classical complexity classes; simple quantum algorithms; quantum Fourier transform; Shor factoring algorithm; Grover search algorithm; physical realization of quantum computation; error-correction and fault-tolerance; quantum key distribution.", "This course aims to give a basic foundation in the field of quantum information processing (often just called \"quantum computing\").", "QIP is a multidisciplinary subject and therefore this course will introduce fundamental concepts in theoretical computer science and physics that will enable students to pursue further study in various aspects of QIP.", "Prerequisites: A solid background in basic linear algebra (e.g. a good performance in MATH 235 or MATH 114) is necessary.", "Explain the logical level functioning of quantum computers.", "Describe and analyze several elementary quantum algorithms.", "Introduction to Quantum Mechanics (6 hrs)", "Bloch sphere.", "Introduction to Computation and Computational Complexity (6 hrs)", "Quantum circuits.", "Basic complexity classes.", "Quantum Algorithms (9 hrs)", "Basic algorithms.", "Implementations of quantum information processors.", "An Introduction to Quantum Computing, by Kaye et al.", "Students may assist each other in working through assignment problems, as"]}, {"course_id": 174, "course_code": "STAT 440", "course_name": "STAT440 - Computational Inference (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Computational Inference Winter 2025", "PHY 313", "Introduction to and application of computational methods in statistical inference.", "Monte Carlo evaluation of statistical procedures, exploration of the likelihood function through graphical and optimization techniques.", "Topics include expectation-maximization, Bootstrapping, Markov Chain Monte Carlo, and other computationally intensive methods.", "A1 Feb 4th", "A4 Apr 3rd"]}, {"course_id": 175, "course_code": "STAT 441", "course_name": "STAT441 - Statistical Learning - Classification (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["10:00AM - 11:20AM B1 271", "Email: mlysy@uwaterloo.ca", "STAT 841: View requirements for STAT 841", "Describe the basic principles and methods of statistical classification.", "Know when to use each of these methods on a given dataset.", "Evaluate and compare the output of various classifiers.", "An Introduction to Statistical Learning with Applications in R, by James, Witten, Hastie & Tibshirani https://www.statlearning.com", "There will be two closed-book midterms worth 15% each on the following dates:", "There are no make-up midterms in this course.", "Discussion Board", "Please self-enroll at https://piazza.com/uwaterloo.ca/winter2025/stat441841cm763.", "You can generally expect a response from TAs within two business days.", "Software", "Material and assignments will require the use of R and Python programming languages, as well as the technical document writing programs for these languages: R Markdown and Quarto.", "Regrades", "Email", "Emails which do not adhere to this standard will generally be ignored.", "Intellectual property includes items such as:", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 176, "course_code": "STAT 442", "course_name": "STAT442 - Data Visualization (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "Data Visualization Winter 2025", "11:30AM - 12:20PM B1 271", "Discussion Board", "Email", "Response time", "Both human perception and statistical properties inform the methods used to display and visually explore categorical, continuous, time-ordered, map, and high dimensional data.", "Statistical concepts visually presented include variability, densities, quantiles, conditioning, and hypothesis testing.", "Interactive graphics include linking, brushing, motion, and the navigation of high dimensional spaces guided via projection indices.", "Interpret and critique the most commonly used kinds of visualizations today.", "Create a variety of univariate, bivariate, and multivariate graphs using base R and the tidyverse.", "Look up the necessary code to complete additional graphs not covered here.", "Book - Data Science - A First Introduction.", "Book - The Chicago Guide to Multivariate Analysis, Jane E. Miller", "Book - Cool Infographics - Effective Communication with Data Visualization and Design, Randy Krum.", "Industry Paper - Making Data Meaningful, United Nations Economic Commission for Europe.", "Notice of Recording", "No waiving of this penalty will occur for technical issues.", "Details can be found here: https://uwaterloo.ca/math/accommodations", "Phone: 519-884-0000 extension 213", "Lots of people look like they have it together in public and online when they're a mess inside too.", "They got you into university, so they've already done most of the work, but at this point, the most they can really do for you decide if you can get into graduate school before doing industry experience.", "Don't let that be your reason for thinking this is as good as it gets.", "In particular:", "Please inform me of these at the start of the course."]}, {"course_id": 177, "course_code": "STAT 444", "course_name": "STAT444 - Statistical Learning - Advanced Regression (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Statistical Learning - Advanced Regression Spring 2024", "Topics cover a wide selection of advanced methods useful to address the challenges arising from real-world and high-dimensional data; methods include robust regression, nonparametric regression such as smoothing splines, kernels, additive models, tree based methods, boosting and bagging, and penalized linear regression methods such as the ridge regression, lasso, and their variants.", "Students will gain an appreciation of the mathematical and statistical concepts underlying the methods and also computational experience in applying the methods to real data.", "Topics cover a wide selection of advanced methods useful to address the challenges arising from real-world and high-dimensional data; methods include robust regression, nonparametric regression such as smoothing splines, kernels, additive models, tree-based methods, boosting and bagging, and penalized linear regression methods such as the ridge regression, lasso, and their variants.", "Students will gain an appreciation of the mathematical and statistical concepts underlying the methods and also computational experience in applying the methods to real data.", "2 Nonlinear Regression I: Basis functions and Splines 3 – 4", "4 Predictive Modelling I: Error Estimation and Model Assessment 7 – 9", "Generalized Additive Models: An Introduction with R https://www.taylorfrancis.com/books/mono/10.1201/9781315370279/generalized-additive-models-simon-wood No"]}, {"course_id": 179, "course_code": "SYDE 543", "course_name": "SYDE543 - Cognitive Ergonomics (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Piazza will be the main platform for Q&A. In case you need to contact the teaching team, make sure to add SYDE 543 to the beginning of the subject line.", "This course focuses on the role engineering psychology research plays in design of the information displays and devices associated with simple and complex cognitive tasks.", "Remember and comprehend important cognitive ergonomic concepts, theories, and principles", "Analyze human information processing constraints and limitations, and use it to identify cognitive ergonomics issues in systems design", "Apply cognitive ergonomics knowledge to produce improved designs considering human cognitive constraints", "Course Introduction", "Human-computer Communication", "Human Errors", "Senses", "Attention and Learning", "Control", "Empirical Evaluation", "Research Methods in Cognitive Ergonomics", "Decision Making", "Decision making and biases", "Working Memory", "Memory and Training", "Situation Awareness", "March 25,28", "Case study presentation", "Case study presentation", "Foundations for designing user-centered systems: What system designers need to know about people.", "Santa Barbara CA: Aegean Publishing Company No 120", "Alternatively, one of the team members can send the email and cc all the other team members.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "You will be clearly directed whether you are allowed to use these methods for each assignment."]}, {"course_id": 180, "course_code": "SYDE 548", "course_name": "SYDE548 - User Centred Design Methods (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["User Centred Design Methods Winter 2025", "UCD Mentors Pronouns Email Office Extra Help", "This course approaches the design of tasks, tools, products, and systems from a user-centered design perspective.", "Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process.", "Major topics include user research methods for usability and user experience, inspection methods, user testing, applied statistical analysis.", "SYDE 548 (UCD Methods) approaches the design of tasks, tools, products, and systems from a user-centered design perspective.", "Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process.", "Major topics include user research methods for usability and user experience, inspection methods, user testing, and applied statistical analysis.", "SYDE 548 User-Centred Design Methods is a technical elective.", "It builds from earlier SYDE core courses in design (SYDE-BME 161 Introduction to Design, SYDE-BME 162 Human Factors in Design, and SYDE-BME 361 Engineering Design).", "Motivated students willing to become familiar with basic human factors engineering can participate and contribute to course activities.", "Whether you are interested in becoming a UCD specialist, a certified ergonomist, or just want to be a wise designer or consumer, this course will supply you with a range of practical tools (methods).", "Our “In-class” sessions are used as workshops for interactions and hands-on skill development with different UR methods.", "Engineering Graduate Attribute]", "(A) Describe ethical UCD methods used for formal and informal design assessments with human participants.", "(B) Investigate & select appropriate ethical & equitable UCD methods for specific design situations.[2a, 3b, 10b]", "(C) Apply UCD method protocols to instructor-defined design situations.", "(D) Modify UCD method protocols to collect data for a student-defined design project.", "(E) Select and apply appropriate statistical analysis for given UCD data.", "(F) Design ethical UCD test plans for instructor-defined design situations.", "(G) Create User Research Portfolios describing ethical UCD methods, protocols, and lessons learned.", "CEAB Engineering Graduate Attribute", "Knowledge Base for Engineering", "2. Problem Analysis", "Data Analysis Quizzes,", "4. Design", "-", "Impact of Engineering on Society and the Environment", "Ethics & Equity", "Economics & Project Management", "-", "2. Situations of Concern, Design Impacts & Personas Quantifying Usability; Standard UX Questionnaires;", "SUS Scoring (standard and positive versions)", "3. Design Ethnography: UR Safaris & Secondary Research.", "Interviews & Distress Protocols.", "5. Thematic Analysis Methods - Part 1 Thematic Analysis Methods - Part 2", "Formative Design Walkthroughs & Estimating Formative Sample Sizes.", "UR Methods & GenAI Revisited.", "Quantifying the User Experience: Practical statistics for user research.", "An e-copy of the 1st edition can be accessed through UW Library Reserves.", "The User Experience Team of One: A Research and Design Survival Guide. 2nd edition.", "Hanington, B. & Martin, B (2019) Universal Methods of Design (Expanded & Revised): 125 Ways to research complex problems, develop innovative ideas, and design effective solutions.", "An e-copy of the 1st edition can be accessed through UW Library Reserves No", "Design Materials (for workshops, data collection, and analysis).", "The number of students who can access an e-copy at a given time may be limited.", "Since user-centred design and user research skills are valued by industry, it is important that each student submits original work and demonstrates their own value-added UR skills to earn credit for the course.", "Intellectual property includes items such as:"]}, {"course_id": 181, "course_code": "SYDE 552", "course_name": "SYDE552 - Computational Neuroscience (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["SYDE 552 / BIOL 487 - Computational Neuroscience Winter 2025", "04:30PM - 05:20PM E7 4417", "04:30PM - 05:20PM E7 4417", "Instructors Email Meeting Times", "TA Email Meeting Times", "Introduction to modelling and analysis of neurophysiological systems.", "Prerequisites: At least 3B Systems Design Engineering OR at least 3B in the Faculty of Science and one of CS (115, 135, 200) and a 200-level STAT course.", "Course Objectives: There are far more topics in computational neuroscience than can be covered in a single course.", "Throughout the course, we will emphasize the relationship between computational models and biological structure.", "Simulate and manipulate a variety of neuron models, from LIF to Hodgkin-Huxley", "Describe the organization of the primate visual system and compare it to convolutional networks", "Describe the organization of the hippocampus and its role in cognition", "Describe the organization of the basal ganglia and compare it to modern reinforcement learning techniques", "It should be noted that the last hour of the Wednesday session is meant to be a Tutorial, which will be run mostly as a free-form discussion about the topics brought up in the course materials", "Introduction", "Neuron Models", "3. Simple Neuron Models", "Synapses", "Perceptrons and Regression", "Intermediate and High-level Visual Processing", "Backpropagation and Convolutional Neural Networks", "Role in Cognition", "Modelling memory", "Modelling spatial navigation", "Role in Cognition", "Models of BG - Functional", "Models of BG - Anatomical", "Ongoing Research Topics", "• Biophysics of Drugs and Disorders (?)", "MIT Press https://www.deeplearningbook.org/", "Late work may be submitted via email for reduced credit."]}, {"course_id": 182, "course_code": "SYDE 556", "course_name": "SYDE556 - Simulating Neurobiological Systems (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Simulating Neurobiological Systems Fall 2024", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "This course develops and applies a general framework for understanding neural computation in the context of recent advances in theoretical and experimental neuroscience.", "Demonstrate a basic understanding of neural processes, neural mechanisms, theories of neural communication and computation, and theories of neural dynamics.", "Converse at a fundamental level with neuroscientists, psychologists, and neural and cogitive modelers.", "Design and Analyze simple and complex neural circuits for performing small- and large-scale neural computations.", "Apply engineering methods in signal processing, optimization, and control theory, among others, to characterizing and building neural circuits.", "Identify problems and solutions that may exploit the advantages of neural computation in an engineering context.", "Abbreviations", "KB - Knowledge base", "1b: Demonstrate understanding of concepts in natural science", "1c: Demonstrate understanding of engineering fundamentals", "1d: Demonstrate understanding of specialized engineering knowledge", "I - Investigation", "3b: Gather information from relevant sources to address complex engineering problems", "D - Design", "Critically evaluate and compare design choices", "Generate and refine potential solutions to complex, open-ended design problems", "UET - Use of Engineering Tools", "5a Select appropriate engineering tools, considering their limitations", "Sept 25 Chapter 5,6 Feedforward Transformations (I) #2 posted", "5 Sept 30 Chapters 5,6 Feedforward Transformations (II) #1 DUE*", "8 Oct 21 see notes Temporal Basis Functions #2 DUE*", "Neural Engineering: Representation, Computationa and Dynamics in Neurobiological Systems.", "On reserve in Library Yes", "Accommodation for Students with Disabilities", "Intellectual property includes items such as:", "of Waterloo for permission before uploading and sharing the intellectual property of others online(e.g., to an online repository).", "In many cases, instructors might be happy"]}, {"course_id": 183, "course_code": "SYDE 575", "course_name": "SYDE575 - Image Processing (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Image Processing Fall 2024", "10:00AM - 11:20AM EV3 4408", "10:00AM - 11:20AM E5 6008", "Beginning with a discussion of quantitative models of imaging systems, this course moves on to apply methods of linear systems theory and signal processing to image processing.", "Simple spatial domain techniques as well as spatial frequency domain methods, and digital filter design for image enhancement and restoration are discussed.", "Applications to machine vision, remote sensing, and medical imaging will be emphasized.", "Apply basic image processing algorithms and tools to digital imagery (2)", "2. Utilize Matlab effectively for fundamental image processing applications (5)", "Understand mathematics for image processing based on signal processing concepts (1)", "4. Develop a basic understanding of the human visual system and its relationships to digital image processing (1)", "Understand the nature of spatial-frequency domain in the context of digital image processing (2)", "Work in a team to complete applied lab design based solutions to problems and prepare a technical report responding to clear instructions (4, 7)", "7. Demonstrate an enhanced understanding of linear systems with application to image processing (1)", "Graduate Attribute Definition", "Knowledge Base Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "2. Problem Analysis An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "7. Communication Skills An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "10-15 Spatial-frequency filter 2,3,4,5,6,7", "18 Color image processing 4,6", "The grade of each lab will be reduced by 20% for each full/partial day late submission.", "I make a sincere effort to provide a course to benefit students and I hope students make the same effort in return for their own positive experience.", "Prof. Clausi"]}, {"course_id": 185, "course_code": "EARTH 270", "course_name": "EARTH270 - Disasters and Natural Hazards (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "Disasters and Natural Hazards Winter 2025", "The course will introduce the basic principles of Geo-Risk management and its applications in natural hazards engineering, in the development of mitigation strategies and in the re-insurance industry.", "View requirements for EARTH 270", "Explain the geological and/or hydrological systems involved in the most common natural hazard events.", "Describe secondary impacts from the common natural hazards as well as possible mitigation techniques.", "Week 2: Introduction to Disasters and Natural Hazards", "Week 6: Atmospheric Processes and Severe Weather Systems", "This textbook can be a good resource for students continuing in Earth and Environmental Sciences, who are interested in natural hazards and disasters.", "Notice of Recording", "This online course involves viewing, reading, and discussing natural hazard processes and disasters that may directly or indirectly impact humans in a negative way.", "Please note emails can be received 24 hours per day", "Situation where VIFs are not Appropriate", "Learning Support: the Student Success offers a wide range of online and in-person learning supports to help you reach your goals."]}, {"course_id": 186, "course_code": "ENBUS 102", "course_name": "ENBUS102 - Introduction to Environment and Business (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Introduction to Environment and Business Fall 2024", "Come by and introduce yourself :)", "Introduction of ways in which business has and is responding to environmental and business issues; business and sustainable development; issues of corporate/business greening.", "The central objective of this course is to explore the genesis of sustainability through a survey of the history and development of the ever-changing interface between business, society, and the environment.", "2. Understand why firms have sought to look beyond shareholders in how they understand and build value", "3. Discuss the practices firms engage in and how those practices have changed over time", "Sep 24 Linear to Systems Thinking", "Westley, F. What is a system?", "Systems thinking - The new approach for sustainable and profitable businesses.", "Weak versus Strong Sustainability", "Environmental Economics versus Ecological Economics", "UN Sustainable Development", "Oct 1 Evolution of Business Sustainability", "Oct 3 From Shareholders to Stakeholders to Social License", "Network for Business Sustainability", "Oct 8 Regulations and Command and Control", "Li, S. The business case for ESG: Why Companies Adopt Environmental Value Beyond Social Responsibility.", "Thriving at Waterloo Avoiding Plagiarism: Citations and Referencing", "Graber-Stiehl, I. How bogus 'eco-friendly' products trick you.", "Thriving at Waterloo Avoiding Unauthorized Collaboration", "Sustainable Finance", "Weber, O., & Feltmate, B.  Introduction to Sustainable Finance (pp 3-24), In Sustainable Banking and Finance: Managing the Social and Environmental Impact of Financial Institutions.", "Li, S. The business case for ESG: Why Companies Adopt Environmental Value Beyond Social Responsibility.", "The exam will include a combination of multiple-choice and short-answer questions.", "You must specify the sections you want addressed and a rationale for why it deserves consideration, with specific reference to the rubric and assessment criteria.", "Only in exceptional cases will this penalty be waived!", "Intellectual property includes items such as:", "Anti-racism Statement", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 187, "course_code": "ENBUS 211", "course_name": "ENBUS211 - Principles of Marketing for Sustainability Professionals (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["PHY 313", "Zachary Folger-Laronde", "Email: zfolgerlaronde@uwaterloo.ca", "Name Amaryah DeGroot Sabrina Zaman", "Email a9degroot@uwaterloo.ca sabrina.zaman@uwaterloo.ca", "Topics that will be explored include green consumerism; greenwashing, the incorporation of environmental considerations into successful products and services; the role of social marketing, government regulations, and other incentives related to green marketing.", "Understand and explain core marketing concepts and issues, particularly the \"marketing mix\"", "Describe current and past green/sustainable marketing trends", "Explain key strategies for motivating and targeting consumers towards sustainable options", "Apply strategies and tools that can be used to address green/sustainable marketing trends", "Analyze application of course concepts to a specific organization (brand and product line)", "Evaluate marketing strategies (i.e., through case studies and other examples)", "Introduction to ENBUS211, Overview of Sustainable Marketing, Marketing Mix Introduction", "Sustainability-based Strategic Planning", "Sustainability & Ethical Decision-Making", "Discovering Value via Market Analysis", "Communicating Value via Integrated Marketing Programs", "Providing Value via Sustainable Product Strategies", "Providing Value in Sustainable Supply Chains", "Delivering Value in Retailing", "Peer-evaluation – July 30th by 11:55PM", "The posted lecture slides will focus on the key concepts and theories from the required text.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 189, "course_code": "ENVS 105", "course_name": "ENVS105 - Environmental Sustainability and Ethics (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Environmental Sustainability and Ethics Fall 2024", "08:30AM - 09:50AM UTD 105", "Your instructor checks email and the Ask the Instructor discussion topic* frequently and will make every effort to reply to your questions within 24 hours, Monday to Friday.", "Concepts and activities by which stakeholders describe and debate this compatibility will be discussed.", "What is the role of the individual, the public, and private sector actors in steering social systems toward sustainability?", "How should we respond to climate change?", "How do we reconcile planetary boundaries with human development?", "These and other 'wicked questions' will be examined throughout the course with an eye toward improving our facility and confidence in approaching these defining questions in the 21st century.", "Apply ethical decision-making “tools” to environmental problem contexts;", "Identify the reasons and causes of ethical disagreement and collective action problems with respect to environmental issues", "Demonstrate knowledge of the many environmental themes of the Faculty of Environment and an introduction to some of the key challenges facing environmental governance research and action.", "1 September 5th Ethics and Environmentalism in the Anthropocene Environmental Ethics for Canadians: Introduction: Four Normative Theories  Save the Last Word:  Introduce Yourself", "Environmental Ethics for Canadians: Introduction: Four Normative Theories (continued);", "Ethics of Care in Environmental Ethics-Feminist and Indigenous Perspectives;Untenable Origins: The Mystery of Reconciliation in Canada;Confucian Thought and China's Environmental Dilemmas", "Enrol as initiators and responders with your group in the Online Discussion Roles Schedule", "3 Sept. 17th, 19th Consideration and Moral Standing for Humans and Non-Humans All Animals are Equal;Animal Liberation and Environmental Ethics: Bad Marriage, Quick Divorce;The battle for the soul of biodiversity;Kill all the Mosquitos?!", "4 Sept. 24th, 26th Values and Priorities: A Challenge to the 'Management Paradigm' In his own words: Captain Paul Watson;Headaches and Heartaches: The Elephant Management Dilemma;Natural Enemies: An Anatomy of Environmental Conflict Save the Last Word: Discussion 2", "First in-class quiz Sept. 26th", "7 Oct. 22nd, 24th Ecological v. Environmental Economics, Planetary Boundaries and Ecomodernism Cost-Benefit Analysis: An Ethical Critique;A Place for Cost-Benefit Analysis;The Value of the World’s Ecosystem Services and Natural Capital Assignment 2 Due;Save the Last Word: Discussion 3 Reflection Paper Proposal  is due on Thursday October 24th, by 11:59 PM", "8 Oct. 29th, 31st Ecological v. Environmental Economics, Planetary Boundaries and Ecomodernism Can the Supply of Natural Resources Really be Infinite? Yes!;Steady State Economics: A New Paradigm;Dambisa Moyo: 'Economic Growth has Stalled.", "9 Nov. 5th, 7th Ecological v. Environmental Economics, Planetary Boundaries and Ecomodernism Ecosystems and Human Wellbeing: Summary for Decision Makers;Excerpts from Enlightenment Now: ‘The Environment’; A De-growth Response to an Ecomodernist manifesto Save the Last Word: Discussion 4 Third in-class quiz Nov. 7th", "10 Nov. 12th, 14th Politics and the environment: essential tensions Environmental Political Activism; Local Ecocentric Democracy and Fossil Fuel Divestment;Excerpts from Zuboff, S. ‘The Age of Surveillance Capitalism'; A View from Everywhere, All the Time;Advancing Environmental Justice with AI?", "11 Nov. 19th, 21st Politics and the environment: essential tensions An Anthropocene Journey;Radical American Environmentalism and Wilderness Preservation: A Third-World Critique;Ecoterrorism- A Critical Analysis of the Vilification of Radical Environmental Activists as Terrorists;Newspaper article: ‘Troops will be needed to get Transmountain built’ Save the Last Word: Discussion 5 (end of discussion activity)Reflection", "December 6–19 December Examination Period", "When answering a poll, select a multiple-choice answer (a, b, c, etc.).", "You will be expected to complete four in-class multiple-choice quizzes over the course of the term.", "Each quiz will consist of 10 multiple-choice questions.", "Your proposal should clearly state the thesis you wish to defend, and give a general outline of your strategy for defending it.", "Your reflection will be graded both for demonstration of relevant knowledge of content, as well as for the quality of your argument and how well you present and defend your thesis, e.g., 'I will argue that climate change is first and foremost a human development problem'.", "The exam will consist of a mix of multiple choice questions similar to those in the quizzes, plus a list of short answer questions.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 190, "course_code": "ENVS 200", "course_name": "ENVS200 - Field Ecology (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Field Ecology Winter 2025", "**We aim to respond to forum posts and necessary emails within general workday hours (8:30 AM – 4:30 PM) and within 24hrs, except over weekends and holidays.", "Introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "View requirements for ENVS 200", "Such knowledge, called ecoliteracy, will provide a critical basis for your engagement in the 21st century, the “century of the environment”—not least because so many of the environmental issues we face derive in part from a limited understanding of how we are embedded within and dependent upon ecological systems.", "Field ecology necessarily harbours an ethical component both because of our natural affinity for life (or ‘biophilia’) and because questions of ecological ‘impact’ and 'quality’ are necessarily value-laden.", "In summary, this course introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "By the end of this course, you should be on a path to life-long learning as an ecologically-literate citizen.", "Demonstrate how these principles apply to real-world situations (in context of lab activities, assignments, and labs), including human interactions with the natural world.", "Articulate the elements of scientific inquiry as they apply to ecology/", "These course learning outcomes will not only prepare you to be an informed citizen and member of the community of life on earth, but also provide the basis for knowledge, humility, and wisdom in your dealings with ecological problems in your daily life and eventual career.", "Week Number", "Introduction and indicator species: Bird identification Lab 1:  Survey completed and submitted in lab (2%)", "3. Jan 21 *Conditions and Resources; Climate and Biomes", "You should review the course “reading guide” in LEARN before reading because you are not responsible for all textbook sections and vocabulary.", "demonstrate how these principles apply to real-world situations, including human interactions with the natural world Readings, Labs, Discussion board Weekly lecture quizzes and activities, exams, lab activities, discussion forums", "These experiences are intended to help you apply ecological concepts in real-world contexts while building valuable field skills.", "Simply missing a deadline and later mentioning registration with Accessibility Services will not be considered sufficient.", "Appeals and grievance", "Availability for exams", "These slides are meant to be a template for your note-taking: they will not replace careful attention, note-taking and participation.", "Along with the University of Waterloo and the Faculty of Environment and its Departments, I consider your well-being to be extremely important.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "However, there may be instances during lectures where AI usage is allowed after receiving clear verbal permission from the professor.", "Students are responsible for following these guidelines and seeking clarification when needed.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 191, "course_code": "ENVS 205", "course_name": "ENVS205 - Sustainability: The Future We Want (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Your instructor checks email and the Ask the Instructor discussion topic frequently and will make every effort to reply to your questions within 24–48 hours, Monday to Friday.", "The course is designed to get you thinking about and applying key concepts in the course.", "The modules also include applied Examples, that help to demonstrate concepts and Definition boxes, that help clarify words that all students may not be familiar with.", "In addition to these core resources, you'll find lots of Optional Resources in the course.", "Describe the current socio-ecological crisis and summarize key trends.", "Identify the basic goals, principles, and multi-scalar practices of sustainability.", "Classify socio-ecological problems and solutions according to the United Nations’ seventeen Sustainable Development Goals (SDGs), and understand some of the interconnections between these goals.", "Define and detect four of the key values that underlie sustainability: the “good life”; democracy; social justice; and efficiency.", "Situate one’s own well-being in relationship to multi-scalar socio-ecological processes (e.g., the well-being or suffering of other human beings in other places in the world, past, present and future).", "Critically examine an organization and activity on campus, in your workplace or in your community in relation to the SDGs, approaches to sustainability and values underlying sustainability.", "Choose one of the following topics:", "Exam Period", "Do not email the instructor until you have read and completed the following.", "Please be sure to read the rubric before starting your assignment.", "Be sure to includes all of the following information:", "your name and student number;", "**Please note that your mark can be raised, lowered, or remain the same through a re-grade**", "*", "*", "* Please submit your paper for consideration by email to the instructor no later than one week following your receipt of the decision by the TA.", "Include a formal business letter that includes the following information:", "your name and student number;", "Intellectual property includes items such as:", "Note: Cutting and pasting even a partial sentence without proper quotations and referencing IS considered plagiarism.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 192, "course_code": "ENVS 220", "course_name": "ENVS220 - Ecological Economics (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Ecological Economics Winter 2025", "08:30AM - 10:20AM EV3 1408", "The links between economics, systems and the natural environment will be explored and future directions examined.", "View requirements for ENVS 220", "This course provides an engaging introduction to ecological economics, framed through the lens of Doughnut Economics by Kate Raworth.", "Together, we will explore how ecological economics challenges the assumptions of conventional economics and expands its scope to address the pressing challenges of sustainability, equity, and planetary boundaries.", "Using the Doughnut model as a central guide, we will examine the concept of a “safe and just space for humanity” and the interplay between social foundations and ecological ceilings.", "Rethinking Growth: Investigating the limits of economic growth, the role of natural resources, and critiquing growth-centric paradigms.", "Redefining Progress: We will compare conventional measures like GDP with alternative metrics such as ecological footprints, planetary boundaries, and well-being and indices of human to assess their relevance in shaping policy and decision-making.", "Special attention will be given to the intersection of ecological economics with issues like climate justice, social equity, and intergenerational ethics.", "Globalization and Local Action: Understanding the environmental implications of globalization and the role of local communities in driving sustainable change.", "Understand and Differentiate: Explain the foundational principles of ecological economics and how they contrast with conventional economic theories and environmental/resource economics.", "Articulate the core concepts of the Doughnut Economics framework, including social foundations and ecological ceilings.", "Critique growth-centric economic models from ecological, social, and ethical perspectives.", "Apply Analytical Tools: Analyze policy options like taxes, subsidies, quotas, and emissions trading through both economic and ecological lenses, considering their potential impacts on sustainability and equity.", "Use systems-thinking approaches to apply Doughnut Economics principles to real-world challenges in areas such as energy, food systems, or urban planning.", "Discuss the ethical dimensions of economic policies, including intergenerational equity and climate justice.", "Feb 24 Design to distribute R: Ch 5", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 193, "course_code": "ERS 215", "course_name": "ERS215 - Environmental and Sustainability Assessment 1 (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Environmental and Sustainability Assessment 1 Winter 2025", "Instructor: Felicitas Egunyu felicitas.egunyu@uwaterloo.ca", "An introduction to processes and techniques for incorporating environmental considerations in planning and evaluating proposals for future undertakings that may have significant social and biophysical effects.", "The course provides an overview of methodologies for, and controversies surrounding, the design and conduct of biophysical and socioeconomic impact studies, and the testing of reported findings.", "View requirements for ERS 215", "Key topics and themes will be elaborated on through videos and by regular attention to case studies.", "Assigned readings throughout the semester are critical for providing additional depth and breadth.", "Group reading discussion and assignments provide an opportunity for integrating key topics and themes, as well as for linking them with the broader scholarly literature on environmental assessment.", "From this course you will develop a key understanding of what an EA should be and therefore, you can apply this knowledge and understanding to any assessment act.", "Define the aims and objectives of environmental/impact assessments, as well as key terms and concepts in EA/IA", "Identify the roles and relevance of EA/IA as a potential venue that can contribute to sustainability", "Describe the different steps and components of an EA/IA process in Canada", "Apply EA/IA principles for best practices to case studies and critically analyze the strengths and weaknesses of environmental assessment", "Introduction to Environmental Impact Assessment: A Guide to Principles and Practice, 4th Edition.", "Introduction to Environmental Impact Assessment: A Guide to Principles and Practice, 4th Edition.", "Introduction to Environmental Impact Assessment: A Guide to Principles and Practice, 4th Edition.", "(Similar to A and A+ in the previous system)", "(Similar to B+ and A- in the previous system)", "(Similar to B- and B in the previous system)", "(Similar to D-, D and D+ in the previous system)", "(Similar to F and F+ in the previous system)", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 194, "course_code": "ERS 225", "course_name": "ERS225 - Gendering Environmental Politics (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "Gendering Environmental Politics Fall 2023", "04:00PM - 05:20PM", "Email: andrea.collins@uwaterloo.ca", "This course also examines how governance, policy, and politics can be used to create social and environmental change.", "This course also examines how governance, policy, and politics can be used to create social and environmental change.", "Define key concepts related to the analysis of gender, race, and class", "Understand how gender is a critical variable in decision-making processes", "Identify gendered power relations, including within environmental governance and policy", "Analyze environmental issues and politics with attention to gender and other social identities", "Week 1 – Wed. Sept. 6 – INTRODUCTION & CORE CONCEPTS", "Introduction to the course – expectations and assignments", "Core Concepts for Feminist Research", "The Emergence of Ecofeminism and Key Debates", "The Push and Pull of Environmental Politics & Protest", "Gender and Environmental Justice", "Understanding Gender and Patterns of Consumption", "How can we consume differently?", "Energy, Resource Extraction and Gender: Canada and Abroad", "Privilege and Safety in the City: Urban Planning", "Gender and Disaster Risk Planning", "Each week will also begin with a “News Briefing”, which is a chance for anyone to share anything related to gender politics and/or environmental politics over the past week.", "If you attend class but do not actively participate in discussion, you should consider other ways you can stay engaged with the course.", "For this assignment, students will use what they have learned about gender and other forms of social inequality to examine a contemporary issue in environmental politics that they have researched independently throughout the term.", "Final Exam – 30% – Held in-person during the Final Exam Period in December", "Notice of Recording", "Library for research-based assignments", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 195, "course_code": "ERS 253", "course_name": "ERS253 - Communities and Sustainability (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["ERS 253", "10:30AM -", "10:30AM - 11:20AM EV2 2006", "Course TA: Chelsea Nankisore - cnankiso@uwaterloo.ca", "His research focuses on community engagement in ecological restoration and conservation projects.", "He is currently communications manager with Reep Green Solutions, an environmental charity in Kitchener.", "Chelsea has an HBA from the University of Toronto where I double majored in Human & Environmental Geography with a focus in Planning and Urban Geography.", "Chelsea's course work encompasses: globalization and its influence on urbanization, modern urban planning techniques and practices, planning in defining urban landscapes, housing and community development, environmental law, sustainability in complex socio-ecological systems, built environment and health, and lastly, environmental problems and its influence on various communities.", "Chelsea is currently furthering my studies in the social and ecological program as a MES candidate.", "Up-to-date course information", "Everything in this syllabus (especially guest speakers) is tentative and subject to change.", "Exploration of the interconnected roles that communities at various scales", "can play in a transition towards sustainability.", "Examination of structures, options, initiatives, and decision-making processes involving a wide range of concerns, opportunities, and applications.", "It is the knowledge that people have of each other, their concern for each other, their trust in each other, the freedom with which they come and go among themselves.”", "ERS 253 explores communities and sustainability as a useful pairing of ideas and practices.", "This will involve applying a broad and critically advanced approach to community and sustainability (plus a few closely related concepts, including complexity and engagement in governance and decision making, as key factors for attention); and aiming to identify the practical implications, including for particular undertakings that aim to contribute to lasting wellbeing at the community scale.", "There are cultural, occupational, ideological and interest-based communities, among others.", "The course work will include development and application of tools to build an integrated understanding of communities, sustainability and engagement and to expand this understanding in discussions about issues and actions in a variety of particular areas of concern and opportunity (food systems, growth, decline, economic greening, ecosystems, etc.).", "Perhaps most importantly, each participant will integrate the broad insights, specify them for the particular context of a community of her or his choice, and apply the results in the conception and evaluation of a sustainability-enhancing undertaking in that community.", "The latter half is focused on application – we will return to many of the concepts in our readings and apply them to real-world cases with exciting guest speakers.", "How do we know it?", "TransformWR Strategy", "January 23 Frameworks for Change", "Asset-Based Community Development (ABCD) at a glance by Tamarack", "A Primer in", "Community-based", "Fostering collective action through participation in natural resource and environmental management: An integrative and interpretative narrative review using the IAD, NAS and SES frameworks Ortiz-Riomalo et al 2023", "A Ladder of Citizen Participation - Arnstein 1969", "consultation!’’: The colonial antipolitics of Indigenous", "consultation in Jasper", "“Convivial Futures?", "(skim) THE SECOND CONVIVIALIST MANIFESTO: Towards a Post-Neoliberal", "World", "February 27       Institutions and organizations", "University of Waterloo’s Environmental Sustainability Strategy", "March 5 Ecosystems and nature", "A Review of Design Principles for Community-based Natural Resource", "January 23 - Team charter", "March 26 - Final deliverable for the case project (2,000 words max)", "There is no grace period for reflections in tutorial.", "Each entry should be about 300 words and can include material from the previous two weeks.", "If you require the use of a keyboard for accessibility reasons, you may use your computer to type these and email them in during the tutorial time.", "You must include some personal reflection in each journal entry.", "Sustainability initiative deep dive", "This assignment is a critical assessment and investigation of a sustainability initiative.", "***IMPORTANT:", "*", "**", "How is this program trying to shift society towards a sustainable future?", "Is it working?", "Are there financial barriers, other barriers, and is there (or could there be) any attempt to help overcome those barriers?", "Groups will be assigned during the first week of classes.", "This initiative should be targeted towards a real community.", "It should be both environmentally and financially sustainable.", "You should identify barriers and discuss attempts to overcome them.", "Your sustainability initiative should address a specific and well-researched problem grounded in the community you choose.", "Your success metrics should be some kind of real, verifiable change in the world.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 196, "course_code": "ERS 270", "course_name": "ERS270 - Introduction to Sustainable Agroecosystems (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Introduction to Sustainable Agroecosystems Fall 2024", "ERS 270", "08:30AM - 11:20AM RCH 212", "Office Hours Appointment/walk-in", "This course introduces and discusses the fundamental concepts of agroecology, the integration of agriculture and society, and the transition to sustainability.", "Topics include the impact of biotic and abiotic factors - including the use of genetically modified organisms - on crops, soil, and the agroecosystems.", "View requirements for ERS 270", "Pathway to Agroecology", "- Introduction to ERS 270", "- Change in agriculture", "- Agroecology & agroecosystems", "Introduction", "Agricultural Organisms & their Environment", "- Plants", "- Light", "- Climatic Factors", "- The soil ecosystem", "-Biotic factors & organisms  Chapter 7", "Module 3: System-Level Interactions", "- Population ecology of agroecosystems", "- Species interactions in crop communities", "- Successional development & agrofor.", "- Pest, weed & disease management", "- Agriculture & the climate crisis", "- Converting to ecological management", "- Sustainability assessment", "- Economic dynamics of the food system", "Teaching & Learning Methods", "Agroecology", "- PowerPoint slides", "Organisms & their Environment", "System-Level Interactions", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 198, "course_code": "ERS 316", "course_name": "ERS316 - Urban Water and Wastewater Systems: Integrated Planning and Management (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "Urban Water and Wastewater Systems: Integrated Planning and Management Fall 2024", "ERS 316", "Dr. Felicitas Egunyu", "Emily Rorison          Email: erorison@uwaterloo.ca", "Development and maintenance of urban water and wastewater systems, along with demand and supply management planning, efficiency mechanisms, development and equity concerns, will be examined.", "View requirements for ERS 316", "This course is designed for senior students interested in urban environmental issues, with a focus on water services.", "This course extends concepts learned in ERS 265 (Water History), complements ERS 365 (Water Governance), and is a useful foundation for a senior thesis (ERS 411) or interdisciplinary graduate studies on water issues.", "For those students who have a strong interest in the topic, but do not have the background knowledge, this course will offer a comprehensive understanding of urban water and wastewater systems.", "Lectures, participating in tutorials, and groups provide an overview of key concepts and highlight important ideas from the readings.", "Describe frameworks for understanding and explaining urban water use.", "3. Identify and describe municipal water and wastewater systems and their subcomponents.", "The Aqueducts and Water Supply of Ancient Rome", "Yudelson", "Yudelson", "Yudelson", "Yudelson Chapters 7 – 8", "Yudelson Chapters 11 – 13", "Exposing the myths of household water insecurity in the global north: A critical review", "Yudelson", "Notice of Recording", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 199, "course_code": "ERS 320", "course_name": "ERS320 - Economics and Sustainability (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "Economics and Sustainability Winter 2025", "DWE 1515", "03:30PM - 04:20PM", "In the case of inclement weather, course lectures may shift online.", "View requirements for ERS 320", "We cover multiple perspectives in economics and trace the evolution of key drivers, debates, and policy approaches before turning to new frontiers of research and practice.", "The course format combines interactive lectures with exercises to build skills in economic and policy analysis, technical writing (policy briefings) for specialized audiences, and data analysis and visualization.", "The term will culminate in a poster session on sustainable economic futures with a focus on water, climate, and biodiversity - three areas where economists have prepared major reviews in the last 15 years.", "Describe and compare different economic perspectives on sustainability and development", "Identify trends and debates on the economics of sustainability from a systems perspective;", "Evaluate the strengths and weaknesses of economic methodologies for policy analysis;", "Integrate economic ideas and methods with other disciplinary perspectives in the humanities, natural sciences, engineering sciences and social sciences", "Introduction", "Why economics matters for sustainability", "The evolution of economic ideas about sustainability", "Sustainability economics", "Markets and the commons", "Why and how markets fail; coordination problems; property rights", "Valuing nature", "Frameworks and methods for valuing the environment", "How institutions and incentives shape behaviour and policy", "Defining and applying key concepts", "The Economics of Safe Drinking Water", "Atlas of Water Markets: East Africa and Latin America", "Natural Monopolies & Negative Externalities", "Atlas of Water Markets: South Asia, Southern Europe & North Africa", "The Economics of Biodiversity and Climate Adaptation", "Atlas of Water Markets: Western USA and Australia", "New frontiers of economic thinking about sustainability", "Summit", "Students are expected to attend each class and participate in three ways: critical reading; active engagement in class discussions and debates; and completion of practical exercises during tutorials.", "The mid-term exam, held Feb 26th, will be an in-class exam assessing understanding of core concepts and debates.", "The format will include multiple choice and short essays.", "Each student will be tasked with completing a policy briefing that applies economic concepts and methods to identify the causes of a water sustainability challenge and outline potential solutions.", "Notice of Recording", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 201, "course_code": "ERS 361", "course_name": "ERS361 - Food Systems and Sustainability (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Food Systems and Sustainability Spring 2024", "S. Scott", "sdscott@uwaterloo.ca", "Instructor: Steffanie Scott", "sdscott@uwaterloo.ca", "Specific themes covered in the course include technological and genetic change in food production, resource depletion and wider environmental impacts of the industrial food system, and policy, market-oriented, and civil society initiatives to bring about change in the food system, including organic production and localizing food systems.", "No other human activity has a greater ecological impact than our food system.", "Socio-cultural, economic, and political dimensions also shape the sustainability and resilience of our food system.", "Understanding many sides of an issue places you in a stronger position to determine and defend your own ideas.", "Food system change is a topic fraught with debate, particularly in relation to balancing socio-economic and ecological considerations.", "Explain the historical development of the contemporary food system, and associated main concepts and models (e.g., community-based/regional versus globalized/industrial food systems), and", "Specifications grading scheme & grade pathway requirements", "You can always move to a lower-level grade pathway.", "Grade A Pathway Grade B Pathway Grade C Pathway Grade D Pathway Re-submissions allowed?", "*only one of the Assignment 3 options can be used", "Re-submissions", "Extensions and Late Submissions", "We will follow these instructions and automatically assess your late penalty upon grading.", "Please anticipate technical problems and leave yourself at least a 1-2 hour buffer before the deadline in case something happens when you try to submit your work.", "Save multiple versions of your work as you write in case you accidentally overwrite your file.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "This course includes the independent development and practice of specific skills, such as food systems analysis.", "Library for research-based assignments", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 203, "course_code": "ERS 372", "course_name": "ERS372 - First Nations and the Environment (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["First Nations and the Environment Winter 2024", "ERS 372", "02:30PM - 05:20PM", "EV2 2006", "First Nation environmental issues are often complex and require a holistic approach where the lines between different disciplines (e.g. natural, physical, health, and social sciences) are often obscured.", "This unique course, co-taught with Traditional Knowledge Holder/Anishinaabe Elder Peter Schuler from the Mississauga’s of the New Credit First Nation, will provide upper-year undergraduate and graduate students, in the Faculty of Environment and across the university, an introduction to First Nations issues in Canada and to Anishinaabe Traditional Knowledge and Practice.", "2) Through weekly readings and online discussions: (i) Introduce students to some relevant academic literature on First Nations issues in Canada and appropriate/respectful research approaches such as critical Indigenous methodologies and decolonizing methodologies, and; (ii) Discuss these in a small group setting with insights from Peter and Dan", "Sand Talk, The Porcupine, the Paleo-mind and the Grand Design, The Albino Boy and Lemonade for Headaches", "Other Readings TBD", "Decolonization: Indigeneity, Education & Society, 1(1): 86-101.", "#1c - Reflecting on the material discussed in class (Peter's teachings, weekly readings and discussions, weekly critical reflections), and, based on existing evidence and relevant literature, envision a quasi-realistic future in which we are appropriately addressing complex issues such as climate change, social and environmental injustice, armed conflict, biodiversity loss etc.", "Explore what can be learned from this type of reflection and what are the first steps that can be taken towards that potential future?", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 204, "course_code": "ERS 404", "course_name": "ERS404 - Global Environmental Governance (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["02:30PM - 05:20PM", "Email Address: andrea.collins@uwaterloo.ca", "The history of international environmental politics will be reviewed, specific organizations and other actors involved in global environmental governance will be examined and the management of particular global environmental challenges investigated.", "ERS 404: View requirements for ERS 404", "Though efforts are made at all levels of society to address environmental issues, many of the challenges we face require transboundary coordination and governance.", "Students will learn about conventional sites of state-based governance, international organizations and agencies as well as emerging forms of governance, including private governance and the role of non-state actors.", "Students will develop a sense of the various political interests that influence global environmental governance and the challenges to enacting effective governance.", "Define and apply key concepts in contemporary global governance", "Describe the different kinds of global governance actors and their roles", "Understand global environmental issues and the presence or absence of appropriate governance mechanisms", "Analyze different forms of global environmental governance and assess their effectiveness", "Communicate key political challenges through both writing and public presentation", "+ A Short History of Grappling with Global Environmental Problems", "This week will introduce students to the overarching theme of the course – specifically that ‘governance’ is a flexible and contested term – and introduce some core ideas about global governance.", "“Responsibilities in Transition: Emerging Powers in the Climate Change Negotiations.”", "China as a ‘Partial’ Environmental Great Power.", "“Big Brand Sustainability: Governance Prospects and Environmental Limits.”", "Week 5 – Feb. 5 – Non-Governmental Organizations, Social Movements, Experts, and Civil Society & Modes of Non-state Governance", "“Is the Power of Brand-Focused Activism Rising?", "The Convention on International Trade in Endangered Species of Wild Fauna and Flora (CITES)", "Thematic Focus: North-South relations in global environmental governance", "Week 9 – March 12 – Ecosystems & Change: Deforestation and Land Degradation", "Thematic Focus: Role of non-state actors in global environmental governance.", "“Agency Shifts in Agricultural Land Governance and Their Implications for Land Degradation Neutrality.”", "muse.jhu.edu/article/168279", "Thematic Focus: Environmental justice and/or North-South relations", "Thematic Focus: fragmentation of environmental governance", "Morin, Jean-Frédéric & Orsini, Amandine.", "It contains short descriptions of key concepts that you may refer to in your reading for further clarification.", "Mid-term Test - Held in-person 25%", "Write a short 300-word original reflection of your thoughts about ideas/concepts in the weekly readings and emailing it to me before the next week begins (i.e. by Monday morning at 9 a.m.).", "Peer- Evaluation and Self-Assessment:", "I will provide resources to help you and your research partner(s) to communicate and collaborate, but you are ultimately responsible for resolving issues and solving problems.", "In addition, this document must also include a 100–150 word peer-evaluation of each research partner(s)’s performance and the nature of your collaboration this term.", "A clear description of your research topic: the issue and/or global agreements you have been assigned.", "Be well-organized and memorable with a clear learning outcome (i.e. what is the one thing you want the class to remember from your lesson).", "Each lesson should be 30 - 40 minutes in length.", "Additional time will be allotted for follow-up questions from the class and the instructor, so your entire time in front of the class may be up to 75 minutes.", "Instead, your analysis will demonstrate your understanding of the various actors and dynamics in global environmental governance.", "Please include a separate references page.", "Your references pages do not count towards the overall word count.", "Be sure that your research encompasses the study of global politics and governance and not just the scientific literature about your research area.", "The whole team will also need to attend an in-person meeting with me to discuss your research findings and contributions to the paper in the week before the end of the term.", "The exam will be held in-person during the exam period.", "Please be sure to refer to these when you are preparing your Team's lectures and when participating in class discussions.", "Engage in healthy debate:", "Don't interrupt when someone is speaking", "An engaged facilitator", "Prompts for discussion", "Opportunity to write ideas first", "Space for people to explore/explain ideas using their own experience and knowledge", "Organized slides", "clear headings", "summaries", "Late take-home exams will not be accepted after the grace period ends and will earn a grade of zero.", "Life happens and often interrupts our best laid plans for the term.", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Cross-listed courses", "This course includes the independent development and practice of specific skills, such as reading and analysis.", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 205, "course_code": "GEOG 203", "course_name": "GEOG203 - Environment and Development in a Global Perspective (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Environment and Development in a Global Perspective Fall 2024", "08:30AM - 09:50AM HH 1101", "Farah El-shayeb (felshaye@uwaterloo.ca)", "Examines the interface between human development and the environment in a global context.", "In this course, we will examine some of the most pressing environmental and development issues facing our world today, as well as international development efforts to address these.", "These efforts include interventions to help individuals and communities adapt to change through climate resilient agriculture, biodiversity, and clean energy transition.", "Several international development practitioners working in these areas will visit our class as guest speakers to share insights about some of the challenges and opportunities they face in implementing their work.", "Understand the historical evolution of international development and its linkages to globalization and economic growth.", "Translate international development ideas into practical strategies via a grant writing exercise.", "Enhance your professional development and communication skills through interactions with international development practitioners.", "Global trade and development", "Guest speakers: Tiffanie Rainville and Kerry Max, Global Affairs Canada", "Adaptation and development", "FAO 2017", "This course includes the independent development and practice of specific skills.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 206, "course_code": "GEOG 207", "course_name": "GEOG207 - Climate Change Fundamentals (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Climate Change Fundamentals Winter 2025", "Climate change is one of the most profound environmental and social issues affecting communities, nations and individuals.", "Climate change is a pervasive and challenging phenomenon that can be viewed through a multitude of lenses.", "A scientific lens, for instance, reveals altered ecosystems and climatic tipping points while the lens of ethics raises the question of the right to develop and influence the well-being of others while doing so.", "By carefully laying the scientific foundations, we will explore creative, positive, nuanced visions of the future that are rooted in scientific understanding of earth systems but also capture (or at least begins a conversation about) core human values, such as equity, compassion, innovation, and connection.", "Demonstrate understanding of key elements of the climate system, and how these elements are being altered by the human emission of greenhouse gases.", "Carefully consider the impacts of climate change on both human and natural systems.", "Articulate the difference between climate change adaptation and mitigation, and understand a portfolio of actions that communities can take to respond to climate change.", "Understand the key issues at play in international climate change negotiations, as well as recent Canadian policy proposals.", "Investigate futures that are fundamentally sustainable, low-carbon, and resilient to climate change impacts.", "Week 2: Introduction to the climate system, discussion activity, quiz", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Understanding Climate Change - Digital Version", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 207, "course_code": "GEOG 225", "course_name": "GEOG225 - Global Environment and Health (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Students will be exposed to a range of theoretical perspectives and debates, and engage in innovative assessment activities to illustrate their learnings.", "We will then develop a keen understanding of the foundational concepts we need to be able to explore the measurement, evaluation and implications of human health-environment interactions.", "You will see these steps identified in each of the 11 learning modules as:", "Do: There will typically be an exercise or a case study for you to engage in that allows you to see the application of the concepts being discussed in the module.", "Discuss: We will engage weekly with each other through online discussion forums in order to facilitate peer learning; you should also discuss this material with others in your working and/or social worlds – what do they think about what you’re learning?", "Define key terms in environment and health.", "Illustrate theoretical framings and understandings of environment and health.", "Critically assess the reporting of environment and health relationships in the media as well as the peer-reviewed literature.", "Value their role as a global citizen.", "Introduce Yourself Discussion", "This course includes the independent development and practice of specific skills, such as written communication, demonstrating the understanding of course concepts, and developing critical thought.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 208, "course_code": "GEOG 361", "course_name": "GEOG361 - Food Systems and Sustainability (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Food Systems and Sustainability Spring 2024", "S. Scott", "sdscott@uwaterloo.ca", "Instructor: Steffanie Scott", "sdscott@uwaterloo.ca", "Specific themes covered in the course include technological and genetic change in food production, resource depletion and wider environmental impacts of the industrial food system, and policy, market-oriented, and civil society initiatives to bring about change in the food system, including organic production and localizing food systems.", "No other human activity has a greater ecological impact than our food system.", "Socio-cultural, economic, and political dimensions also shape the sustainability and resilience of our food system.", "Understanding many sides of an issue places you in a stronger position to determine and defend your own ideas.", "Food system change is a topic fraught with debate, particularly in relation to balancing socio-economic and ecological considerations.", "Explain the historical development of the contemporary food system, and associated main concepts and models (e.g., community-based/regional versus globalized/industrial food systems), and", "Specifications grading scheme & grade pathway requirements", "You can always move to a lower-level grade pathway.", "Grade A Pathway Grade B Pathway Grade C Pathway Grade D Pathway Re-submissions allowed?", "*only one of the Assignment 3 options can be used", "Re-submissions", "Extensions and Late Submissions", "We will follow these instructions and automatically assess your late penalty upon grading.", "Please anticipate technical problems and leave yourself at least a 1-2 hour buffer before the deadline in case something happens when you try to submit your work.", "Save multiple versions of your work as you write in case you accidentally overwrite your file.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "This course includes the independent development and practice of specific skills, such as food systems analysis.", "Library for research-based assignments", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 211, "course_code": "PLAN 451", "course_name": "PLAN451 - Environmental Planning in Rural and Regional Systems (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Environmental Planning in Rural and Regional Systems Fall 2024", "Drop-in times: Tuesday 9:30am-10:30am", "This course explores environmental planning in rural and regional systems.", "Introduction", "In this course we focus on rural and regional systems for a couple of reasons.", "This course is intended to offer practical insight into the use of environmental planning to address complex social – ecological challenges currently facing human communities and how to navigate this complexity in the face of multiple often conflicting land uses and community values.", "We will examine topics such as climate change, biodiversity conservation, ecological connectivity, water management, and natural resource development, in a larger regional context, recognizing that these environmental issues invariably will cross political and administrative planning boundaries and include multiple disciplines and managers.", "The purpose of this course is (a) to examine the concept and application of environmental planning in rural and regional systems, (b) to explore methods and tools that can be used to address environmental problems and blend social, economic, and environmental community values, and (c) to garner an appreciation of practical challenges and possible opportunities to proactively integrate environmental issues into future development choices.", "The course is focused on a social-ecological systems perspective.", "Seminar topics are on specific social and ecological system issues, problems, and considerations.", "This course seeks to introduce the students to issues that affect environmental planning in rural and regional systems and expand the knowledge base needed by an environmental planner.", "Assess how planning can help address environmental problems in distinct rural contexts", "Evaluate how planning tools can be adapted within rural and regional systems", "Develop skills in approaches including participatory rural appraisal, collaborative planning, and stakeholder analysis", "Learning Modes and Expectations", "Introduction to the course and overview of the syllabus", "A social – ecological system perspective", "Environmental planning for biodiversity conservation and ecological connectivity", "Environmental planning for climate change and natural resources", "The use of environmental impact assessments in environmental planning", "TBA", "Environmental governance and collaborative planning", "TBA", "Incorporating working landscapes in environmental planning", "TBA", "TBA", "TBA", "Nov 25 The toolbox for environmental planning in rural and regional systems", "TBA", "Readings", "A network perspective of human-nature interactions in dynamic and fast-changing landscapes.", "University of Guelph, School of Environmental Design and Rural Development", "Ecosystem-Based Adaptation to Protect Avian Species in Coastal Communities in the Greater Niagara Region, Canada.", "Planning for ecological connectivity across scales of governance in a multifunctional regional landscape.", "Ecological connectivity in spatial planning: from the EU framework to its territorial implementation in the French context.", "Environmental Science & Policy, 129, 118–125.", "Social-Ecological Systems Insights for Navigating the Dynamics of the Anthropocene.", "Planning for climate change in Canadian rural and resource-based communities.", "Question and Answer Brief:", "You will choose a specific environmental problem and in a specific rural or regional location and context.", "This is an individual assignment intended to apply the concepts and tools discussed in the course.", "You will need to submit to me a preliminary paper outline for approval outlining the chosen environmental problem and location, explaining why you choose the specific case and how it reflects a rural and regional perspective (due no later than November 4, 2024).", "The case study evaluation is to reflect a social-ecological systems perspective, explain the environmental problem, describe the social and ecological context, and evaluate how the problem was (or is to be) addressed.", "Reference should be made to the required readings as well as other literature specifically related to the case study.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 212, "course_code": "PSCI 432", "course_name": "PSCI432 - Global Environmental Governance (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["02:30PM - 05:20PM", "Email Address: andrea.collins@uwaterloo.ca", "The history of international environmental politics will be reviewed, specific organizations and other actors involved in global environmental governance will be examined and the management of particular global environmental challenges investigated.", "ERS 404: View requirements for ERS 404", "Though efforts are made at all levels of society to address environmental issues, many of the challenges we face require transboundary coordination and governance.", "Students will learn about conventional sites of state-based governance, international organizations and agencies as well as emerging forms of governance, including private governance and the role of non-state actors.", "Students will develop a sense of the various political interests that influence global environmental governance and the challenges to enacting effective governance.", "Define and apply key concepts in contemporary global governance", "Describe the different kinds of global governance actors and their roles", "Understand global environmental issues and the presence or absence of appropriate governance mechanisms", "Analyze different forms of global environmental governance and assess their effectiveness", "Communicate key political challenges through both writing and public presentation", "+ A Short History of Grappling with Global Environmental Problems", "This week will introduce students to the overarching theme of the course – specifically that ‘governance’ is a flexible and contested term – and introduce some core ideas about global governance.", "“Responsibilities in Transition: Emerging Powers in the Climate Change Negotiations.”", "China as a ‘Partial’ Environmental Great Power.", "“Big Brand Sustainability: Governance Prospects and Environmental Limits.”", "Week 5 – Feb. 5 – Non-Governmental Organizations, Social Movements, Experts, and Civil Society & Modes of Non-state Governance", "“Is the Power of Brand-Focused Activism Rising?", "The Convention on International Trade in Endangered Species of Wild Fauna and Flora (CITES)", "Thematic Focus: North-South relations in global environmental governance", "Week 9 – March 12 – Ecosystems & Change: Deforestation and Land Degradation", "Thematic Focus: Role of non-state actors in global environmental governance.", "“Agency Shifts in Agricultural Land Governance and Their Implications for Land Degradation Neutrality.”", "muse.jhu.edu/article/168279", "Thematic Focus: Environmental justice and/or North-South relations", "Thematic Focus: fragmentation of environmental governance", "Morin, Jean-Frédéric & Orsini, Amandine.", "It contains short descriptions of key concepts that you may refer to in your reading for further clarification.", "Mid-term Test - Held in-person 25%", "Write a short 300-word original reflection of your thoughts about ideas/concepts in the weekly readings and emailing it to me before the next week begins (i.e. by Monday morning at 9 a.m.).", "Peer- Evaluation and Self-Assessment:", "I will provide resources to help you and your research partner(s) to communicate and collaborate, but you are ultimately responsible for resolving issues and solving problems.", "In addition, this document must also include a 100–150 word peer-evaluation of each research partner(s)’s performance and the nature of your collaboration this term.", "A clear description of your research topic: the issue and/or global agreements you have been assigned.", "Be well-organized and memorable with a clear learning outcome (i.e. what is the one thing you want the class to remember from your lesson).", "Each lesson should be 30 - 40 minutes in length.", "Additional time will be allotted for follow-up questions from the class and the instructor, so your entire time in front of the class may be up to 75 minutes.", "Instead, your analysis will demonstrate your understanding of the various actors and dynamics in global environmental governance.", "Please include a separate references page.", "Your references pages do not count towards the overall word count.", "Be sure that your research encompasses the study of global politics and governance and not just the scientific literature about your research area.", "The whole team will also need to attend an in-person meeting with me to discuss your research findings and contributions to the paper in the week before the end of the term.", "The exam will be held in-person during the exam period.", "Please be sure to refer to these when you are preparing your Team's lectures and when participating in class discussions.", "Engage in healthy debate:", "Don't interrupt when someone is speaking", "An engaged facilitator", "Prompts for discussion", "Opportunity to write ideas first", "Space for people to explore/explain ideas using their own experience and knowledge", "Organized slides", "clear headings", "summaries", "Late take-home exams will not be accepted after the grace period ends and will earn a grade of zero.", "Life happens and often interrupts our best laid plans for the term.", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Cross-listed courses", "This course includes the independent development and practice of specific skills, such as reading and analysis.", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 215, "course_code": "SCI 201", "course_name": "SCI201 - Global Warming and Climate Change (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Global Warming and Climate Change Winter 2025", "Office Hours and email communications: TBA (each will be responsible for particular assignments)", "Topics covered will include natural and anthropogenic causes of climate change, monitoring methods, current and low emission alternatives of energy production.", "The scientific, economic, public and political aspects of implementation of carbon capture and storage technology and other geo-engineering options to mitigate climate change will also be discussed.", "View requirements for SCI 201", "Understanding of fundamentals related to global warming and climate change", "Definitions and facts: weather, climate change and variability, global warming, present and past data collection", "Some basic principles of Thermodynamics..", "A1, 23:59", "Kirchhoff’s law, completion of One-layer Model..", "Climate systems, Feedbacks…", "Current and Future Physical Impacts of Climate Change", "Marked Q9", "Main Topics", "Basic science behind global warming (core)", "Some principles of Thermodynamics", "Earth as a Thermodynamic system", "Interaction of light with atmospheric gases", "Carbon and water Cycles", "Past and current trends", "Components of Climate System", "Current and Future Physical Impacts of Climate Change.", "Renewable energy", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations."]}, {"course_id": 0, "course_code": "STAT 330", "course_name": "STAT330 - Mathematical Statistics (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["Mathematical Statistics Winter 2025", "10:30AM - 11:20AM DC 1351", "This course provides a mathematically rigorous treatment for topics covered in STAT230 and 231, and to make essential extensions to the multivariate case.", "Topics covered include independence of random variables, conditional expectation and the determination of the distribution of functions of random variables using the cumulative distribution method, change of variable and moment generating functions.", "Asymptotic properties of the maximum likelihood estimator are examined and used to construct confidence intervals or regions.", "Tutorial: tutorials will be used for going over solutions of practice problem sets and holding term tests.", "Have a deep understanding of various mathematical aspects of Statistics and Probability.", "Week 4 Chapter 3. Expectation & M.G.F. Term Test 1 January 28th", "Asymptotic Distributions", "Introduction to Probability and Mathematical Statistics by Bain and Engelhardt, Second Edition No 112", "Arrangements for students with official conflicts will be handled on a case by case basis."]}, {"course_id": 1, "course_code": "STAT 331", "course_name": "STAT331 - Applied Linear Models (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Applied Linear Models Winter 2025", "08:30AM - 09:50AM MC 4020", "02:30PM - 03:20PM", "RCH 101", "Thursdays from 3:00-4:00pm in M3 3021", "Modelling the relationship between a response variable and several explanatory variables (an output-input system) via regression models.", "Model diagnostics and improvement.", "Algorithms for variable selection.", "Review of basic Normal theory, t, chi-squared, and F distributions.", "Simple linear regression.", "Analysis of variance.", "Multiple linear regression, variable selection techniques, indicator variables, diagnostics.", "Brief introduction to non-linear regression, factorial experimentation.", "Registered students can enroll in the class discussion board through Piazza.", "Search for your question first before posting.", "Do not expect a full solution to your question.", "To help maintain a safe, respectful, and productive community in which we – students and teaching team alike – can take risks in our learning/teaching, tackle challenging concepts, and ultimately grow as learners, we should endeavor to follow these mutual expectations:", "Explain the main concepts of linear regression models.", "Understand the methods of least squares and maximum likelihood estimation for model parameters.", "Interpret the model and its parameters (e.g., regression coefficients) in the context of any application.", "Draw inferences from a fitted model about the parameters of interest and make predictions.", "Apply the previous two outcomes when fitting linear models to real data using R.", "Assess model quality by diagnosing violations in underlying model assumptions (and identify strategies for improvement).", "Evaluate competing fitted models built using various model selection methods (and choose between them).", "Introduction", "The Straight Line Model", "Model formulation and interpretation", "Least squares estimation", "Mean response and residual variance estimation", "Introduction to R/RStudio", "Maximum likelihood estimation", "Estimators and their properties", "Important distributions", "Distributions of estimators", "Confidence intervals", "O - Ch. 2-4", "Straight Line Model in R", "Prediction intervals", "Intervals in R", "Hypothesis testing", "O - Ch. 4-5", "ANOVA and F test", "Model limits", "Data transformations", "O - Ch. 4-6", "O - Ch. 7", "A1 and Q1 Solutions", "Multivariate normal distribution", "The Linear Model", "Examples", "O - Ch. 8-9", "Estimation", "Estimators and their properties", "Distributions of estimators", "O - Ch. 9, 11, 12", "ANOVA and F test", "Significance tests", "General linear hypothesis", "O - Ch. 9, 11, 12", "A2 and Midterm Solutions", "Case Study: South African heart disease", "Nested models", "Additional sum of squares", "O - Ch. 12", "Outliers", "O - Ch. 13-14", "Influence", "O - Ch. 14-15", "A3 and Q2 Solutions", "One-variable-at-a-time selection methods", "Criteria-based selection methods", "O - Ch. 16", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solve exercises from the textbook on your own.", "Introduction to Regression Modeling by Abraham and Ledolter This textbook is an optional reference book (available for free on LEARN).", "R and R-Studio Free software.", "To serve as an opportunity to demonstrate your understanding, application, and integration of the course material, including practical application of the skills/concepts with the statistical software, R.", "Missed Assignment: The time window to complete these assessments are generous and, in general, a sickness lasting a couple of days will not be enough of a reason to ask for alternative accommodations and/or extension.", "Tips for Success", "Students should critically compare their work with available solutions and against the solutions of fellow classmates.", "Notice of Recording", "To help you decide if you should isolate, you can use the provincial self-assessment tool.", "In the scenario where we must transition back online the following contingencies will be used:", "These materials are made available for the personal use of students registered in the current offering of this course.", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical proofs and the fitting, interpretation, and assessment of linear models in real applications.", "Library for research-based assignments"]}, {"course_id": 2, "course_code": "STAT 332", "course_name": "STAT332 - Sampling and Experimental Design (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["Sampling and Experimental Design Winter 2025", "Email: schonlau@uwaterloo.ca", "Designing sample surveys.", "Analysis of variance.", "Designing for comparison of groups.", "Sampling: explain the effect of the finite population correction", "Sampling: Design and analyze a stratified random sample", "Experimental: Explain factorial design", "Experimental: Compare and contrast experimental design and observational studies", "5 2025-01-21 6 regress A1 out", "15 2025-03-04 4 Anova/F-test", "Slides Online in learn Yes 0", "Slides:  I am reworking some slides and will post them one-by-one into learn before class.", "data collection) 2%", "Activities supporting in-class analysis: The in-class analysis will require data collection (and possibly other activities).", "All team members must meaningfully contribute to the analysis and to coding.", "Projects must not use data sets that one of the team members has used for similar projects in previous courses.", "You must write up solutions using your own words and write your own programs.", "Give a clear explanation as to why you think you deserve a different mark."]}, {"course_id": 3, "course_code": "STAT 333", "course_name": "STAT333 - Stochastic Processes 1 (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM DC 1350", "04:00PM - 05:20PM", "Erik Hintz: Fridays, 2:00pm - 3:00pm, in M3-2106", "Requests must be emailed to: sasugradadv@uwaterloo.ca", "Topics cover generating functions, conditional probability distributions and conditional expectation, discrete-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, applications including the random walk, the gambler's ruin problem, and the Galton-Watson branching process, an introduction to counting processes, connections between the exponential distribution and Poisson process, and non-homogeneous and compound Poisson processes.", "use moment generating functions as a tool to determine expected values and identify probability distributions of random variables;", "use the law of total expectation to calculate expected values and probabilities through the principle of conditioning;", "specify a discrete-time Markov chain (DTMC), in terms of its transition probability matrix and initial conditions, and calculate various transition probabilities;", "classify the states of a DTMC;", "define fundamental DTMC concepts including irreducibility, periodicity, and recurrence/transience;", "find limiting/stationary probability distributions for certain DTMCs through the use of the Basic Limit Theorem;", "calculate absorption probabilities and expected absorption times for DTMCs using the principle of conditioning with respect to the first transition;", "Week 11 March 24 - March 28 Chap 4: Exponential Distribution & Poisson Processes Tutorial Assignment 2", "Week 12 March 31 - April 4 Chap 4: Exponential Distribution & Poisson Processes Tutorial Test 3", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solving exercises from the Course Notes on your own.", "Introduction to Probability Models by Sheldon M. Ross (2019)"]}, {"course_id": 6, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 7, "course_code": "MATH 247", "course_name": "MATH247 - Calculus 3 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["Topology on RN: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. (~3 weeks)", "Differentiation: partial differentiability, differentiability, chain rule, [midterm likely here], Taylor polynomials, extreme value problems. (~4 weeks)", "Integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. (~3 weeks)", "Local properties of continuously differentiable functions:  open mapping theorem, inverse function theorem, implicit function theorem. (~2 weeks)", "11:30AM - 12:20PM QNC 2501", "Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem.", "Topology of real n-dimensional space: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. Differential calculus on multivariable functions: partial differentiability, differentiability, chain rule, Taylor polynomials, extreme value problems. Riemann integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem."]}, {"course_id": 8, "course_code": "AMATH 231", "course_name": "AMATH231 - Calculus 4 (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "02:30PM - 03:20PM", "Vector integral calculus-line integrals, surface integrals and vector fields, Green's theorem, the Divergence theorem, and Stokes' theorem.", "Applications include conservation laws, fluid flow and electromagnetic fields.", "An introduction to Fourier analysis.", "Frequency analysis of signals.", "Notice of Recording"]}, {"course_id": 9, "course_code": "AMATH 242", "course_name": "AMATH242 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 10, "course_code": "AMATH 250", "course_name": "AMATH250 - Introduction to Differential Equations (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Differential Equations Winter 2025", "Solving linear differential equations: first- and second-order scalar equations and first-order vector equations.", "The main purpose of the course is to explore how first and second order differential equations (DEs) are used to model physical systems and predict their behaviour.", "first order linear DE models of compartment problems, atomic decay, and bodies in motion;", "first order separable DE models of population growth;", "a first order exact DE model of the electric dipole;", "second order linear DE models for oscillatory systems such as mass-spring-damper systems and electrical circuits;", "second order nonlinear DE models for suspended cables and rocket motion;", "linear vector DE models of multiple compartment problems and species interactions.", "Both analytical solution techniques and qualitative methods (direction field analysis, dimensional analysis, and phase portraits) will be presented as ways to gain information about system behaviour.", "We will investigate conditions for existence, uniqueness, and continuity of solutions of both first and second order initial value problems, and for systems in the plane.", "Maple will be used to generate numerical and graphical solutions, to illustrate concepts graphically, and to explore model behaviour.", "increase your comprehension of some of the many ways that differential equations can help us understand the real world;", "develop your ability to understand a mathematical model for a specific situation;", "explore analytical and qualitative solution methods for first and second order differential equations, and the use of Maple; and", "Please choose only one of the two options below.", "Submission Instructions", "Copyright Notice", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as solving differential equations.", "Library for research-based assignments"]}, {"course_id": 11, "course_code": "AMATH 251", "course_name": "AMATH251 - Introduction to Differential Equations (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Introduction to Differential Equations (Advanced Level)", "Email: cbauch@uwaterloo.ca", "Email: apunnavajhala@uwaterloo.ca", "This course offers a more theoretical treatment of differential equations and solution methods.", "In addition, emphasis will be placed on computational analysis of differential equations and on applications in science and engineering.", "Newton's enthusiasm was due to his success in using differential equations to give the first mathematical description of planetary orbits.", "Can you imagine what his reaction would be to the present widespread use of differential equations, with applications ranging from the space shuttle guidance system to epidemic models and neural networks?", "learn how to solve simple differential equations", "understand how differential equations can be applied in various fields", "We will cover portions of the following chapters from Boyce & DiPrima, in order:", "Chapter 1: Introduction to DEs", "Chapter 2: First-order differential equations", "Chapter 3: Second-order differential equations", "Chapter 7: Systems of linear equations", "Chapter 8: Numerical methods", "Chapter 9: Nonlinear differential equations and stability", "Elementary Differential Equations and Boundary Value problems.", "Assignments are to be brought to the start of lecture as a hard copy.", "Notice of Recording", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 12, "course_code": "AMATH 350", "course_name": "AMATH350 - Differential Equations for Business and Economics (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["Differential Equations for Business and Economics Winter 2025", "11:30AM - 12:20PM MC 4045", "First order ordinary differential equations.", "Applications to continuous compounding and the dynamics of supply and demand.", "Higher order linear ordinary differential equations.", "Systems of linear ordinary differential equations.", "Introduction to linear partial differential equations.", "Ordinary differential equations and their applications", "Systems of linear ordinary differential equations", "Linear partial differential equations and Fourier transform", "Black-Scholes equation and solution", "(Jan 6-10) Introduction to Differential Equations (DEs), Separable Equations, Initial-Value Problems, Applications from Finance", "Dimensional Homogeneity, First-Order Linear Ordinary DEs, Use of Substitutions, Applications from Finance Chapter 2 Posting Assignment 1", "Introduction to Higher-Order Linear Equations: Theoretical Background", "Introduction to Systems of Ordinary Differential Equations, Method of Solution for Homogeneous Systems (Second Order)", "(Mar 3-7) Introduction to Partial Differential Equations, First-order Equations (Partial Integration, Method of Characteristics) Chapter 5", "Second-Order Linear PDEs: Classification, Solution by Partial Integration or Method of Characteristics Chapter 5", "Please submit your assignments early in case of unexpected technical difficulties."]}, {"course_id": 13, "course_code": "CS 371", "course_name": "CS371 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 14, "course_code": "MATH 239", "course_name": "MATH239 - Introduction to Combinatorics (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics Winter 2025", "11:30AM - 12:20PM MC 4059", "09:30AM - 10:20AM MC 4021", "P. Nelson", "08:30AM - 09:20AM QNC 1502", "S. Pfannerer-Mittas", "10:30AM - 11:20AM MC 4058", "11:30AM - 12:20PM MC 4058", "09:30AM - 10:20AM MC 4042", "02:30PM - 03:20PM", "10:30AM - 11:20AM PHY 150", "04:30PM - 05:20PM", "You should have no reason to contact them directly, but you can find their email addresses through Learn.", "First name Last name", "Guilherme Zeus Dantas E Moura", "Theodore Morrison", "Matthew Kroeker", "Introduction to graph theory: colourings, matchings, connectivity, planarity.", "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.", "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 15, "course_code": "MATH 249", "course_name": "MATH249 - Introduction to Combinatorics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics (Advanced Level)", "09:30AM - 10:20AM MC 2017", "For graph theory, while we will focus on the same topics covered in MATH 239 (planarity and bipartite matching), our coverage of those topics will differ substantially in depth and in the techniques that we employ; in particular, we will see striking applications of algebra.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 18, "course_code": "CS 486", "course_name": "CS486 - Introduction to Artificial Intelligence (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Artificial Intelligence Winter 2025", "08:30AM - 09:50AM MC 2038", "08:30AM - 09:50AM MC 2038", "Varun Dhanraj: vdhanraj@uwaterloo.ca", "Methods of general problem solving.", "Multi-agent systems.", "Methods of general problem solving.", "Introduction to mathematical logic Mechanical theorem proving.", "Available free for downlooad online at artint.info Yes"]}, {"course_id": 0, "course_code": "SYDE 101", "course_name": "SYDE101 - Communications in Systems Design Engineering-Written and Oral (0.25)", "term_name": "1A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Communications in Systems Design Engineering-Written and Oral Fall 2024", "10:30AM - 11:20AM RCH 211", "08:30AM - 10:20AM E5 6008", "08:30AM - 10:20AM RCH 301", "Dr. Andrew Atkinson - Andrew.Atkinson@uwaterloo.ca", "Fatima Zohra - Fatima.Zohra@uwaterloo.ca", "Jamie Zettle - Jamie.Zettle@uwaterloo.ca", "This course introduces first-year students to systems design engineering with a focus on the engineering profession, and technical communication skills.", "Through in-class and independent activities leading to formative and summative assessments, students will consider and reflect on communication intention, audience, content, medium, format, and tone to demonstrate and improve upon their listening, written and oral communication skills for academic, engineering, and professional context.", "Use reliable sources of information and use it to fill in knowledge gaps (1,12)", "Distinguish ethical and equitable vs. unethical and inequitable situations applied in the engineering profession (10)", "Recognize the importance of codes and standards as best practice in engineering profession.", "The numbers in the brackets next to learning outcome are associated C.E.A.B Graduate Attributes", "ILO", "Professionalism and Communication in Engineering", "Google Technical Writing for Engineers", "Describe the design decisions that were made.", "Instructions", "Web and Intranet Communication", "Engineering Ethics", "Prof. Howcroft", "Partnering with our colleagues in the Centre for Career Action and the department of Co-operative Education, Co-op Fundamentals for Engineering (CFE) has been designed as a suite of co-op supports just for Engineering students.", "Your active participation in CFE activities has the potential to make a real impact on your first co-op experience.", "This is a degree milestone", "Sign your email with your first and last name and your student number.", "Any in-person deliverables (e.g., design presentations) will be delayed on a case-by-case basis.", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.", "A.A.S. also offers learning strategy supports to all students that can be accessed through:", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 1, "course_code": "SYDE 101L", "course_name": "SYDE101L - Communications in Systems Design Engineering-Visualization (0.25)", "term_name": "1A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Communications in Systems Design Engineering-Visualization Fall 2024", "TBD", "Email: sheida.marashi@uwaterloo.ca", "Dheeraj Khanna", "Email: d25khanna@uwaterloo.ca", "This laboratory course introduces students to visual communication methods relevant to engineering analysis and design.", "Through in-class and independent activities leading to formative and summative assessments, students will consider and reflect on communication intention, audience, content, medium, format, and level of detail to demonstrate and improve upon their skills in graphing, freehand sketching, technical drawing, and computer-aided design (CAD).", "Create technical drawings of objects using hand-sketching (1c)", "3. Create solid models and assemblies using CAD tools (5c)", "5. Create data plots that are appropriate for technical reports (7b)", "Apply appropriate graphical techniques to develop a design solution within a set of constraints (4)", "7. Communicate information graphically from initial ideation through prototype fabrication and documentation for a potential end-user (7b, 7c)", "Knowledge Base - Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "Problem Analysis - An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "Investigation - An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "Design - An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, and economic, environmental, cultural and societal considerations.", "Communication Skills - An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Professionalism - An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Impact of Engineering - An ability to analyze social and environmental aspects of engineering activities.", "Such ability includes an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society, the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Lifelong Learning - An ability to identify and to address their own educational needs in a changing world in ways sufficient to maintain their competence and to allow them to contribute to the advancement of knowledge.", "Drawings in SolidWorks", "Dimensioning", "3,4 CAD/ Solid modelling", "Discussion of Test", "Summative Test Sprint 4 – Data Analysis and Plotting   5 Data plotting software", "Knaflic, Cole Nussbaumer: “Storytelling with data: a data visualization guide for business professionals” (available online from the UWaterloo library)", "A total of seven assignments will be given during the term.", "• 1% for concept sketches", "Test", "The most likely accommodation for a student with a valid reason for missing the test is writing a make-up test at a different time.", "Evaluation", "Any group issues, for example those relating to \"free-riding\" or interpersonal disagreement, should first be resolved cordially within the group.", "If a resolution cannot be found, the issue should be brought to the attention of Prof. Hunter as soon as possible.", "Notice of Recording", "Laptops, Tablets, and Electronic Devices", "Evaluation", "Any group issues related to non-participating group members should be brought to the attention of the instructor as soon as possible.", "Contingencies For Disruptions that Impact the Course Events", "Course and Departmental Expectations", "Compassionate and respectful communication:", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 2, "course_code": "SYDE 111", "course_name": "SYDE111 - Calculus 1 (0.50)", "term_name": "1A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["RCH 301", "RCH 301", "RCH 301", "02:30PM - 03:20PM", "02:30PM - 03:20PM", "10:30AM - 11:20AM RCH 105", "Simple numerical methods.", "Introduction to integration, indefinite and definite integral, techniques of integration.", "2. understand the key concepts of limit and derivative from a mathematically rigorous perspective (1a, 2a)", "a. Demonstrate understanding of concepts in mathematics", "2. Problem Analysis", "4 Sept. 23-27 limits of functions: precise definition, limit laws,", "6 Oct. 7-11 linear approximation; Newton’s method;  indeterminate forms;", "12 Nov. 25-29 fundamental theorem of calculus; areas; indefinite integrals;", "functions M9 7", "E-TEXT", "Roughly each week there will be a problem set posted for you to work on.", "There's also a built-in formula editor that ultimately pastes the LaTex code.", "These will typically be open for approximately a week with a deadline of Fridays at 11:59 p.m.", "Quizzes: There will be five quizzes which will be held during the TUT 101/102 time slots in the weeks indicated in the schedule above.", "Course Conduct: I am committed to creating a learning environment where diverse perspectives are recognized and valued as a source of strength.", "Phone: 519-884-0000 extension 213", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 3, "course_code": "SYDE 113", "course_name": "SYDE113 - Elementary Engineering Mathematics (0.25)", "term_name": "1A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Elementary Engineering Mathematics Fall 2024", "01:30PM - 03:20PM", "08:30AM - 10:20AM DWE 3522", "Email: chrystopher.nehaniv@uwaterloo.ca", "Mathematical notation and proof techniques.", "Introduction to numerical computation: binary and floating point numbers and arithmetic, accuracy and sources of error.", "Use mathematical notation and proof techniques (including logic and mathematical induction, proof by contradiction, recursion, etc.)", "2. Understand and use basic set-theoretic operations, various finite and infinite number systems, and their notations (1a)", "Work with vectors and basic vector operations, linear mappings, lines, planes, and hyperplanes in finite-dimensional spaces, as well as with conic sections (1a, 2)", "Understand the geometry and algebra of complex numbers and carry out basic manipulations using them.", "Assignment 1 - Numbers and Sets    Sept 6", "Coordinate systems & Number systems.", "Notation: Summation & Products.", "Complex Numbers I.", "Mathematical Induction & Recursion", "Algebra & Geometry of Complex Numbers II: Roots and Factors of Polynomials.", "Fundamental Theorem of Algebra", "Lectures 12 & 13", "Operations in Vector Spaces.", "Geometry of the Dot Product.", "A Little Bit of Linear Algebra", "Lectures 18 & 19", "Lectures 20 & 21", "Fixed- and Floating-Point Number Systems Arithmetic", "Note: 10th edition includes metric spaces.)", "Students are expected to read the sections of the textbooks and supplementary readings assigned in each week before the corresponding lectures and tutorials.", "Although no grade is assigned to these problem sets,students are expected to solve these problems as part of their study habits and exam preparation.", "The MatLab exercises introduce a widespread numerical computational programming environment supporting the application of numerical computation techniques.", "**", "In that case, these will be recorded.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "Compassionate Accommodation:", "They will review your case and coordinate a reasonable and fair plan in consultationwith appropriate others (for example: instructors, Department Undergraduate Studies Committee, Chair, AccessAbility Services, Engineering Counselling services, Registrar's Office)."]}, {"course_id": 4, "course_code": "SYDE 121", "course_name": "SYDE121 - Digital Computation (0.50)", "term_name": "1A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 10:20AM E5 6008", "RCH 301", "RCH 301", "Fatima Syeda: f2syeda@uwaterloo.ca", "Use structured and object-oriented programming techniques to solve engineering problems (2)", "Apply software debugging tools and techniques during software development (5)", "Introduction, Basics of Computer Systems Sections 1.1 (Computer Systems) and 1.2 (Programming and Problem Solving)", "Variables and Data Types, Control Flow Basics, Testing and Debugging Sections 1.3-1.4 (Introduction to C++, Testing and Debugging), 2.1-2.3 (Variables and Assignments, Input and Output, Data Types and Expressions), Sections 2.4-2.5 (Flow of Control, Program Styling) and 3.1-3.2 (Boolean Expressions, Multiway Branches)", "Designing Loops, Top-Down Design, Function Declaration and Definition (Revisit) Sections 3.3-3.4 (Designing Loops), Sections 4.1-4.3 (Top-Down Design, Designing Functions), Sections 4.4-4.6 (Procedural Abstraction, Scope Rules, Overloading)", "Procedural Abstraction, Overloading Functions, Call by Reference Sections 5.1-5.3 (More on void Functions, Call by Reference Parameters, Functions Calling Other Functions), Sections 5.4-5.5 (Stubs and Drivers, Debugging Functions), Sections 7.1-7.4 (Introduction to Arrays, Arrays in Functions, Multidimensional Arrays)", "Debugging Functions, Arrays in functions   Quiz#2 (Oct 9)", "Vectors and STL Types, C-Style Strings, C++ String Class Sections 8.1-8.3 (An Array for Strings, String Class, Vectors)", "Structures and Classes, Abstract Data Types, Object Oriented Design Sections 10.1-10.3 (Structures, Classes, Abstract Data Types)", "Pointers and Dynamic Memory Basics, Smart Pointers Sections Sections 9.1 & 9.2 (Pointers, Dynamic Memory) LabAssignment #3 due", "G. J. Bronson: “C++for Engineers and Scientists”.", "Send a note via email to the course instructor clearly stating the grading item that you want remarked Attach supporting evidence for your case including screenshots of the pages that need to be regraded.", "A student must save a copy of the submitted work on his or her personal computer or personal file system in case of any website problem.", "Sign your email with your first and last name and your student number.", "While we will do our best to respond to your emails as soon as possible, allow a couple of hours (excluding weekends) for a response to your email.", "When in doubt please be", "Workshops will be delayed or transitioned to an online session on a case-by-case basis.", "To facilitate a delay, a workshop session may be replaced with a lecture delivered in an online format.", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows UW’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 5, "course_code": "SYDE 161", "course_name": "SYDE161 - Introduction to Design (0.50)", "term_name": "1A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Design Fall 2024", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "Please allow 24-48 hours for a response, excluding weekends and holidays.", "Multidisciplinary system design, the design process, problem definition, life-cycle design, design specification, concept/design generation and evaluation, design for manufacturing and assembly, system modelling and analysis, introduction to mechanical design, prototyping, safety and responsibility in engineering design, design documentation.", "Quantitative and qualitative tools and engineering methods will be introduced throughout the course that will provide a basis for future work in upper year design courses.", "Define a design problem (GA 3b, 3c)", "Compare and Select from Design Options and Solutions (GA 4c)", "Present and Document a Design Solution (GA 7a, 7c)", "Gather information from relevant sources to address complex engineering problems", "Synthesize information from multiple sources to reach valid conclusions", "Define design requirements and specifications for complex, open-ended engineering problems.", "Generate and refine potential solutions to complex, open-ended design problems", "Critically evaluate and compare design choices", "Select appropriate engineering tools4, considering their limitations", "Generate appropriate documentation to communicate within the profession and to society at large", "Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest", "Describe the importance of codes, standards, best practices, laws, and regulations within engineering", "Apply project management techniques in engineering projects, with attention to risk, and change", "W1 - Introduction", "W2 - What is Design", "W3 - SOC + SIS, Equity and Ethics in Design", "W4 - Functions and Design Generation", "W6 - Modelling and Engineering Analysis", "W8 - Prototyping", "W9 - Systems Thinking", "W10 - Testing and Design Loop Feedback", "W12 - Design Critiques", "W14 - Course Wrap-up", "Thinking in Systems Available for free through the UW Library at https://ocul-wtl.primo.exlibrisgroup.com/permalink/01OCUL_WTL/vk29fk/alma9939882743505162", "Laptops, Tablets, and Electronic Devices", "Any in-person deliverables (e.g., design presentations) will be delayed on a case-by-case basis.", "There could be a need to make alternate arrangements for in-person course activities.", "This alternate arrangement could be for a short period of time (e.g., one week) or a more sustained disruption to in-person course activities.", "Impacted in-person deliverables (e.g., team presentations) will be handled on a case-by-case basis with notification provided as soon as possible.", "If there is a sustained disruption to in-person course activities that occurs before the ‘Prototyping’ and ‘Testing’ workshop sessions, these workshops will be modified to allow for virtual completion and the associated Design Showcase 2 submission instructions will be revised to align with these changes.", "They will review your case and coordinate a reasonable and fair plan in consultation with appropriate others.", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate [", "A.A.S. also offers learning strategy supports to all students that can be accessed through:", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "They will review your case and coordinate a reasonable and fair plan in consultation with appropriate others (for example: instructors, Chair, AccessAbility Services, Engineering Counselling services, Registrar's Office).", "This course includes the independent development and practice of specific skills, such as writing and comprehension.", "Library for research-based assignments"]}, {"course_id": 6, "course_code": "SYDE 181", "course_name": "SYDE181 - Physics 1: Statics (0.50)", "term_name": "1A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "10:30AM - 11:20AM B1 271", "09:00AM - 09:50AM E5 6006", "10:30AM - 11:20AM B1 271", "09:00AM - 09:50AM E5 6004", "Associate Professor, Biomedical Engineering Program", "Systems Design Engineering", "E-mail: thomas.willett@uwaterloo.ca", "* If you require guidance outside of class, tutorials, and office hours, please email Prof. Willett.", "Introduction to the basic theory and principles of mechanics of static systems.", "Applications of mechanical principles to musculoskeletal systems will be presented.", "Basic concepts of mechanics, vectors.", "Analysis of trusses and frames.", "Distributed forces, centroids, and moments of inertia.", "Engineering mechanics involves the combination of physics and mathematics to develop models of physical world and solve problems in the physical world.", "In this course, you will acquire knowledge of the theory and principles of engineering mechanics of static systems and become proficient in problem solving in this area.", "You will acquire skills in analysing a problem, developing a plan to solve the problem including creating a mechanics-based model of the system, and proceeding to solve the problem with full understanding of the fundamentals and approach, not by memorization.", "Examples of the application of statics to mechanics of materials and musculoskeletal biomechanics will be discussed.", "A) Conduct vector mathematics operations (addition, subtraction, vector products)", "B) Calculate moments, centres of mass, and forces for particular structures.", "C) Describe position, forces, and moments in terms of vector in appropriate reference frames in two and three dimensions.", "E) Simplify systems of forces and moments to equivalent systems.", "F) Draw complete free-body diagrams and write appropriate equilibrium equations from the free-body diagram, including the support reactions on a structure.", "H) Determine the internal forces in a structure.", "a) Demonstrate understanding of concepts in mathematics A, B, C  All", "b) Demonstrate understanding of concepts in natural science B, C, D, E, F, G, H  All", "c) Demonstrate understanding of engineering fundamentals F, G, H, I  All", "a) Generate appropriate documentation to communicate within the profession and to society at large F, I, J  All", "CEAB Attribute Definitions", "Knowledge base for engineering: Demonstrate competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "2. Problem analysis: Demonstrate ability to use appropriate knowledge and skills to identify, formulate, analyse, and solve complex engineering problems in order to reach substantiated conclusions.", "7. Communication skills: Demonstrate ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Course Introduction during lecture period on Friday.", "Vector Math AC", "1/5 - 1/8", "Math and Forces ABC", "2/4-2/5", "2D Force Systems, Resultants, Moments, Couples ABCDEJ", "Equilibrium in 2D DEFGJ", "2/7-2/9", "2/7-2/9", "4/1-4/2", "Static Equilibrium in 3D, Conditions", "4/3", "4/4-4/5", "Methods of Joints", "Methods of Sections", "4/6", "4/6", "Distributed Forces, Centre of Mass,", "B", "5/6-5/7", "5/6-5/7", "6/1-6/3", "Fluid Statics", "Friction", "Design Dayz :-)   PS1", "14 December 2nd", "***NOTE:", "**", "Deliverables and Assessments:", "Each test will consist of one problem to test the competency of the student.", "The final exam will be held during the official examination period after the end of term.", "Notice of Recording", "To facilitate communication, we will use these three electronic means of communication: • Email • LEARN •", "Email:", "• Sign your email with your first and last name, and your student number.", "• Assume 24-48 hours for a response to your email.", "• Email should be used for brief questions that can be answered quickly.", "*", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "They will review your case and coordinate a reasonable and fair plan in consultation with appropriate others (for example: instructors, Chair, AccessAbility Services, Engineering Counselling services, Registrar's Office).", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, such as solving statics problems.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 7, "course_code": "SYDE 112", "course_name": "SYDE112 - Calculus 2 (0.50)", "term_name": "1B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Integration: improper integrals and applications.", "2. understand what a function of several variables can represent; visualize such functions (1a, 2a)", "3. understand the concepts of partial derivative, the gradient vector and the various forms of the chain rule (1a, 2a)", "6. understand how to describe curves and surfaces using parametric equations, for use in vector calculus (1a, 2a)", "a. Demonstrate understanding of concepts in mathematics", "2. Problem Analysis", "E-Text", "Roughly each week there will be a problem set posted for you to work on.", "There's also a built-in formula editor that ultimately pastes the LaTex code.", "Course Conduct: I am committed to creating a learning environment where diverse perspectives are recognized and valued as a source of strength.", "Phone: 519-884-0000 extension 213", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 8, "course_code": "SYDE 114", "course_name": "SYDE114 - Matrices and Linear Systems (0.25)", "term_name": "1B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Matrices and Linear Systems Winter 2025", "09:00AM - 10:50AM E5 6004", "Email: victoria.ann.kerr@uwaterloo.ca", "Shene Abdalla - smabdalla@uwaterloo.ca", "Matrix algebra, inverses, solution of linear systems, determinants, eigenvalues and eigenvectors, lower-upper (LU) factorization.", "This course covers the important and routine aspects of elementary linear algebra.", "The focus is on linear systems and their solution.", "The basics of matrix and vector algebra are also covered.", "Together, these topics provide a foundation for more advanced engineering math and applications.", "In addition to analytical techniques, you will learn about numerical methods for solving linear systems and predicting the accuracy of solutions obtained.", "1: Apply appropriate analytical and computational methods for manipulating matrices and solving linear systems (1a)", "2: Assess accuracy and precision for numerical solution of a linear system (1a)", "Solution of linear equations by row reduction.", "Vectors in Rn", "Solution sets of linear systems", "Linear Transformations", "Introduction to eigenvalues and eigenvectors.", "Linear Algebra, Fourth Edition by Jim Hefferson Available free: https://leanpub.com/linalgebra", "No extensions will be given after a submission date.", "Extensions will only be given for very serious issues, and will only be considered for the following circumstances:", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as critical thinking and mathematical reasoning.", "Library for research-based assignments"]}, {"course_id": 9, "course_code": "SYDE 162", "course_name": "SYDE162 - Human Factors in Design (0.50)", "term_name": "1B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Human Factors in Design Spring 2024", "01:30PM - 03:20PM", "02:30PM - 03:20PM", "Wendy Ding", "Email: wendy.ding@uwaterloo.ca", "Email: ali.karim@uwaterloo.ca", "Design of human-machine environments, design to reduce human error.", "Analytical methods of determining user needs in systems with humans.", "Information processing and human sensory processes and consideration of these elements in the design of systems with humans.", "Human physical capabilities and consideration of these in ergonomic design.", "Prereq: 1B Systems Design Engineering.", "SYDE 162, Human Factors in Design, is the second course in the SYDE Design course sequence.", "We will extend learning from SYDE 161 Introduction to Design by focusing on user/workplace requirements as they apply to the design of human-machine systems.", "In Human Factors in Design, we will introduce students to the discipline of human factors engineering and how it informs design decisions to improve design outcomes from the perspective of overall safety and human performance.", "Students will be exposed to human factors engineering concepts and analytical techniques relating to user experience and usability design, physical workplace design, and complex system design through lectures, assignments, case studies, and tests.", "Outline and illustrate a basic understanding of human physical and psychological capabilities and how these affect a person's ability to work and interact with technology.", "Appreciate the ethical responsibilities when conducting Human Factors/User Research (GAs 8a and 10a,b,c)", "Apply risk analysis techniques to develop a complete and holistic understanding of incidents involving human error.", "Apply human factors engineering concepts to analyze case studies and real-world design problems.", "Investigate stakeholder requirements in the context of user, task, and environmental characteristics.", "Critique and recommend redesign solutions for case studies and real-world problems based on human factors analytical methods.", "Knowledge Base - Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "Problem Analysis - An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "Investigation - An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "Design - An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, and economic, environmental, cultural and societal considerations.", "Communication Skills - An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Professionalism - An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Impact of Engineering - An ability to analyze social and environmental aspects of engineering activities.", "Such ability includes an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society, the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Lifelong Learning - An ability to identify and to address their own educational needs in a changing world in ways sufficient to maintain their competence and to allow them to contribute to the advancement of knowledge.", "Week Tuesdays Thursdays Readings Deliverables and", "Course Introduction", "HF Engineering and Design", "Interviews and Questionnaires", "Set Phasers on Stun", "Business in Bhopal", "Casey Business in Bhopal", "Double Vision", "Attention and Vigilance", "Perception and Memory", "Casey Double Vision", "Decision Making", "Rental Car", "Heuristic Evaluation and Design Principles", "Automation", "Fatigue and Circadian Rhythms", "Sound & Noise", "Vision", "Energy Usage", "Tigershark & Return from Salyut", "Tigershark & Return from Salyut", "Physical Demands Analysis", "Macroergonomics", "“Designing for people: an introduction to human factors engineering.”3rd", "Students must email the instructor before the assignment deadline to use these grace days.", "Deliverable Formatting", "Grade penalties for not following formatting expectations may be applied at the discretion of the course instructor.", "Notice of Recording", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows UW’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 10, "course_code": "SYDE 192", "course_name": "SYDE192 - Digital Systems (0.50)", "term_name": "1B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Digital Systems Spring 2024", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "Sign your email with your first and last name and your student number.", "Prereq: 1B Systems Design Engineering.", "The course also increases students' interest in software and hardware and prepares them for their co-op and future career.", "Explain the impoirtance of digital systems and computer architecture, (Attribute: 1d)", "2. Analyse internal components of digital systems and their technical details, (Attributes: 1d)", "4. Design digital systems that are reliable (observed behavior matches specifications), safe (avoid putting human lives in danger even in presence of errors and failures), and robust (ability to handle unspecified inputs and state), (Attributes: 3a)", "Communicate design of digital systems effectively in written documentation and oral presentation.", "construct meaning from oral, written, and graphic communication through interpreting, exemplifying,", "Instruction & Assessment:", "What you should be doing each week", "Suggested problem sets & solutions", "Microsoft Teams will be used as online platform:", "Online asynchronous lectures in case of any COVID-19disruptions", "Activities & Deliverables", "2 May 13 - 17 Binary Arithmetic and Digital Elements", "3 May 20 - 24 Combinational Logic and Combinational Circuits and Applications", "4 May 27 - 31 More on Combinational Logic and Combinational Circuits and Applications", "7 June 17 - 21 Sequential Circuits and Sequential Logic Design Assignment 3: due on Friday June 21", "8 June 24 - 28 More on Sequential Logic Design and Algorithmic State Machines", "Midterm Exam: Friday June 28 at 4:00pm in E5-6006 and E5-6008 (subject to change)", "3 Combinational Logic and Combinational Circuits and Applications 2, 3 N/A", "4 More on Combinational Logic and Combinational Circuits and Applications", "7 Sequential Circuits and Sequential Logic Design 2, 3, 4 N/A", "8 More on Sequential Logic Design and Algorithmic State Machines  2, 3, 4 N/A", "Harris and Harris: “Digital Design and Computer Architecture”.", "Patterson and Hennessy: \"Computer Organization and Design”.", "Mini Project Report & Code 10%", "Those will be marked for completion not for correctness.", "Each of these assignments may include analytical, numerical (using Falstad) and explanatory components exploring fundamental aspects of the material covered in the course.", "We may be using a circuit simulation software such as Falstad and TinkerCad.", "Systems Design Lab Kit: All students need to buy a lab kit that will be used in SYDE 192 and other courses in Systems Design Engineering.", "COVID-19 Emergency Self-Isolation:", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 11, "course_code": "SYDE 192L", "course_name": "SYDE192L - Digital Systems Laboratory (0.25)", "term_name": "1B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Digital Systems Laboratory Spring 2024", "09:00AM - 11:50AM E5 6007", "09:00AM - 11:50AM E5 6007", "09:00AM - 11:50AM E5 6007", "Email: chris.mcclellan@uwaterloo.ca,", "Abdul Abbasi - amabbasi@uwaterloo.ca", "Prereq: 1B Systems Design Engineering.", "This lab is intended to give students a practical introduction to digital technology, which includes combination logic, binary arithmetic, synchronous sequential circuits, design methodology, algorithmic state machines and microcomputer interfacing.", "design a circuit and draw a wiring diagram with proper inputs and outputs (5c)", "Accreditation Board) Engineering Graduate Attributes defined here:", "Graduate Attribute", "Equipment Introduction - power supplies, digital multimeter, resistors, LED, integrated circuits, bread boards, with focus on debugging", "Digital multimeter", "Soldering Workshop - Introduction to through hole and surface mount soldering", "Falstad circuit simulator software", "Combination Circuits (Adders & Multiplexers) - design of circuits, wiring diagram and breadboarding, with focus on debugging", "Digital multimeter", "Digital multimeter", "Microcontroller Timers - introduced to microcontrollers, and timers, coding stopwatch", "Microcontrollers Interrupts - continuation of timers, introduction to interrupts, push buttons, frequency counters are created", "Week 8 (June 25 – 28) – Lab 3 – Combination Circuits (Adders & Multiplexers)", "This includes weekends.", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self‐elect to forgo a deliverable receive a “0” for that deliverable.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 12, "course_code": "SYDE 223", "course_name": "SYDE223 - Data Structures and Algorithms (0.50)", "term_name": "1B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Data Structures and Algorithms Spring 2024", "03:30PM - 04:20PM", "03:30PM - 05:20PM", "Email: shi.cao@uwaterloo.ca", "Seyed Mohammad Amin Mirjalili <smamirja@uwaterloo.ca>, Online MS Teams communication and Q&A.", "Algorithms and Data Structures emphasizes the following topics: structured software design, data structures, abstract data types, recursive algorithms, algorithm analysis and design, sorting and searching, hashing, problem-solving strategies and NP-completeness.", "Prereq: Level at least 1B Systems Design Engineering or Computer Engineering Option.", "This course covers the fundamentals of computer programming concepts and methods, including the following topics: data structures, abstract data types, recursive algorithms, algorithm analysis and design, sorting, searching, hashing, and problem-solving strategies.", "These concepts and methods are used ubiquitously in software programming.", "Knowledge and skills learned in this course will allow students to develop basic computer programs and build the foundation for learning more advanced programming courses.", "As computer programming is involved in almost all engineering projects and scientific research, data structures and algorithms are becoming essential and even mandatory for engineers and researchers.", "The course also increases students' interest in programming and prepares them for their co-op and future career.", "Students will learn to analyze, implement, and use various data structures and data-management techniques in a variety of applications.", "This includes:", "Performing rigorous complexity analyses of simple algorithms and data structures (2c)", "Comparing different data-structuring techniques from the point of view of time and memory requirements (4c)", "Determining a suitable data structure to solve a specific algorithmic problem (4b)", "Implementing data structures correctly and efficiently in a high-level programming language, such as C/C++ (4b, 5c).", "2c: Critically evaluate solutions of engineering problems", "4b: Generate and refine potential solutions to complex, open-ended design problems", "4c: Critically evaluate and compare design choices", "Topics and Deliverable", "Introduction and Review of Programming Fundamentals", "Pointers and Dynamic Memory Allocation", "Algorithmic Analysis", "Stacks and Queues", "E5 6004 and E5 6006", "Sorting", "Platform and Software Usage", "Learn Slides and other learning materials", "Students should use original variable names and comment their code thoroughly with explanation to demonstrate originality.", "Students should save copies of their work on their computers and online file systems as backup in case of any problem.", "Closed-book exams are used to test students’ understanding of the basic knowledge learned in this course and the abilities/skills to apply the knowledge to problem solving and engineering analysis.", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows UW’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "This course includes the independent development and practice of specific skills, such as computer programming.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 13, "course_code": "SYDE 182", "course_name": "SYDE182 - Physics 2: Dynamics (0.50)", "term_name": "2A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 10:50AM E5 6006", "09:00AM - 10:50AM E5 6006", "E3-3169", "E3-3169", "Energy and momentum methods.", "Systems of particles.", "Kinematics and kinetics of rigid bodies; planar motion.", "Understand Fundamental Principles of Dynamics", "Analyze Kinematics of Particles and Rigid Bodies", "Apply Kinetics to Solve Problems", "Model Real-World Dynamic Systems", "Investigate Work-Energy and Impulse-Momentum Principles", "Understand the Dynamics of Rotational Motion"]}, {"course_id": 14, "course_code": "SYDE 211", "course_name": "SYDE211 - Calculus 3 (0.50)", "term_name": "2A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "11:00AM - 11:50AM E5 6006", "11:00AM - 11:50AM E5 6006", "11:00AM - 11:50AM E5 6006", "Held in MC 6460", "Vector differential calculus: divergence and curl, line and surface integrals, fundamental theorems, applications.", "First order ordinary differential equations: analytical techniques and applications.", "Second order linear ordinary differential equations: systems of equations and applications.", "Numerical methods for solving ordinary differential equations (ODEs).", "1. classify and use appropriate techniques to solve first order differential equations (DEs) (1a, 2a)", "2. understand how various applications lead to first order DEs, and give a physical interpretation of solutions of such DEs (1a, 2a, 2b)", "3. use numerical methods to approximate solutions to first order DEs (1a, 2a)", "6. understand the interpretation of and be able to evaluate line and surface integrals of both scalar and vector fields (1a, 2a)", "7. understand the concepts of divergence and curl and use these to apply the major theorems of vector calculus (1a, 2a, 2b)", "a. Demonstrate understanding of concepts in mathematics", "2. Problem Analysis", "First Order Differential Equations", "separable, exact, and linear DEs", "numerical methods", "Second Order Differential Equations and Systems", "second order linear constant coefficient equations (homogenous and non-homogeneous)", "analysis of the oscillator DE", "homogeneous linear systems - method of eigenvalues; non-homogeneous systems", "phase portraits", "Vector Calculus", "vector fields; line integrals of scalar and vector fields;", "fundamental theorem for line integrals; Green's theorem", "surface integrals of scalar and vector fields; flux", "divergence and curl", "Difference Methods", "Elementary Differential Equations with Boundary Value Problems, by W. Kohler and L. Johnson 2nd edition No", "Roughly each week there will be a problem set posted for you to work on.", "These are meant as the core resource to become competent in the mathematical tools and principles you are studying.", "There's also a built-in formula editor that ultimately pastes the LaTeX code.", "The e-text for Kohler and Johnson is available on LEARN for purchase.", "Quizzes: There will be four quizzes each covering the content from the couple of weeks previous.", "Notice of Recording", "Remember that these models regularly produce inaccurate statements and should be treated more similarly to a peer than a teacher.", "Phone: 519-884-0000 extension 213", "Course Conduct: I am committed to creating a learning environment where diverse perspectives are recognized and valued as a source of strength.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}]