[{"course_id": 5, "course_code": "ENGL 109", "course_name": "ENGL109 - Introduction to Academic Writing (0.50)", "term_name": "List 1", "program_name": "Degree Requirements", "program_id": 45, "major_id": 4, "major_name": "Bachelor of Computer Science Degree Requirements", "topics": ["Introduction to Academic Writing Winter 2025", "View requirements for ENGL 109", "You will learn about different forms of academic writing, as well as the processes that great writers engage in to create their best work.", "Even programs like engineering, or accounting, or geography include major writing assignments, especially in upper years, in part because they recognize that careers in those fields require far more writing than students might expect.", "Because we value learning as a social activity, and thus recognize that writers and readers learn from one another, much of your work in English 109 will involve different kinds of collaboration with your peers.", "think critically and communicate effectively;", "These quick interactive elements provide opportunities to test your understanding of course concepts but are not graded.", "Standard of Work", "Every member of this course—instructors as well as students—has rights and responsibilities to ensure a pleasant and productive experience for all.", "Online Etiquette", "Exemptions from late penalties can only be given where there are significant extenuating circumstances.", "Intellectual property includes items such as:", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 13, "course_code": "ENGL 101B", "course_name": "ENGL101B - Introduction to Rhetorical Studies (0.50)", "term_name": "List 2", "program_name": "Degree Requirements", "program_id": 45, "major_id": 4, "major_name": "Bachelor of Computer Science Degree Requirements", "topics": ["Introduction to Rhetorical Studies Winter 2025", "Instructor: Sonia Ayesha Zafar", "sa2zafar@uwaterloo.ca", "View requirements for ENGL 101B", "The systematic study of effective communication—the art of rhetoric—dates back at least to the epics of Homer and flourishes today in countless academic disciplines and fields of business.", "Students will leave the class with a firm grasp of basic concepts of rhetorical theory, a sense of the history of rhetoric, and a deeper appreciation for rhetoric as an inventive, critical, multimodal, and multidisciplinary enterprise—what Quintilian calls an “encompassing art” (ars circumcurrens).", "Define basic rhetorical concepts", "Describe the historical scope of rhetoric", "Appreciate rhetoric as an inventive, critical, multimodal and richly interdisciplinary enterprise", "Intellectual property includes items such as", "This course includes the independent development and practice of specific skills, such as collecting, synthesizing, and analyzing information; developing and practicing writing skills; and creative expression.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 14, "course_code": "ENGL 108B", "course_name": "ENGL108B - Global English Literatures (0.50)", "term_name": "List 2", "program_name": "Degree Requirements", "program_id": 45, "major_id": 4, "major_name": "Bachelor of Computer Science Degree Requirements", "topics": ["ENGL 108B", "04:00PM - 05:20PM", "Email: pugor@uwaterloo.ca", "View requirements for ENGL 108B", "In the contemporary era of expansive international economic and cultural connections now known as globalization, literature also holds an important place in the flow of global political-economic and cultural ideas and networks.", "As new ways emerge of delivering literature to readers worldwide, literary scholars are beginning to examine the impact that these works have on global culture and the ways that cultures can, and have transformed the world, especially by offering us new insights into other forms of human experience.", "Drawing from both writers and filmmakers from different regions of the world, we will examine how modern cultural producers capture the intricacies of our globalized world and how their works circulate within that world to find their own audiences.", "Our study of global English literatures aims to demonstrate how that genre functions as a powerful cultural tool for understanding globalization.", "Week One: Introduction: Setting the Scene", "Weeks Three & Four: Environmentalism in African Literature", "Racial Discrimination and Psychopathology", "Week Eleven: The American Prison Industrial Complex and Bio-politics", "April 1st: Group Presentations, A & B", "April 3rd: Group Presentations, C & D", "Students should be aware that when they access the electronic components of this course, private information such as first and last names, usernames for the ISU e-mail accounts, and program affiliation may become apparent to all other students in the same course.", "This policy protects confidentiality and confirms the identity of the student.", "Take as much care with your email communications as you do with written assignments.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 15, "course_code": "ENGL 108D", "course_name": "ENGL108D - Digital Lives (0.50)", "term_name": "List 2", "program_name": "Degree Requirements", "program_id": 45, "major_id": 4, "major_name": "Bachelor of Computer Science Degree Requirements", "topics": ["Email: c23marti@uwaterloo.ca", "An examination of how digital communication technologies create and promote online identities and social spaces, as well as interpersonal and communal interactions.", "View requirements for ENGL 108D", "How do the technical affordances of online spaces shape the way we use them?", "Analyze the socio-cultural, technological and ideological systems that shape the digital world, and shape us in turn.", "Apply core concepts of new media theory to your own digital life, improve your informational awareness and engage critically with digital culture.", "The Emergence of the Digital World Pt 2 Curtis, Hypernormalization", "Shrinking Frontiers: Digital Platforms and Corporate Consolidation", "Dijck, Platform Society", "Values at Play", "Week 7 AI Slop, Grifter Gurus and Memecoin scams: Digital Life in the Post-truth era   TBD Digital Artifact Analysis Due", "Critical Digital Media Analysis 15%", "This course includes the independent development and practice of specific skills, notably those involved with written communication, critical thinking and analysis, independent research and oral presentation.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 16, "course_code": "ENGL 119", "course_name": "ENGL119 - Communications in Mathematics and Computer Science (0.50)", "term_name": "List 2", "program_name": "Degree Requirements", "program_id": 45, "major_id": 4, "major_name": "Bachelor of Computer Science Degree Requirements", "topics": ["Notice of Recording", "ENGL 119: Communications in Mathematics and Computer Science Winter 2025", "10:00AM - 11:20AM B2 350", "Technical Support: If you experience a technical issue in LEARN, then email learnhelp@uwaterloo.ca", "This course aims to build students' oral and written communication skills to prepare them for academic and workplace demands.", "Working independently and in collaboration with others, students will analyze and produce various written and spoken forms of communication.", "View requirements for ENGL 119", "COURSE DESCRIPTION AND DESIGN", "Design:", "Demonstrate critical thinking, reading, and writing skills;", "Research, cite, and produce written communications on STEM-related topics;", "(At the time of writing this note, there is also a second option of printing a poster via the Waterloo Public Library—Eastside Branch, which has a large-format printer [", "The content and instructions for each knowledge check will be revealed in class on the specified due date.", "The knowledge checks will require students to apply or discuss what they have learned in each unit, drawing on the course materials in their answers, and completing them by the end of the class session.", "In essence, students can choose between two options: either write a traditional speech and record a simple video of themselves delivering it while standing up OR write a podcast-style script and record a video of themselves sitting down that incorporates some creative elements too (e.g., free music clips, visual aids, or other engaging features).", "Notice of Recording", "Notice of Recording", "Major assignments submitted late may incur a penalty of 2 marks deducted (e.g., as a general example, a grade of 19/25", "Assigned Letter Grades Percentage Values Average Calculation Values", "A 85–89 89", "Exceeds Expectations: A numeric grade in the 80–100% range corresponds to the A-level and indicates that the quality of the student’s work exceeds standard expectations for the major assignment.", "Meets Expectations: A numeric grade in the 70–79% range corresponds to the B-level and indicates that the quality of the student’s work meets standard expectations for the major assignment.", "Misses Expectations: A numeric grade in the 50–59% range corresponds to the D-level and indicates that the quality of the student’s work misses standard expectations for the major assignment.", "Exceptions will be considered on a case-by-case basis to ensure fairness and consistency, but there is no guarantee that a student’s circumstance will be considered extenuating/unforeseen and warrant such an accommodation.", "Please be aware that GenAI is known to falsify references to other work and may fabricate facts and inaccurately express ideas.", "On-campus supports:", "Off-campus supports:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 17, "course_code": "ENGL 208B", "course_name": "ENGL208B - Science Fiction (0.50)", "term_name": "List 2", "program_name": "Degree Requirements", "program_id": 45, "major_id": 4, "major_name": "Bachelor of Computer Science Degree Requirements", "topics": ["ENGL 208B", "11:30AM -", "Some attention will be given to the historical development of the genre.", "View requirements for ENGL 208B", "This course teaches the forms of science fiction present in modern science fiction and science fiction throughout history, in literature and other media forms.", "What purpose does science fiction serve in our lives?", "In particular, we will center on three subgenres of science fiction, aliens, robots, and time travel, to examine how and why science fiction creators and science fiction fans keep returning to these ideas.", "critically investigate and discuss major examples of science fiction literature and other works", "appreciate and apply some critical and theoretical approaches of science fiction to sf-based texts", "understand and communicate some of the history behind science fiction as a genre and form", "recognize how sf presents itself in different media, and how it contains its own subgenres and influences", "propose and carry out a critical investigation of a well-ordered argument concerning a given research topic regarding sf literature", "Introduction", "Alien invasions and colonialism", "First Contact stories", "Robots in older science fiction “Super-Toys Last All Summer Long” Brian Aldiss (Feb 3/4)", "“Incarnation Day” Walter John Williams (Feb 12/13)", "First Essay", "Science Fiction and games", "Netflix subscription for one month (for watching various programs in March)", "The participation mark will also be a measure of participation in classroom discussions.", "Attendance -- I will be keeping track of attendance, and using it to gauge leeway when it comes to extensions and other such issues.", "So for example, if you miss four classes, you should post a response to the exercise from the lecture for one of those classes.", "Participating as above is the basic requirement of the class and if your participation is not making this standard I will check in with you and let you know how to bring them up to that standard.", "In terms of response, I'm just looking for what you found interesting about the text.", "The posts are due 11:59 pm the day before the class in question—but if you'd like to submit them earlier, so I can incorporate them into the lecture sooner, that would be great.", "I'll be creating a post for week 1's second class, so you can get a sense how they're done.", "First Essay", "Second Essay", "There are still a lot of ethical and legal issues regarding generative AI that are in the process of being settled.", "I expect to see a lot of work in editing and expanding in any AI-assisted efforts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 0, "course_code": "CS 115", "course_name": "CS115 - Introduction to Computer Science 1 (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Introduction to Computer Science 1 Winter 2025", "Diren Swayze", "An introduction to the fundamentals of computer science through the application of elementary programming patterns in the functional style of programming.", "As we are aware of the varied ways in which this material might be of use in the future, we have included concepts that are beautiful and universal.", "Because of the fundamental nature of the concepts taught in CS 115, the course can serve both students whose primary interest in computers is in their use in their chosen areas of study and students intending to minor in CS.", "Module 01: Introduction Monday January 6", "Module 03: Strings and Symbols Monday January 13", "Module 06: Structural Recursion Monday February 3", "Module 08: Local Evaluation Monday February 24", "Module 09: Higher-Order Functions Monday March 3", "Exams", "You can submit each of those files as many times as you like before the deadline.", "Every time you submit a file, we'll run some basic checks on it to make sure it looks valid, and send you preliminary feedback via email.", "Re-marking", "The forms will be in a Survey on Learn for each assignment for two weeks."]}, {"course_id": 1, "course_code": "CS 135", "course_name": "CS135 - Designing Functional Programs (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Designing Functional Programs Winter 2025", "Monday -", "Monday", "07:00PM - 08:50PM", "08:30AM - 09:20AM", "10:30AM - 11:20AM MC 2034", "Charlie Clarke", "Email: claclark@uwaterloo.ca", "Karen Anderson", "Email: kaanders@uwaterloo.ca", "Email: dbwolff@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "Sara Nayar", "Email: cs135@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "CS135 Problem-solving FAQ", "Assignment Marking Error: Submit a re-mark request, due within one week of release of marks.", "Read Me First", "We hope to guide you through a carefully designed curriculum that introduces you to core concepts in computer science.", "In a typical week, you will move through the following activities:", "You should get a feel for what information is where so you can find it quickly in the future.", "An introduction to the fundamentals of computer science through the application of elementary programming patterns in the functional style of programming.", "Syntax and semantics of a functional programming language.", "Linear and nonlinear data structures.", "Abstraction and encapsulation.", "CS 135 Designing Functional Programs", "CS 135 is for students who would prefer a more conceptual treatment of introductory computer science in a simple language that is educationally effective but not commercially relevant.", "Hardware and Software", "Student labs are equipped with the DrRacket integrated development environment running on networked personal computers.", "References", "How To Design Programs by Felleisen, Findler, Flatt, and Krishnamurthi, MIT Press, 2003.", "Definition of lists, designing functions to process and produce lists, recursive definition of natural numbers, recursive data definitions.", "Non-Linear Structures (6 hours)", "Multi-clausal recursive data definitions, trees, mutually referential data definitions, design methods for complex data, iterative refinement, multiplexing.", "Early development of electronic computers and programming languages.", "History of concepts covered in this course.", "have understanding and experience with the topics in the course outline above", "Drop deadline 25", "Reading Week Starts", "Slides Description", "L01 Values and expressions Prefix notation, exact numbers, Boolean expressions, constants", "L04 Lists List values and expressions, composite data, data definitions", "iClicker pilot", "2024-08-26: CS135 is participating in a pilot comparison of iClicker and Vevox.", "The iClicker subscription should be free.", "iClicker Account", "Racket and DrRacket", "It is also simple and clean enough that we cover computer science content many CS students do not see until later in their CS careers.", "If you submit code written under some other system and it does not work in our currently-supported version of DrRacket, then we consider that code incorrect even if it works for you at home.", "Your work in CS135 will be assessed in a variety of ways.", "Coverage", "Using such off-limits material generally results in a significant loss of marks.", "In general, the basic tests will try to warn you if inappropriate functions and special forms are used.", "Submitting a partially completed solution is a good idea, just in case you don’t get back to it before the due date and to serve as a backup in case your computer breaks or is stolen.", "Email Karen Anderson .", "Email the ISAs and ask them to “mark it for feedback”.", "Testing", "We do several kinds of testing on your submissions:", "Basic tests", "Each time you submit before the due date, we run a set of “basic tests” on your submission.", "It’s amazing how many fatal errors can appear during last-minute tidying up!", "Do not make your last submission immediately before the deadline – it gives you no time to check the Basic Test results and respond, if needed.", "The numeric mark appearing on the basic test marksheet is only for guidance.", "After the submission deadline we run a second set of tests to assess your code, including:", "These post-deadline tests and hand-marking form your mark for the assignment.", "If you procrastinate long enough, this rule can easily cause you to fail the course.", "We won’t rehash the above policies, but we do want to make them concrete for CS135.", "A specific assignment may give exceptions to the above.", "You are welcome to use these tools to help you understand the course material, but you should not:", "cut-and-paste your assignment code into them for debugging assistance.", "Also, these tools will not be available when you write the exam, so you need to understand how to solve these problems yourself in order to pass the course.", "attempting to run malicious code during the submission or marking process."]}, {"course_id": 2, "course_code": "CS 145", "course_name": "CS145 - Designing Functional Programs (Advanced Level) (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Designing Functional Programs (Advanced Level)", "10:00AM - 11:20AM MC 2017", "Monday -", "Monday", "07:00PM - 08:50PM", "Email: troy.vasiga@uwaterloo.ca", "Office Hours: Tues and Thur 1:00-2:00pm in MC 6212,", "Email: kaanders@uwaterloo.ca", "Email: cs145@uwaterloo.ca", "Fri 2:30-3:30pm in MC 4065,", "Email: cs145@uwaterloo.ca", "This course introduces students to key concepts in the field of Computer Science, prepares students to complete the CS portion of their Math core requirements and, if desired, continue on to second-year core courses in CS, provides top students with appropriate challenges and enrichment, and explores topics in greater depth than is possible in CS 135.", "Audience", "Demonstrate above-average communication skills (listening, reading, writing) due to the lack of textbook support for much of the enrichment material", "Given a clear and concise statement of a problem or task, write a program from scratch of up to a hundred lines of properly-formatted and documented code in a functional programming language to solve the problem or complete the task", "Use elementary data structures, such as lists and trees, in programs", "Use higher-order functions to improve readability and efficiency of programs", "Analyze the worst-case running time of programs and describe examples of data that demonstrate that the analysis cannot be improved", "Demonstrate their understanding of the implementation of functional programming language features by coding small interpreters for Scheme-like languages", "An introduction to functional programming", "Function application and definition", "Substitution model", "Types in Scheme", "Structures", "Recursion on lists and integers", "Unary representation of integers", "Proving properties of programs", "Algorithm analysis", "Functions as values", "Anonymous functions", "Higher-order functions", "Local definitions", "Simplifying the language", "Binary representation of integers", "Immutable abstract data types", "Association lists", "Leaf-labelled and node-labelled trees", "S-expressions", "Interpreters", "Limits to computation", "Efficiency", "Purely-functional data structures", "Priority Queue ADT and Braun heaps", "Efficient maps: treaps, red-black trees, AA trees", "They will not be due each week on the same day, as is common in the other first-year CS courses and the first-year Math courses.", "Assignment questions are the main way to reinforce and deepen your understanding of the concepts and skills discussed in lecture.", "You will submit program files electronically to the Marmoset system, which runs tests on your code and informs you of the results fairly rapidly.", "You can still get a great mark in the course.", "Questions and concerns can be sent to instructor or ISA emails.", "When asking questions, first check in case the question has already been answered using the search bar above the feed/list of posts.", "Walk-in consulting hours may still be available if course staff are able to book a sufficiently-large room to follow distancing guidelines."]}, {"course_id": 3, "course_code": "CS 116", "course_name": "CS116 - Introduction to Computer Science 2 (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Introduction to Computer Science 2 Winter 2025", "Monday -", "Monday", "07:00PM - 08:50PM", "E. Dupont", "E. Dupont", "E. Dupont", "10:00AM - 11:20AM MC 4045", "02:30PM - 03:20PM", "08:30AM - 09:20AM", "09:30AM - 10:20AM MC 4042", "10:30AM - 11:20AM MC 4060", "11:30AM - 12:20PM MC 4060", "02:30PM - 03:20PM", "This course builds on the techniques and patterns learned in CS115 while making the transition to use of an imperative language.", "Use higher-order functions to improve the readability and efficiency of programs", "Describe the basic memory model for mutation of basic types, lists, and objects in Python", "Distinguish between constant, linear, quadratic, and exponential running times of algorithms", "Write useful Python programs using console and file input and output for practical tasks", "All times are given in Eastern Time.", "Important!", "In order to maintain a level of success in the course, students should not miss the completion of any modules.", "Students should check their basic tests email to ensure that the code meets the specification exactly.", "Please make sure you do this often!", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 4, "course_code": "CS 136", "course_name": "CS136 - Elementary Algorithm Design and Data Abstraction (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Elementary Algorithm Design and Data Abstraction Winter 2025", "08:30AM - 09:50AM MC 2017", "10:00AM - 11:20AM MC 2038", "10:00AM - 11:20AM MC 4059", "11:30AM -", "Monday -", "Monday", "07:00PM - 08:50PM", "This course builds on the techniques and patterns learned in CS135 while making the transition to use an imperative language.", "Topics discussed include iterative and recursive sorting algorithms; lists, stacks, queues, trees, and their application; abstract data types and their implementations.", "produce well-designed, properly formatted, documented and tested programs of a moderate size (200 lines) that can use basic I/O", "explain and demonstrate the use of the C memory model, including the explicit allocation and deallocation of memory", "explain and demonstrate the principles of modularization and abstraction", "implement, use and compare elementary data structures (structures, arrays, lists and trees) and abstract data type collections (stacks, queues, sequences, sets, dictionaries)", "If both exams are held in person", "If both exams must be held online", "If in-person exams cannot be held then they will be held online (if possible).", "You may also ask on the discussion forums in a private message.", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 5, "course_code": "CS 146", "course_name": "CS146 - Elementary Algorithm Design and Data Abstraction (Advanced Level) (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Elementary Algorithm Design and Data Abstraction (Advanced Level)", "Monday -", "Monday", "07:00PM - 08:50PM", "02:30PM - 03:20PM", "Brad In-person MC 6427", "On-line Consulting Hours: Microsoft Teams", "CS 146: Elementary Algorithm Design and Data Abstraction (advanced version)", "To familiarize students with key concepts in introductory computer science from an imperative perspective and to contrast this with the functional perspective taken in CS 145;", "To allow students to complete the CS portion of their Math core requirements and, if desired, to continue on to second-year core courses in CS;", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "Introduction to C and elementary mutation in Scheme", "The memory model.", "Variable declaration, assignment and infix expressions in C. Basic I/O in C. Compilation.", "Algorithm analysis in C. File I/O in C and Scheme.", "Program organization and testing methods.", "Space analysis in C and Scheme.", "Mutable lists, queues, deques, and trees in C. Time-space tradeoffs among mutable and immutable ADT implementations.", "Low-level abstractions", "Pointer arithmetic in C. Arrays in C and vectors in Scheme.", "Strings in C. Elementary hashing.", "Libraries in C and Scheme.", "Implementing high-level abstractions", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "The provided slides are not a substitute for attendance in any first-year CS course, but in CS 146, there are no slides, and the lecture summaries made available after lecture are an even worse substitute for attendance.", "Lectures will involve the development of ideas summarized very tersely in the handouts, as well as on-the-fly development of code, analyses, and proofs.", "CS145 and CS146 were originally designed as a year-long unit of curriculum, but eventually the individual courses drifted in their own directions.", "1.1 A note on logistics", "1.2 Review of forms of recursion and associated proof techniques", "1.3 In preparation for side effects", "1.4 Output", "1.5 Input", "1.6 First Introduction to C", "1.8 Memoization", "1.9 Mutation in C", "1.11 Boxes in C", "1.12 Advanced mutation", "1.13 Aliasing in C", "1.14 Memory and vectors", "1.15 Vectors in Racket", "1.16 Arrays in C", "1.18 ADTs in C; Amortized Analysis", "2 SIMPL: a simple imperative language", "2.1 Syntax and informal semantics", "2.2 Examples in several languages", "2.3 Formal semantics", "2.5 Proving imperative programs correct", "A primitive imperative language", "3.1 A primitive imperative language", "3.2 The PRIMPL simulator", "3.4 The SIMPL to A-PRIMPL compiler", "3.6 Strings in C", "3.7 Adding functions to SIMPL", "3.8 Adding both arrays and functions to SIMPL", "3.9 Implementing lists in PRIMPL", "4 MMIX: a realistic instruction set", "4.1 A more realistic processor", "4.2 The MMIX architecture", "4.2.1 Branches and Jumps", "4.2.2 Example", "4.2.3 Software Interrupts", "4.2.5 A Problem with Branches and Jumps", "4.4 Towards a SIMPL to MMIX compiler", "5.1 Storing primitive values", "5.3 Managing memory", "5.4 Structural and pointer equality", "5.5 Function application in a Racket interpreter", "5.7 Justifying the cost of Racket primitives", "5.8 Moving towards implementation in an imperative language", "6.2 Zippers", "6.3 A continuation-passing interpreter", "6.6.2 Mark-and-sweep", "6.6.3 Copying garbage collection", "6.7 Heterogeneous Data in C", "6.8 Multidimensional Arrays in C", "6.10 Variable-length Argument Lists", "7.1 Continuation-passing style", "7.2 Exception handling", "7.3 Undelimited continuations", "7.4 Delimited continuations", "7.5 Racket’s implementation of continuations", "In CS 146, we will examine the imperative paradigm, and compare and contrast the way that efficient algorithms and data structures are designed in imperative and functional languages.", "Racket is a laboratory for current research on aspects of functional programming languages, and we will continue to look at interesting topics in this area, perhaps at the cost of some coherency in the flow of material.", "They will not be due each week on the same day, as is common in the other first-year CS courses and the first-year Math courses.", "Assignment questions are the main way to reinforce and deepen your understanding of the concepts and skills discussed in lecture.", "You will submit program files electronically to the Marmoset system , which runs tests on your code and informs you of the results fairly rapidly.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "(Please also note that we may use the trends in a student's submission history to estimate the likelihood of other forms of cheating as well.)", "Library for research-based assignments"]}, {"course_id": 6, "course_code": "MATH 106", "course_name": "MATH106 - Applied Linear Algebra 1 (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Applied Linear Algebra 1 Winter 2025", "Systems of linear equations.", "Introduction to vector spaces.", "We will see how to solve systems of linear equations using matrix methods before studying matrices as algebraic objects in their own right.", "Next, we will learn about the fundamental concepts of span, linear independence, and basis and learn how to determine whether a set is a subspace of Rn.", "After studying subspaces, we will study linear mappings, which map subspaces to subspaces.", "We will discuss the geometric interpretation of these mappings and study their fundamental subspaces.", "Finally, we will learn how to calculate the determinant of a matrix and use this knowledge to diagonalize square matrices.", "Provide a graphical and algebraic description of vectors, lines, and planes in R^n", "Model and solve mathematical and discipline-specific problems using systems of linear equations", "Perform basic algebraic operations on matrices", "Given a set of vectors in R^n, determine whether it is linearly independent, a spanning set of R^n, or a basis of R^n", "Given a basis and a vector in standard coordinates, use matrix methods to calculate its coordinate vectors", "Given a set in R^n, determine whether it is a subspace of R^n", "Given a mapping L: R^n --> R^m, determine whether it is linear", "Given a linear mapping, choose the appropriate algorithm find a basis for each of its fundamental subspaces", "Given a square matrix, calculate its determinant and provide a geometric interpretation of this value", "Communicate ideas and concepts relating to linear algebra using accurate mathematical language and notation", "Calculators", "Avoiding Academic Offences", "I am committed to creating a learning environment where diverse perspectives are recognized and valued as a source of strength.", "School-Life Conflict"]}, {"course_id": 7, "course_code": "MATH 136", "course_name": "MATH136 - Linear Algebra 1 for Honours Mathematics (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Notice of Recording", "Linear Algebra 1 for Honours Mathematics Winter 2025", "08:30AM - 09:20AM MC 4061", "09:30AM - 10:20AM MC 4061", "10:30AM - 11:20AM QNC 2502", "11:30AM - 12:20PM MC 2065", "02:30PM - 03:20PM", "03:30PM - 04:20PM QNC 2502", "11:30AM - 12:20PM MC 4061", "10:30AM - 11:20AM B1 271", "Systems of linear equations, matrix algebra, elementary matrices, computational issues.", "Real n-space, vector spaces and subspaces, basis and dimension, rank of a matrix, linear transformations, and matrix representations.", "Master computational aspects of linear algebra, including matrix and vectors operations", "Solve systems of m linear equations in n unknowns", "Evaluate the inverse of a square matrix, when it exists", "Obtain the matrix representation of a linear transformation", "Evaluate the determinant of a square matrix", "Change co-ordinates and bases, and understand the effect on matrix representations", "Become familiar with operations and properties of abstract vector spaces", "While collaboration in understanding the material is encouraged, the work submitted must be your own, written independently.", "For example, submitting 60 minutes late will result in a maximum possible score of 40%, assuming a perfect score.", "Accommodation Requests", "Notice of Recording", "Allocate time appropriately towards the completion of the assignment which reduces the procrastination and cramming cycle", "Appreciate the importance of reviewing marked assignments", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as reading and writing proofs.", "Library for research-based assignments"]}, {"course_id": 8, "course_code": "MATH 146", "course_name": "MATH146 - Linear Algebra 1 (Advanced Level) (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Linear Algebra 1 (Advanced Level)", "Email: karigiannis@uwaterloo.ca", "This course is a rigorous treatment of the theory of finite dimensional vector spaces over an arbitrary field.", "We also cover the theory of determinants over an arbitrary commutative ring with identity, and some aspects of the theory of polynomials in one variable over a field.", "The ultimate goal is the Primary Decomposition Theorem, which characterizes a linear operator on a finite dimensional vector space in terms of invariant subspaces annihilated by the primary factors of its minimal polynomial.", "We will cover a large amount of difficult material at a fast pace.", "Understand and apply the concepts of the theory of abstract vector spaces and linear operators on finite-dimensional vector spaces.", "fields; systems of linear equations; matrices; row-reduced echelon form; matrix algebra; invertible matrices", "vector spaces; subspaces; bases and dimension; coordinates; row equivalence", "algebra of linear maps; isomorphism; representations by matrices; dual space; transpose of a linear map", "commutative rings; existence and uniqueness of determinants; multilinear maps; the exterior algebra", "eigenvalues; annihilating polynomials; invariant subspaces; simultaneous triangulation and diagonalization", "Much (but not all) of my lectures will closely follow the first six chapters of this book:", "“Linear Algebra: Second Edition” by Kenneth Hoffman and Ray Kunze; Prentice Hall, 1971.", "“Linear Algebra: Fourth Edition” by Friedberg, Insel, and Spence; Prentice-Hall, 2003.", "The assignments are an integral part of your evaluation in this course and I encourage everyone to take them very seriously.", "There will be no opportunity for a make-up midterm test."]}, {"course_id": 9, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 10, "course_code": "MATH 137", "course_name": "MATH137 - Calculus 1 for Honours Mathematics (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Notice of Recording", "10:30AM - 11:20AM MC 4059", "Monday -", "Monday", "07:00PM - 08:50PM", "Absolute values and inequalities.", "Sequences and their limits.", "Introduction to series.", "Limits of functions and continuity.", "Applications of the Mean Value theorem, Taylor polynomials and Taylor's theorem, Big-O notation.", "We will study these ideas as they relate to sequences and functions.", "First, we will examine sequences and what it means for one to converge.", "Next, we will use our knowledge of sequences to discuss functions, including limits and derivatives.", "Write clear and well-organized mathematical solutions and proofs.", "Solve problems in Calculus through logical thinking and careful analysis.", "Determine if a recursively-defined sequence converges and prove it using mathematical induction.", "Compute the limits of various functions using both the formal definition of the limit, arithmetic rules for limits,and l'Hopital's Rule.", "Find solutions to optimization and related rates problems.", "Sketch curves by first analyzing a given function and its derivatives.", "4: Jan 27 - 31 2.1 - 2.2 Functions and their Limits, Sequential Characterization of Functions, Squeeze Theorem Quiz 3", "7: Mar 3 - 7 3.5 -  3.7 Linear Approximation, Newton's Method, IFT Quiz 6", "8: Mar 10 - 14 3.8 - 4.2 Implicit and Logarithmic Differentiation, Related Rates, Local & Global Extrema, EVT Quiz 7", "9: Mar 17 - 21 ‡ 4.3 - 4.6 MVT and its Applications, Shape of a Function via 1st and 2nd Derivatives Quiz 8", "FE: Mar 31 - Apr 4 4.9 - 4.10 Curve Sketching, Optimization Quiz 10", "Notice of Recording", "Phone: 519-884-0000 extension 213", "Please let us", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 11, "course_code": "MATH 147", "course_name": "MATH147 - Calculus 1 (Advanced Level) (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["11:30AM - 12:20PM MC 4059", "04:30PM - 05:20PM", "Monday -", "Monday", "07:00PM - 08:50PM", "Introduction to mathematical proofs: Week 1;", "2. Sequences and Limits: Weeks 2 – 4;", "3. Functions and Continuity: Weeks 5–8;", "Introduction to Real Analysis, by R. Bartle and D. Sherbert No", "Any missed assignment will be given a score of zero.", "For any missed examination, you must have a valid reason and appropriate supporting documentation.", "In case VIF or STAD covers the midterm, the midterm may be excused, and its weight may be transferred to the final exam."]}, {"course_id": 12, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 13, "course_code": "MATH 138", "course_name": "MATH138 - Calculus 2 for Honours Mathematics (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Notice of Recording", "08:30AM - 09:20AM", "09:30AM - 10:20AM MC 4059", "10:30AM - 11:20AM MC 4061", "E. Bembenek", "11:30AM - 12:20PM MC 4021", "cpthowel@uwaterloo.ca", "E. Yalcin", "02:30PM - 03:20PM", "08:30AM - 09:20AM QNC 2502", "Introduction to the Riemann integral and approximations.", "Antiderivatives and the fundamental theorem of calculus.", "Applications of the integral.", "Improper integrals.", "Linear and separable differential equations and applications.", "Binomial series, functions defined as power series and Taylor series.", "The goal of this course is to further expand your knowledge of calculus and its applications for one-variable functions.", "First, we will explore areas under curves and the Fundamental Theorem of Calculus, integration techniques, and applications of integration including finding the area between two curves, volumes of solids of revolution, and the average value of a function.", "We will study how to solve separable differential equations and linear differential equations as well as their applications to population growth and Newton's Law of Cooling.", "Write clear and well-organized mathematical solutions and proofs.", "Solve problems in Calculus through logical thinking and careful analysis.", "Set up and evaluate Riemann integrals for simple functions", "Apply various integration techniques including change of variable, integration by parts, trigonometric substitution, and partial fractions.", "Solve separable and first-order linear differential equations.", "Compute the radius and interval of convergence for power series.", "Compute Taylor Polynomials and Taylor series for many elementary functions.", "1: Jan 6 - 10 1.1 - 1.3 Riemann Sums, Definite Integrals, Average Value", "5: Feb 3 - 7 2.1 - 2.2.2, 2.3 Intro to DEs, Direction Fields, Separable and First-Order Linear DEs Quiz 4", "8: Mar 10 - 14 4.1 - 4.3 Intro to Power Series, Differentiation & Integration of Power Series Quiz 7", "FE: Mar 31 - Apr 4 4.8 Big-O Notation Quiz 10", "Notice of Recording", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 14, "course_code": "MATH 148", "course_name": "MATH148 - Calculus 2 (Advanced Level) (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["08:30AM - 09:20AM", "Instructor: Michael Brannan", "E-mail: michael.brannan@uwaterloo.ca", "Week of", "3 Jan. 20 Fundamental Theorem of Calculus  A1", "4 Jan. 27 Techniques of Integration  A2", "5 Feb. 3 More Techniques and Improper Integration", "6 Feb. 10 Applications of Integration A3", "8 Mar. 3 Convergence Tests A4", "10 Mar 17 Sequences and Series of Functions A5", "11 Mar. 24 Power Series", "12 Mar. 31 Differential Equations A6", "Principles of Mathematical Analysis."]}, {"course_id": 15, "course_code": "MATH 135", "course_name": "MATH135 - Algebra for Honours Mathematics (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Algebra for Honours Mathematics Winter 2025", "An introduction to the language of mathematics and proof techniques through a study of the basic algebraic systems of mathematics: the integers, the integers modulo n, the rational numbers, the real numbers, the complex numbers and polynomials.", "Algebra for Honours Mathematics is a study of the basic number systems of mathematics.", "The course has two themes: Number systems and Mathematical language.", "The study of number systems will feel more familiar and will cover the integers, the integers modulo n, the complex numbers and polynomials.", "Gain practice in formulating conjectures and discovering proofs.", "Understand basic algebraic systems of mathematics: the integers, the integers modulo n, the rational numbers, the real numbers, the complex numbers and polynomials.", "MATH 135 Course Notes: Language and Proofs in Algebra, An Introduction Please see the Course Notes page in LEARN for the pdf No Free", "Generative AI: This course includes the independent development and practice of specific skills, such as proof discovery and proof writing.", "Library for research-based assignments", "In particular:"]}, {"course_id": 16, "course_code": "MATH 145", "course_name": "MATH145 - Algebra (Advanced Level) (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["02:30PM - 03:20PM", "E-mail: bmadill@uwaterloo.ca", "Topics include rings and subrings, integral domains and fields, homomorphism and isomorphism, quotient rings and modular arithmetic, isomorphism and the Chinese Remainder Theorem, irreducibility in integral domains, and field extensions.", "Week of", "1 Sept 5* Rings and Subrings", "3 Sept 19 Integral Domains and Fields A1", "7 Oct 24 FIT and CRT A3", "9 Nov 7 GCD's A4", "11 Nov 21 Field Extensions"]}, {"course_id": 17, "course_code": "MATH 235", "course_name": "MATH235 - Linear Algebra 2 for Honours Mathematics (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Linear Algebra 2 for Honours Mathematics Winter 2025", "Understand the definition of an abstract vector space and prove theorems about all vector spaces using the axioms.", "In the context of abstract vector spaces, understand and use the concepts of linear independence, spanning sets, bases, and dimension.", "Understand the definition of a linear transformation, and be able to prove whether or not a function is a linear transformation.", "Prove and apply the rank-nullity theorem.", "Understand and use the relationship between abstract linear transformations and matrices.", "Understand the axioms of an inner product, and use them to prove basic results about inner product spaces.", "Unitarily diagonalize a normal matrix.", "See schedule on Learn for a week-by-week breakdown of topics.", "Abstract Vector Spaces", "The definition of a vector space", "Subspaces", "Bases and dimension", "Linear Transformations", "Linear transformations between abstract vector spaces", "Rank and nullity", "Linear maps as matrices", "Change of coordinates", "Isomorphisms of vector spaces", "Eigenvectors", "Diagonalization", "Powers of matrices", "Inner product spaces", "Inner products", "Orthogonality and norm", "Orthonormal bases", "Projections", "Inner products and Gram matrices", "Singular value decomposition", "Singular values and singular vectors", "Singular value decomposition of matrices", "Singular value decomposition of linear maps", "You may complete these in groups of up to 3 students.", "You should be striving each week to understand the material on the assignments and the posted solutions.", "This will be a closed book exam, with no calculators permitted.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as writings proofs and communicating mathematical ideas.", "Library for research-based assignments"]}, {"course_id": 18, "course_code": "MATH 245", "course_name": "MATH245 - Linear Algebra 2 (Advanced Level) (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Linear Algebra 2 (Advanced Level)", "11:30AM - 12:20PM E2 1732", "E-mail: bmadill@uwaterloo.ca", "This is a second course in proof-based linear algebra.", "Particular emphasis will be placed on polynomials of linear operators, Jordan canonical form, and inner product spaces.", "Week of", "3 Sept. 16 Jordan Canonical Form I A1", "5 Sept. 30 Inner Product Spaces, Orthogonality T1", "A4", "10 Nov. 11 Singular Value Decomposition A6", "Linear Algebra by Friedberg, Insel, and Spence No"]}, {"course_id": 19, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 20, "course_code": "MATH 239", "course_name": "MATH239 - Introduction to Combinatorics (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Introduction to Combinatorics Winter 2025", "11:30AM - 12:20PM MC 4059", "09:30AM - 10:20AM MC 4021", "P. Nelson", "08:30AM - 09:20AM QNC 1502", "S. Pfannerer-Mittas", "10:30AM - 11:20AM MC 4058", "11:30AM - 12:20PM MC 4058", "09:30AM - 10:20AM MC 4042", "02:30PM - 03:20PM", "10:30AM - 11:20AM PHY 150", "04:30PM - 05:20PM", "You should have no reason to contact them directly, but you can find their email addresses through Learn.", "First name Last name", "Guilherme Zeus Dantas E Moura", "Theodore Morrison", "Matthew Kroeker", "Introduction to graph theory: colourings, matchings, connectivity, planarity.", "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.", "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 21, "course_code": "MATH 247", "course_name": "MATH247 - Calculus 3 (Advanced Level) (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Topology on RN: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. (~3 weeks)", "Differentiation: partial differentiability, differentiability, chain rule, [midterm likely here], Taylor polynomials, extreme value problems. (~4 weeks)", "Integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. (~3 weeks)", "Local properties of continuously differentiable functions:  open mapping theorem, inverse function theorem, implicit function theorem. (~2 weeks)", "11:30AM - 12:20PM QNC 2501", "Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem.", "Topology of real n-dimensional space: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. Differential calculus on multivariable functions: partial differentiability, differentiability, chain rule, Taylor polynomials, extreme value problems. Riemann integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem."]}, {"course_id": 22, "course_code": "MATH 249", "course_name": "MATH249 - Introduction to Combinatorics (Advanced Level) (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Introduction to Combinatorics (Advanced Level)", "09:30AM - 10:20AM MC 2017", "For graph theory, while we will focus on the same topics covered in MATH 239 (planarity and bipartite matching), our coverage of those topics will differ substantially in depth and in the techniques that we employ; in particular, we will see striking applications of algebra.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 23, "course_code": "STAT 230", "course_name": "STAT230 - Probability (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["03:30PM - 04:20PM MC 4045", "09:30AM - 10:20AM MC 4045", "02:30PM - 03:20PM", "03:30PM - 04:20PM MC 2017", "08:30AM - 09:20AM", "Pavel Shuldiner; E-mail: pavel.shuldiner@uwaterloo.ca; M3 4108", "Come with well-organized questions to make the best use of your time.", "Requests must be emailed to sasugradadv@uwaterloo.ca", "Joint probability functions, marginal probability functions, and conditional probability functions of two or more discrete random variables and functions of random variables are also discussed.", "Post-requisite:", "Define a probability model and determine probabilities of events using counting techniques.", "Define and use probability mass functions, probability density functions, and cumulative distribution functions to determine probabilities of events.", "Use moment generating functions as a tool to determine expected values.", "This learning consists of taking the time to carefully read the lecture notes on your own, ensuring you understand the concepts and steps demonstrated in the lectures to tackle examples, and then solving the end-of-section problems.", "Definitions of Probability", "Mathematical Probability Models", "1.1", "1.2", "Counting in Uniform Probability Models", "Addition and Multiplication Rules for Counting", "Permutations and Combinations", "Counting in Uniform Probability Models", "Addition and Multiplication Rules for Counting", "Permutations and Combinations", "Addition Rules for Unions of Events", "1.3", "2.1", "2.2", "2.3", "Conditional Probability and Product Rules for Intersections of Events", "Probability Mass Functions, Cumulative Distribution Functions", "Functions of Random Variables", "3.2", "Expectation of a Random Variable", "Expectation of a Function of a Random Variable, Properties of Expectation", "Moment Generating Functions", "3.3", "3.4", "3.5", "Basic Terminology and Techniques", "Joint Probability Mass Functions, Marginal Probability Mass Functions", "3.5", "4.1", "Multinomial Distribution", "Linear Combinations of Random Variables", "4.2", "4.4", "Linear Combinations of Random Variables", "Law of Total Expectation", "4.4", "4.5", "4.6", "Law of Total Expectation", "Cumulative Distribution Function, Probability Density Function", "Functions of Random Variables", "4.6", "Expectation of a Random Variable", "Moments of a Distribution, Moment Generating Functions, Mean, Variance, Standard Deviation", "Exponential Distribution", "Normal Distribution", "Exponential Distribution", "Normal Distribution", "Use of the Normal Distribution in Approximations", "Therefore, you should plan to spend between 3 and 6 hours each week in out-of-class learning.", "This learning consists mainly of ensuring you understand the concepts and steps used in class to solve problems and then solving exercises from the Course Notes on your own.", "A 2.5-hour final cumulative examination will be held during the final exam period in April.", "In the case of extenuating circumstances, you must provide sufficient documentation via e-mail to Divya Lala at divya.lala@uwaterloo.ca as soon as possible to verify your absence's circumstances.", "Re-mark Requests:", "Cancellation of In-Person Classes:", "Intellectual property includes items such as:", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "This course includes the independent development and practice of specific skills for solving real-life problems using introductory probability rules.", "Library for research-based assignments"]}, {"course_id": 25, "course_code": "STAT 231", "course_name": "STAT231 - Statistics (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Notice of Recording", "03:30PM - 04:20PM DC 1350", "02:30PM - 03:20PM", "11:30AM - 12:20PM MC 1085", "03:30PM - 04:20PM", "10:30AM - 11:20AM EIT 1015", "09:30AM - 10:20AM EIT 1015", "Email: aslynko@uwaterloo.ca", "Email: liqun.diao@uwaterloo.ca", "Email: yangjc@uwaterloo.ca", "Email: henan.xu@uwaterloo.ca", "Funmilayo Adeku", "Email: fadeku@uwaterloo.ca", "This course provides a systematic approach to empirical problem solving which will enable students to critically assess the sampling protocol and conclusions of an empirical study including the possible sources of error in the study and whether evidence of a causal relationship can be reasonably concluded.", "The connection between the attributes of a population and the parameters in the named distributions covered in STAT230 will be emphasized.", "Numerical and graphical techniques for summarizing data and checking the fit of a statistical model will be discussed.", "The method of maximum likelihood will be used to obtain point and interval estimates for the parameters of interest as well as testing hypotheses.", "The interpretation of confidence intervals and p-values will be emphasized.", "The Chi-squared and t distributions will be introduced and used to construct confidence intervals and tests of hypotheses including likelihood ratio tests.", "Contingency tables and Gaussian response models including the two sample Gaussian and simple linear regression will be used as examples.", "Course Information Webpage", "Please do not send these questions via email.", "I expect everyone to be respectful to each other, any posts that do not meet the principles in Policy 33: Ethical Behaviour will be removed.", "Email", "Please send emails from uwaterloo.ca email address and include the session number and student ID number.", "Continuity Plans", "Use numerical and graphical summaries of a data set to describe the characteristics of a variate and to check the fit of a statistical model to the data.", "Use the steps of PPDAC to identify both the objectives and possible sources of error in an empirical study, and to critically evaluate the conclusions.", "Identify the connection between attributes of a population and the parameters in the named distributions (Binomial, Poisson, Multinomial, Exponential, Normal).", "Define and use the likelihood function to obtain point estimates of the unknown parameters in a model particularly for the Binomial, Poisson, Multinomial, Exponential and Gaussian (Normal) models.", "Use a pivotal quantity to construct a confidence interval for a parameter in some specific cases, and interpret the confidence interval.", "Use the likelihood function to construct and conduct a test of hypothesis for an unknown parameter in a model.", "Interpret p-values and describe the connection with confidence intervals.", "Define the properties of the Chi-squared and t distribution.", "Define a Gaussian response model including simple linear regression; determine point and interval estimates and conduct tests of hypotheses for the parameters in a Gaussian model.", "Use a Goodness of Fit test to test the fit of a model, independence in a two-way table and equality of proportions for two or more groups", "Describe the importance of randomization and pairing in experimental design and be able to recognize whether a study design allows the researcher to conclude cause and effect.", "This learning consists of taking the time to carefully read the course notes on your own, making sure you understand the concepts and steps demonstrated in the lectures to tackle examples, and then solving the end-of-chapter problems.", "Monday", "Friday", "Welcome", "1.1 Introduction to Statistical Sciences", "1.3 Numerical Data Summaries", "1.3 Graphical Summaries", "1.4 Probability Distributions and Statistical Models", "1.5 Data Analysis and Statistical Inference", "1.6 Introduction to R and RStudio", "2.1 Choosing a Statistical Model", "2.2 Estimation of Parameters", "2.3 Method of Maximum Likelihood", "2.4 Likelihood Functions for Multinomial Models", "2.5 Invariance Property of MLE", "2.6 Checking the Model", "3.1 Planing and Conducting Empirical Studies", "3.2 Steps of PPDAC", "3.3 Case Study", "4.1 Statistical Models and Estimation", "4.2 Estimators and Sampling Distributions", "4.4 Confidence Intervals and Pivotal Quantities", "4.5 The Chi-Squared and t Distributions", "4.6 Likelihood-Based Confidence Intervals", "4.7 Confidence Intervals for Parameters in the Gaussian model", "4.7 Confidence Intervals for Parameters in the Gaussian model (Continued)", "5.1 Introduction to Hypothesis Testing", "5.2 Test of Hypotheses for Parameters in the Gaussian Model", "Relationship Between Hypothesis Testing and Confidence Intervals", "5.3 Likelihood Ratio Test of Hypothesis - One parameter", "6.1 Gaussian Response Models", "6.2 Simple Linear Regression: Maximum Likelihood and Least Squares Estimates", "Confidence Interval for Parameters in the Model", "6.3 Checking Model Assumptions and Residual Plots", "Randomization, Paring, and Experimental Design", "7.1 Likelihood Ratio Test for the Multinomial Model", "7.2 Goodness of Fit Tests", "This learning consists mostly of making sure you understand the concepts and steps that were introduced and used in class to solve examples and then solving problems from the Course Notes on your own.", "R Statistical Software", "R and the RStudio development environment can be downloaded from here.", "All assessments are proctored, in-person, and closed-book exams.", "A 2.5-hour cumulative final examination will be held during the final exam period (April 9 - 25, 2025).", "If you have a question regarding the marking of an assessment, you should first check the posted solutions on LEARN.", "First and last name", "Session number", "Please be specific and explain your rationale for a remark.", "Notice of Recording", "Short-term absence", "COVID-19-related absence", "No limits on number of submissions per term and only available during the formal lecture period", "In particular:", "Please inform us of these at the start of the course.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 26, "course_code": "STAT 241", "course_name": "STAT241 - Statistics (Advanced Level) (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["RCH 307", "Part I, Talking Probability: The statistical approach to analyzing data begins with a probability model to describe the data generating process; that’s why, to study statistics, one must first learn to speak the language of probability.", "10-11 Some \"standard\" statistical problems: categorical data analysis; two-sample comparisons, confounding factors, randomization, and blocking; simple linear regression.", "Midterms (M) 30 pts @ 15 pts each", "Final (F) (100 - A - M) pts", "Date & Time Location", "Then, his final exam will be worth 100-A-M=100-0-6=94 pts."]}, {"course_id": 27, "course_code": "COMMST 100", "course_name": "COMMST100 - Interpersonal Communication (0.50)", "term_name": "List 1", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["jclausen@uwaterloo.ca (please do not use the D2L email system)", "I monitor my email M-F, 9:00 am - 5:00 pm.", "Focuses on the one-to-one, face-to-face communication in both the personal and professional realms.", "Such topics as verbal and non-verbal interactions, listening, and the better management of interpersonal communication will be studied.", "In this course, we will work to understand more fully how we communicate (and are communicated to) in the world we live in and to develop the tools to research, apply, and practice key interpersonal communication concepts in our everyday lives.", "Students will be encouraged to identify, negotiate, and challenge existing communicative norms as they explore a range of interpersonal and intrapersonal issues that include culture, identity, and power.", "Understand the complexity of communication as a human process of shared meaning- making in the context of power, history, and culture", "Increase your capacity to recognize and enhance yours and others’ agency – the ability to make a difference in the world for yourself and others – and understand the implications of your communication behaviours for yourself and others", "Understand communication as a practice and improve your critical and creative communication competencies by developing your ability to use writing and other media of communication to create meaning", "This entails opportunities for student-directed inquiry, challenge and risk-taking, and reflection on your roles and responsibilities", "Reflect on your role in fostering the public good (the multifaceted well-being of individuals and groups), begin to imagine a better future, and make decisions in your communication that can transform the communities to which you belong", "Recognize diverse linguistic practices and modes of expression as resources for writers and speakers", "Introduction", "Read: Meaning as Co-Created", "Read: “Cultural and Historical Influences: Communication Competence in Context”", "Exceeds assignment guidelines; strong and consistently applied definition of audience and purpose; thoughtful and innovative adaptation of the subject to the audience’s needs; subject developed and organized at every level for listener comprehension; speaker uses language appropriately, effectively and even inventively; maintains relaxed, inviting delivery free of verbal fillers and distractions; cites sources appropriately both in spoken and written work; submits well prepared required materials.", "Your entries should be roughly two typewritten, double- spaced pages each although they can go slightly over.", "While the amount you write under each heading may change week to week, this format allows you to address each area regularly.", "Decide how often you will communicate and in what manner.", "Decide how you will divide the workload and handle conflicts.", "Handing in a clear contract will earn 5%.", "Your job will be to engage the class and apply what we are reading to people’s own opinions, experience, etc. Sign up for this assignment is on a first-come/first-served basis starting during week two of classes.", "Group Presenation 2: Final Presenation You and your group will create a fifteen-minute videotaped presentation exploring a problem in interpersonal communication and proposing a solution for that problem.", "This presentation will involve research into a specific issue related to interpersonal communication and creating good reasons for following your proposed solution.", "This course includes the independent development and practice of specific skills, such as self reflection, critical thinking skills and interpersonal communication.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 28, "course_code": "COMMST 223", "course_name": "COMMST223 - Public Speaking (0.50)", "term_name": "List 1", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["In the case of service interruptions to the LEARN system, please see the LEARN Service Interruption Policy https://uwaterloo.ca/secretariat-general-counsel/service-interruptions-online-learning-environment-guidelines", "A workshop course involving design and delivery of various kinds of speeches, and the development of organizational, vocal, listening, and critical skills.", "Apply speech communication concepts in designing and delivering public speeches and digital productions", "Understand and negotiate cultural assumptions and expectations in public address", "Foundations of a public speaking performance", "Your first speech: Informing about your language", "First speech workshop: a life story of the language I speak (voice, body, presence)", "First speech presentation 1", "First speech presentation 2", "Oct. 3: Read: Evaluating speeches critically (Zarefsky & Engels)", "First speech presentation 3", "Discussion and Introduction to Second Speech Assignment: Persuading a local audience", "(and Choosing your topic -CH 6 .Zarefsky & Engels)", "Your second speech: persuading a local audience", "(Ch 14 and Ch 16 -up until 16.5-, Zarefsky & Engels)", "Second Speech Development", "Exercise # 2: Describe a local situation and evaluate it as a problem for your peers - 90 sec. speech", "Mediated public speaking: Persuading a Digital Audience", "Read; Appendix B, Ch. 16, Zarefsky & Engels", "Development & Research of your project", "Nov. 26 &", "Second Speech: Persuading a Local Audience 30%", "Third Speech: Persuading a Digital Audience 30%", "First Speech: Informing about your language", "The goal of this speech is for you to inform your audience about how your mother tongue  background, individual experience, and culture impact your self-concept, language use, sense of audience perceptions, constraints stemming from communicative norms, and methods you employ to negotiate various rhetorical situations.", "Second Speech: Persuading a Local Audience", "Third Speech: Persuading a Digital Audience", "3 short speech excercises: 3.33% each for a total of 10%", "You should also write a few brief notes on why you chose each quotation.", "How does it relate to the class?", "The moderator is responsible for running the class in an efficient and creative manner: introducing speakers, organizing the discussions with the evaluators, initiating class comments, and generally making sure that the session runs smoothly and according to schedule.", "90-Second Short Speech Exercises  (3 total, marked for completion):", "These public speaking exercisesintroduce students to fundamental rhetorical concepts and strategies.", "Over the course of the semester, you will present three exercises as 90-second speeches in front of the class or in small groups.", "For the first and second major assignments of the term, you will offer and accept productive feedback and produce brief analyses of your peers’ speeches in two-page, double-spaced papers (one each for the first and second major speech rounds).", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 29, "course_code": "EMLS 101R", "course_name": "EMLS101R - Oral Communications for Academic Purposes (0.50)", "term_name": "List 1", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["& Location:", "Email:                         christa.schuller@uwaterloo.ca", "Designed specifically for students for whom English is not the first language, this course introduces group discussion strategies and presentation skills.", "A focus on pronunciation and vocabulary assists learners to better engage in conversations and listen to and deliver English presentations.", "This is achieved with the focus on gambits, voice quality, and speech clarity, which assist learners in developing strategies to better engage in discussions, and listen to and deliver English presentations in both remote and face-to-face contexts.", "Create and organize discussions and presentations", "Use a clear and appropriate format", "Develop relevant and well formatted materials (PowerPoint slides and discussion notes)", "Select effective introductions and conclusions to engage the audience", "Clearly express their ideas verbally and non-verbally", "Use communication gambits and signpost language effectively during discussions as well as individual and team presentations", "Use body language and space on stage to enhance the expression of ideas", "Listen for main ideas and details of some selected TED talks to form opinions on current socio-cultural, educational, environmental, and technological issues", "Critically evaluate various sources of information and then incorporate these sources in oral communication to create strong, academic support for their ideas", "Topics & Activities In-class Activities & Assignments Home                 Assignments", "Nonverbal communication- Importance of body language", "Introduction to group discussion assignment", "Analysis of non-verbal communication of selected presenters", "Small talk & non-verbal communication practice", "Main ideas and brief summary of TED Talks", "Question types for semi-formal discussion", "Discussion facilitation and gambits", "Non-verbal communication during a discussion", "Discussion skills", "Introduction to informative presentation introductions and conclusions", "Introduction to individual  presentations: thesis statement and format", "Chunking, pausing and focus words", "Writing thesis statements", "Pausing and focus words", "Effective PowerPoint slide design & APA citations", "Opening and closing a presentation", "Practice designing a slide and presenting its content", "Sample presentation", "Submitting PPT and Outline", "Submitting PPT and Outline", "Introduction to product review", "Inventions and innovations; product features", "Brainstorming for main ideas", "March 24 - 28", "Product review development – outline and slides", "Sample product review slides & outline", "Search for support materials, content development & slide design", "Product review presentations", "You will also need to watch the presentations of the other students and actively participate in the Q & A sessions following these presentations.", "A self-reflection on your preparation for the presentation, its delivery, and the Q & A will follow.", "A brief Q & A session will then follow.", "You will also need to watch the presentations of the other students and actively participate in the Q & A sessions following these presentations.", "These quizzes will cover the concepts related to academic and professional presentations, both individual and co-delivered, as well as discussions.", "Electronic Device Policy", "This course includes the independent development and practice of specific skills, such as collecting, synthesizing, and analyzing information; developing and practicing oral skills; critically evaluating and elaborating on ideas.", "Library for research-based assignments", "You can earn an EMLS Diploma by completing four EMLS courses and earning a cumulative average of 65%.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 30, "course_code": "EMLS 102R", "course_name": "EMLS102R - Clear Communication in English Writing (0.50)", "term_name": "List 1", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Clear Communication in English Writing Winter 2025", "K. Williams", "k33willi@uwaterloo.ca", "Designed specifically for students for whom English is not the first language, this course offers sentence-level instruction in grammar and idiom to teach students to produce, evaluate, and edit writing under time constraints.", "It emphasizes readability and error reduction in sentences and paragraphs.", "Identify sentence organization patterns and use them accurately and appropriately.", "Consider the importance of purpose and audience for specific writing tasks.", "In the case of emergency that may result in late submission, please contact the course instructor(s) to discuss potential extensions.", "You can earn an EMLS Diploma by completing four EMLS courses and earning a cumulative average of 65%.", "This course includes the independent development and practice of specific skills, such as writing sentences with grammatical accuracy and sentence structure, being able to edit writing for grammatical errors, developing and increasing vocabulary skills, and writing required organization patterns.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 31, "course_code": "EMLS 129R", "course_name": "EMLS129R - Written Academic English (0.50)", "term_name": "List 1", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Designed specifically for students for whom English is not the first language, this writing skills course provides instruction in grammar, sentence and paragraph structure, elements of composition, and academic essay writing, including a focus on theme, development of central ideas, exposition, and argumentation.", "The course provides instruction in grammatical accuracy, written fluency, and conventional essay patterns.", "This writing course is for students whose first language is not English.", "recognize and write conventional patterns of essay organization such as definition, compare-contrast and argument,", "use appropriate grammar structures to achieve accuracy in writing,", "draft and edit to achieve fluency in writing,", "Library for research-based assignments"]}, {"course_id": 32, "course_code": "ENGL 109", "course_name": "ENGL109 - Introduction to Academic Writing (0.50)", "term_name": "List 1", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Introduction to Academic Writing Winter 2025", "View requirements for ENGL 109", "You will learn about different forms of academic writing, as well as the processes that great writers engage in to create their best work.", "Even programs like engineering, or accounting, or geography include major writing assignments, especially in upper years, in part because they recognize that careers in those fields require far more writing than students might expect.", "Because we value learning as a social activity, and thus recognize that writers and readers learn from one another, much of your work in English 109 will involve different kinds of collaboration with your peers.", "think critically and communicate effectively;", "These quick interactive elements provide opportunities to test your understanding of course concepts but are not graded.", "Standard of Work", "Every member of this course—instructors as well as students—has rights and responsibilities to ensure a pleasant and productive experience for all.", "Online Etiquette", "Exemptions from late penalties can only be given where there are significant extenuating circumstances.", "Intellectual property includes items such as:", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 40, "course_code": "ENGL 101B", "course_name": "ENGL101B - Introduction to Rhetorical Studies (0.50)", "term_name": "List 2", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Introduction to Rhetorical Studies Winter 2025", "Instructor: Sonia Ayesha Zafar", "sa2zafar@uwaterloo.ca", "View requirements for ENGL 101B", "The systematic study of effective communication—the art of rhetoric—dates back at least to the epics of Homer and flourishes today in countless academic disciplines and fields of business.", "Students will leave the class with a firm grasp of basic concepts of rhetorical theory, a sense of the history of rhetoric, and a deeper appreciation for rhetoric as an inventive, critical, multimodal, and multidisciplinary enterprise—what Quintilian calls an “encompassing art” (ars circumcurrens).", "Define basic rhetorical concepts", "Describe the historical scope of rhetoric", "Appreciate rhetoric as an inventive, critical, multimodal and richly interdisciplinary enterprise", "Intellectual property includes items such as", "This course includes the independent development and practice of specific skills, such as collecting, synthesizing, and analyzing information; developing and practicing writing skills; and creative expression.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 41, "course_code": "ENGL 108B", "course_name": "ENGL108B - Global English Literatures (0.50)", "term_name": "List 2", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["ENGL 108B", "04:00PM - 05:20PM", "Email: pugor@uwaterloo.ca", "View requirements for ENGL 108B", "In the contemporary era of expansive international economic and cultural connections now known as globalization, literature also holds an important place in the flow of global political-economic and cultural ideas and networks.", "As new ways emerge of delivering literature to readers worldwide, literary scholars are beginning to examine the impact that these works have on global culture and the ways that cultures can, and have transformed the world, especially by offering us new insights into other forms of human experience.", "Drawing from both writers and filmmakers from different regions of the world, we will examine how modern cultural producers capture the intricacies of our globalized world and how their works circulate within that world to find their own audiences.", "Our study of global English literatures aims to demonstrate how that genre functions as a powerful cultural tool for understanding globalization.", "Week One: Introduction: Setting the Scene", "Weeks Three & Four: Environmentalism in African Literature", "Racial Discrimination and Psychopathology", "Week Eleven: The American Prison Industrial Complex and Bio-politics", "April 1st: Group Presentations, A & B", "April 3rd: Group Presentations, C & D", "Students should be aware that when they access the electronic components of this course, private information such as first and last names, usernames for the ISU e-mail accounts, and program affiliation may become apparent to all other students in the same course.", "This policy protects confidentiality and confirms the identity of the student.", "Take as much care with your email communications as you do with written assignments.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 42, "course_code": "ENGL 108D", "course_name": "ENGL108D - Digital Lives (0.50)", "term_name": "List 2", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Email: c23marti@uwaterloo.ca", "An examination of how digital communication technologies create and promote online identities and social spaces, as well as interpersonal and communal interactions.", "View requirements for ENGL 108D", "How do the technical affordances of online spaces shape the way we use them?", "Analyze the socio-cultural, technological and ideological systems that shape the digital world, and shape us in turn.", "Apply core concepts of new media theory to your own digital life, improve your informational awareness and engage critically with digital culture.", "The Emergence of the Digital World Pt 2 Curtis, Hypernormalization", "Shrinking Frontiers: Digital Platforms and Corporate Consolidation", "Dijck, Platform Society", "Values at Play", "Week 7 AI Slop, Grifter Gurus and Memecoin scams: Digital Life in the Post-truth era   TBD Digital Artifact Analysis Due", "Critical Digital Media Analysis 15%", "This course includes the independent development and practice of specific skills, notably those involved with written communication, critical thinking and analysis, independent research and oral presentation.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 43, "course_code": "ENGL 119", "course_name": "ENGL119 - Communications in Mathematics and Computer Science (0.50)", "term_name": "List 2", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["Notice of Recording", "ENGL 119: Communications in Mathematics and Computer Science Winter 2025", "10:00AM - 11:20AM B2 350", "Technical Support: If you experience a technical issue in LEARN, then email learnhelp@uwaterloo.ca", "This course aims to build students' oral and written communication skills to prepare them for academic and workplace demands.", "Working independently and in collaboration with others, students will analyze and produce various written and spoken forms of communication.", "View requirements for ENGL 119", "COURSE DESCRIPTION AND DESIGN", "Design:", "Demonstrate critical thinking, reading, and writing skills;", "Research, cite, and produce written communications on STEM-related topics;", "(At the time of writing this note, there is also a second option of printing a poster via the Waterloo Public Library—Eastside Branch, which has a large-format printer [", "The content and instructions for each knowledge check will be revealed in class on the specified due date.", "The knowledge checks will require students to apply or discuss what they have learned in each unit, drawing on the course materials in their answers, and completing them by the end of the class session.", "In essence, students can choose between two options: either write a traditional speech and record a simple video of themselves delivering it while standing up OR write a podcast-style script and record a video of themselves sitting down that incorporates some creative elements too (e.g., free music clips, visual aids, or other engaging features).", "Notice of Recording", "Notice of Recording", "Major assignments submitted late may incur a penalty of 2 marks deducted (e.g., as a general example, a grade of 19/25", "Assigned Letter Grades Percentage Values Average Calculation Values", "A 85–89 89", "Exceeds Expectations: A numeric grade in the 80–100% range corresponds to the A-level and indicates that the quality of the student’s work exceeds standard expectations for the major assignment.", "Meets Expectations: A numeric grade in the 70–79% range corresponds to the B-level and indicates that the quality of the student’s work meets standard expectations for the major assignment.", "Misses Expectations: A numeric grade in the 50–59% range corresponds to the D-level and indicates that the quality of the student’s work misses standard expectations for the major assignment.", "Exceptions will be considered on a case-by-case basis to ensure fairness and consistency, but there is no guarantee that a student’s circumstance will be considered extenuating/unforeseen and warrant such an accommodation.", "Please be aware that GenAI is known to falsify references to other work and may fabricate facts and inaccurately express ideas.", "On-campus supports:", "Off-campus supports:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 44, "course_code": "ENGL 208B", "course_name": "ENGL208B - Science Fiction (0.50)", "term_name": "List 2", "program_name": "Degree Requirements", "program_id": 45, "major_id": 6, "major_name": "Bachelor of Mathematics Degree Requirements", "topics": ["ENGL 208B", "11:30AM -", "Some attention will be given to the historical development of the genre.", "View requirements for ENGL 208B", "This course teaches the forms of science fiction present in modern science fiction and science fiction throughout history, in literature and other media forms.", "What purpose does science fiction serve in our lives?", "In particular, we will center on three subgenres of science fiction, aliens, robots, and time travel, to examine how and why science fiction creators and science fiction fans keep returning to these ideas.", "critically investigate and discuss major examples of science fiction literature and other works", "appreciate and apply some critical and theoretical approaches of science fiction to sf-based texts", "understand and communicate some of the history behind science fiction as a genre and form", "recognize how sf presents itself in different media, and how it contains its own subgenres and influences", "propose and carry out a critical investigation of a well-ordered argument concerning a given research topic regarding sf literature", "Introduction", "Alien invasions and colonialism", "First Contact stories", "Robots in older science fiction “Super-Toys Last All Summer Long” Brian Aldiss (Feb 3/4)", "“Incarnation Day” Walter John Williams (Feb 12/13)", "First Essay", "Science Fiction and games", "Netflix subscription for one month (for watching various programs in March)", "The participation mark will also be a measure of participation in classroom discussions.", "Attendance -- I will be keeping track of attendance, and using it to gauge leeway when it comes to extensions and other such issues.", "So for example, if you miss four classes, you should post a response to the exercise from the lecture for one of those classes.", "Participating as above is the basic requirement of the class and if your participation is not making this standard I will check in with you and let you know how to bring them up to that standard.", "In terms of response, I'm just looking for what you found interesting about the text.", "The posts are due 11:59 pm the day before the class in question—but if you'd like to submit them earlier, so I can incorporate them into the lecture sooner, that would be great.", "I'll be creating a post for week 1's second class, so you can get a sense how they're done.", "First Essay", "Second Essay", "There are still a lot of ethical and legal issues regarding generative AI that are in the process of being settled.", "I expect to see a lot of work in editing and expanding in any AI-assisted efforts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 0, "course_code": "CHEM 120", "course_name": "CHEM120 - General Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry 1 Winter 2025", "RCH 101", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "The second part of this course is concerned with explaining periodicity and trends in chemical reactivity in terms of the electronic structure of atoms and molecules.", "Topics covered in this part of the course include the quantum theory of the hydrogen atom; electron configurations in multi-electron atoms; ionic and covalent bonding; Lewis structures, valence shell electron repulsion theory and molecular geometry; quantum mechanical bonding theories, including valence bond theory and molecular orbital theory.", "Additional topics may include an introduction to electron-transfer reactions, including the assignment of oxidation states and the balancing of oxidation-reduction reactions.", "assess the greenness of a chemical reaction using Atom Economy and E-Factor metrics.", "describe the electronic structure of atoms in terms of quantum theory using atomic orbitals and quantum numbers.", "justify the organization of the periodic table and predict trends in the properties of the elements.", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and explain molecular shape and stability in terms of electron count.", "describe the interactions of molecules in solids, liquids, and gases to compare physical and reactive properties.", "Course Structure and Continuity Plans", "No extensions will be granted for Participation Challenges, but each student can drop one participation challenge from their overall grade.", "Printed spiral bound copies of the course notes can be purchased online from the UW bookstore https://wstore.uwaterloo.ca/", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare pandemic-related illnesses on Quest (Information at this link)", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 1, "course_code": "CHEM 120L", "course_name": "CHEM120L - General Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 1 Fall 2024", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Be sure to record their name and contact information in your lab manual.", "Skillfully perform basic procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "1,3,5,7,9,11", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Sept 19 - 24", "1,3,5,7,9,11", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "1,3,5,7,9,11", "- studying cis and trans isomers", "Oct 24-29", "1,3,5,7,9,11", "Titration as an Analysis Tool", "- identify an unknown solid acid", "1,3,5,7,9,11", "Introduction to Chromatography", "- quantify a cation using ion exchange", "1,3,5,7,9,11", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 2, "course_code": "CHEM 123", "course_name": "CHEM123 - General Chemistry 2 (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry 2 Winter 2025", "09:30AM - 10:20AM STC 1012", "Introduction to chemical equilibria.", "Describe the energy and entropy changes that accompany physical and chemical changes.", "Calculate the equilibrium constant for a reaction using the standard thermodynamic properties of reactants and products.", "Predict the direction of spontaneous change for a given set of initial conditions for a variety of chemical systems.", "Apply equilibrium principles to a variety of chemical reaction types including gas-phase reactions, acid-base reactions, precipitation reactions, complexation reactions and redox reactions.", "Analyze oxidation-reduction reactions and identify species being oxidized and reduced.", "Explain the basic construction of, uses of, and the differences between galvanic and electrolytic cells.", "CHEM 120 and CHEM 123 comprise a full-year course in introductory chemistry.", "Course Structure and Continuity Plans", "Chemistry Study Hall:  Starting the 2nd week of classes, there will be a first-year study hall on Tuesdays and Thursdays at 5:30 pm - 6:50 pm in STC 1012.", "You can attend as many Study Hall Sessions as you would like - grab your friends and connect with your TAs!", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 3, "course_code": "CHEM 123L", "course_name": "CHEM123L - General Chemistry Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 2 Winter 2025", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- a real life analysis", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 4, "course_code": "EARTH 121", "course_name": "EARTH121 - Introductory Earth Sciences (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Earth Sciences Fall 2024", "Students will learn to think like a geoscientist by adopting four ways of thinking that take into account a systems approach, a variety of spatial and temporal scales, and field thinking.", "Recognize the dynamic nature of Earth through an examination of the interactive components of the Rock Cycle.", "Extrapolate meaning from everyday geologic material and predict occurrence and origin.", "Week 1: Introduction and Four Ways of Thinking 1a and 1b Discussion: Introduce Yourself", "Week 2: Introduction to Rocks 2a Field Notes Journal 2: Are minerals important?", "Week 3: Introduction to the Rock Cycle 2b Field Notes Journal 3: What do you see in the video?", "Week 4: Introduction to the Rock Classification 2c Field Notes Journal 4: Is this depiction of the Rock Cycle complete and accurate?", "Week 5: Geologic Time and Geologic Time Scale 3a and 3b Field Notes Journal 5: How do I create a simplified Geologic Time Scale?", "Please note emails can be received 24 hours per day", "Short-term Absence", "Covid-19-related Absence", "Intellectual property includes items such as:"]}, {"course_id": 5, "course_code": "EARTH 121L", "course_name": "EARTH121L - Introductory Earth Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Earth Sciences Laboratory Fall 2024", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Email: keith.delaney@uwaterloo.ca", "Sahar Soltani - sahar.soltani@uwaterloo.ca / LABS 001 & 003", "By far, the majority of people qualified as geologists spend their time using their knowledge working 'in the field', or in exploration, putting principles learned in theory and in the laboratory, into practice.", "Identify common mineral and rocks based on their identification properties", "Understand the rock cycle and how minerals and rocks are formed", "Understand the theory of plate tectonics and how it has shaped the Earth's surface over time", "Qualitatively and Quantitatively describe earthquakes and some of their processes", "Read and interpret data from both topographic and geologic maps", "Understand the immense history and geologic record of our planet", "Understand the factors influencing climate change and quantify how the planet is changing", "Will assess Mineral and Rock Identification knowledge with real samples.", "Lab 8 Earth Structures", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "Situation where VIFs are not Appropriate"]}, {"course_id": 6, "course_code": "EARTH 122", "course_name": "EARTH122 - Introductory Environmental Sciences (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Environmental Sciences Winter 2025", "08:30AM - 09:50AM STC 1012", "I hold a PhD in Earth & Environmental Sciences from the University of Waterloo (2014) and an HBSc in Earth & Environmental Sciences from McMaster University (2006).", "You might notice I'm looking pretty pregnant!", "I'm conveniently due on April 27 BUT in the unlikely even that I have a baby really early, the excellent Dr. Keith Delaney (who has taught this class for many years) will step in at the end.", "Discussions", "Questions of a personal nature", "Office: EIT 2051D (very back of Earth & Environmental Sciences main office)", "Email: msrosamo@uwaterloo.ca", "Grad TA contact info can be found in the EARTH 122L syllabus.", "Course topics include sustainable development and the availability and use of natural resources, principles of ecology and environmental science, biogeochemical cycles, climate and climate change, soils and food supply, energy systems, surface water and groundwater, waste generation and management, pollution, and catastrophic natural processes.", "Describe common global environmental issues and the role of environmental science in identifying, understanding, and solving these issues.", "Interpret and manipulate simple box models of environmental systems", "Interpret scientific diagrams and graphs pertaining to environmental science", "1 January 06 - 10 Intro to Environmental Science & Matter, Energy and Physical Environment Chps 1 & 2", "2 January 13 - 17 Earth Systems/Ecosystems & Evolution, Biodiversity, Population Ecology Chps 3 & 4", "3 January 20 - 24 Species Interactions/Community Ecology & Human Population Chps 5 & 6", "Soils & Soil Resources*", "8 February 24 - 28 Freshwater Systems/Water Resources & Marine, Coastal Systems, Fisheries Chps 11 & 12 Quiz 6 - Chapters 11 & 12 Content Mon. Mar 3  5:00PM 3", "10 March 10 - 14 Global Climate Change & Fossil Fuels: Energy Use/Impacts Chps 14 & 15", "Energy Alternatives & Mineral Resources & Mining", "Quiz 8 - Chapters 15 & 16 & 17 Content*", "12 March 24 - 28 Managing our Waste & Environmental Health Hazards Chps 18 & 19 Quiz 9 - Chapters 18 & 19 Content Mon. Mar 31 5:00PM 3", "A Look at Environmental Science and Natural Hazards & Final Exam Study Guide / Discussion", "following these guidelines: https://uwaterloo.ca/science-undergraduate-office/academic-policies-and-procedures/accommodation-illness-or-other-extenuating-circumstances."]}, {"course_id": 7, "course_code": "EARTH 122L", "course_name": "EARTH122L - Introductory Environmental Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introductory Environmental Sciences Laboratory Winter 2025", "EARTH 122L", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Sana Ahmad has a BSc degree in Honours Co-op Environmental Science with a Geoscience Specialization from the University of Waterloo.", "Discussions", "Questions of a personal nature", "Office: EIT 2046 (within the Earth & Environmental Sciences main office)", "Email: s76ahmad@uwaterloo.ca", "Please put EARTH 122L in your email subject line so I don't miss it!", "Please do not send them personal emails!", "View requirements for EARTH 122L", "Use GPS devices and GIS software to locate points of interest and create a map", "ALL LABS ARE HELD IN ROOM: EIT 1013 (ground floor of EIT  - same building as Earth Sciences Museum)", "8 February 24 - 28 Coastal Processes and Problems: Loving Our Coasts to Death?", "10 March 10 - 14 On-Campus Water Sampling and GPS Data Collection Field Sampling and Data Collection Lab around UW Campus", "13 March 31 - April 03 Landscape Geology: Glaciers and Deserts & Climate Change: Pleistocene Records, Milankovitch Cycles Lab 8: Landscape Geology and Climate Change End of Lab 7%", "Note used copies are also fine!", "The format of the final exam will be run digitally through the LEARN Quiz system in the last week of the course, not during the formal exam period.", "Notice of Recording", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "These can be completed digitally now!", "This official verification is necessary before any action can be taken and can be downloaded from the Health Services website.", "Situation where VIFs are not Appropriate", "Example citations:", "\"References"]}, {"course_id": 8, "course_code": "EARTH 123", "course_name": "EARTH123 - Introductory Hydrology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Dr. Rosamond is the International Lecturer for Water Sciences in the Department of Earth & Environmental Sciences at the University of Waterloo.", "She loves learning about water, especially nutrients and greenhouse gases in streams in rivers.", "Email: msrosamo@uwaterloo.ca", "Education", "2014 - PhD, Earth & Environmental Sciences, University of Waterloo, Waterloo, ON, Canada", "2006 - Honours BSc, Earth & Environmental Science (Sedimentology Specialization), McMaster University, Hamilton ON, Canada", "Philosophy of Teaching", "Dr. Rosamond's teaching philosophy focuses on (a) active learning techniques, including field and laboratory experience, and practical demonstrations in class, (b) building on the mathematical and chemical fundamentals in Earth Sciences.", "She is interested in adapting curricula to include experiential learning, focus on students' analytical skills, and to scaffold skills and concepts across courses in Earth & Environmental Sciences.", "Yizhi is a graduate student in Earth & Environmental Sciences at University of Waterloo, looking at groundwater contamination.", "Email: y278yuan@uwaterloo.ca", "The material is both qualitative and quantitative in nature and focuses on the circulation of water through the atmosphere, soil, groundwater aquifers, as well as looking at both the global fresh and marine water systems.", "Emphasis is placed on the physical aspects of hydrology, and the geologic and environmental factors that control the occurrence and cycling of water on Earth, as well as the impacts caused by population growth, contamination, urbanization or land use management, and climate change.", "View requirements for EARTH 123", "Describe the complexity and inter-connections of the global hydrological cycle;", "Apply basic qualitative techniques for describing earth systems processes related to water and water movements;", "Create and critique a simple water balance equation for a lake, river, or groundwater system;", "Introduce Yourself &", "All times are in China Standard Time.", "December", "Can be purchased through e-book sellers.", "These are a mix of multiple choice, matching, and mathematical questions.", "Surveys", "Discussions", "Notice of Recording", "We will assess what to do on a case-by-case basis."]}, {"course_id": 9, "course_code": "EARTH 221", "course_name": "EARTH221 - Introductory Geochemistry (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "EARTH 221", "EARTH 221 001", "EARTH 221 101", "RCH 306", "My PhD was completed in 2014 in nitrogen cycling and use of stable isotopes to understand N cycling in the Grand River, Ontario.", "EARTH 221:", "Introduction to environmental isotope geochemistry and radiometric dating.", "Basic aqueous geochemistry: pH, carbonate equilibrium, and common ions in natural waters.", "View requirements for EARTH 221", "Calculate basic geochemical parameters and create associated diagrams", "Identify applications of geochemistry for environmental problems/studies", "Present and discuss geochemical scientific literature", "Please read slides for Intro, element abundances, isotopes, chart of the nuclides, nucleosynthetic processes", "Highlights of Origin of Elements", "Periodic Table/Earth Formation", "Solar System geochemistry and planetary formation, composition of meteorites", "Chemistry of bulk Earth, atmosphere, oceans, crust, mantle, and core   A2 Misra p. 296 – 313, 326-344, 354-362", "Equilibrium constants, introduction to phase diagrams, basics of kinetics", "Basic concepts, laws of thermodynamics, Gibb's free energy.", "Igneous rock geochemistry", "A4 Misra p. 226 –  240, 310-313", "Introduction to Geochemistry.", "This grade includes:", "In groups of 4, you will present the findings of a recent scientific paper that includes some geochemistry.", "It is a closed book test.", "Typical question types may be multiple choice, interpreting diagrams, explaining concepts, and doing calculations (equations provided).", "Equations are provided and you should definitely bring a calculator.", "Notice of Recording", "Extensions and Accommodations", "Extensions and other accommodations will only be considered on a case-by-case basis.", "You are taking full responsibility for AI-generated materials as if you had produced them yourself: ideas must be attributed and facts must be true.", "In reference list:", "URL of the platform where the conversation took place]."]}, {"course_id": 10, "course_code": "EARTH 223", "course_name": "EARTH223 - Field Methods in Hydrology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrology Fall 2024", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "This course consists of field exercises and lectures designed to provide students with practical hands-on experience conducting a variety of hydrological monitoring techniques.", "This course is designed to provide hands-on field experience in the use of standard hydrologic monitoring techniques.", "The main objectives of this course are to use a variety of hydrologic data collection techniques in practical settings to answer hydrologic questions, identify the difficulty and importance of collecting good field data, and determine the accuracy/error of different measurement methods quantitatively and qualitatively.", "A Module will consist of two elements: (1) an activity in the field and (2) lecture and tutorial to review the fundamental concepts and discuss the data collected in the field.", "During each activity you will be working in groups of ~4.", "Assessment for each Module will consist of a pre-activity quiz administered on LEARN and an assignment that must be completed individually and uploaded to LEARN.", "Interpret the data in a hydrological context to explain groundwater/surface-water interactions, quantify water balances, and understand sources of contaminants found in water.", "Explain how drinking water in the Region of Waterloo is obtained, managed, and treated to ensure a safe and adequate supply.", "A Module will consist of two elements: (1) an activity in the field and (2) lecture and tutorial to review the fundamental concepts and discuss the data collected in the field.", "During each activity you will be working in groups of ~4.", "Assessment for each Module will consist of a pre-activity quiz administered on LEARN and an assignment that must be completed individually and uploaded to LEARN.", "Field Class Field Class Field Class Field Class", "Introduction (complete online)", "Sept 23**", "Sept 23**", "Sept 25**", "Sept 25**", "Oct 14**", "Oct 14**", "Oct 16**", "Oct 16**", "Oct 28**", "Oct 28**", "Oct 30**", "Oct 30**", "-", "Nov 25**", "-", "Nov 25**", "-", "-", "* complete virtually on your own", "***If possible", "These videos are designed to prepare you for the upcoming field activity and must be completed prior to the scheduled field activity time.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Must be uploaded as a single file", "Notice of Recording", "The field work is a critical part of this course and often you will be working in teams and so your lack of attendance may also result in some hardship for your group.", "You must be present for each field activity in order to get full credit for that activity  – unexcused absences will result in a 20% penalty for each missed field activity.", "For this reason, all students must complete WHMIS (Workplace Hazardous Materials Information System training) module before their first field activity session and provide proof of their training by uploading a picture of their form to DROPBOX.", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline).", "The policy can be found at: http://www.adm.uwaterloo.ca/infosec/Policies/policy33.htm", "Note on Avoidance of Academic Offences: Studying and working in groups to learn material can be a very valuable practice and is encouraged.", "Library for research-based assignments", "Strategies for learning online", "6 strategies for effective learning"]}, {"course_id": 11, "course_code": "EARTH 231", "course_name": "EARTH231 - Mineralogy (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "EIT 1013", "This course provides a systematic study of the physical and chemical properties of the major rock-forming silicate minerals.", "Study of mineral chemistry, the internal geometry of crystalline solids and the interrelationship of crystal structure to the physical and chemical properties of minerals.", "Laboratory work focuses on observing and evaluating the physical properties of minerals and rocks in hand sample in order to identity them.", "This course includes a weekend field trip to Bancroft, Ontario.", "During lectures you will develop a theoretical understanding of the physical and chemical properties of minerals, both as discrete solid phases and as members of mineral assemblages.", "The field trip will be a two day trip stopping at various field sites to look at rocks and minerals in and around the Bancroft area.", "Develop a theoretical understanding of the physical and chemical properties of minerals, both as discrete solid phases and as members of mineral assemblages", "During labs you will get hands-on experience observing, describing, and identifying rock and mineral specimens", "EIT 1013", "Course introduction/ Introduction to minerals", "Introduction to minerals: Con’t", "Lab 3 – Group meet up/contracts and Metamorphic Minerals", "Mineral chemistry", "Structure part 3: Classification of silicate structures", "Oct. 21", "Bancroft sample ID lab", "***midterm in class Thurs Oct 24***", "Digital Submission: Preliminary Group Report and sample ID chart", "Amphiboles", "Micas", "Students can find the Illness Self-declaration form in the Personal Information section of Quest.", "If the midterm is missed, a make-up midterm will be scheduled when appropriate by the instructor.", "Re-creating test questions and answers without the express permission of the course instructor", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "Everyone needs a support system.", "This resource lists includes general campus resources, as well as those focused on EDI-R and mental health.", "Sexual Violence Prevention & Response Office: https://uwaterloo.ca/sexual-violence-prevention-response-office", "An extensive list of campus resources can be found here: https://uwaterloo.ca/graduate-studies-postdoctoral-affairs/current-students/campus-resources-and-services", "Non-emergency Waterloo Regional Police Services - 519-653-7700"]}, {"course_id": 12, "course_code": "EARTH 232", "course_name": "EARTH232 - Introductory Petrography (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["EARTH 232", "DWE 1515", "B. Kendall", "08:30AM - 11:20AM EIT 1009", "EARTH 232 102", "08:30AM - 11:20AM EIT 1009", "Introduction to silicate phase equilibria and the use of mineral stability diagrams to understand petrogenetic processes.", "Laboratory work focuses on using a transmitted light microscope to study the optic properties of minerals in order to identify them as well as observe rock textures and interpret geological histories.", "View requirements for EARTH 232", "Describe how magmas form and evolve to produce a variety of common igneous rocks", "Show how the different agents and types of metamorphism lead to the formation of common metamorphic rocks", "Understand how to use simple phase diagrams to interpret the geological history of a rock", "Use mineralogy and texture to interpret the geological history of a rock", "Identify and describe minerals and textures using a petrographic microscope", "Classify igneous, sedimentary, and metamorphic rocks", "Relate common rock associations to plate tectonic settings", "Introduction", "Igneous: Magma Differentiation", "Igneous: Binary Solid Solution Phase Diagrams", "Igneous: Binary Eutectic & Peritectic Phase Diagrams", "Igneous: Ternary Phase Diagrams", "Igneous: Classification & Occurrence", "Igneous: Classification & Occurrence", "Metamorphic: Zones and Facies", "Metamorphic: Phase Diagrams", "Metamorphic: Classification and Occurrence", "Sedimentary: Classification & Occurrence", "Sedimentary: Classification & Occurrence", "Textbook: Earth Materials - Introduction to Mineralogy and Petrology, 2nd Edition.", "Cornelius Klein and Anthony Philpotts.", "Textbook: Introduction to Optical Mineralogy, 4th Edition.", "On reserve in Davis Library - 3 hour loan.", "Textbook: Principles of Igneous and Metamorphic Petrology, 2nd Edition.", "Each rock type can only be claimed by one student.", "Final Exam: The closed-book final exam will be in-person and scheduled by the registrar.", "This course includes the independent development and practice of specific skills, such as synthesis and poster presentation of information on a student's chosen rock type, and laboratory mineral and rock descriptions.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office: https://uwaterloo.ca/sexual-violence-prevention-response-office", "An extensive list of campus resources can be found here: https://uwaterloo.ca/graduate-studies-postdoctoral-affairs/current-students/campus-resources-and-services", "Non-emergency Waterloo Regional Police Services - 519-653-7700", "St. Mary's Hospital - 519-744-3311", "Kitchener-Waterloo Sexual Assault Support Centre - 519-741-8633", "Stratford General Hospital - 519-272-8210", "EDI-R STATEMENT"]}, {"course_id": 13, "course_code": "EARTH 235", "course_name": "EARTH235 - Stratigraphic Approaches to Understanding Earth's History (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["08:30AM - 09:50AM EV2 2002", "jwjohnston@uwaterloo.ca", "10:00AM -", "jwjohnston@uwaterloo.ca", "10:00AM -", "jwjohnston@uwaterloo.ca", "Department of Earth and Environmental Sciences in the Faculty of Science @UWaterloo.", "At the University of Waterloo, Dr. Johnston teaches numerous classes such as Earth 121 - Introductory Earth Sciences, Earth 235 - Stratigraphic Approaches to Understanding Earth's History, Earth 390 - Methods in Geological Field Mapping, and occasional graduate classes such as Earth 691 Special Studies for MSc Students (i.e. Coastal Geology).", "He is a board member for the University of Waterloo Earth Science Museum and representative for the Geological Association of Canada on the North American Commission on Stratigraphic Nomenclature (former chair and vice chair).", "Discussions", "Email", "But please indicate the course name and number and reason for the email in the subject line.", "An introduction to stratigraphic principles and methods used in deciphering geological history.", "Techniques of collecting surface and subsurface geologic data and representation of stratigraphic data.", "Procedures applicable to the classification and nomenclature of stratigraphic units using the North American Stratigraphic Code.", "The development of stratigraphic sequences as controlled by global and regional tectonics and sea level fluctuations.", "Laboratory work will include construction and interpretation of various types of learning media such as traditional maps, cross sections, new physical and digital models, as well as extended reality.", "Describe and illustrate perspectives and applications of stratigraphy.", "Understand and apply the classification and nomenclature of stratigraphic units.", "Debate preservation potential though space and time.", "Professional Geoscientists Ontario - Student Member", "The level of geoscience education in a bachelor of science degree is considered to meet the minimum knowledge requirements recommended by Geoscientists Canada for admission to practice professional geoscience and for interprovincial (and international) mobility.", "Readings", "Week 1: Introduction and Collecting Geologic Data", "Module 1: Introduction Earth 235 Course Outline", "Introduce Yourself Discussion", "1c Field Techniques", "1d Field Notebook", "Module 4: Facies and Correlation 3a Facies", "3b Correlation", "Module 5: Introduction to the Stratigraphic Code (and Lithostratigraphic Chart for southern Ontario page) 4a", "Week 7: Canada's Structures and Introduction to Sequence Stratigraphy", "Module 10: Introduction to Sequence Stratigraphy 7a Sequence Stratigraphy", "Week 8: Relative Time and Absolute Dating and Age of the Earth", "Module 12: Absolute Dating and Age of the Earth", "Therefore, Dr. Johnston has compiled a unique set of readings from a variety textbooks and online sources.", "Instructions", "A complete set of labs is provided in Learn for each student to complete and then submit to the Learn Dropbox.", "Please follow these steps for each lab:", "Note: Labs are expected to be submitted in a well-organized, neat and legible fashion.", "Deliverables", "Your lab assignment must be submitted in the following file type:", "Most word processing software applications will allow you to save your file as a PDF; however, if you require software to create PDFs, some free options are listed below:", "Email subject line must include the course number and code and name of the assessment.", "Please email the entire EARTH 235 Team, including the TAs and your instructor to inform the entire Team and receive a prompt response.", "Please make sure you are registered with AAS first", "Intellectual property includes items such as:"]}, {"course_id": 14, "course_code": "EARTH 238", "course_name": "EARTH238 - Introductory Structural Geology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Structural Geology Winter 2024", "EARTH 238", "03:30PM - 04:20PM", "EARTH 238 201", "changcheng.li@uwaterloo.ca", "EIT 1013", "changcheng.li@uwaterloo.ca", "EARTH 238 102", "EIT 1013", "changcheng.li@uwaterloo.ca", "*", "Discussions", "To the teaching team: This is a discussion topic for you to give suggestions to the teaching team and for them to know the questions you have.", "Concepts of stress and strain; elementary rock mechanics; description and classification of folds, faults, foliations, lineations and joints; use of primary structures; introduction to geometrical analysis.", "Labs will emphasize geometrical problems, including geological maps and cross sections, and stereographic projection.", "Understand the process in which various geological structures develop", "Perform kinematic analysis from some simple structures", "Record orientation data in the right format according geological convention", "Read a geological map and draw cross sections base on the map", "Use an equal-area net to conduct geometrical analysis", "iClicker Students can use either iClicker student App or iClicker remote Yes", "Basic Methods of Structural Geology.", "Students have to answer a question in a quiz correctly to get the mark.", "Examination regulations as outlined in the current UW undergraduate calendar are to be followed."]}, {"course_id": 15, "course_code": "EARTH 260", "course_name": "EARTH260 - Introductory Applied Geophysics (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrogeology Fall 2024", "08:30AM - 09:50AM DWE 3519", "An introduction to the principles and theories of mineral deposit genesis.", "Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered.", "View requirements for EARTH 458L", "Applied geophysics provides geoscientists with a wide-range of non-invasive methods for characterizing the Earth's interior.", "This course is an introduction to the physical principles underlying field acquisition, processing, and data interpretation for commonly used applied geophysical techniques (seismic, electrical, electromagnetic induction, gravity, and magnetic methods).", "This course is not only pertinent for geoscientists but also for engineers and others interested in learning how physics can be used to explore the Earth's interior or perform non-destructive testing.", "Near-surface geophysics is used to characterize the shallow subsurface for a wide-spectrum of applications.", "This application-oriented course covers current methodology in near-surface geophysics, including electrical, electromagnetic, ground penetrating radar, seismic refraction, and well-logging methods.", "Techniques for geophysical data acquisition and interpretation are studied and applied to field data.", "Examples of the application of geophysical techniques to archeological, forensics, geotechnical, glaciology, and hydrogeological problems are examined.", "View requirements for EARTH 461", "A field-oriented course on current methodology in the general area of geotechnical or engineering geophysics as applied to environmental problems.", "Typical topics covered: well logging and time domain electromagnetic surveys for groundwater supply; magnetic and terrain conductivity surveys for waste materials; ground penetrating radar applications to stratigraphy and contamination; streaming potential surveys of dam leakage.", "A pre-lab quiz must be completed before attending each field lab.", "Labs will be completed in groups with field data recorded in field books or datasheets.", "These data will be used to a complete individual lab assignment.", "This site contains over 100 groundwater monitoring wells.", "Field lab activities involve:", "(3) Measurement of in-situ hydraulic conductivity using single-well response tests", "Each lab will provide you with a unique dataset that you will use to develop a conceptual site model of the local groundwater flow system.", "• Properly construct and interpret soil core logs using United Soil Classification System, and make lithostratigraphic interpretations using geophysical logs", "• Assess and interpret water level measurements through the construction of water table maps and flownets", "• Interpret single-well response tests including falling and rising head (slug) tests to determine in-situ hydraulic conductivity", "• Interpret hydraulic pumping tests to determine aquifer transmissivity and storage parameters and assess water resource vulnerability", "Each module will contain a series of recorded lecture slides and video demonstrations reviewing core concepts and guidelines for the upcoming field lab.", "Please include “Earth 458L” in the subject line of all e-mail communications as well as your Full Name and Student ID# in the text of the email.", "Hydrogeological equipment to make measurements and collect data (temporary use)", "Specialized hydrogeological software to complete certain assignments", "Datasheet to record field data", "Other data should be recorded in your field books and distributed to your group members as needed.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Notice of Recording", "Participation in Field Labs:", "These quizzes are designed to keep you on schedule and prepare you for the in-person field lab and assigned activities.", "There will be a 48-hour grace period to finalize the submission of your assigned activities without incurring any late penalty."]}, {"course_id": 16, "course_code": "EARTH 333", "course_name": "EARTH333 - Introductory Sedimentology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["04:00PM - 05:20PM", "RCH 204", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Students can expect a response within 48 hours from Monday to Friday.", "TAs will also be available during in-person laboratory sessions.", "An introduction to sediment properties, sedimentation processes, and sedimentary deposits in a variety of depositional environments and climatic conditions.", "View requirements for EARTH 333", "Know the main principles, concepts and approaches pertaining to the study of sediments and sedimentary rocks", "Know the main modern sedimentary environments", "Interpret past sedimentary environments from the sedimentary record", "Appreciate societal relevance of sedimentology and know some of the possible applications", "Sedimentology and Stratigraphy, 2nd edition / Gary Nichols Electronic course reserve.", "Principles of Sedimentology and Stratigraphy, 5th edition / Sam Boggs Course reserve.", "A team rep must inform their TA of the team members and team name.", "Dropbox folders with limited access will be created for each team and linked to the gradebook.", "Penalties for late submissions:", "Weekends and holidays will not count when determining a late submission penalty"]}, {"course_id": 17, "course_code": "EARTH 355", "course_name": "EARTH355 - Water: Data to Decisions (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["EARTH 355 - Water: Data to Decisions Winter 2025", "EARTH 355", "11:30AM -", "Please put \"Earth 355\" and issue in your email subject line.", "This course explores approaches for interpreting environmental data to support water decisions using theoretical and computational techniques.", "View requirements for EARTH 355", "In addition, approximately one case study will be provided each week as reading material with an instructor led discussion during this time.", "By the end of this course, you should be able to design a study to test a scientific hypothesis by:", "Identifying relevant statistical techniques", "Assessing results of statistical techniques to form a conclusion (using hand calculations & coding language)", "Acknowledging data uncertainty in statistical and mechanistic water models", "Compiling Data", "Identify and frame decisions", "Identify data requirements for making the decision", "Develop a database of the data", "Drinking Water Advisories in Nine First Nations in Ontario", "Compiling your Dataset", "Introduction to Jupyter Notebook and R", "Poster Development", "Context and Hypothesis", "Descriptive Statistics", "Develop tabular and graphical representations of data", "Calculate central tendency and variance in a variety of ways", "Identify when log transforms should be used for central tendency", "Calculate a z-score and explain what it means", "Environmental Flows and Minimum Desirable Streamflows", "Data Structure, Descriptive Statistics & Histograms", "Poster Development", "Introduction (literature review)", "&", "Calculate confidence intervals", "Calculate interval estimates", "4: Aggregate Development", "4: Plotting Univariate Data and Extracting information from Plots", "Poster Development", "3 & 4: Introduction and Data Presentation", "Define a hypothesis", "Test a mean", "Differences between two groups of data", "Estimating Risks from Exposure to Methyl mercury", "Functions and Confidence Intervals", "Poster Development", "Data and Methods", "Analysis of Frequency Data", "Test a hypothesis using χ2 test", "Assessing Relationships and Associations", "Loops and Hypothesis Testing", "Poster Development", "Data and Methods", "Identifying Temporal Trends", "Intensification of Algal Blooms", "Temporal patterns and probability of occurrence", "Plotting Categorical Data and the Chi-Square Test", "Poster Development", "Data and Methods", "Perform a nearest-neighbour analysis", "Nearest neighbor", "Local averaging", "Inverse distance weighting", "Explain the concept of kriging", "Identifying Spatial Trends", "Water contamination and cancer clusters", "Spatial patterns and interpolation", "Loading R packages, Plotting Bivariate Quantitative Data, and the Runs Test", "Poster Development", "Submit draft poster", "Spatial Mapping, Quadrat Analysis, and Nearest-Neighbor Analysis", "Poster Development", "Correlation Analysis & Regression Analysis", "Calculate Pearson product moment correlation coefficient (R)", "Calculate a simple linear regression using least squares criterion", "Describe how multiple regression analyses are different from single linear regression", "Correlation", "Correlation and Linear Regression", "Correlation and Regression", "Poster Development", "Methods and Results", "Trends & Fit Metrics", "Determine if a time series has a monotonic trend using Mann-Kendall or Sens Slope", "Identify appropriate fit metrics to assess data", "Trends", "Trends in baseflow across Canada", "Trends and Fit Metrics", "Poster Development", "Methods and Results", "&", "Introduction/Context - 15%", "Conclusions & Recommendations - 15%", "For the in-class activities, you will be given a worksheet to solve a problem related to the topic of discussion.", "The draft will be peer-marked using a rubric provided on LEARN.", "There will be one open question where you will be asked to discuss a perspective of one of the case studies we covered in class."]}, {"course_id": 18, "course_code": "EARTH 390", "course_name": "EARTH390 - Methods in Geological Mapping (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Methods in Geological Mapping Winter 2025", "jwjohnston@uwaterloo.ca", "These instructors co-teach this field-focused course and combine expertise to enrich this learning experience for all students.", "EMAIL", "But please indicate the course name and number and reason for the email in the subject line.", "Field study in Sudbury and Whitefish Falls areas.", "Geological and geotechnical field techniques, map construction, and report writing.", "View requirements for EARTH 390", "All online modules and quizzes and mapping exercise must be completed and submitted before leaving for the field portion of EARTH 390.", "This is to help prepare students for the field trip/work, establishing a common knowledge and skill base and field safety and etiquette.", "Students will also find that a Sedimentology course (Earth 333) will come in very useful, as we will be mapping in a metamorphosed sedimentary terrain.", "Part of this field experience is very special because students are given permission to map on Whitefish River First Nations (WRFN) land, an area of cultural significance to Indigenous Peoples and world-class exposure of rock.", "Observe and record a variety of different types of geological information in the field.", "Make decisions based on field observations.", "Construct a geological map using student collected field observations and measurement.", "Interpret geological maps.", "Professional Geoscientists Ontario - Student Member", "The level of geoscience education in a bachelor of science degree is considered to meet the minimum knowledge requirements recommended by Geoscientists Canada for admission to practice professional geoscience and for interprovincial (and international) mobility.", "An essential part of preparing for a fun and prosperous time in the field is learning and testing your knowledge before leaving for the field portion of Earth 390 in northern Ontario.", "This will help keep everybody safe and maximize learning in this unique field experience.", "Any student not completing these cannot attend the field portion of EARTH 390.", "The majority of student grades in EARTH 390 are assigned to the FIELD portion of this course.", "Let's have some fun combining and applying previously learned and new student knowledge and skills in EARTH 390!", "Igneous Rocks Quiz", "Structural Geology", "Structural Geology Quiz", "Geological Cross Sections", "Geological Cross Sections", "Health and Safety/Field Etiquette", "Health and Safety/Field Etiquette", "Emergency Situations and Mitigation Quiz", "Mapping Exercise", "Mapping Exercise", "Digital Geological Mapping Introduction to Digital Geological Mapping Technologies Monday, February 10, 2025 at 8:00 AM Thursday, March 27, 2025 at 4:00 PM Ungraded", "Online quizzes and mapping exercise are completed before the field trip/work.", "Regional geology exercises, local geology report and map, individual assessment and field notebook are completed during the field trip/work.", "Satisfactory completion of ALL ASPECTS of the course is required.", "Whitefish River First Nation", "Our active work toward reconciliation has involved deepening our relationship in Whitefish River First Nation community talks, visits in the field, a summary report describing land-based learning, student research, and University of Waterloo’s Earth Science Museum outreach programs in the WRFN Shawanosowe School.", "Equity and Inclusion", "This course includes the independent development and practice of specific skills in the geosciences.", "Library for research-based assignments"]}, {"course_id": 19, "course_code": "EARTH 436A", "course_name": "EARTH436A - Thesis Proposal (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["EARTH 436A", "EARTH 436A 001", "11:30AM -", "View requirements for EARTH 436A", "Thesis Course (Earth 436) provides an opportunity for students to design and conduct independent research under the supervision of a faculty member in the Department of Earth & Environmental Sciences.", "In the past years, a number of excellent research projects have been completed leading in some cases to award winning presentations at conferences and publications in peer-reviewed journals.", "Students must normally obtain a minimum mark of 75% in Earth 436A to be allowed to register in Earth 436B. For students who enroll in Earth 436A only, the scope of work will involve the selection of a scientific topic of interest, detailed review of several published papers on the subject and the development of a potential research project that would fill a gap in current knowledge on the subject.", "In Earth 436B, the remaining activities required to complete the research project are carried out based on the experimental design formulated in Earth 436A. The format and structure of the Final Research Report can be either a conventional thesis document or a journal manuscript.", "It involves oral communication either one on one or before groups both large and small and written communication, which involves preparation of maps, charts and 6 narrative reports with personal observations, analyses and reviews of your own new work and that of previous workers.", "While most of your work will be technical and reflect scientific rigor, you may be called upon to prepare shorter status and policy briefs for decision-makers, legal summaries and commentaries, mine stakes and resource claim descriptions, and other items, all of which require organized and well-reasoned clear writing.", "Students should familiar with and able to do the following at the end of this course: • plan and conduct independent and original research under the guidance of a research advisor • learn how to explore, organize, execute, share and disseminate the results of your own scientific questions and thoughts • acquire new practical research and analytical skills using data either collected by yourself in the field or assembled in the laboratory or information/data collected by someone else (often the faculty advisor) in a research environment that you would not have had a chance to do elsewhere in your program • learn discipline-specific protocols and procedures for addressing scientific questions and procedures and formats for reporting technical information according to discipline or sub\u0002discipline standards • acquire an appreciation for and basic skill level to organize, interpret, and identify relevance of new information and research results • understand how to organize, communicate effectively and clearly disseminate new information to peers and other professionals, both written and orally • know how to undertake self-assessment, and learn how to give and receive constructive review and critique by your peers", "DATE ACTIVITIES & DUE DATES  ATTENDANCE & GRADING", "No meeting", "23 September", "Applying for graduate school and applying for NSERC & other scholarships.", "Work on research design proposal", "No meeting", "Farvolden Day and Job Fair", "No meeting", "No meeting", "No meeting", "No Meeting", "Presentation Abstract:", "2 December No meeting Work on your project and final thesis design; Finish writing & Edit No meeting", "9 December", "No meeting", "No meeting", "FINAL RESEARCH DESIGN PROPOSAL 50%", "Many professors have a number of possible projects in mind.", "Topics involving co-advisors outside of the Dept. of Earth & Environmental Sciences must be approved by the Earth 436A instructor.", "Write a short summary of the project and include the objectives, context, methods and major findings in sentence form (~250 words max.)", "and then give a critique of the thesis in sentence form (~150 words max.).", "Maximum length for the summary and critique is one page single spaced (~400 words max.", "FINAL RESEARCH DESIGN PROPOSAL (50%): The final research design proposal contains an Introduction, comprehensive Literature Review, Overall Goal(s) and (specific) Objectives, Experimental Design and Methods (including anticipated results and potential data presentation)."]}, {"course_id": 20, "course_code": "EARTH 458", "course_name": "EARTH458 - Physical Hydrogeology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrogeology Fall 2024", "08:30AM - 09:50AM DWE 3519", "An introduction to the principles and theories of mineral deposit genesis.", "Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered.", "View requirements for EARTH 458L", "Applied geophysics provides geoscientists with a wide-range of non-invasive methods for characterizing the Earth's interior.", "This course is an introduction to the physical principles underlying field acquisition, processing, and data interpretation for commonly used applied geophysical techniques (seismic, electrical, electromagnetic induction, gravity, and magnetic methods).", "This course is not only pertinent for geoscientists but also for engineers and others interested in learning how physics can be used to explore the Earth's interior or perform non-destructive testing.", "Near-surface geophysics is used to characterize the shallow subsurface for a wide-spectrum of applications.", "This application-oriented course covers current methodology in near-surface geophysics, including electrical, electromagnetic, ground penetrating radar, seismic refraction, and well-logging methods.", "Techniques for geophysical data acquisition and interpretation are studied and applied to field data.", "Examples of the application of geophysical techniques to archeological, forensics, geotechnical, glaciology, and hydrogeological problems are examined.", "View requirements for EARTH 461", "A field-oriented course on current methodology in the general area of geotechnical or engineering geophysics as applied to environmental problems.", "Typical topics covered: well logging and time domain electromagnetic surveys for groundwater supply; magnetic and terrain conductivity surveys for waste materials; ground penetrating radar applications to stratigraphy and contamination; streaming potential surveys of dam leakage.", "A pre-lab quiz must be completed before attending each field lab.", "Labs will be completed in groups with field data recorded in field books or datasheets.", "These data will be used to a complete individual lab assignment.", "This site contains over 100 groundwater monitoring wells.", "Field lab activities involve:", "(3) Measurement of in-situ hydraulic conductivity using single-well response tests", "Each lab will provide you with a unique dataset that you will use to develop a conceptual site model of the local groundwater flow system.", "• Properly construct and interpret soil core logs using United Soil Classification System, and make lithostratigraphic interpretations using geophysical logs", "• Assess and interpret water level measurements through the construction of water table maps and flownets", "• Interpret single-well response tests including falling and rising head (slug) tests to determine in-situ hydraulic conductivity", "• Interpret hydraulic pumping tests to determine aquifer transmissivity and storage parameters and assess water resource vulnerability", "Each module will contain a series of recorded lecture slides and video demonstrations reviewing core concepts and guidelines for the upcoming field lab.", "Please include “Earth 458L” in the subject line of all e-mail communications as well as your Full Name and Student ID# in the text of the email.", "Hydrogeological equipment to make measurements and collect data (temporary use)", "Specialized hydrogeological software to complete certain assignments", "Datasheet to record field data", "Other data should be recorded in your field books and distributed to your group members as needed.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Notice of Recording", "Participation in Field Labs:", "These quizzes are designed to keep you on schedule and prepare you for the in-person field lab and assigned activities.", "There will be a 48-hour grace period to finalize the submission of your assigned activities without incurring any late penalty."]}, {"course_id": 21, "course_code": "EARTH 458L", "course_name": "EARTH458L - Field Methods in Hydrogeology (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrogeology Fall 2024", "08:30AM - 09:50AM DWE 3519", "An introduction to the principles and theories of mineral deposit genesis.", "Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered.", "View requirements for EARTH 458L", "Applied geophysics provides geoscientists with a wide-range of non-invasive methods for characterizing the Earth's interior.", "This course is an introduction to the physical principles underlying field acquisition, processing, and data interpretation for commonly used applied geophysical techniques (seismic, electrical, electromagnetic induction, gravity, and magnetic methods).", "This course is not only pertinent for geoscientists but also for engineers and others interested in learning how physics can be used to explore the Earth's interior or perform non-destructive testing.", "Near-surface geophysics is used to characterize the shallow subsurface for a wide-spectrum of applications.", "This application-oriented course covers current methodology in near-surface geophysics, including electrical, electromagnetic, ground penetrating radar, seismic refraction, and well-logging methods.", "Techniques for geophysical data acquisition and interpretation are studied and applied to field data.", "Examples of the application of geophysical techniques to archeological, forensics, geotechnical, glaciology, and hydrogeological problems are examined.", "View requirements for EARTH 461", "A field-oriented course on current methodology in the general area of geotechnical or engineering geophysics as applied to environmental problems.", "Typical topics covered: well logging and time domain electromagnetic surveys for groundwater supply; magnetic and terrain conductivity surveys for waste materials; ground penetrating radar applications to stratigraphy and contamination; streaming potential surveys of dam leakage.", "A pre-lab quiz must be completed before attending each field lab.", "Labs will be completed in groups with field data recorded in field books or datasheets.", "These data will be used to a complete individual lab assignment.", "This site contains over 100 groundwater monitoring wells.", "Field lab activities involve:", "(3) Measurement of in-situ hydraulic conductivity using single-well response tests", "Each lab will provide you with a unique dataset that you will use to develop a conceptual site model of the local groundwater flow system.", "• Properly construct and interpret soil core logs using United Soil Classification System, and make lithostratigraphic interpretations using geophysical logs", "• Assess and interpret water level measurements through the construction of water table maps and flownets", "• Interpret single-well response tests including falling and rising head (slug) tests to determine in-situ hydraulic conductivity", "• Interpret hydraulic pumping tests to determine aquifer transmissivity and storage parameters and assess water resource vulnerability", "Each module will contain a series of recorded lecture slides and video demonstrations reviewing core concepts and guidelines for the upcoming field lab.", "Please include “Earth 458L” in the subject line of all e-mail communications as well as your Full Name and Student ID# in the text of the email.", "Hydrogeological equipment to make measurements and collect data (temporary use)", "Specialized hydrogeological software to complete certain assignments", "Datasheet to record field data", "Other data should be recorded in your field books and distributed to your group members as needed.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Notice of Recording", "Participation in Field Labs:", "These quizzes are designed to keep you on schedule and prepare you for the in-person field lab and assigned activities.", "There will be a 48-hour grace period to finalize the submission of your assigned activities without incurring any late penalty."]}, {"course_id": 23, "course_code": "EARTH 461", "course_name": "EARTH461 - Near-Surface Geophysics (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrogeology Fall 2024", "08:30AM - 09:50AM DWE 3519", "An introduction to the principles and theories of mineral deposit genesis.", "Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered.", "View requirements for EARTH 458L", "Applied geophysics provides geoscientists with a wide-range of non-invasive methods for characterizing the Earth's interior.", "This course is an introduction to the physical principles underlying field acquisition, processing, and data interpretation for commonly used applied geophysical techniques (seismic, electrical, electromagnetic induction, gravity, and magnetic methods).", "This course is not only pertinent for geoscientists but also for engineers and others interested in learning how physics can be used to explore the Earth's interior or perform non-destructive testing.", "Near-surface geophysics is used to characterize the shallow subsurface for a wide-spectrum of applications.", "This application-oriented course covers current methodology in near-surface geophysics, including electrical, electromagnetic, ground penetrating radar, seismic refraction, and well-logging methods.", "Techniques for geophysical data acquisition and interpretation are studied and applied to field data.", "Examples of the application of geophysical techniques to archeological, forensics, geotechnical, glaciology, and hydrogeological problems are examined.", "View requirements for EARTH 461", "A field-oriented course on current methodology in the general area of geotechnical or engineering geophysics as applied to environmental problems.", "Typical topics covered: well logging and time domain electromagnetic surveys for groundwater supply; magnetic and terrain conductivity surveys for waste materials; ground penetrating radar applications to stratigraphy and contamination; streaming potential surveys of dam leakage.", "A pre-lab quiz must be completed before attending each field lab.", "Labs will be completed in groups with field data recorded in field books or datasheets.", "These data will be used to a complete individual lab assignment.", "This site contains over 100 groundwater monitoring wells.", "Field lab activities involve:", "(3) Measurement of in-situ hydraulic conductivity using single-well response tests", "Each lab will provide you with a unique dataset that you will use to develop a conceptual site model of the local groundwater flow system.", "• Properly construct and interpret soil core logs using United Soil Classification System, and make lithostratigraphic interpretations using geophysical logs", "• Assess and interpret water level measurements through the construction of water table maps and flownets", "• Interpret single-well response tests including falling and rising head (slug) tests to determine in-situ hydraulic conductivity", "• Interpret hydraulic pumping tests to determine aquifer transmissivity and storage parameters and assess water resource vulnerability", "Each module will contain a series of recorded lecture slides and video demonstrations reviewing core concepts and guidelines for the upcoming field lab.", "Please include “Earth 458L” in the subject line of all e-mail communications as well as your Full Name and Student ID# in the text of the email.", "Hydrogeological equipment to make measurements and collect data (temporary use)", "Specialized hydrogeological software to complete certain assignments", "Datasheet to record field data", "Other data should be recorded in your field books and distributed to your group members as needed.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Notice of Recording", "Participation in Field Labs:", "These quizzes are designed to keep you on schedule and prepare you for the in-person field lab and assigned activities.", "There will be a 48-hour grace period to finalize the submission of your assigned activities without incurring any late penalty."]}, {"course_id": 24, "course_code": "EARTH 471", "course_name": "EARTH471 - Mineral Deposits (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["09:30AM -", "An introduction to the principles and theories of mineral deposit genesis.", "Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered.", "3) Integrate geochemical and geological data into mineral resource estimates (Module 5, Project)", "Module 1: Introduction to mineral deposits.", "The final product is a report in the style of an NI 43-101 technical report that synthesizes the results of core logging, geochemical data analysis, a resource estimate and a summary of findings and recommendations."]}, {"course_id": 25, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 26, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 27, "course_code": "STAT 202", "course_name": "STAT202 - Introductory Statistics for Scientists (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Statistics for Scientists Winter 2025", "R. Metzger", "R. Metzger", "jenny.tieu@uwaterloo.ca", "02:30PM - 03:20PM", "jenny.tieu@uwaterloo.ca", "R. Metzger", "02:30PM - 03:20PM", "PHY 313", "jenny.tieu@uwaterloo.ca", "R. Metzger", "Methods for data summary and presentation.", "Estimation, hypothesis testing, two-sample techniques and paired comparisons, regression, correlation.", "Evaluate the strengths and weaknesses of a simple sampling technique.", "Given a set of data:", "Build a simple linear model for a dataset.", "Perform simple statistical test to determine whether:", "A population mean and proportion differs from a particular value.", "A simple linear regression model parameter is significant.", "Probability Functions (PF) and Cumulative Distribution Functions (CDF):", "Differentiate between a Binomial and Poisson experiment.", "Define simple sample spaces and calculate simple probabilities.", "Calculate the sample mean and sample variance of a linear combination.", "Linear Relationships (Covariance and Correlation), Time Series, Scatterplots, Linear Regression", "Instructor(s) will go over a problem set.", "Regression analysis", "Sample design", "Poisson Distribution, Normal Distribution", "Instructor(s) will go over a problem set.", "Inference", "Instructor(s) will go over a problem set.", "Inference", "Inference", "- location TBD", "≥50", "No considerations are given for individual technical issues.", "This is a cumulative test that will cover the entire course.", "Late Tests will be given a zero mark.", "Note for your circumstance to be deemed valid you must have been incapacitated for a significant portion of the assessment window.", "A circumstance that incapacitates a student for a month or longer is unlikely to be accommodated – in such a case we ask that you please speak to your academic advisor and consider dropping the course.", "In the past some of the issues below have cropped up in my courses:", "Make sure you start online quizzes early, hand in assignments early, etc in case of unforeseen technical issues!", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 28, "course_code": "CIVE 221", "course_name": "CIVE221 - Advanced Calculus (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Advanced Calculus Fall 2024", "10:00AM - 11:20AM STC 0020", "Email: spotapenko@uwaterloo.ca", "Differentiation; partial derivatives of implicit and explicit functions, applications including optimizations.", "Integration; multiple integrals in various co-ordinate systems with applications.", "Vector calculus; vector fields, line integrals, surface integrals, and applications.", "Numerical integration and differentiation.", "Differential Calculus of Multivariable Functions", "Multiple Integrals", "Introduction to Vector Calculus", "develop skills in differential and integral calculus of multivariable functions at the level sufficient to study upper level engineering courses", "analyze the behaviour of multivariable functions", "evaluate typical multiple and line integrals", "apply major theorems of vector calculus to physical problems", "Chapter 12: Differential calculus of multivariable functions", "Multivariable functions, 799 (D. Trim, Calculus for Engineers, 4th edition)", "Limits and continuity, 803", "Relative maxima and minima, 851", "Absolute maxima and minima, 860", "Fluid pressure, 911", "Centers of mass and moments of inertia, 916", "Surface area, 925", "Double iterated integrals in polar coordinates, 930", "Centers of mass and moments of inertia, 950", "Triple iterated integrals in cylindrical coordinates", "Triple iterated integrals in spherical coordinates, 959", "General transformations in multiple integrals, 965", "Vector fields, 983", "Line integrals involving vector functions, 998", "Energy and conservative force fields, 1012", "Surface integrals involving vector fields, 1027", "Relative and absolute maxima and minima", "Lagrange multipliers", "Double iterated integrals", "Applications of double integrals, polar coordinates", "Triple integrals and applications; cylindrical and spherical coordinates", "Vector fields, line integrals of vector functions, independence of integration path", "In case if students disagree with their mark, within one week after the date on which the tests had been returned to the students, they should send the instructor a written request in which they should mention specifically the parts of the test they want to be re-evaluated.", "Please note that the provisions of the marking scheme cannot be challenged and no verbal requests to re-evaluate test papers will be considered.", "Correct answers without clear and concise justification will be awarded minimal marks", "Covid‐19 Emergency Self‐Isolation", "They will review your case and coordinate a reasonable and fair plan in consultation with the instructors and appropriate others (e.g., Engineering Undergraduate Office, AccessAbility Services, Engineering Counselling services, Registrar's Office"]}, {"course_id": 29, "course_code": "GEOE 221", "course_name": "GEOE221 - Advanced Calculus (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Advanced Calculus Fall 2024", "10:00AM - 11:20AM STC 0020", "Email: spotapenko@uwaterloo.ca", "Differentiation; partial derivatives of implicit and explicit functions, applications including optimizations.", "Integration; multiple integrals in various co-ordinate systems with applications.", "Vector calculus; vector fields, line integrals, surface integrals, and applications.", "Numerical integration and differentiation.", "Differential Calculus of Multivariable Functions", "Multiple Integrals", "Introduction to Vector Calculus", "develop skills in differential and integral calculus of multivariable functions at the level sufficient to study upper level engineering courses", "analyze the behaviour of multivariable functions", "evaluate typical multiple and line integrals", "apply major theorems of vector calculus to physical problems", "Chapter 12: Differential calculus of multivariable functions", "Multivariable functions, 799 (D. Trim, Calculus for Engineers, 4th edition)", "Limits and continuity, 803", "Relative maxima and minima, 851", "Absolute maxima and minima, 860", "Fluid pressure, 911", "Centers of mass and moments of inertia, 916", "Surface area, 925", "Double iterated integrals in polar coordinates, 930", "Centers of mass and moments of inertia, 950", "Triple iterated integrals in cylindrical coordinates", "Triple iterated integrals in spherical coordinates, 959", "General transformations in multiple integrals, 965", "Vector fields, 983", "Line integrals involving vector functions, 998", "Energy and conservative force fields, 1012", "Surface integrals involving vector fields, 1027", "Relative and absolute maxima and minima", "Lagrange multipliers", "Double iterated integrals", "Applications of double integrals, polar coordinates", "Triple integrals and applications; cylindrical and spherical coordinates", "Vector fields, line integrals of vector functions, independence of integration path", "In case if students disagree with their mark, within one week after the date on which the tests had been returned to the students, they should send the instructor a written request in which they should mention specifically the parts of the test they want to be re-evaluated.", "Please note that the provisions of the marking scheme cannot be challenged and no verbal requests to re-evaluate test papers will be considered.", "Correct answers without clear and concise justification will be awarded minimal marks", "Covid‐19 Emergency Self‐Isolation", "They will review your case and coordinate a reasonable and fair plan in consultation with the instructors and appropriate others (e.g., Engineering Undergraduate Office, AccessAbility Services, Engineering Counselling services, Registrar's Office"]}, {"course_id": 30, "course_code": "MATH 227", "course_name": "MATH227 - Calculus 3 for Honours Physics (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Email: pmcgrath@uwaterloo.ca", "Directional derivative and the chain rule for multivariable functions.", "Double and triple integrals on simple domains; transformations and Jacobians; change of variable in multiple integrals.", "Vector fields, divergence and curl.", "Vector integral calculus: Line and surface integrals, Green's Theorem, Stokes' Theorem, Gauss' Theorem, conservative vector fields.", "Work in and convert between Cartesian and polar coordinates in two-dimensions or Cartesian, cylindrical, and spherical coordinates in three-dimensions.", "Plot and describe the behaviour of a vector field.", "Determine using a variety of tests if a vector field is conservative.", "Understand the fundamental differences between conservative and non-conservative vector fields.", "Determine the extreme values of a function of multiple variables.", "This course covers a selection of topics from multivariable vector calculus.", "In particular, we will aim to cover one item per week from the following list:", "Arc length and line integrals.", "Quadric surfaces and coordinate systems.", "Extrema of multivariable functions and Lagrange multipliers.", "A previous course in linear algebra is strongly recommended.", "I will also share short videos each week in which I work through examples and/or discuss particularly important concepts.", "I will also post problem sets with full solutions each week so that you have plenty of practice problems to work through.", "Discussion", "You can join our Piazza forum at", "To be clear - such websites are not allowed to be used for the completion of any assessment in MATH 227."]}, {"course_id": 31, "course_code": "CIVE 222", "course_name": "CIVE222 - Differential Equations (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Differential Equations Spring 2024", "10:00AM - 11:20AM STC 0010", "An introduction to linear and partial differential equations.", "Standard methods of solution, applications to physical and engineering problems, linear equations with constant coefficients, basic systems of differential equations, partial differential equations.", "2. Problem Analysis: Formulate problem statement; Rehearse Problem Solving skills; Solve moderately complex problems", "Introduction, p.1", "1.2         General Concepts and Definitions, p.6", "First-Order and Simple Higher-Order Differential Equations, p.16", "2.3         Exact Differential Equations and Integrating Factors, p.31", "2.3.1      Exact Differential Equations, p.32", "2.4         Linear First-Order Equation, p.55", "2.4.1      Linear First-Order Equations, p.55", "2.6         Simple Higher-Order Differential Equations, p.68", "Applications of First-Order Differential Equations, p.87", "3.2         Motion of a Particle in a Resisting Medium, p.91", "3.3.2      Cable under Self-Weight, p.102", "Linear Differential Equations, p.140", "4.1         General Linear Ordinary Differential Equations, p.140", "4.2         Complementary Solutions, p.143", "Applications of Linear Differential Equations, p.188", "5.1         Vibration of a Single Degree-of-Freedom System, p.188", "5.1.2       Response of a Single Degree-of-Freedom System, p.193", "Systems of Linear Differential Equations, p.300", "Applications of Systems of Linear Differential Equations, p.357", "Partial Differential Equations, p.457", "11.1       Simple Partial Differential Equations, p.457", "Wei-Chau Xie, 2010, Differential Equations for Engineers, Cambridge University Press, ISBN 978-0-521-19424-2, TA347.D45X54 2010"]}, {"course_id": 32, "course_code": "ENVE 223", "course_name": "ENVE223 - Differential Equations and Balance Laws (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Differential Equations and Balance Laws Winter 2025", "10:00AM - 11:20AM RCH 309", "08:30AM - 09:20AM", "An introduction to ordinary differential equations with applications to mass and energy balance problems in engineering.", "Standard methods of solution of first and second order linear equations with constant coefficients.", "Numerical methods for solving ordinary differential equations.", "Many practical physical and engineering problems can be analyzed using mathematical models formulated in terms of ordinary differential equations; these often arise from the application of mass, momentum, or energy balance laws.", "The objective of this course is to equip engineering students with a working knowledge of the methods which are used to solve these equations.", "Differential equations are introduced, along with standard methods of solution for first and second order linear equations with constant coefficients.", "identify and differentiate between the various types of differential equations; with this knowledge, be able to identify the most appropriate method of solution", "pose appropriate boundary or initial conditions and solve that equation using standard methods for given a mathematical problem statement expressed in terms of a linear differential equation", "check whether a solution to a differential equation is correct", "think critically about a mathematical problem and evaluate the validity of results from mathematical methods", "appreciate the utility and value of having an education in mathematics as part of their training as an engineer", "Canadian Engineering Accreditation Board", "Piazza – Wiki-style Q&A; primary way to get & give text-based help in ENVE/GEOE 223", "Drop-in Hours", "Students are very welcome and encouraged to meet with the teaching team in scheduled drop-in hours.", "1 Jan 6-10 CH1: Introductory concepts and definitions, simply integrable and separable solutions", "2 Jan 13-17 CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties, substitution", "3 Jan 20-24 CH3: Applications of linear first-order ODEs", "4 Jan 27-31 CH4: Solving homogeneous linear higher-order ODEs with constant coefficients A1, Jan 28", "6 Feb 10-14 CH6: Applications of linear higher-order linear ODEs", "Reading Week & Family Day", "7 Feb 24-28 CH7: Slope fields and numerical solution of first-order ODEs A2, Feb 25", "Notes of Diffy Qs, Differential Equations for Engineers, Jiří Lebl, Creative Commons, 2024.", "Calculus for Engineers (4e), Donald Trim, Pearson, 2007.", "Common first-year calculus text.", "CH1: Introductory concepts & definitions, simply integrable & separable solutions 0.2,3; 1.1,3 15.1,2", "CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties; substitution 1.4", "CH3: Applications of linear first-order ODEs 1.4 15.2,3,5", "CH4: Solving homogeneous linear higher-order ODEs with constant coefficients 2.1-3 15.6-8", "CH5: Solving non-homogeneous linear higher-order ODEs with constant coefficients using the method of undetermined coefficients 2.5 15.9", "CH6: Applications of linear higher-order linear ODEs  2.4 15.10", "CH7: Slope fields and numerical solution of first-order ODEs 1.2,7", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "extenuating circumstance", "This course includes the independent development and practice of engineering specific skills.", "Campus Supports", "Library for research-based assignments"]}, {"course_id": 33, "course_code": "GEOE 223", "course_name": "GEOE223 - Differential Equations and Balance Laws (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Differential Equations and Balance Laws Winter 2025", "10:00AM - 11:20AM RCH 309", "08:30AM - 09:20AM", "An introduction to ordinary differential equations with applications to mass and energy balance problems in engineering.", "Standard methods of solution of first and second order linear equations with constant coefficients.", "Numerical methods for solving ordinary differential equations.", "Many practical physical and engineering problems can be analyzed using mathematical models formulated in terms of ordinary differential equations; these often arise from the application of mass, momentum, or energy balance laws.", "The objective of this course is to equip engineering students with a working knowledge of the methods which are used to solve these equations.", "Differential equations are introduced, along with standard methods of solution for first and second order linear equations with constant coefficients.", "identify and differentiate between the various types of differential equations; with this knowledge, be able to identify the most appropriate method of solution", "pose appropriate boundary or initial conditions and solve that equation using standard methods for given a mathematical problem statement expressed in terms of a linear differential equation", "check whether a solution to a differential equation is correct", "think critically about a mathematical problem and evaluate the validity of results from mathematical methods", "appreciate the utility and value of having an education in mathematics as part of their training as an engineer", "Canadian Engineering Accreditation Board", "Piazza – Wiki-style Q&A; primary way to get & give text-based help in ENVE/GEOE 223", "Drop-in Hours", "Students are very welcome and encouraged to meet with the teaching team in scheduled drop-in hours.", "1 Jan 6-10 CH1: Introductory concepts and definitions, simply integrable and separable solutions", "2 Jan 13-17 CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties, substitution", "3 Jan 20-24 CH3: Applications of linear first-order ODEs", "4 Jan 27-31 CH4: Solving homogeneous linear higher-order ODEs with constant coefficients A1, Jan 28", "6 Feb 10-14 CH6: Applications of linear higher-order linear ODEs", "Reading Week & Family Day", "7 Feb 24-28 CH7: Slope fields and numerical solution of first-order ODEs A2, Feb 25", "Notes of Diffy Qs, Differential Equations for Engineers, Jiří Lebl, Creative Commons, 2024.", "Calculus for Engineers (4e), Donald Trim, Pearson, 2007.", "Common first-year calculus text.", "CH1: Introductory concepts & definitions, simply integrable & separable solutions 0.2,3; 1.1,3 15.1,2", "CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties; substitution 1.4", "CH3: Applications of linear first-order ODEs 1.4 15.2,3,5", "CH4: Solving homogeneous linear higher-order ODEs with constant coefficients 2.1-3 15.6-8", "CH5: Solving non-homogeneous linear higher-order ODEs with constant coefficients using the method of undetermined coefficients 2.5 15.9", "CH6: Applications of linear higher-order linear ODEs  2.4 15.10", "CH7: Slope fields and numerical solution of first-order ODEs 1.2,7", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "extenuating circumstance", "This course includes the independent development and practice of engineering specific skills.", "Campus Supports", "Library for research-based assignments"]}, {"course_id": 34, "course_code": "MATH 228", "course_name": "MATH228 - Differential Equations for Physics and Chemistry (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Differential Equations for Physics and Chemistry Winter 2025", "First-order equations, second-order linear equations with constant coefficients, series solutions and special functions, the Laplace transform method.", "Applications in physics and chemistry are emphasized.", "Differential equations capture how some variable of interest, such as the position of a planet, changes as a function of some independent variable, such as time.", "Differential equations are very widely used in the sciences because of the broad range of real-world phenomena they can describe in a mathematical framework.", "In this course, students will be introduced to the universe of differential equations, including first-order equations, second-order linear equations, series solutions, the Laplace transform method, and both exact and numerical methods for solving differential equations.", "Applications in physics and chemistry will be emphasized.", "understand how differential equations can be used to model physical systems,", "know how to classify differential equations,", "know how to solve various classes of differential equations using numerical methods and exact methods, and", "Unit 2 - First-Order Differential Equations (Weeks 2 - 3)", "Unit 3 - Second-Order Linear Equations (Weeks 4 - 5)", "Unit 4 - Mechanical and Electrical Vibrations (Week 6)", "Unit 5 - Series Solutions of Second-Order Linear Equations (Weeks 7 - 8)", "Unit 8 - Systems of Differential Equations (Weeks 11 - 12)", "In particular, it includes lots of helpful practice problems.", "To be clear - such websites are not allowed to be used for the completion of any assessment in MATH 228.", "Email a scanned copy of the Verification of Illness Form to your instructor."]}]