[{"course_id": 14, "course_code": "PHIL 145", "course_name": "PHIL145 - Critical Thinking (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["identify reliable types of reasoning,", "give connected reasons/evidence to support a conclusion,", "evaluate reasons and evidence that support a conclusion,", "understand what it means to live and learn in a community of learners, and", "Purchase an access code via the W Store for Clear Thinking in a Blurry World", "A reliable internet connection and regular checking of the course site (at least twice a week) is therefore mandatory.", "This course involves the independent development and practice of specific skills, such as critical thinking, evaluation of ideas and arguments, and academic writing.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 15, "course_code": "PHIL 215", "course_name": "PHIL215 - Professional and Business Ethics (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["11:30AM -", "V. Fernandes", "Study of ethical and moral issues that typically arise in professional and business activity.", "In the context of this course we will look specifically at ethical issues and principles of conduct that are relevant to professionals and business people.", "Topics include: fundamentals of moral and political theory, ethical decision-making, professional responsibility, corporate social responsibility, and equality, among other things.", "Like many other courses in philosophy, this series of lectures, readings, and discussions will deal with a critical analysis of many and varied views regarding life, existence, values, religious belief, etc.", "Form an opinion on the importance of ethical reasoning in business and professional contexts.", "Identify ethical problems in complex professional and business related situations.", "Apply ethical concepts to particular business and professional situations.", "Explain the roles of professional codes of conduct and codes of ethics in real world contexts.", "1 Jan 6 - 10 Introduction", "Module 2 Check-in", "3 Jan 20 - 24 Ethical Decision Making", "Module 3 Check-in", "5 Feb 3 - 7 Equality & Discrimination", "Module 6 Check-in", "7 Feb 24 - 28 Markets & the Environment", "Module 7 Check-in", "Module 9 Check-in", "Module 10 Check-in", "11 Mar 24 - 28 Whistle-blowing and Codes of Ethics", "Module 11 Check-in", "Module 12 Check-in", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 16, "course_code": "MNS 101", "course_name": "MNS101 - Materials and Nanosciences in the Modern World (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Materials and Nanosciences in the Modern World Winter 2025", "Overview of materials, including physical and chemical classification of materials, and structure-property relationships; survey of emerging fields in materials and nanoscience research such as nanotechnology, quantum materials and devices, bionic research; societal impacts of materials and nanoscience research.", "View requirements for MNS 101", "classify and categorize materials based on both their microstructures and functionalities", "describe atomic electronic structure; periodic trends in properties of atoms; covalent, metallic and ionic bonding between atoms; and intermolecular interactions", "describe, visualize and determine physical properties of three-dimensional crystal structures of solid-state materials", "describe and visualize imperfections in crystal structures and rationalize their implications on the mechanical properties of materials", "describe and determine mechanical properties for various materials", "classify ceramics and describe their syntheses, properties and applications", "classify polymers and describe their syntheses, properties and applications", "describe and determine electronic properties of solid materials", "identify and appreciate the diversity of modern research in materials and nanoscience", "1 Introduction to Materials Science", "2 Atomic and Electronic Structure", "8 Electronic Properties", "The tests are non-cumulative, and each test will cover specific sections and modules from the course lecture notes.", "Emails can be received 24 hours per day.", "This official verification is necessary before any action can be taken.", "Students should carefully consider the wisdom of missing a test or an exam."]}, {"course_id": 17, "course_code": "MNS 102", "course_name": "MNS102 - Techniques for Materials and Nanosciences (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Techniques for Materials and Nanosciences Winter 2025", "MNS 102", "Overview of materials synthesis, including both wet chemical and dry physical based methodologies; basic metrology and materials characterization of surface and bulk properties; introduction to the design, fabrication, and evaluation of simple devices; survey of emerging new techniques in materials and nanosciences.", "View requirements for MNS 102", "Overview of Materials and Nanosciences - Review of notable nanoscale phenomena | Structure-property relations | Basic physics and chemistry background | Lab tours", "Wet chemistry methods: Beaker chemistry, Sol-Sel, Hydrothermal, Electrochemistry | Templates, seed-layers and catalysts ||", "Dry chemistry methods: Solid-state synthesis, Chemical Vapour Deposition, Physical Vapour Deposition (including magnetron sputtering, e-beam evaporation, pulsed laser deposition), Molecular Beam Epitaxy | General materials growth mechanisms", "Module 2: Basic Metrology and Materials Characterization - Structure determination techniques | X-ray Diffraction: Basic introduction in group theory, basic physics, diffraction of powders and thin films) | Light Microscopy: Key concepts including magnification, working distance, depth of focus, spatial resolution vs field of view | Transmission Electron Microscopy and electron diffraction| Scanning Electron Microscopy (and Energy-Dispersive X-ray analysis) | Scanning Tunnelling Microscopy | Atomic Force Microscopy ||", "Composition determination techniques | Optical spectroscopies: Absorption vs transmission, IR, Raman, UV, photoluminescence || X-ray photoelectron spectroscopy: Photoelectric effect and Einstein's equation, electronic and band structures | Secondary ion mass spectrometry: Static vs Dynamic SIMS ||", "Characterization of electrical, physical and magnetic properties | Resistivity and conductivity | Heat capacity | Magnetic properties", "Module 3: Device Design and Fabrication - Top-down vs bottom-up approaches | Optical Lithography | Electron Beam Lithography | Nano-imprinting | Nano-machining and nano-manipulation", "Module 4: Emerging Techniques - Super-resolution Microscopy | Helium Ion Microscopy | Ion Beam Lithography | Other tools", "To learn the fundamental structure-properties relations of nanoscale materials.", "To learn the basic principles of common synthesis and materials characterization techniques."]}, {"course_id": 18, "course_code": "SCI 206", "course_name": "SCI206 - The Physics of How Things Work (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["S. Idziak", "Email: idziak@uwaterloo.ca", "A practical introduction to everyday technology, this course will look at the physics behind common devices used in consumer products and industry.", "Week 9 Alternate Energy", "Week 10 Rockets and Nuclear Energy", "Week 11 Medical Imaging", "Six copies of the first edition are available in reserve at the library (UWD 1520) (call numbers are tentative)", "Lectures are in person and will not be streamed.", "Midterms", "The midterms will be multiple choice and will be given during regularly scheduled class time.", "Recorded lectures from when courses were online are available on Learn in case of missed lectures.", "Emails can be received 24 hours per day."]}, {"course_id": 19, "course_code": "SCI 238", "course_name": "SCI238 - Introductory Astronomy (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["SCI 238", "SCI 238 001", "Discussions:", "Lecture slides can be found here.", "SCI 238:", "View requirements for SCI 238", "All are welcome!", "5 Tuesday, Jan 21st Light and Matter Chapter 5     Spectral tubes and spectrometers", "Science of \"Interstellar\"", "Order Mastering Astronomy", "No exceptions to these requirements will generally be made in cases where students miss classes or do not complete assignments.", "Library for research-based assignments"]}, {"course_id": 20, "course_code": "CHEM 120", "course_name": "CHEM120 - General Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["General Chemistry 1 Winter 2025", "RCH 101", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "The second part of this course is concerned with explaining periodicity and trends in chemical reactivity in terms of the electronic structure of atoms and molecules.", "Topics covered in this part of the course include the quantum theory of the hydrogen atom; electron configurations in multi-electron atoms; ionic and covalent bonding; Lewis structures, valence shell electron repulsion theory and molecular geometry; quantum mechanical bonding theories, including valence bond theory and molecular orbital theory.", "Additional topics may include an introduction to electron-transfer reactions, including the assignment of oxidation states and the balancing of oxidation-reduction reactions.", "assess the greenness of a chemical reaction using Atom Economy and E-Factor metrics.", "describe the electronic structure of atoms in terms of quantum theory using atomic orbitals and quantum numbers.", "justify the organization of the periodic table and predict trends in the properties of the elements.", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and explain molecular shape and stability in terms of electron count.", "describe the interactions of molecules in solids, liquids, and gases to compare physical and reactive properties.", "Course Structure and Continuity Plans", "No extensions will be granted for Participation Challenges, but each student can drop one participation challenge from their overall grade.", "Printed spiral bound copies of the course notes can be purchased online from the UW bookstore https://wstore.uwaterloo.ca/", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare pandemic-related illnesses on Quest (Information at this link)", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 21, "course_code": "CHEM 120L", "course_name": "CHEM120L - General Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 1 Fall 2024", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Be sure to record their name and contact information in your lab manual.", "Skillfully perform basic procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "1,3,5,7,9,11", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Sept 19 - 24", "1,3,5,7,9,11", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "1,3,5,7,9,11", "- studying cis and trans isomers", "Oct 24-29", "1,3,5,7,9,11", "Titration as an Analysis Tool", "- identify an unknown solid acid", "1,3,5,7,9,11", "Introduction to Chromatography", "- quantify a cation using ion exchange", "1,3,5,7,9,11", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 22, "course_code": "CHEM 123", "course_name": "CHEM123 - General Chemistry 2 (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["General Chemistry 2 Winter 2025", "09:30AM - 10:20AM STC 1012", "Introduction to chemical equilibria.", "Describe the energy and entropy changes that accompany physical and chemical changes.", "Calculate the equilibrium constant for a reaction using the standard thermodynamic properties of reactants and products.", "Predict the direction of spontaneous change for a given set of initial conditions for a variety of chemical systems.", "Apply equilibrium principles to a variety of chemical reaction types including gas-phase reactions, acid-base reactions, precipitation reactions, complexation reactions and redox reactions.", "Analyze oxidation-reduction reactions and identify species being oxidized and reduced.", "Explain the basic construction of, uses of, and the differences between galvanic and electrolytic cells.", "CHEM 120 and CHEM 123 comprise a full-year course in introductory chemistry.", "Course Structure and Continuity Plans", "Chemistry Study Hall:  Starting the 2nd week of classes, there will be a first-year study hall on Tuesdays and Thursdays at 5:30 pm - 6:50 pm in STC 1012.", "You can attend as many Study Hall Sessions as you would like - grab your friends and connect with your TAs!", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 23, "course_code": "CHEM 123L", "course_name": "CHEM123L - General Chemistry Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 2 Winter 2025", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- a real life analysis", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 24, "course_code": "EARTH 121", "course_name": "EARTH121 - Introductory Earth Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Introductory Earth Sciences Fall 2024", "Students will learn to think like a geoscientist by adopting four ways of thinking that take into account a systems approach, a variety of spatial and temporal scales, and field thinking.", "Recognize the dynamic nature of Earth through an examination of the interactive components of the Rock Cycle.", "Extrapolate meaning from everyday geologic material and predict occurrence and origin.", "Week 1: Introduction and Four Ways of Thinking 1a and 1b Discussion: Introduce Yourself", "Week 2: Introduction to Rocks 2a Field Notes Journal 2: Are minerals important?", "Week 3: Introduction to the Rock Cycle 2b Field Notes Journal 3: What do you see in the video?", "Week 4: Introduction to the Rock Classification 2c Field Notes Journal 4: Is this depiction of the Rock Cycle complete and accurate?", "Week 5: Geologic Time and Geologic Time Scale 3a and 3b Field Notes Journal 5: How do I create a simplified Geologic Time Scale?", "Please note emails can be received 24 hours per day", "Short-term Absence", "Covid-19-related Absence", "Intellectual property includes items such as:"]}, {"course_id": 25, "course_code": "EARTH 121L", "course_name": "EARTH121L - Introductory Earth Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Introductory Earth Sciences Laboratory Fall 2024", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Email: keith.delaney@uwaterloo.ca", "Sahar Soltani - sahar.soltani@uwaterloo.ca / LABS 001 & 003", "By far, the majority of people qualified as geologists spend their time using their knowledge working 'in the field', or in exploration, putting principles learned in theory and in the laboratory, into practice.", "Identify common mineral and rocks based on their identification properties", "Understand the rock cycle and how minerals and rocks are formed", "Understand the theory of plate tectonics and how it has shaped the Earth's surface over time", "Qualitatively and Quantitatively describe earthquakes and some of their processes", "Read and interpret data from both topographic and geologic maps", "Understand the immense history and geologic record of our planet", "Understand the factors influencing climate change and quantify how the planet is changing", "Will assess Mineral and Rock Identification knowledge with real samples.", "Lab 8 Earth Structures", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "Situation where VIFs are not Appropriate"]}, {"course_id": 26, "course_code": "EARTH 122", "course_name": "EARTH122 - Introductory Environmental Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Introductory Environmental Sciences Winter 2025", "08:30AM - 09:50AM STC 1012", "I hold a PhD in Earth & Environmental Sciences from the University of Waterloo (2014) and an HBSc in Earth & Environmental Sciences from McMaster University (2006).", "You might notice I'm looking pretty pregnant!", "I'm conveniently due on April 27 BUT in the unlikely even that I have a baby really early, the excellent Dr. Keith Delaney (who has taught this class for many years) will step in at the end.", "Discussions", "Questions of a personal nature", "Office: EIT 2051D (very back of Earth & Environmental Sciences main office)", "Email: msrosamo@uwaterloo.ca", "Grad TA contact info can be found in the EARTH 122L syllabus.", "Course topics include sustainable development and the availability and use of natural resources, principles of ecology and environmental science, biogeochemical cycles, climate and climate change, soils and food supply, energy systems, surface water and groundwater, waste generation and management, pollution, and catastrophic natural processes.", "Describe common global environmental issues and the role of environmental science in identifying, understanding, and solving these issues.", "Interpret and manipulate simple box models of environmental systems", "Interpret scientific diagrams and graphs pertaining to environmental science", "1 January 06 - 10 Intro to Environmental Science & Matter, Energy and Physical Environment Chps 1 & 2", "2 January 13 - 17 Earth Systems/Ecosystems & Evolution, Biodiversity, Population Ecology Chps 3 & 4", "3 January 20 - 24 Species Interactions/Community Ecology & Human Population Chps 5 & 6", "Soils & Soil Resources*", "8 February 24 - 28 Freshwater Systems/Water Resources & Marine, Coastal Systems, Fisheries Chps 11 & 12 Quiz 6 - Chapters 11 & 12 Content Mon. Mar 3  5:00PM 3", "10 March 10 - 14 Global Climate Change & Fossil Fuels: Energy Use/Impacts Chps 14 & 15", "Energy Alternatives & Mineral Resources & Mining", "Quiz 8 - Chapters 15 & 16 & 17 Content*", "12 March 24 - 28 Managing our Waste & Environmental Health Hazards Chps 18 & 19 Quiz 9 - Chapters 18 & 19 Content Mon. Mar 31 5:00PM 3", "A Look at Environmental Science and Natural Hazards & Final Exam Study Guide / Discussion", "following these guidelines: https://uwaterloo.ca/science-undergraduate-office/academic-policies-and-procedures/accommodation-illness-or-other-extenuating-circumstances."]}, {"course_id": 27, "course_code": "EARTH 122L", "course_name": "EARTH122L - Introductory Environmental Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introductory Environmental Sciences Laboratory Winter 2025", "EARTH 122L", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Sana Ahmad has a BSc degree in Honours Co-op Environmental Science with a Geoscience Specialization from the University of Waterloo.", "Discussions", "Questions of a personal nature", "Office: EIT 2046 (within the Earth & Environmental Sciences main office)", "Email: s76ahmad@uwaterloo.ca", "Please put EARTH 122L in your email subject line so I don't miss it!", "Please do not send them personal emails!", "View requirements for EARTH 122L", "Use GPS devices and GIS software to locate points of interest and create a map", "ALL LABS ARE HELD IN ROOM: EIT 1013 (ground floor of EIT  - same building as Earth Sciences Museum)", "8 February 24 - 28 Coastal Processes and Problems: Loving Our Coasts to Death?", "10 March 10 - 14 On-Campus Water Sampling and GPS Data Collection Field Sampling and Data Collection Lab around UW Campus", "13 March 31 - April 03 Landscape Geology: Glaciers and Deserts & Climate Change: Pleistocene Records, Milankovitch Cycles Lab 8: Landscape Geology and Climate Change End of Lab 7%", "Note used copies are also fine!", "The format of the final exam will be run digitally through the LEARN Quiz system in the last week of the course, not during the formal exam period.", "Notice of Recording", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "These can be completed digitally now!", "This official verification is necessary before any action can be taken and can be downloaded from the Health Services website.", "Situation where VIFs are not Appropriate", "Example citations:", "\"References"]}, {"course_id": 28, "course_code": "PHYS 111", "course_name": "PHYS111 - Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["An introduction to physics for students intending to concentrate their further studies in biology, dentistry, medicine and paramedicine; includes particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.", "The main physics principles and laws covered in PHYS 111 include: “Particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.”", "PHYS 111 focuses on basic physics principles and laws, on conceptual understanding and problem-solving skills, and an appreciation for the power of physics in explaining how nature works, in the contexts of both the physical and life sciences.", "Physics Principles and Laws: By the end of the course, students will be able to construct scientifically sound explanations of a variety of basic physical phenomena by applying basic physics principles/laws.", "define linear momentum, and calculate and compare momenta of various real-life objects;", "define and calculate impulse, and establish the conditions for conservation of linear momentum; and", "apply the laws of conservation of momentum and energy to collisions.", "Problem-Solving Skills and Strategies: By the end of the course, students will be able to creatively apply a variety of structured problem-solving strategies:", "interpret, visualize and convert the problem into a physical model (e.g., draw a free body diagram);", "evaluate the result — does it make sense?", "These problem-solving skills are useful in the students’ own disciplines and beyond.", "More detailed information about the course elements which contribute to the final grade will be given in the learn sight and in future outline updates", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 29, "course_code": "PHYS 111L", "course_name": "PHYS111L - Physics 1 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "Derin Erisoglu-Akyildiz", "Saba Karimi", "Do Yun Park", "jbschrie@uwaterloo.ca", "s38karim@uwaterloo.ca", "first for minor issues", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "12 & 13", "Complete end-of-term surveys before Dec. 3", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 30, "course_code": "PHYS 112", "course_name": "PHYS112 - Physics 2 (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:30AM - 11:20AM DC 1350", "S. Idziak", "08:30AM - 09:20AM", "Email: idziak@uwaterloo.ca", "Email: james.forrest@uwaterloo.ca", "A continuation of PHYS111; includes simple harmonic motion, electrostatic force and potential, electric current and power, DC circuits, magnetic field and induction, wave motion, sound, and optics.", "To develop the ability to solve problems in areas related to oscillations and waves, electricity and magnetism, and optics", "Understand physical concepts associated with oscillations, waves, sound, electricity and magnetism, and optics", "Apply concepts of force and energy and recognize when acceleration is not constant", "Solve simple physical systems using physical concepts", "Draw relevant sketches from information given in word problems", "Develop physically relevant equations from information given in word problems", "Convert complex problems into a series of sub-problems and solve", "Topic Textbook Chapters                                                                            Number of lectures", "Electric Forces & Fields (Serway) Chapter 15: 1-5", "Electric Potential & Energy (Serway) Chapter 16", "Current and Resistance (Serway) Chapter 17: 1-6", "Magnetic Flux & Induction   1", "College Physics: A Strategic Approach by Jones, Knight, and Field This was suggested for 111.", "I do not find that these books are great but they are available for no cost.", "Please help to create a welcoming and inclusive environment.", "An exam-like problem will be posted each week on LEARN.", "2 points will be given for each clicker response with an additional 1 point for each correct response.", "What happens if I join the course late:", "Missed a regular assignment:", "Emails can be received 24 hours per day.", "Remember that falsely claiming you are ill can result in academic polices per Policy 71.", "Email communications:", "Notice of Recording"]}, {"course_id": 31, "course_code": "PHYS 112L", "course_name": "PHYS112L - Physics 2 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Sean Dougherty", "Aney Kapadia", "Kayra Erisoglu-Akyildiz", "jbschrie@uwaterloo.ca", "s2doughe@uwaterloo.ca", "Course Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"'", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 3 - Circuits", "Experiment 4 - Circuits", "Experiment 5 - Circuits", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 32, "course_code": "PHYS 121", "course_name": "PHYS121 - Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["An introductory course in physics for students intending to concentrate their future studies in the physical sciences, optometry, or mathematics; includes vectors (dot and cross products), particle kinematics and dynamics, forces in nature, work and energy, conservation of energy and linear momentum, rotational kinematics and dynamics, and conservation of angular momentum.", "Doing Physics - quantities, dimensions, units", "Point Dynamics - force, motion, Newton's laws", "Conservation of Energy - work and energy, conservative systems", "Conservation of linear Momentum - momentum and systems of particles", "Understand the following concepts:", "- Linear kinematics: the relationship between distance, velocity and acceleration.", "- Linear dynamics: a consequence of forces and momentum, and how they interrelate.", "- Kinetic energy, potential energy, work, and their interrelationships.", "We will also re-examine these concepts in a rotating coordinate frame using angular kinematic variables along with torque and angular momentum.", "6 Module 06:  Kinetic and Potential Energy", "7 Module 06:  Kinetic and Potential Energy", "8 Module 07:  Linear Momentum", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- eText + Student Access Code", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- Print Format + Student Access Code"]}, {"course_id": 33, "course_code": "PHYS 121L", "course_name": "PHYS121L - Mechanics Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Mechanics Laboratory Fall 2024", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "Julian Meunier", "Soorna Choheili", "Reza Asadi", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "complete introductory surveys", "complete introductory surveys,", "Complete end-of-term surveys", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 34, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 35, "course_code": "PHYS 122L", "course_name": "PHYS122L - Waves, Electricity and Magnetism Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 2 - Circuits", "Experiment 5 - Magnetic Fields of a Coil", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 37, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 38, "course_code": "GEOG 271", "course_name": "GEOG271 - Earth from Space Using Remote Sensing (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["08:30AM - 10:20AM UTD 105", "02:30PM - 04:20PM EV2 1002A", "08:30AM - 10:20AM EV2 1002A", "10:30AM -", "10:30AM -", "02:30PM - 04:20PM EV2 1002A", "Name Yusof Ghiasi Ariana Mansingh Owen Nowitsky Vicky Vanthof", "Email syghiasi@uwaterloo.ca a2mansin@uwaterloo.ca opnowits@uwaterloo.ca vrvantho@uwaterloo.ca", "This undergraduate course will introduce the basic scientific principles and techniques involved in remote sensing and some of the applications to studies of the Earth’s surface process.", "This shall cover examining the basic physics of electromagnetic radiation and the complex interactions of radiation with the surface and atmosphere.", "The theoretical background and examples in the lectures will provide the basis for examining various remote sensing applications with data obtained in different parts of the electromagnetic spectrum.", "The laboratory section will cover hands-on experience with the Catalyst (formerly Geomatica) image analysis software package, the SNAP Toolbox for radar data processing, various satellite image datasets, and some basic coding using Python within the Catalyst environment.", "Relate and use various radiation laws.", "Understand the cause of different spectral responses and the significance of spectral signatures in optical, thermal infrared and microwave remote sensing.", "Introduction", "Basic Physics of Radiation, Definitions, and Fundamental Laws", "Python Programming Primer", "Displaying and Interpreting Remote Sensing Images", "Basics of Electromagnetic Radiation (EMR) and Image Properties", "Spectral Properties", "Visible to Mid-infrared: Sensors, Platforms and Applications", "Image Corrections", "Thermal Infrared: Spectral Signatures, Sensors, Platforms and Applications", "Image Enhancements and Classification", "Passive Microwave: Spectral Signatures, Sensors, Platforms and Applications", "Active Microwave: Sensors, Platforms and Applications", "Other Remote Sensing Platforms and Applications", "European Space Agency - EO Education and Training at https://earth.esa.int/web/guest/eo-education-and-training Available freely online No", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 39, "course_code": "GEOG 281", "course_name": "GEOG281 - Introduction to Geographic Information Systems (GIS) (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Introduction to Geographic Information Systems (GIS) Winter 2025", "su-yin.tan@uwaterloo.ca", "Introduction to the fundamental concepts and use of Geographic Information Systems (GIS).", "Students learn about the nature of geographic information and how to store, manipulate and analyze spatial data in a range of application areas.", "Students will learn underlying theory in lectures and gain a working knowledge of GIS software in lab sessions.", "PLAN 281: View requirements for PLAN 281", "Geographic Information Systems (GIS) are used in a wide variety of planning, facilities management, resource management, business, and applied research applications.", "Since spatial factors are central to almost all issues related to planning and geographic inquiry, it is important to develop a sound grasp of GIS principles and the fundamental skills required to apply it in practice.", "Students learn how to create their own maps, how to use GIS software to analyse geographic problems, and learn techniques that can be applied to a wide variety of subject areas within geography and other disciplines.", "Explain the principles of GIS as a combination of geospatial data input, processing, output, and personnel components.", "Describe and critically assess the use of vector and raster representations of real world objects.", "Design and produce effective maps for visualizing and communicating spatial data and GIS output.", "Apply GIS fundamental concepts and spatial analysis techniques to a variety of applications.", "Demonstrate proficiency in using GIS tools for analyzing geospatial problems.", "Lecture Topic Textbook Chapters", "Assigned", "Mar 24 Module 10: Spatial Data Analysis and Modelling 15, 16 Module 9/10 Lab Module 8 Lab", "Geographic Information Systems and Science. 4th Edition.", "The mandatory text should be used to provide further explanation and examples of concepts and techniques discussed in the course:", "Module 2:       Spatial Data Models", "Module 3:       Georeferencing I – Map Design and Datums", "Module 6:       Vector GIS Analysis", "Module 8:       Raster GIS Analysis", "Module 9:       Data Acquisition and Data Quality", "Module 10:     Spatial Data Analysis and Modelling", "The module-based course structure enables GIS concepts to be broken down into smaller groupings or “chunks”, so students will be able to easily track their progress and completed milestones in the course.", "Lectures are held at the following location and time:", "Lectures cover important theoretical concepts, supplement hands-on lab assignments, and are the basis of Midterm and Final Exam assessments.", "Labs are held every week and the lab schedule is listed below [lab section number in brackets]:", "In this scenario, lab sessions will be migrated to a virtual environment and used as a drop-in session for students to ask their TA questions about lab assignments.", "The TAs are responsible for introducing new assignments and guiding you to learn concepts and software.", "In case pivoting to a remote teaching environment is required (short-term or longer-term), access to a computer that is able to run ArcGIS Pro software either locally installed on a Windows operating system or via remote access using a stable internet connection.", "Indicated time estimates for completing lab exercises are estimates only and do not account for technical troubleshooting.", "Both assessments may consist of multiple choice and short and long answer questions.", "Accommodations may be made on a case-by-case basis and if early enough notice is provided.", "Alternate Arrangements for Cancelled In-Person Lectures:", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 40, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 41, "course_code": "STAT 202", "course_name": "STAT202 - Introductory Statistics for Scientists (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Introductory Statistics for Scientists Winter 2025", "R. Metzger", "R. Metzger", "jenny.tieu@uwaterloo.ca", "02:30PM - 03:20PM", "jenny.tieu@uwaterloo.ca", "R. Metzger", "02:30PM - 03:20PM", "PHY 313", "jenny.tieu@uwaterloo.ca", "R. Metzger", "Methods for data summary and presentation.", "Estimation, hypothesis testing, two-sample techniques and paired comparisons, regression, correlation.", "Evaluate the strengths and weaknesses of a simple sampling technique.", "Given a set of data:", "Build a simple linear model for a dataset.", "Perform simple statistical test to determine whether:", "A population mean and proportion differs from a particular value.", "A simple linear regression model parameter is significant.", "Probability Functions (PF) and Cumulative Distribution Functions (CDF):", "Differentiate between a Binomial and Poisson experiment.", "Define simple sample spaces and calculate simple probabilities.", "Calculate the sample mean and sample variance of a linear combination.", "Linear Relationships (Covariance and Correlation), Time Series, Scatterplots, Linear Regression", "Instructor(s) will go over a problem set.", "Regression analysis", "Sample design", "Poisson Distribution, Normal Distribution", "Instructor(s) will go over a problem set.", "Inference", "Instructor(s) will go over a problem set.", "Inference", "Inference", "- location TBD", "≥50", "No considerations are given for individual technical issues.", "This is a cumulative test that will cover the entire course.", "Late Tests will be given a zero mark.", "Note for your circumstance to be deemed valid you must have been incapacitated for a significant portion of the assessment window.", "A circumstance that incapacitates a student for a month or longer is unlikely to be accommodated – in such a case we ask that you please speak to your academic advisor and consider dropping the course.", "In the past some of the issues below have cropped up in my courses:", "Make sure you start online quizzes early, hand in assignments early, etc in case of unforeseen technical issues!", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 42, "course_code": "MATH 103", "course_name": "MATH103 - Introductory Algebra for Arts and Social Science (0.50)", "term_name": "Required Courses", "program_name": "Science and Aviation", "program_id": 145, "major_id": 1, "major_name": "Science and Aviation (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introductory Algebra for Arts and Social Science Winter 2025", "Email: jen.nelson@uwaterloo.ca", "Topics will be chosen from linear equations, systems of linear equations, linear inequalities, functions, set theory, permutations and combinations, binomial theorem, probability theory.", "The course begins with a review of operations with real numbers and fundamental algebra skills.", "The solutions of polynomial equations, both linear and quadratic, in one and two variables and their graphical representation are studied.", "An extension is made to linear systems with their solutions being expressed both algebraically and graphically.", "To solve linear systems, matrices and the associated row reduction strategies are used.", "The relationship between exponential functions and logarithmic functions is examined.", "The basic properties of logarithms are introduced and used to solve logarithmic and exponential equations.", "Various applications involving exponential growth and decay and logarithmic scales are presented.", "Concepts in set theory and counting theory support the study of probability theory.", "Perform operations with real numbers and algebraic expressions.", "Solve linear equations and inequalities in one variable, including those involving absolute value, and represent the solutions algebraically and graphically.", "Solve a system of linear equations using matrix operations, introducing a free variable, or parameter as appropriate.", "Solve quadratic equations in one variable.", "Recognize that the solutions to a quadratic equation in two variables lie on a curve known as a parabola and analyze the properties of a parabola.", "Describe the relationship between an exponential function and a logarithmic function.", "Use the properties of logarithms to solve logarithmic and exponential equations, and to solve problems involving exponential growth and decay, and logarithmic scales.", "Use the appropriate symbols and language in set theory to perform set operations, represent sets and subsets using Venn diagrams, and apply the counting principles for sets in real-life situations.", "1.1 Real Numbers", "1.2 Order of Operations", "1.3 Fundamental Algebraic Skills", "Unit 2: Equations and Inequalities", "2.1 Equations in One Variable", "Unit 2: Equations and Inequalities Continued", "2.3 Multivariate Equations", "Unit 3: Systems of Linear Equations and Matrices", "3.1 Systems of Linear Equations", "3.2 Introduction to Matrices and Elementary Row Operations", "Unit 3: Systems of Linear Equations and Matrices Continued", "3.3 Applications", "3.4 Systems With No Solutions and Systems With an Infinite Number of Solutions", "Unit 4: Quadratic Equations and Functions", "4.1 Quadratic Equations in One Variable", "4.2 Quadratic Equations in Two Variables and the Parabola", "4.3 Quadratic Functions", "4.4 Applications", "Unit 5: Exponential and Logarithmic Functions", "5.1 Exponential Functions and Equations", "5.2 Exponential Functions and Logarithmic Functions", "Unit 5: Exponential and Logarithmic Functions Continued", "5.4 Solving Logarithmic and Exponential Equations", "5.5 Applications", "6.1 Introduction to Sets", "6.2 Set Operations", "6.3 Counting Principles for Sets", "7.2 Combinations of Simple Events — Compound Events", "7.4 An Introduction to Random Variables and Probability Functions", "8.1 Counting Principles and Probability", "8.3 Combinations — Unordered Selections", "8.4 Binomial Models", "A non-programmable, non-graphing scientific calculator.", "Assignments may be screened by a human for evidence of plagiarism or the inappropriate use of resources.", "Notice of Recording", "instructor in advance in order to facilitate class participation.)"]}, {"course_id": 0, "course_code": "CHEM 120", "course_name": "CHEM120 - General Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["General Chemistry 1 Winter 2025", "RCH 101", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "The second part of this course is concerned with explaining periodicity and trends in chemical reactivity in terms of the electronic structure of atoms and molecules.", "Topics covered in this part of the course include the quantum theory of the hydrogen atom; electron configurations in multi-electron atoms; ionic and covalent bonding; Lewis structures, valence shell electron repulsion theory and molecular geometry; quantum mechanical bonding theories, including valence bond theory and molecular orbital theory.", "Additional topics may include an introduction to electron-transfer reactions, including the assignment of oxidation states and the balancing of oxidation-reduction reactions.", "assess the greenness of a chemical reaction using Atom Economy and E-Factor metrics.", "describe the electronic structure of atoms in terms of quantum theory using atomic orbitals and quantum numbers.", "justify the organization of the periodic table and predict trends in the properties of the elements.", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and explain molecular shape and stability in terms of electron count.", "describe the interactions of molecules in solids, liquids, and gases to compare physical and reactive properties.", "Course Structure and Continuity Plans", "No extensions will be granted for Participation Challenges, but each student can drop one participation challenge from their overall grade.", "Printed spiral bound copies of the course notes can be purchased online from the UW bookstore https://wstore.uwaterloo.ca/", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare pandemic-related illnesses on Quest (Information at this link)", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 1, "course_code": "CHEM 120L", "course_name": "CHEM120L - General Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 1 Fall 2024", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Be sure to record their name and contact information in your lab manual.", "Skillfully perform basic procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "1,3,5,7,9,11", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Sept 19 - 24", "1,3,5,7,9,11", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "1,3,5,7,9,11", "- studying cis and trans isomers", "Oct 24-29", "1,3,5,7,9,11", "Titration as an Analysis Tool", "- identify an unknown solid acid", "1,3,5,7,9,11", "Introduction to Chromatography", "- quantify a cation using ion exchange", "1,3,5,7,9,11", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 2, "course_code": "CHEM 123", "course_name": "CHEM123 - General Chemistry 2 (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["General Chemistry 2 Winter 2025", "09:30AM - 10:20AM STC 1012", "Introduction to chemical equilibria.", "Describe the energy and entropy changes that accompany physical and chemical changes.", "Calculate the equilibrium constant for a reaction using the standard thermodynamic properties of reactants and products.", "Predict the direction of spontaneous change for a given set of initial conditions for a variety of chemical systems.", "Apply equilibrium principles to a variety of chemical reaction types including gas-phase reactions, acid-base reactions, precipitation reactions, complexation reactions and redox reactions.", "Analyze oxidation-reduction reactions and identify species being oxidized and reduced.", "Explain the basic construction of, uses of, and the differences between galvanic and electrolytic cells.", "CHEM 120 and CHEM 123 comprise a full-year course in introductory chemistry.", "Course Structure and Continuity Plans", "Chemistry Study Hall:  Starting the 2nd week of classes, there will be a first-year study hall on Tuesdays and Thursdays at 5:30 pm - 6:50 pm in STC 1012.", "You can attend as many Study Hall Sessions as you would like - grab your friends and connect with your TAs!", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 3, "course_code": "CHEM 123L", "course_name": "CHEM123L - General Chemistry Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 2 Winter 2025", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- a real life analysis", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 4, "course_code": "CS 100", "course_name": "CS100 - Introduction to Computing Through Applications (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Introduction to Computing Through Applications Winter 2025", "Friday -", "Friday", "10:30AM - 12:20PM MC 3005", "10:30AM - 12:20PM MC 3027", "Dave Tompkins", "E-mail: dtompkins@uwaterloo.ca", "E-mail: cs100@uwaterloo.ca", "Introduction to the Internet, World Wide Web, HTML, and XML.", "Algorithms underlying the functional components of web search engines and their influence on data access.", "CS 100: Introduction to Digital Information, Computers, the Internet and Applications", "Explain the emerging computing technologies introduced in the course.", "Digital Information", "Computer + Network organization", "Dynamic web pages and web applications", "Privacy and security", "Emerging Topics", "Distributed networking and \"big data\"", "Artificial intelligence", "ChatGPT and large language models", "Social media and monetization", "A1 released", "Laptops, Devices and Software", "Library for research-based assignments"]}, {"course_id": 5, "course_code": "ECON 101", "course_name": "ECON101 - Introduction to Microeconomics (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Introduction to Microeconomics Winter 2025", "ECON 101", "Email: chvandew@uwaterloo.ca", "“ECON 101” must appear in the subject line and the message must include your full name and student ID number.", "This course provides an introduction to microeconomic analysis relevant for understanding the Canadian economy.", "The behaviour of individual consumers and producers, the determination of market prices for commodities and resources, and the role of government policy in the functioning of the market system are the main topics covered.", "View requirements for ECON 101", "The course comprises the theoretical essentials of microeconomics and will serve as a prerequisite for virtually every economics class that you will endeavour to take in the future.", "understand the need for people to make choices and to work together towards overcoming the universal problem of scarcity;", "appreciate the relevance of economics in a changing world;", "apply elements of microeconomic theory to understand how consumers and producers make rational decisions;", "decompose problems into their economic parts.", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Intellectual property includes items such as:", "Please carefully read the Economics Department policy for instructions.", "Economics Department Deferred Final Exam Policy", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Applications for Accommodation", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 6, "course_code": "ECON 102", "course_name": "ECON102 - Introduction to Macroeconomics (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Introduction to Macroeconomics Winter 2025", "ECON 102", "04:00PM - 05:20PM", "View requirements for ECON 102", "Describe important macroeconomic questions and goals, and explain how monetary and fiscal policy may influence economic outcomes.", "Explain and solve simple models and problems.", "Identify strengths and weaknesses of macroeconomic data, models and theories.", "I. Introduction", "Measurement, Accounting and Data", "Gross Domestic Product and the System of National Accounts.", "Inflation and Price Indices.", "Economic Frameworks", "Modelling Concepts and Model Evaluation.", "Concept of Aggregate Demand in the Goods Market.", "Trends, Cycles and Inequality", "Inequality and Poverty concepts and issues.", "Money and Inflation", "Monetary System and role of money.", "Cost of Inflation", "International Economic Concepts, Exchange Rates and Balance of Payments", "The lecture slides cover a variety of standard macroeconomic topics.", "CAUTION: the notation and even the macroeconomic models presented can vary subtly across textbooks.", "Differences in approach and thought can also help to better understand the benefits and drawbacks of different economic theory and methods.", "The format of the mid-term will be multiple-part short-answer questions.", "All deferred Final Exam requests for Economics courses are administered by the Economics Undergraduate Office.", "In order to achieve a healthy balance between work hours and personal life, there will be a finite amount of time I can dedicate to appointments and emails.", "Also know that I am here to support your learning goals, whether they be to understand a subset of the econometric tools, to pass the course, or to achieve a high grade.", "Applications for Accommodation", "Economics Department Deferred Final Exam Policy", "On campus supports", "Other on-campus supports", "Please see WUSA main web page for these and other services and clubs which may provide more specific and personalized support for specific needs.", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 7, "course_code": "ECON 201", "course_name": "ECON201 - Microeconomic Theory for Business and Policy (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Microeconomic Theory for Business and Policy Winter 2025", "ECON 201", "10:00AM - 11:20AM DWE 2527", "Email: pacurry@uwaterloo.ca", "Topics include consumer choice, production, price and output under perfect and imperfect competition, price discrimination and two part pricing, vertical and horizontal firm boundaries and integration, and market structure.", "View requirements for ECON 201", "Possess skills that enable an evaluation of the societal effects of government policy decisions and understand why governments choose to intervene in markets", "1 Demand and Supply", "Economics Department Deferred Final Exam Policy", "Applications for Accommodation", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued."]}, {"course_id": 8, "course_code": "ECON 221", "course_name": "ECON221 - Statistics for Economists (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Statistics for Economists Winter 2025", "ECON 221", "ECON 221 001", "08:30AM - 09:50AM HH 334", "Email: pchausse@uwaterloo.ca", "Clinic: There is a clinic to help students with ECON 211 and ECON 221 every Tuesday and Wednesday from 3:00PM to 4:30PM in HH 235.", "ECON 221:", "This course introduces students to describing economic data and drawing inferences from features of economic data.", "Starting from fundamental axioms of probability, students will learn about the calculation of probabilities of basic events and the features of random variables, the most important tool for representing the outcomes of complex economic phenomena.", "Students will describe discrete and continuous random variables via their probability distributions and summary statistics such as means and standard deviations, as well as the relationships between two random variables in terms of covariance, correlation, and simple regression models.", "The concepts of hypothesis testing and confidence intervals, and the fundamentals of statistical inference are discussed for basic features of random variables and for comparing the features of more than one random variable.", "View requirements for ECON 221", "evaluate and conduct elementary data analysis", "use probability theory to model uncertain outcomes", "conduct basic statistical inference", "Introduction (First lecture)", "Estimators and Inference on the mean: Chapter 8 of K", "Inference on the variance and the chi-square distribution: Chapter 11 of HID", "Students will submit two files: plain-English data analysis in one text file and the associated computer code used to conduct the analysis in another text file.", "Exercises will be given and reviewed.", "Economics Department Deferred Final Exam Policy", "Applications for Accommodation", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 9, "course_code": "ECON 371", "course_name": "ECON371 - Business Finance 1 (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["ECON 371", "ECON 371 001", "Office hours will be both in person and through MS Teams on a first-come-first-serve basis.", "Email: prajsic@uwaterloo.ca", "“ECON 371” must appear in the subject line and the message must include your full name and student ID number.", "The course develops both the conceptual framework and the tools required for these decisions.", "View requirements for ECON 371", "It describes major players and types of financial instruments in financial markets, and it offers the general framework of financial landscape.", "This course will describe the basics of how firms and individuals make investment decisions and how they finance their investments.", "The goal is to understand financial markets and investment strategies.", "The understanding of the most important financial problems leads to strategic planning and analytical understanding of possible solutions.", "Today’s financial decisions are critical for the successes of the businesses in the future.", "This course will help students develop skills applicable to financial decision-making processes within businesses as well as in their personal lives.", "understand the need for firms and individuals to make financial decisions and together work towards overcoming the universal problem of scarcity;", "appreciate the relevance of finance in a changing world;", "Explain why maximizing market value is the logical financial goal of the corporation", "Calculate and interpret some key measures of firm performance", "Interpret price-earnings ratios", "Calculate present and future values of streams of cash payments", "Define and understand the fundamental features and elements of stocks and bonds", "Use financial models to evaluate stocks and bonds", "Interpret the relationships between financial markets and information", "Perform interest rate conversions from APR to effective rates and vice versa", "Develop loan amortization schedules using loan terms", "Explain what a yield curve is and why short-term interest rates affect its shape", "Identify the cash flows properly attributable to a proposed new project", "Use sensitivity, scenario, and break-even analysis to evaluate the financial impact of forecasting errors", "Introduction to Business Finance:", "Corporate Finance and the Financial Manager", "Corporate Finance and the Financial Manager", "Introduction to Business Finance:", "Financial Statement Analysis", "Introduction to Business Finance:", "Financial Statement Analysis", "The Valuation Principle: The Foundation of Financial decision Making", "The Valuation Principle: The Foundation of Financial decision Making", "Bonds", "Bonds", "Fundamentals of Capital Budgeting", "Fundamentals of Capital Budgeting", "In that case, the quiz will be a mix of questions from all the chapters we covered so far.", "I will set constant weights for each student of 25% for the first midterm and 30% for the second midterm in Learn, but I will be adjusting those weights individually in my Excel sheet when calculating final grades at the end of the semester.", "The purpose of the review quizzes is to help students identify and understand key concepts covered in the lectures and in the textbook.", "Under the Training & Support tab, you will find helpful information including technical support.", "Midterms and Final Exam", "The format for midterms and the final exam will be a mix of multiple-choice questions, numerical calculation questions, and written problems.", "Missing a Midterm Due to Self-Isolation", "Please carefully read the Economics Department policy on deferred final exams for instructions.", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "Economics Department Deferred Final Exam Policy", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 10, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 11, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 12, "course_code": "MGMT 220", "course_name": "MGMT220 - Entrepreneurship and the Creative Workplace (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Email: r8mclean@uwaterloo.ca", "The first explores entrepreneurship as a key input to economic activity.", "The design of an appropriate strategy and the implementation of this strategy through appropriate controls and structure are considered in the context of the innovative firm.", "Develop entrepreneurial and intrapreneurial skills for personal and professional development.", "Apply strategic design principles to business plans.", "2. Understand and apply fundamental aspects of entrepreneurial thinking across disciplines and as a means of personal and professional development.", "3. Explain concepts, theories, and practices employed in entrepreneurship and the role entrepreneurship plays in the global economy and society.", "5. Evaluate new venture opportunities to determine their strengths, weaknesses, and overall business potential.", "Sept 11: Entrepreneurship & economic activity", "Sept 16: Finding Opportunities & Blue Oceans", "Week Five – Financial Requirements and Market Feasibility", "Week Ten – Business Plans and Business Models", "Week Eleven – Existing Business Models", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page."]}, {"course_id": 13, "course_code": "SCBUS 122", "course_name": "SCBUS122 - Management of Business Organizations (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Ghajaa Senthilkumaran - g3senthilkumaran@uwaterloo.ca", "Be sure to mark your section number and name in the Subject line.", "This course introduces and applies common tools used by managers such as the Business Model Canvas and frameworks like Decision Making and Project Management models.", "Managerial skills such as communication (oral and written), working in and leading teams and critical thinking will be a focus, using current events and real life scenarios in business and organizations to learn from.", "Identify the roles leaders and managers play within an organization, in particular the important role of Science and Innovation in organizations", "Apply a decision making framework taking into account ethical concerns and other criteria", "General Information", "Teams should escalate quickly to Faculty if they need help resolving critical team issues.", "Students failing the final exam will receive a maximum grade of 45%", "Notice of Recording", "It is not appropriate to attend a session you are not enrolled in, without talking to the instructor first", "You can self-declare an absence on Quest in certain situations.", "The dates affected and degree of incapacitation will be used to determine follow-up action.", "Offenses include the following:", "Avoidance of Academic Offenses", "All students are expected to know what constitutes an academic offense and thereby avoid committing them by doing the following:", "Resolution of Academic Offenses", "Instructors must notify the Associate Dean of the infraction in writing with all supporting evidence.", "Copyright Information", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline).", "Intellectual property includes items such as:", "Writing and Communication specialists offer one-on- one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "Phone: 519-884-0000 extension 213"]}, {"course_id": 14, "course_code": "SCBUS 123", "course_name": "SCBUS123 - Workshop 1: Science and Business (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["03:30PM - 04:20PM", "Email: kmemon@uwaterloo.ca; https://www.linkedin.com/in/kashifmemon/", "This workshop addresses concepts of technology development and related marketing aspects that undertake an analysis of a firm's existence, its physical and/or social media presence, and customer feedback.", "Students work in collaborative teams to tackle case studies and class exercises.", "This involves conducting a PESTLE and SWOT analysis, market planning, information retrieval strategies, scientific business forecasting, competitive intelligence, and product development.", "In this introductory Business Development Workshop, you will learn how to go about understanding and generating business development ideas.", "Through the development of a full-fledged marketing plan for your product or service you will participate in the planning and preparation of your own Business Development Strategy.", "You will consider the overall impact this change will have on your development as a Science and Business student.", "Remember that every time you promote your product the first question asked is do you have a strategy?", "This course will be the first step in developing a strategic plan.", "The Product", "3. Define Product and Marketing:", "4. Strategic Planning: SWOT Analysis", "Measuring your product’s demand: Market Demand", "Analyze business behaviour and business markets", "Selecting Target Markets", "Positioning your product over the life cycle", "Manage your Product", "Manage Channels", "This means you will act and communicate professionally, as you will with co-workers.", "Work professionally in groups and contribute to the group objectives and product.", "Deliverables", "Participation in class discussions is required and will be graded using the criteria outlined below in table – A. Marks for contribution to class discussions will be based on how well your comments relate to key concepts in the course.", "Please ask students to complete the absence declaration form in Quest in lieu of email request to yourself or a conversation.", "Student makes regular high-quality contribution", "relates the issues under discussion to key concepts in the", "understanding of topics but does not relate the issues", "under discussion to key concepts in the course.", "name tag displayed in majority of classes.", "relate issues under discussion to key concepts in the", "Very minimal contribution to class discussions, MS TEAMS", "No contribution to class discussions, MS TEAMS group", "Surprise Product/Service and Analysis Presentation 10%", "It contains very important on responsibilities of each team member within the project.", "Bring and display a name tag during all in-person sessions.", "If this might be the case for you, please clarify with myself and the course TA’s by email at the beginning of term so we can be sure to attribute your marks to you.", "Excuses such as “I was not comfortable in reporting the member that did not want to work” are not acceptable and will result in poor marks for the entire group.", "It is the responsibility of each member to report non-contributing members early on.", "As individual team members, your responsibilities include serving as a team leader and being a team player.", "To help your group define a clear understanding of responsibilities, each group will prepare a group contract at the beginning of term.", "A fragmented or disjointed submission assignment created by a group working primarily in isolation will most likely be obvious and of poor quality leading to a poor grade.", "Note: Missing APA citations, in-text or full references list page, missing correspondence between in-text citations and reference section, and missing APA formatting will result in a mark of zero out of THE TOTAL MARK in the assignment.", "THE ONE AND ONLY EXCEPTION", "Please refer to in-text citation, reference list, general formatting and sample paper and other tabs as needed for 7th edition APA citation and formatting guidelines.", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline).", "Re-creating test questions and answers without the express permission of the course instructor", "Case Study: A Flood of Water Consumption Choices P 23", "Product/Service choice to be first come first served basis.", "P&G Segments Its Market Along Multiple Dimensions P191", "SURPRISE PRODUCT AND ANALYSIS PRESENTATION", "SURPRISE PRODUCT AND ANALYSIS PRESENTATION", "SURPRISE PRODUCT AND ANALYSIS PRESENTATION", "SURPRISE PRODUCT AND ANALYSIS PRESENTATION", "Concepts Revision and MyBusiness"]}, {"course_id": 15, "course_code": "SCBUS 223", "course_name": "SCBUS223 - Workshop 2: Strategies Behind Technological Innovation (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Workshop 2: Strategies Behind Technological Innovation Fall 2024", "03:30PM - 04:20PM MC 4021", "Students working in groups analyze real business ventures, their launch, and growth, synthesizing major field research to develop a term deliverable in the form of a company report and final project presentation.", "Students engage in experiential learning involving theory, case studies, scientific team debates, and critical reasoning.", "SCBUS 223 Strategies Behind Technological Innovation", "Email: kmemon@uwaterloo.ca; https://www.linkedin.com/in/kashifmemon/", "Email : djhaveri@uwaterloo.ca", "A warm welcome to everyone!", "Email: djhaveri@uwaterloo.ca", "Students will also organize an in-depth written and oral presentation of the results of the study, while working as a member of a team.", "It is important to recognize that there is no “best practice” to manage innovation and hence to understand the true meaning of innovation the course will be supplemented by case studies “Innovation Debates” from Harvard Business Review, specific case studies from the textbook, and class discussions.", "This means you will act and communicate professionally, as you will with co-workers.", "Work professionally in groups and contribute to the group objectives and product.", "Deliverables", "Participation in class discussions is required and will be graded using the criteria outlined below in table – A. Marks for contribution to class discussions will be based on how well your comments relate to key concepts in the course.", "This will be enforced, and attendance will not be recorded for late comers.", "Please ask students to complete the absence declaration form in Quest in lieu of email request to yourself or a conversation.", "Student makes regular high-quality contribution", "relates the issues under discussion to key concepts in the", "understanding of topics but does not relate the issues", "under discussion to key concepts in the course.", "name tag displayed in majority of classes.", "relate issues under discussion to key concepts in the", "Very minimal contribution to class discussions, MS TEAMS", "No contribution to class discussions, MS TEAMS group", "Submit the Summary of the assigned case to the Case Study Summary LEARN Dropbox by MONDAY Afternoon BY 1.00 pm each week before their presentation the next class.", "These Innovation Debates bring 2 groups against each other every week.", "It contains very important on responsibilities of each team member within the project.", "Panel Boards", "This will be enforced, and attendance will not be recorded for late comers.", "Excuses such as “I was not comfortable in reporting the member that did not want to work” are not acceptable and will result in poor marks for the entire group.", "It is the responsibility of each member to report non-contributing members early on.", "As individual team members, your responsibilities include serving as a team leader and being a team player.", "To help your group define a clear understanding of responsibilities, each group will prepare a group contract at the beginning of term.", "A fragmented or disjointed submission assignment created by a group working primarily in isolation will most likely be obvious and of poor quality leading to a poor grade.", "Note: Missing APA citations, in-text or full references list page, missing correspondence between in-text citations and reference section, and missing APA formatting will result in a mark of zero out of THE TOTAL MARK in the assignment.", "THE ONE AND ONLY EXCEPTION", "Please refer to in-text citation, reference list, general formatting and sample paper and other tabs as needed for 7th edition APA citation and formatting guidelines.", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline).", "Re-creating test questions and answers without the express permission of the course instructor", "2:30-4:20", "Company choice to be first come first served basis.", "For example, “the company promised us and backed out” or “we are trying to find a company in our field of interest are not acceptable.”", "Innovation Debate 1 – Group 1 vs. Group 2", "You Need an Innovation Strategy", "It’s the only way to make sound trade-off decisions and choose the right practices.", "Does every innovation need a “strategy”?", "innovation can survive without a strategy)", "Innovation Debate 2 – Group 3 vs. Group 4", "Turn Your Science into a Business", "Oliver Alexy", "Innovation Debate 3 – Group 5 vs. Group 6", "Lean business model", "Steve Blank", "MVP, minimum viable product” and “pivoting are key concepts in this.", "The lean startup is a bad and bankrupt philosophy for mediocre people with mediocre vision and ambition", "For example, “the company promised us and backed out” or “we are trying to find a company in our field of interest are not acceptable.”", "The information needs to be comprehensive and clear.", "successful innovations in emerging markets that", "are then exported as knowledge and", "each market has its own innovation needs/", "How Apple Organizes for Innovation", "[DJ1]wording a little confusing"]}, {"course_id": 16, "course_code": "SCBUS 225", "course_name": "SCBUS225 - Organizational Behaviour in Scientific and Technical Workplaces (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Organizational Behaviour in Scientific and Technical Workplaces Winter 2025", "Avneet Dhiman", "TBA", "This workshop uses case studies, lectures, and discussions to explore a basic understanding of how organizations work, and how people interact within organizations in order to achieve ethical human, organizational, and social objectives.", "This course considers organizational structure and models, ethics, organizational theory, organizational culture, motivation, diversity, negotiation, communication, leadership, and management, and how these principles are applied in start ups or scientific and technical environments.", "SCBUS225 explores the behavior of individuals and groups in organizations.", "The course looks at job performance and organizational commitment, explores personal behaviors and their impact, examines relational skills and finally considers organizational structure and change.", "Define, summarize, and explain the core concepts or Organizational Behaviour - Individual outcomes, Individual Characteristics and Mechanisms, Relational Mechanisms and Organizational Mechanisms", "Describe and explain the connections between Organizational Behaviour concepts", "Evaluate the workplace performance of yourself and others and be able to assess motivations, stress, personality and other OB factors to get a new desired outcome", "In", "In", "Introduction and", "Welcome and Intro to", "Personality and EI", "Stress / Decision Making", "Cultural Differences and Organizational Commitment", "Motivation", "Teams", "In-Class Individual Case Analysis", "Power, Influence and Negotiation", "Individual Case Analysis", "Peer evaluations are used because group case exercises represent a considerable portion of your overall course grade.", "During the second week of classes, you will choose a team.", "Submission Times"]}, {"course_id": 17, "course_code": "SCBUS 323", "course_name": "SCBUS323 - Workshop 3: Technology Development (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "SCBUS 323 - Technology Development Fall 2024", "The major class project focuses on the development of a business plan for a product that could be commercialized.", "View requirements for SCBUS 323", "By the end of this course, you will develop the concept and business model for your own technology-based product, and demonstrate this idea using a prototype or proof of concept.", "Identify a Business Opportunity", "Market Analysis", "Industry Analysis", "Technology Analysis", "Formulate Problem", "Stakeholders", "Ideate Solution", "Technical solution", "Business Model", "Prototype Solution", "Prototyping techniques", "User Testing", "Scaling", "Persuading users", "Synthesize trends in different industries, markets and areas of technology to identify high-impact business opportunities", "Formulate a specific technical problem that can be solved based on the synthesis", "Plan a product development cycle to develop and prototype a technology-based solution to the formulated problem", "Design a technical solution and business model that could be used to benefit from the business opportunity", "Prototype and test the concepts relevant to the proposed technical solution and business model to demonstrate their feasibility, and product-market fit", "Pitch the technology-based product to various stakeholders to persuade a funder to invest in your product, and entice users to use the product", "In addition to its own Learning Outcomes, this course integrates knowledge and concepts relevant to product design and development from your other courses.", "Working in teams (team canvas, team charter, team roles and strategies, motivation, stages of team development, conflict and crisis resolution, leadership, team norms and ways of working) - SCBUS 122", "Business models - MGM 220", "Ethical decision making (utilitarian, golden means, duties-based and rights-based ethics, ethical problem solving process) - SCBUS 122, 225", "As each group selects a unique product to develop, you will also have an opportunity to develop your lifelong learning and independent self-learning capabilities.", "Introduction", "Product Lifecycle and Development", "Identify", "Problem formulation", "Requirements and User Stories", "User Need and Empathy Map", "Service Environment", "Stakeholders", "Formulate", "Creative Problem Solving and Design Thinking", "Solution Development Process", "Idea Generation and Selection", "Design", "Technology and Innovation", "Identify", "Customer Discovery Model", "Knowing Your Business Environment", "Design", "Fundraising and Incubation", "Quantified Metrics and Risks", "Detailed Design", "Prototyping and Testing", "Scaling Up and Long Term Trends", "DFX and Broader Considerations", "Business plans and pitches", "Presentation 3: SCBUS 323 Technology Development Spotlight", "Ethics of Product Design", "Design", "Exam Period", "Assignment 3: Product Design Documentation", "Ms Teams Used as a file repository and communication tool for teams Yes", "Assignment 3: Product Design and Business Model report + investment one-pager 20%", "Presentation 3: Product Demo and Interactive Pitch 10%", "In-class activities", "Participation in each question will score you one point.", "You will be graded as follows for each in-class activity:", "Team1-week1-class_activity", "Progress Meetings and Reports", "ITP Metrics will be used for Peer Assessment.", "Understanding of concepts beyond that of the typical junior student.", "4.5", "Understanding of the concepts and their importance, along with insight into how they can be used to optimize team performance.", "A strong positive force that makes a beneficial contribution to the team, in addition to bringing out the best in other team members.", "Understanding of the concepts and their importance.", "3.5", "Understanding of the concepts and their importance.", "Understanding of the concepts and their importance, and exhibit a growth trajectory at the end of the term.", "2.5", "Understanding the concepts and their importance.", "Understanding of the concepts.", "Superficial understanding of most basic concepts.", "Superficial understanding of some concepts", "Sparse understanding of the concepts.", "No understanding of the concepts.", "The professionalism of your communications with your team,  and members of the teaching team", "Negative Behaviour - Major Infraction", "Missing team meetings without valid reason or advanced notice to the team (handled on a case by case basis)", "Any minor infraction with intent to deceive or commit fraud (handled on a case by case basis)", "Negative Behaviour - Minor Infraction", "No greeting", "Positive Behaviour", "Creativity in activities (good brainstorming, use of flip charts to keep the ideas flowing, etc)", "Receives constructive feedback well", "Gives constructive feedback well", "Exhibited a pattern of self-improvement over the course of the term", "Notice of Recording", "General Information", "Students may request a meeting in person to give evidence of the error and to explain the problem.", "Misinterpretation of a course concept", "Working in Groups", "To help your group define a clear understanding of responsibilities, each group will prepare a team charter at the beginning of the term.", "The Attribution Table should be reviewed by all of the team members prior to submission to make sure that all members agree on the information given in the table.", "If the Attribution Table indicates a substantial discrepancy in contribution (i.e. a large difference in team member contributions) then the marks assigned to individual team members for the assignment may reflect this discrepancy.", "If the instructor is convinced that there was a discrepancy in contribution (as shown in the attribution table), then the instructor will decide on a reduced mark for the team member(s) who contributed substantially less.", "A team member doing a larger share of the work WILL NEVER receive a higher mark than the team mark.", "Your Instructor can help you resolve these issues and help you, as a team, develop strategies for working successfully with each other.", "Remember: most projects do NOT fail for technical reasons; they fail because of planning and team problems.", "Firing a team member is a strategy of last resort.", "The team will issue a warning E-mail to the person informing him or her of the situation, i.e. that the person will be fired from the team unless change occurs.", "The E-mail must use a professional tone and cite specific behaviours that the person must change in order to remain part of the team and deadlines for those changes to occur.", "The goal of these meetings is to:", "This is done in a E-mail copied to the instructor.", "Quitting a team is a strategy of last resort.", "You will issue a warning E-mail to your team informing them of the situation, i.e. that you are ready to quit the team unless change occurs.", "The E-mail must use a professional tone and cite specific behaviours that the team must change in order for you to stay.", "The goal of these meetings is to:", "This is done in a E-mail copied to the instructor.", "The E-mail shall briefly cite the reasons for the departure.", "If you are ever in doubt whether something constitutes plagiarism ask a member of the teaching team.", "It is best practice to reference even public domain images where possible.", "It is unethical and illegal to give away intellectual property that does not belong to you without the permission of the owner, in this case the whole team.", "Intellectual property includes items such as:", "Writing and Communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "A list of the main services provided below:", "Good2Talk, free confidential helpline for post-secondary students - 1-866-925-5454", "KW Sexual Assault Support Centre - 519-741-8633"]}, {"course_id": 18, "course_code": "SCBUS 423", "course_name": "SCBUS423 - Workshop 4: Strategic Management of Science and Business (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["okey.igboeli@uwaterloo.ca", "Current real-world issues and problems in the strategic management of start-ups and scientific/technology companies are addressed, based on the use of publicly available information including research findings.", "Ongoing identification and implementation of new processes, service, products and/or product designs are important for growth and business viability in both established traditional companies, and entrepreneurial start-up firms.", "Strategic planning and focused implementation of strategic decisions are necessary to sustain corporate growth.", "Importance of strategic planning and implementation", "Environment analysis", "Strategic positioning and competitive advantage", "Implementing strategy", "Change management related to strategic decisions", "Explain concepts involved in strategic planning and implementation.", "Create corporate values and purpose that align with the strategic positioning of the specific firm.", "Apply critical thinking and problem-solving skills relevant to strategic planning.", "6  Chapter 11 Crossan et al  Introduction to assigned case studies", "11  Review of key concepts     Individual strategic analysis due 24 November at 11:30 pm on LEARN", "Strategic Analysis and Action Edition: 9th", "Apple Inc.", "Seso Global: Building a Blockchain-enabled Property Marketplace in Nigeria", "Marks for contribution to these discussions will be based on how well your comments relate to key concepts in the course.", "10  Student made high quality contribution to discussions, demonstrates excellent understanding of topics, relates the issues under discussion to key concepts in the course.", "8  Student demonstrated good understanding of topics, but did not relate the issues under discussion to key concepts in the course.", "6  Student made infrequent contribution to discussions and did not relate issues under discussion to key concepts in the course.", "3  Very minimal contribution to discussions; lacks understanding of key concepts.", "Individual strategic analysis assignment: Provide a comprehensive strategic analysis of the company approved for you, demonstrating use of key concepts covered in the course.", "The document will cover all key aspects of strategic planning and implementation, including potential risks involved in execution, and ways to mitigate them.", "To help your group define a clear understanding of responsibilities, each group will prepare a group contract at the beginning of the term.", "Group members may divide the responsibility for particular parts of the report as they choose and assign a part or parts to individual group members.", "In this case, I will inform you with a short email and the class will be automatically notified by the LEARN notification system, so make sure you turn it on.", "This means you will act and communicate professionally, as you will with co-workers.", "Work professionally in groups and contribute to the group objectives and product."]}, {"course_id": 19, "course_code": "AFM 123", "course_name": "AFM123 - Accounting Information for Managers (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Accounting Information for Managers Winter 2025", "AFM 123 001", "AFM 123 003", "School of Accounting and Finance (SAF) students in the Accounting and Financial Management program, please contact: SAF Academic Advisor, Undergraduate Studies", "AFM 123: View requirements for AFM 123", "Students will obtain a fundamental understanding of financial and management concepts, and an appreciation of the measurement issues and monetary impact of business decisions on communities, society and the environment.", "Topics include financial statement reporting and analysis, cost analysis, triple bottom-line reporting, corporate social responsibility including the Global Sullivan Principles, and green accounting.", "View requirements for INDEV 202", "It introduces the basic concepts and tools needed to help interpret a standard set of financial statements prepared and issued by a business enterprise.", "Prepare basic financial accounting transactions and statements and evaluate the results of basic financial statements.", "• introduction to financial accounting, forms of business ownership, and the fundamentals of business", "• financial accounting and adjusting entries", "• accounting for employee payroll", "• introduction to managerial accounting", "• cost terms, concepts and classifications", "• cost-volume-profit analysis", "• short-term decision making", "• operational and capital budgeting", "Second, you have chosen a career where verbally expressing you views, ideas and concerns will be important to your long-term success.", "Participating in the classroom with your team members and interaction with the instructor and TA’s is a great way to hone this skill.", "Employers want students who know how to be team players.", "For instance, figuring out how to launch a product in a new market is just one example.", "Or, business managers working at a hospital might have to design a strategy to reduce the cost of services while also improving the quality.", "A team should also establish processes, such as how often the team will meet, how long those meetings might be, what kind of records will be kept.", "Listening is a critical skill for being a team player.", "Students in groups should be learning from their teammates.", "They might have a solution for a team problem, but their team member might have a better one.", "Doing so will create a deeper relationship.", "You should use these opportunities to test your understanding of the material and identify where you might be confused.", "Class sessions will be a combination of lecture, problem solving and discussion.", "You are required to read the assigned reading and study the assigned problems before each class / weekly module.", "Team Projects Contribution", "A general comment like “I believe I deserve more” will be ignored.", "Your commentary must identify a specific concern with the grading on your work.", "Cross-listed courses", "For example, a AFM/ARBUS cross-list will count in a ARBUS major average, even if the course was taken under the AFM subject code.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "Library for research-based assignments", "I-clickers/Electronic Polling Tools", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 20, "course_code": "ARBUS 102", "course_name": "ARBUS102 - Accounting Information for Managers (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Accounting Information for Managers Winter 2025", "AFM 123 001", "AFM 123 003", "School of Accounting and Finance (SAF) students in the Accounting and Financial Management program, please contact: SAF Academic Advisor, Undergraduate Studies", "AFM 123: View requirements for AFM 123", "Students will obtain a fundamental understanding of financial and management concepts, and an appreciation of the measurement issues and monetary impact of business decisions on communities, society and the environment.", "Topics include financial statement reporting and analysis, cost analysis, triple bottom-line reporting, corporate social responsibility including the Global Sullivan Principles, and green accounting.", "View requirements for INDEV 202", "It introduces the basic concepts and tools needed to help interpret a standard set of financial statements prepared and issued by a business enterprise.", "Prepare basic financial accounting transactions and statements and evaluate the results of basic financial statements.", "• introduction to financial accounting, forms of business ownership, and the fundamentals of business", "• financial accounting and adjusting entries", "• accounting for employee payroll", "• introduction to managerial accounting", "• cost terms, concepts and classifications", "• cost-volume-profit analysis", "• short-term decision making", "• operational and capital budgeting", "Second, you have chosen a career where verbally expressing you views, ideas and concerns will be important to your long-term success.", "Participating in the classroom with your team members and interaction with the instructor and TA’s is a great way to hone this skill.", "Employers want students who know how to be team players.", "For instance, figuring out how to launch a product in a new market is just one example.", "Or, business managers working at a hospital might have to design a strategy to reduce the cost of services while also improving the quality.", "A team should also establish processes, such as how often the team will meet, how long those meetings might be, what kind of records will be kept.", "Listening is a critical skill for being a team player.", "Students in groups should be learning from their teammates.", "They might have a solution for a team problem, but their team member might have a better one.", "Doing so will create a deeper relationship.", "You should use these opportunities to test your understanding of the material and identify where you might be confused.", "Class sessions will be a combination of lecture, problem solving and discussion.", "You are required to read the assigned reading and study the assigned problems before each class / weekly module.", "Team Projects Contribution", "A general comment like “I believe I deserve more” will be ignored.", "Your commentary must identify a specific concern with the grading on your work.", "Cross-listed courses", "For example, a AFM/ARBUS cross-list will count in a ARBUS major average, even if the course was taken under the AFM subject code.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "Library for research-based assignments", "I-clickers/Electronic Polling Tools", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 21, "course_code": "AFM 131", "course_name": "AFM131 - Introduction to Business in North America (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Introduction to Business in North America Winter 2025", "AFM 131", "Coverage also includes study of the principles of effective management and the financial system as a source of corporate capital.", "View requirements for AFM 131", "Describe the business environment and the relationships between the functional areas of business", "Write in a professional manner to effectively communicate in the appropriate context (e.g., in a discussion board)", "Demonstrate collaboration skills (i.e., understanding, respect) to work effectively in a team during discussions", "Penalties for Academic Integrity Offenses", "48 hour short-term absence", "Self-declared COVID-related absence", "Intellectual property includes items such as:", "Cross-listed courses", "Phone: 519-884-0000 extension 213", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 23, "course_code": "AFM 231", "course_name": "AFM231 - Business Law (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["07:00PM - 09:50PM", "Students can contact the course instructor via email at rhussein@uwaterloo.ca.", "Particular attention is given to the law relating to contracts and business organizations.", "AFM 231: View requirements for AFM 231", "While the course introduces you to basic concepts in law, it is designed for, and particularly emphasizes topics that will be of specific relevance to you as future business managers, owners, or even practicing professionals.", "This includes understanding the basics of legal risk so you can make more effective business decisions.", "Business managers/owners often must engage in risk management exercises.", "Appreciate the complexity of integrating multiple private law concepts into the analysis of a business situation.", "Utilize a basic framework for legal risk management assessments and generate an inventory of possible legal risk management tools.", "Describe the common as well as contrasting relationship between legal compliance and ethical conduct.", "March 24-28", "Wrap-up", "Accordingly, if students do opt to use an older edition it would be advisable to use an edition that is as close to the 8th edition as possible and consider cross-referencing it to the current edition and noting any differences.", "Completion", "The response demonstrates a clear understanding of the relevant course concepts and effectively applies these concepts to the hypothetical scenario.", "Application to Real-World Example", "The response includes an appropriate real-world example that relates to the course material, illustrating how the concept can be applied outside the context of the hypothetical.", "Students may also include a revised answer based on a similar but different set of hypothetical facts.", "For example, a student may propose one solution based on the given facts but suggest a different solution if the facts were altered.", "Students are expected to demonstrate critical thinking and clearly articulate their reasoning.", "Each quiz covers content that relates to the current course content (the current chapters and occasionally a prior chapter as well if it has not yet been part of a quiz).", "Submission Times", "Reevaluation Request", "Requests for re-evaluation of submitted material can be done via email.", "Also, students should detail what their concern as specifically as possible.", "Artificial Intelligence Tools", "Also, some evaluation elements are structured such that it may be even quicker to do it yourself than to utilize an AI tool and then further edit/revise before submission.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 24, "course_code": "LS 283", "course_name": "LS283 - Business Law (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["07:00PM - 09:50PM", "Students can contact the course instructor via email at rhussein@uwaterloo.ca.", "Particular attention is given to the law relating to contracts and business organizations.", "AFM 231: View requirements for AFM 231", "While the course introduces you to basic concepts in law, it is designed for, and particularly emphasizes topics that will be of specific relevance to you as future business managers, owners, or even practicing professionals.", "This includes understanding the basics of legal risk so you can make more effective business decisions.", "Business managers/owners often must engage in risk management exercises.", "Appreciate the complexity of integrating multiple private law concepts into the analysis of a business situation.", "Utilize a basic framework for legal risk management assessments and generate an inventory of possible legal risk management tools.", "Describe the common as well as contrasting relationship between legal compliance and ethical conduct.", "March 24-28", "Wrap-up", "Accordingly, if students do opt to use an older edition it would be advisable to use an edition that is as close to the 8th edition as possible and consider cross-referencing it to the current edition and noting any differences.", "Completion", "The response demonstrates a clear understanding of the relevant course concepts and effectively applies these concepts to the hypothetical scenario.", "Application to Real-World Example", "The response includes an appropriate real-world example that relates to the course material, illustrating how the concept can be applied outside the context of the hypothetical.", "Students may also include a revised answer based on a similar but different set of hypothetical facts.", "For example, a student may propose one solution based on the given facts but suggest a different solution if the facts were altered.", "Students are expected to demonstrate critical thinking and clearly articulate their reasoning.", "Each quiz covers content that relates to the current course content (the current chapters and occasionally a prior chapter as well if it has not yet been part of a quiz).", "Submission Times", "Reevaluation Request", "Requests for re-evaluation of submitted material can be done via email.", "Also, students should detail what their concern as specifically as possible.", "Artificial Intelligence Tools", "Also, some evaluation elements are structured such that it may be even quicker to do it yourself than to utilize an AI tool and then further edit/revise before submission.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 26, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 27, "course_code": "BIOL 110", "course_name": "BIOL110 - Biodiversity, Biomes, and Evolution (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Labs begin the week of **Sept. 9**", "(Any issues in laboratory should contact Dr. Wolff)", "Monitor LEARN for important information", "A survey of organisms that inhabit a range of aquatic and terrestrial ecosystems (e.g., coral reefs, lakes, forests).", "Evolutionary and ecological frameworks will be used to explore how organisms diversify and are considered distinct species.", "The laboratory for this course is integrated with the lecture (unlike some of your other first year courses) - you will need to be sure to read the lab exercises before attending, and come prepared for our outdoor labs where appropriate shoes and clothing are necessary for the weather.", "I teach courses in ecology, evolution and genetics.", "I have been teaching evolution and ecology at the University of Waterloo for 7 years, and I hope to share with students my enthusiasm for phylogenetics.", "List themes and characteristics that differentiate the major groups of eukaryotes.", "Identify specific animals that facilitate and/or endanger human society.", "Construct and evaluate phylogenetic trees using parsimony", "Introduction", "Phylogeny and the modern view of biological relatedness", "Ecosystems and Resource Flux", "**Oct. 28  Midterm**", "Concepts in Diversity", "Activities will include using microscopes and drawing what you see, dissections of preserved animals, and collecting benthic invertebrates from the local stream and identifying them using pictoral keys.", "Note: You can also choose to do neither and forego the bonus mark altogether, as this is voluntary.", "Participation in Research Study", "Reminder, as participation in this study is voluntary, and it is a bonus mark, students may also decide to not do either activity and forego the bonus mark altogether.", "Notice of Recording", "In the case of an unwritten final exam, your course mark will be entered as DNW (32% for calculation of overall average)."]}, {"course_id": 28, "course_code": "BIOL 130", "course_name": "BIOL130 - Introductory Cell Biology (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "An introduction to the concepts of cell biology with emphasis on (1) the structural organization of the cell and (2) the function of critical molecular processes that are characteristic of living organisms.", "Explain the fundamental elements of cells, the chemistry of life, and the major classes of biological macromolecules.", "Describe metabolism, the role of enzymes in chemical reactions, and how cells can capture, and utilize, energy.", "Explain how cells respond to signals and form cellular communities.", "Module 1 - Introduction to Cell Biology & The Cell Theory", "Module 2 - Molecules of Life", "2 Module 3 - Cells and Membranes  In-class case study", "3 Module 4 - Nucleic Acids & Information Flow", "4 Module 5 - Protein Structure, Function & Synthesis  In-class case study", "6 Module 7 - Cellular Respiration In-class case study", "In-class case study", "9 Module 9 - Cell Signalling", "10 Module 10 - Cell & Tissue Form", "and In-class case study", "11 Module 11 - DNA Replication & Cell Division Case study due", "12 Module 11 - DNA Replication & Cell Division  Term Test 1", "Official Grades and Course Access", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each module for the achieve assignments and term tests.", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines", "Library for research-based assignments"]}, {"course_id": 29, "course_code": "BIOL 150", "course_name": "BIOL150 - Organismal and Evolutionary Ecology (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Organismal and Evolutionary Ecology Fall 2023", "11:30AM - 12:20PM RCH 101", "Learn Discussion Board", "Email and Appointment Requests", "Coverage includes hypothesis testing and the nature of scientific inquiry, basic population genetics, physiological ecology, life histories, dispersal, basic population and community ecology, macroevolution, systematics and classification, as well as functional morphology.", "The theory of evolution unites the whole of biology and all living organisms into a coherent body of knowledge, allowing comparisons across all forms of life.", "Ecology describes how organisms interact with their environment and each other to create interdependent systems from microscopic to global scales.", "These disciplines are fundamentally tied together: evolution is the primary mechanism by which species adapt to their environment; ecological interactions and environmental variability drive natural selection.", "You will also carry out simulated lab assignments to test the principles of evolution, design ecological experiments to test alternate hypotheses about the conservation of species and manipulate demographic parameters to test their influence on population growth.", "Understand the principles of scientific methodology", "Define ecological and evolutionary terms, such as the niche, adaptation, and altruism", "Illustrate these mechanisms in the context of course examples", "Explain how ecological interactions and evolution are interconnected", "Sign code of conduct and upload to LEARN.", "2) Sept 8 Evolution for Ecology Section 1: Evolution and Ecology are Intertwined", "4) Sept 13 Evolution for Ecology", "5) Sept 15 Evolution for Ecology Section 3: Genetics and Evolution", "6) Sept 18 Evolution for Ecology Section 4: Managing the Evolution of Resistance", "9) Sep 25 Physiological Ecology Section 1: Trade-offs and Species Distributions", "15) Oct 9-13 Holiday – No classes Understanding Experimental Design Simulation due by Oct 16, 11:59 pm", "16) Oct 16 Empiricism in Ecology Understanding Experimental Design Simulation due by 11:59 pm (best 2/3 for 10%)", "It is important that you review the information below before you subscribe to the SimUText for Organismal Ecology and Evolution - Chapters at University of Waterloo.", "SimUText Application Installers", "SimUText Application Installers", "At the end of every unit, you will work individually to develop a concept map using Cmap Cloud to visually display the relationships among what you consider the key concepts in the unit.", "These should represent your personal comprehension of how the concepts relate to each other, and no two should be identical.", "Also, class will entail a lot of discussion that won’t be represented in PPT slides.", "The simulations include one on Evolution in Ecology, one on Experimental Design in Ecology and one on Population Growth.", "The learning outcome for the unit tests is to demonstrate your recall and comprehension of the material covered in the units and to incentivize keeping up with the readings and attending lectures and reviewing for the final exam.", "The learning outcome is to demonstrate recall, synthesis and integration of material learned during the course.", "The final exam will consist of multiple-choice, T/F, solve the equation type of questions and integration questions that are designed to test your basic and deeper understanding of the course concepts.", "Important note regarding tests and exams", "Unit tests will be completed for the first 4 units of the course.", "Ensure you have a reliable internet connection and functional computer to complete them – technical challenges encountered during remote completion are not an excuse for missed tests.", "I will have a limited number of printed back-ups for students in class who experience technical difficulties.", "You will need to have a reliable internet connection and functional computer to complete the exams.", "Emails can be received 24 hours per day.", "If you miss a make-up exam for any reason, you will be given a DNW, and must petition the Associate Dean of Science if you feel you missed it for a valid reason.", "At the discretion of the instructor, you may be permitted to write a make-up exam.", "The timing will be conveyed to you via e-mail if you are eligible for a make-up.", "If you follow these steps,", "I will consider granting an extension", "Students are responsible for their own behavior and should be mindful of the impact that their actions have on the wellbeing of others.", "Act in a respectful and open manner when listening to the views and ideas of others.", "Participate fully in the discussion boards: make sure your answers are to the best of your ability and that you respond to others’ posts.", "Signature"]}, {"course_id": 30, "course_code": "BIOL 165", "course_name": "BIOL165 - Diversity of Life (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "An introduction to the diversity of living organisms from simple prokaryotes to complex eukaryotes.", "The characteristics that define these phyla", "Be able to compare and contrast life histories", "Introduction and Cell Biology", "Phylogeny and Classification", "Bacteria and Archaea", "Protists", "Library for research-based assignments"]}, {"course_id": 31, "course_code": "BIOL 201", "course_name": "BIOL201 - Human Anatomy (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["09:30AM - 10:20AM STC 1012", "Email messages not adhering to these conditions will not be read and will be deleted.", "This course takes a systems approach to study the structure of the human body and its relationship to function.", "Structural features of organ systems will be explored through lectures and laboratory exercises.", "Note that these recordings are NOT guaranteed nor are these recordings meant to be a replacement for in-person learning.", "Develop a vocabulary to effectively communicate anatomical concepts", "Recognize and identify the anatomical structures of all of the organ systems of the human body", "Demonstrate an understanding of anatomical structures through laboratory sessions", "Week 1 Introduction to Human Anatomy & the Integumentary System", "Week 3 Bones and the Skeleton - part 2 & Skeletal Muscle", "Week 8 Endocrine System & Circulatory System - part 1", "Week 10 Respiratory System & Digestive System", "Official Grades and Course Access", "This will be followed by an exploration into the appendages of the skin.", "Initially basic structure, location, and classification of bones will be explored.", "This will be followed by an examination of select major skeletal muscles of the body.", "The basic divisions of the nervous system will be introduced in the unit.", "A gross overview of the nervous system anatomy will precede further discussion on the anatomy of the central nervous system (CNS) and peripheral nervous system (PNS).", "Unit 6 – Endocrine System (Chapter 17)", "This will be followed by an examination of the major endocrine organs and other structures associated with the endocrine system of the body.", "The circulatory system will be discussed in this unit.", "The anatomy of the respiratory system will be examined in this unit.", "This will be followed by the anatomy of the upper and lower respiratory components.", "The anatomy of the digestive system will first be examined in this unit.", "This will be followed by the anatomy of the urinary system will be examined including the kidneys followed by the ureters and the urinary bladder.", "Expectations for Change"]}, {"course_id": 32, "course_code": "BIOL 211", "course_name": "BIOL211 - Introductory Vertebrate Zoology (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["10:30AM - 11:20AM M3 1006", "An introduction to the structure, evolution, and development of vertebrate organ systems, explored through lectures and laboratory exercises.", "Understand the diversity of vertebrates that exist in the world", "Know some of the anatomy, physiology, reproductive strategies, behaviour and ecology of vertebrates", "Be familiar with the basic techniques of dissection through laboratory sessions", "Introduction to vertebrate zoology", "Bony fishes", "Adaptations of synapsids & sauropsids", "Turtles", "Tuatara, lizards & snakes", "Bird origins & adaptations", "Lab Manual Introduction to Vertebrate Zoology Available at bookstore Yes 28", "Call number UWD 1528"]}, {"course_id": 33, "course_code": "BIOL 220", "course_name": "BIOL220 - Introduction to Plant Structure and Function (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Introduction to Plant Structure and Function Winter 2025", "11:30AM - 12:20PM RCH 101", "S. Schoor", "I will make my best effort to respond to emails within 24 hrs.", "An introduction to plant diversity, and the anatomy and physiology of vascular plants.", "Understand the importance of the relationship between plants and humans in the environment and appreciate the species richness and diversity of plants", "Recognize and identify various cell types and how they account for the structure and function of tissues and organs", "Plant Evolution: Structure and Reproduction", "Focus will be applied to the adaptive strategies employed by algae to move from water to land, the development of complex tissues and organs and the role of reproduction strategies in plant success.", "Cellular composition of plant tissues and what role they play in their function will be studied; with particular interest in the relationship between vascular tissue and water transport.", "Additionally, students will study how hormones and growth regulators regulate plant development, tropic movement and plant response to biotic and abiotic stressors, as well as learn of their many uses in agriculture.", "Week 1 Jan 6 (1) Introduction & The Plant Cell (Ch 1,3) No labs this week", "Laboratory Mark Distribution", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline)."]}, {"course_id": 34, "course_code": "BIOL 239", "course_name": "BIOL239 - Genetics (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["11:30AM - 12:20PM", "10:30AM - 11:20AM STC 1012", "You can!", "Chromosomal mechanisms in mitosis and meiosis.", "Natural selection and the evolution of genetic systems.", "Describe the fundamentals of gene structure, function and transmission in prokaryotic and eukaryotic cells and organisms.", "Describe the various ways mutations can arise and how mutations may affect gene expression and phenotypic outcomes.", "Describe recombinant DNA technology in bacteria and its role in biotechnology.", "Effectively work with others, discussing, evaluating, and communicating genetics concepts and synthesizing ideas in a group.", "Readings", "textbook 1.1-1.2", "Mendelian genetics and probability", "Modification of Mendelian ratios", "textbook 3.2-3.3, 4.2-4.4, 15.1", "Mitosis, meiosis, and chromosome numbers", "DNA and the genetic code", "textbook 9.2-9.3", "T4: Mitosis and meiosis", "DNA cloning", "T5: Testing genetic ratios", "Cancer genetics", "T9: Population genetics", "Exam period", "- write the final exam and achieve a grade of at least 50% on the cumulative test and exam section", "Online learning activities: These activities are designed to test your knowledge of several important concepts explained by the lecture presentations in this course, and should be completed after the portion of the course when they are covered in lecture.", "They are all due toward the end of the term but can be completed as many times as you like to help you work on these concepts.", "Read the instructions carefully before attempting these as a completion quiz (in the quiz section) must also be completed to obtain credit.", "In this case, the weight of the missed submission will be transferred to the final exam.", "The dates affected and degree of incapacitation will be used to determine follow-up action."]}, {"course_id": 35, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}, {"course_id": 36, "course_code": "BIOL 241", "course_name": "BIOL241 - Introduction to Applied Microbiology (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introduction to Applied Microbiology Winter 2025", "RCH 101", "Course Lecturer: Dr. Kesen Ma; kma@uwaterloo.ca; office hours & virtual meetings (Zoom) by appointment only", "Laboratory Instructor: Dr. Cheryl Duxbury; cduxbury@uwaterloo.ca; office hours & virtual meetings (Microsoft Teams) by appointment only", "Introduction to microbial ecology, environmental microbiology, food microbiology, and medical microbiology explored through lectures and laboratory exercises.", "Topics in environmental microbiology include biogeochemical cycling and biological treatment of wastes and pollutants.", "Topics in medical microbiology include concepts of immunology and host-pathogen relationships.", "microbial ecology", "bacteria-bacteriophage interactions", "biodegradation and bioremediation • sewage treatment", "industrial microbiology", "host-parasite relationships - factors in microbial pathogenicity, innate barriers in the host", "immunology - innate, adaptive", "immunization; immune response diseases", "Extend Biol 240 and cover topics such as the diversity of microbial metabolism and habitat, the importance of microbes in nutrient cycling, biological treatment of pollution, use of microorganisms for the production of food, pharmaceuticals, and the role of microbes in human disease.", "Know the importance of microbes to life as we know it, and the applications of useful microbial characteristics.", "Enhance understanding of the roles that microbes play in the natural world .", "Learn more skills in aseptic laboratory techniques and know how to conduct some classical microbial testing of food, water, and soil.", "Lecture topics and relevant textbook chapters", "2021 & 2017.", "Microbial Ecology", "2. Bacteria-Bacteriophage Interactions", "Terrestrial & Aquatic Environments", "5. Biodegradation & Bioremediation", "Food & Industrial Microbiology", "(spoilage & preservation", "food & industrial processes)", "Immunology", "(innate, adaptive immunity,immunization & immune response diseases)", "Infectious Disease", "*note: this is the same textbook as used in BIOL 240 & BIOL 240L. The new 3rd edition of the book can be accessed via a subscription through Wiley ($57 for 150-day subscription, $134.95 for a lifetime subscription:", "This manual cannot be ordered online and must be purchased in person prior to your first lab.", "Both exams will be in a multiple-choice format (e.g., multiple choice, true/false, matching questions, fill in the gap).", "Notice of Recording", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Allowed", "Allowing under certain conditions", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 37, "course_code": "BIOL 251", "course_name": "BIOL251 - Fundamentals of Ecology (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM B2 151", "02:30PM - 05:20PM B2 151", "Mike Allen", "Email: mike.allen@uwaterloo.ca", "Email: brwolff@uwaterloo.ca", "Claire Schon", "Email: d4andradepereira@uwaterloo.ca", "This course provides students with an introduction to the breadth of the ecology discipline, including laboratory and field components.", "It covers hypothesis testing and the nature of scientific inquiry, organismal, population, community, and ecosystem levels of ecology.", "Lab 2: Prepare test populations of bean beetles to use in a population estimation exercise; set up a capture/mark/recapture experiment using the Lincoln-Peterson Method; examine the results of the experiment using basic statistics to determine the reliability of the Lincoln-Peterson Method under these conditions; prepare a short report conveying the results, along with comments on the experimental design etc.", "Lab 4: Understand the life history of goldenrod, gall flies and their predators; be able to dissect galls and identify larvae using a dichotomous key; collect gall/larval data and hypothesize about any interactions between the species involved.", "12 Nov 18-22 Eutrophication Analysis"]}, {"course_id": 38, "course_code": "BIOL 266", "course_name": "BIOL266 - Introduction to Computational Biology (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Introduction to Computational Biology Fall 2022", "Instructor: Prof. Andrew Doxey", "This course provides an introduction to computational methods in biology, including exploration of bioinformatics databases and tools, analysis of protein and DNA sequences, and computer-aided modelling of biological systems.", "Explore online bioinformatic databases to interact with DNA, protein, gene expression, structural, and systems biology data", "Compute optimal alignments between pairs of sequences using dynamic programming algorithms", "Perform multiple sequence alignments", "Perform 3D structural modelling and visualization of proteins", "Examine and analyze gene expression data from microarrays and RNA-seq experiments", "Understand the fundamentals of systems biology including network analysis and visualization of interactomes", "Data Type", "Introduction   None", "Molecular evolution I Trees Lab #4 - Phylogenetics I 2.2%", "Molecular evolution II Trees MIDTERM 30%", "Molecular evolution III Trees Lab #5 - Phylogenetics II 2.2%", "Structural modelling and biophysics Structures Lab #6 - Structural Modeling 2.2%", "Networks and Systems Biology Networks Lab #9 - Exploring the STRING database 2.2%"]}, {"course_id": 39, "course_code": "BIOL 273", "course_name": "BIOL273 - Principles of Human Physiology 1 (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM M3 1006", "M. Bording-Jorgensen", "Dr. Vivian Dayeh - Tuesdays 11:30 am -12:30pm in B1-277.", "The physiology of major organ systems of the human body.", "Topics include neurophysiology and peripheral nervous system, muscle, the cardiovascular system, the components of blood, respiratory system, and immune system.", "The combination of BIOL273 and BIOL373 covers all of the major topics of human physiology.", "Identify the components/structures of the following organ systems: nervous, muscular, cardiovascular, respiratory, and immune.", "Describe how these five organ systems are organized in the human body.", "Explain the function of each of these five organ systems.", "Demonstrate the integration of these five organ systems in maintaining homeostasis.", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Official Grades and Course Access", "Corresponding Silverthorn textbook chapters in parentheses for each unit.", "This unit serves as an introduction to the study of the function of the five organ systems examined in this course (nervous, muscular, cardiovascular, respiratory, and immune).", "Unit 1 will introduce how the organ systems work together to maintain homeostasis within the body.", "The organization of the nervous system will be explored in this unit.", "The types of cells found in the central and peripheral nervous system serve as a starting point to discuss their function within the nervous system.", "Initially gross structure of skeletal muscle including the structure of a muscle fibre and myofibrils will be examined.", "An exploration into the muscle contraction mechanism via excitation-contraction coupling will be examined to explain how muscles work.", "This unit will start with an introduction into the heart and components of the cardiovascular system, which will be followed by cardiac muscle contraction mechanism.", "In this unit we will examine the structure and function of the respiratory system, incorporating gas laws and ventilation.", "Pulmonary function through lung compliance and elastance as well as the control of ventilation will be examined.", "This unit will start with the general function of immune system and introduction to the types of pathogens that infect the body.", "The anatomy of the immune system will be discussed returning to the role of haematopoiesis.", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each unit for the assignments and term tests.", "Required for the Mastering A&P Online Assignments and Dynamic Study Modules.", "Course website Waterloo Learn https://learn.uwaterloo.ca - includes general course information, language of physiology online assignment, review sheets for each unit, and links to the Mastering A&P Online Assignments.", "Emails can be received 24 hours per day.", "Students should carefully consider the wisdom of missing a test or assignment.", "Mastering A&P assignments handed in late will receive a deduction of 5%/day for the first five late days after which a grade of zero (0) will be recorded.", "Notice of Recording", "Don’t waste your time with these requests!", "Expectations for Change", "This course includes the independent development and practice of specific skills, such as multiple choice question creation.", "Library for research-based assignments", "Disability-related Policies"]}, {"course_id": 40, "course_code": "EARTH 121", "course_name": "EARTH121 - Introductory Earth Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Introductory Earth Sciences Fall 2024", "Students will learn to think like a geoscientist by adopting four ways of thinking that take into account a systems approach, a variety of spatial and temporal scales, and field thinking.", "Recognize the dynamic nature of Earth through an examination of the interactive components of the Rock Cycle.", "Extrapolate meaning from everyday geologic material and predict occurrence and origin.", "Week 1: Introduction and Four Ways of Thinking 1a and 1b Discussion: Introduce Yourself", "Week 2: Introduction to Rocks 2a Field Notes Journal 2: Are minerals important?", "Week 3: Introduction to the Rock Cycle 2b Field Notes Journal 3: What do you see in the video?", "Week 4: Introduction to the Rock Classification 2c Field Notes Journal 4: Is this depiction of the Rock Cycle complete and accurate?", "Week 5: Geologic Time and Geologic Time Scale 3a and 3b Field Notes Journal 5: How do I create a simplified Geologic Time Scale?", "Please note emails can be received 24 hours per day", "Short-term Absence", "Covid-19-related Absence", "Intellectual property includes items such as:"]}, {"course_id": 41, "course_code": "EARTH 121L", "course_name": "EARTH121L - Introductory Earth Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Introductory Earth Sciences Laboratory Fall 2024", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Email: keith.delaney@uwaterloo.ca", "Sahar Soltani - sahar.soltani@uwaterloo.ca / LABS 001 & 003", "By far, the majority of people qualified as geologists spend their time using their knowledge working 'in the field', or in exploration, putting principles learned in theory and in the laboratory, into practice.", "Identify common mineral and rocks based on their identification properties", "Understand the rock cycle and how minerals and rocks are formed", "Understand the theory of plate tectonics and how it has shaped the Earth's surface over time", "Qualitatively and Quantitatively describe earthquakes and some of their processes", "Read and interpret data from both topographic and geologic maps", "Understand the immense history and geologic record of our planet", "Understand the factors influencing climate change and quantify how the planet is changing", "Will assess Mineral and Rock Identification knowledge with real samples.", "Lab 8 Earth Structures", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "Situation where VIFs are not Appropriate"]}, {"course_id": 42, "course_code": "EARTH 122", "course_name": "EARTH122 - Introductory Environmental Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Introductory Environmental Sciences Winter 2025", "08:30AM - 09:50AM STC 1012", "I hold a PhD in Earth & Environmental Sciences from the University of Waterloo (2014) and an HBSc in Earth & Environmental Sciences from McMaster University (2006).", "You might notice I'm looking pretty pregnant!", "I'm conveniently due on April 27 BUT in the unlikely even that I have a baby really early, the excellent Dr. Keith Delaney (who has taught this class for many years) will step in at the end.", "Discussions", "Questions of a personal nature", "Office: EIT 2051D (very back of Earth & Environmental Sciences main office)", "Email: msrosamo@uwaterloo.ca", "Grad TA contact info can be found in the EARTH 122L syllabus.", "Course topics include sustainable development and the availability and use of natural resources, principles of ecology and environmental science, biogeochemical cycles, climate and climate change, soils and food supply, energy systems, surface water and groundwater, waste generation and management, pollution, and catastrophic natural processes.", "Describe common global environmental issues and the role of environmental science in identifying, understanding, and solving these issues.", "Interpret and manipulate simple box models of environmental systems", "Interpret scientific diagrams and graphs pertaining to environmental science", "1 January 06 - 10 Intro to Environmental Science & Matter, Energy and Physical Environment Chps 1 & 2", "2 January 13 - 17 Earth Systems/Ecosystems & Evolution, Biodiversity, Population Ecology Chps 3 & 4", "3 January 20 - 24 Species Interactions/Community Ecology & Human Population Chps 5 & 6", "Soils & Soil Resources*", "8 February 24 - 28 Freshwater Systems/Water Resources & Marine, Coastal Systems, Fisheries Chps 11 & 12 Quiz 6 - Chapters 11 & 12 Content Mon. Mar 3  5:00PM 3", "10 March 10 - 14 Global Climate Change & Fossil Fuels: Energy Use/Impacts Chps 14 & 15", "Energy Alternatives & Mineral Resources & Mining", "Quiz 8 - Chapters 15 & 16 & 17 Content*", "12 March 24 - 28 Managing our Waste & Environmental Health Hazards Chps 18 & 19 Quiz 9 - Chapters 18 & 19 Content Mon. Mar 31 5:00PM 3", "A Look at Environmental Science and Natural Hazards & Final Exam Study Guide / Discussion", "following these guidelines: https://uwaterloo.ca/science-undergraduate-office/academic-policies-and-procedures/accommodation-illness-or-other-extenuating-circumstances."]}, {"course_id": 43, "course_code": "EARTH 122L", "course_name": "EARTH122L - Introductory Environmental Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introductory Environmental Sciences Laboratory Winter 2025", "EARTH 122L", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Sana Ahmad has a BSc degree in Honours Co-op Environmental Science with a Geoscience Specialization from the University of Waterloo.", "Discussions", "Questions of a personal nature", "Office: EIT 2046 (within the Earth & Environmental Sciences main office)", "Email: s76ahmad@uwaterloo.ca", "Please put EARTH 122L in your email subject line so I don't miss it!", "Please do not send them personal emails!", "View requirements for EARTH 122L", "Use GPS devices and GIS software to locate points of interest and create a map", "ALL LABS ARE HELD IN ROOM: EIT 1013 (ground floor of EIT  - same building as Earth Sciences Museum)", "8 February 24 - 28 Coastal Processes and Problems: Loving Our Coasts to Death?", "10 March 10 - 14 On-Campus Water Sampling and GPS Data Collection Field Sampling and Data Collection Lab around UW Campus", "13 March 31 - April 03 Landscape Geology: Glaciers and Deserts & Climate Change: Pleistocene Records, Milankovitch Cycles Lab 8: Landscape Geology and Climate Change End of Lab 7%", "Note used copies are also fine!", "The format of the final exam will be run digitally through the LEARN Quiz system in the last week of the course, not during the formal exam period.", "Notice of Recording", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "These can be completed digitally now!", "This official verification is necessary before any action can be taken and can be downloaded from the Health Services website.", "Situation where VIFs are not Appropriate", "Example citations:", "\"References"]}, {"course_id": 44, "course_code": "PHYS 111", "course_name": "PHYS111 - Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["An introduction to physics for students intending to concentrate their further studies in biology, dentistry, medicine and paramedicine; includes particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.", "The main physics principles and laws covered in PHYS 111 include: “Particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.”", "PHYS 111 focuses on basic physics principles and laws, on conceptual understanding and problem-solving skills, and an appreciation for the power of physics in explaining how nature works, in the contexts of both the physical and life sciences.", "Physics Principles and Laws: By the end of the course, students will be able to construct scientifically sound explanations of a variety of basic physical phenomena by applying basic physics principles/laws.", "define linear momentum, and calculate and compare momenta of various real-life objects;", "define and calculate impulse, and establish the conditions for conservation of linear momentum; and", "apply the laws of conservation of momentum and energy to collisions.", "Problem-Solving Skills and Strategies: By the end of the course, students will be able to creatively apply a variety of structured problem-solving strategies:", "interpret, visualize and convert the problem into a physical model (e.g., draw a free body diagram);", "evaluate the result — does it make sense?", "These problem-solving skills are useful in the students’ own disciplines and beyond.", "More detailed information about the course elements which contribute to the final grade will be given in the learn sight and in future outline updates", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 45, "course_code": "PHYS 111L", "course_name": "PHYS111L - Physics 1 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "Derin Erisoglu-Akyildiz", "Saba Karimi", "Do Yun Park", "jbschrie@uwaterloo.ca", "s38karim@uwaterloo.ca", "first for minor issues", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "12 & 13", "Complete end-of-term surveys before Dec. 3", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 46, "course_code": "PHYS 112", "course_name": "PHYS112 - Physics 2 (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:30AM - 11:20AM DC 1350", "S. Idziak", "08:30AM - 09:20AM", "Email: idziak@uwaterloo.ca", "Email: james.forrest@uwaterloo.ca", "A continuation of PHYS111; includes simple harmonic motion, electrostatic force and potential, electric current and power, DC circuits, magnetic field and induction, wave motion, sound, and optics.", "To develop the ability to solve problems in areas related to oscillations and waves, electricity and magnetism, and optics", "Understand physical concepts associated with oscillations, waves, sound, electricity and magnetism, and optics", "Apply concepts of force and energy and recognize when acceleration is not constant", "Solve simple physical systems using physical concepts", "Draw relevant sketches from information given in word problems", "Develop physically relevant equations from information given in word problems", "Convert complex problems into a series of sub-problems and solve", "Topic Textbook Chapters                                                                            Number of lectures", "Electric Forces & Fields (Serway) Chapter 15: 1-5", "Electric Potential & Energy (Serway) Chapter 16", "Current and Resistance (Serway) Chapter 17: 1-6", "Magnetic Flux & Induction   1", "College Physics: A Strategic Approach by Jones, Knight, and Field This was suggested for 111.", "I do not find that these books are great but they are available for no cost.", "Please help to create a welcoming and inclusive environment.", "An exam-like problem will be posted each week on LEARN.", "2 points will be given for each clicker response with an additional 1 point for each correct response.", "What happens if I join the course late:", "Missed a regular assignment:", "Emails can be received 24 hours per day.", "Remember that falsely claiming you are ill can result in academic polices per Policy 71.", "Email communications:", "Notice of Recording"]}, {"course_id": 47, "course_code": "PHYS 112L", "course_name": "PHYS112L - Physics 2 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Sean Dougherty", "Aney Kapadia", "Kayra Erisoglu-Akyildiz", "jbschrie@uwaterloo.ca", "s2doughe@uwaterloo.ca", "Course Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"'", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 3 - Circuits", "Experiment 4 - Circuits", "Experiment 5 - Circuits", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 48, "course_code": "PHYS 121", "course_name": "PHYS121 - Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["An introductory course in physics for students intending to concentrate their future studies in the physical sciences, optometry, or mathematics; includes vectors (dot and cross products), particle kinematics and dynamics, forces in nature, work and energy, conservation of energy and linear momentum, rotational kinematics and dynamics, and conservation of angular momentum.", "Doing Physics - quantities, dimensions, units", "Point Dynamics - force, motion, Newton's laws", "Conservation of Energy - work and energy, conservative systems", "Conservation of linear Momentum - momentum and systems of particles", "Understand the following concepts:", "- Linear kinematics: the relationship between distance, velocity and acceleration.", "- Linear dynamics: a consequence of forces and momentum, and how they interrelate.", "- Kinetic energy, potential energy, work, and their interrelationships.", "We will also re-examine these concepts in a rotating coordinate frame using angular kinematic variables along with torque and angular momentum.", "6 Module 06:  Kinetic and Potential Energy", "7 Module 06:  Kinetic and Potential Energy", "8 Module 07:  Linear Momentum", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- eText + Student Access Code", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- Print Format + Student Access Code"]}, {"course_id": 49, "course_code": "PHYS 121L", "course_name": "PHYS121L - Mechanics Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Mechanics Laboratory Fall 2024", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "Julian Meunier", "Soorna Choheili", "Reza Asadi", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "complete introductory surveys", "complete introductory surveys,", "Complete end-of-term surveys", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 50, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 1, "major_name": "Science and Business (Bachelor of Science - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}]