[{"course_id": 8, "course_code": "BME 162", "course_name": "BME162 - Human Factors in the Design of Biomedical and Health Systems (0.50)", "term_name": "1B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Human Factors in the Design of Biomedical and Health Systems Winter 2025", "10:00AM - 10:50AM E5 6008", "09:30AM - 11:20AM E5 6004", "Email: jenny.howcroft@uwaterloo.ca", "Design of human-machine environments, designing for patient safety and reduce human error in decision-making, analytical methods of determining user needs, information processing and human sensory processes and consideration of these elements in the design of systems with humans, and consideration of human physical capabilities in ergonomic design.", "Students will be exposed to human factors engineering concepts and analytical techniques relating to user experience and usability design, physical workplace design, and complex system design through lectures, assignments, case studies, and tests.", "Outline and illustrate a basic understanding of human physical and psychological capabilities and how these affect a person’s ability to work and interact with technology.", "2. Demonstrate a human-centered view to solving problems and introducing new technologies.", "Apply human factors engineering concepts to evaluate technologies and workplace interventions.", "Apply risk analysis techniques to develop a complete and holistic understanding of a case study or real-world incident involving human error.", "Appreciate the ethical responsibilities when conducting human factors/user research.", "Knowledge Base - Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "Problem Analysis - An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "Investigation - An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "Design - An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, and economic, environmental, cultural and societal considerations.", "Communication Skills - An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Professionalism - An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Impact of Engineering - An ability to analyze social and environmental aspects of engineering activities.", "Such ability includes an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society, the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Lifelong Learning - An ability to identify and to address their own educational needs in a changing world in ways sufficient to maintain their competence and to allow them to contribute to the advancement of knowledge.", "Design: HF & Engineering & Design.", "Unit 4. HF & Design.", "Design: Contextual Inquiry.", "Design: Interviews & Questionnaires.", "Perception & Memory.", "Attention & Vigilance.", "Casey Double Vision & Never Cry Wolf.", "Unit 4. HF & Design.", "Design: Ethics & User Testing.", "Unit 4. HF & Design.", "Heuristic Evaluation & Design Principles.", "Unit 4. HF & Design.", "Genie in a Bottle – Case Study.", "Casey Business in Bhopal, Genie in a Bottle.", "Casey Business in Bhopal & That Newfangled Technology.", "Physical Demands Analysis (PDA).", "“Designing for people: an introduction to human factors engineering.”3rd", "Students must email the instructor before the associated deadline to use these grace days.", "Deliverable Formatting:", "Grade penalties for not following formatting expectations may be applied at the discretion of the course instructor.", "Notice of Recording", "Sign your email with your first and last name and your student number.", "Any in-person deliverables (e.g., test) will be delayed on a case-by-case basis.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "They will review your case and coordinate a reasonable and fair plan in consultation with appropriate others (AccessAbility Services, Engineering Counselling services, Registrar's Office)."]}, {"course_id": 9, "course_code": "BME 186", "course_name": "BME186 - Chemistry Principles (0.50)", "term_name": "1B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["11:00AM - 12:20PM", "I am Assistant Professor in the Systems Design Engineering Department.", "I studied Biotechnology at TU Braunschweig, Germany, performed my PhD studies at the Leibniz Institute for Solid State and Materials Research IFW Dresden in Germany and Postdoctoral studies in Applied Zoology at TU Dresden and Institute for Bioengineering of Catalonia in Barcelona, Spain.", "My research interests include microrobotics for medical applications, particularly for drug and cell delivery, noninvasive surgery and reproductive medicine.", "I am a Lab Instructor in Biomedical Engineering.", "I’m Sadaf, a PhD candidate working under Professor Maud Gorbet.", "My research focuses on developing an in vitro model of ocular environment, utilizing both immortalized cells and immune cells isolated from human blood.", "Motahare Shabani, m8shabanidargah@uwaterloo.ca", "I am a PhD student of biomedical engineering in the Systems design engineering department under supervision of Dr. Magdanz.", "Elizabeth Diederichs, elizabeth.diederichs@uwaterloo.ca", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules, correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "Discussion of the structure, nomenclature and reactions of important classes of organic compounds.", "Stereochemistry and its role in reaction mechanisms.", "This course will also include an introduction to electrochemistry, analytical chemistry, surface chemistry, polymers and applications of chemistry principles in biomedical engineering.", "Understand energy changes in chemical systems based on laws of thermodynamics (GA1,2,3,5)", "Understand basic concepts of organic chemistry (GA 1,3)", "Realize the role of chemistry in developing new materials in biomedical engineering (GA1,2,3,5)", "Interpret and analyze experimental results (GA 1,3)", "Graduate attributes Attributes Attribute Definition", "1 Knowledge Base Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "2 Problem Analysis Ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3 Investigation Ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "4 Design An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, and economic, environmental, cultural and societal considerations.", "Ability to create, select, apply, adapt and extend appropriate techniques, resources and modern engineering tools to a range of engineering activities", "7 Communication Skills An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Background quiz", "3. Electronic structure of atoms", "Surface Chemistry", "Chemical Bonds", "Polymers", "Chemical kinetics", "Acids & bases, pH scale", "March 23-26", "Carboxylic acids & esters", "Analytical Chemistry", "April 7-9 Study & preparation", "In case of technical issues with LEARN contact: learnhelp@uwaterloo.ca.", "3.Sign your email with your first and last name and your student number.", "Workshops will be delayed or transitioned to an online session on a case-by-case basis.", "Students may declare a short-term absence once per term during the formal lecture period."]}, {"course_id": 10, "course_code": "SYDE 112", "course_name": "SYDE112 - Calculus 2 (0.50)", "term_name": "1B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Integration: improper integrals and applications.", "2. understand what a function of several variables can represent; visualize such functions (1a, 2a)", "3. understand the concepts of partial derivative, the gradient vector and the various forms of the chain rule (1a, 2a)", "6. understand how to describe curves and surfaces using parametric equations, for use in vector calculus (1a, 2a)", "a. Demonstrate understanding of concepts in mathematics", "2. Problem Analysis", "E-Text", "Roughly each week there will be a problem set posted for you to work on.", "There's also a built-in formula editor that ultimately pastes the LaTex code.", "Course Conduct: I am committed to creating a learning environment where diverse perspectives are recognized and valued as a source of strength.", "Phone: 519-884-0000 extension 213", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 11, "course_code": "SYDE 114", "course_name": "SYDE114 - Matrices and Linear Systems (0.25)", "term_name": "1B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Matrices and Linear Systems Winter 2025", "09:00AM - 10:50AM E5 6004", "Email: victoria.ann.kerr@uwaterloo.ca", "Shene Abdalla - smabdalla@uwaterloo.ca", "Matrix algebra, inverses, solution of linear systems, determinants, eigenvalues and eigenvectors, lower-upper (LU) factorization.", "This course covers the important and routine aspects of elementary linear algebra.", "The focus is on linear systems and their solution.", "The basics of matrix and vector algebra are also covered.", "Together, these topics provide a foundation for more advanced engineering math and applications.", "In addition to analytical techniques, you will learn about numerical methods for solving linear systems and predicting the accuracy of solutions obtained.", "1: Apply appropriate analytical and computational methods for manipulating matrices and solving linear systems (1a)", "2: Assess accuracy and precision for numerical solution of a linear system (1a)", "Solution of linear equations by row reduction.", "Vectors in Rn", "Solution sets of linear systems", "Linear Transformations", "Introduction to eigenvalues and eigenvectors.", "Linear Algebra, Fourth Edition by Jim Hefferson Available free: https://leanpub.com/linalgebra", "No extensions will be given after a submission date.", "Extensions will only be given for very serious issues, and will only be considered for the following circumstances:", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as critical thinking and mathematical reasoning.", "Library for research-based assignments"]}, {"course_id": 12, "course_code": "BME 182", "course_name": "BME182 - Physics 2: Dynamics (0.50)", "term_name": "2A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 11:20AM E5 6004", "E3-4114, ext.35341", "E3-3169", "Formulate and solve problems involving the kinematics of particles.", "Formulate and solve problems involving the dynamics of particles, using Newton's laws and the Principles of Work-Energy and Impulse-Momentum.", "Formulate and solve problems involving the kinematics of rigid bodies.", "Formulate and solve problems involving the dynamics of rigid bodies, using the Newton-Euler equations and the Principles of Work-Energy and Impulse-Momentum.", "If you experience any Covid symptoms, inform your instructors using the Self-Declared Verification of Illness system and stay home until you are feeling better."]}, {"course_id": 13, "course_code": "BME 281", "course_name": "BME281 - Mechanics of Deformable Solids (0.50)", "term_name": "2A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Mechanics of Deformable Solids Fall 2024", "BME 281", "BME 281 001", "BME 281 101", "Mechanical & Mechatronics Engineering Department", "Office: E3-2115", "Email: nchandra@uwaterloo.ca", "Introduction to mechanical response of materials and stress-strain relationship.", "Shear-force and bending-moment diagrams.", "Introduction to instability.", "Mechanical properties of biological tissues, and viscoeleastic models.", "Applications to bone, cartilage, and biomedical implants.", "View requirements for BME 281", "BME 281 is a required course for all 2A Biomedical Engineering students.", "This course serves as a fundamental course to understand the mechanical behavior of materials.", "The objective of this course is to introduce laws governing the elastic behavior of deformable solids and apply these laws to biological materials.", "What are the flexural properties of the stick?", "Given a structure and a loading, you will be able to identify critical section/s (sections that carry most load) of the structure and make sure they are strong enough to withstand the loading.", "One of the main trends in today’s design optimization is the reduction of the weight.", "We will start by introducing the concepts of stress and strains as measures of loading and deformation of bodies.", "The Hooke’s law of linear elasticity that sets a relationship between stresses induced in a member and corresponding deformation is introduced.", "Compound loading of structures and methods for identifying critical sections are then demonstrated.", "Calculation of maximum normal and shear stresses in a member through Mohr’s circle is introduced and combined with the failure criteria to examine the structural integrity of the components under different load cases.", "The course will end with introduction to mechanical behavior of biological materials.", "A knowledge base for engineering", "4. Design", "Impact of engineering on society and the environment", "Ethics and equity", "Economics and project management", "Life-long learning", "Chapter 9-Stress transformation", "11 Chapter 10-Deflection of Beams 2,5", "Chapter 12-Deflection of Beams", "Biological Materials", "A link will be emailed to the class and announced on Learn a few minutes before the scheduled start of lecture.", "A link will be emailed to the class and announced on Learn a few minutes before the scheduled start of lecture.", "Chapter 4:                   4.1-4.2, 4.6-4.7", "Chapter 8:                   8.1-8.2", "Biological Material:     Handout", "No make-ups will be given.", "All tests and exams are closed-book."]}, {"course_id": 14, "course_code": "BME 281L", "course_name": "BME281L - Mechanics of Deformable Solids Laboratory (0.25)", "term_name": "2A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Mechanics of Deformable Solids Laboratory Fall 2024", "08:30AM - 11:20AM DWE 3506", "08:30AM - 11:20AM DWE 3506", "08:30AM - 11:20AM DWE 3506", "Email: cyoung@uwaterloo.ca", "Srividya Kuppa", "Email: skuppa@uwaterloo.ca", "Email: a9woo@uwaterloo.ca", "BME 281L is a required course for all 2A Biomedical Engineering students.", "In this course students will use specialized tools to perform mechanical tests on various specimens, as well as collecting and analyzing data to quantify the mechanical properties of each specimen.", "D. Operate mechanical test equipment to quantify the mechanical properties of materials (5)", "Canadian Engineering Accreditation Board Graduate Attributes", "Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "3 - Investigation", "An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "6 - Individual & Teamwork", "7 - Communication Skills", "An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "September 9/11/12  Introduction and Calibration C, D, E, F Strain Gauge, Statistics, Python", "This course includes the independent development and practice of specific skills, such as writing and editing lab reports.", "There may be specific instances where Generative AI is permitted.", "• Library for research-based assignments", "Extensions will be provided if appropriate grounds for accommodation exist, details can be found under Administrative Policies below.", "Email and Communication Policy", "If you have emailed me and not received a response within 16 of my working hours, please feel free to send a follow-up email.", "Access code: il67bfxvss9", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate."]}, {"course_id": 15, "course_code": "BME 282", "course_name": "BME282 - Materials Science for Biomedical Engineers (0.50)", "term_name": "2A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Materials Science for Biomedical Engineers Fall 2024", "08:30AM - 09:50AM E5 6004", "Neel Sanjay Agarwal, nsagarwa@uwaterloo.ca", "Claire Thompson, c34thomp@uwaterloo.ca", "Factors in materials design, material selection and processing in the context of biomedical devices and instruments will also be discussed.", "Define the various ways atoms bond together to make common engineering materials (1b)", "Define mechanical properties of materials and relate them to atomic structure and imperfections in the atomic arrangements (1b, c)", "Understand how mechanical and thermal processing of material affects their atomic and microstructure, and the impact these changes have on mechanical properties (1b, c, d)", "Differentiate between different materials used in engineering and will be able to select appropriate materials for a given application.", "(unit cells, crystallographic points/planes/directions, ionic & covalent bonds, XRD)", "Sept 30      Imperfections in the Atomic and Ionic Arrangements               Ch. 4.1, .3-.8", "Nov 11       Selection of materials for biomedical applications                    Selections from Ashby", "Biomaterials: A Basic Introduction.", "Although the use of AI tools must be approved on a case-by-case basis, examples of acceptable uses of AI are: editing of students’ prewritten text, and generating charts and figures with students’ collected data.", "The general unacceptable uses of AI tools are: initial generation of text, interpretation of data, collating data from existing databases."]}, {"course_id": 16, "course_code": "BME 285", "course_name": "BME285 - Engineering Biology (0.50)", "term_name": "2A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Engineering Biology Fall 2024", "Introduction to basic concepts of biochemistry and cell biology.", "Structure and properties of proteins and enzymes.", "Elements of cell structure and diversity, and relationship of biochemistry with cell metabolism.", "A focus on biomedical engineering with relevant examples such as biomimetic engineering design, system biology, and tissue engineering.", "Communicate a basic understanding of biochemistry, cell biology, and molecular biology (1a)", "Converse at a fundamental level with doctors, scientists, and engineers who use biology (1a)", "Analyze technologies to identify their biochemistry, cell biology, and molecular biology components (12a, 12b, 12c)", "Apply basic engineering approaches including energy and material balances and transport phenomena to evaluate biological processes (3a, 3b, 3c)", "1a Demonstrate understanding of concepts in natural science", "3a. Create investigative studies of complex engineering problems", "Gather information from relevant sources to address complex engineering problems", "Synthesize information from multiple sources to reach valid conclusions", "Identify gaps in their knowledge, skills and abilities", "Course Introduction", "Be able to explain what differentiates life from non-life", "Describe common functional groups relevant to biochemistry", "Biochemistry", "Lipids I", "Describe the structure, function, and reactions of lipids", "Explain the diversity of lipids observed across the tree of life as a function of ecology", "Explain the nutritive role of lipids in the human diet", "Carbohydrates I", "Describe the structures of common sugars, including enantiomers", "Describe the structure, function, and reactions of polysaccharides", "Explain the diversity of polysaccharides observed across the tree of life as a function of ecology", "Explain the nutritive role of carbohydrates in the human diet", "A1 - Intro.", "Explain the structure and function of nucleic acids", "Describe the various structures of DNA and RNA", "Explain the diversity of nucleic acid polymers observed across the tree of life as a function of ecology", "Describe the diversity of properties among the 20 standard amino acids used by living systems", "Describe and differentiate between primary, secondary, tertiary, and quaternary protein structure", "Explain how intramolecular forces and intermolecular forces yield protein structures", "Proteins: Bioinformatics Databases", "Proteins & pH", "Explain the role pH plays in determining protein structure and function", "Enzyme Kinetics I", "Describe the functions of enzymes as catalysts", "Understand and describe how enzyme structure relates to function", "Describe how enzymes make reactions necessary for life possible", "Be able to derive Michaelis-Menten kinetics; understand and describe other saturation kinetics", "Enzyme Kinetics: Python, Nonlinear Regression", "Enzyme Kinetics II", "Be able to derive Michaelis-Menten kinetics; understand and describe other saturation kinetics", "Be able to parameterize M-M kinetics using nonlinear data", "Molecular Biology", "Enzyme Regulation", "Be able to describe the function of enzyme inhibition and allosteric activation", "Describe the structure and function of genomes in prokaryotes and eukaryotes", "Describe the process of replication, including the functions of associated enzymes, and explain why it is necessary", "DNA Replication: Sequence Manipulation Tools", "Explain the central dogma of biology and its exceptions", "Explain how transcription is regulated in prokaryotes and eukaryotes", "Compare and contrast the various RNAs", "Describe post-translational modifications and their role in regulating protein activity", "Describe mechanisms of translational regulation, both general and specific", "Transcription and Translation: Sequence Manipulation Tools", "Metabolism I", "Describe the structure, function, and roles of conserved metabolic pathways", "Be able to describe respiration in detail, including comparing and contrasting substrate-level and oxidative phosphorylation", "Understand how metabolism is organized in human tissues", "Metabolism: Pathway Tools, Flux Balance Analysis", "Cell Structure I", "Be able to identify common prokaryotic cellular structures, and differentiate Gram-stained cells", "Describe eukaryotic cellular structure in detail, including comparing and contrasting animal and plant cells", "Describe the structure and function of organelles", "Understand the diversity of cell types in the human body and the processes of cellular differentiation at a high level", "A4 - Molecular Biology (1a, 3c)", "Cell Structure", "Be conversant in emerging biotechnologies", "Practice peer-to-peer learning", "Other standard biochemistry texts may be accessed as required, but readings from Harper's Illustrated Biochemistry will be linked to course content.", "Exams", "Notice of Recording", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 17, "course_code": "BME 285L", "course_name": "BME285L - Engineering Biology Laboratory (0.25)", "term_name": "2A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Biology Laboratory Fall 2024", "BME 285L", "08:30AM - 11:20AM DWE 3506", "08:30AM - 11:20AM DWE 3506", "08:30AM - 11:20AM DWE 3506", "Instructor: Bisan Samara", "Office: E7-6344 and DWE-2518C", "Sadaf Mohsenkhani - smohsenk@uwaterloo.ca", "Chuchi Chen - chuchi.chen@uwaterloo.ca", "View requirements for BME 285L", "Cell biology laboratory: Experiments to study the principles of cell biology that are elaborated in introductory biology courses", "Collect biological data using fundamental cell biology techniques (3,5)", "Identify and apply appropriate investigative tools to study cell biology (3,5)", "Interpret and analyze experimental results (1,3)", "Recognize the importance of experimental design and safety in the collection of biological data (3,5,12)", "Canadian Engineering Accreditation Board Graduate Attributes", "Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "3 - Investigation", "An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "7 - Communication Skills", "An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "12 - Life-long Learning", "An ability to identify and to address their own educational needs in a changing world in ways sufficient to maintain their competence and to allow them to contribute to the advancement of knowledge.", "Lab flow-chart need to be prepared prior to the beginning of the lab.", "Some reagents will already be set up to use at your bench, while others will be in dispensing bottles on the side bench or in the fume hoods, in which case the liquid must be dispensed directly from the bottles.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "• Library for research-based assignments", "Extensions will be provided if appropriate grounds for accommodation exist, details can be found under Administrative Policies below.", "Email and Communication Policy", "If you have emailed me and not received a response within 16 of my working hours, please feel free to send a follow-up email.", "Access code: daasc3salyv", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate."]}, {"course_id": 18, "course_code": "SYDE 211", "course_name": "SYDE211 - Calculus 3 (0.50)", "term_name": "2A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "11:00AM - 11:50AM E5 6006", "11:00AM - 11:50AM E5 6006", "11:00AM - 11:50AM E5 6006", "Held in MC 6460", "Vector differential calculus: divergence and curl, line and surface integrals, fundamental theorems, applications.", "First order ordinary differential equations: analytical techniques and applications.", "Second order linear ordinary differential equations: systems of equations and applications.", "Numerical methods for solving ordinary differential equations (ODEs).", "1. classify and use appropriate techniques to solve first order differential equations (DEs) (1a, 2a)", "2. understand how various applications lead to first order DEs, and give a physical interpretation of solutions of such DEs (1a, 2a, 2b)", "3. use numerical methods to approximate solutions to first order DEs (1a, 2a)", "6. understand the interpretation of and be able to evaluate line and surface integrals of both scalar and vector fields (1a, 2a)", "7. understand the concepts of divergence and curl and use these to apply the major theorems of vector calculus (1a, 2a, 2b)", "a. Demonstrate understanding of concepts in mathematics", "2. Problem Analysis", "First Order Differential Equations", "separable, exact, and linear DEs", "numerical methods", "Second Order Differential Equations and Systems", "second order linear constant coefficient equations (homogenous and non-homogeneous)", "analysis of the oscillator DE", "homogeneous linear systems - method of eigenvalues; non-homogeneous systems", "phase portraits", "Vector Calculus", "vector fields; line integrals of scalar and vector fields;", "fundamental theorem for line integrals; Green's theorem", "surface integrals of scalar and vector fields; flux", "divergence and curl", "Difference Methods", "Elementary Differential Equations with Boundary Value Problems, by W. Kohler and L. Johnson 2nd edition No", "Roughly each week there will be a problem set posted for you to work on.", "These are meant as the core resource to become competent in the mathematical tools and principles you are studying.", "There's also a built-in formula editor that ultimately pastes the LaTeX code.", "The e-text for Kohler and Johnson is available on LEARN for purchase.", "Quizzes: There will be four quizzes each covering the content from the couple of weeks previous.", "Notice of Recording", "Remember that these models regularly produce inaccurate statements and should be treated more similarly to a peer than a teacher.", "Phone: 519-884-0000 extension 213", "Course Conduct: I am committed to creating a learning environment where diverse perspectives are recognized and valued as a source of strength.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 19, "course_code": "BME 213", "course_name": "BME213 - Statistics and Experimental Design (0.50)", "term_name": "2B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Statistics and Experimental Design Spring 2024", "RCH 307", "RCH 307", "RCH 307", "Fundamentals of probability and statistics, and applications to biomedical engineering.", "Applications to biomedical experiments, biomedical imaging data, and clinical trials.", "Define role statistics and probability play in engineering problem solving and decision making.", "Choose an appropriate probability distribution to model a specific problem.", "Apply the correct statistical test to a given problem.", "The numbers in brackets refer to Graduate Attributes as defined by the Canadian Engineering Accreditation Board.", "TIPS FOR SUCCESS", "Deliverables", "Introduction", "Course Introduction; Statistics and Engineering", "Introduction to sampling, summary and descriptive statistics", "Fundamentals, counting methods", "Linear Functions, Jointly Distributed Random Variables, Conditional Distributions, Covariance, Correlation", "Design of Experiments (Chapter 9)", "One-factor, Two-factor, Randomized Block Design", "Models, confounding and collinearity, model selection", "Statistical Process Control", "Group Presentations - Applications to Biomedical Experiments", "Probability and Statistics for Engineers and Scientists, 6th Edition, 2024.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 20, "course_code": "BME 252", "course_name": "BME252 - Linear Systems and Signals (0.50)", "term_name": "2B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Linear Systems and Signals Spring 2024", "03:30PM - 05:20PM", "RCH 307", "03:30PM - 04:20PM", "RCH 307", "04:30PM - 05:20PM", "RCH 307", "TAs are also available for help outside of class time, just email them to set up a meeting.", "Models and analysis of linear systems in the context of measurement and processing of biosignals such as electroencephalography (EEG), electrocardiography (ECG), and electromyography (EMG).", "Discrete and continuous time systems, difference and differential equations, impulse and frequency response, transform domain techniques, transfer functions and frequency response, frequency domain analysis of linear systems, sampling theory, stability, and linear filters.", "To facilitate timely and accurate communication we will use both electronic and face-to-face communication:", "be ready to extend the basic ideas of signal processing to more complex problems (2c, 3a, 3b)", "This course will have you demonstrate the following Graduate Attributes:", "1a - Demonstrate understanding of concepts in mathematics.", "1c - Demonstrate understanding of engineering fundamentals.", "2b - Develop models to solve engineering problems including identifying approximations, assumptions, and constraints.", "2c - Critically evaluate solutions of engineering problems.", "3a - Design experiments to investigate complex engineering problems.", "3b - Gather information from relevant sources to address complex engineering problems.", "Module 2: Frequency Domain Analysis - Week 7-13", "\"Linear Signals and Systems, 3rd ed.\"", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 21, "course_code": "BME 261", "course_name": "BME261 - Prototyping, Simulation and Design (0.50)", "term_name": "2B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Prototyping, Simulation and Design Spring 2024", "09:30AM - 11:20AM RCH 307", "Email: b4goswam@uwaterloo.ca", "Email: hpatil@uwaterloo.ca", "Email: smarashi@uwaterloo.ca", "Email: sdesoky@uwaterloo.ca", "Topics will be reinforced in the context of biomedical engineering projects conducted in groups within a collaborative environment.", "Prereq: Level at least 2B Biomedical Engineering", "BME 261, Prototyping Simulation and Design, is the third design course in the Biomedical Engineering course sequence.", "While BME 161 established a baseline for the design process, and BME 162 established methods of needs identification and human factors considerations, this course will focus on developing your skills related to ideation and prototype construction.", "Select appropriate design components for electrical and mechanical systems by applying knowledge of engineering analysis and simulation.", "Understand and address safety aspects in the design and testing of bioelectronic devices (GA 3d)", "Build functional electromechanical systems composed of basic components and subsystems.", "Knowledge Base - Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "Problem Analysis - An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "Investigation - An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "Design - An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, and economic, environmental, cultural and societal considerations.", "Communication Skills - An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Professionalism - An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Impact of Engineering - An ability to analyze social and environmental aspects of engineering activities.", "Such ability includes an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society, the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Lifelong Learning - An ability to identify and to address their own educational needs in a changing world in ways sufficient to maintain their competence and to allow them to contribute to the advancement of knowledge.", "Mechanical simulation/modeling &", "BME 284L Intro to Arduino", "Team User & Task", "Declarations", "Arduino", "Arduino I/O & Analog", "Control and Unit Testing", "Arduino Workshop", "Arduino", "Electromechanical actuation, Selection Mechanism and Servomotor Workshop", "Gallery Walk  - Mechanical Design Soldering Workshop", "June 24 - 18", "PCB Design, Breadboard Layout EMG Circuit Design &", "Autodesk Eagle", "attend E5-6007", "Signal sampling and processing for EMG.", "Arduino", "Prototype Show & Tell Classes End Report, Logs & ICLS", "SYDE-BME Electronic Prototyping kit Purchase from the WStore.", "These will be used in multiple courses this term.", "Blum, J. (2020) Exploring Arduino: tools and techniques for engineering wizardry Digitally available from The Waterloo Library No", "Constans E., Dyer K. (2019) Introduction to Mechanism Design with Computer Applications Digitally available from The Waterloo Library No", "Deliverable Formatting", "Grade penalties for not following formatting expectations may be applied at the discretion of the course instructor.", "Notice of Recording", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 22, "course_code": "BME 284", "course_name": "BME284 - Physiological and Biological Systems (0.50)", "term_name": "2B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Physiological and Biological Systems Spring 2024", "RCH 307", "02:30PM - 03:20PM", "RCH 307", "03:30PM - 04:20PM", "RCH 307", "The structure, functions, and properties of the major biological systems (musculoskeletal, nervous, cardiovascular) will be presented in relation to the design of biomedical devices (imaging, assistive, and diagnostic).", "Concepts in modeling biological systems will be introduced.", "(1) Describe the components/structures of the studied physiological systems", "(2) Identify the relationship between structure and functions in physiological systems", "(4) Evaluate biomedical engineering solutions by applying your knowledge of physiology and scientific methods", "(5) Develop reasoned solutions to address biomedical problems by applying your knowledge of physiology and engineering principles while considering social- economical-ethical impacts", "(6) Communicate information identifying aspects of pathology and potential biomedical solutions in a manner appropriate different audiences", "1b Demonstrate understanding of concepts in natural science 1, 2, 3", "1d Demonstrate understanding of specialized engineering knowledge 1, 2, 3", "7a Generate appropriate documentation to communicate within the profession and to society at large 6", "Regular sessions", "Mondays and Wednesday 14:30-16:20 in RCH 307", "Special sessions", "May 22 Introduction to the Nervous System and Neurons 1, 2, 3 N/A", "A total of six question sets will be given during the term.", "A total of four assignments will be given during the term.", "The assignments will vary in content (can include short answer questions, a longer engineering science question or design problem involving some research and synthesis).", "Test", "The topic can go beyond the physiological systems that are covered in class but needs to relate to physiology and health or biomedical technology.", "Participation in Evaluation", "Research and Design Project", "Notice of Recording", "Course and Departmental expectations", "Compassionate and respectful communication", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "SYDE-BME Compassionate Accommodation", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 23, "course_code": "BME 284L", "course_name": "BME284L - Physiology and Anatomy Laboratory (0.25)", "term_name": "2B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Physiology and Anatomy Laboratory Spring 2024", "BME 284L", "09:00AM - 11:50AM EXP 3683", "jeremy.roth@uwaterloo.ca", "09:00AM - 11:50AM STC 4009", "09:00AM - 11:50AM EXP 3683", "jeremy.roth@uwaterloo.ca", "09:00AM - 11:50AM STC 4009", "09:00AM - 11:50AM EXP 3683", "jeremy.roth@uwaterloo.ca", "09:00AM - 11:50AM STC 4009", "09:00AM - 11:50AM EXP 3683", "jeremy.roth@uwaterloo.ca", "09:00AM - 11:50AM STC 4009", "Email: brwolff@uwaterloo.ca", "Prereq: Level at least 2B Biomedical Engineering", "Develop a practical knowledge of the anatomy of the musculoskeletal, cardiovascular, and nervous systems", "Understand the relationship between function and form in anatomical systems", "Develop anatomical literacy and an appreciation for the complexity of the human body", "Learn how to collect and interpret physiology signals", "Understand mechanisms involved in collecting live data", "E5-6004", "3 May 21-24 Anatomy Lab 2: Musculoskeletal System EXP 3683", "4 May 28-31 Anatomy Lab 3: Cardiovascular System EXP 3683", "Human Anatomy & Physiology by Marieb and Hoehn, 11th Edition Recommended No", "Absenteeism will be excused in the case of illness verified with a Verification of Illness Form (VIF).", "A clean white lab coat must be worn in the lab as a sign of respect to the deceased as well as for barrier protection.", "Some people consider wearing a hat, especially a baseball cap, disrespectful in the presence of a deceased body.", "7. Disposable nitrile gloves must be worn for barrier protection when handling the specimens.", "A bell will sound each minute to indicate that students must move to the next question in the sequence.", "Questions will test basic identification skills as well as application of knowledge.", "This is not a multiple choice exam.", "Each case contains a number of plastic bags containing equipment specific to the iWorx station, each piece bagged and photo identified.", "These reports are expected to be as comprehensive as those required in all Biology courses; they will summarize what you did in the laboratory, outline the results you got, and interpret those results in light of the relevant principles found in your textbook and lectures.", "The standard format for laboratory reports in Biology courses is found on pages 72-77 of the lab manual.", "In the first week of the term, details will be provided about arrangements and alternatives for the use of Turnitin® in this course", "Lab reports can be submitted for a draft review for Turnitin® in the DRAFT dropbox.", "Safety in the Physiology Laboratory", "A fire blanket and fire extinguisher hang beside the main door.", "A hand-held shower, which can be used to wash spilled chemicals from the skin, or to rinse eyes, is found at the small sink in the front left corner of the laboratory.", "Since many standard laboratory reagents are volatile, do not wear contact lenses in the laboratory.", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate."]}, {"course_id": 24, "course_code": "BME 294", "course_name": "BME294 - Circuits, Instrumentation, and Measurements (0.50)", "term_name": "2B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "01:30PM - 03:20PM", "RCH 307", "RCH 307", "02:30PM - 03:20PM", "RCH 307", "E5-4023", "Email:  lan.wei@uwaterloo.ca", "Basic concepts of hardware measurement systems pertaining to the measurement of biosignals: active and passive circuit elements, Kirchhoff's laws, mesh and nodal circuit analysis, principle of superposition, step responses of first and second order networks, sinusoidal steady state analysis, input-output relationships, transfer functions and frequency response of linear systems, operational amplifiers, analog signal detection, conditioning and conversion systems, transducers, difference and instrumentation amplifiers, A/D and D/A conversion.", "This course will provide students with the basic circuit skills necessary in a biomedical engineering context.", "Apply knowledge of basic circuit components and their interactions (GA 1c)", "3. Evaluate appropriate subsystems for a practical signal acuisition design (GA 4c)", "GA Numbers in bracketsrefer to GraduateAttributes, full definition can be found https://uwaterloo.ca/engineering/graduate-attributes", "The main engineering tool to use in this course will be LTSPICE, which will be first introduced in Week 1 and then used in Week 7-12.", "4 Operational amplifiers   6.1-6.5", "6 Sinusoidal steady-state and phasor analysis   10.1-10.5", "7 Impedance, frequency response and transfer functions Midterm/Design assignment out 10.7-10.10, 15.1-15.3", "8 Diodes and transistors   Notes 1", "9 Transistors, instrumentation amplifiers and frequency-selective circuits Quiz 3 Notes 1", "11 Active filters Design Assignment due -", "12 More design examples and exam prep   -", "Alexander and Sadiku, Fundamentals of Electric Circuits, 7th edition, McGraw Hill, 2020.", "Design Assignment 25%", "Design Assignment 25%", "Notice of Recording", "Compassionate and Respectful Communication", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows UW’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "Compassionate Accommodation", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 25, "course_code": "BME 294L", "course_name": "BME294L - Circuits, Instrumentation, and Measurements Laboratory (0.25)", "term_name": "2B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["BME 294L", "09:00AM - 11:50AM E5 6005", "09:00AM - 11:50AM E5 6005", "09:00AM - 11:50AM E5 6005", "09:00AM - 11:50AM E5 6005", "Orion Bruckman", "Email: orion.bruckman@uwaterloo.ca | Office: E7-6402", "Marco Ledesma                mamoranl@uwaterloo.ca", "2. Design Analog Circuits (4a,b,c)", "3. Wire and Troubleshoot Analog Circuits (3b)", "4. Design Analog Circuits to solve complex project requirements (1d, 3b,c)", "Lab 1: DC Lab Equipment and Resistive Circuits 3,4,5 DC Power Supply, Digital Multimeter", "Lab 2:  Operational Amplifiers", "3,4,5 DC Power Supply, Digital Multimeter", "1,3,4,5 DC Power Supply, Function Generator, Oscilloscope", "This course, along with BME 294, hopes to provide an overall understanding of the elements and processes involved in obtaining and working with biosignals.", "Active and passive circuit elements", "Superposition", "Input-output relationships", "Sinusoidal steady state analysis", "Operational amplifiers", "Frequency response of linear systems", "Analog signal detection and conditioning", "Hardware measurement systems of biosignals", "E5 - 6005", "E5 - 6005", "E5 - 6005", "E5 - 6005", "E5 - 6005", "E5 - 6005", "E5 - 6005", "E5 - 6005", "Operations Format:", "The course concepts used in BME 294L will not be presented in the same order as BME 294.", "However pertinent theoretical and practical concepts relevant to the laboratory exercises will be available before each lab.", "Remarking Requests: Send a meeting request to the lab instructor clearly stating your case to regrade a question.", "Attach supporting evidence for your case including screenshots of the page(s) where the grading is requested.", "Turnitin submissions must have a minimum of 20 words and a maximum file size of 20 MB.", "It is strongly suggested that students record pertinent circuit diagrams, instrument & power supply settings, and results in their in-lab section.", "Course and Departmental Expectations", "Compassionate and Respectful Communication:", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "If a co-op interview conflicts with a deliverable then students MUST follow the CECA procedure for rescheduling the interview [", "Compassionate Accommodation:", "Such behaviour includes:", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 26, "course_code": "BME 355", "course_name": "BME355 - Physiological Systems Modelling (0.50)", "term_name": "3A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Physiological Systems Modelling Winter 2025", "10:30AM - 12:20PM E7 4417", "Instructor: James Tung, PhD, PEng, Associate Professor, Systems Design Engineering, Office: E7-6314, Email: james.tung@uwaterloo.ca", "Introduction to systems theory as a general modelling method, and applied to the skeletal, neuromuscular, central nervous, cardiovascular, and respiratory systems of the human body.", "Explain selected classical models of physiological systems.", "Select and adapt physiological models to suit a given application.", "Formulate state-space models of physiological systems.", "Linearize state-space models and explain what is gained and lost in the process.", "Interpret simulation results in the context of physiological function.", "Plan simulations to inform optimization of a medical device, process, or innovation.", "1 Jan. 6-10 Introduction, Linear Time-Invariant Systems Matlab install No tutorial", "2 Jan 13-17 State Equations, Mech & Elec models Problems 1 Problems 1, Matlab review Group formation", "Textbook, \"Linear System Theory and Design\" by Chen, CT resource No PDF and hard copies available through library", "Notice of Recording", "Course-specific Policies", "Sign your email with your first and last name and your student number.", "Laptops, Tablets, and Electronic Devices", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 27, "course_code": "BME 361", "course_name": "BME361 - Biomedical Engineering Design (0.50)", "term_name": "3A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Biomedical Engineering Design Winter 2025", "02:30PM - 03:20PM E7 4417", "03:30PM - 04:20PM E7 4417", "Design methods: problem definition, requirements analysis, criteria and generation of alternative solutions, feasibility analysis, and optimization.", "Product development.", "Design survey of biomedical equipment and assistive technologies.", "A term-long design project in small groups.", "View requirements for BME 361", "Within the scope of this class, various regulatory pathways will be covered and how these regulations influence design and development will be explored.", "Students will gain an understanding of the engineering processes necessary to ensure safety and efficacy during commercialization of novel biomedical products by examining regulatory processes, design controls, non-clinical testing, risk assessment, design verification and validation strategies, and postmarket requirements.", "2. Understand the regulations of medical devices and choose appropriate regulatory pathways for a given medical device (GA 2,3,5)", "Apply the design control process to ensure a compliant design and development process (GA 4,5)", "5. Determine verification and validation strategies based on user needs and risk assessments (GA 3,4,5)", "7. Develop functional team dynamics as part of defining regulatory pathways and verification and validation activities for commercialization of a biomedical product.", "Medical Device Introduction", "Differences in FDA, EU MDR, etc", "Design Controls", "Risk Identification", "Design Verification", "4.5", "Design Verification & Validation", "Design Validation - Human Factors", "Post market requirements & Corrective Actions", "Navigating Post-Launch Design Changes & Labelling", "Software Regulations", "March 24-28", "In BME 361, students will select their BME team members (typically 4 members) and will apply course concepts to construct a regulatory pathway, apply the design control process, and detail the relevant verification and validation activities for a novel biomedical technology required to bring to market.", "This project will simulate a real-world challenge encountered in the biomedical product development cycle, integrating regulatory compliance, risk management, and implementation of design control procedures expected to successfully bring a novel product to market.", "Project Formation and Product Selection: 3% of course grade.", "Product Proposal: 5% of course grade.", "Grade penalties for not following formatting expectations may be applied at the discretion of the course instructor.", "Sign your email with your first and last name and your student number.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 28, "course_code": "BME 381", "course_name": "BME381 - Biomedical Engineering Ethics (0.50)", "term_name": "3A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Biomedical Engineering Ethics Winter 2025", "09:30AM - 10:50AM E7 4417", "I can also be reached by Teams for all virtual meetings.", "This course explores ethical issues in biomedical engineering practice, including professional ethics, medical ethics, the ethics of human and animal subject use in biomedical research, and the impact of biomedical engineering solutions on society and the environment.", "This course aims to guide students in understanding the complex relationships between design, biomedical technologies and society and to appreciate how such an understanding can improve design outcomes from the user, community, national, and global perspectives.", "Identify and evaluate considerations that influence ethical decisions regarding design, modification, and use of biomedical technologies, and the ethical concepts and arguments relevant to these practices (6 a, b, c; 7 a, b; 10 a, b, c);", "Create rational solutions to ethical situations of concern related to biomedical engineering (6, 7);", "Demonstrate an understanding of the social responsibilities of biomedical engineers (8 a, b);", "Describe the importance of social factors affecting development, uptake, and impact of biomedical technologies on society in both developed and developing countries (7, 8).", "This course will focus on and primarily measure your aptitude in the following graduate attributes:", "Demonstrate knowledge of effective team attributes and processes", "Communication skills  An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Can present information, arguments and analyses accurately and reliably within the profession and to society at large using appropriate documentation and vocabulary", "Professionalism  An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Describe the importance of codes, standards, best practices, laws, and biomedical regulations within engineering.", "Identify ethical and unethical behaviour in professional situations (including the use of biomedical technologies).", "in engineering projects.", "Identify equitable and inequitable situations or behaviours", "1 January 7th, 9th Course overview: Why study biomedical engineering ethics?", "Introduction to ethics Save the Last Word:  Introduce Yourself   Enrol as initiators and responders in Online Discussion Roles Schedule by January 10th.", "Consequentialism", "Virtue Ethics and the Ethics of Care", "Metaethics and applied ethics", "The social contract", "Non-maleficence and beneficence", "Value of life and quality of life", "The ‘professional’ and biomedical engineering; Codes of Ethics", "Safety, risk, and reliability in design", "Research on animals: ethical considerations", "The (biomedical) ethics of artificially intelligent systems and Robotics", "Human-technology interfacing and medical devices", "Public and private goods and the engineer", "Product life-cycle and sustainable design", "ESOC Critical Analysis due April 3rd", "Proposal: Critical Analysis of Ethical Situation of Concern (due Feb. 28th) 2%", "Final Paper: Critical Analysis of Ethical Situation of Concern (Due April 3rd) 23%", "7.5% of the final grade for the course will be based on participation in multiple-choice polls connected to the course lectures.", "When answering a poll, select a multiple-choice answer (a, b, c, etc.).", "Tutorial workshop: Analysis of an ethical situation of concern", "The midterm will consist of a series of multiple choice questions testing your knowledge of the material covered up to and including the class of Thursday, February 6th.", "Critical Analysis of a Biomedical Ethical Situation of Concern", "The topic of the paper will be the description, analysis, and critique of a biomedical or other ethical situation of concern you have experienced; it could be a situation encountered during a co-op work term, by a close family member, or by a friend.", "The exam will consist of a mix of multiple-choice questions similar to the midterm but weighted toward material covered after the reading week, and an 'ethical situation of concern' (ESOC), similar to those in the tutorials.", "I completed my PhD in the philosophy of physics (specializing in foundations of quantum mechanics) at Western University, and completed a post-doc in the School of Environment and Resource Studies at UW.", "My research focusses on the nature of scientific knowledge, its bearing on climate change governance and other social policies, and problems of social coordination and game theory in what ecologists call the 'Anthropocene'.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 29, "course_code": "BME 393", "course_name": "BME393 - Digital Systems (0.50)", "term_name": "3A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Digital Systems Winter 2025", "11:00AM - 12:20PM E7 4417", "omar.alburaiki@uwaterloo.ca", "Email omar.alburaiki@uwaterloo.ca", "Topics will be reinforced in the context of biomedical microcontrollers and sensors used in physiological monitoring and clinical support systems.", "Topics will be reinforced in the context of biomedical microcontrollers and sensors used in physiological monitoring and clinical support systems.", "Analyze internal components of digital systems and their technical details", "2. Explain the importance of digital systems and computer architecture for biomedical applications", "4. Use biomedical controllers and sensors to design digital systems", "5. Design digital systems that are reliable (observed behavior matches specifications), safe (avoid putting human lives in danger even in presence of errors and failures), and robust (ability to handle unspecified inputs and state)", "Week6# Sequential Circuits and Sequential Logic Design", "Week7# More on Sequential Circuits and Sequential Logic Design", "Week8# Microcontroller Architecture and Interfacing, Timers/Counters", "Week10# Microprocessor Architecture, Datapath Design", "Week12# Microprocessor Pipelined Design", "Week13# More on Microprocessor Pipelined Design", "Harris and Harris: “Digital Design and Computer Architecture”.", "Each of these assignments may include analytical, numerical (using Falstad) and explanatory components exploring fundamental aspects of the material covered in the course."]}, {"course_id": 30, "course_code": "BME 393L", "course_name": "BME393L - Digital Systems Laboratory (0.25)", "term_name": "3A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Digital Systems Laboratory Winter 2025", "08:30AM - 11:20AM E5 6005", "E5 6005", "08:30AM - 11:20AM E5 6005", "E5 6005", "Orion Bruckman", "Email: orion.bruckman@uwaterloo.ca | Office: E7-6402", "Marco Moran Ledesma", "View requirements for BME 393L", "2. Design Digital Circuits (4a,b,c)", "4. Design Analog Circuits to solve complex project requirements (1d, 3b,c)", "Identify needs, design requirements, constraints, and specifications for complex, open-ended engineering problems.", "First day of the week Week Lab Accommodation", "Remarking Requests: Send a meeting request to the course lab instructor clearly stating your case to regrade a question.", "Attach supporting evidence for your case including screenshots of the page(s) where the grading is requested.", "Operations Format:", "The lectures in BME 393 present pertinent theoretical and practical concepts relevant to the laboratory exercises.", "with no responsible excuse will be given a grade of zero for that entire lab.", "The Department of Systems Design Engineering follows UW’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "This course includes the independent development and practice of specific engineering skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 31, "course_code": "BME 356", "course_name": "BME356 - Control Systems (0.50)", "term_name": "3B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Control Systems Fall 2024", "08:30AM - 09:50AM E5 6006", "Ramisha Anjum, Department of Electrical and Computer Engineering, E7-5308, r3anjum@uwaterloo.ca", "Alexander Kitaev, Department of Electrical and Computer Engineering, EIT 3131, alexander.kitaev@uwaterloo.ca", "Classical and state space representations of control systems.", "Routh-Hurwitz and root-locus methods.", "Pole placement, PID, phase-lead and phase-lag controllers.", "Application to anatomical system models, including musculoskeletal and cardiovascular systems, and to physiological feedback systems.", "The principles of automatic control are employed throughout many branches of engineering: in analog electronics, feedback makes amplifier gains less sensitive to variations in transistor parameters, and improves input and output impedances and frequency response; in chemical and mechanical engineering, automatic controllers regulate temperatures, pressures and flow rates against a range of disturbances; robots robustly perform high-speed, precision manufacturing operations by means of numerous feedback controllers acting in concert to adjust respective joint angles; autopilots control the altitudes of aircraft and damp out undesirable oscillations that are difficult or impossible for human pilots to manage; automobiles incorporate computer-based ignition, emission control, braking and cruise control systems; satellite communications are enabled by the precise orientation of antennas and satellites.", "This course is an introduction to these valuable engineering principles.", "The same feedback principles are observed in natural systems, including biological organisms.", "An understanding of control-engineering principles is fundamental to an appreciation of many physiological phenomena.", "The mathematical framework of the course is the relatively simple one of linear time invariant systems (as seen in BME 252) – in both the time and frequency domains; the main system model is the transfer-function representation of single-input, single-output systems.", "Classical control has a practical flavour, admitting and promoting the use of considerable engineering intuition.", "a) explain Laplace transforms and transfer functions, key components of feedback control systems, and main response characteristics of control systems; (1c, d)", "b) formulate, model, and solve control systems design and analysis problems; (2, 4)", "c) apply block diagram reduction methods to find the overall transfer function of a given feedback control system; (2)", "d) apply the Routh-Hurwitz criterion to investigate the stability of an LTI system for different values of system parameters; (2)", "e) apply the Root-Locus method to tune the gains of lead/lag or PID controllers for a given set of time-domain response characteristics; (2)", "f) construct and interpret the Bode diagram (magnitude and phase) for a given LTI control system; (1c, d)", "g) apply the Nyquist criterion to investigate the stability of a given LTI control system for different values of the control system parameters; (2) and", "h) employ computer programs and engineering tools properly for control systems design and analysis.", "Week Chapter Pertinent sections of reference Learning outcome (LO) & Engineering tools", "1 Introduction to feedback control Ch 1 LO a; Eng Tools: concepts of tracking, regulation, stability", "3 Review of transfer function manipulation 2.5-2.7 LO c; Eng Tools: block-diagram reduction", "4 Control system configurations 4.1-4.6 LO a, b; Eng Tools: feedforward and feedback architecture", "7,8 Design using the root locus 7.1-7.6, 10.5, 10.7 LO e, h; Eng Tools: root-locus sketching and application to control", "Upper Saddle River, NJ: Pearson Prentice Hall, 2008 On reserve in the DC Library; any recent edition will serve equally well No", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 32, "course_code": "BME 356L", "course_name": "BME356L - Control Systems Laboratory (0.25)", "term_name": "3B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Control Systems Laboratory Fall 2024", "E5 6005", "E5 6005", "E5 6005", "E5 6005", "Email:  chris.mcclellan@uwaterloo.ca,", "Sajjad Kazemi", "View requirements for BME 356L", "This lab is intended to give students a practical introduction to System Identification, Controller Design  and Controller Validation.", "Devise and test a model of the system they wish to control (3a, 3b, 3c)", "Week 8 (October 21 – 25) – Lab 2 – PID Controller Design and Validation of Forced Air Oven", "Week 12 (November 18 – 22) – Lab 4 – PID Controller Design and Validation of Inverted Pendulum", "This includes weekends.", "Groups: You’ll be working in groups of 2.", "Make sure to include the Simulink Toolbox, the Control Systems Toolbox, the DSP System Toolbox and the Signal Processing Toolbox when you do.", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 33, "course_code": "BME 362", "course_name": "BME362 - Biomedical Engineering Design Workshop 1 (0.50)", "term_name": "3B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Biomedical Engineering Design Workshop 1 Fall 2024", "10:30AM - 12:20PM", "Engineering design project course where students work in small groups applying the principles of engineering problem solving, systems analysis, simulation, optimization, and design to a biomedical engineering problem of their own choosing.", "Lecture topics include project management, risk management, standards, regulatory clearance, and certification for biomedical devices.", "Identify medical devices and their classification.", "Understand the regulations of medical devices and choose appropriate regulatory pathways for a given medical device.", "Perform an in-depth needs assessment from an interdisciplinary perspective that includes assessing user needs.", "Develop functional team dynamics as part of designing solutions to biomedical problems [", "Team Formation “Speed-Dating”.", "Assignment 1: Introduction to FDA Website.", "Guest Lecture: Research & Design.", "Design Critique.", "Capstone Design Project 50%", "The design team will develop evidence-backed specifications for their design projects and may progress to low-fidelity prototypes (storyboards, sketch models, wireframe, etc.) for the identified open-ended complex engineering problem by the end of the course.", "Design project activities and project deliverables are described in the course schedule.", "Detailed descriptions of each of these deliverables will be posted online well in advance of the submission deadline.", "The submission dates for these deliverables can be found in the course schedule on LEARN.", "The different capstone design project deliverable and their contribution to the course grade are listed below:", "Grade penalties for not following formatting expectations may be applied at the discretion of the course instructor.", "Notice of Recording", "Sign your email with your first and last name and your student number.", "Any in-person deliverables (e.g., design presentations) will be delayed on a case-by-case basis.", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.", "A.A.S. also offers learning strategy supports to all students that can be accessed through:", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 34, "course_code": "BME 364", "course_name": "BME364 - Engineering Biomedical Economics (0.50)", "term_name": "3B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Engineering Biomedical Economics Fall 2024", "09:30AM - 10:20AM E5 6006", "10:30AM - 12:20PM", "08:30AM - 09:20AM", "This course examines key economic issues in health care and biomedical industries.", "Topics include the market for medical care, health insurance, various models of healthcare delivery and competition and the role of government in policy, financing and delivery of health care.", "This course will train students to use economic analysis to model and understand the complex interactions between health care delivery, insurance markets, health innovators, governments, and firms.", "Articulate differences between healthcare systems and how incentives affect the system economics.", "Articulate differences between healthcare systems and how incentives affect the system economics.", "Investigate a research topic in the area of health economics.", "Apply cost-benefit analysis to aid in healthcare decision making.", "A knowledge base for engineering:   Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the biomedical engineering program.", "2. Problem analysis:  An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "Investigation:  An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "4. Design:  An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, and economic, environmental, cultural and societal considerations.", "7. Communication skills:  An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Professionalism:   An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Such ability includes an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society, the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Life-long learning:  An ability to identify and to address their own educational needs in a changing world in ways sufficient to maintain their competence and to allow them to contribute to the advancement of knowledge.", "The Labor Market for Physicians", "7. Demand for Insurance", "Adverse Selection in Real Markets", "Pharmaceuticals and the Economics of Innovation", "The Economics of Health Externalities", "*", "The Contribution and Effects of the Country’s Healthсare Sector on its GDP", "Healthcare as a Basic Human Right: The Pros and Cons of Providing Free Healthcare", "A Look at the Feasibility of a Universal Health Care System", "Methods to Reduce the Risk of Adverse Selection", "The Differences between Moral Hazard and Adverse Selection and their Effects on Health Economics", "The Need to Educate Patients on the Costs Added to their Medical Bills", "The Role of Medical Resources in Increasing Life Expectancy Numbers", "Reasons Patients Should Select Larger Medical Facilities to Avoid Costly Treatments", "The Adverse Effects of an Unplanned Influx in Health Care on the Overall Economic Balance", "The Role of a Stronger Health Care System and Nutrition Programs on the Throughput of the Employed Masses", "Notice of Recording"]}, {"course_id": 35, "course_code": "BME 384", "course_name": "BME384 - Biomedical Transport: Biofluids and Mass Transfer (0.50)", "term_name": "3B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Biomedical Transport: Biofluids and Mass Transfer Fall 2024", "10:00AM - 11:20AM E5 6006", "E. Boghaert", "11:30AM - 12:20PM", "E. Boghaert", "Eline Boghaert (eline.boghaert@uwaterloo.ca)", "Fundamental concepts in systems involving fluid flow.", "Basic treatment of statics, kinematics, and dynamics of fluids.", "Mass transfer, conservation of mass, momentum and energy for a control volume.", "Discussion of flow in pipes and channels and brief introduction to boundary layers, lift and drag, ideal and compressible flow will be specifically covered in the context of the cardiovascular system (macrocirculation and microcirculation).", "View requirements for BME 384", "Apply fundamental concepts to calculate key variables (force/pressure/surface tension) in fluid statics problems.", "3. Determine the velocity profile and shear-stress profile of a fluid by applying a differential mass and momentum balance.", "5. Determine dimensionless parameters and complete scaling analysis for a given problem.", "Apply the integral form of the conservation of mass, Newton’s 2nd law of motion and the conservation of energy equation to a control volume to determine quantities of interest in fluid dynamics (average velocity, pressure drop, etc.).", "Develop and solve one-dimensional steady-state mass transfer models.", "Textbook References", "1 Introduction to Transport & Fundamental Concepts [", "1] W 2.1 - 2.3 & 1.6, T 2.4", "3 1D Mass and Momentum Balances on a Differential Fluid Element [", "5 Navier-Stokes Equations [", "6 Dimensional Analysis and Similitude [", "9 Conservation of Energy [", "11 Pressure Drop due to Friction in Closed Conduits", "12 Introduction to Mass Transfer [", "5th & 6th edition are very similar.", "Truskey, Yuan & Katz (2009) Transport Phenomena in Biological Systems, 2nd Edition, Pearson Prentice Hall On reserve at the Davis Centre Library.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 36, "course_code": "BME 386", "course_name": "BME386 - The Physics of Medical Imaging (0.50)", "term_name": "3B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["The Physics of Medical Imaging Fall 2024", "10:00AM - 11:50AM E5 6006", "09:30AM - 10:20AM E5 6006", "08:30AM - 09:20AM", "Email: phajireza@uwaterloo.ca | Office: E7-6416", "2- TBD", "The fundamental laws of electricity, magnetism, and optics will be taught through the introduction to basic concepts of medical imaging: radiation for imaging, x-ray, computed tomography (CT), magnetic resonance imaging (MRI), ultrasound or sonography imaging, electric impedance tomography, confocal microscopy, fluoroscopy.", "Understand and describe the fundamental laws of electricity, magnetism, and optics (1c)", "Understand and describe the fundamental laws of light-matter interactions (1b,c)", "Describe the physical mechanisms governing X-ray, MRI, ultrasound and optical imaging techniques (1c,d)", "Apply fundamental physics concepts to the general design of imaging systems (1b,c, 2)", "Randall D. Knight: Physics for Scientists and Engineers: A Strategic Approach with Modern Physics (4th Edition).", "Please make sure no inappropriate comments will be shared during the lectures.", "A student who is found to be disruptive during lectures will be given only one verbal warning for the term.", "This course includes the independent development and practice of specific skills.", "• Library for research-based assignments", "Compassionate Accommodation:", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Compassionate and respectful communication:", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 37, "course_code": "BME 411", "course_name": "BME411 - Optimization and Numerical Methods (0.50)", "term_name": "4A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Optimization and Numerical Methods Fall 2024", "- Abbas Seifi, Professor   Email: aseifi@uwaterloo.ca", "Seyed Mohammad Amin Mirjalili Email:   smamirja@uwaterloo.ca", "Interpolation and curve fitting, root-finding methods, local and global optimization methods, constrained optimization, multiobjective and multidisciplinary design optimization for biomedical applications.", "This course introduces the applications of optimization modeling and numerical methods to biomedical engineering and engineering design.", "It provides an overview of the formulation and classification of optimization problems arising in biomedical engineering and types of suitable optimization methods.", "Graphical solution methods for two-variable problems and optimization techniques for single-variable problems like region elimination approaches, interpolation algorithms, and direct root methods are discussed.", "Linear Programming problem formulations and simplex and interior methods for solving these problems are discussed.", "Learn about different types of optimization problems in biomedical engineering and engineering design (GA: 1,4)", "2. Study types of optimizations methods and where they are applied, convexity, optimality criteria for unconstrained multivariable problems, and optimality conditions for constrained multivariable problems and proper software tools (GA: 1,2,5)", "Apply graphical solution method to solve two-variable optimization problems, and region elimination methods, interpolation methods, and direct root-finding methods to solve single-variable problems (GA: 1,2,5)", "Apply simplex and interior-point methods for solving Linear Programming problems (GA: 1,2,5)", "7. Apply constrained multivariable methods as well as multi-objective techniques to solve biomedical engineering and design optimization problems using Pareto optimality concept (GA: 3,4,5)", "Details and explanation of each attribute can be found at Graduate attributes | Engineering (uwaterloo.ca)", "Week 1 / LO: 1, 2 Sept. 5  Introduction to Optimization Course Overview; Classification of Optimization Problems & Applications", "Slides", "Week 2 / LO: 2 Sept. 10-12 Functions of a Single Variable Optimization Problem Statement; Basic Concepts & Examples; Graphical Solutions; Optimality Conditions", "Week 3 / LO: 4 Sept. 17-19 Optimization of Single Variable Functions", "Unimodal Functions", "Bracketing & Region Elimination Golden Section and Fibonacci methods; Interpolation method", "Assign.1", "Week 4 / LO: 4 Sept. 24-26 Gradient-Based  Root-Finding Methods Newton–Raphson, quasi-Newton Method; Bisection & Secant methods;", "Convexity & Positive Definiteness", "Week 9 / LO: 3,7 Oct. 29 -31 Constrained Multivariate Optimization Optimality Conditions for Convex Nonlinear Programs; Example of KKT Conditions and Solutions; Design Optimization in MATLAB", "Assign.3", "Week 10 / LO: 6 Nov. 5-7 Linear Programming & Duality Theory", "LP Formulation; Graphical Solution & Simplex method", "Duality& Economic Interpretation", "Week 11 / LO: 6 Nov. 12-14 Interior-Point Methods (IPM) Affine-Scaling Interior-point method; Examples; primal-dual interior-point algorithms", "Week 12 / LO: 6,7 Nov. 19-21 Multi-objective Optimization  Quadratic Programming & Applications; Pareto Optimality; e-Constrained Method", "Week 13 / LO: 1,3 Nov. 26- 28 Modern Global Optimization and Applications Genetic Algorithm and Examples; Applications in Design Optimization", "Introduction to Optimum Design, Elsevier Inc., 4th Edition, J. S. Arora, 2016 No", "Optimization Concepts and Applications in Engineering, Cambridge University Press, 2nd Edition, A. D. Belegundu, T. R. Chandrupatla, 2011 No", "The midterm exam will be taken in person and closed book.", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 38, "course_code": "BME 461", "course_name": "BME461 - Biomedical Engineering Design Workshop 2 (0.50)", "term_name": "4A Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Biomedical Engineering Design Workshop 2 Fall 2024", "10:30AM - 12:20PM E5 6127", "08:30AM - 10:20AM E5 6127", "The first half of a two-term engineering design project continuing the biomedical design workshop sequence.", "A prototype and interim progress report are presented at the end of the first term.", "• 0.25-2 hours for in-person course activities and meetings as scheduled.", "All accredited engineering programs in Canada culminate in a significant open-ended engineering design experience, which should involve teamwork and project management, and be conducted under the professional responsibility of faculty licensed to teach and/or practice engineering in Canada.", "The main goal of BME461 and BME462 is to have 4th year BME students demonstrate appropriate competencies by applying engineering design knowledge and skills gained throughout their BME undergraduate program to a substantial biomedical engineering project.", "The graduate attributes are assessed primarily through reports and presentations.", "Work within a team to advance a design project", "Investigate a need in biomedical engineering (this includes determining investigation approaches that are feasible and effective given the timeframe and the particular need and context)", "Develop and screen design concepts that are consistent with requirements and constraints", "Develop well justified engineering specifications for a design concept", "Analyze and iterate a design concept through analysis, modelling, and/or prototyping", "Recognize and document safety, ethical, and regulatory considerations relevant to a design concept", "Identify and address gaps in their competence to carry out a design project", "1 Sept 6 Course introduction & facilities tour", "2 Sept 13 Peer feedback: Needs Finding & Requirements", "3 Sept 20 Oral presentations: Needs Finding & Requirements", "4 Sept 27 Team meetings (engineering economics) & modules", "7 Oct 25 Team meetings (design concepts) & modules", "8 Nov 1 Peer feedback: Concepts Screening & modules", "12 Nov 29 Team meetings (ethics & safety) & modules", "Needs Finding & Requirements Team Presentation (Due: Sept 20) 5%", "Design Analysis Report (Due: Dec 3) 30%", "It is the responsibility of all team members’ to ensure the accuracy and quality of all aspects of submitted team-based deliverables.", "General Terms of Assessment:", "Your competence in execution of the engineering design process and in application of engineering knowledge, skills and tools.", "Your ability to communicate in writing and orally at an appropriate level", "Your attention to ethics, safety and risk management in terms of both your project work and the larger scale ethics and safety of your design", "Your ability to make good decisions and apply sound engineering judgement", "All design projects are expected to be substantial and to demonstrate a suitable level of technical expertise and engineering competence for 4th year biomedical engineering students.", "To assist with completion of a sufficiently substantive and complex project, projects should be completed in teams of 4-5 students.", "For the purpose of BME capstone projects, \"biomedical engineering\" is defined as follows (adapted from Enderle & Bronzino, Introduction to Biomedical Engineering):", "This field combines the design and problem solving skills of engineering with medical and biological sciences to advance health and health care treatment, including diagnosis, monitoring, and therapy.", "Students should be able to present an appropriate budget and plan for the project, discuss safety, health, ethical and equity issues around their solution, as well as identify potential economic, societal and environmental impacts that may need mitigation through design.", "Sanctioned Collaboration vs. Individual Work", "Instructions will clearly identify individual and team components.", "Accurate and Honest Reporting", "The same applies if fraudulent reporting is uncovered as part of the questioning during any of the Panel Exams and Design Reviews.", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.", "Compassionate Accommodation", "They will review your case and coordinate a reasonable and fair plan in consultation with the appropriate parties.", "This course includes the independent development and practice of specific skills, such as research and communication skills.", "Library for research-based assignments"]}, {"course_id": 39, "course_code": "BME 462", "course_name": "BME462 - Biomedical Engineering Design Workshop 3 (0.50)", "term_name": "4B Term", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Biomedical Engineering Design Workshop 3 Winter 2025", "10:30AM - 12:20PM E5 6127", "08:30AM - 10:20AM E5 6127", "The concluding half of the fourth-year Biomedical Engineering Design Workshop.", "All accredited engineering programs in Canada culminate in a significant open-ended engineering design experience, which should involve teamwork and project management, and be conducted under the professional responsibility of faculty licensed to teach and/or practice engineering in Canada.", "The main goal of BME 461 and BME 462 is to have 4th year BME students demonstrate appropriate competencies by applying engineering design knowledge and skills gained throughout their BME undergraduate program to a substantial biomedical engineering project.", "Most of these graduate attributes are assessed through reports and presentations.", "Individual & Teamwork, Professionalism, and Life-Long Learning are assessed through individual contribution statements and engineering logs.", "Work within a team to advance a design project", "Analyze and iterate a design concept through analysis, modelling, and/or prototyping", "Recognize and document safety, ethical, and regulatory considerations relevant to a design concept", "Identify and address gaps in their competence to carry out a design project", "Assess the economic viability of a design", "Validate a design in the context of needs, requirements, and constraints", "3 January 24 Team meetings & modules", "4 January 31 Team meetings & modules", "5 February 7 Team meetings & modules", "6 February 14 Peer feedback & modules", "7 February 28 Team meetings & modules", "9 March 14 Team meetings & safety inspections", "These costs will be reimbursed up to $500 per team.", "Deliverables", "Engineering Economic Analysis (Due: Feb 14) 10%", "Milestones", "It is the responsibility of all team members’ to ensure the accuracy and quality of all aspects of submitted team-based deliverables.", "General Terms of Assessment:", "Your competence in execution of the engineering design process and in application of engineering knowledge, skills and tools.", "Your ability to communicate in writing and orally at an appropriate level", "Your attention to ethics, safety and risk management in terms of both your project work and the larger scale ethics and safety of your design", "Your ability to make good decisions and apply sound engineering judgement", "All design projects are expected to be substantial and to demonstrate a suitable level of technical expertise and engineering competence for 4th year biomedical engineering students.", "To assist with completion of a sufficiently substantive and complex project, projects should be completed in teams of 4-5 students.", "For the purpose of BME capstone projects, \"biomedical engineering\" is defined as follows (adapted from Enderle & Bronzino, Introduction to Biomedical Engineering):", "This field combines the design and problem solving skills of engineering with medical and biological sciences to advance health and health care treatment, including diagnosis, monitoring, and therapy.", "Students are expected to discuss safety, health, ethical and equity issues around their solution, as well as identify potential economic, societal and environmental impacts that may need mitigation through design.", "Sanctioned Collaboration vs. Individual Work", "Instructions will clearly identify individual and team components.", "Accurate and Honest Reporting", "The same applies if fraudulent reporting is uncovered as part of the questioning during any of the Panel Exams and Design Reviews.", "This course includes the independent development and practice of specific skills, such as research and communication skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca"]}, {"course_id": 40, "course_code": "BME 499", "course_name": "BME499 - Elective Biomedical Research Project (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Elective Biomedical Research Project Winter 2025", "Email: celiasmi@uwaterloo.ca", "Email: mgorbet@uwaterloo.ca", "Email: jenny.howcroft@uwaterloo.ca", "Approval for doing research with an off-campus supervisor must be given by the Director of the Biomedical Engineering Program; note that this would also require identifying a co-supervisor in the faculty of engineering.", "perform a background literature search and review,", "analyse and evaluate results and/or design solution", "independently prepare and present a technical presentation.", "demonstrate responsibility, accountability, safety, and ethical behavior while conducting the independent project", "conduct an investigation of a complex problem using appropriate experiments and tools (3a, 5c)", "identify the potential social, economical, ethical and environmental impacts of their research or design project (9b)", "1 Knowledge Base 1b -  Demonstrate understanding of concepts in natural science", "1d - Demonstrate understanding of specialized engineering knowledge", "2 Problem Analysis 2a - Formulate a problem statement", "3 Investigation 3a - Create investigative studies of complex engineering problems", "3c - Synthesize information from multiple sources to reach valid conclusions", "4 Design 4b - Generate and refine potential solutions to complex, open-ended design problems", "7 Communication Skills 7a - Generate appropriate documentation to communicate within the profession and to society at large", "9 Impact of Engineering 9b - Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations in making decisions", "Week 13-14: Self-reflection on scientific contributions and engineering knowledge", "Scheduling needs to be coordinated with your BME 499 instructor", "Laptop/computer required for creating reports and presentations Yes Depends on student's choice", "Library for research-based assignments", "Email Communication", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Visit them at www.uwaterloo.ca/wcc.", "Course and Departmental Expectations in SYDE"]}, {"course_id": 41, "course_code": "BME 540", "course_name": "BME540 - Fundamentals in Neural and Rehabilitation Engineering (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Fundamentals in Neural and Rehabilitation Engineering Fall 2024", "03:30PM - 04:20PM", "DWE 2402", "02:30PM - 03:20PM", "DWE 2402", "03:30PM - 04:20PM", "DWE 2402", "02:30PM - 03:20PM", "DWE 2402", "03:30PM - 04:20PM", "DWE 2402", "Introduction to the field of neural and rehabilitation engineering (NRE).", "Topics include describing common neurological and musculoskeletal injuries, related neural and rehabilitation engineering approaches to address disabilities, and the development of a design framework for synthesizing a novel neural and rehabilitation engineering approach.", "Critical concepts in clinical research design to meet current regulatory, ethical, and practice policies will be studied.", "Describe and apply evidence-based medicine (EBM) concepts applied to NRE.", "Evaluate and criticize existing neural and rehabilitation engineering (NRE) approaches.", "Synthesize and disseminate a novel innovation to solve a self-selected problem in NRE.", "There are 12 graduate attributes total and collection of these attributes is pertinent in ensuring our engineering programs remain accredited.", "This is an upper year elective course introducing the field of neural and rehabilitation engineering (NRE) by exposing students to the key problems and current engineering approaches.", "The first half of the course will focus on describing common neurological and musculoskeletal injuries and related NRE approaches to address disabilities.", "Subsequent classes will examine critical concepts in clinical research design to meet current regulatory, ethical, and practice policies.", "At the end of the term, students will pitch their proposal to a panel of judges, representing clinical and industry stakeholders.", "Hands-on labs will teach students the integration of mechanical, electrical, and software systems through building a soft robotic finger prosthesis along with inertial measurement units, electromyography and electroencephalography.", "1 Introduction", "4 Parkinson's Disease & Deep-Brain Stimulation", "5 Prosthetics & Myoelectric Control  Assignment 2", "6 Spinal Cord Injury & Brain-Computer Interfaces", "8 Audition & Cochlear Implants", "9 Vision & Tactile  Assignment 3", "10 Autism Spectrum Disorder & Concussion  EMG Lab Activity", "Students must email the instructor before the assignment deadline to use these grace days.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 42, "course_code": "BME 544", "course_name": "BME544 - Biomedical Measurement and Signal Processing (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Biomedical Measurement and Signal Processing Winter 2025", "Signal processing techniques will be discussed in the context of extraction and application of useful biomedical signals.", "(3) Understand and apply digital signal processing concepts and techniques to biomedical signals", "(4) Develop a signal processing system to reliably extract features from biomedical signals for a particular application and justify the approaches/choices made", "1 Knowledge Base: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "4b Critically evaluate and compare design choices 4", "17-Jan Power Spectra and Spectrograms 3", "31-Jan Sampling in Embedded Systems 2", "14-Feb Correlation Analysis 2,3", "24-Feb Parametric Signal Processing 3", "28-Feb Speech Processing and Applications 2,3", "07-Mar Electrodes and coupling to the environment 2", "21-Mar Brain Anatomy and EEG 1", "24-Mar EEG Processing 2,3", "Biomedical Signal Analysis, 3rd Edition.", "A total of 6 assignments will be given during the term.", "Data Collection", "One is for students to gain experience in recording measurements of different biomedical signals.", "The second is to provide a set of recordings for students to use to test and evaluate signal processing approaches.", "It is anticipated the four sets of data collection will be conducted during the term.", "The project is an individual Students will identify an application involving a biomedical signal.", "Based on the application, they will develop and evaluate a signal processing system to reliably extract features from biomedical signals for that application and justify the approaches/choices made.", "Notice of Recording", "Course and Departmental expectations", "Compassionate and respectful communication", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "SYDE-BME Compassionate Accommodation", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 44, "course_code": "BME 551", "course_name": "BME551 - Biomechanics of Human Movement (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Biomechanics of Human Movement Fall 2024", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "Monday 12:00-12:30p E5-6108", "This course introduces students to the biomechanics of the musculoskeletal system, including motor control and rehabilitation engineering.", "Motor control will be included, as well as the identification of body segment parameters and the dynamics of muscles.", "Biomechanics applies techniques of engineering mechanics to the study of biological organisms.", "This course is specifically concerned with “musculoskeletal biomechanics”, the application of engineering mechanics to the study of the human musculoskeletal system.", "We will further limit our interest to the use of kinematics and rigid-body dynamics to model the human body and its movement.", "During this process, you will become well versed in the patterns of human motion, inverse and forward dynamic analyses of human motion, robotics, model development and validation, and interpretation of model predictions.", "Assumed knowledge: The course assumes knowledge of basic concepts in statics, linear algebra, differential equations, and elementary dynamics.", "1) Extend a singular rigid body system to develop a lumped-mass multibody model.", "3) Develop equations to solve these representative models and simulate the human body motions or those of a robot.", "4) Validate the developed human body models using motion capture technology to simulate a multifaceted human movement.", "6a) Use human body models to distinguish normal and pathological motion and force patterns.", "1) Extend a singular rigid body system to develop a lumped-mass multibody model.", "2b", "3) Develop equations to solve these representative models and simulate the human body motions or those of a robot.", "2b-c", "4) Validate the developed human body models using motion capture technology to simulate multifaceted human movements.", "6a) Use human body models to distinguish normal and pathological motion and force patterns.", "4a-b, 6a-b", "Monday", "Friday", "Introduction", "FE 5.1-5.5   FE 5.6-5.7      2b Matlab/ Python", "FB 8.1-8.7   FB 8.8-8.10      2b-c Matlab/ Python", "4a-b", "4a-b", "Ebook available in library Yes", "Ebook available in library Yes", "Ebook available in library Yes", "D. A. Winter, “Biomechanics and Motor Control of Human Movement” (BM), 4th Edition, 2009, John Wiley & Sons, Inc.", "Ebook available in library Yes", "Ebook available in library Yes", "Static Biomechanical Analysis: 3D SSPP No", "Dynamic Biomechanical Analysis: OpenSim No", "Evaluation", "During the last month, you will undertake a group project to analyze a biomechanical system.", "Your findings should be summarized in a final report organized in the following sections: Introduction, Methods, Results, Discussion, and Conclusions & Recommendations.", "If there is something I can clarify during lectures, please feel free to ask.", "Compassionate Accommodation", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as motion capture collections and data analysis.", "Library for research-based assignments"]}, {"course_id": 45, "course_code": "BME 552", "course_name": "BME552 - Computational Biomechanics (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Computational Biomechanics Winter 2025", "03:30PM - 04:20PM", "Associate Professor, Mechanical and Mechatronics Engineering", "View requirements for BME 552", "Introduction to Computational Biomechanics", "Review of Human Body Kinematics & Dynamics", "Musculoskeletal Modeling, Static Optimization & Joint Reaction Forces", "Medical Imaging, Image Processing & Mesh Generation", "Biomechanical Modeling using Finite Element Analysis", "Model Verification and Validation", "Understand the basic principles of biomechanics", "Recognize the steps necessary to develop a biomechanical model", "Examine numerical and/or analytical methods to model the MSK system", "Implement appropriate material behaviour for different MSK tissues", "Perform computational simulations to examine the response of MSK tissues", "Recognize factors important to the model performance", "Research, design and implement a project-based biomechanical simulation", "Introduction to Course & Musculoskeletal System", "Static & dynamic analysis of skeletal system, joint stability, anthropometrics, motion capture", "Musculoskeletal Modeling I", "Muscle physiology and function, MSK modeling of human movement, OpenSim modeling platform", "Musculoskeletal Modeling II", "MSK statics optimization, inverse kinematics, residuals, joint reaction forces", "Model Verification and Validation", "Medical Imaging and Image Processing I", "Intro to medical imaging, image processing and segmentation", "Medical Imaging and Image Processing II", "Group presentations of biomechanics research papers", "Finite Element Modeling I", "Finite Element Modeling II", "A selection of review questions and problems", "Orthopaedic Biomechanics: Mechanics and Design in Musculoskeletal Systems No $235", "Biomechanics of Movement: The Science of Sports, Robotics and Rehabilitation No $100", "Biomechanics: Concepts and Computation No $82.95", "The course project is intended to be an open-ended investigation towards a computational biomechanics problem of your choice.", "The project is expected to be completed over the entire duration of the term.", "Each group member must have a well-defined role and clear contribution to the project.", "The Final presentation will be a longer cumulative presentation of the entire project, including background, methodology, results and discussion.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 47, "course_code": "BME 561", "course_name": "BME561 - Biomaterials and Tissue Engineering (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Biomaterials and Tissue Engineering Winter 2025", "Assistant Professor in the Department of Chemical Engineering and member of the Waterloo Institute for Nanotechnology", "The course provides an overview of the recent advances in medicine and nano-technologies for development of tissue engineering and regenerative medicine.", "Strategies and technologies for designing, testing, and manufacturing of biomaterials and tissue-engineering products will be introduced.", "The biological and clinical applications will be discussed.", "The unmet medical needs, challenges in manufacturing, regulatory approval and commercialization for tissue engineering applications will also be discussed.", "CHE 561: View requirements for CHE 561", "The course provides an overview of the recent advances in medicine and nano-technologies for development of tissue engineering and regenerative medicine.", "Strategies and technologies for designing, testing, and manufacturing of biomaterials and tissue-engineering products will be introduced.", "The biological and clinical applications will be discussed.", "The unmet medical needs, challenges in manufacturing, regulatory approval and commercialization for tissue engineering applications will also be discussed.", "Apply fundamentals of fabrication technology for tissue engineering applications", "Integrate fundamentals of materials science to solve biomedical unmet needs", "Understand the fundamentals of biocompatibility and physiology for tissue engineering applications", "Design tissue engineering solutions to solve health-care problems", "Communicate through reports and presentations", "-Introduction to tissue engineering", "-Scale in biological systems", "-Introduction biomaterials and nanotechnologies for biomedical engineering", "Biomaterials design and properties", "Drug and gene delivery", "-Key components of tissue engineering", "Biomaterials: engineering biological structures", "Protein interactions with biomaterials", "Molecular and cellular processes with living environment, blood-materials interaction, short and long term reactions to the body.Cell interactions with biomaterials", "Immune response and wound healing", "Growth factors, controlled release and gene delivery", "Cells and Stem cells", "Neural repair and regeneration", "Diabetes / bone tissue engineering", "Assessment of biomedical products", "Regulatory and commercialization", "Design project presentations", "Design project 40%", "Design project is to be done in groups of 3-4.", "Design Project Outline Friday, February 7 at 11:59 PM 10%", "Design Project peer and self-evaluations Friday, April 4, 11:59 PM 10%", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 49, "course_code": "BME 581", "course_name": "BME581 - Ultrasound in Medicine and Biology (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 11:20AM E7 4433", "04:00PM - 05:20PM", "08:00PM -", "08:00PM -", "10:00AM - 11:20AM E7 4433", "04:00PM - 05:20PM", "10:00AM - 11:20AM E7 4433", "04:00PM - 05:20PM", "Di Xiao", "E-mail: di.xiao@uwaterloo.ca", "View requirements for ECE 493", "View requirements for ECE 700", "Describe how ultrasound is used in diagnostics and therapy", "Summarize the technical principles related to ultrasound", "Explain the bioeffects that can be induced by ultrasound and its potential safety concerns", "Theme 1: Introduction to ultrasound imaging", "Basic ultrasound principles", "Basics of ultrasound imaging", "Ultrasound-based blood flow measurements", "General interactions in imaging", "Nonlinear ultrasonics and its imaging applications", "Principles of acoustic cavitation", "Principles of acoustic radiation and streaming", "Thermal-based ultrasound therapy", "Microbubbles in imaging and therapy", "Theme 4: Biosafety considerations", "Ultrasound-induced bioeffects", "Ultrasound measurement and protection standards", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 50, "course_code": "BME 582", "course_name": "BME582 - Biomedical Optics (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Biomedical Optics Winter 2025", "Email: phajireza@uwaterloo.ca | Office: E7-6416", "This course provides a comprehensive exploration of optical principles, techniques, and instrumentation used in pre-clinical research and clinical diagnosis settings.", "The fundamental principles of light-tissue interactions and biophotonics will be presented as well as optical sensing and the design of spectroscopy systems tailored for applications in biomedical research and healthcare.", "Understand and describe the fundamental laws of optics (1c)", "Understand and describe the fundamental laws of light-matter interactions (1b,c)", "Describe the physical mechanisms governing various optical imaging and sensing  techniques (1c,d)", "Apply fundamental physics concepts to the general design of optical imaging and sensing systems (1b,c, 2)", "Identify the design parameters that govern the performance of different optical imaging and sensing modalities (4, 5)", "1 Jan 9 (Thu) 5:00 PM - 5:50 PM Chapter 1: Introduction to Biomedical Optics 1,2", "2 Jan 14 (Tue) 4:30 PM - 6:20 PM Chapter 1: Introduction to Biomedical Optics 1,2", "2 Jan 16 (Thu) 5:00 PM - 5:50 PM Chapter 1: Introduction to Biomedical Optics 1,2", "Textbooks and References", "• Lihong V. Wang, Hsin-I Wu: Biomedical Optics: Principles and Imaging, Publisher: Wiley", "• Knight: Physics for Scientists and Engineers: A Strategic Approach with Modern Physics", "Please make sure no inappropriate comments will be shared during the lectures.", "A student who is found to be disruptive during lectures will be given only one verbal warning for the term.", "This course includes the independent development and practice of specific skills.", "• Library for research-based assignments", "Compassionate Accommodation:", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Compassionate and respectful communication:", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 53, "course_code": "BME 589", "course_name": "BME589 - Special Topics in Biomedical Devices (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Biomaterials and Biomedical Design Winter 2024", "An overview of nanomedicine and nanotechnology-based biomedical devices.", "Strategies and technologies for designing, testing, and manufacturing biomaterials and tissue-engineering products.", "Biological and clinical applications.", "The course provides an overview of the recent advances in medicine and nano-technologies for development of tissue engineering and regenerative medicine.", "Strategies and technologies for designing, testing, and manufacturing of biomaterials and tissue-engineering products will be introduced.", "The biological and clinical applications will be discussed.", "The unmet medical needs, challenges in manufacturing, regulatory approval and commercialization for tissue engineering applications will also be discussed.", "Apply fundamentals of fabrication technology for tissue engineering applications", "Integrate fundamentals of materials science to solve biomedical unmet needs", "Understand the fundamentals of biocompatibility and physiology for tissue engineering applications", "Design tissue engineering solutions to solve health-care problems", "Communicate through reports and presentations", "-Introduction to tissue engineering", "-Scale in biological systems", "-Nanotechnologies and biomaterials for biomedical engineering", "Drug and gene delivery", "-Key components of tissue engineering", "Biomaterials: engineering biological structures", "Protein interactions with biomaterials", "Molecular and cellular processes with living environment, blood-materials interaction, short and long term reactions to the body.Cell interactions with biomaterials", "Immune response and wound healing", "Growth factors, controlled release and gene delivery", "Cells and Stem cells", "Neural repair and regeneration", "Liver repair and regeneration / bone tissue engineering", "Assessment of biomedical products", "Regulatory and commercialization", "Design project presentations", "Design project 40%", "Mid-term test and final exam are in person test, open-book", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 54, "course_code": "CIVE 460", "course_name": "CIVE460 - Engineering Biomechanics (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Biomechanics Winter 2025", "02:30PM - 05:20PM", "RCH 301", "Introduction to engineering technologies applicable to the field of biomechanics.", "Specific topics covered may include biological growth, form and function; biomaterials; kinematics and neurology of gait; biotribology; joint anatomy, function and repair; occupational biomechanics; trauma prevention.", "The course will provide a general overview of engineering biomechanics for civil, mechanical and biomedical engineering students.", "2. Conduct gait analysis and calculate forces applied at joints and foot reactions", "Introduction", "Evolution of Biomechanics", "Applications (medical and engineering)", "Musculoskeletal System", "Introduction,", "Anatomical positions & movements,", "System components,", "Gait Biomechanics", "Introduction;", "Muscles forces,", "Bone & Cartilage Biomechanics", "Introduction (highlights & progress),", "Bone mechanical properties & applications;", "Cartilage structure and mechanics", "Tendon & Ligament biomechanics", "Mechanical behaviour", "Biotribology & Joint Replacement", "Biotribology subfields,", "Cancer Biomechanics", "Introduction: cancer stages,", "Mechanical characteristics of cancer cells,", "Biomechanics and cancer treatment,", "Cardiovascular biomechanics, and", "Biomechanics in Radiotherapy", "“Orthopaedic Biomechanics: Mechanics and Design in Musculoskeletal Systems,” Pearson Prentice Hall.", "Biomechanics and motor control of human movement.", "Biomechanics and motor contAl-Mayah, A. (Ed.)"]}, {"course_id": 55, "course_code": "ECE 224", "course_name": "ECE224 - Embedded Microprocessor Systems (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Embedded Microprocessor Systems Fall 2024", "ECE 224", "ECE 224 001", "Monday, Friday -", "E7 4043", "ECE 224 002", "Monday, Friday -", "08:30AM - 09:50AM E7 4043", "11:30AM - 12:20PM E7 4043", "Rabiul Islam r25islam@uwaterloo.ca", "Emon Sarkar esarkar@uwaterloo.ca", "View requirements for ECE 224", "Course introduction: In this course, you will explore the design of embedded systems and computer interfaces.", "How should data be organized?", "When should data be exchanged?", "What conditions must be satisfied to reliably exchange data?", "Identify system realities (such as noise, jitter, metastability, and transmission line effects) and select suitable approaches for managing these realities in an embedded computer system.", "Compare and critically assess design tradeoffs in an embedded computer system.", "Analyze the effects of synchronization mechanisms on the operational characteristics of an embedded computer system.", "Design hardware and software components to reliably connect devices to an embedded computer system.", "Course Introduction", "An introduction to the teaching team, course expectations, deliverables, marking scheme, and a very brief introduction to interfacing concepts.", "Embedded Systems", "A review of the fundamentals of embedded systems and the terminology associated with embedded systems.", "Interfacing Software, Device Drivers and Synchronization", "A review of embedded software design concepts, followed by a discussion of synchronization concepts and analysis.", "A detailed examination of the design and behavior of drivers for shared and transmission lines, including considerations of signal integrity.", "Buses and Interconnections", "A comparison of the functional behavior and timing behavior of synchronous, asynchronous, partially interlocked asynchronous, semi-synchronous, and split cycle bus systems.", "Arbitration", "A detailed examination of alternatives for interconnection arbitration including both centralized and distributed arbitration techniques.", "Parallel Interfacing", "This includes an examination of the role of the interface in matching bus timing and signaling characteristics with a device's timing and signaling characteristics.", "Serial Interfacing", "This includes a comparison of asynchronous communication techniques and synchronous techniques as well as the protocols for serial communication.", "Error Detection and Correction", "An introduction to error detection and error correction including a discussion of error types, differences in detection and correction, and one example of an error correcting code (the Hamming code).", "Analog Interfacing", "An introduction to digital-to-analog interfacing, analog-to-digital interfacing, and sample-and-hold circuitry.", "This includes a discussion of static and dynamic errors.", "Examples", "You may use these exams to assess your preparation for the exams in the course.", "Assessment Estimated Completion Time Completion Date", "Lab studies: Lab studies are to be completed in groups of two.", "Students then write C software using the Intel Nios II Software Build Tools to control their embedded system to achieve a specified design goal.", "Lab Study 0: This is an introductory lab study that examines the design of a system-on-a-programmable chip (SOPC) design.", "In this lab, students design, build, and test a 32-bit microprocessor system based on the Nios II processor core.", "The hardware design and the board support package serve as a starting point for both Lab Study 1 and Lab Study 2.", "In this lab study, students design a software system that uses pushbuttons, LEDs, 7-segment displays, timers, polling loops, and multiple interrupt handlers to conduct an experiment into servicing a device.", "In this lab study, students design a software system to read a pre-recorded audio file from an SD card, process the audio data, and play it back on a speaker using a DAC.", "Students are given broad latitude to design the system.", "When a lab study builds upon previous submissions, comments such as \"In the previous submission, concerns were expressed related to the number of sample points in the experiment.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm and those who support others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 56, "course_code": "ECE 252", "course_name": "ECE252 - Systems Programming and Concurrency (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Systems Programming and Concurrency Fall 2024", "ECE 252", "ECE 252 001", "Monday, Friday -", "11:30AM -", "E7 4043", "Monday, Friday -", "10:00AM - 11:20AM E7 4043", "M. Cooper-Stachowsky", "11:30AM - 12:20PM E7 4043", "ECE 252 101", "E7 4043", "ECE 252 102", "04:30PM - 05:20PM", "ECE 252 201", "08:30AM - 11:20AM E2 3346", "ECE 252 202", "ECE 252 204", "08:30AM - 11:20AM E2 3346", "Mike Cooper-Stachowsky (Section 2): Mike came to the university of Waterloo in 2014 where he worked in the first year office helping new students transition into university.", "He is particularly interested in operating systems and systems programming, and learned a lot by writing his own kernel for the x86.", "Manavjit Singh Dhindsa -- ms2dhind@uwaterloo.ca", "Sheikh Abrar Tahmid -- sa2tahmi@uwaterloo.ca", "ECE 252:", "Performance and correctness of concurrent systems.", "Deadlock detection and recovery; file systems.", "View requirements for ECE 252", "This course assumes you are comfortable programming in a low level programming language (likely C++ from your Algorithms and Data Structures course).", "Apply standard concurrency scenarios such as producer-consumer, readers-writers, dining philosophers, as well as deadlock and starvation.", "Interact with the Linux operating system through the command-line interface and the C language API.", "Use inter-process communication such as shared memory and message queues.", "Do you need a textbook?", "To request that a question be re-marked, you will need to submit your request in writing via e-mail to the instructor.", "Collaboration and Group Work.", "Please bring this situation to the attention of the course staff as soon as possible so that can be resolved quickly.", "However, each group must submit their own, independently-developed code for each lab.", "Similarly, each person must submit their own, independently-developed code for each assignment.", "I suggest you avoid looking at other people’s code entirely, but if you do, then you should not be doing that anywhere you might be writing your own code.", "The temptation to write your code just like what you see is simply too high.", "However, penalties may be more severe for repeat offenders (see below for information on Academic Integrity).", "All of the above applies to multiple instances — a student caught in several incidents of academic dishonesty will be subject to the above penalties for each of the incidents.", "Laptop and Device Policy: The human visual system has evolved to perceive saber-toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text-mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "Piazza is a great tool for collaboration and it allows rapid but asynchronous exchange of infor mation.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be difficult to interpret on a discussion forum.", "In either case, we will cancel all the in-person lectures and in-class exercises during the relevant period and try to have some online synchronous video lectures during that period.", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, Chat- GPT) and how such tools can be used to write and test code.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 57, "course_code": "ECE 350", "course_name": "ECE350 - Real-Time Operating Systems (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Real-Time Operating Systems Winter 2025", "ECE 350", "ECE 350 001", "08:30AM - 09:50AM E7 4053", "11:30AM -", "ECE 350 201", "01:30PM - 04:20PM E2 2356A", "ECE 350 202", "01:30PM - 04:20PM E2 2356A", "01:30PM - 04:20PM E2 2356A", "ECE 350 101", "10:00AM - 11:20AM E7 4053", "About Prof. Zarnett", "8 years industry engineering experience in display & imaging", "Research specialization brain-machine interfacing", "Ahmed Elbaroudy - ammaelba@uwaterloo.ca", "Neeraj Nagar - nnagar@uwaterloo.ca", "Memory and virtual memory and caching; I/O devices, drivers, and permanent storage management; process scheduling; queue management in the kernel; real-time kernel development.", "Aspects of multi-core operating systems.", "View requirements for ECE 350", "Understand the differences between non-real-time and real-time operating system.", "The course notes should be pretty much everything you need for this course.", "I read them so you don’t have to!", "They are neither required nor recommended, but I'll list them here in case you truly wish to look at them.", "Operating Systems Internals and Design Principles (9th Edition).", "Please bring this situation to the attention of the course staff as soon as possible so that can be resolved quickly.", "However, each group must submit their own, independently-developed code for each lab.", "Similarly, each person must submit their own, independently-developed code for each assignment.", "I suggest you avoid looking at other people’s code entirely, but if you do, then you should not be doing that anywhere you might be writing your own code.", "The temptation to write your code just like what you see is simply too high.", "However, penalties may be more severe for repeat offenders (see below for information on Academic Integrity).", "All of the above applies to multiple instances — a student caught in several incidents of academic dishonesty will be subject to the above penalties for each of the incidents.", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, ChatGPT) and how such tools can be used to write and test code.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be diﬃcult to interpret on a discussion forum.", "The human visual system has evolved to perceive saber‐toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text‐mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions."]}, {"course_id": 58, "course_code": "ECE 356", "course_name": "ECE356 - Database Systems (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Database Systems Fall 2024", "ECE 356", "ECE 356 001", "11:30AM -", "08:30AM - 09:50AM E7 4417", "Data models, file systems, database system architectures, query languages, integrity and security, database design.", "View requirements for ECE 356", "Relational databases empower the vast majority of dynamic websites as well as a variety of information management systems in private and public sector organizations.", "ECE356 explores the concepts and techniques that make such databases convenient, efficient, and reliable.", "The course additionally includes an introduction to data mining and NoSQL.", "model data using entity-relationship (ER) diagrams", "understand the relational model and design a relational schema for a data set", "execute SQL commands against a remote database using Java Database Connectivity (JDBC)", "identify integrity constraints and functional dependencies in data", "apply the theory of database normalization to optimize the design of a relational schema", "understand the basics of transaction execution, concurrency control, and recovery in databases", "understand SQL injection attacks, as well as password hashing and salting", "perform simple data mining and analytics operations on real data sets", "design a denormalized schema for a NoSQL database", "September 4-10 intro, relational model SSH, mysql command line tool     first week of classes", "September 11-17 relational algebra, SQL relational algebra", "October 2-8 normalization normal forms and normalization", "Exams", "A make-up final exam, if offered by the instructor, may be scheduled in a future academic term.", "The instructor will not offer a make-up midterm, and will instead consider shifting the weight of a missed midterm towards the final exam.", "Members of the teaching team may also evaluate students' proficiency in the use of software in connection with lab work.", "If a student's solution differs substantially from the solution recognized by the teaching team, the student may be asked to provide sample inputs and outputs to evaluate the correctness of their solution.", "Collaboration", "Exams may cover both theory and practice, including your ability to read and write SQL code.", "Notice of Recording"]}, {"course_id": 59, "course_code": "ECE 358", "course_name": "ECE358 - Computer Networks (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 358", "10:00AM - 11:20AM E7 4417", "Email", "Prof. Catherine Rosenberg", "Mike Cooper-Stachowsky", "Substitute Instructor", "Dr. Abdalla Mohamed Hussein", "Maryam Amini", "maryam.amini@uwaterloo.ca", "yuan.quan@uwaterloo.ca", "Mohammad Abuyaghi", "This course is a comprehensive introduction to computer networks.", "View requirements for ECE 358", "Revised Description: This course is a comprehensive introduction to computer networks.", "The lower-level outcomes are:", "Have a good understanding of protocols and networking design concepts.", "Have a working knowledge of socket programming.", "Have a working knowledge of transport protocols with a special emphasis on TCP and retransmission protocols.", "Example of LAN technologies: Ethernet and switches.", "Synthesis: a day in the life of a web request", "LAB1: Development of a simulator of a single transmission system.", "Examination", "If you miss the midterm without a valid reason, that midterm earns a score of zero.", "Lab marking and reports submissions", "Instructions for how to package your files and submit are in the lab manuals."]}, {"course_id": 60, "course_code": "ECE 406", "course_name": "ECE406 - Algorithm Design and Analysis (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Algorithm Design and Analysis Winter 2025", "ECE 406", "ECE 406 001", "11:30AM -", "E. Creager", "04:00PM - 05:20PM", "E. Creager", "04:00PM - 05:20PM", "• Rushabh Solanki", "ECE 406:", "Design and analysis of efficient, correct algorithms.", "Advanced data structures, divide-and-conquer algorithms, recurrences, greedy algorithms, dynamic programming, graph algorithms, search and backtrack, inherently hard and unsolvable problems, approximation and randomized algorithms, and amortized analysis.", "View requirements for ECE 406", "How to design efficient algorithms using divide and conquer, greedy algorithms, and dynamic programming.", "The kinds of problems that can be solved with linear programming, and why they can be solved efficiently.", "What it means to reduce one problem to another, and how it used in complexity analysis", "Introduction to algorithms Chapter 0 0.5 hours", "Divide and conquer algorithms Chapter 2 5 hours", "Graphs, decompositions and depth-first search Chapter 3 3 hours", "Linear Programming: Simplex algorithm, duality theorem Chapter 7 4 hours", "No lectures during ECE midterms week (Feb 24--28)", "LEC001] Tue 2:30--3:30pm in E7-5353", "Assignments Information and Guidelines: Assignments are given roughly every other week, and their primary goal is to give you practice in designing and analyzing algorithms.", "You must list these collaborators at the top of the first page of your assignment (there is no penalty for listing collaborators, but it ensures we do not falsely identify plagiarism).", "In submitting an assignment, you are “signing off on your work” as described in the academic integrity form at https://uwaterloo.ca/academic-integrity/. The penalty for a first plagiarism offence is -100% for the assignment.", "* Each student must turn in a signed academic integrity form to confirm their understanding of the above policies.", "Notice of Recording"]}, {"course_id": 61, "course_code": "ECE 457B", "course_name": "ECE457B - Fundamentals of Computational Intelligence (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Fundamentals of Computational Intelligence Winter 2025", "ECE 457B", "Monday, Friday -", "10:00AM - 11:20AM E7 5353", "04:00PM - 05:20PM", "Da Saem Lee : ds3lee@uwaterloo.ca", "Communication and Discussion", "If you really have a critical time issue, or you don't want the TA's to see the message (for any reason at all), then you should send Prof. Crowley a direct message on Teams chat in addition to email.", "Model-based prediction and classification.", "Multiple examples and case studies such as autonomous driving, intelligent manufacturing, natural language understanding, speech recognition, computer vision, stock market prediction, disease early detection and diagnosis.", "View requirements for ECE 457B", "It encompasses a broad spectrum of supervised learning topics, including nonparametric and parametric models, linear and nonlinear approaches, deep learning paradigms, and probabilistic models.", "Theoretical knowledge is translated into practice through tutorials on industry-standard tools such as PyTorch and Keras.", "Interactive classroom discussions will pivot around both the practical trade- offs inherent in real-world applications and the theoretical underpinnings that provide an intuitive grasp of the field.", "These topics are an outline, and each year some subset of non-core topics will be skipped due to time constraints and in order to benefit students through deeper focus.", "Classification I", "Distance based - k-Nearest Neighbours (kNN)", "Fundamentals of Parameter Estimation and Learning", "MAP Implementation as Classification: Naive Bayes Algorithm", "Dimensionality Reduction and Manifold Learning", "Vector Embeddings : TF-IDF, Word2Vec, BERT", "Kernel Methods and Latent Models", "k-Means Algorithm, DBScan Algorithm", "Anomaly Detection: Classification, Outlier, Density, and Isolation based", "Classification III : Data, Image and Time-series classification using Deep Learning", "Representation Learning II: Auto-encoders and Variational Auto-Encoders", "Attention and Transformer Networks", "Some additional information and links might be here for older courses.", "A visual grading tool for pdfs submissions of tests and assignments, allows limited online test with mark-down text entry and multiple choice questions.", "Some assignments and tests might be made available online for submission using this tool as well.", "Arxiv Tutorials - pdfs will be posted to hypothes.is and others links will be provided to a number of detailed tutorials on some course topics.", "The first half covers many of basics of this course, while the second half focusses on Deep Learning only.", "Exams", "Completing the assignments will require multiple skills:", "familiarity with statistical, probabilistic analysis of data and results", "logical design and clear description of a expeirmental methodology", "programming various algorithms for processing, training and analysis of data to achieve given tasks (programming will be in Python using libraries such as sci-kit learn and tensorflow, pytorch, pandas)", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 62, "course_code": "ECE 459", "course_name": "ECE459 - Programming for Performance (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 459", "Monday, Friday -", "08:30AM - 09:50AM E7 5353", "04:00PM - 05:20PM", "Monday, Friday -", "04:00PM - 05:20PM", "11:30AM -", "07:00PM - 07:50PM E7 5353", "07:00PM - 07:50PM E7 5353", "About Prof. Zarnett", "Then I got the AIF in the mail and decided I didn't want to study Computer Engineering after all.", "I'm an Associate Professor of Electrical and Computer Engineering.", "Some of you will know me as the previous Director of Software Engineering from back when you were in 1A. I studied math/CS yet convinced PEO to license me as a P.Eng.", "My research interests focus on using compiler and static analysis techniques to ensure program correctness.", "The LI is responsible for technical matters related to the assignments: git.uwaterloo.ca, git in general, administering the systems where you need to run your labs.", "And I enjoy engaging in discussions about these fields.", "Thanushon Sivakaran <tsivakar@uwaterloo.ca>", "Profiling computer systems; bottlenecks, Amdahl's law.", "View requirements for ECE 459", "Many modern software systems must process large amounts of data, either in the form of huge data sets or vast numbers of (concurrent) transactions.", "This course introduces students to techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs.", "These techniques will enable you to design and build critical software infrastructure, especially in an age of Big Data.", "While you may have seen some of these ideas in the context of operating systems (ECE350/SE350/CS350/MTE241) and concurrency (ECE252/CS343), this course gives you tools to make code run faster.", "Design and apply techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs.", "We intend to use these slots until we reach the end of the course material.", "The notes cite a number of sources, some of which are useful books.", "Rust familiarization and use of nonblocking I/O;", "Auto‐grading and auto‐feedback systems, including marmoset, may be used for the evaluation of some of your assignments.", "Acceptable collaboration includes discussing ideas and structures with others, as well as helping others debug their code.", "If your code is too close in structure to someone else's code, you are going to have a problem.", "Or, let's sum this up in two short instructions:", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, ChatGPT) and how such tools can be used to write and test code.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be diﬃcult to interpret on a discussion forum.", "The human visual system has evolved to perceive saber‐toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text‐mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 64, "course_code": "ME 574", "course_name": "ME574 - Engineering Biomechanics (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Biomechanics Winter 2025", "02:30PM - 05:20PM", "RCH 301", "Introduction to engineering technologies applicable to the field of biomechanics.", "Specific topics covered may include biological growth, form and function; biomaterials; kinematics and neurology of gait; biotribology; joint anatomy, function and repair; occupational biomechanics; trauma prevention.", "The course will provide a general overview of engineering biomechanics for civil, mechanical and biomedical engineering students.", "2. Conduct gait analysis and calculate forces applied at joints and foot reactions", "Introduction", "Evolution of Biomechanics", "Applications (medical and engineering)", "Musculoskeletal System", "Introduction,", "Anatomical positions & movements,", "System components,", "Gait Biomechanics", "Introduction;", "Muscles forces,", "Bone & Cartilage Biomechanics", "Introduction (highlights & progress),", "Bone mechanical properties & applications;", "Cartilage structure and mechanics", "Tendon & Ligament biomechanics", "Mechanical behaviour", "Biotribology & Joint Replacement", "Biotribology subfields,", "Cancer Biomechanics", "Introduction: cancer stages,", "Mechanical characteristics of cancer cells,", "Biomechanics and cancer treatment,", "Cardiovascular biomechanics, and", "Biomechanics in Radiotherapy", "“Orthopaedic Biomechanics: Mechanics and Design in Musculoskeletal Systems,” Pearson Prentice Hall.", "Biomechanics and motor control of human movement.", "Biomechanics and motor contAl-Mayah, A. (Ed.)"]}, {"course_id": 65, "course_code": "MSE 343", "course_name": "MSE343 - Human-Computer Interaction (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Human-Computer Interaction Fall 2024", "10:00AM - 11:20AM QNC 2502", "10:00AM - 11:20AM QNC 2502", "11:30AM - 12:20PM QNC 2502", "This course is designed to provide in-depth exposure to the concepts of human-computer interaction and methods of interactive information system design.", "The course will focus on techniques for building information systems that meet human needs and capabilities by following a system development lifecycle: user requirements analysis, information and interaction design, prototyping and evaluation.", "View requirements for MSE 343", "Explain and justify the benefits and drawbacks of user-centred design", "Describe guidelines and models that can be applied to interface design", "Apply a variety of methods to involve the people who use an application in the design process", "Evaluate the usability of an interface", "Explain and justify the benefits and drawbacks of user-centred design 1 KB c) Demonstrate understanding of engineering fundamentals.", "Describe guidelines and models that can be applied to interface design 1 KB d) Demonstrate understanding of specialized engineering knowledge", "Apply a variety of methods to involve the people who use an application in the design process 4 Des b) Generate and implement solutions to complex open-ended problems", "Evaluate the usability of an interface 4 Des c) Evaluate/test solutions and refine designs to better meet requirements", "Process and Requirements", "Introduction to HCI Chapters 1 & 9", "User-centred design Course Notes", "Gathering Requirements and Task-centred design Chapter 10", "Designing Alternatives + Prototyping", "Interface Types & Graphical screen design Chapter 6", "Evaluate", "Evaluating Interfaces with Users: Qualitative Methods Chapters 13 & 7", "Analytical Evaluation: Heuristic Evaluation & Fitts’ Law Chapter 15", "Social & Emotional Interaction Chapter 4 & 5", "Psychology of everyday things & Cognition Chapter 3 & Notes", "Interaction Design: Beyond human computer interaction, 4th edition.", "You will be working in a team of three to five for all these milestones.", "There will be a set of online and in-person activities taking the place of the lab session in this course.", "You can complete these by simply attending class and participating in the activities; there will be a time limit to submit your materials.", "Up until the date of the final exam, you may submit any submitted material for regrading under the following conditions:", "(Ask them first!)", "Extensions", "No extensions will be given after a submission date.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 66, "course_code": "MSE 432", "course_name": "MSE432 - Production and Service Operations Management (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Production and Service Operations Management Winter 2025", "Introduction to management, planning, and control decisions in manufacturing and service settings using quantitative approaches.", "Students are exposed to a number of examples and case studies, and work on a project that involves analysis and discussion of improved designs.", "Develop understanding of the impact of services and production operations in organizations [PA]", "Employ decision-making tools used by operations managers [", "Impact]", "Introduction to OM and Demand Forecasting (I)", "Demand Forecasting (II) and Product Design", "Capacity Planning and Process Design/Facility Layout", "Chapters 11", "Aggregate Operation Planning", "Just-in-Time Production and Project Management", "Demand Forecasting", "Capacity Planning and Process Design/Facility Layout", "Aggregate Operations Planning", "JIT & Project Management"]}, {"course_id": 67, "course_code": "MSE 446", "course_name": "MSE446 - Introduction to Machine Learning (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Machine Learning Winter 2025", "04:00PM - 05:20PM", "Topics covered may include data cleaning and transformation, overfitting and generalization, n-fold cross validation, regression, decision trees, neural networks, rule finding, and clustering.", "View requirements for MSE 446", "Problem Analysis]", "Jan. 6   Introduction", "Mar. 31   Advanced topics", "Apr. 2   Advanced topics", "https://web.stanford.edu/~jurafsky/slp3/ Includes language models No 0", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 68, "course_code": "MSE 555", "course_name": "MSE555 - Scheduling: Theory and Practice (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["11:30AM -", "Students will be introduced to the theoretical background in these areas, but the emphasis will be placed on modelling and solving scheduling problems in practice.", "Students will apply these concepts in design activities in assignments and a course project.", "In this course, we look at practical scheduling problems, solution techniques, and algorithms in both manufacturing and service industries.", "We apply our knowledge to investigate one case study concerning real world scheduling problems and learn from one guest speaker who discusses interesting scheduling challenges and opportunities.", "Modeling and solving scheduling problems", "Analyzing scheduling related data and deriving insights into the problem", "Understanding the main challenges in real world scheduling problems", "Submit", "Introduction", "Administration", "Introduction: Scheduling Problems", "4.4", "4.4", "Dispatch Rules and Shifting Bottleneck", "Solution Techniques", "Introduction to Service Scheduling", "Workforce Scheduling", "Queueing & Scheduling", "Queueing & Scheduling (continue …)", "Queueing & Scheduling (continue …)", "TBA", "“Planning and Scheduling in Manufacturing and Services,” Michael L. Pinedo (Springer).", "Total"]}, {"course_id": 69, "course_code": "MTE 241", "course_name": "MTE241 - Introduction to Computer Structures and Real-Time Systems (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Computer Structures and Real-Time Systems Fall 2024", "08:30AM - 09:20AM E7 3343", "08:30AM - 10:20AM E7 3343", "M. Cooper-Stachowsky", "MTE 241 202", "M. Cooper-Stachowsky", "M. Cooper-Stachowsky", "11:30AM -", "12:20PM E7 3343", "All software and also the law and ethics course one time -- let's discuss contract law if you're up for it?", "Mike Cooper-Stachowsky -- mstachowsky@uwaterloo.ca", "Introduction to computer organization, basic real-time concepts, process management, interprocess communication and synchronization, memory management, resource management, interrupt handling, concurrent programming, file systems.", "View requirements for MTE 241", "Describe the basic components of a computer system [KB(I)]*", "Perform Memory-Mapped I/O [KB(D)]", "Program a real-time application with multiple coordinated tasks [Des(D),Tools(D)]", "STM32F401RE Nucleo Board A microcontroller board for the labs.", "A Practical Introduction to Real-Time Systems For Undergraduate Engineering It's the textbook, available free in PDF form: https://ece.uwaterloo.ca/~dwharder/icsrts/Lecture_materials/A_practical_introduction_to_real-time_systems_for_undergraduate_engineering.pdf No", "Available for free in PDF form: https://github.com/jzarnett/mte241/ Yes", "You should purchase this board well in advance of the first lab and install the STM32CubeIDE software to test that it works.", "A small number of lab computers will have the software installed for your use.", "You will use the STM32F401RE microcontroller board and the STM32CubeIDE to write a real-time operating system in the C language.", "The questions are designed to test your understanding of the concepts you should have learned in the lab.", "Exams are in-person, closed-book.", "This paper must be a standard letter size.", "Laptop and Device Policy: The human visual system has evolved to perceive saber-toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text-mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "In either case, we will cancel all the in-person lectures and in-class exercises during the relevant period and try to have some online synchronous video lectures during that period.", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, Chat- GPT) and how such tools can be used to write and test code.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 70, "course_code": "MTE 325", "course_name": "MTE325 - Microprocessor Systems and Interfacing for Mechatronics Engineering (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Microprocessor Systems and Interfacing for Mechatronics Engineering Winter 2025", "03:30PM - 04:20PM", "E5 3102", "01:30PM - 04:20PM E3 3155", "01:30PM - 04:20PM E3 3155", "01:30PM - 04:20PM E3 3155", "book a meeting", "E7-3412", "Synchronization and data flow; interfacing to sensors and actuators;", "parallel, serial, and analog interfacing; buses; direct memory access (DMA); interfacing considerations; privacy and security considerations.", "View requirements for MTE 325", "Summarize the flow of data between software and hardware elements in an embedded system", "Describe the trade-offs between implementation alternatives for both hardware and software", "Outline the ethical implications of embedded system design choices", "Use industry-standard tools to implement and debug embedded systems", "Design an embedded system to perform a given task", "Projects provide students with an opportunity to explore selected concepts in a real-world context.", "Lectures and tutorials are held in person and attendance is expected at all sessions for learning and skill development.", "Jan 20th and Jan 22nd  Lab 1 – Introduction and setup (watch Learn for signup instructions closer to)", "Lab 2 – Synchronization Techniques", "Course Introduction An introduction to the teaching team, course expectations, deliverables, marking scheme, and a very brief introduction to interfacing concepts.", "Embedded Systems A review of fundamentals of embedded systems and the terminology associated with embedded systems.", "Embedded Design Model An introduction to the embedded design model used to develop a system for the remainder of the course.", "Embedded Software An overview of they key differences between software for embedded systems and general software development.", "Synchronization, Data Generation and Data Transfer A model for analyzing synchronization behaviour and performance and examples of synchronization analysis.", "Buses - Data Transfer A comparison of the functional behaviour and timing behaviour of synchronous, asynchronous, and partially interlocked asynchronous.", "Parallel Interfacing A detailed examination of the design of parallel interfaces.", "This includes an examination of the role of the interface in matching bus timing and signaling characteristics with a device's timing and signaling characteristics.", "Analog Interfacing An introduction to digital-to-analog interfacing, analog-to-digital interfacing, and sample-and-hold circuitry.", "This includes a comparison of asynchronous communication techniques and synchronous techniques as well as the protocols for serial communication.", "Buses - Arbitration A brief examination of alternatives for bus arbitration including a discussion of the operation and characteristics of daisy chained and non-daisy chained bus arbitration techniques.", "A brief examination of direct memory access including a discussion of hardware design implications, software implications, and system performance.", "Security and Ethics An overview of common security terminology and why it has become increasingly important for embedded systems.", "The ethical implications of today’s embedded systems applications will also be discussed.", "Other References", "Supplementary readings are available for most chapters on Learn No $0.00", "You are encouraged to subscribe in order to receive email copies of announcements.", "The LEARN calendar has been setup to specify reminders of important dates for the course.", "The Project module contains a description of the projects as well as files and resources that may be useful in completing the projects.", "You may use these exams to assess your preparation for the exams in the course.", "Your project average includes your grades for all project demonstrations and submissions.", "Students will need to make design decisions and use the resources that are typically available for a particular embedded system application.", "The purpose of this project is to provide practice with applications of course concepts and experience tackling an open-ended interfacing problem in preparation for their 3rd and 4th year design projects.", "Demonstration-based deliverables Can be completed anytime during lab sessions 3-6 19", "Submission-based deliverables Last day of class, 8:00 pm 5", "University of Waterloo Verification of Illness forms and self-declared absences will be taken into consideration only for the student to whom it applies, if appropriate.", "Notes for Students Repeating the Course", "Do I have to do the project again?", "Can I reuse material from previous submissions?", "It would also be helpful if you provided comments such as \"In the previous submission, concerns were expressed related to the definition of maximum stable frequency.", "Exams", "***Any guidelines UW releases on verification and declaration of illness for the term, will supersede the instructions given here***", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 71, "course_code": "MTE 544", "course_name": "MTE544 - Autonomous Mobile Robots (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "yue.hu@uwaterloo.ca", "11:30AM - 12:20PM E5 3102", "E3 3178", "yue.hu@uwaterloo.ca", "E3 3178", "yue.hu@uwaterloo.ca", "E3 3178", "yue.hu@uwaterloo.ca", "08:30AM - 11:20AM E3 3178", "yue.hu@uwaterloo.ca", "Location: E5 - 3102", "Fundamentals of autonomous mobile robotics, including both perception and planning for autonomous operation, sensor modelling, vehicle state estimation using Bayes Filters, Kalman Filters, and Particle Filters as well as onboard localization and mapping.", "Topics in planning include vehicle motion modelling and control, as well as graph based and probabilistic motion planning of (Micro Electro Mechanical Systems) MEMS devices.", "This course covers four fundamental topics of Autonomous Mobile Robotics; 1) modeling, 2) sensors and perception, 3) estimation (localization and mapping), 4) planning and navigation.", "Modeling covers kinematic models of various types of wheeled mobile robots.", "Sensors include various types and algorithms (for vision and range sensors).", "Estimation includes Bayesian estimation theory and its application to localization (and/or mapping).", "Topics in Planning include odometry motion models and graph-based and probabilistic motion planning as well as obstacle avoidance (reaction-based) methods.", "Discussions and questions - Piazza", "Sign-up link: https://piazza.com/uwaterloo.ca/fall2024/mte544, Access code: MTE544FALL2024.", "We have a few desktop computers (number subject to change depending on working conditions of the computers) that can be accessed remotely.", "User accounts are given on a per-request basis.", "A booking system will be set up for those choosing to use this solution.", "We have a total of 15 laptops (number subject to change depending on working conditions of laptops) that students can lend on a first-come-first-served basis.", "The lending time must not exceed one week each time.", "Develop kinematic models and controls for autonomous robots.", "Apply motion and measurement models to a variety of vehicles and sensors.", "Apply localization/mapping algorithms for perception within environments.", "Create collision free paths through environments based on maps.", "9/4 Course logistics and introduction", "9/4", "9/11 Kinematic models: 4 wheels, holonomic and omniwheel", "9/18 Introduction to sensors, Inertial sensors, Position Sensors", "9/24 Introduction to odometry, Range sensors (line-fit and RANSAC)", "-", "9/25", "10/1 Vision sensors and basics of image processing", "10/8 Introduction to localization, Discrete motion model", "10/29 Probabilistic Motion Model and Velocity Motion Model", "10/30 Probabilistic Measurement Model and Likelihood Field Model", "11/12 Introduction to planning, graph-based methods, Dijkstra", "11/13 A*, D*, introduction to random methods", "11/20 RRT*, Potential Field", "11/27 Explanation of take-home exam & course summary", "Fr1 Section: Friday 8:30-11:20 AM", "There will be a total of 4 in-person Lab sessions, taking place in E3-3178, in-person attendance is compulsory.", "If you need to switch to a different section, you need to inform the instructor and the TAs for the arrangement with one week notice (accommodations for late notices are allowed on a case-by-case evaluation basis).", "Lab#2 – Control the robot to follow a trajectory using a closed-loop controller.", "Lab#3 – Estimation and mapping: estimate robot motion from sensor data utilizing filters.", "The in-person lab is not meant for implementation but for testing and getting help from the TAs.", "Fail to submit a completed code will result in penalty on the lab report.", "Each member must demonstrate to have equally contributed to the report.", "Submit the report with a final version of your code, and attach a list of modifications made between the first version and the final version.", "About 2 weeks’ time will be given to complete each assignment.", "Notice of Recording", "In case of shutdown of in-person activities, the following arrangements will take place:", "This course includes the independent development and practice of specific skills, such as implementation of theory into practice (e.g. algorithms into code), knowledge of the mathematical models and algorithms, and being able to develop independent solutions for mobile robotics.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 72, "course_code": "MTE 545", "course_name": "MTE545 - Introduction to MEMS Fabrication (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to MEMS Fabrication Fall 2024", "E7 3343", "Discussions", "Questions of a personal nature", "Email: omar.awad@uwaterloo.ca", "Location: E3 - 3161", "Email: agulsaran@uwaterloo.ca", "Introduction to MEMS.", "Basic MEMS governing equations in different energy domains (mechanical, electrical, and thermal).", "Techniques for testing and characterization of MEMS devices.", "The goal of this course is to develop a basic understanding of the fabrication techniques as well as the design of Micro Electro Mechanical Systems (MEMS) including:", "Surface Micromachining", "Bulk Micromachining", "Piezoresistive MEMS transduction", "Apply common microfabrication methods for the layout of MEMS structures", "Have an understanding of the design and multi-physics analysis of MEMS", "Use CoventorWare™ to layout, simulate the production, and model MEMS structures", "1 4-Sep Le1 Introduction to MTE 545 Ch1 (1.1 ) -", "Other Thin Film Deposition Methods for MEMS", "Creating and Transferring Patterns - Part 1 Ch2 (2.4-2.5)", "11-Oct Le17 Designing a Fabrication Process - MEMS Fab Exercise 2 Review Le4 - Le17", "30-Oct Le22 Mechanical Modeling of Beams - Part 2 Ch10 (10.3.3)", "1-Nov Le23 Mechanical Modeling of Beams - Part 3 Ch10 (10.3.3)", "7-Nov Le25 MEMS Pressure Sensor - Mechanical Analysis Ch10 (10.3.3)", "9-Nov Le26 MEMS Pressure Sensor - Electrical Analysis 1 Ch8 (8.3)", "TBD", "R. C. Jaeger, \"Introduction to Microelectronics Fabrication,\" First Edition, Addison-Wesley, 1993", "T. R. Hsu, \"MEMS & Microsystems: Design, Manufacture and Nanoscale Engineering,\" John Wiley & Sons Inc., 2008", "J. W. Gardner, V. Varadan, O. Awadelkarim, “Microsensors MEMS and Smart Devices,\" John Wiley & Sons, Inc. 2002", "Most recent updates on library services and operations", "Worst knowledge quiz grade will be dropped", "Setting aside at least two hours per week to study the material delivered in class in preparation for exams.", "There are eleven knowledge review quizzes in total during the term.", "The course uses CoventorWare® for the layout of MEMS devices and their analysis using finite element modeling (FEM).", "You will be introduced to the layout tools and FEM analysis features of CoventorWare® in the following two-hour labs:", "CoventorWare® Laboratory 1: Introduction to CoventorWare® (Week 5)", "They will be offered in-person in E3 - 3178 in groups of maximum 10 people, during the dates, times and room specified below:", "Please self-enroll for any of these time slots using your Available Groups in LEARN.", "MEMS Characterization Laboratories", "There will be three MEMS characterization laboratories during the term.", "Please, self-enroll in the pre-scheduled time slots posted in the MEMS Laboratories - Group Members, Dates and Times section, in groups of maximum 3 people, using your Available Groups in LEARN.", "Laboratory 1: Introduction to MEMS Devices (Week 3)", "Exams", "Many of these responsibilities are described at the first lecture and/or captured in the policies of the University."]}, {"course_id": 73, "course_code": "NE 466", "course_name": "NE466 - Tactile Sensors and Transducers (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 09:50AM MC 4058", "Principles of transduction including capacitive, piezoelectric, piezoresistive, percolation, and tunneling-based sensing.", "Designing bendable and stretchable sensors, and self-powered sensors.", "Applications including robotics, electronic skin, biometrics, and bio-vitals.", "Understand basic principles of tactile sensing in skin.", "Ability to identify and evaluate key performance parameters for tactile sensors and make design choices based on it.", "Understand non-core concepts related to tactile sensing such as flexible devices.", "Design simple flexible devices based on the use of passive architecture.", "Overview of human skin and its tactile capabilities", "(Basic structure of skin, different types of tactile receptors, Their location, density and basics of nerve impulse generation and encoding)", "Current methods for tactile sensing", "(Some common methods for tactile sensing and their basic physics, Capacitive, piezoelectric, peizoresistive, percolation, tunneling)", "(A hierarchical nanostructures and FET based sensing)", "Self-powered/Energy harvesting sensors/TENG based sensor", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 74, "course_code": "NE 481", "course_name": "NE481 - Nanomedicine and Nanobiotechnology (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 09:50AM E6 2024", "11:30AM -", "Email:  eyim@uwaterloo.ca", "Overview of biomedical engineering principles.", "Formulation and manufacturing processes for production of nanoparticles for medical applications.", "Route of administration and controlled delivery strategies.", "Formulation and manufacturing process for drug delivery in the biotechnology and pharmaceutical industries.", "CHE 560: View requirements for CHE 560", "Overview of biomedical engineering principles.", "Formulation and manufacturing processes for production of nanoparticles for medical applications.", "Route of administration and controlled delivery strategies.", "Formulation and manufacturing process for drug delivery in the biotechnology and pharmaceutical industries.", "4. Design scalable formulations and manufacturing processes to produce nanomedicine for biomedical applications.", "Week 1:  (Topic 1) Course overview: Introduction to biomaterials and nanomedicine", "Introduction to biomaterials and biointerface", "Micro / nanoparticle formulation strategies", "Emulsion", "Introduction to HLB", "Suspension", "Introduction to tablet and tablet manufacturing process", "Overview of physiology system related to oral drug administration: neural, cardiovascular, renal, gastrointestinal systems", "Pharmacokinetics", "Adsorption", "Distribution", "Metabolism", "Elimination", "Introduction to controlled release", "Overview of administration of nanomaterials and tissue response", "Examples of alternative administration, controlled release in body systems, targeted delivery", "Sterilization", "Introduction to regulatory approval process for drugs", "Preclinical and clinical trials", "Biomaterials Science: An Introduction to Materials in Medicine, 3rd edition.", "Design Projects 30%", "Online quizzes and Dropbox folders for projects will be access via Learn.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 75, "course_code": "NE 486", "course_name": "NE486 - Biosensors (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to biosensors.", "Chemical, optical, and pattern recognition-based sensing.", "DNA aptamer-based sensors and devices.", "Applications in drug screening and diagnostics.", "View requirements for NE 486", "Introduction to biosensors: fundamentals and applications.", "Biosensor structure", "Principle of operation", "Implementation methods", "Applications in drug screening and diagnostics", "Gain a broad view of biosensor designs", "Understand the general principles of operation", "Describe sensor performance", "Understand common implementation methods", "Be aware of current state-of-the-art biosensor technologies", "Design biosensors for example applications conceptually", "Introduction", "Biological components, Surface Chemistry, Modes of recognition & Theory", "Enzyme", "Optical", "Electrochemical", "Others"]}, {"course_id": 76, "course_code": "NE 487", "course_name": "NE487 - Microfluidic and Nanobiotechnological Systems (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Microfluidic and Nanobiotechnological Systems Winter 2025", "04:00PM - 05:20PM QNC 2502", "Email: mahla.poudineh@uwaterloo.ca", "Principles, design, and fabrication methods for biomedical devices.", "Techniques for disease diagnosis, including enzyme-linked immunosorbent assays, current state-of-the-art technologies, lab-on-a-chip devices and biosensors.", "In this course, an introduction to the field of biosensors and an in-depth and quantitative view of device design and performance analysis will be given.", "Students will be introduced to different biosensing techniques, such as electrical biosensors and electrochemical biosensors with an emphasis on biomedical and environmental applications.", "Student will be familiarized with some of the conventional techniques used in the clinic for disease diagnosis such as ELISA (enzyme-linked immunosorbent assay) and then with the current state-of-the-art technologies and lab-on-a-chip devices and biosensors developed to simplify and improve molecular and cellular diagnostic approaches.", "Students will learn about microfluidic systems which have been developed rapidly in recent years and emerge as a powerful tool in the field of biomedical engineering.", "During first two weeks of the course, students will be briefly introduced to the basic molecular biology, such as DNA, RNA and protein and their role in biosensor.", "Additional background reading is supplied providing information on basic concepts in chemistry, thermodynamics and cell biology.", "Introduction to molecular biology", "Biosensor elements", "Calibration curves, the method of standard addition, and sensitivity", "They will learn about common methods of deriving the calibration curve and determining the limit of detection (LOD) and limit of quantification of biosensors (LOQ).", "Electrochemical biosensors", "Electrochemical biosensors are a class of electrical sensors and usually consist of three main electrodes: working electrode, reference electrode, and counter electrode.", "Enzyme-based biosensors, e.g., the blood glucose sensor", "Enzyme-based biosensors uses enzymes as the recognition elements and combines it with a transducer to produce a signal which is proportional to target analyte concentration.", "Students will learn about this class of biosensor, specifically via introduction of continuous glucose monitoring (CGM) devices as a well-known enzyme-based sensor.", "In this topic, students will be also introduced to the recent progress in the field of real-time monitoring.", "Microfluidic biosensors and devices", "• Introductory Bioelectronics: for Engineers and Physical Scientists, R. Pethig and S. Smith, Wiley, 2012, ISBN: 978-1119970873", "This course includes the independent development and practice of specific skills, such as writing.", "Library for research-based assignments"]}, {"course_id": 78, "course_code": "SYDE 334", "course_name": "SYDE334 - Applied Statistics (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Applied Linear Models Winter 2025", "08:30AM - 09:50AM MC 4020", "02:30PM - 03:20PM", "RCH 101", "Thursdays from 3:00-4:00pm in M3 3021", "Modelling the relationship between a response variable and several explanatory variables (an output-input system) via regression models.", "Model diagnostics and improvement.", "Algorithms for variable selection.", "Review of basic Normal theory, t, chi-squared, and F distributions.", "Simple linear regression.", "Analysis of variance.", "Multiple linear regression, variable selection techniques, indicator variables, diagnostics.", "Brief introduction to non-linear regression, factorial experimentation.", "Registered students can enroll in the class discussion board through Piazza.", "Search for your question first before posting.", "Do not expect a full solution to your question.", "To help maintain a safe, respectful, and productive community in which we – students and teaching team alike – can take risks in our learning/teaching, tackle challenging concepts, and ultimately grow as learners, we should endeavor to follow these mutual expectations:", "Explain the main concepts of linear regression models.", "Understand the methods of least squares and maximum likelihood estimation for model parameters.", "Interpret the model and its parameters (e.g., regression coefficients) in the context of any application.", "Draw inferences from a fitted model about the parameters of interest and make predictions.", "Apply the previous two outcomes when fitting linear models to real data using R.", "Assess model quality by diagnosing violations in underlying model assumptions (and identify strategies for improvement).", "Evaluate competing fitted models built using various model selection methods (and choose between them).", "Introduction", "The Straight Line Model", "Model formulation and interpretation", "Least squares estimation", "Mean response and residual variance estimation", "Introduction to R/RStudio", "Maximum likelihood estimation", "Estimators and their properties", "Important distributions", "Distributions of estimators", "Confidence intervals", "O - Ch. 2-4", "Straight Line Model in R", "Prediction intervals", "Intervals in R", "Hypothesis testing", "O - Ch. 4-5", "ANOVA and F test", "Model limits", "Data transformations", "O - Ch. 4-6", "O - Ch. 7", "A1 and Q1 Solutions", "Multivariate normal distribution", "The Linear Model", "Examples", "O - Ch. 8-9", "Estimation", "Estimators and their properties", "Distributions of estimators", "O - Ch. 9, 11, 12", "ANOVA and F test", "Significance tests", "General linear hypothesis", "O - Ch. 9, 11, 12", "A2 and Midterm Solutions", "Case Study: South African heart disease", "Nested models", "Additional sum of squares", "O - Ch. 12", "Outliers", "O - Ch. 13-14", "Influence", "O - Ch. 14-15", "A3 and Q2 Solutions", "One-variable-at-a-time selection methods", "Criteria-based selection methods", "O - Ch. 16", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solve exercises from the textbook on your own.", "Introduction to Regression Modeling by Abraham and Ledolter This textbook is an optional reference book (available for free on LEARN).", "R and R-Studio Free software.", "To serve as an opportunity to demonstrate your understanding, application, and integration of the course material, including practical application of the skills/concepts with the statistical software, R.", "Missed Assignment: The time window to complete these assessments are generous and, in general, a sickness lasting a couple of days will not be enough of a reason to ask for alternative accommodations and/or extension.", "Tips for Success", "Students should critically compare their work with available solutions and against the solutions of fellow classmates.", "Notice of Recording", "To help you decide if you should isolate, you can use the provincial self-assessment tool.", "In the scenario where we must transition back online the following contingencies will be used:", "These materials are made available for the personal use of students registered in the current offering of this course.", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical proofs and the fitting, interpretation, and assessment of linear models in real applications.", "Library for research-based assignments"]}, {"course_id": 79, "course_code": "SYDE 522", "course_name": "SYDE522 - Foundations of Artificial Intelligence (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["The objective of this course is to introduce students to fundamental concepts of artificial intelligence.", "Understand the basic concepts in Artificial Intelligence (CEAB requirements: 1d)", "Discuss how basic concepts lead to modern AI systems (CEAB requirements: 1d)", "Integrate ethical considerations when using AI (CEAB requirements: 10)", "Instruction", "Course slides and code notebooks will be posted on LEARN.", "W Sept 4 Introduction and Definitions", "M Sept 9 Perceptrons and Delta Rule", "M Sept 16 Evaluation Metrics and Experimental Validation", "M Sept 23 Linear SVMs", "M Nov 25  Extra Topics: Genetic Algorithms", "Late policy: If students have reasons for an assignment to be submitted late, they need to contact the instructor and accommodations can be made on a case-by-case basis.", "Course and Departmental Expectations", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.", "A.A.S. also offers learning strategy supports to all students that can be accessed through:"]}, {"course_id": 81, "course_code": "SYDE 532", "course_name": "SYDE532 - Introduction to Complex Systems (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Introduction to Complex Systems Winter 2025", "10:00AM - 10:50AM E5 6008", "Professor Paul Fieguth pfieguth@uwaterloo.ca Office Hours: Mondays 4-5pm in E7-6338", "The overwhelming majority of societal, ecological and climate issues of pressing importance are complex systems; nonlinear dynamic interacting systems poorly characterized by linear analyses and Gaussian statistics.", "This course introduces the mathematics needed to understand such interactions, including nonlinear dynamics, critical and bifurcation behaviours, large-scale systems and power-law distributions.", "The mathematical methods will be motivated by extensive examples and case studies such as global warming, energy shortages, desertification, overpopulation, poverty, and economic instability, to be investigated from a systems engineering perspective that will connect mathematical concepts to real-world examples.", "Understand the assumptions and limitations behind linear dynamic / Gaussian systems", "Understand the mathematical properties of nonlinear dynamic / power-law systems", "Be able to abstract / generalize the impacts and implications of nonlinear systems", "Be able to draw connections between macroscopic socio-environmental systems", "Mathematics and Modeling", "The Science of the Physical World", "3. Earth Monitoring and Inverse Systems", "An Introduction to Complex Systems (2nd ed) Springer Verlag, 2021 Yes $0", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 84, "course_code": "SYDE 542", "course_name": "SYDE542 - Interface Design (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Interface Design Winter 2025", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "Email: c2murad@uwaterloo.ca", "Wendy Ding", "Email: wendy.ding@uwaterloo.ca", "Email: s2marash@uwaterloo.ca", "This course focuses on the design of computer interfaces for simple to complex systems.", "Main topics include forms of visual display; auditory display and soft controls; context, navigation, and layout; development techniques; design for engagement.", "The intent of this course is to give you hands-on experience with some of the current popular techniques, design and research issues in user interface design.", "The emphasis is on learning a systematic design process, advanced knowledge elicitation techniques, and objective evaluation techniques and demonstrating competency in these areas.", "Learn the foundations of how humans interact with technology and how technology supports human-to-human communication", "Learn what makes interactive systems user-friendly", "Learn about designing digital technologies that mediate human communications", "Learn about evaluating interactive systems", "Demonstrate competency in Interface Design methods such as User Observations, Surveying/Interviewing, Data Analysis, Wireframing, Storyboarding, Prototyping, User Requirements Elicitation Techniques, User Modeling Techniques (Personas, Task Analysis), User Testing", "Jan 6                              Introduction", "Jan 13 User Observations & Affinity Diagramming", "A1: Observation and Ideation [", "Jan 20 Design Principles", "Feb 3 User Requirements & Design Recommendations", "Feb 10 Design of Interfaces; Ethics A3: Preliminary user observations, requirement gathering, design proposal", "Feb 25 Concepts of Visual Design", "First low-fi prototype, heuristic evaluation, and functionality freeze", "Interaction Design: Beyond Human - Computer Interaction (3rd, 4th, or 5th edition) (Yvonne Rogers, Helen Sharp, Jenny Preece) No $73", "Almost every week there will be time reserved for in-depth discussions, student presentations, development/design activities, design critiques, and studio-based participation and user trials.", "Attendance and presentation of designs for critique during the practical is expected.", "Teams are required to share workloads equally and fairly – their contributions will be marked both individually and as a team.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 85, "course_code": "SYDE 543", "course_name": "SYDE543 - Cognitive Ergonomics (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Piazza will be the main platform for Q&A. In case you need to contact the teaching team, make sure to add SYDE 543 to the beginning of the subject line.", "This course focuses on the role engineering psychology research plays in design of the information displays and devices associated with simple and complex cognitive tasks.", "Remember and comprehend important cognitive ergonomic concepts, theories, and principles", "Analyze human information processing constraints and limitations, and use it to identify cognitive ergonomics issues in systems design", "Apply cognitive ergonomics knowledge to produce improved designs considering human cognitive constraints", "Course Introduction", "Human-computer Communication", "Human Errors", "Senses", "Attention and Learning", "Control", "Empirical Evaluation", "Research Methods in Cognitive Ergonomics", "Decision Making", "Decision making and biases", "Working Memory", "Memory and Training", "Situation Awareness", "March 25,28", "Case study presentation", "Case study presentation", "Foundations for designing user-centered systems: What system designers need to know about people.", "Santa Barbara CA: Aegean Publishing Company No 120", "Alternatively, one of the team members can send the email and cc all the other team members.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "You will be clearly directed whether you are allowed to use these methods for each assignment."]}, {"course_id": 86, "course_code": "SYDE 548", "course_name": "SYDE548 - User Centred Design Methods (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["User Centred Design Methods Winter 2025", "UCD Mentors Pronouns Email Office Extra Help", "This course approaches the design of tasks, tools, products, and systems from a user-centered design perspective.", "Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process.", "Major topics include user research methods for usability and user experience, inspection methods, user testing, applied statistical analysis.", "SYDE 548 (UCD Methods) approaches the design of tasks, tools, products, and systems from a user-centered design perspective.", "Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process.", "Major topics include user research methods for usability and user experience, inspection methods, user testing, and applied statistical analysis.", "SYDE 548 User-Centred Design Methods is a technical elective.", "It builds from earlier SYDE core courses in design (SYDE-BME 161 Introduction to Design, SYDE-BME 162 Human Factors in Design, and SYDE-BME 361 Engineering Design).", "Motivated students willing to become familiar with basic human factors engineering can participate and contribute to course activities.", "Whether you are interested in becoming a UCD specialist, a certified ergonomist, or just want to be a wise designer or consumer, this course will supply you with a range of practical tools (methods).", "Our “In-class” sessions are used as workshops for interactions and hands-on skill development with different UR methods.", "Engineering Graduate Attribute]", "(A) Describe ethical UCD methods used for formal and informal design assessments with human participants.", "(B) Investigate & select appropriate ethical & equitable UCD methods for specific design situations.[2a, 3b, 10b]", "(C) Apply UCD method protocols to instructor-defined design situations.", "(D) Modify UCD method protocols to collect data for a student-defined design project.", "(E) Select and apply appropriate statistical analysis for given UCD data.", "(F) Design ethical UCD test plans for instructor-defined design situations.", "(G) Create User Research Portfolios describing ethical UCD methods, protocols, and lessons learned.", "CEAB Engineering Graduate Attribute", "Knowledge Base for Engineering", "2. Problem Analysis", "Data Analysis Quizzes,", "4. Design", "-", "Impact of Engineering on Society and the Environment", "Ethics & Equity", "Economics & Project Management", "-", "2. Situations of Concern, Design Impacts & Personas Quantifying Usability; Standard UX Questionnaires;", "SUS Scoring (standard and positive versions)", "3. Design Ethnography: UR Safaris & Secondary Research.", "Interviews & Distress Protocols.", "5. Thematic Analysis Methods - Part 1 Thematic Analysis Methods - Part 2", "Formative Design Walkthroughs & Estimating Formative Sample Sizes.", "UR Methods & GenAI Revisited.", "Quantifying the User Experience: Practical statistics for user research.", "An e-copy of the 1st edition can be accessed through UW Library Reserves.", "The User Experience Team of One: A Research and Design Survival Guide. 2nd edition.", "Hanington, B. & Martin, B (2019) Universal Methods of Design (Expanded & Revised): 125 Ways to research complex problems, develop innovative ideas, and design effective solutions.", "An e-copy of the 1st edition can be accessed through UW Library Reserves No", "Design Materials (for workshops, data collection, and analysis).", "The number of students who can access an e-copy at a given time may be limited.", "Since user-centred design and user research skills are valued by industry, it is important that each student submits original work and demonstrates their own value-added UR skills to earn credit for the course.", "Intellectual property includes items such as:"]}, {"course_id": 87, "course_code": "SYDE 552", "course_name": "SYDE552 - Computational Neuroscience (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["SYDE 552 / BIOL 487 - Computational Neuroscience Winter 2025", "04:30PM - 05:20PM E7 4417", "Instructors Email Meeting Times", "TA Email Meeting Times", "Introduction to modelling and analysis of neurophysiological systems.", "Prerequisites: At least 3B Systems Design Engineering OR at least 3B in the Faculty of Science and one of CS (115, 135, 200) and a 200-level STAT course.", "Course Objectives: There are far more topics in computational neuroscience than can be covered in a single course.", "Throughout the course, we will emphasize the relationship between computational models and biological structure.", "Simulate and manipulate a variety of neuron models, from LIF to Hodgkin-Huxley", "Describe the organization of the primate visual system and compare it to convolutional networks", "Describe the organization of the hippocampus and its role in cognition", "Describe the organization of the basal ganglia and compare it to modern reinforcement learning techniques", "It should be noted that the last hour of the Wednesday session is meant to be a Tutorial, which will be run mostly as a free-form discussion about the topics brought up in the course materials", "Introduction", "Neuron Models", "3. Simple Neuron Models", "Synapses", "Perceptrons and Regression", "Intermediate and High-level Visual Processing", "Backpropagation and Convolutional Neural Networks", "Role in Cognition", "Modelling memory", "Modelling spatial navigation", "Role in Cognition", "Models of BG - Functional", "Models of BG - Anatomical", "Ongoing Research Topics", "• Biophysics of Drugs and Disorders (?)", "MIT Press https://www.deeplearningbook.org/", "Late work may be submitted via email for reduced credit."]}, {"course_id": 89, "course_code": "SYDE 556", "course_name": "SYDE556 - Simulating Neurobiological Systems (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Simulating Neurobiological Systems Fall 2024", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "This course develops and applies a general framework for understanding neural computation in the context of recent advances in theoretical and experimental neuroscience.", "Demonstrate a basic understanding of neural processes, neural mechanisms, theories of neural communication and computation, and theories of neural dynamics.", "Converse at a fundamental level with neuroscientists, psychologists, and neural and cogitive modelers.", "Design and Analyze simple and complex neural circuits for performing small- and large-scale neural computations.", "Apply engineering methods in signal processing, optimization, and control theory, among others, to characterizing and building neural circuits.", "Identify problems and solutions that may exploit the advantages of neural computation in an engineering context.", "Abbreviations", "KB - Knowledge base", "1b: Demonstrate understanding of concepts in natural science", "1c: Demonstrate understanding of engineering fundamentals", "1d: Demonstrate understanding of specialized engineering knowledge", "I - Investigation", "3b: Gather information from relevant sources to address complex engineering problems", "D - Design", "Critically evaluate and compare design choices", "Generate and refine potential solutions to complex, open-ended design problems", "UET - Use of Engineering Tools", "5a Select appropriate engineering tools, considering their limitations", "Sept 25 Chapter 5,6 Feedforward Transformations (I) #2 posted", "5 Sept 30 Chapters 5,6 Feedforward Transformations (II) #1 DUE*", "8 Oct 21 see notes Temporal Basis Functions #2 DUE*", "Neural Engineering: Representation, Computationa and Dynamics in Neurobiological Systems.", "On reserve in Library Yes", "Accommodation for Students with Disabilities", "Intellectual property includes items such as:", "of Waterloo for permission before uploading and sharing the intellectual property of others online(e.g., to an online repository).", "In many cases, instructors might be happy"]}, {"course_id": 90, "course_code": "SYDE 572", "course_name": "SYDE572 - Introduction to Pattern Recognition (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Pattern Recognition Fall 2024", "Pattern features as components in a random vector representation.", "Applications; optical character recognition, speech recognition, industrial robot vision, medical diagnosis, remote sensing and satellite image analysis, fault detection and diagnosis in complex systems such as nuclear reactors.", "Understand the principles of fundamental pattern recognition concepts such as classification, feature extraction and selection, deep learning, etc.", "2. Apply learnt techniques and algorithms in assignments using Python", "3. Understand and contextualize the learnt concepts in applications of pattern recognition to science, engineering, and industry", "4. Design a pattern recognition system provided a task and a set of data.", "Problem Analysis", "Introduction, Pattern Recognition Problem Definition", "Parametric and Nonparametric Distance-Based Classification", "KNN and distance-based classification", "Parametric and Nonparametric Density Estimation", "Discriminant Functions", "Gaussian mixture models", "Parametric and Nonparametric Clustering", "Expectation Maximization", "Linear and nonlinear regression", "Ensemble classification", "Advanced topics", "An Introduction to Statistical Learning, James, Witten, Hastie, Tibshirani, 2nd Ed.", "Introduction to Machine Learning, Alpaydin.", "Dive into Deep Learning", "Various usefullinks and advisorcontact information can be foundhere:"]}, {"course_id": 91, "course_code": "SYDE 575", "course_name": "SYDE575 - Image Processing (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Image Processing Fall 2024", "10:00AM - 11:20AM EV3 4408", "10:00AM - 11:20AM E5 6008", "Beginning with a discussion of quantitative models of imaging systems, this course moves on to apply methods of linear systems theory and signal processing to image processing.", "Simple spatial domain techniques as well as spatial frequency domain methods, and digital filter design for image enhancement and restoration are discussed.", "Applications to machine vision, remote sensing, and medical imaging will be emphasized.", "Apply basic image processing algorithms and tools to digital imagery (2)", "2. Utilize Matlab effectively for fundamental image processing applications (5)", "Understand mathematics for image processing based on signal processing concepts (1)", "4. Develop a basic understanding of the human visual system and its relationships to digital image processing (1)", "Understand the nature of spatial-frequency domain in the context of digital image processing (2)", "Work in a team to complete applied lab design based solutions to problems and prepare a technical report responding to clear instructions (4, 7)", "7. Demonstrate an enhanced understanding of linear systems with application to image processing (1)", "Graduate Attribute Definition", "Knowledge Base Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "2. Problem Analysis An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "7. Communication Skills An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "10-15 Spatial-frequency filter 2,3,4,5,6,7", "18 Color image processing 4,6", "The grade of each lab will be reduced by 20% for each full/partial day late submission.", "I make a sincere effort to provide a course to benefit students and I hope students make the same effort in return for their own positive experience.", "Prof. Clausi"]}, {"course_id": 92, "course_code": "SYDE 577", "course_name": "SYDE577 - Deep Learning (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:30AM - 12:20PM", "10:30AM - 11:20AM E7 4433", "11:30AM - 12:20PM E7 4433", "Introduction to deep learning.", "Regression and classification; backpropagation; convolutional and recurrent networks; optimization and regularization of deep networks; transformers; recent developments in the field.", "Explain the rationale for various network properties and deep learning algorithms.", "Derive equations and write software implementations for some important computations in deep learning, such as backpropagation and stochastic gradient descent.", "Discuss the state of the art in deep learning and recommend effective deep-network architectures for a variety of problems.", "Program-level outcome mapping", "1 Key concepts in deep learning", "2 Linear regression and classification", "11 Transformers in language and vision", "Students should give a ~15-minute presentations in groups of 4-5.", "Students should undertake the project in groups of 4-5."]}, {"course_id": 94, "course_code": "SYDE 599", "course_name": "SYDE599 - Special Topics in Systems Design Engineering (0.50)", "term_name": "Technical Electives List", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 2, "major_name": "Biomedical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Planning for Design of a Sustainable Hospital System Winter 2025", "04:30PM - 05:20PM", "E5 6111", "lisa.aultman-hall@uwaterloo.ca", "This course deals with selected topics at the undergraduate level in environmental and societal systems, mechatronics and physical systems, or human factors and ergonomics.", "Three frameworks or tools ground the course in systems design engineering:", "systems thinking (with mapping); and", "access and transportation;", "green energy; or", "Co-laboratory definitions of sustainability and hospital systems;", "Summaries and reviews of hospital sustainability literature;", "Short design reports of alternative hospital site designs; and", "Identify and conceptualize the role of a hospital system in a community and region.", "Appreciate the complexity of defining sustainability for a hospital, a complex social technical system.", "Clearly define the hospital site as a design problem with a sustainability-based objective.", "Identify multiple conceptual design alternatives for the Waterloo hospital site and evaluate the extent to which each meets sustainability goals and objectives using metrics.", "Use systems thinking to frame a complex problem and communicate the elements of a system using mapping.", "Work effectively in a collaborative team environment by co-developing definitions, documents, and system representations of a complex system.", "29-Jan 4 ESG Metrics - Dr. Jen Boger Co-lab #2: Hospital Systems Diagram", "03-Feb 5 Circular Engineering - Dr. Carl Haas Sustainability in Structures - Dr. Cory Zurell", "05-Feb 5 Site Selection and Regional Planning - Mike Murray  Tutorial: Life Cycle Analysis", "10-Feb 6 More on Life Cycle Analysis  Sustainable Energy Systems", "24-Feb 7  Hospital Mechanical Systems Systems Design Methods", "26-Feb 7  Hospital Waste Tutorial: Systems Design Methods", "03-Mar 8 Site Design and Water - Hospital Water Uses Co-Lab #3: Site System Mapping", "12-Mar 9 Co-Lab #4 - Design Alternative Generation", "26-Mar 11 Tour about Art and Nature in a Hospital System", "We will work together on a real-world problem to learn, think critically and design alternative solutions for which real-world stakeholders want our input.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 1, "course_code": "KIN 255", "course_name": "KIN255 - Fundamentals of Neuroscience (0.50)", "term_name": "Required Courses", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 5, "major_name": "Neural Engineering Specialization", "topics": ["Notice of Recording", "KIN 255", "KIN 255 001", "08:30AM - 09:20AM", "KIN 255:", "An introduction to the principles of the nervous system control of movement, cognition, and learning.", "The course will introduce the basic structure and function of the nervous system as it relates to understanding the control of movement and behaviour.", "View requirements for KIN 255", "Define key terminology related to human neuroscience and neural control of movement.", "2. Explain fundamental concepts associated with control of movement from molecular, cellular, systems and behavioural levels.", "3. Explain fundamental relationships between sensory/cognitive processing and motor control in the typically functioning nervous system.", "4. Discuss key methods and approaches used in modern neuroscience to assess neural function and the brain-behaviour relationship.", "Week 1  (Sept 4-6) Introduction to the nervous system; Neuroanatomy", "Week 2 (Sept 9-13) Sensory systems - Receptors and Pathways", "No Class – Monday, October 7; Quiz 2 - October 9; Voluntary movements & motor programs", "On-campus exams end December 20, 2024", "Quizzes may consist of a combination of multiple choice, true/false, fill in-the-blank, matching and ordering questions.", "The midterm may consist of multiple choice, true/false, fill-in-the-blank, matching, ordering questions and written responses.", "The final may consist of multiple choice, true/false, fill-in-the-blank, matching, ordering questions and written responses.", "Notice of Recording", "In rare circumstances, it may be possible for students to attend lectures virtually to accommodate a specific request (e.g., prolonged self-isolation).", "Requests for virtual attendance will only be considered on a case-by-case basis and may not be granted if appropriate recording equipment is not available – ie the lecture hall does not have recording equipment available for us to stream lectures.", "The resource is intended as a contingency in case of a switch to remote learning.", "Please inform the instructor if you must miss multiple lectures due to self-isolation.", "You may experience stressors that can impact your personal well-being and academic experience, but there are multiple supports and resources available to you on and off-campus.", "Office of Indigenous Relations                      Office of Equity, Diversity, Inclusion and Anti-racism", "Only one short-term absence can be self-declared per academic term.", "Students can self-declare one Covid-19-related absence in an academic term.", "Academic Regulations and Accommodations", "Death of a family member: a copy of the death certificate, a copy of the obituary or a link to the online obituary.", "Co-op Interviews"]}, {"course_id": 2, "course_code": "KIN 301", "course_name": "KIN301 - Human Anatomy of the Central Nervous System (0.50)", "term_name": "Required Courses", "program_name": "Biomedical Engineering", "program_id": 16, "major_id": 5, "major_name": "Neural Engineering Specialization", "topics": ["Notice of Recording", "Human Anatomy of the Central Nervous System Fall 2024", "KIN 301", "KIN 301 001", "11:30AM - 12:20PM", "KIN 301 101 [", "jeremy.roth@uwaterloo.ca", "KIN 301 102", "jeremy.roth@uwaterloo.ca", "KIN 301 103 [", "08:30AM - 10:20AM EXP 3683", "jeremy.roth@uwaterloo.ca", "KIN 301:", "Major functional systems, including somatosensory and motor pathways, special sense pathways, and integrative systems of the brain, will be examined through an understanding of anatomical connectivity.", "View requirements for KIN 301", "Identify the location of structures and pathways of the central nervous system (CNS) in cross-sectional specimens and images of the CNS.", "2. Illustrate the structural organization of sensory, motor and integrative systems of the CNS.", "The study of human neuroanatomy can be viewed as a travel-log; it is the study of the geography, language and culture or function of different regions of the central nervous system (CNS).", "Similar to the division of a continent into countries, provinces, regions and cities, the central nervous system is divided and subdivided into different regions that have specialized sensory, motor, cognitive and emotional functions.", "Overview of the Structural and Functional Organization of the CNS.", "Module 1 will present a general orientation to the structural and functional organization of the central nervous system (CNS), with a focus on the cerebral cortex.", "Each of these regions has specialized functions, which depend on their internal circuitry and connections to other regions of the CNS.", "Specialized functions of different regions of the CNS can be revealed by behavioural disorders resulting from a disruption of blood supply to a region.", "2. Knowing and Moving our Bodies: Organization of Somatic Sensory and Motor Systems", "Module 2 will explore the organization of the somatic sensory and motor systems.", "These sensations allow us to know the relative orientation and movements of our body parts (body schema) and to explore properties of objects that we contact.", "These sensory systems allow us to experience the external world and guide our movements as we interact with the external world.", "4. Integrative Systems of the Brain", "Module 4 will explore integrative systems of the brain: the cerebral cortex, basal ganglia and limbic system.", "These regions serve important functions of problem solving, storing memories, regulating emotions and automating movement.", "Lectures will be devoted to: providing context and relevance for each module, directing your attention to important facts and concepts in assigned readings, developing strategies for self-study outside of lectures and labs and analyzing the neuroanatomical basis of normal and abnormal experiences and behaviour using case studies.", "Labs will be devoted to building a map of the central nervous system by identifying the location of structures in specimens and images of cross sections of the central nervous system.", "If you prefer, there is a Kahoot app available for iOS and Android devices.", "Lab 1: Introduction to the CNS", "Autonomic Nervous System", "Lab 6: Auditory and Vestibular Systems", "On-campus exams end December 20, 2024", "Clean, white lab coat A rental can be provided by the School of Anatomy for a $7.50 fee.", "Lab Exams: will evaluate your ability to identify structures presented on embalmed cadaveric specimens, plastic models and images of cross sections of the central nervous system.", "Examinations", "School of Anatomy lab coats can be rented for the term for $7.50.", "Notice of Recording", "In rare circumstances, it may be possible for students to attend lectures virtually to accommodate a specific request (e.g., prolonged self-isolation).", "Requests for virtual attendance will only be considered on a case-by-case basis and may not be granted if appropriate recording equipment is not available – the lecture hall does not have recording equipment available for us to stream lectures.", "The resource is intended as a contingency in case of a switch to remote learning.", "Please inform the instructor if you must miss multiple lectures due to self-isolation.", "You may experience stressors that can impact your personal well-being and academic experience, but there are multiple supports and resources available to you on and off-campus.", "Office of Indigenous Relations                      Office of Equity, Diversity, Inclusion and Anti-racism", "Only one short-term absence can be self-declared per academic term.", "Students can self-declare one Covid-19-related absence in an academic term.", "Academic Regulations and Accommodations", "Death of a family member: a copy of the death certificate, a copy of the obituary or a link to the online obituary.", "Co-op Interviews"]}]