[{"course_id": 15, "course_code": "SYDE 261", "course_name": "SYDE261 - Design, Systems, and Society (0.50)", "term_name": "2A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Design, Systems, and Society Winter 2025", "11:00AM - 11:50AM E5 6006", "Sormeh Mehri - s2mehri@uwaterloo.ca", "This impact course focuses on identifying, understanding, and analyzing the interactions and impacts among technology, society and the environment for current and emerging technologies using theoretical and evidence-based analyses.", "Connections among systems of systems engineering, impact analyses, evidence-based analyses, needs assessment, the design process, advocacy, and professional engineering will be discussed and applied.", "research and analyze a complex systems problem for social, environmental, and economic considerations.", "4a) Identify needs, design requirements, constraints and specifications for complex, open-ended engineering problems (I)", "7a) Generate appropriate documentation to communicate within the profession and to society at large (D)", "10b) Identify how an engineer is accountable to multiple stakeholders in engineering practice (D)", "Thinking in Systems - Donella Meadows Optional No $32.95", "Climate Impact Analysis - due 8pm, March 14th, 2025 on LEARN 20% Individual", "• No extensions will be given after a submission date.", "Extensions will only be given for very serious issues and the formal VIF/Quest system should be used to document and file for these.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as design, systems analysis and written communication.", "Library for research-based assignments"]}, {"course_id": 16, "course_code": "SYDE 263", "course_name": "SYDE263 - Engineering Prototyping (0.25)", "term_name": "2A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["-", "-", "-", "Matt Robichaud - matt.robichaud@uwaterloo.ca", "This course addresses the practical aspects of design and technical communication.", "By using a series of workshops culminating in a comprehensive final project, students gain the hands-on experience necessary for prototyping and design validation.", "Topics include generating technical specifications, material selection, fastener basics, motor selection, electronic switching, reading data sheets and schematics, and advanced microcontroller implementation.", "Use tools to fabricate basic mechanical and electrical assemblies from raw materials (5C)", "2. Validate the function of electronic circuits via breadboarding (5C)", "Interface a microcontroller with digital and analog inputs and outputs (1D)", "4. Identify and use resources to explore and troubleshoot prototype systems (12A)", "1D Demonstrate understanding of specialized engineering knowledge", "Economics and Project Management", "12A Identify gaps in their knowledge skills and abilities", "Laptop with USB A port Required in lab for Arduino programming Yes From Previous Coursework", "Lab Practice and Safety Assessed each week in lab, 1 mark per week, must achieve 7/12", "Class Participation/Discussion Discussion prompt provided in each lecture, must complete 4/6", "Authorized Aids", "You will be using your computer for programming microcontrollers (via  Arduino IDE 1.8.X and a USB type A port) and preparing CAD drawings (via Solidworks 2023/4) along with other general computing tasks.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 17, "course_code": "SYDE 283", "course_name": "SYDE283 - Physics 3: Electricity, Magnetism and Optics (0.50)", "term_name": "2A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 10:50AM E5 6006", "09:00AM - 09:50AM E5 6006", "Email: m3mohit@uwaterloo.ca", "Email: yshabeer@uwaterloo.ca", "Introduction to the fundamental laws of electricity, magnetism, and optics; electric fields, voltage, resistance, current, properties of conductors and semiconductors, capacitance, properties of dielectrics, magnetic fields, Faraday's Law and inductance, properties of magnetic materials; electromagnetic waves and the nature of light, geometrical optics; reflection and refraction, physical optics; interference and diffraction.", "Understand key concepts and fundamental laws related to electricity, magnetism, and optics (1b)", "2. Apply these fundamental laws towards solving problems in electricity, magnetism, and optics (2b)", "3. Articulate the interrelationship between charges, fields, magnetism, and electromagnetic waves, and how these impact systems.", "Employ basic scripting and physical simulation software to solve electromagnetic problems (5c)", "Research specific topics of interest to dig deeper and articulate findings through a short report or presentation (3a, 3c)", "Knowledge Base - Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "Problem Analysis - An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "Investigation - An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "Design - An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, and economic, environmental, cultural and societal considerations.", "Communication Skills - An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Professionalism - An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Impact of Engineering - An ability to analyze social and environmental aspects of engineering activities.", "Such ability includes an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society, the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Lifelong Learning - An ability to identify and to address their own educational needs in a changing world in ways sufficient to maintain their competence and to allow them to contribute to the advancement of knowledge.", "None Course Introduction – The World of EMO & Math Review  None LO3", "Discussion of Electric Forces and Fields,", "Clarification of current topics", "Clarification of current topics", "Discussion of Electric Potential and Voltage,", "Install MATLAB", "Clarification of current topics", "Discussion of Current and Circuit Basics,", "Discussion of Magnetic Forces and Fields", "Clarification of current topics", "Discussion of Magnetic Sources", "Clarification of current topics", "PA5 – Magnetostatics in MATLAB", "Discussion of Electromagnetic Induction", "Clarification of current topics", "Discussion of Electromagnetic Waves OR Maxwell’s Equations for Time-varying Fields", "Discussion of AC Circuits", "Clarification of current topics", "Discussion of Geometric Optics", "Clarification of current topics", "PA7 - Poynting Vector and Mode Propagation", "Discussion Photonics Basics"]}, {"course_id": 18, "course_code": "SYDE 285", "course_name": "SYDE285 - Materials Chemistry (0.50)", "term_name": "2A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["09:00AM - 10:50AM E5 6006", "10:00AM - 10:50AM E5 6006", "09:00AM - 09:50AM E5 6006", "Email: rroufail@uwaterloo.ca", "Office Hours: Monday 02:00 pm - 03:00 pm; Open door policy & upon request.", "Email: ahajiahm@uwaterloo.ca", "Email: alireza.ahmadi@uwaterloo.ca", "Concepts such as chemical bonding, crystal structure, phase diagram, redox reaction, and electrochemistry will be introduced in the context of materials science.", " Describe chemical, crystal structure and bond types of metals, polymers, and ceramics.", " Explain defects in material crystal structure.", " Select material & mechanical property assessment to guarantee material performance in service.", "Demonstrate understanding of concepts in natural science", "Demonstrate understanding of engineering fundamentals", "Investigation", "Gather information from relevant sources2 to address complex engineering problems", "3c", "Synthesize information from multiple sources to reach valid conclusions", "6a", "Reading Textbook Chapters", "Monday, Jan 06 Introduction to Materials Ch 1", "Monday, Jan 13 Mechanical Properties & Types of Failure Ch 6, 8", "Wednesday, Jan 15 Atomic Structure & Crystal Structure Ch 2, 3", "Monday, Jan 27 Imperfection in solids Ch 4", "Wednesday, Jan 29 Introduction to FEA and chair testing ---", "Monday, Feb 10 Material Selection Approach Slides", "9:00 am – 10:30 am at E5-6004 & E5-6006", "Wednesday, Mar 12 Project Presentation / Corrosion & Degradation!", "Monday, Jan 20 Sunday, Jan 26 Introduction to Materials, Mechanical Properties & Failure", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm and those who support others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 19, "course_code": "SYDE 212", "course_name": "SYDE212 - Probability and Statistics (0.50)", "term_name": "2B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Probability and Statistics Fall 2024", "11:30AM - 12:20PM E7 4433", "09:30AM - 11:20AM RCH 211", "11:30AM - 12:20PM E7 4433", "Mengqi Xu", "Analysis of experimental measurements.", "\"This course deals with the understanding and application of probability and statistical principles so that we may further our knowledge of any given area of interest through the appropriate collection and analysis of data in the presence of uncertainty and random variation.", "Focus will be more on the concepts and logic of statistics and the statistical method than on rote application of learned algorithms and ‘formulas’ (e.g. more on the ‘what’ and ‘why’ than on the ‘how’ of our calculations).", "(a) summarize and identify important characteristics of a dataset using graphical and numerical methods (1)", "(c) explain the concept and logic of statistical inference in terms of a parameter, a statistic, a population, a sample, and a probability distribution of a random variable (1)", "(d) explain the concept of and conduct/create a hypothesis test and confidence interval for a parameter of interest, and interpret the results in the context of the study (1, 2)", "(f) devise and implement a statistical study to answer questions about a population of interest (2, 3)", "The numbers that appear in parentheses at the end of each learning outcome refer to the so-called \"graduate attributes\" set by the Canadian Engineering Accreditation Board (CEAB); see https://uwaterloo.ca/engineering/graduate-attributes.", "*", "6 Midterm week: one close-book midterm examination to be scheduled.", "10 Applications: two-sample comparison and basics of experimental design; analysis of categorical data.", "*", "Electronic versions of both the text itself and the exercise manual will be available for download free of charge within learn.uwaterloo.ca.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 20, "course_code": "SYDE 252", "course_name": "SYDE252 - Linear Systems and Signals (0.50)", "term_name": "2B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Linear Systems and Signals Fall 2024", "04:30PM - 05:20PM", "Email: nmaftoon@uwaterloo.ca", "Models and analysis of linear systems.", "Discrete time systems, continuous time systems; difference and differential equations; impulse and frequency response.", "Complex frequency, functions of complex variables, transform domain techniques: Z transforms; Fourier analysis, Laplace transform.", "Transfer functions and frequency response, frequency domain analysis of linear systems; sampling theory, stability, and linear filters.", "Through these interactions we can identify systems, manipulate them or design systems that help us in one way or another.", "Sometimes we do this the other way around: we are interested in a signal (e.g., a clinical image) and we design a system to give us the useful signal to extract specific useful information.", "Perform time domain and frequency domain analysis of continuous-time and discrete- time signals and systems using convolution, Laplace transform, z-transform and Fourier analysis [", "Design filters and perform signal processing and filtering [", "Numbers in brackets refer to their Associated C.E.A.B Graduate attributes", "Week of", "----", "----", "----", "MID-TERM WEEK", "3rd Edition", "2nd Edition", "Week of", "Book sections to read", "Book sections to skim", "Book sections to read", "Book sections to skim", "Convolution sum & Convolution integral 3.8; 2.4;   3.8; 2.4", "MID-TERM WEEK", "Lathi & Green, Linear Systems and Signals, 3rd edition, Oxford University Press (or its 2nd edition)", "Matlab Access", "Remote access:https://uwaterloo.ca/engineering-computing/remote-desktop-connection", "Each of these assignments may include analytical, numerical (using Matlab, or a language of your choice) and explanatory components exploring fundamental aspects of the material covered in the course.", "Students will work in teams of 4 to create a signal-processing program for cochlear implants.", "Late project submission rules", "If your team misses a phase submission deadline, your team can still submit the deliverables of the phase for a maximum half of the grade for that phase.", "This course includes the independent development and practice of specific skills, such as system design, filter design and signal processing.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 21, "course_code": "SYDE 262", "course_name": "SYDE262 - Engineering Economics of Design (0.50)", "term_name": "2B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Engineering Economics of Design Fall 2024", "jessie.ma@uwaterloo.ca", "11:30AM - 12:20PM E7 4433", "jessie.ma@uwaterloo.ca", "Jessie Ma | jessie.ma@uwaterloo.ca | E7-6304", "Topics include microeconomics, supply, demand and external costs in the context of systems design.", "Evaluate and compare alternatives for an engineering firm's financial decisions (GA 11a, 11b)", "Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)", "Create a business plan for an engineering firm, accounting for uncertainty in economic and environmental aspects (GA 9a, 9b)", "Identify external costs in the context of systems design, including the use of sustainability indicators (GA 9a, 9b)", "1 Sep 2 Introduction Introduction", "3 Sep 16   Decision Making - Cash Flow Series Patters Assignment 1 posted Evaluate and compare alternatives for an engineering firm's financial decisions (GA 11a, 11b) Excel", "4 Sep 23   Decision Making 2 - Basic Evaluation Methods   Evaluate and compare alternatives for an engineering firm's financial decisions (GA 11a, 11b) Excel", "5 Sep 30   Decision Making 3 - Analysis Period & Project Lives; Risk Analysis Assignment 1 due Oct 4 Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)  Excel", "6 Oct 7 2. Context - Looking Outside Entrepreneurship   Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)", "9 Oct 28   Intrapreneurship; Evaluation of Complex Projects (Replacement Analysis, Life Cycle Costs, Benefit-Cost Analysis) Group Project posted Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)", "Identify external costs in the context of systems design, including the us of sustainability indicators (GA 9a, 9b)", "Identify external costs in the context of systems design, including the us of sustainability indicators (GA 9a, 9b)", "12 Nov 18   Business Plans; Markets   Create a business plan for an engineering firm, accounting for uncertainty in economic and environmental aspects (GA 9a, 9b) Excel", "Notice of Recording", "Sign your email with your first and last name and your student number.", "There could be a need to make alternate arrangements for in-person course activities.", "This alternate arrangement could be for a short period of time (e.g., one week) or a more sustained disruption to in-person course activities.", "Impacted in-person deliverables will be handled on a case-by-case basis with notification provided as soon as possible (see COVID-19-Related Absences and Short-Term Absences below).", "They will review your case and coordinate a reasonable and fair plan in consultation with appropriate others.", "Laptops, Tablets, and Electronic Devices", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.", "A.A.S. also offers learning strategy supports to all students that can be accessed through:", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 22, "course_code": "SYDE 286", "course_name": "SYDE286 - Mechanics of Deformable Solids (0.50)", "term_name": "2B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Mechanics of Deformable Solids Fall 2024", "Email: rroufail@uwaterloo.ca", "Email: ahajiahm@uwaterloo.ca", "Email: alireza.ahmadi@uwaterloo.ca", "Introduction to mechanical response of materials and stress-strain relationship.", "Behaviour of prismatic members in tension, compression, shear, bending and torsion.", "Shear-force and bending-moment diagrams.", "Introduction to instability.", "The Tutorial time slot in the same week will be a lecture in E7-4433.", "Understand fundamental concepts of material deformation and behavior under mechanical stresses.", "Construct free body diagram of complex structures and drive governing equations.", "Reading Textbook Chapters", "Introduction and stress analysis", "Wed., Sept 18 Design of MOD", "Mon., Oct 07 Shear and moments in the beam", "See below for options Yes", "A fraction of the day i.e. hour(s) after the deadline of submission counts as a day.", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows the University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 23, "course_code": "SYDE 292", "course_name": "SYDE292 - Circuits, Instrumentation, and Measurements (0.50)", "term_name": "2B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["11:30AM -", "RCH 211", "Active and passive circuit elements, Kirchhoff's laws, mesh and nodal circuit analysis, principle of superposition; step response of first and second order networks; sinusoidal steady state analysis using complex impedance phasors; input-output relationships, transfer functions and frequency response of linear systems; operational amplifiers, operational amplifier circuits using negative or positive feedback; diodes, operational amplifier circuits using diodes; analog signal detection, conditioning and conversion systems; transducers, difference and instrumentation amplifiers, active filters, A/D and D/A conversion.", "The specific objectives of these courses are to develop an understanding of:", "- voltage and current supplies, resistors, capacitors, inductors and diodes;", "- techniques for analyzing simple circuits when driven by direct or alternating power sources;", "- important basic circuit concepts such as transfer functions, loading effects and frequency response;", "- operational amplifiers and circuits using operational amplifiers;", "- filters, transducers, pulse width modulation;", "- the concept of a measurement channel and", "3. Sign your email with your first and last name and your student number.", "Apply knowledge of basic circuit components and their interactions, (Attributes: 1a,1c)", "Analyze circuits that include fundamental non-linear devices (e.g., BJTs, MOSFETs, diodes).", "Activities & Deliverables", "Fundamentals of Active and Passive Circuit Elements", "Schematics, Sources, and Resistive Circuits", "Kirchhoff’s Current and Voltage Laws", "Kirchhoff’s Current and Voltage Laws Continued", "Circuit Analysis Techniques and Drills", "Circuit Analysis Techniques and Drills Continued", "6 Oct 7 – 11  Capacitors in Time Domain and their Natural and Step Response", "Makeup Lecture: Tuesday October 8 at 4:30-6:20pm in E7 4433", "Inductors in Time Domain and their Natural and Step Response", "Sinusoidal and Phasor Analysis", "Impedance, Transfer Functions, Frequency Response", "Differential and Instrumentational Amplifiers", "Diodes", "Passive Filters", "13  Nov 25 – Nov 29 Active Filters and Conversions", "Makeup Lecture: Tuesday November 26 at 4:30-6:20pm in E7 4433", "Fundamentals of Active and Passive Circuit Elements", "Schematics, Sources, and Resistive Circuits", "Kirchhoff’s Current and Voltage Laws", "Kirchhoff’s Current and Voltage Laws Continued", "Circuit Analysis Techniques and Drills", "Circuit Analysis Techniques and Drills Continued", "6 Capacitors in Time Domain and their Natural and Step Response 1, 2", "Inductors in Time Domain and their Natural and Step Response", "Sinusoidal and Phasor Analysis", "Impedance, Transfer Functions, Frequency Response", "Differential and Instrumentational Amplifiers", "Diodes", "Passive Filters", "13 Active Filters and Conversions"]}, {"course_id": 24, "course_code": "SYDE 292L", "course_name": "SYDE292L - Circuits, Instrumentation, and Measurements Laboratory (0.25)", "term_name": "2B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 11:20AM E5 6005", "08:30AM - 11:20AM E5 6005", "08:30AM - 11:20AM E5 6005", "08:30AM - 11:20AM E5 6005", "Orion Bruckman", "Email:   orion.bruckman@uwaterloo.ca | Office: E7-6402", "Marco Moran-Ledesma: mamoranledesma@uwaterloo.ca", "2. Design Analog Circuits (4a,b,c)", "3. Wire and Debug Analog Circuits (3b)", "4. Design Analog Circuits to solve complex project requirements (1d, 3b,c)", "2 Introduction and Lab 1: DC Equipment 1, 3 DC Power Supply, Digital Multimeter", "E5 - 6005", "E5 - 6005", "E5 - 6005", "E5 - 6005", "Introduction and Lab 1: DC Equipment.", "Thanksgiving & Reading Week: October 14th to 18th", "Remarking Requests: Send a meeting request to the course instructor clearly stating your case to regrade a question.", "Attach supporting evidence for your case including screenshots of the page(s) where the grading is requested.", "Operations Format:", "Submissions", "Turnitin submissions must have a minimum of 20 words and a maximum file size of 20 MB.", "It is strongly suggested that students record pertinent circuit diagrams, instrument & power supply settings, and results in their in-lab section.", "Intellectual property includes items such as:", "There could be a need to make alternate arrangements for in-person course activities.", "This alternate arrangement could be for a short period of time (e.g., one week) or a more sustained disruption to in-person course activities.", "They will review your case and coordinate a reasonable and fair plan in consultation with appropriate others.", "Course and Departmental Expectations", "Compassionate and Respectful Communication:", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "If a co-op interview conflicts with a deliverable then students MUST follow the CECA procedure for rescheduling the interview [", "Compassionate Accommodation:", "Such behaviour includes:"]}, {"course_id": 25, "course_code": "SYDE 312", "course_name": "SYDE312 - Applied Linear Algebra (0.50)", "term_name": "3A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Applied Linear Algebra Winter 2025", "09:00AM - 10:50AM E7 4417", "Email: harish.prakash@uwaterloo.ca", "Desk number: 2008P.", "Email: bbalaji@uwaterloo.ca", "Desk number: 2038H.", "Email: pkayeego@uwaterloo.ca", "Desk number: 2008C.", "Vector spaces, linear independence, linear maps and matrix representations.", "Inner product spaces and orthogonality.", "Interpolation and curve-fitting.", "Eigenvalues and eigenvectors, diagonalization, singular value decomposition.", "Applications and numerical methods.", "Linear algebra, in a nutshell, is the study of linear transformations in a ﬁnite‐dimensional ﬁeld.", "The foundations of human progress is built atop the concepts of LA – from the elements of Newtonian classical mechanics (force, gravity, momentum) to the ‘AI revolution’ today, everything is enwrapped by the beauty of vectors, ﬁnite‐dimensional spaces, and linear transformations.", "In Systems Design Engineering, it is applicable in modelling and simulation, mechatronics, intelligent systems, signal analysis, machine learning, image processing and computer graphics, human factors, ﬁnancial and economic modelling, optimization, software engineering, and so on.", "In this course, you will learn about diﬀerent mathematical concepts such as vector spaces, basis, span, independence, eigen values and vectors, and certain useful techniques like Singular Value Decomposition (SVD) and the Gramm‐Schmidt algorithm.", "The core focus of this course is on applying what you learn – we will pursue both theoretical proofs and learn to practically apply the concepts via Python (our preferred programming language).", "Appreciate the generality of linear algebra concepts by formulating and solving engineering problems in a vector space context.", "Formulate and solve mathematical problems using appropriate linear algebra concepts and techniques.", "Week 1 Introduction - fields, scalar, vectors, vector space, matrix, tensors.", "Linear maps.", "Kernel and Range.", "Vector space sum.", "Matrix representation of linear maps.", "Eigenspaces (Eigen values and Eigen vectors).", "Real symmetric and positive definite matrices.", "Applications (Data compression, under-determined and over-determined systems).", "Linear Algebra and its applications, Pearson, 6th Edition, 2020 e-copy at vitalsource Yes 67.99", "Linear Algebra Done Right by Sheldon Axler.", "Available for free online at: https://linear.axler.net/", "Google Colaboratory Free software for python-based coding available at: https://colab.research.google.com/ Yes 0.00", "The maximum period of extension given will be one week.", "The purpose of this is to test your understanding of concepts taught until then.", "A detailed list of preparation materials – syllabi, model papers, and general tips will be provided to you closer to the date.", "Work on applying LA concepts to a real-life problem set.", "Incentive: Team members from the top three highest-graded projects will each receive a certificate of accomplishment.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 26, "course_code": "SYDE 351", "course_name": "SYDE351 - Systems Models 1 (0.50)", "term_name": "3A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Systems Models 1 Spring 2024", "RCH 301", "03:30PM - 04:20PM E7 4417", "Put SYDE 351 in the email subjectline followed by a briefdescription of the email subject.", "Introduction to systems modelling and analysis.", "Graph theoretic models and formulation of system equations.", "Application to engineering systems.", "Prereq: 3A Systems Design Engineering or (MATH 115 and MTE 202 and level at least 3A Mechatronics Engineering)", "By the end of the course, learn to analyze, implement, and use various circuits techniques in a variety of applications.", "This includes:", "Derive the mathematical equations describing dynamic engineering systems (mechanical, electrical, electromechanical, fluid, and/or thermal), (Attributes: 1c, 2a, 2b)", "Generate state-space models of dynamic engineering systems using newton’s 2nd law and graph theory, (Attributes: 1c, 2a, 2b, 2c)", "Generate block diagrams of dynamic engineering systems, (Attributes: 1c, 2c)", "Perform time domain and frequency domain analysis of dynamic engineering systems (Attributes: 2a, 2b, 2c)", "Use proper engineering tools/software to simulate engineering systems.", "construct meaning from oral, written, and graphic communication through interpreting, exemplifying,", "exams are initially planned to be held in-person.", "Instruction & Assessment:", "What you shouldbe doing each week", "Suggested problem sets & solutions", "Microsoft Teams will be used as online platform:", "Activities & Deliverables", "Topic 1 - Systems Modeling and Solution in Time and Frequency Domain", "Course Introduction", "Modelling of Dynamic Systems", "1.6 & Appendix D", "Laplace Transform & Transfer Function", "First Order Systems Time and Frequency Domains Solution", "Second Order Systems Time and Frequency Domains Solution", "SimulationX Demo for 1st and 2nd Order System Responses", "Topic 2: Mechanical Systems Modeling in Time and Frequency Domain", "Spring Elements", "Lecture Notes & 3.1 3.2, 4.1", "Spring-Mass Systems Solution in Time and Frequency Domain", "Damping Systems in Time and Frequency Domain", "4.2", "4.4", "Mass-Spring-Damper Solutions in the Time and Frequency Domain", "Software Simulations of Mechanical Systems", "State-Variable Models and State Space Formulation Using N2L", "June 24 - 28", "Block Diagrams and State-Space Modeling Using Simulink", "Midterm Exam: Monday June 24 at 4:00pm in E5-6006 and E5-6008 (subjected to change)", "Topic 5: Electrical & Electromechanical Systems Modeling in Time and Frequency Domain", "Electric Elements and Circuits", "Transfer Function and Impendence", "Transfer Function and Impendence continued", "Electromechanical Systems", "Linear Graph Theory", "Systems Equations using Linear Graph Theory Method", "Real-Life Applications on Mechanical and Electrical Systems", "Topic 7: Introduction to Fluid & Thermal Systems (subject to change)", "Fluid Systems", "Thermal Systems", "7.1-7.5 & 7.10.1", "7.6-7.8 & 7.10.2", "Final Exam - TBD", "Topic 1 - Systems Modeling and Solution in Time and Frequency Domain", "Course Introduction", "Modelling of Dynamic Systems", "Laplace Transform & Transfer Function", "First Order Systems Time and Frequency Domains Solution", "Second Order Systems Time and Frequency Domains Solution", "SimulationX Demo for 1st and 2nd Order System Responses", "Topic 2: Mechanical Systems Modeling in Time and Frequency Domain", "Spring Elements", "Spring-Mass Systems Solution in Time and Frequency Domain", "Damping Systems in Time and Frequency Domain", "Mass-Spring-Damper Solutions in the Time and Frequency Domain", "Software Simulations of Mechanical Systems", "State-Variable Models and State Space Formulation Using N2L", "Block Diagrams and State-Space Modeling Using Simulink", "9 Real-life Applications Simulation Using Simscape and SimulationX 6 Simscape, and SimulationX", "Topic 5: Electrical & Electromechanical Systems Modeling in Time and Frequency Domain", "Electric Elements and Circuits", "Transfer Function and Impendence", "Transfer Function and Impendence continued", "Electromechanical Systems", "Linear Graph Theory", "Systems Equations using Linear Graph Theory Method", "Real-Life Applications on Mechanical and Electrical Systems", "Topic 7: Introduction to Fluid & Thermal Systems (subject to change)", "Fluid Systems", "Thermal Systems", "Clarence W. de Silva, Modeling of Dynamic Systems, 2017, Taylor and Francis The electronic book is available for free from the library:  https://www-taylorfrancis- com.proxy.lib.uwaterloo.ca/books/mono/10.1201/9781315154824/modeling-dynamic- systems-engineering-applications-clarence-de-silva Yes", "Shuvra Das, Modeling and simulation of mechatronic systems using Simscape, 2020, Morgan & Claypool.", "SimulationX offers better Acausal system handling and simulation advantages.", "Those will be marked for completion not for correctness.", "Each of these assignments may include analytical, numerical (using MATLAB/Simulink/Simscape) and explanatory components exploring fundamental aspects of the material covered in the course.", "COVID-19 Emergency Remote Teaching-Learning for In-Class Sessions:", "COVID-19 Emergency Self-Isolation:"]}, {"course_id": 27, "course_code": "SYDE 361", "course_name": "SYDE361 - Systems Design Methods 1: Needs Analysis and Prototyping (0.50)", "term_name": "3A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Systems Design Methods 1: Needs Analysis and Prototyping Spring 2024", "10:00AM - 11:20AM E7 4417", "01:30PM - 03:20PM", "01:30PM - 03:20PM", "Email: rroufail@uwaterloo.ca", "Email: cyoung@uwaterloo.ca", "Email: jerrin.bright@uwaterloo.ca", "Email: aria.hajiahmadi@uwaterloo.ca", "Office: E7-6303", "The methodology of design, situation of concern; needs analysis and problem definition, engineering analysis and generation of alternative solutions, design prototyping, and design documentation.", "Prereq: 3A Systems Design Engineering.", "Reinforce the iterative, user-centered design process taught in the SYDE program", "Provide experience with mathematical modelling and analysis to support the design process", "Provide experience with physical design prototyping", "Advance use of applied science in the design, prototyping, and testing of complex projects", "2) Carry out systematic design methods for complex systems.", "3) Conduct an appropriate engineering model of an electromechanical system.", "5) Evaluate the sustainability of the selected design considering economic, environmental, and social impact.", "6) Communicate technical design effectively through both oral reports and written reports.", "The alpha numeral in brackets refers to CEAB graduate attributes.", "Introduction & Planning", "User Needs", "Welcome and Safety + User Needs Brainstorming and Test Planning", "Design Process:", "Specs and Standards", "Morphology Design", "Group A: Electrical Device Characterization (User Needs) Group B: Generator Output Characterization - Brainstorming and Test Planning", "Literature Review on Energy Harvesting Technology Group B: Electrical Device Characterization (Generator Output) Group A: Power Supply Circuit Design and Planning", "Midterm at 9:30 AM Room E5 6004 & 6006", "Group A/B: Power Supply Test Days", "7 June 18/20 Systems Design Integration & Design an Experiment Group A: Fluid Flow Device Characterization (Flow) Group B: Fluid Flow Device Characterization (Mechanical)", "8 June 25/27 Project Work Period (Design Experimental Plan) Group A/B: Design Session", "Fundamentals and Applications of Renewable Energy. 2nd", "Engineering Design Methods, Strategies for Product Design, Cross, N, 5th ed.", "The Engineering Design of Systems, Models and Methods, Buede, D., Miller, W., 4th ed.", "Deliverables and Milestones", "SYDE 361 - S2024", "Design Plan Report", "THA", "TBD", "Late or Missed Course Deliverables & Milestones:", "A fraction of the day i.e. hour(s) after deadline of submission counts as a day.", "If you encounter technical difficulties that limit your ability to submit deliverables, keep a clear record and communicate the issues with the instructor and the SYDE Undergraduate Administrative Coordinator as soon as possible.", "Extensions will NOT be given after a submission date.", "Extensions will be given for very serious issues, and will ONLY be considered for the following circumstances:", "Marking of Team-Based Deliverables:", "Sanctioned Collaboration vs. Individual Work", "Collaboration is allowed for in-class exercises and the team components of design projects.", "Accurate and Honest Reporting", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 28, "course_code": "SYDE 381", "course_name": "SYDE381 - Thermodynamics (0.50)", "term_name": "3A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Thermodynamics I Spring 2024", "10:30AM - 11:20AM E7 4417", "Roydon A. Fraser <rafraser@uwaterloo.ca>, Mechanical & Mechatronics Engineering, E5-3017.", "In case of urgency cell number will be provided in class.", "An introductory course in engineering thermodynamics structured for students in Systems Design.", "Introduction to heat transfer by conduction, convection, and radiation.", "Applications focus on problems of energy and environment.", "The concepts of statistical thermodynamics are introduced.", "Prereq: 3A Systems Design Engineering.", "Relating thermodynamic concepts to the problem at hand can prove challenging, hence, the use of a strict methodology in this course.", "Upon completing this course you should be able to conduct basic energy calculations and feasability analyses, and understand essential concepts underlying all thermodynamics from the simple to the complex, from the quantum to the galactic, and beyond.", "Objective 1: Impart foundational concepts of classical thermodynamics and heat transfer.", "In contrast I view learning as a team effort requiring both instructor and student to be committed to learning.", "Chapters and/or Chapter Sections may not be covered in strict order.", "Chapter 1: Introduction and Overview", "Chapter 2: Introduction <Thermodynamics> and Basic Concepts", "Chapter 3: Energy, Energy Transfer, and General Energy Analysis", "Chapter 5: Energy Analysis of Closed Systems", "Chapter 6: Mass and Energy Analysis of Control Volumes", "Students are expected to hand in their solutions to these problems at the end of each tutorial.", "Each student must hand in their own assignment, however, it is fully realistic and in general a good learning situation to work with others on assignments.", "Instructor and teaching assistants may employ web search engines and large language models to check for originality.", "If you properly reference sources you cannot be accused of plagiarism, and it is a professional engineering code of ethics requirement.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 29, "course_code": "SYDE 383", "course_name": "SYDE383 - Fluid Mechanics (0.50)", "term_name": "3A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Fluid Mechanics Spring 2024", "03:30PM - 04:20PM E7 4417", "Fundamental concepts in systems involving fluid flow.", "Basic treatment of statics, kinematics and dynamics of fluids.", "Conservation of mass, momentum and energy for a control volume.", "Brief introduction to boundary layers, lift and drag, ideal and compressible flow.", "Prereq: Level at least 3A Systems Design Engineering.", "This is an introductory course in fluid mechanics aimed at introducing concepts and strategies to solve engineering problems involving fluids.", "A fluid in the engineering sense is an interesting state of matter that can exhibit odd and counterintuitive behaviours that can surprise even experts in the field.", "Determine critical flow processes and estimate critical parameters of a fluid device (1c, 2b, 2c)∗", "Estimate pressure changes and flow rates in a fluid flow (1a, 1b, 1c)∗", "1 Describing fluid motion", "1.1 Introduction to fluids 1.2, 1.4", "1.2 Describing and observing fluids", "1.4 Flow visualization (stream streak and path lines + vector plots) 1.11", "1.5 Descriptive vocabulary", "2 Forces in fluid motion", "2.1 Forces on a fluid element (body and surface forces)", "2.2 Pressure in a fluid 2.1", "2.3 Equilibrium of a fluid element 2.1, 2.2", "2.4 Pressure variation in fluids 2.3, 2.9", "2.5 Experimental pressure measurement 2.10", "2.7 Viscosity and friction 1.9", "3.1 Control volume formulation 3.1, 3.2", "3.2 Mass conservation balance 3.3", "3.3 Reynolds transport theorem 3.2", "3.4 Conservation of linear momentum 3.4", "3.5 Common assumptions/conditions in control volume analysis", "3.6 Applications of control volume analysis", "3.7 Bernoulli equation 3.5", "3.8 Conservation of energy 3.7", "4.2 Entrance length and fully developed flow 6.2", "4.4 \"Minor\" losses in piping systems 6.9, 6.11, 6.12", "4.5 Flows in non-circular ducts 6.8", "5 Scaling analysis and modeling", "5.1 Buckingham Pi theorem 5.1 - 5.3", "1 Describing fluid motion (1.1, 1.2) 1 N/A", "Quizzes will tentatively cover course chapters given in the table below and be tentatively held in the given week.", "6 4.1 - 4.4 10", "In order to perform well on examinations in this course, you must not only understand how to solve new problems in fluid mechanics, but also be comfortable with the basic concepts.", "reading the textbook; and", "Short quizzes", "Completing these assignments is essential for developing a good understanding of the course concepts.", "The project will put into practice many of the theoretical concepts presented in class and during the tutorials.", "Exams", "They will be closed-book exams.", "Contingencies will be dealt with on a case-by-case basis.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as problem solving and mathematical analysis of fluids.", "Library for research-based assignments"]}, {"course_id": 30, "course_code": "SYDE 352", "course_name": "SYDE352 - Introduction to Control Systems (0.50)", "term_name": "3B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Control Systems Winter 2025", "01:30PM - 03:20PM E7 4417", "Kimia Dinashi                 Email: kdinashi@uwaterloo.ca", "Classical and state space representations of control systems.", "Routh-Hurwitz and root-locus methods.", "Pole placement, PID, phase-lead and phase-lag controllers.", "Introduction to Control Systems introduces the Systems Design Engineering student to the design and analysis of linear control systems.", "The course covers the essential ideas of feedback, a review of Laplace transforms, transfer functions, block diagrams, time-domain performance specifications, the effects of pole-zero locations, stability of LTI systems, Routh-Hurwitz criterion, PID feedback control, Root-Locus design method, single-input single-output systems analysis and control methods in the frequency domain (Bode and Nyquist), phase lead & phase lag controllers, system description in state-space and state-variable feedback control design techniques.", "Explain Laplace transforms, key components of feedback control systems, transfer functions, PID controllers, and main response characteristics of control systems (GAs: 1a, 1d).", "Formulate, model, and solve properly control systems design and analysis problems (GA: 2a, 2b, 2c).", "Apply block diagram reduction methods to find the overall transfer function of a given feedback control system (GA: 1d).", "Apply the Routh-Hurwitz criterion to investigate the stability of an LTI system for different values of the control system parameters (GA: 1d).", "Apply the Root-Locus method to tune the gains of PI, PD, or PID controllers for a given set of time-domain response characteristics (GA: 4b).", "Construct and interpret the Bode diagram (magnitude and phase) for a given LTI control system (GA: 1d).", "Apply the Nyquist criterion to investigate the stability of a given LTI control system for different values of the control system parameters (GA: 1d).", "Employ computer programs and engineering tools properly for control systems design and analysis (GA: 5c).", "Work effectively in a teamwork environment as a member and leader for solving control systems design and analysis (GA: 6a, 6b).", "An introduction to Control Systems, Open-Loop, Feedback Control & Mathematical Models, Solving ODEs by Laplace Transforms.", "Transfer Function, Poles, Zeros, Block Diagrams, Block Diagram Reduction & Pole Location, First-order Systems Response Characteristics.", "Second Order Systems Response Characteristics & Response of Higher Order Systems.", "Characteristic Equation, Stability Analysis & Routh-Hurwitz Criterion, Examples.", "Feedback Control System Characteristics, Sensitivity, Disturbance Rejection & Steady-State Error, System Type.", "Design and Analysis by Root Locus Method, Construction Rules & Examples.", "Root-Locus Controller Design & Frequency Response Analysis and Design Method.", "Mar. 17-", "Resonant Frequency & Peak Value, Polar Plots, Nyquist Stability Criterion.", "Nyquist Criterion Examples & Relative Stability Analysis.", "Phase-lead & Phase-lag Controllers & Group Project Presentations.", "Feedback Control of Dynamic Systems, 8/E, by G. F. Franklin, J. D. Powell and A. Emami-Naeini eTextbook: https://uwaterloo-store.vitalsource.com/products/feedback-control-of-dynamic-systems-j-david-powell-j-da-powell-v9780134726076 Yes $77.99", "Supplies and laptop recommendations https://uwaterloo.ca/engineering/undergraduate-students/supplies-and-laptop-recommendations No", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 31, "course_code": "SYDE 352L", "course_name": "SYDE352L - Control Systems Laboratory (0.25)", "term_name": "3B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Control Systems Laboratory Winter 2025", "E5 6005", "09:00AM - 11:50AM E5 6005", "E5 6005", "08:30AM - 11:20AM E5 6005", "Email:  chris.mcclellan@uwaterloo.ca,", "This lab is intended to give students a practical introduction to System Identification, Controller Design and Controller Validation.", "Devise and test a model of the system they wish to control (3a, 3b, 3c)", "Week 8 (February 24 – 27) – Lab 2 – PID-Controller Design and Validation of Disc Plant", "Week 12 (March 24 – 27) – Lab 4 – PID-Controller Design and Validation of Inverted Pendulum", "This includes weekends.", "You’ll be working in groups of 2.", "No rubric will be given but you’re always welcome to ask for clarification.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 32, "course_code": "SYDE 362", "course_name": "SYDE362 - Systems Design Methods 2: Testing, Verification, and Validation (0.50)", "term_name": "3B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Systems Design Methods 2: Testing, Verification, and Validation Winter 2025", "09:00AM - 10:50AM E7 4417", "Email: victoria.ann.kerr@uwaterloo.ca", "Engineering design project course where students work in small groups applying the principles of engineering problem solving and design, with a focus on testing and design evaluation, and an introduction to benchmark testing and applied design optimization.", "Effectively research and apply standard testing methods and engineering tools to verify design performance of prototypes (GA: 4c, 8b)", "2 - Create refined solutions within the framework of design requirements and specifications for a selected problem space (GA: 4a, 4b)", "3 - Use simulation and optimization as part of the overall design and evaluation process (GA: 4c)", "5 - Communicate the role of proper testing and evaluation in the career of a professional engineer (GA: 8a)", "Graduate Attribute codes:", "Define design requirements and specifications for complex, open-ended engineering problems", "Generate and refine potential solutions to complex, open-ended design problems", "Critically evaluate and compare design choices", "Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest", "Describe the importance of codes, standards, best practices, laws, and regulations within engineering", "Weeks 1-5: Statistical Analysis of Testing Results (LO's 1,4)", "In SYDE 362, the main learning vehicles are team-based design projects.", "No extensions will be given after a submission date.", "Extensions will only be given for very serious issues, and will only be considered for the following circumstances:", "Marking of Team-Based Deliverables:", "It is the responsibility of ALL team members to ensure the accuracy and quality of all aspects of submitted team-based deliverables.", "Therefore, any academic integrity offenses arising from a team-based deliverable will impact ALL group members.", "Sign your email with your first and last name.", "Allow 24-48 hours for a response to your email.", "Email should be used for brief questions that can be answered quickly.", "Sanctioned Collaboration vs. Individual Work", "Collaboration is allowed for in-class exercises and the team components of the design projects.", "Design project instructions will identify individual and team components", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm and those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 33, "course_code": "SYDE 411", "course_name": "SYDE411 - Optimization and Numerical Methods (0.50)", "term_name": "3B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Optimization and Numerical Methods Fall 2024", "08:30AM - 09:50AM E7 4433", "- Abbas Seifi, Professor   Email: aseifi@uwaterloo.ca", "Advanced methods for systems of linear equations.", "Linear programming, simplex and interior-point methods.", "Local and global optimization methods.", "This course introduces the applications of optimization modeling and numerical methods to various engineering optimization problems.", "It provides an overview of the formulation and classification of optimization problems arising in engineering and types of suitable optimization methods.", "Graphical solution methods for two-variable problems and optimization techniques for single-variable problems like region elimination approaches, interpolation algorithms, and direct root-finding methods are discussed.", "Linear Programming problem formulations and simplex and interior-point methods for solving such problems are discussed.", "Learn about different types of optimization problems in engineering design (GA: 1,4)", "2. Study types of optimizations methods and where they are applied, convexity, optimality criteria for unconstrained multivariable problems, and optimality conditions for constrained multivariable problems and proper software tools (GA: 1,2,5)", "Apply graphical solution method to solve two-variable optimization problems, and region elimination methods, interpolation methods, and direct root-finding methods to solve single-variable problems (GA: 1,2,5)", "Apply simplex and interior-point methods for solving Linear Programming problems (GA: 1,2,5)", "7. Apply constrained multivariable methods as well as multi-objective techniques to solve design optimization problems using Pareto optimality concept(GA: 3,4,5)", "Details and explanation of each attribute can be found at Graduate attributes | Engineering (uwaterloo.ca)", "Week 1 / LO: 1,2 Sept. 5  Introduction to Optimization", "Classification of Optimization Problems & Applications", "Slides", "Week 12 / LO: 6,7 Sept. 10-12 Functions of a Single Variable Optimization Problem Statement; Basic Concepts & Examples; Graphical Solutions; Optimality Conditions", "Week 3 / LO: 4 Sept. 17-19 Optimization of Single Variable Functions", "Unimodal Functions", "Bracketing & Region Elimination Golden Section and Fibonacci methods; Interpolation method", "Assign.1", "Week 4 / LO: 4 Sept. 24-26 Gradient-Based  Root-Finding Methods Newton–Raphson, quasi-Newton Method; Bisection & Secant methods;", "Convexity & Positive Definiteness", "Week 9 / LO: 3,7 Oct. 29 -31 Constrained Multivariate Optimization Optimality Conditions for Convex Nonlinear Programs; Example of KKT Conditions and Solutions; Design Optimization in MATLAB", "Assign.3", "Week 10 / LO: 6 Nov. 5-7 Linear Programming & Duality Theory", "LP Formulation; Graphical Solution & Simplex method", "Duality& Economic Interpretation", "Week 11 / LO: 6 Nov. 12-14 Interior-Point Methods (IPM) Affine-Scaling Interior-point method; Examples; primal-dual interior-point algorithms", "Week 12 / LO: 6,7 Nov. 19-21 Multi-objective Optimization  Quadratic Programming & Applications; Pareto Optimality; epsilon-Constrained Method", "Week 13 / LO: 1,3 Nov. 26- 28 Modern Global Optimization and Applications Genetic Algorithm and Examples; Applications in Design Optimization", "Introduction to Optimum Design, Elsevier Inc., 4th Edition, J. S. Arora, 2016 No", "Optimization Concepts and Applications in Engineering, Cambridge University Press, 2nd Edition, A. D. Belegundu, T. R. Chandrupatla, 2011 No", "The midterm exam will be taken in person and closed book.", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 34, "course_code": "SYDE 461", "course_name": "SYDE461 - Systems Design Capstone Project 1 (0.50)", "term_name": "4A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Systems Design Capstone Project 1 Fall 2024", "08:30AM - 10:20AM E5 6008", "10:30AM -", "E-mail: rroufail@uwaterloo.ca", "Open door policy & upon request.", "Technical Engineering Suport", "Office Location: E7-6402", "E-mail: orion.bruckman@uwaterloo.ca", "E-mail: jerrin.bright@uwaterloo.ca", "The first half of a two-term engineering design project continuing the systems design project sequence.", "Students work in small groups applying the principles of systems design engineering to a situation of concern of their own choosing.", "Prof. Roufail should be your first point of contact for all questions.", "*Panel exams will be booked in coordination with the groups and project supervisor and advisors.", "Identify, formulate, analyze, and solve complex engineering problems utilizing university level mathematics and applied engineering fundamentals.", "Investigate complex open ended engineering problems using appropriate methods and design solutions that will meet preidentified needs using proper engineering standards, while paying attention to health and safety risks, environmental and societal sustainability.", "Effectively communicate complex engineering concepts to different stakeholders both orally and written.", "Recognize their role and responsibility towards society as professional engineers, especially their primary role to protect the public.", "Analyze the impact of the project on society and the environment at all stages of the project life cycle along with the ethical impact.", "Identify and address their own educational need to maintain their competency in the fields necessary for the success of the project.", "Demonstrate understanding of concepts in mathematics", "Demonstrate understanding of concepts in natural science", "Demonstrate understanding of engineering fundamentals", "Demonstrate understanding of specialized engineering knowledge", "2b", "Develop models to solve engineering problems including identifying", "Design experiments1 to investigate complex engineering problems", "Gather information from relevant sources to address complex engineering", "3c", "Synthesize information from multiple sources to reach valid conclusions", "Design (Des)", "Define design requirements and specifications for complex, open-ended", "Generate and refine potential solutions to complex, open-ended design", "Critically evaluate and compare design choices", "Select appropriate engineering toolsbehavior, considering their limitations", "Create and/or modify appropriate engineering tools, identifying their", "6a", "Generate appropriate documentation to communicate within the profession and to society at large", "7b", "7c", "Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest", "Describe the importance of codes, standards, best practices, laws, and regulations within engineering", "Impact of engineering(Impacts)", "project, incorporating sustainability considerations in making decisions", "Identify ethical and unethical behaviour in professional situations", "Identify how an engineer is accountable to multiple stakeholders in engineering practice", "Economics and project management (Econ)", "Apply project management techniques in engineering projects, with attention to risk, and change", "Identify gaps in their knowledge, skills and abilities", "W3", "Proposal Summary & Individual Prospect Contribution", "Follow up with Prof.Roufail &Teaching Team(A)", "Team Contract & signed supervisor agreement", "Follow up with Prof.Roufail &Teaching Team(B)", "Follow up with Prof.Roufail &Teaching Team(A)", "Follow up with Prof.Roufail &Teaching Team(B)", "Design Project Safety Disclosure", "Milestones", "Technical Development Modules (TDM):", "There will be a sign-up form for the modules.", "TDM2: Reverse Engineering 1 Sign Up**", "TDM3: Workshop and prototyping Sign Up**", "TDM4: Sustainability in Design At least one member per group +", "TDM5: Electronic Fabrication Sing Up**", "TDM6: Mechanical Fabrication Sign Up**", "Power Supply Design Sign Up**", "Technical Communication At least one member per group +", "TBD", "TDM9: Muli-Physics modeling & simulation  Sign Up**", "TBD", "TDM10: Engineering Economics & Design Optimization At least one member per group", "TBD", "Material Selection for Design Sign Up", "TBD", "TBD", "TBD", "TBD", "TDM15: Battery & Energy Storage Sign Up", "TBD", "TDM16: Fabrication Basics Sign Up", "TBD", "Design Infographic Peer Evaluation (D3) 5%", "Design Analysis Report (D6) 30%", "An ideal number of team members working on a complex engineering project would be 4 students.", "A robust product does not mean a “consumer-ready” product.", "Your competence in the execution of the engineering design process and in the application of engineering knowledge, skills, and tools.", "Marking of Team-Based Deliverables:", "A Team Health Assessment/Peer Review type of milestone will be assigned towards the end of term in which team members will be given the opportunity to evaluate the contributions of themselves and their team members.", "It is the responsibility of ALL team members to ensure the accuracy and quality of all aspects of submitted team-based deliverables.", "Sanctioned Collaboration vs. Individual Work", "Instructions will clearly identify individual and team components.", "Accurate and Honest Reporting", "The same applies if fraudulent reporting is uncovered as part of the questioning during any of the Panel Exams and Design Reviews.", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.", "Compassionate and respectful communication: Most online communication between", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows the University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "They will review your case and coordinate a reasonable and fair plan in"]}, {"course_id": 35, "course_code": "SYDE 462", "course_name": "SYDE462 - Systems Design Capstone Project 2 (0.50)", "term_name": "4B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Systems Design Capstone Project 2 Winter 2025", "10:30AM -", "08:30AM - 10:20AM E5 6008", "Office Location: E7-6312 and Online TEAMS E-mail: rroufail@uwaterloo.ca", "Open door policy & upon request.", "E-mail: orion.bruckman@uwaterloo.ca", "E-mail: jerrin.bright@uwaterloo.ca", "The second half of a two-term engineering design project continuing the systems design project sequence.", "Students work in small groups applying the principles of systems design engineering to a situation of concern of their own choosing.", "Identify, formulate, analyze and solve complex engineering problems utilizing university-level mathematics and applied engineering fundamentals (KB & PA)", "Investigate complex, open-ended engineering problems using appropriate methods and design solutions that will meet predefined needs using proper engineering standards while paying attention to health and safety risks and environmental and societal sustainability.", "Select and/or create and use appropriate engineering tools while recognizing their limitations.", "Effectively communicate complex engineering concepts to different stakeholders both orally and written.", "Recognize their role and responsibility towards society as professional engineers, especially their primary role to protect the public.", "Analyze the impact of the project on society and the environment at all stages of the project life cycle, along with the ethical impact.", "Identify and address their own educational need to maintain their competency in the fields necessary for the project's success.", "Demonstrate understanding of concepts in mathematics", "Demonstrate understanding of concepts in natural science", "Demonstrate understanding of engineering fundamentals", "Demonstrate understanding of specialized engineering knowledge", "2b", "Develop models to solve engineering problems including identifying approximations, assumptions, and constraints", "Design experiments1 to investigate complex engineering problems", "Gather information from relevant sources2 to address complex engineering problems", "3c", "Synthesize information from multiple sources to reach valid conclusions", "Design (Des)", "Define design requirements and specifications for complex, open-ended engineering problems3", "Generate and refine potential solutions to complex, open-ended design problems", "Critically evaluate and compare design choices", "Create and/or modify appropriate engineering tools, identifying their limitations", "6a", "Generate appropriate documentation to communicate within the profession and to society at large", "7b", "7c", "Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest", "Describe the importance of codes, standards, best practices, laws, and regulations within engineering", "Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations in making decisions", "Identify  ethical and unethical behavior in professional situations", "Identify how an engineer is accountable to multiple stakeholders in engineering practice", "Economics and project management (Econ)", "Apply project management techniques in engineering projects, with attention to risk, and change", "Identify gaps in their knowledge, skills and abilities", "W3", "24-Jan", "TDM 12 & TDM 13", "Sustainability Analysis of Design Solution Report (Mar 10)", "TDM 14 & TDM 15", "Milestones", "Electronics Design: PCB Sign Up", "** Sing Up", "TDM9: Multiphysics Systems Modelling**  No Limit", "February 14 TDM12: Batteries & Energy Storage ** Sign Up", "TDM13: Stickvise ** Sign Up", "Material Selection for design & Eco Analysis ** No Limit", "TDM15: Engineering Economics and Design Optimization** No Limit", "** TDM8 &TDM 9, TDM 12 & TDM 13, and TDM14 &TDM15 are running the same day!", "Deliverables and Milestone Assessments", "Deliverables", "D2b", "D3", "D4", "Sustainability analysis of Design Solutions Report: (Economic, Social & Environmental)", "D6 Project Conference Paper", "Total", "RT1 Symposium components", "TBD", "If your group opts out of the gallery walk, you need to let Prof. Roufail know the reason in writing.", "Your competence in the execution of the engineering design process and in the application of engineering knowledge, skills, and tools.", "Marking of Team-Based Deliverables:", "A Team Health Assessment/Peer Review type of milestone will be assigned towards the end of term in which team members will be given the opportunity to evaluate the contributions of themselves and their team members.", "It is the responsibility of ALL team members to ensure the accuracy and quality of all aspects of submitted team-based deliverables."]}, {"course_id": 36, "course_code": "BME 499", "course_name": "BME499 - Elective Biomedical Research Project (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Elective Biomedical Research Project Winter 2025", "Email: celiasmi@uwaterloo.ca", "Email: mgorbet@uwaterloo.ca", "Email: jenny.howcroft@uwaterloo.ca", "Approval for doing research with an off-campus supervisor must be given by the Director of the Biomedical Engineering Program; note that this would also require identifying a co-supervisor in the faculty of engineering.", "perform a background literature search and review,", "analyse and evaluate results and/or design solution", "independently prepare and present a technical presentation.", "demonstrate responsibility, accountability, safety, and ethical behavior while conducting the independent project", "conduct an investigation of a complex problem using appropriate experiments and tools (3a, 5c)", "identify the potential social, economical, ethical and environmental impacts of their research or design project (9b)", "1 Knowledge Base 1b -  Demonstrate understanding of concepts in natural science", "1d - Demonstrate understanding of specialized engineering knowledge", "2 Problem Analysis 2a - Formulate a problem statement", "3 Investigation 3a - Create investigative studies of complex engineering problems", "3c - Synthesize information from multiple sources to reach valid conclusions", "4 Design 4b - Generate and refine potential solutions to complex, open-ended design problems", "7 Communication Skills 7a - Generate appropriate documentation to communicate within the profession and to society at large", "9 Impact of Engineering 9b - Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations in making decisions", "Week 13-14: Self-reflection on scientific contributions and engineering knowledge", "Scheduling needs to be coordinated with your BME 499 instructor", "Laptop/computer required for creating reports and presentations Yes Depends on student's choice", "Library for research-based assignments", "Email Communication", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Visit them at www.uwaterloo.ca/wcc.", "Course and Departmental Expectations in SYDE"]}, {"course_id": 37, "course_code": "BME 544", "course_name": "BME544 - Biomedical Measurement and Signal Processing (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Biomedical Measurement and Signal Processing Winter 2025", "Signal processing techniques will be discussed in the context of extraction and application of useful biomedical signals.", "(3) Understand and apply digital signal processing concepts and techniques to biomedical signals", "(4) Develop a signal processing system to reliably extract features from biomedical signals for a particular application and justify the approaches/choices made", "1 Knowledge Base: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "4b Critically evaluate and compare design choices 4", "17-Jan Power Spectra and Spectrograms 3", "31-Jan Sampling in Embedded Systems 2", "14-Feb Correlation Analysis 2,3", "24-Feb Parametric Signal Processing 3", "28-Feb Speech Processing and Applications 2,3", "07-Mar Electrodes and coupling to the environment 2", "21-Mar Brain Anatomy and EEG 1", "24-Mar EEG Processing 2,3", "Biomedical Signal Analysis, 3rd Edition.", "A total of 6 assignments will be given during the term.", "Data Collection", "One is for students to gain experience in recording measurements of different biomedical signals.", "The second is to provide a set of recordings for students to use to test and evaluate signal processing approaches.", "It is anticipated the four sets of data collection will be conducted during the term.", "The project is an individual Students will identify an application involving a biomedical signal.", "Based on the application, they will develop and evaluate a signal processing system to reliably extract features from biomedical signals for that application and justify the approaches/choices made.", "Notice of Recording", "Course and Departmental expectations", "Compassionate and respectful communication", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "SYDE-BME Compassionate Accommodation", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 39, "course_code": "BME 551", "course_name": "BME551 - Biomechanics of Human Movement (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Biomechanics of Human Movement Fall 2024", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "Monday 12:00-12:30p E5-6108", "This course introduces students to the biomechanics of the musculoskeletal system, including motor control and rehabilitation engineering.", "Motor control will be included, as well as the identification of body segment parameters and the dynamics of muscles.", "Biomechanics applies techniques of engineering mechanics to the study of biological organisms.", "This course is specifically concerned with “musculoskeletal biomechanics”, the application of engineering mechanics to the study of the human musculoskeletal system.", "We will further limit our interest to the use of kinematics and rigid-body dynamics to model the human body and its movement.", "During this process, you will become well versed in the patterns of human motion, inverse and forward dynamic analyses of human motion, robotics, model development and validation, and interpretation of model predictions.", "Assumed knowledge: The course assumes knowledge of basic concepts in statics, linear algebra, differential equations, and elementary dynamics.", "1) Extend a singular rigid body system to develop a lumped-mass multibody model.", "3) Develop equations to solve these representative models and simulate the human body motions or those of a robot.", "4) Validate the developed human body models using motion capture technology to simulate a multifaceted human movement.", "6a) Use human body models to distinguish normal and pathological motion and force patterns.", "1) Extend a singular rigid body system to develop a lumped-mass multibody model.", "2b", "3) Develop equations to solve these representative models and simulate the human body motions or those of a robot.", "2b-c", "4) Validate the developed human body models using motion capture technology to simulate multifaceted human movements.", "6a) Use human body models to distinguish normal and pathological motion and force patterns.", "4a-b, 6a-b", "Monday", "Friday", "Introduction", "FE 5.1-5.5   FE 5.6-5.7      2b Matlab/ Python", "FB 8.1-8.7   FB 8.8-8.10      2b-c Matlab/ Python", "4a-b", "4a-b", "Ebook available in library Yes", "Ebook available in library Yes", "Ebook available in library Yes", "D. A. Winter, “Biomechanics and Motor Control of Human Movement” (BM), 4th Edition, 2009, John Wiley & Sons, Inc.", "Ebook available in library Yes", "Ebook available in library Yes", "Static Biomechanical Analysis: 3D SSPP No", "Dynamic Biomechanical Analysis: OpenSim No", "Evaluation", "During the last month, you will undertake a group project to analyze a biomechanical system.", "Your findings should be summarized in a final report organized in the following sections: Introduction, Methods, Results, Discussion, and Conclusions & Recommendations.", "If there is something I can clarify during lectures, please feel free to ask.", "Compassionate Accommodation", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as motion capture collections and data analysis.", "Library for research-based assignments"]}, {"course_id": 40, "course_code": "BME 581", "course_name": "BME581 - Ultrasound in Medicine and Biology (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 11:20AM E7 4433", "04:00PM - 05:20PM", "08:00PM -", "08:00PM -", "10:00AM - 11:20AM E7 4433", "04:00PM - 05:20PM", "10:00AM - 11:20AM E7 4433", "04:00PM - 05:20PM", "Di Xiao", "E-mail: di.xiao@uwaterloo.ca", "View requirements for ECE 493", "View requirements for ECE 700", "Describe how ultrasound is used in diagnostics and therapy", "Summarize the technical principles related to ultrasound", "Explain the bioeffects that can be induced by ultrasound and its potential safety concerns", "Theme 1: Introduction to ultrasound imaging", "Basic ultrasound principles", "Basics of ultrasound imaging", "Ultrasound-based blood flow measurements", "General interactions in imaging", "Nonlinear ultrasonics and its imaging applications", "Principles of acoustic cavitation", "Principles of acoustic radiation and streaming", "Thermal-based ultrasound therapy", "Microbubbles in imaging and therapy", "Theme 4: Biosafety considerations", "Ultrasound-induced bioeffects", "Ultrasound measurement and protection standards", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 43, "course_code": "BME 589", "course_name": "BME589 - Special Topics in Biomedical Devices (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Biomaterials and Biomedical Design Winter 2024", "An overview of nanomedicine and nanotechnology-based biomedical devices.", "Strategies and technologies for designing, testing, and manufacturing biomaterials and tissue-engineering products.", "Biological and clinical applications.", "The course provides an overview of the recent advances in medicine and nano-technologies for development of tissue engineering and regenerative medicine.", "Strategies and technologies for designing, testing, and manufacturing of biomaterials and tissue-engineering products will be introduced.", "The biological and clinical applications will be discussed.", "The unmet medical needs, challenges in manufacturing, regulatory approval and commercialization for tissue engineering applications will also be discussed.", "Apply fundamentals of fabrication technology for tissue engineering applications", "Integrate fundamentals of materials science to solve biomedical unmet needs", "Understand the fundamentals of biocompatibility and physiology for tissue engineering applications", "Design tissue engineering solutions to solve health-care problems", "Communicate through reports and presentations", "-Introduction to tissue engineering", "-Scale in biological systems", "-Nanotechnologies and biomaterials for biomedical engineering", "Drug and gene delivery", "-Key components of tissue engineering", "Biomaterials: engineering biological structures", "Protein interactions with biomaterials", "Molecular and cellular processes with living environment, blood-materials interaction, short and long term reactions to the body.Cell interactions with biomaterials", "Immune response and wound healing", "Growth factors, controlled release and gene delivery", "Cells and Stem cells", "Neural repair and regeneration", "Liver repair and regeneration / bone tissue engineering", "Assessment of biomedical products", "Regulatory and commercialization", "Design project presentations", "Design project 40%", "Mid-term test and final exam are in person test, open-book", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 44, "course_code": "CIVE 440", "course_name": "CIVE440 - Transit Planning and Operations (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Transit Planning and Operations Winter 2025", "08:30AM - 09:50AM RCH 103", "02:30PM - 03:20PM", "The historical evolution of transit in cities; the technological innovations which made transit possible; and transit mode definitions.", "System operational characteristics are defined and quantitative measures of effectiveness are introduced.", "Methods for selecting appropriate transit modes are covered.", "The focus of this course is on the use of quantitative techniques to analyse and solve problems arising in the planning, design, operation and management of urban public transportation systems.", "Topics include an introduction to public transportation modes, transit performance analysis, fleet sizing and route design; control of transit operations, and paratransit planning, scheduling and dispatching.", "The course also covers various transit modelling issues arising in the Advanced Public Transportation Systems that aim at maximising transit system efficiency and reliability using emerging technologies such as global positioning systems (GPS), electronic fare payment, and automatic passenger counters and pre-trip/en-route passenger information systems.", "The historical evolution of transit in cities; the technological innovations which made transit possible; and transit mode definitions.", "System operational characteristics are defined and quantitative measures of effectiveness are introduced.", "Methods for selecting appropriate transit modes are covered.*eligible for MES", "Classify urban transportation modes by right of way, technology, and service types", "Compute and graph quantitative relationships, including vehicle dynamics and time-space diagrams", "Determine fleet size requirements and schedules for a given route/line or a set of routes/lines", "Understand the range of approaches for estimating transit ridership", "Select the optimal mode for a transportation route based on vehicle characteristics, planning contexts, travel forecasts, and economic factors", "Design a basic transit network with efficient transfers and schedules", "Introduction and History of Public Transit", "Transportation and Transit Planning", "Travel Demand Modeling", "Transit System Characteristics and Performance", "Scheduling", "Network Structures", "Transit System Financing", "The Future of Public Transit", "Submission requirements will be specified for each assignment.", "This course includes the independent development and practice of specific skills, such as evaluating transit data, planning transit routes, and estimating transit ridership.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 45, "course_code": "CIVE 460", "course_name": "CIVE460 - Engineering Biomechanics (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Biomechanics Winter 2025", "02:30PM - 05:20PM", "RCH 301", "Introduction to engineering technologies applicable to the field of biomechanics.", "Specific topics covered may include biological growth, form and function; biomaterials; kinematics and neurology of gait; biotribology; joint anatomy, function and repair; occupational biomechanics; trauma prevention.", "The course will provide a general overview of engineering biomechanics for civil, mechanical and biomedical engineering students.", "2. Conduct gait analysis and calculate forces applied at joints and foot reactions", "Introduction", "Evolution of Biomechanics", "Applications (medical and engineering)", "Musculoskeletal System", "Introduction,", "Anatomical positions & movements,", "System components,", "Gait Biomechanics", "Introduction;", "Muscles forces,", "Bone & Cartilage Biomechanics", "Introduction (highlights & progress),", "Bone mechanical properties & applications;", "Cartilage structure and mechanics", "Tendon & Ligament biomechanics", "Mechanical behaviour", "Biotribology & Joint Replacement", "Biotribology subfields,", "Cancer Biomechanics", "Introduction: cancer stages,", "Mechanical characteristics of cancer cells,", "Biomechanics and cancer treatment,", "Cardiovascular biomechanics, and", "Biomechanics in Radiotherapy", "“Orthopaedic Biomechanics: Mechanics and Design in Musculoskeletal Systems,” Pearson Prentice Hall.", "Biomechanics and motor control of human movement.", "Biomechanics and motor contAl-Mayah, A. (Ed.)"]}, {"course_id": 46, "course_code": "ECE 356", "course_name": "ECE356 - Database Systems (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Database Systems Fall 2024", "ECE 356", "ECE 356 001", "11:30AM -", "08:30AM - 09:50AM E7 4417", "Data models, file systems, database system architectures, query languages, integrity and security, database design.", "View requirements for ECE 356", "Relational databases empower the vast majority of dynamic websites as well as a variety of information management systems in private and public sector organizations.", "ECE356 explores the concepts and techniques that make such databases convenient, efficient, and reliable.", "The course additionally includes an introduction to data mining and NoSQL.", "model data using entity-relationship (ER) diagrams", "understand the relational model and design a relational schema for a data set", "execute SQL commands against a remote database using Java Database Connectivity (JDBC)", "identify integrity constraints and functional dependencies in data", "apply the theory of database normalization to optimize the design of a relational schema", "understand the basics of transaction execution, concurrency control, and recovery in databases", "understand SQL injection attacks, as well as password hashing and salting", "perform simple data mining and analytics operations on real data sets", "design a denormalized schema for a NoSQL database", "September 4-10 intro, relational model SSH, mysql command line tool     first week of classes", "September 11-17 relational algebra, SQL relational algebra", "October 2-8 normalization normal forms and normalization", "Exams", "A make-up final exam, if offered by the instructor, may be scheduled in a future academic term.", "The instructor will not offer a make-up midterm, and will instead consider shifting the weight of a missed midterm towards the final exam.", "Members of the teaching team may also evaluate students' proficiency in the use of software in connection with lab work.", "If a student's solution differs substantially from the solution recognized by the teaching team, the student may be asked to provide sample inputs and outputs to evaluate the correctness of their solution.", "Collaboration", "Exams may cover both theory and practice, including your ability to read and write SQL code.", "Notice of Recording"]}, {"course_id": 47, "course_code": "ECE 358", "course_name": "ECE358 - Computer Networks (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 358", "10:00AM - 11:20AM E7 4417", "Email", "Prof. Catherine Rosenberg", "Mike Cooper-Stachowsky", "Substitute Instructor", "Dr. Abdalla Mohamed Hussein", "Maryam Amini", "maryam.amini@uwaterloo.ca", "yuan.quan@uwaterloo.ca", "Mohammad Abuyaghi", "This course is a comprehensive introduction to computer networks.", "View requirements for ECE 358", "Revised Description: This course is a comprehensive introduction to computer networks.", "The lower-level outcomes are:", "Have a good understanding of protocols and networking design concepts.", "Have a working knowledge of socket programming.", "Have a working knowledge of transport protocols with a special emphasis on TCP and retransmission protocols.", "Example of LAN technologies: Ethernet and switches.", "Synthesis: a day in the life of a web request", "LAB1: Development of a simulator of a single transmission system.", "Examination", "If you miss the midterm without a valid reason, that midterm earns a score of zero.", "Lab marking and reports submissions", "Instructions for how to package your files and submit are in the lab manuals."]}, {"course_id": 48, "course_code": "ECE 406", "course_name": "ECE406 - Algorithm Design and Analysis (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Algorithm Design and Analysis Winter 2025", "ECE 406", "ECE 406 001", "11:30AM -", "E. Creager", "04:00PM - 05:20PM", "E. Creager", "04:00PM - 05:20PM", "• Rushabh Solanki", "ECE 406:", "Design and analysis of efficient, correct algorithms.", "Advanced data structures, divide-and-conquer algorithms, recurrences, greedy algorithms, dynamic programming, graph algorithms, search and backtrack, inherently hard and unsolvable problems, approximation and randomized algorithms, and amortized analysis.", "View requirements for ECE 406", "How to design efficient algorithms using divide and conquer, greedy algorithms, and dynamic programming.", "The kinds of problems that can be solved with linear programming, and why they can be solved efficiently.", "What it means to reduce one problem to another, and how it used in complexity analysis", "Introduction to algorithms Chapter 0 0.5 hours", "Divide and conquer algorithms Chapter 2 5 hours", "Graphs, decompositions and depth-first search Chapter 3 3 hours", "Linear Programming: Simplex algorithm, duality theorem Chapter 7 4 hours", "No lectures during ECE midterms week (Feb 24--28)", "LEC001] Tue 2:30--3:30pm in E7-5353", "Assignments Information and Guidelines: Assignments are given roughly every other week, and their primary goal is to give you practice in designing and analyzing algorithms.", "You must list these collaborators at the top of the first page of your assignment (there is no penalty for listing collaborators, but it ensures we do not falsely identify plagiarism).", "In submitting an assignment, you are “signing off on your work” as described in the academic integrity form at https://uwaterloo.ca/academic-integrity/. The penalty for a first plagiarism offence is -100% for the assignment.", "* Each student must turn in a signed academic integrity form to confirm their understanding of the above policies.", "Notice of Recording"]}, {"course_id": 49, "course_code": "ECE 457B", "course_name": "ECE457B - Fundamentals of Computational Intelligence (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Fundamentals of Computational Intelligence Winter 2025", "ECE 457B", "Monday, Friday -", "10:00AM - 11:20AM E7 5353", "04:00PM - 05:20PM", "Da Saem Lee : ds3lee@uwaterloo.ca", "Communication and Discussion", "If you really have a critical time issue, or you don't want the TA's to see the message (for any reason at all), then you should send Prof. Crowley a direct message on Teams chat in addition to email.", "Model-based prediction and classification.", "Multiple examples and case studies such as autonomous driving, intelligent manufacturing, natural language understanding, speech recognition, computer vision, stock market prediction, disease early detection and diagnosis.", "View requirements for ECE 457B", "It encompasses a broad spectrum of supervised learning topics, including nonparametric and parametric models, linear and nonlinear approaches, deep learning paradigms, and probabilistic models.", "Theoretical knowledge is translated into practice through tutorials on industry-standard tools such as PyTorch and Keras.", "Interactive classroom discussions will pivot around both the practical trade- offs inherent in real-world applications and the theoretical underpinnings that provide an intuitive grasp of the field.", "These topics are an outline, and each year some subset of non-core topics will be skipped due to time constraints and in order to benefit students through deeper focus.", "Classification I", "Distance based - k-Nearest Neighbours (kNN)", "Fundamentals of Parameter Estimation and Learning", "MAP Implementation as Classification: Naive Bayes Algorithm", "Dimensionality Reduction and Manifold Learning", "Vector Embeddings : TF-IDF, Word2Vec, BERT", "Kernel Methods and Latent Models", "k-Means Algorithm, DBScan Algorithm", "Anomaly Detection: Classification, Outlier, Density, and Isolation based", "Classification III : Data, Image and Time-series classification using Deep Learning", "Representation Learning II: Auto-encoders and Variational Auto-Encoders", "Attention and Transformer Networks", "Some additional information and links might be here for older courses.", "A visual grading tool for pdfs submissions of tests and assignments, allows limited online test with mark-down text entry and multiple choice questions.", "Some assignments and tests might be made available online for submission using this tool as well.", "Arxiv Tutorials - pdfs will be posted to hypothes.is and others links will be provided to a number of detailed tutorials on some course topics.", "The first half covers many of basics of this course, while the second half focusses on Deep Learning only.", "Exams", "Completing the assignments will require multiple skills:", "familiarity with statistical, probabilistic analysis of data and results", "logical design and clear description of a expeirmental methodology", "programming various algorithms for processing, training and analysis of data to achieve given tasks (programming will be in Python using libraries such as sci-kit learn and tensorflow, pytorch, pandas)", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 50, "course_code": "ECE 459", "course_name": "ECE459 - Programming for Performance (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 459", "Monday, Friday -", "08:30AM - 09:50AM E7 5353", "04:00PM - 05:20PM", "Monday, Friday -", "04:00PM - 05:20PM", "11:30AM -", "07:00PM - 07:50PM E7 5353", "07:00PM - 07:50PM E7 5353", "About Prof. Zarnett", "Then I got the AIF in the mail and decided I didn't want to study Computer Engineering after all.", "I'm an Associate Professor of Electrical and Computer Engineering.", "Some of you will know me as the previous Director of Software Engineering from back when you were in 1A. I studied math/CS yet convinced PEO to license me as a P.Eng.", "My research interests focus on using compiler and static analysis techniques to ensure program correctness.", "The LI is responsible for technical matters related to the assignments: git.uwaterloo.ca, git in general, administering the systems where you need to run your labs.", "And I enjoy engaging in discussions about these fields.", "Thanushon Sivakaran <tsivakar@uwaterloo.ca>", "Profiling computer systems; bottlenecks, Amdahl's law.", "View requirements for ECE 459", "Many modern software systems must process large amounts of data, either in the form of huge data sets or vast numbers of (concurrent) transactions.", "This course introduces students to techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs.", "These techniques will enable you to design and build critical software infrastructure, especially in an age of Big Data.", "While you may have seen some of these ideas in the context of operating systems (ECE350/SE350/CS350/MTE241) and concurrency (ECE252/CS343), this course gives you tools to make code run faster.", "Design and apply techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs.", "We intend to use these slots until we reach the end of the course material.", "The notes cite a number of sources, some of which are useful books.", "Rust familiarization and use of nonblocking I/O;", "Auto‐grading and auto‐feedback systems, including marmoset, may be used for the evaluation of some of your assignments.", "Acceptable collaboration includes discussing ideas and structures with others, as well as helping others debug their code.", "If your code is too close in structure to someone else's code, you are going to have a problem.", "Or, let's sum this up in two short instructions:", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, ChatGPT) and how such tools can be used to write and test code.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be diﬃcult to interpret on a discussion forum.", "The human visual system has evolved to perceive saber‐toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text‐mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 52, "course_code": "PLAN 478", "course_name": "PLAN478 - Transit Planning and Operations (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Transit Planning and Operations Winter 2025", "08:30AM - 09:50AM RCH 103", "02:30PM - 03:20PM", "The historical evolution of transit in cities; the technological innovations which made transit possible; and transit mode definitions.", "System operational characteristics are defined and quantitative measures of effectiveness are introduced.", "Methods for selecting appropriate transit modes are covered.", "The focus of this course is on the use of quantitative techniques to analyse and solve problems arising in the planning, design, operation and management of urban public transportation systems.", "Topics include an introduction to public transportation modes, transit performance analysis, fleet sizing and route design; control of transit operations, and paratransit planning, scheduling and dispatching.", "The course also covers various transit modelling issues arising in the Advanced Public Transportation Systems that aim at maximising transit system efficiency and reliability using emerging technologies such as global positioning systems (GPS), electronic fare payment, and automatic passenger counters and pre-trip/en-route passenger information systems.", "The historical evolution of transit in cities; the technological innovations which made transit possible; and transit mode definitions.", "System operational characteristics are defined and quantitative measures of effectiveness are introduced.", "Methods for selecting appropriate transit modes are covered.*eligible for MES", "Classify urban transportation modes by right of way, technology, and service types", "Compute and graph quantitative relationships, including vehicle dynamics and time-space diagrams", "Determine fleet size requirements and schedules for a given route/line or a set of routes/lines", "Understand the range of approaches for estimating transit ridership", "Select the optimal mode for a transportation route based on vehicle characteristics, planning contexts, travel forecasts, and economic factors", "Design a basic transit network with efficient transfers and schedules", "Introduction and History of Public Transit", "Transportation and Transit Planning", "Travel Demand Modeling", "Transit System Characteristics and Performance", "Scheduling", "Network Structures", "Transit System Financing", "The Future of Public Transit", "Submission requirements will be specified for each assignment.", "This course includes the independent development and practice of specific skills, such as evaluating transit data, planning transit routes, and estimating transit ridership.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 53, "course_code": "ME 321", "course_name": "ME321 - Dynamics of Machines and Mechanical Vibrations (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Dynamics of Machines and Mechanical Vibrations Winter 2025", "10:00AM - 11:20AM E7 3343", "E5 3102", "I highly encourage the students to meet with Farid first for their questions.", "Principles of the geometry of motion, uniform and non-uniform motion, linkage, and analysis of mechanisms.", "Consideration of the static and dynamic forces in machines.", "We will study single-degree-of-freedom systems, multiple-degree-of-freedom (lumped mass) systems, and modal analysis for vibration problems in the first part of the course.", "The first part of the course heavily depends on your previous courses in Dynamics, Differential Equations and Linear Algebra.", "You are expected to know/learn MATLAB and Linear Algebra very well.", "This course is very mathematical, but we also discuss some real-life examples of dynamic systems.", "Concepts of degrees of freedom and inversion mechanisms will be discussed.", "Finally, different kinds of gears and the fundamental law of toothed gearing will be discussed.", "Identify different types of mechanisms and their degrees of freedom", "Develop Equations of Motion for linkage mechanisms", "Quantify kinematics and kinetics parameters such as position, velocity, acceleration, force, and momentum for the points in linkage mechanisms", "Identify the geometry of different types of gears", "Formulate the eigenvalue problems and obtain solutions for eigenvalues and eigenvectors for the coupled 2-degree-of-freedom mechanisms", "Obtain solutions to the Ordinary Differential Equations subject to Initial Conditions (I.C.) and harmonic force excitations", "Understand and analyze the concepts of stability in a vibrating system", "Chapters 1.1, 1.2", "Introduction to Vibrations", "Free Response of a Single Degree of Freedom System (SDOF)", "Chapters 1.2 Natural Frequency and Oscillation Period", "Chapters 1.3 Viscous Damping", "- Stability", "Chapters 2.1, 2.2 Forced Response of a SDOF (Harmonic Excitation) Frequency Response Function (FRF)", "Chapters 2.1 Beat Phenomenon", "Chapters 4.1 Vibrations Equations of Motion for Multiple Degree of Freedom Systems (MDOF), 2-DOF", "Chapters 4.1 Modeshapes and Natural Frequencies of MDOF", "Chapters 4.2", "Introduction to Matrix Theory", "Stability of MDOF Systems", "- Singularity and Rigid Body Mode", "-", "Orthogonality of EigenVectors", "Examples", "Makeup lecture #2 at 8:30-9:20 AM in E7 3343", "Chapters 4.3", "Modal Analysis of MDOF", "Decoupled Coordinate Systems", "Chapters 4.5 Viscous Damping in MDOF", "Chapters 4.5, 4.6", "- Frequency Response Functions for MDOF", "- Frequency Response Functions for MDOF", "Makeup lecture #3 at 9:30-10:20 AM in E7 3343", "Introduction to Machines and Mechanisms", "Chapters 1.6", "Introduction to Machines and Mechanisms (Cont’d.)", "Inversion", "Chapters 1.7.1 Grashof condition", "Chapters 4.1, 4.2", "Analytical Kinematic Analysis of Planar Mechanisms", "Chapters 4.3", "Analytical Kinematic Analysis of Mechanisms (Cont’d.)", "One-loop mechanisms", "Chapters 9.1, 9.2, 9.3", "Analytical Kinetic Analysis of Mechanisms", "Chapters 9.1, 9.2, 9.3", "Analytical Kinetic Analysis of Mechanisms (Cont’d.)", "Chapters 5.1, 5.2", "Chapters 5.3, 5.4", "January 17th: Makeup lecture #1 at 9:30-10:20 AM to be held in E7 3343", "February 7th: Makeup lecture #2 at 8:30-9:20 AM to be held in E5 3343", "March 7th: Makeup lecture #3 at 9:30-10:20 AM to be held in E5 3343", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 54, "course_code": "ME 574", "course_name": "ME574 - Engineering Biomechanics (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Biomechanics Winter 2025", "02:30PM - 05:20PM", "RCH 301", "Introduction to engineering technologies applicable to the field of biomechanics.", "Specific topics covered may include biological growth, form and function; biomaterials; kinematics and neurology of gait; biotribology; joint anatomy, function and repair; occupational biomechanics; trauma prevention.", "The course will provide a general overview of engineering biomechanics for civil, mechanical and biomedical engineering students.", "2. Conduct gait analysis and calculate forces applied at joints and foot reactions", "Introduction", "Evolution of Biomechanics", "Applications (medical and engineering)", "Musculoskeletal System", "Introduction,", "Anatomical positions & movements,", "System components,", "Gait Biomechanics", "Introduction;", "Muscles forces,", "Bone & Cartilage Biomechanics", "Introduction (highlights & progress),", "Bone mechanical properties & applications;", "Cartilage structure and mechanics", "Tendon & Ligament biomechanics", "Mechanical behaviour", "Biotribology & Joint Replacement", "Biotribology subfields,", "Cancer Biomechanics", "Introduction: cancer stages,", "Mechanical characteristics of cancer cells,", "Biomechanics and cancer treatment,", "Cardiovascular biomechanics, and", "Biomechanics in Radiotherapy", "“Orthopaedic Biomechanics: Mechanics and Design in Musculoskeletal Systems,” Pearson Prentice Hall.", "Biomechanics and motor control of human movement.", "Biomechanics and motor contAl-Mayah, A. (Ed.)"]}, {"course_id": 55, "course_code": "MSE 343", "course_name": "MSE343 - Human-Computer Interaction (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Human-Computer Interaction Fall 2024", "10:00AM - 11:20AM QNC 2502", "10:00AM - 11:20AM QNC 2502", "11:30AM - 12:20PM QNC 2502", "This course is designed to provide in-depth exposure to the concepts of human-computer interaction and methods of interactive information system design.", "The course will focus on techniques for building information systems that meet human needs and capabilities by following a system development lifecycle: user requirements analysis, information and interaction design, prototyping and evaluation.", "View requirements for MSE 343", "Explain and justify the benefits and drawbacks of user-centred design", "Describe guidelines and models that can be applied to interface design", "Apply a variety of methods to involve the people who use an application in the design process", "Evaluate the usability of an interface", "Explain and justify the benefits and drawbacks of user-centred design 1 KB c) Demonstrate understanding of engineering fundamentals.", "Describe guidelines and models that can be applied to interface design 1 KB d) Demonstrate understanding of specialized engineering knowledge", "Apply a variety of methods to involve the people who use an application in the design process 4 Des b) Generate and implement solutions to complex open-ended problems", "Evaluate the usability of an interface 4 Des c) Evaluate/test solutions and refine designs to better meet requirements", "Process and Requirements", "Introduction to HCI Chapters 1 & 9", "User-centred design Course Notes", "Gathering Requirements and Task-centred design Chapter 10", "Designing Alternatives + Prototyping", "Interface Types & Graphical screen design Chapter 6", "Evaluate", "Evaluating Interfaces with Users: Qualitative Methods Chapters 13 & 7", "Analytical Evaluation: Heuristic Evaluation & Fitts’ Law Chapter 15", "Social & Emotional Interaction Chapter 4 & 5", "Psychology of everyday things & Cognition Chapter 3 & Notes", "Interaction Design: Beyond human computer interaction, 4th edition.", "You will be working in a team of three to five for all these milestones.", "There will be a set of online and in-person activities taking the place of the lab session in this course.", "You can complete these by simply attending class and participating in the activities; there will be a time limit to submit your materials.", "Up until the date of the final exam, you may submit any submitted material for regrading under the following conditions:", "(Ask them first!)", "Extensions", "No extensions will be given after a submission date.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 56, "course_code": "MSE 432", "course_name": "MSE432 - Production and Service Operations Management (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Production and Service Operations Management Winter 2025", "Introduction to management, planning, and control decisions in manufacturing and service settings using quantitative approaches.", "Students are exposed to a number of examples and case studies, and work on a project that involves analysis and discussion of improved designs.", "Develop understanding of the impact of services and production operations in organizations [PA]", "Employ decision-making tools used by operations managers [", "Impact]", "Introduction to OM and Demand Forecasting (I)", "Demand Forecasting (II) and Product Design", "Capacity Planning and Process Design/Facility Layout", "Chapters 11", "Aggregate Operation Planning", "Just-in-Time Production and Project Management", "Demand Forecasting", "Capacity Planning and Process Design/Facility Layout", "Aggregate Operations Planning", "JIT & Project Management"]}, {"course_id": 57, "course_code": "MSE 446", "course_name": "MSE446 - Introduction to Machine Learning (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Machine Learning Winter 2025", "04:00PM - 05:20PM", "Topics covered may include data cleaning and transformation, overfitting and generalization, n-fold cross validation, regression, decision trees, neural networks, rule finding, and clustering.", "View requirements for MSE 446", "Problem Analysis]", "Jan. 6   Introduction", "Mar. 31   Advanced topics", "Apr. 2   Advanced topics", "https://web.stanford.edu/~jurafsky/slp3/ Includes language models No 0", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 58, "course_code": "MSE 555", "course_name": "MSE555 - Scheduling: Theory and Practice (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["11:30AM -", "Students will be introduced to the theoretical background in these areas, but the emphasis will be placed on modelling and solving scheduling problems in practice.", "Students will apply these concepts in design activities in assignments and a course project.", "In this course, we look at practical scheduling problems, solution techniques, and algorithms in both manufacturing and service industries.", "We apply our knowledge to investigate one case study concerning real world scheduling problems and learn from one guest speaker who discusses interesting scheduling challenges and opportunities.", "Modeling and solving scheduling problems", "Analyzing scheduling related data and deriving insights into the problem", "Understanding the main challenges in real world scheduling problems", "Submit", "Introduction", "Administration", "Introduction: Scheduling Problems", "4.4", "4.4", "Dispatch Rules and Shifting Bottleneck", "Solution Techniques", "Introduction to Service Scheduling", "Workforce Scheduling", "Queueing & Scheduling", "Queueing & Scheduling (continue …)", "Queueing & Scheduling (continue …)", "TBA", "“Planning and Scheduling in Manufacturing and Services,” Michael L. Pinedo (Springer).", "Total"]}, {"course_id": 59, "course_code": "MTE 241", "course_name": "MTE241 - Introduction to Computer Structures and Real-Time Systems (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Computer Structures and Real-Time Systems Fall 2024", "08:30AM - 09:20AM E7 3343", "08:30AM - 10:20AM E7 3343", "M. Cooper-Stachowsky", "MTE 241 202", "M. Cooper-Stachowsky", "M. Cooper-Stachowsky", "11:30AM -", "12:20PM E7 3343", "All software and also the law and ethics course one time -- let's discuss contract law if you're up for it?", "Mike Cooper-Stachowsky -- mstachowsky@uwaterloo.ca", "Introduction to computer organization, basic real-time concepts, process management, interprocess communication and synchronization, memory management, resource management, interrupt handling, concurrent programming, file systems.", "View requirements for MTE 241", "Describe the basic components of a computer system [KB(I)]*", "Perform Memory-Mapped I/O [KB(D)]", "Program a real-time application with multiple coordinated tasks [Des(D),Tools(D)]", "STM32F401RE Nucleo Board A microcontroller board for the labs.", "A Practical Introduction to Real-Time Systems For Undergraduate Engineering It's the textbook, available free in PDF form: https://ece.uwaterloo.ca/~dwharder/icsrts/Lecture_materials/A_practical_introduction_to_real-time_systems_for_undergraduate_engineering.pdf No", "Available for free in PDF form: https://github.com/jzarnett/mte241/ Yes", "You should purchase this board well in advance of the first lab and install the STM32CubeIDE software to test that it works.", "A small number of lab computers will have the software installed for your use.", "You will use the STM32F401RE microcontroller board and the STM32CubeIDE to write a real-time operating system in the C language.", "The questions are designed to test your understanding of the concepts you should have learned in the lab.", "Exams are in-person, closed-book.", "This paper must be a standard letter size.", "Laptop and Device Policy: The human visual system has evolved to perceive saber-toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text-mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "In either case, we will cancel all the in-person lectures and in-class exercises during the relevant period and try to have some online synchronous video lectures during that period.", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, Chat- GPT) and how such tools can be used to write and test code.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 60, "course_code": "MTE 325", "course_name": "MTE325 - Microprocessor Systems and Interfacing for Mechatronics Engineering (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Microprocessor Systems and Interfacing for Mechatronics Engineering Winter 2025", "03:30PM - 04:20PM", "E5 3102", "01:30PM - 04:20PM E3 3155", "01:30PM - 04:20PM E3 3155", "01:30PM - 04:20PM E3 3155", "book a meeting", "E7-3412", "Synchronization and data flow; interfacing to sensors and actuators;", "parallel, serial, and analog interfacing; buses; direct memory access (DMA); interfacing considerations; privacy and security considerations.", "View requirements for MTE 325", "Summarize the flow of data between software and hardware elements in an embedded system", "Describe the trade-offs between implementation alternatives for both hardware and software", "Outline the ethical implications of embedded system design choices", "Use industry-standard tools to implement and debug embedded systems", "Design an embedded system to perform a given task", "Projects provide students with an opportunity to explore selected concepts in a real-world context.", "Lectures and tutorials are held in person and attendance is expected at all sessions for learning and skill development.", "Jan 20th and Jan 22nd  Lab 1 – Introduction and setup (watch Learn for signup instructions closer to)", "Lab 2 – Synchronization Techniques", "Course Introduction An introduction to the teaching team, course expectations, deliverables, marking scheme, and a very brief introduction to interfacing concepts.", "Embedded Systems A review of fundamentals of embedded systems and the terminology associated with embedded systems.", "Embedded Design Model An introduction to the embedded design model used to develop a system for the remainder of the course.", "Embedded Software An overview of they key differences between software for embedded systems and general software development.", "Synchronization, Data Generation and Data Transfer A model for analyzing synchronization behaviour and performance and examples of synchronization analysis.", "Buses - Data Transfer A comparison of the functional behaviour and timing behaviour of synchronous, asynchronous, and partially interlocked asynchronous.", "Parallel Interfacing A detailed examination of the design of parallel interfaces.", "This includes an examination of the role of the interface in matching bus timing and signaling characteristics with a device's timing and signaling characteristics.", "Analog Interfacing An introduction to digital-to-analog interfacing, analog-to-digital interfacing, and sample-and-hold circuitry.", "This includes a comparison of asynchronous communication techniques and synchronous techniques as well as the protocols for serial communication.", "Buses - Arbitration A brief examination of alternatives for bus arbitration including a discussion of the operation and characteristics of daisy chained and non-daisy chained bus arbitration techniques.", "A brief examination of direct memory access including a discussion of hardware design implications, software implications, and system performance.", "Security and Ethics An overview of common security terminology and why it has become increasingly important for embedded systems.", "The ethical implications of today’s embedded systems applications will also be discussed.", "Other References", "Supplementary readings are available for most chapters on Learn No $0.00", "You are encouraged to subscribe in order to receive email copies of announcements.", "The LEARN calendar has been setup to specify reminders of important dates for the course.", "The Project module contains a description of the projects as well as files and resources that may be useful in completing the projects.", "You may use these exams to assess your preparation for the exams in the course.", "Your project average includes your grades for all project demonstrations and submissions.", "Students will need to make design decisions and use the resources that are typically available for a particular embedded system application.", "The purpose of this project is to provide practice with applications of course concepts and experience tackling an open-ended interfacing problem in preparation for their 3rd and 4th year design projects.", "Demonstration-based deliverables Can be completed anytime during lab sessions 3-6 19", "Submission-based deliverables Last day of class, 8:00 pm 5", "University of Waterloo Verification of Illness forms and self-declared absences will be taken into consideration only for the student to whom it applies, if appropriate.", "Notes for Students Repeating the Course", "Do I have to do the project again?", "Can I reuse material from previous submissions?", "It would also be helpful if you provided comments such as \"In the previous submission, concerns were expressed related to the definition of maximum stable frequency.", "Exams", "***Any guidelines UW releases on verification and declaration of illness for the term, will supersede the instructions given here***", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 61, "course_code": "MTE 544", "course_name": "MTE544 - Autonomous Mobile Robots (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "yue.hu@uwaterloo.ca", "11:30AM - 12:20PM E5 3102", "E3 3178", "yue.hu@uwaterloo.ca", "E3 3178", "yue.hu@uwaterloo.ca", "E3 3178", "yue.hu@uwaterloo.ca", "08:30AM - 11:20AM E3 3178", "yue.hu@uwaterloo.ca", "Location: E5 - 3102", "Fundamentals of autonomous mobile robotics, including both perception and planning for autonomous operation, sensor modelling, vehicle state estimation using Bayes Filters, Kalman Filters, and Particle Filters as well as onboard localization and mapping.", "Topics in planning include vehicle motion modelling and control, as well as graph based and probabilistic motion planning of (Micro Electro Mechanical Systems) MEMS devices.", "This course covers four fundamental topics of Autonomous Mobile Robotics; 1) modeling, 2) sensors and perception, 3) estimation (localization and mapping), 4) planning and navigation.", "Modeling covers kinematic models of various types of wheeled mobile robots.", "Sensors include various types and algorithms (for vision and range sensors).", "Estimation includes Bayesian estimation theory and its application to localization (and/or mapping).", "Topics in Planning include odometry motion models and graph-based and probabilistic motion planning as well as obstacle avoidance (reaction-based) methods.", "Discussions and questions - Piazza", "Sign-up link: https://piazza.com/uwaterloo.ca/fall2024/mte544, Access code: MTE544FALL2024.", "We have a few desktop computers (number subject to change depending on working conditions of the computers) that can be accessed remotely.", "User accounts are given on a per-request basis.", "A booking system will be set up for those choosing to use this solution.", "We have a total of 15 laptops (number subject to change depending on working conditions of laptops) that students can lend on a first-come-first-served basis.", "The lending time must not exceed one week each time.", "Develop kinematic models and controls for autonomous robots.", "Apply motion and measurement models to a variety of vehicles and sensors.", "Apply localization/mapping algorithms for perception within environments.", "Create collision free paths through environments based on maps.", "9/4 Course logistics and introduction", "9/4", "9/11 Kinematic models: 4 wheels, holonomic and omniwheel", "9/18 Introduction to sensors, Inertial sensors, Position Sensors", "9/24 Introduction to odometry, Range sensors (line-fit and RANSAC)", "-", "9/25", "10/1 Vision sensors and basics of image processing", "10/8 Introduction to localization, Discrete motion model", "10/29 Probabilistic Motion Model and Velocity Motion Model", "10/30 Probabilistic Measurement Model and Likelihood Field Model", "11/12 Introduction to planning, graph-based methods, Dijkstra", "11/13 A*, D*, introduction to random methods", "11/20 RRT*, Potential Field", "11/27 Explanation of take-home exam & course summary", "Fr1 Section: Friday 8:30-11:20 AM", "There will be a total of 4 in-person Lab sessions, taking place in E3-3178, in-person attendance is compulsory.", "If you need to switch to a different section, you need to inform the instructor and the TAs for the arrangement with one week notice (accommodations for late notices are allowed on a case-by-case evaluation basis).", "Lab#2 – Control the robot to follow a trajectory using a closed-loop controller.", "Lab#3 – Estimation and mapping: estimate robot motion from sensor data utilizing filters.", "The in-person lab is not meant for implementation but for testing and getting help from the TAs.", "Fail to submit a completed code will result in penalty on the lab report.", "Each member must demonstrate to have equally contributed to the report.", "Submit the report with a final version of your code, and attach a list of modifications made between the first version and the final version.", "About 2 weeks’ time will be given to complete each assignment.", "Notice of Recording", "In case of shutdown of in-person activities, the following arrangements will take place:", "This course includes the independent development and practice of specific skills, such as implementation of theory into practice (e.g. algorithms into code), knowledge of the mathematical models and algorithms, and being able to develop independent solutions for mobile robotics.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 63, "course_code": "SYDE 334", "course_name": "SYDE334 - Applied Statistics (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Applied Linear Models Winter 2025", "08:30AM - 09:50AM MC 4020", "02:30PM - 03:20PM", "RCH 101", "Thursdays from 3:00-4:00pm in M3 3021", "Modelling the relationship between a response variable and several explanatory variables (an output-input system) via regression models.", "Model diagnostics and improvement.", "Algorithms for variable selection.", "Review of basic Normal theory, t, chi-squared, and F distributions.", "Simple linear regression.", "Analysis of variance.", "Multiple linear regression, variable selection techniques, indicator variables, diagnostics.", "Brief introduction to non-linear regression, factorial experimentation.", "Registered students can enroll in the class discussion board through Piazza.", "Search for your question first before posting.", "Do not expect a full solution to your question.", "To help maintain a safe, respectful, and productive community in which we – students and teaching team alike – can take risks in our learning/teaching, tackle challenging concepts, and ultimately grow as learners, we should endeavor to follow these mutual expectations:", "Explain the main concepts of linear regression models.", "Understand the methods of least squares and maximum likelihood estimation for model parameters.", "Interpret the model and its parameters (e.g., regression coefficients) in the context of any application.", "Draw inferences from a fitted model about the parameters of interest and make predictions.", "Apply the previous two outcomes when fitting linear models to real data using R.", "Assess model quality by diagnosing violations in underlying model assumptions (and identify strategies for improvement).", "Evaluate competing fitted models built using various model selection methods (and choose between them).", "Introduction", "The Straight Line Model", "Model formulation and interpretation", "Least squares estimation", "Mean response and residual variance estimation", "Introduction to R/RStudio", "Maximum likelihood estimation", "Estimators and their properties", "Important distributions", "Distributions of estimators", "Confidence intervals", "O - Ch. 2-4", "Straight Line Model in R", "Prediction intervals", "Intervals in R", "Hypothesis testing", "O - Ch. 4-5", "ANOVA and F test", "Model limits", "Data transformations", "O - Ch. 4-6", "O - Ch. 7", "A1 and Q1 Solutions", "Multivariate normal distribution", "The Linear Model", "Examples", "O - Ch. 8-9", "Estimation", "Estimators and their properties", "Distributions of estimators", "O - Ch. 9, 11, 12", "ANOVA and F test", "Significance tests", "General linear hypothesis", "O - Ch. 9, 11, 12", "A2 and Midterm Solutions", "Case Study: South African heart disease", "Nested models", "Additional sum of squares", "O - Ch. 12", "Outliers", "O - Ch. 13-14", "Influence", "O - Ch. 14-15", "A3 and Q2 Solutions", "One-variable-at-a-time selection methods", "Criteria-based selection methods", "O - Ch. 16", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solve exercises from the textbook on your own.", "Introduction to Regression Modeling by Abraham and Ledolter This textbook is an optional reference book (available for free on LEARN).", "R and R-Studio Free software.", "To serve as an opportunity to demonstrate your understanding, application, and integration of the course material, including practical application of the skills/concepts with the statistical software, R.", "Missed Assignment: The time window to complete these assessments are generous and, in general, a sickness lasting a couple of days will not be enough of a reason to ask for alternative accommodations and/or extension.", "Tips for Success", "Students should critically compare their work with available solutions and against the solutions of fellow classmates.", "Notice of Recording", "To help you decide if you should isolate, you can use the provincial self-assessment tool.", "In the scenario where we must transition back online the following contingencies will be used:", "These materials are made available for the personal use of students registered in the current offering of this course.", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical proofs and the fitting, interpretation, and assessment of linear models in real applications.", "Library for research-based assignments"]}, {"course_id": 64, "course_code": "SYDE 522", "course_name": "SYDE522 - Foundations of Artificial Intelligence (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["The objective of this course is to introduce students to fundamental concepts of artificial intelligence.", "Understand the basic concepts in Artificial Intelligence (CEAB requirements: 1d)", "Discuss how basic concepts lead to modern AI systems (CEAB requirements: 1d)", "Integrate ethical considerations when using AI (CEAB requirements: 10)", "Instruction", "Course slides and code notebooks will be posted on LEARN.", "W Sept 4 Introduction and Definitions", "M Sept 9 Perceptrons and Delta Rule", "M Sept 16 Evaluation Metrics and Experimental Validation", "M Sept 23 Linear SVMs", "M Nov 25  Extra Topics: Genetic Algorithms", "Late policy: If students have reasons for an assignment to be submitted late, they need to contact the instructor and accommodations can be made on a case-by-case basis.", "Course and Departmental Expectations", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.", "A.A.S. also offers learning strategy supports to all students that can be accessed through:"]}, {"course_id": 66, "course_code": "SYDE 532", "course_name": "SYDE532 - Introduction to Complex Systems (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Introduction to Complex Systems Winter 2025", "10:00AM - 10:50AM E5 6008", "Professor Paul Fieguth pfieguth@uwaterloo.ca Office Hours: Mondays 4-5pm in E7-6338", "The overwhelming majority of societal, ecological and climate issues of pressing importance are complex systems; nonlinear dynamic interacting systems poorly characterized by linear analyses and Gaussian statistics.", "This course introduces the mathematics needed to understand such interactions, including nonlinear dynamics, critical and bifurcation behaviours, large-scale systems and power-law distributions.", "The mathematical methods will be motivated by extensive examples and case studies such as global warming, energy shortages, desertification, overpopulation, poverty, and economic instability, to be investigated from a systems engineering perspective that will connect mathematical concepts to real-world examples.", "Understand the assumptions and limitations behind linear dynamic / Gaussian systems", "Understand the mathematical properties of nonlinear dynamic / power-law systems", "Be able to abstract / generalize the impacts and implications of nonlinear systems", "Be able to draw connections between macroscopic socio-environmental systems", "Mathematics and Modeling", "The Science of the Physical World", "3. Earth Monitoring and Inverse Systems", "An Introduction to Complex Systems (2nd ed) Springer Verlag, 2021 Yes $0", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 68, "course_code": "SYDE 542", "course_name": "SYDE542 - Interface Design (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Interface Design Winter 2025", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "Email: c2murad@uwaterloo.ca", "Wendy Ding", "Email: wendy.ding@uwaterloo.ca", "Email: s2marash@uwaterloo.ca", "This course focuses on the design of computer interfaces for simple to complex systems.", "Main topics include forms of visual display; auditory display and soft controls; context, navigation, and layout; development techniques; design for engagement.", "The intent of this course is to give you hands-on experience with some of the current popular techniques, design and research issues in user interface design.", "The emphasis is on learning a systematic design process, advanced knowledge elicitation techniques, and objective evaluation techniques and demonstrating competency in these areas.", "Learn the foundations of how humans interact with technology and how technology supports human-to-human communication", "Learn what makes interactive systems user-friendly", "Learn about designing digital technologies that mediate human communications", "Learn about evaluating interactive systems", "Demonstrate competency in Interface Design methods such as User Observations, Surveying/Interviewing, Data Analysis, Wireframing, Storyboarding, Prototyping, User Requirements Elicitation Techniques, User Modeling Techniques (Personas, Task Analysis), User Testing", "Jan 6                              Introduction", "Jan 13 User Observations & Affinity Diagramming", "A1: Observation and Ideation [", "Jan 20 Design Principles", "Feb 3 User Requirements & Design Recommendations", "Feb 10 Design of Interfaces; Ethics A3: Preliminary user observations, requirement gathering, design proposal", "Feb 25 Concepts of Visual Design", "First low-fi prototype, heuristic evaluation, and functionality freeze", "Interaction Design: Beyond Human - Computer Interaction (3rd, 4th, or 5th edition) (Yvonne Rogers, Helen Sharp, Jenny Preece) No $73", "Almost every week there will be time reserved for in-depth discussions, student presentations, development/design activities, design critiques, and studio-based participation and user trials.", "Attendance and presentation of designs for critique during the practical is expected.", "Teams are required to share workloads equally and fairly – their contributions will be marked both individually and as a team.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 69, "course_code": "SYDE 543", "course_name": "SYDE543 - Cognitive Ergonomics (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Piazza will be the main platform for Q&A. In case you need to contact the teaching team, make sure to add SYDE 543 to the beginning of the subject line.", "This course focuses on the role engineering psychology research plays in design of the information displays and devices associated with simple and complex cognitive tasks.", "Remember and comprehend important cognitive ergonomic concepts, theories, and principles", "Analyze human information processing constraints and limitations, and use it to identify cognitive ergonomics issues in systems design", "Apply cognitive ergonomics knowledge to produce improved designs considering human cognitive constraints", "Course Introduction", "Human-computer Communication", "Human Errors", "Senses", "Attention and Learning", "Control", "Empirical Evaluation", "Research Methods in Cognitive Ergonomics", "Decision Making", "Decision making and biases", "Working Memory", "Memory and Training", "Situation Awareness", "March 25,28", "Case study presentation", "Case study presentation", "Foundations for designing user-centered systems: What system designers need to know about people.", "Santa Barbara CA: Aegean Publishing Company No 120", "Alternatively, one of the team members can send the email and cc all the other team members.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "You will be clearly directed whether you are allowed to use these methods for each assignment."]}, {"course_id": 70, "course_code": "SYDE 544", "course_name": "SYDE544 - Biomedical Measurement and Signal Processing (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Biomedical Measurement and Signal Processing Winter 2024", "01:30PM - 03:20PM", "steven.pretty@uwaterloo.ca", "Email: spretty@uwaterloo.ca", "Signal processing techniques will be discussed in the context of extraction and application of useful biomedical signals.", "Prereq: One of BIOL 273, BME 284, SYDE 384/584; Level at least 3A Biomedical Engineering or Level at least 3B Systems Design Engineering or Level at least 3B Honours Life Physics (Biophysics Specialization)", "Understand and describe theoretical concepts underlying biomedical signal acquisition and analysis (CEAB 1)", "Solve problems and perform investigations utilizing biomedical signal measurement and analysis approaches (CEAB 2 & 3)", "Work in a team to effectively communicate biomedical signal concepts and applications in both verbal presentations and written reports (CEAB 6 & 7)", "Knowledge Base Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "2. Problem Analysis An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "7. Communication Skills An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Three hours of lectures per week, which will cover the pertinent theoretical concepts and provide solutions to relevant exercises:", "N/A Jan 11th Introduction & Overview", "4 Jan 18th Mathematical Model of a Spiking Neuron", "7 Jan 25th Electrode-Electrolyte Interfaces & Half-Cell Potentials", "8 Jan 25th Electrode-Electrolyte Interfaces & Half-Cell Potentials", "Electrode Model & Electrode-Skin Interface", "Op-Amps & Bio-Potential Amplifier Design", "Op-Amps & Bio-Potential Amplifier Design", "Coupling to the Environment & Electrical Safety", "20 Mar 1st EMG Introduction", "23 Mar 8th EMG Decomposition", "25 Mar 14th Myoelectric Control & Pattern Recognition", "26 Mar 15th EMG Driven Musculoskeletal Modelling", "27 Mar 21st Heart Anatomy and Function", "28 Mar 21st Heart Conduction System and ECG", "Apr 8th Reserved for Make-Up Presentations", "Dayan & Abbott (2001)", "Theoretical Neuroscience", "Clifford (2006) Advanced Methods and Tools for ECG Data Analysis", "Rowan & Tolunsky (2003) Primer of EEG with a Mini-Atlas", "An Introduction to the Event-Related Potential Technique", "These tests will be non-cumulative and assess the following content:", "A help session for each assignment will be scheduled during the tutorial time most closely corresponding with the conclusion of a module.", "Presentations should be ~15 minutes in length followed by up to 5 minutes of discussion.", "Include ‘SYDE544’ and a description of the email in the subject line", "Include your first and last name as well as student number in your signature", "This course includes the independent development and practice of specific skills, such as generating summaries of scientific literature.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 71, "course_code": "SYDE 548", "course_name": "SYDE548 - User Centred Design Methods (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["User Centred Design Methods Winter 2025", "UCD Mentors Pronouns Email Office Extra Help", "This course approaches the design of tasks, tools, products, and systems from a user-centered design perspective.", "Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process.", "Major topics include user research methods for usability and user experience, inspection methods, user testing, applied statistical analysis.", "SYDE 548 (UCD Methods) approaches the design of tasks, tools, products, and systems from a user-centered design perspective.", "Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process.", "Major topics include user research methods for usability and user experience, inspection methods, user testing, and applied statistical analysis.", "SYDE 548 User-Centred Design Methods is a technical elective.", "It builds from earlier SYDE core courses in design (SYDE-BME 161 Introduction to Design, SYDE-BME 162 Human Factors in Design, and SYDE-BME 361 Engineering Design).", "Motivated students willing to become familiar with basic human factors engineering can participate and contribute to course activities.", "Whether you are interested in becoming a UCD specialist, a certified ergonomist, or just want to be a wise designer or consumer, this course will supply you with a range of practical tools (methods).", "Our “In-class” sessions are used as workshops for interactions and hands-on skill development with different UR methods.", "Engineering Graduate Attribute]", "(A) Describe ethical UCD methods used for formal and informal design assessments with human participants.", "(B) Investigate & select appropriate ethical & equitable UCD methods for specific design situations.[2a, 3b, 10b]", "(C) Apply UCD method protocols to instructor-defined design situations.", "(D) Modify UCD method protocols to collect data for a student-defined design project.", "(E) Select and apply appropriate statistical analysis for given UCD data.", "(F) Design ethical UCD test plans for instructor-defined design situations.", "(G) Create User Research Portfolios describing ethical UCD methods, protocols, and lessons learned.", "CEAB Engineering Graduate Attribute", "Knowledge Base for Engineering", "2. Problem Analysis", "Data Analysis Quizzes,", "4. Design", "-", "Impact of Engineering on Society and the Environment", "Ethics & Equity", "Economics & Project Management", "-", "2. Situations of Concern, Design Impacts & Personas Quantifying Usability; Standard UX Questionnaires;", "SUS Scoring (standard and positive versions)", "3. Design Ethnography: UR Safaris & Secondary Research.", "Interviews & Distress Protocols.", "5. Thematic Analysis Methods - Part 1 Thematic Analysis Methods - Part 2", "Formative Design Walkthroughs & Estimating Formative Sample Sizes.", "UR Methods & GenAI Revisited.", "Quantifying the User Experience: Practical statistics for user research.", "An e-copy of the 1st edition can be accessed through UW Library Reserves.", "The User Experience Team of One: A Research and Design Survival Guide. 2nd edition.", "Hanington, B. & Martin, B (2019) Universal Methods of Design (Expanded & Revised): 125 Ways to research complex problems, develop innovative ideas, and design effective solutions.", "An e-copy of the 1st edition can be accessed through UW Library Reserves No", "Design Materials (for workshops, data collection, and analysis).", "The number of students who can access an e-copy at a given time may be limited.", "Since user-centred design and user research skills are valued by industry, it is important that each student submits original work and demonstrates their own value-added UR skills to earn credit for the course.", "Intellectual property includes items such as:"]}, {"course_id": 72, "course_code": "SYDE 552", "course_name": "SYDE552 - Computational Neuroscience (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["SYDE 552 / BIOL 487 - Computational Neuroscience Winter 2025", "04:30PM - 05:20PM E7 4417", "04:30PM - 05:20PM E7 4417", "Instructors Email Meeting Times", "TA Email Meeting Times", "Introduction to modelling and analysis of neurophysiological systems.", "Prerequisites: At least 3B Systems Design Engineering OR at least 3B in the Faculty of Science and one of CS (115, 135, 200) and a 200-level STAT course.", "Course Objectives: There are far more topics in computational neuroscience than can be covered in a single course.", "Throughout the course, we will emphasize the relationship between computational models and biological structure.", "Simulate and manipulate a variety of neuron models, from LIF to Hodgkin-Huxley", "Describe the organization of the primate visual system and compare it to convolutional networks", "Describe the organization of the hippocampus and its role in cognition", "Describe the organization of the basal ganglia and compare it to modern reinforcement learning techniques", "It should be noted that the last hour of the Wednesday session is meant to be a Tutorial, which will be run mostly as a free-form discussion about the topics brought up in the course materials", "Introduction", "Neuron Models", "3. Simple Neuron Models", "Synapses", "Perceptrons and Regression", "Intermediate and High-level Visual Processing", "Backpropagation and Convolutional Neural Networks", "Role in Cognition", "Modelling memory", "Modelling spatial navigation", "Role in Cognition", "Models of BG - Functional", "Models of BG - Anatomical", "Ongoing Research Topics", "• Biophysics of Drugs and Disorders (?)", "MIT Press https://www.deeplearningbook.org/", "Late work may be submitted via email for reduced credit."]}, {"course_id": 74, "course_code": "SYDE 556", "course_name": "SYDE556 - Simulating Neurobiological Systems (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Simulating Neurobiological Systems Fall 2024", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "This course develops and applies a general framework for understanding neural computation in the context of recent advances in theoretical and experimental neuroscience.", "Demonstrate a basic understanding of neural processes, neural mechanisms, theories of neural communication and computation, and theories of neural dynamics.", "Converse at a fundamental level with neuroscientists, psychologists, and neural and cogitive modelers.", "Design and Analyze simple and complex neural circuits for performing small- and large-scale neural computations.", "Apply engineering methods in signal processing, optimization, and control theory, among others, to characterizing and building neural circuits.", "Identify problems and solutions that may exploit the advantages of neural computation in an engineering context.", "Abbreviations", "KB - Knowledge base", "1b: Demonstrate understanding of concepts in natural science", "1c: Demonstrate understanding of engineering fundamentals", "1d: Demonstrate understanding of specialized engineering knowledge", "I - Investigation", "3b: Gather information from relevant sources to address complex engineering problems", "D - Design", "Critically evaluate and compare design choices", "Generate and refine potential solutions to complex, open-ended design problems", "UET - Use of Engineering Tools", "5a Select appropriate engineering tools, considering their limitations", "Sept 25 Chapter 5,6 Feedforward Transformations (I) #2 posted", "5 Sept 30 Chapters 5,6 Feedforward Transformations (II) #1 DUE*", "8 Oct 21 see notes Temporal Basis Functions #2 DUE*", "Neural Engineering: Representation, Computationa and Dynamics in Neurobiological Systems.", "On reserve in Library Yes", "Accommodation for Students with Disabilities", "Intellectual property includes items such as:", "of Waterloo for permission before uploading and sharing the intellectual property of others online(e.g., to an online repository).", "In many cases, instructors might be happy"]}, {"course_id": 75, "course_code": "SYDE 572", "course_name": "SYDE572 - Introduction to Pattern Recognition (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Pattern Recognition Fall 2024", "Pattern features as components in a random vector representation.", "Applications; optical character recognition, speech recognition, industrial robot vision, medical diagnosis, remote sensing and satellite image analysis, fault detection and diagnosis in complex systems such as nuclear reactors.", "Understand the principles of fundamental pattern recognition concepts such as classification, feature extraction and selection, deep learning, etc.", "2. Apply learnt techniques and algorithms in assignments using Python", "3. Understand and contextualize the learnt concepts in applications of pattern recognition to science, engineering, and industry", "4. Design a pattern recognition system provided a task and a set of data.", "Problem Analysis", "Introduction, Pattern Recognition Problem Definition", "Parametric and Nonparametric Distance-Based Classification", "KNN and distance-based classification", "Parametric and Nonparametric Density Estimation", "Discriminant Functions", "Gaussian mixture models", "Parametric and Nonparametric Clustering", "Expectation Maximization", "Linear and nonlinear regression", "Ensemble classification", "Advanced topics", "An Introduction to Statistical Learning, James, Witten, Hastie, Tibshirani, 2nd Ed.", "Introduction to Machine Learning, Alpaydin.", "Dive into Deep Learning", "Various usefullinks and advisorcontact information can be foundhere:"]}, {"course_id": 76, "course_code": "SYDE 575", "course_name": "SYDE575 - Image Processing (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Image Processing Fall 2024", "10:00AM - 11:20AM EV3 4408", "10:00AM - 11:20AM E5 6008", "Beginning with a discussion of quantitative models of imaging systems, this course moves on to apply methods of linear systems theory and signal processing to image processing.", "Simple spatial domain techniques as well as spatial frequency domain methods, and digital filter design for image enhancement and restoration are discussed.", "Applications to machine vision, remote sensing, and medical imaging will be emphasized.", "Apply basic image processing algorithms and tools to digital imagery (2)", "2. Utilize Matlab effectively for fundamental image processing applications (5)", "Understand mathematics for image processing based on signal processing concepts (1)", "4. Develop a basic understanding of the human visual system and its relationships to digital image processing (1)", "Understand the nature of spatial-frequency domain in the context of digital image processing (2)", "Work in a team to complete applied lab design based solutions to problems and prepare a technical report responding to clear instructions (4, 7)", "7. Demonstrate an enhanced understanding of linear systems with application to image processing (1)", "Graduate Attribute Definition", "Knowledge Base Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "2. Problem Analysis An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "7. Communication Skills An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "10-15 Spatial-frequency filter 2,3,4,5,6,7", "18 Color image processing 4,6", "The grade of each lab will be reduced by 20% for each full/partial day late submission.", "I make a sincere effort to provide a course to benefit students and I hope students make the same effort in return for their own positive experience.", "Prof. Clausi"]}, {"course_id": 77, "course_code": "SYDE 584", "course_name": "SYDE584 - Physiological Systems and Biomedical Design (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Physiological Systems and Biomedical Design Winter 2025", "04:30PM - 05:20PM", "04:30PM - 05:20PM", "Email: maud.gorbet@uwaterloo.ca", "Email: gganjikho@uwaterloo.ca", "The structure, functions, and properties of major physiological systems (e.g., musculoskeletal, nervous, cardiovascular, and respiratory) will be presented in relation to modelling physiological systems and the design of biomedical devices (imaging, assistive, and diagnostic).", "The structure, functions and properties of some of the major physiological systems (musculoskeletal, nervous, and cardiovascular) will be presented with an engineering science perspective.", "Strong emphasis will be given to mechanical, electrical, chemical and biological properties of tissues and their relation to measurements, modeling human systems, and the design of biomedical devices (assistive, orthopedic and diagnostic).", "Various aspects of physiological system dysfunctions and how they influence measurements and design of medical devices will be discussed.", "Learn and integrate basics of human physiology", "Develop an engineering perspective toward understanding biological functions", "Develop critical thinking skills for solving biomedical problems and designing sound biomedical technologies", "Describe the components/structures of the studied physiological systems (1d)", "Identify the relationship between structure and functions in physiological systems (1d, 3b, 3c)", "Interpret experimental results (graphs, tables, raw data) to evaluate the effects of disease, aging or a medical device on structure and/or function of physiological systems (3c)", "Evaluate biomedical engineering solutions by applying your knowledge of physiology and the scientific methods (2c)", "Develop reasoned solutions to address biomedical problems by applying your knowledge of physiology and engineering principles while considering social-economical-ethical impacts (4b, 4c, 9a, 9b)", "1 Knowledge Base 1d - Demonstrate understanding of specialized engineering knowledge", "2 Problem Analysis 2c - Critically evaluate solutions of engineering problems", "3 Investigation 3b - Gather information from relevant sources to address complex engineering problems", "3c - Synthesize information from multiple sources to reach valid conclusions", "4 Design 4b - Generate and refine potential solutions to complex, open-ended design problems", "4c - Critically evaluate and compare design choices", "9b - Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations in making decisions", "Week  Date  Topics (physiology & biomedical applications) Learning assessment", "Membrane potential, membrane transport and biological system communications.", "Implications in disease and diagnostics.", "Applications to biomedical engineering.", "Biomedical applications in bone and connective tissues", "7 Feb 24 & Feb 26", "Electrodes for Brain-computer Interface", "9 March 10 & March 12", "Engineering a heart and heart valves", "10  March 17 & March 19", "March 19: LEC & TUT Cancelled (symposium week)", "March 24 & March 26", "Muscle tissue 1: structure and functions", "These will be short and will contain up to 20 multiple choice questions.", "No late submission and no make-up quiz will be organized.", "There will be some opportunities to complete some of these activities remotely in case you were unable to attend.", "These will be also used by Prof Gorbet to evaluate comprehension of concepts and common misunderstandings.", "0 - Submission missing", "1.5 - Good submission: submission demonstrates a clear effort in applying course concepts and/or critical thinking", "Research and design project outline proposals", "The research & design outline proposals are expected to be done in pairs, and will relate to the study of a disease or aging and proposing a novel biomedical solution to characterize, support or replace the affected physiological structure or function.", "Library for research-based assignments", "Email Communication", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Visit them at www.uwaterloo.ca/wcc.", "Course and Departmental Expectations in SYDE", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 78, "course_code": "SYDE 599", "course_name": "SYDE599 - Special Topics in Systems Design Engineering (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Planning for Design of a Sustainable Hospital System Winter 2025", "04:30PM - 05:20PM", "E5 6111", "lisa.aultman-hall@uwaterloo.ca", "This course deals with selected topics at the undergraduate level in environmental and societal systems, mechatronics and physical systems, or human factors and ergonomics.", "Three frameworks or tools ground the course in systems design engineering:", "systems thinking (with mapping); and", "access and transportation;", "green energy; or", "Co-laboratory definitions of sustainability and hospital systems;", "Summaries and reviews of hospital sustainability literature;", "Short design reports of alternative hospital site designs; and", "Identify and conceptualize the role of a hospital system in a community and region.", "Appreciate the complexity of defining sustainability for a hospital, a complex social technical system.", "Clearly define the hospital site as a design problem with a sustainability-based objective.", "Identify multiple conceptual design alternatives for the Waterloo hospital site and evaluate the extent to which each meets sustainability goals and objectives using metrics.", "Use systems thinking to frame a complex problem and communicate the elements of a system using mapping.", "Work effectively in a collaborative team environment by co-developing definitions, documents, and system representations of a complex system.", "29-Jan 4 ESG Metrics - Dr. Jen Boger Co-lab #2: Hospital Systems Diagram", "03-Feb 5 Circular Engineering - Dr. Carl Haas Sustainability in Structures - Dr. Cory Zurell", "05-Feb 5 Site Selection and Regional Planning - Mike Murray  Tutorial: Life Cycle Analysis", "10-Feb 6 More on Life Cycle Analysis  Sustainable Energy Systems", "24-Feb 7  Hospital Mechanical Systems Systems Design Methods", "26-Feb 7  Hospital Waste Tutorial: Systems Design Methods", "03-Mar 8 Site Design and Water - Hospital Water Uses Co-Lab #3: Site System Mapping", "12-Mar 9 Co-Lab #4 - Design Alternative Generation", "26-Mar 11 Tour about Art and Nature in a Hospital System", "We will work together on a real-world problem to learn, think critically and design alternative solutions for which real-world stakeholders want our input.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}]