[{"course_id": 0, "course_code": "ACTSC 231", "course_name": "ACTSC231 - Introductory Financial Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 1, "major_name": "Business Administration and Mathematics Double Degree (Bachelor of Business Administration and Bachelor of Mathematics - Honours)", "topics": ["Introductory Financial Mathematics Winter 2025", "11:30AM - 12:20PM QNC 1502", "03:30PM - 04:20PM MC 2065", "Indicate what you've tried and where you're stuck (e.g., \"I thought the solution should be ...", "The theory of rates of interest and discount; annuities and sinking funds with practical applications to mortgage and bond questions.", "This course provides foundational tools for understanding key financial concepts, such as interest rates, annuities, loans, and bonds.", "The principles introduced are essential for performing calculations related to everyday financial matters, like determining mortgage payments or valuing investments, and they play a key role in sectors like banking, insurance, and real estate.", "By the end of the course, you will have a strong grasp of the mathematical techniques used to approach real-world financial problems, laying a foundation for further study and practical applications in finance and actuarial science.", "You can find the Actuarial Science program and plan requirements in the Undergraduate Academic Calendar.", "This course meets several requirements for SOA, CAS, and CIA designations", "It covers most SOA FM Exam learning objectives, except interest rate swaps and determinants of interest rates.", "Bonds]", "General cash flows and portfolios]", "Immunization]", "Define cash flow matching and immunization.", "Yes $89 (6-month digital license)", "We will assign problems from the textbook as practice, and completing these independently is essential for developing and self-assessing your understanding of the material.", "Exam Practice: The individual stage simulates the pressure of closed-book individual exams, preparing you for midterms and the final exam.", "Collaborative Learning: Group work enhances understanding as you learn from and explain concepts to your teammates.", "Strategies for success", "Attend all lectures: Regular attendance helps you grasp key concepts and stay on track with the material.", "A financial calculator is not required, and all questions are designed so that full marks can be achieved with a standard non-financial calculator.", "The final exam covers all topics introduced in the course.", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 1, "course_code": "CO 370", "course_name": "CO370 - Deterministic OR Models (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 1, "major_name": "Business Administration and Mathematics Double Degree (Bachelor of Business Administration and Bachelor of Mathematics - Honours)", "topics": ["Deterministic OR Models Winter 2025", "Mahtab Alghasi: Wednesdays from 11am-12pm in MC5488", "An applications-oriented course that illustrates how various mathematical models and methods of optimization can be used to solve problems arising in business, industry, and science.", "Formulate computational tasks as optimization problems of appropriate type", "Understand optimization concepts surrounding real world challenges (sensitivity analysis, robust optimization, stochastic optimization)", "Have some familiarity with algorithmic techniques and heuristics for solving optimization problems", "Part I: Formulations", "Flows", "Integer Programs that reduce to Linear Programs", "Part 2: Real World Challenges that can be addressed in Optimization", "Robust optimization", "Stochastic Optimization", "Part 3: Algorithms and Heuristics for Solving Optimization", "Branch and Bound", "Please sign yourself up at", "A missed test will be treated the same as a mark of zero.", "The answer to most common issues as well as how-to videos can be found at", "To avoid issues, only use your UWaterloo email, never use multiple email addresses.", "Illnesses and INC", "In case of a", "short period of illness and a strong performance in the course we should be able to simply", "Copyright Information"]}, {"course_id": 2, "course_code": "CS 330", "course_name": "CS330 - Management Information Systems (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 1, "major_name": "Business Administration and Mathematics Double Degree (Bachelor of Business Administration and Bachelor of Mathematics - Honours)", "topics": ["Management Information Systems Winter 2025", "Email: kevin.lanctot@uwaterloo.ca", "An introduction to information systems and their strategic role in business.", "Topics include types of information systems, organizational requirements, systems development strategies, decision support systems, data and information management, and information systems management, control, and implementation.", "This course is aimed at students who are not CS majors but are interested in continuing their study of computer science beyond first year.", "Make informed decisions about using technology in a business environment.", "Define and explain the characteristics of a variety of business information systems.", "Describe strategic roles and management usage for information systems in business.", "Understand the relationships among various information systems.", "A1", "Feb 25, 27 Topic 4 - Introduction to IS (Ch 1 in text)", "A2", "A4", "A copy of the 7th edition will be placed on 3-hour reserve in the Davis Library.", "Evaluation", "If you miss the final assessment, you will be given an INC if there is a strong reason for missing it (generally a serious medical issue verified by a VIF).", "This course includes the independent development and practice of specific skills, such as designing information systems.", "Library for research-based assignments", "Physical and Mental Health", "See https://uwaterloo.ca/campus-wellness/ for a list of on-campus supports and workshops.", "In particular:", "Intellectual property includes items such as:"]}, {"course_id": 3, "course_code": "STAT 371", "course_name": "STAT371 - Applied Linear Models and Process Improvement for Business (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 1, "major_name": "Business Administration and Mathematics Double Degree (Bachelor of Business Administration and Bachelor of Mathematics - Honours)", "topics": ["Applied Linear Models and Process Improvement for Business Winter 2025", "08:30AM - 09:50AM RCH 307", "Practical and theoretical aspects of simple and multiple linear regression models.", "Strategies for variation reduction such as control charting.", "Applications to problems in business.", "View requirements for STAT 371", "Develop appropriate and meaningful linear regression models to fit to data from business, finance, and other fields for the purpose of answering relevant questions about relationships between the response and explanatory variables in a population or process of interest.", "Use the programming language, R, to fit regression models and to explore course concepts.", "Interpret regression results from R output, draw conclusions from these results in the context of the study, and effectively communicate these results and conclusions to disparate audiences and interest groups.", "Use graphical and numerical analyses to determine whether the fitted model is appropriate with respect to its underlying model assumptions.", "Employ model selection methods and model improvement techniques to improve the fit of the model.", "Explain the mathematical theory behind the results and output from a regression analysis, including the derivation of the distributions of model parameter estimators.", "To understand and apply the statistical concepts, theory and techniques necessary to monitor and assess process performance.", "Simple linear regression review:", "Graphical and numerical summaries of bivariate data", "The simple linear regression model", "Assumptions of the normal model", "Least squares estimation of β0 and β1", "Least squares estimation of σ2", "Interpretation of parameter estimates", "Distribution of", "Confidence intervals and hypothesis tests for β1", "Multiple linear regression:", "The normal model", "Least squares estimation of β", "The hat matrix", "Least squares estimation of σ2", "Distribution of", "Confidence intervals and hypothesis tests for β", "Confidence intervals for µnew and prediction intervals for Ynew", "Modelling categorical variables", "Inference for model parameters", "Analysis of Variance (ANOVA)", "Introduction", "ANOVA table and the F-test", "Additional sum of squares", "Analysis of Variance (ANOVA) (cont'd)", "Indicator variates and additional sum of squares", "General linear hypothesis", "Model Assumptions", "Addressing model inadequacies", "Distribution of residual vector, e", "Leverage and influential observations", "Model selection", "Sequential methods of model selection", "Interaction", "Waterloo Faculty Salary case study", "Fitting linear models to time series data", "Introduction", "Modelling seasonal and trend components", "Mar. 24 - 28", "Introduction to Process Performance", "Introduction", "Control charts", "Average run length", "3-sigma control limits and other signals of process instability", "Control charts for count data", "CUSUM and EWMA control charts", "Housing bubble article example", "Introduction to Regression Modelling, by B. Abraham and J. Ledolter (Brooks/Cole pub.)", "compassionate grounds", "Answers to questions requiring verbal explanations must be in your own words.", "Please be sure to read the posted Assignment Information and Guidelines document for important assignment and submission information (in particular, be sure you understand the 72-hour grace period policy for each assignment).", "In-person concept quizzes will be replaced with online quizzes", "Instructor INC Policy for STAT 371: In the case of a missed final exam with supporting documentation, an INC grade will only be awarded if both the following conditions are satisfied:"]}, {"course_id": 4, "course_code": "STAT 372", "course_name": "STAT372 - Survey Sampling and Experimental Design Techniques for Business (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 1, "major_name": "Business Administration and Mathematics Double Degree (Bachelor of Business Administration and Bachelor of Mathematics - Honours)", "topics": ["Survey Sampling and Experimental Design Techniques for Business Winter 2025", "04:00PM - 05:20PM", "E-mail: cboudreau@uwaterloo.ca", "Design and analysis of surveys.", "Management of sample and non-sample error.", "Analysis of variance, factorial experiments, and interaction.", "Basic quantities and definitions", "Inclusion probabilities", "Sampling design", "Horvitz-Thompson estimator", "Horvitz-Thompson estimator under SRS", "Estimating population means, totals and proportions under SRS", "Confidence intervals", "R survey package", "Horvitz-Thompson estimator under STSRS", "Estimating population means, totals and proportions under STSRS", "Confidence intervals", "Sample allocation under STSRS", "Estimating ratios", "Ratio estimator", "Introduction to Hájek estimator", "Chap 5: Clustering and two-stage sampling", "Horvitz-Thompson estimator under two-stage sampling", "SRS-SRS and STSRS-SRS sampling design", "Hájek estimator", "PPS sampling", "Part 2 – Experimental Design", "One-way ANOVA model", "Sum of squares and ANOVA table", "F test", "Estimating factor level means", "Multiple comparisons", "Diagnostic", "Sum of squares and ANOVA table", "F tests", "Analysis when no interaction", "Analysis with interactions", "Diagnostic", "Randomized block design model", "Sum of squares and ANOVA table", "F tests", "Analysis of treatment effects", "I will mostly use slides that I will post on the Stat 372 LEARN website.", "I’m planning to post the slides Monday and Wednesday evenings.", "There is a companion book, entitled R Companion for Sampling Design and Analysis, which can be downloaded for free (pdf format) here.", "Carl-Erik Särndal was my master thesis supervisor, and his book greatly influenced my Stat 372 slides and teaching.", "This is a truly excellent textbook, which explains concepts and theory extremely well and nicely."]}, {"course_id": 5, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 1, "major_name": "Business Administration and Mathematics Double Degree (Bachelor of Business Administration and Bachelor of Mathematics - Honours)", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 6, "course_code": "CO 255", "course_name": "CO255 - Introduction to Optimization (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 1, "major_name": "Business Administration and Mathematics Double Degree (Bachelor of Business Administration and Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Introduction to Optimization (Advanced Level)", "08:30AM - 09:50AM MC 4040", "Linear optimization: feasibility theorems, duality, the simplex algorithm.", "Know a variety of optimization algorithms, including the Simplex method, cutting plane methods, and descent methods.", "Know and apply the definition and properties of convex sets and functions.", "Write the dual of a linear programming problem and understand the properties relating the primal and dual.", "Apply optimization methods to common continuous and discrete problems including game theory, flow, scheduling, and data science.", "Linear programming, Fourier-Motzkin elimination, and Farkas's lemma.", "Duality in linear programming.", "Convex optimization and the KKT conditions.", "Discrete optimization and total unimodularity.", "Applications of total unimodularity to matching and flow problems", "Application of nonlinear optimization to data science", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course.", "If you have questions or concerns about these matters, please email mathadvisor@uwaterloo.ca."]}, {"course_id": 0, "course_code": "AFM 102", "course_name": "AFM102 - Introduction to Managerial Accounting (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Managerial Accounting Winter 2025", "AFM 102", "AFM 102 081", "Your instructor checks email and the Ask the Instructor discussion topics frequently and will make every effort to reply to your questions within 24–48 hours, Monday to Friday.", "AFM 102:", "This course is an introduction to the preparation and use of accounting information for management decision-making and reporting.", "Cost behaviour, cost accumulation systems, and short- and long-term decision models are discussed.", "View requirements for AFM 102", "We will be learning how to perform internal analysis including cost-volume-profit analysis, profitability analysis, performance analysis, and capital budgeting analysis.", "Distinguish between various cost classifications and analyze a company’s cost structure to facilitate internal decision-making.", "Apply cost-volume-profit (CVP) analysis to recommend the best course of action given different “what-if” scenarios.", "Explain the budgeting process and prepare components of master and flexible budgets.", "Week 1: Introduction to Managerial Accounting", "Week 2: Cost Terms and Concepts", "Week 4: Cost-Volume-Profit Analysis", "Week 9: Standard Costs and Over Analysis", "Week 11: Relevant Costs and Benefits for Decision-Making", "Week 12: Capital Budgeting Decisions", "Optional No $99 (e-book & Connect Access Code)", "Re-Grading", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 4, "course_code": "CO 370", "course_name": "CO370 - Deterministic OR Models (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Deterministic OR Models Winter 2025", "Mahtab Alghasi: Wednesdays from 11am-12pm in MC5488", "An applications-oriented course that illustrates how various mathematical models and methods of optimization can be used to solve problems arising in business, industry, and science.", "Formulate computational tasks as optimization problems of appropriate type", "Understand optimization concepts surrounding real world challenges (sensitivity analysis, robust optimization, stochastic optimization)", "Have some familiarity with algorithmic techniques and heuristics for solving optimization problems", "Part I: Formulations", "Flows", "Integer Programs that reduce to Linear Programs", "Part 2: Real World Challenges that can be addressed in Optimization", "Robust optimization", "Stochastic Optimization", "Part 3: Algorithms and Heuristics for Solving Optimization", "Branch and Bound", "Please sign yourself up at", "A missed test will be treated the same as a mark of zero.", "The answer to most common issues as well as how-to videos can be found at", "To avoid issues, only use your UWaterloo email, never use multiple email addresses.", "Illnesses and INC", "In case of a", "short period of illness and a strong performance in the course we should be able to simply", "Copyright Information"]}, {"course_id": 5, "course_code": "CS 330", "course_name": "CS330 - Management Information Systems (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Management Information Systems Winter 2025", "Email: kevin.lanctot@uwaterloo.ca", "An introduction to information systems and their strategic role in business.", "Topics include types of information systems, organizational requirements, systems development strategies, decision support systems, data and information management, and information systems management, control, and implementation.", "This course is aimed at students who are not CS majors but are interested in continuing their study of computer science beyond first year.", "Make informed decisions about using technology in a business environment.", "Define and explain the characteristics of a variety of business information systems.", "Describe strategic roles and management usage for information systems in business.", "Understand the relationships among various information systems.", "A1", "Feb 25, 27 Topic 4 - Introduction to IS (Ch 1 in text)", "A2", "A4", "A copy of the 7th edition will be placed on 3-hour reserve in the Davis Library.", "Evaluation", "If you miss the final assessment, you will be given an INC if there is a strong reason for missing it (generally a serious medical issue verified by a VIF).", "This course includes the independent development and practice of specific skills, such as designing information systems.", "Library for research-based assignments", "Physical and Mental Health", "See https://uwaterloo.ca/campus-wellness/ for a list of on-campus supports and workshops.", "In particular:", "Intellectual property includes items such as:"]}, {"course_id": 6, "course_code": "CS 338", "course_name": "CS338 - Computer Applications in Business: Databases (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Computer Applications in Business: Databases Winter 2025", "A user-oriented approach to the management of large collections of data.", "Design relational databases", "Construct SQL queries for data retrieval", "Develop strategies for data storage and backup", "Introduction and Terminology", "Relational Data Model", "Relational Algebra", "SQL: Aggregation and Grouping", "SQL: Data and Schema Modifications", "SQL: Null Values", "ER Models", "EER Model", "EER to Relation Mapping", "DBMS Concepts and Architecture", "Transaction Processing", "Database Recovery", "Database Security", "Distributed Databases", "Business Analytics", "We highly recommend thoroughly understanding and verifying your assignment solutions to set yourselves up for success in this course since  exams in CS 338 will be closed-book, and without a strong understanding of the assignments, you may find the exams challenging."]}, {"course_id": 7, "course_code": "ECON 101", "course_name": "ECON101 - Introduction to Microeconomics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Microeconomics Winter 2025", "ECON 101", "Email: chvandew@uwaterloo.ca", "“ECON 101” must appear in the subject line and the message must include your full name and student ID number.", "This course provides an introduction to microeconomic analysis relevant for understanding the Canadian economy.", "The behaviour of individual consumers and producers, the determination of market prices for commodities and resources, and the role of government policy in the functioning of the market system are the main topics covered.", "View requirements for ECON 101", "The course comprises the theoretical essentials of microeconomics and will serve as a prerequisite for virtually every economics class that you will endeavour to take in the future.", "understand the need for people to make choices and to work together towards overcoming the universal problem of scarcity;", "appreciate the relevance of economics in a changing world;", "apply elements of microeconomic theory to understand how consumers and producers make rational decisions;", "decompose problems into their economic parts.", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Intellectual property includes items such as:", "Please carefully read the Economics Department policy for instructions.", "Economics Department Deferred Final Exam Policy", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Applications for Accommodation", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 8, "course_code": "ECON 102", "course_name": "ECON102 - Introduction to Macroeconomics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Macroeconomics Winter 2025", "ECON 102", "04:00PM - 05:20PM", "View requirements for ECON 102", "Describe important macroeconomic questions and goals, and explain how monetary and fiscal policy may influence economic outcomes.", "Explain and solve simple models and problems.", "Identify strengths and weaknesses of macroeconomic data, models and theories.", "I. Introduction", "Measurement, Accounting and Data", "Gross Domestic Product and the System of National Accounts.", "Inflation and Price Indices.", "Economic Frameworks", "Modelling Concepts and Model Evaluation.", "Concept of Aggregate Demand in the Goods Market.", "Trends, Cycles and Inequality", "Inequality and Poverty concepts and issues.", "Money and Inflation", "Monetary System and role of money.", "Cost of Inflation", "International Economic Concepts, Exchange Rates and Balance of Payments", "The lecture slides cover a variety of standard macroeconomic topics.", "CAUTION: the notation and even the macroeconomic models presented can vary subtly across textbooks.", "Differences in approach and thought can also help to better understand the benefits and drawbacks of different economic theory and methods.", "The format of the mid-term will be multiple-part short-answer questions.", "All deferred Final Exam requests for Economics courses are administered by the Economics Undergraduate Office.", "In order to achieve a healthy balance between work hours and personal life, there will be a finite amount of time I can dedicate to appointments and emails.", "Also know that I am here to support your learning goals, whether they be to understand a subset of the econometric tools, to pass the course, or to achieve a high grade.", "Applications for Accommodation", "Economics Department Deferred Final Exam Policy", "On campus supports", "Other on-campus supports", "Please see WUSA main web page for these and other services and clubs which may provide more specific and personalized support for specific needs.", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 9, "course_code": "HRM 200", "course_name": "HRM200 - Basic Human Resources Management (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Reviews the role of human resources administration in organizations and the manner in which human resources executives contribute to the well-being of a total enterprise.", "For students who are pursuing the Certified Human Resources Professional (CHRP) certification, this is a core course.", "HR policies and practices significantly impact the bottom line and an organization’s overall performance.", "The course will examine the evolution of HR from a primarily administrative function to a strategic partner and decision maker in the organization.", "Increase your understanding and appreciation of the Human Resources function and its role in an organization.", "Identify Human Resource issues facing organizations and line managers through textbook examples and real-life experiences of the instructor and develop insights on what it is like to work in the Human Resource profession.", "Readings", "Module 2: HR Technology and Designing and Analyzing Jobs Chapter 3", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Reference", "There are two written Case Applications in HRM 200 and I want to make it very clear that these written assignments are to be your own original work which means that:", "This course includes the independent development and practice of specific skills, such as Communication, Listening, Conflict Resolution, Cultural Awareness & Sensitivity, Decision Making, Employee Relations and Employment Law & Legislation.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 10, "course_code": "MATBUS 371", "course_name": "MATBUS371 - Introduction to Corporate Finance (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Introduction to Corporate Finance Winter 2025", "All email communication should specify MATBUS371 and your name and ID as in UWaterloo system.", "Email: okanj@uwaterloo.ca", "Grasp corporate finance objectives and understand how financial systems function.", "Interpret financial statements to evaluate a firm's financial status.", "Explain the importance of the market portfolio and know how to construct a value-weighted portfolio.", "Master techniques for evaluating capital investment decisions.", "Assess the drivers and financial evaluations of M&As and their impact on shareholder value.", "Financial Statements and Financial Statement Analysis Monday, February 3, 2025 3% 10%", "Merger & Acquisition Thursday, April 3, 2025   10%", "Participation Bonus: These are in-class examples to solve, the number and availability will vary in each session.", "Questions can be answered by applying the video tutorial in each case.", "You don't have to complete each module in one sit, it can be paused.", "Assigned case will be posted through library reserves.", "Notice of Recording"]}, {"course_id": 11, "course_code": "STAT 371", "course_name": "STAT371 - Applied Linear Models and Process Improvement for Business (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Applied Linear Models and Process Improvement for Business Winter 2025", "08:30AM - 09:50AM RCH 307", "Practical and theoretical aspects of simple and multiple linear regression models.", "Strategies for variation reduction such as control charting.", "Applications to problems in business.", "View requirements for STAT 371", "Develop appropriate and meaningful linear regression models to fit to data from business, finance, and other fields for the purpose of answering relevant questions about relationships between the response and explanatory variables in a population or process of interest.", "Use the programming language, R, to fit regression models and to explore course concepts.", "Interpret regression results from R output, draw conclusions from these results in the context of the study, and effectively communicate these results and conclusions to disparate audiences and interest groups.", "Use graphical and numerical analyses to determine whether the fitted model is appropriate with respect to its underlying model assumptions.", "Employ model selection methods and model improvement techniques to improve the fit of the model.", "Explain the mathematical theory behind the results and output from a regression analysis, including the derivation of the distributions of model parameter estimators.", "To understand and apply the statistical concepts, theory and techniques necessary to monitor and assess process performance.", "Simple linear regression review:", "Graphical and numerical summaries of bivariate data", "The simple linear regression model", "Assumptions of the normal model", "Least squares estimation of β0 and β1", "Least squares estimation of σ2", "Interpretation of parameter estimates", "Distribution of", "Confidence intervals and hypothesis tests for β1", "Multiple linear regression:", "The normal model", "Least squares estimation of β", "The hat matrix", "Least squares estimation of σ2", "Distribution of", "Confidence intervals and hypothesis tests for β", "Confidence intervals for µnew and prediction intervals for Ynew", "Modelling categorical variables", "Inference for model parameters", "Analysis of Variance (ANOVA)", "Introduction", "ANOVA table and the F-test", "Additional sum of squares", "Analysis of Variance (ANOVA) (cont'd)", "Indicator variates and additional sum of squares", "General linear hypothesis", "Model Assumptions", "Addressing model inadequacies", "Distribution of residual vector, e", "Leverage and influential observations", "Model selection", "Sequential methods of model selection", "Interaction", "Waterloo Faculty Salary case study", "Fitting linear models to time series data", "Introduction", "Modelling seasonal and trend components", "Mar. 24 - 28", "Introduction to Process Performance", "Introduction", "Control charts", "Average run length", "3-sigma control limits and other signals of process instability", "Control charts for count data", "CUSUM and EWMA control charts", "Housing bubble article example", "Introduction to Regression Modelling, by B. Abraham and J. Ledolter (Brooks/Cole pub.)", "compassionate grounds", "Answers to questions requiring verbal explanations must be in your own words.", "Please be sure to read the posted Assignment Information and Guidelines document for important assignment and submission information (in particular, be sure you understand the 72-hour grace period policy for each assignment).", "In-person concept quizzes will be replaced with online quizzes", "Instructor INC Policy for STAT 371: In the case of a missed final exam with supporting documentation, an INC grade will only be awarded if both the following conditions are satisfied:"]}, {"course_id": 12, "course_code": "STAT 372", "course_name": "STAT372 - Survey Sampling and Experimental Design Techniques for Business (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Survey Sampling and Experimental Design Techniques for Business Winter 2025", "04:00PM - 05:20PM", "E-mail: cboudreau@uwaterloo.ca", "Design and analysis of surveys.", "Management of sample and non-sample error.", "Analysis of variance, factorial experiments, and interaction.", "Basic quantities and definitions", "Inclusion probabilities", "Sampling design", "Horvitz-Thompson estimator", "Horvitz-Thompson estimator under SRS", "Estimating population means, totals and proportions under SRS", "Confidence intervals", "R survey package", "Horvitz-Thompson estimator under STSRS", "Estimating population means, totals and proportions under STSRS", "Confidence intervals", "Sample allocation under STSRS", "Estimating ratios", "Ratio estimator", "Introduction to Hájek estimator", "Chap 5: Clustering and two-stage sampling", "Horvitz-Thompson estimator under two-stage sampling", "SRS-SRS and STSRS-SRS sampling design", "Hájek estimator", "PPS sampling", "Part 2 – Experimental Design", "One-way ANOVA model", "Sum of squares and ANOVA table", "F test", "Estimating factor level means", "Multiple comparisons", "Diagnostic", "Sum of squares and ANOVA table", "F tests", "Analysis when no interaction", "Analysis with interactions", "Diagnostic", "Randomized block design model", "Sum of squares and ANOVA table", "F tests", "Analysis of treatment effects", "I will mostly use slides that I will post on the Stat 372 LEARN website.", "I’m planning to post the slides Monday and Wednesday evenings.", "There is a companion book, entitled R Companion for Sampling Design and Analysis, which can be downloaded for free (pdf format) here.", "Carl-Erik Särndal was my master thesis supervisor, and his book greatly influenced my Stat 372 slides and teaching.", "This is a truly excellent textbook, which explains concepts and theory extremely well and nicely."]}, {"course_id": 13, "course_code": "ACTSC 221", "course_name": "ACTSC221 - Introductory Financial Mathematics (Non-Specialist Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["ACTSC 221", "ACTSC 221 001", "I work from home on Tuesday and Thursday and I will have some availability on those days for Teams-based meetings.", "Email: bmatheson@uwaterloo.ca", "The theory of rates of interest and discount; annuities and sinking funds with practical applications to mortgage and bond questions.", "View requirements for ACTSC 221", "Be able to understand the basics of what drives the price of a stock using the Dividend Discount Model (DDM).", "Day", "Test Date & Coverage", "Module 1: Introduction to Interest: Sections a to d", "Module 1: Introduction to Interest: Sections e to i", "A1", "A2", "Family Day - No Lecture", "Module 3: Loans and Debts: Sections a and b", "Module 3: Loans and Debts: Sections c and d", "A4", "These dates largely correspond to when you should be done a given week’s work.", "I feel that you should attempt them after you finish the week’s studying to see how you are grasping the materials."]}, {"course_id": 14, "course_code": "ACTSC 231", "course_name": "ACTSC231 - Introductory Financial Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Introductory Financial Mathematics Winter 2025", "11:30AM - 12:20PM QNC 1502", "03:30PM - 04:20PM MC 2065", "Indicate what you've tried and where you're stuck (e.g., \"I thought the solution should be ...", "The theory of rates of interest and discount; annuities and sinking funds with practical applications to mortgage and bond questions.", "This course provides foundational tools for understanding key financial concepts, such as interest rates, annuities, loans, and bonds.", "The principles introduced are essential for performing calculations related to everyday financial matters, like determining mortgage payments or valuing investments, and they play a key role in sectors like banking, insurance, and real estate.", "By the end of the course, you will have a strong grasp of the mathematical techniques used to approach real-world financial problems, laying a foundation for further study and practical applications in finance and actuarial science.", "You can find the Actuarial Science program and plan requirements in the Undergraduate Academic Calendar.", "This course meets several requirements for SOA, CAS, and CIA designations", "It covers most SOA FM Exam learning objectives, except interest rate swaps and determinants of interest rates.", "Bonds]", "General cash flows and portfolios]", "Immunization]", "Define cash flow matching and immunization.", "Yes $89 (6-month digital license)", "We will assign problems from the textbook as practice, and completing these independently is essential for developing and self-assessing your understanding of the material.", "Exam Practice: The individual stage simulates the pressure of closed-book individual exams, preparing you for midterms and the final exam.", "Collaborative Learning: Group work enhances understanding as you learn from and explain concepts to your teammates.", "Strategies for success", "Attend all lectures: Regular attendance helps you grasp key concepts and stay on track with the material.", "A financial calculator is not required, and all questions are designed so that full marks can be achieved with a standard non-financial calculator.", "The final exam covers all topics introduced in the course.", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 15, "course_code": "AFM 101", "course_name": "AFM101 - Introduction to Financial Accounting (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Financial Accounting Winter 2025", "AFM 101", "AFM 101 081", "AFM 101:", "This course is an introduction to financial accounting.", "View requirements for AFM 101", "Define and use financial accounting terminology.", "Identify and correct basic accounting errors in financial statement accounts.", "Draw conclusions and make recommendations based on financial information.", "Identify and apply the principles of financial reporting.", "Apply basic financial accounting principles in an industry.", "Your access code is available in multiple formats.", "Financial Accounting and MyLab - ebook and access code", "MyLab - access code only", "This course includes the independent development and practice of specific skills, such as understanding financial statements, conducting financial analysis, and preparing financial statements.", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 17, "course_code": "AFM 231", "course_name": "AFM231 - Business Law (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["07:00PM - 09:50PM", "Students can contact the course instructor via email at rhussein@uwaterloo.ca.", "Particular attention is given to the law relating to contracts and business organizations.", "AFM 231: View requirements for AFM 231", "While the course introduces you to basic concepts in law, it is designed for, and particularly emphasizes topics that will be of specific relevance to you as future business managers, owners, or even practicing professionals.", "This includes understanding the basics of legal risk so you can make more effective business decisions.", "Business managers/owners often must engage in risk management exercises.", "Appreciate the complexity of integrating multiple private law concepts into the analysis of a business situation.", "Utilize a basic framework for legal risk management assessments and generate an inventory of possible legal risk management tools.", "Describe the common as well as contrasting relationship between legal compliance and ethical conduct.", "March 24-28", "Wrap-up", "Accordingly, if students do opt to use an older edition it would be advisable to use an edition that is as close to the 8th edition as possible and consider cross-referencing it to the current edition and noting any differences.", "Completion", "The response demonstrates a clear understanding of the relevant course concepts and effectively applies these concepts to the hypothetical scenario.", "Application to Real-World Example", "The response includes an appropriate real-world example that relates to the course material, illustrating how the concept can be applied outside the context of the hypothetical.", "Students may also include a revised answer based on a similar but different set of hypothetical facts.", "For example, a student may propose one solution based on the given facts but suggest a different solution if the facts were altered.", "Students are expected to demonstrate critical thinking and clearly articulate their reasoning.", "Each quiz covers content that relates to the current course content (the current chapters and occasionally a prior chapter as well if it has not yet been part of a quiz).", "Submission Times", "Reevaluation Request", "Requests for re-evaluation of submitted material can be done via email.", "Also, students should detail what their concern as specifically as possible.", "Artificial Intelligence Tools", "Also, some evaluation elements are structured such that it may be even quicker to do it yourself than to utilize an AI tool and then further edit/revise before submission.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 19, "course_code": "LS 283", "course_name": "LS283 - Business Law (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["07:00PM - 09:50PM", "Students can contact the course instructor via email at rhussein@uwaterloo.ca.", "Particular attention is given to the law relating to contracts and business organizations.", "AFM 231: View requirements for AFM 231", "While the course introduces you to basic concepts in law, it is designed for, and particularly emphasizes topics that will be of specific relevance to you as future business managers, owners, or even practicing professionals.", "This includes understanding the basics of legal risk so you can make more effective business decisions.", "Business managers/owners often must engage in risk management exercises.", "Appreciate the complexity of integrating multiple private law concepts into the analysis of a business situation.", "Utilize a basic framework for legal risk management assessments and generate an inventory of possible legal risk management tools.", "Describe the common as well as contrasting relationship between legal compliance and ethical conduct.", "March 24-28", "Wrap-up", "Accordingly, if students do opt to use an older edition it would be advisable to use an edition that is as close to the 8th edition as possible and consider cross-referencing it to the current edition and noting any differences.", "Completion", "The response demonstrates a clear understanding of the relevant course concepts and effectively applies these concepts to the hypothetical scenario.", "Application to Real-World Example", "The response includes an appropriate real-world example that relates to the course material, illustrating how the concept can be applied outside the context of the hypothetical.", "Students may also include a revised answer based on a similar but different set of hypothetical facts.", "For example, a student may propose one solution based on the given facts but suggest a different solution if the facts were altered.", "Students are expected to demonstrate critical thinking and clearly articulate their reasoning.", "Each quiz covers content that relates to the current course content (the current chapters and occasionally a prior chapter as well if it has not yet been part of a quiz).", "Submission Times", "Reevaluation Request", "Requests for re-evaluation of submitted material can be done via email.", "Also, students should detail what their concern as specifically as possible.", "Artificial Intelligence Tools", "Also, some evaluation elements are structured such that it may be even quicker to do it yourself than to utilize an AI tool and then further edit/revise before submission.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 20, "course_code": "ARBUS 302", "course_name": "ARBUS302 - Principles of Marketing (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Students will gain an understanding of how organizations identify the needs of potential consumers and create and deliver value to these consumers through the marketing process.", "Certain concepts from business and economics including market responsiveness, decision-making process, willingness to purchase, product differentiation, and advertising will be incorporated into the development of a strategic marketing plan.", "In addition to teaching central concepts and models from both marketing and economic theory, students will be placed in a forum where they can apply these concepts in a 'real world' marketing situation.", "Describe the basic principles of marketing, the marketing process, and its economic foundation.", "Demonstrate how marketing discovers and satisfies consumer needs and wants.", "Analyze internal and external factors contributing to the current state of organizations.", "Demonstrate the use of marketing tools including branding, positioning, and segmentation.", "Integrate the marketing mix elements into a strategic marketing plan.", "Missing a Discussion Posting", "If a student has an ongoing medical issue over the long run that would cause missing more than two discussion boards, the student should bring official documentation stating their condition at the beginning of the term.", "In the case of contribution issues, non-contributor's marks will be penalized based on their peer evaluation scores.", "In the case of illness or emergencies, students are responsible for contacting their group members ahead of deadlines and arranging for re-distribution of their responsibilities.", "This course includes the development and practice of specific skills, such as collecting, synthesizing and analyzing information, creating recommendations and practicing writing skills.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 22, "course_code": "MGMT 244", "course_name": "MGMT244 - Principles of Marketing (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Students will gain an understanding of how organizations identify the needs of potential consumers and create and deliver value to these consumers through the marketing process.", "Certain concepts from business and economics including market responsiveness, decision-making process, willingness to purchase, product differentiation, and advertising will be incorporated into the development of a strategic marketing plan.", "In addition to teaching central concepts and models from both marketing and economic theory, students will be placed in a forum where they can apply these concepts in a 'real world' marketing situation.", "Describe the basic principles of marketing, the marketing process, and its economic foundation.", "Demonstrate how marketing discovers and satisfies consumer needs and wants.", "Analyze internal and external factors contributing to the current state of organizations.", "Demonstrate the use of marketing tools including branding, positioning, and segmentation.", "Integrate the marketing mix elements into a strategic marketing plan.", "Missing a Discussion Posting", "If a student has an ongoing medical issue over the long run that would cause missing more than two discussion boards, the student should bring official documentation stating their condition at the beginning of the term.", "In the case of contribution issues, non-contributor's marks will be penalized based on their peer evaluation scores.", "In the case of illness or emergencies, students are responsible for contacting their group members ahead of deadlines and arranging for re-distribution of their responsibilities.", "This course includes the development and practice of specific skills, such as collecting, synthesizing and analyzing information, creating recommendations and practicing writing skills.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 23, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 24, "course_code": "CO 255", "course_name": "CO255 - Introduction to Optimization (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Introduction to Optimization (Advanced Level)", "08:30AM - 09:50AM MC 4040", "Linear optimization: feasibility theorems, duality, the simplex algorithm.", "Know a variety of optimization algorithms, including the Simplex method, cutting plane methods, and descent methods.", "Know and apply the definition and properties of convex sets and functions.", "Write the dual of a linear programming problem and understand the properties relating the primal and dual.", "Apply optimization methods to common continuous and discrete problems including game theory, flow, scheduling, and data science.", "Linear programming, Fourier-Motzkin elimination, and Farkas's lemma.", "Duality in linear programming.", "Convex optimization and the KKT conditions.", "Discrete optimization and total unimodularity.", "Applications of total unimodularity to matching and flow problems", "Application of nonlinear optimization to data science", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course.", "If you have questions or concerns about these matters, please email mathadvisor@uwaterloo.ca."]}, {"course_id": 25, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 26, "course_code": "MATH 247", "course_name": "MATH247 - Calculus 3 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Topology on RN: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. (~3 weeks)", "Differentiation: partial differentiability, differentiability, chain rule, [midterm likely here], Taylor polynomials, extreme value problems. (~4 weeks)", "Integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. (~3 weeks)", "Local properties of continuously differentiable functions:  open mapping theorem, inverse function theorem, implicit function theorem. (~2 weeks)", "11:30AM - 12:20PM QNC 2501", "Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem.", "Topology of real n-dimensional space: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. Differential calculus on multivariable functions: partial differentiability, differentiability, chain rule, Taylor polynomials, extreme value problems. Riemann integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem."]}, {"course_id": 27, "course_code": "MSE 211", "course_name": "MSE211 - Organizational Behaviour (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Sofiia Doroshenko <sdoroshenko@uwaterloo.ca>", "Introduction to the concepts of learning, person perception, attitudes, and motivation in an organization.", "Discussion of power, control, leadership, and management in light of the above concepts.", "The basic objective of the course is to help you to develop both theoretical and practical approaches for analyzing and making sense of individual and group behaviour in organizational situations.", "Demonstrate understanding of basic theories/concepts of organizational behaviour.", "2. Demonstrate understanding of factors that affect the behaviour of individuals and groups in organizations.", "3. Demonstrate understanding of factors affecting communication effectiveness in organizations.", "Introduction                                            Ch 1", "Personality & Intelligence                     Ch 3", "Lewin’s field theory                               Handouts", "Groups & Teams                                    Ch 11", "Communication                                      Ch 20", "This course includes the independent development and practice of specific skills, such as analyzing and writing about organizational situations.", "In cases where there is further clear evidence of plagiarism regardless of AI% score, the work will be submitted to the Associate Dean as a potential academic integrity offence.", "Keep copies of your pre- and post- grammar-corrected drafts in case we ask to see them.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 29, "course_code": "ARBUS 202", "course_name": "ARBUS202 - Professional and Business Ethics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["11:30AM -", "V. Fernandes", "Study of ethical and moral issues that typically arise in professional and business activity.", "In the context of this course we will look specifically at ethical issues and principles of conduct that are relevant to professionals and business people.", "Topics include: fundamentals of moral and political theory, ethical decision-making, professional responsibility, corporate social responsibility, and equality, among other things.", "Like many other courses in philosophy, this series of lectures, readings, and discussions will deal with a critical analysis of many and varied views regarding life, existence, values, religious belief, etc.", "Form an opinion on the importance of ethical reasoning in business and professional contexts.", "Identify ethical problems in complex professional and business related situations.", "Apply ethical concepts to particular business and professional situations.", "Explain the roles of professional codes of conduct and codes of ethics in real world contexts.", "1 Jan 6 - 10 Introduction", "Module 2 Check-in", "3 Jan 20 - 24 Ethical Decision Making", "Module 3 Check-in", "5 Feb 3 - 7 Equality & Discrimination", "Module 6 Check-in", "7 Feb 24 - 28 Markets & the Environment", "Module 7 Check-in", "Module 9 Check-in", "Module 10 Check-in", "11 Mar 24 - 28 Whistle-blowing and Codes of Ethics", "Module 11 Check-in", "Module 12 Check-in", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 30, "course_code": "COMM 400", "course_name": "COMM400 - Entrepreneurship, Technology and the Emerging Information Economy (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["05:00PM - 07:50PM MC 4058", "A study of the spirit of entrepreneurship in the technology industry, opportunities emerging in the new information economy, and the implementation issues associated with starting an entrepreneurial venture in today's rapidly changing environment.", "Many of the concepts covered will also be applicable to careers in the technology industry or in information-based companies, where \"intrapreneurship\" is an emerging theme.", "The Changing Technology Environment – How is it disrupting business models and entire companies and industries?", "Understand the Entrepreneurial Process -- What issues are involved in starting a business and managing it through the various stages of its life cycle?", "Better understand Corporate Innovation -- How are entrepreneurial skills and approaches increasingly important to all careers?", "W. Chan Kim & Renee Mauborne, “Blue Ocean Strategy” No", "These team assignments will be made online at the end of the first week of classes.", "Your team will be responsible for submitting a reflection on your assigned guest entrepreneur.", "Each chapter typically includes five (5) or more assigned multiple choice questions and some occasional free form reflection questions.", "Speaker Sessions", "Pandemic contingency planning:", "Similar content pre-recorded sessions can be shared."]}, {"course_id": 31, "course_code": "LS 271", "course_name": "LS271 - Conflict Resolution (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Your instructor checks email and the Ask the Instructor discussion topic frequently and will make every effort to reply to your questions within 24–48 hours, Monday to Friday.", "Define terms, concepts, core values and phrases that are key to conflict resolution;", "Deconstruct conflict to identify underlying issues;", "Understand how collaborative and non-violent approaches to conflict undergird effective dispute resolution methods;", "Assess and re-evaluate one's own conflict style;", "Explain principles of negotiation, mediation, hybrids, arbitration and adjudication, and understand when each process is most appropriate to resolve a particular dispute;", "Recognize how conflict resolution processes are utilized in a peaceful civil society.", "Define terms, concepts, values, and phrases that are key to conflict resolution;", "Analyze a conflict to identify and describe contributing factors, roles played by the participants, how the conflict escalated, and what interests are important to the participants;", "Describe the range of conflict resolution processes, how they are connected to each other, and how the choice of a process affects the conflict;", "Explain the rights/interest/power paradigm and how it helps in classifying and choosing a method for resolving conflict;", "Identify ethical dilemmas for conflict practitioners, explain the nature of the dilemma, and identify an appropriate response;", "Distinguish between civil and criminal conflicts, and describe which conflict resolution methods are used for each class of conflicts;", "Although these three courses can be taken in any order, each builds on and adds to the foundation laid in the previous course.", "This course presents a basic overview of the concepts of peace, conflict, and violence.", "Speech Communication Option", "International Studies Option; and", "Spirituality and Personal Development Option.", "The word limits are hard limits.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "This course includes the independent development and practice of specific skills, such as mediation.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 33, "course_code": "PACS 202", "course_name": "PACS202 - Conflict Resolution (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Your instructor checks email and the Ask the Instructor discussion topic frequently and will make every effort to reply to your questions within 24–48 hours, Monday to Friday.", "Define terms, concepts, core values and phrases that are key to conflict resolution;", "Deconstruct conflict to identify underlying issues;", "Understand how collaborative and non-violent approaches to conflict undergird effective dispute resolution methods;", "Assess and re-evaluate one's own conflict style;", "Explain principles of negotiation, mediation, hybrids, arbitration and adjudication, and understand when each process is most appropriate to resolve a particular dispute;", "Recognize how conflict resolution processes are utilized in a peaceful civil society.", "Define terms, concepts, values, and phrases that are key to conflict resolution;", "Analyze a conflict to identify and describe contributing factors, roles played by the participants, how the conflict escalated, and what interests are important to the participants;", "Describe the range of conflict resolution processes, how they are connected to each other, and how the choice of a process affects the conflict;", "Explain the rights/interest/power paradigm and how it helps in classifying and choosing a method for resolving conflict;", "Identify ethical dilemmas for conflict practitioners, explain the nature of the dilemma, and identify an appropriate response;", "Distinguish between civil and criminal conflicts, and describe which conflict resolution methods are used for each class of conflicts;", "Although these three courses can be taken in any order, each builds on and adds to the foundation laid in the previous course.", "This course presents a basic overview of the concepts of peace, conflict, and violence.", "Speech Communication Option", "International Studies Option; and", "Spirituality and Personal Development Option.", "The word limits are hard limits.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "This course includes the independent development and practice of specific skills, such as mediation.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 34, "course_code": "PACS 323", "course_name": "PACS323 - Negotiation: Theories and Strategies (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["04:00PM - 05:20PM", "Email Address: eric.lepp@uwaterloo.ca", "Students will learn the theory behind the strategies and develop practical negotiation skills you can put to use in your daily life at home, at work, and in the community.", "As well, practical strategies and skills put forth by Harvard Business School are honed and practiced in real life negotiation role plays.", "Students are required to work in groups to facilitate class learning on assigned dates, develop and participate in realistic negotiation role plays, as well as evaluate the performance of classmates.", "Student’s active participation and willingness to be challenged to function outside their comfort zone are essential components of the learning experience.", "Identify the core principles of interest-based negotiation", "Present key negotiation concepts and skills to a forum of peers", "Design a real-life negotiation role play through team collaboration", "Prepare for and successfully conduct face to face negotiations", "Reflect on and identify lessons learned from each negotiation experience", "Introduction to the Course", "Expectations and Other Moving Pieces", "Begin reading in advance if possible", "September", "12 & 14", "Introduction to Negotiation", "- Terms", "- Approaches", "Power and Conflict", "- Cultural expectations in bargaining", "-Gender dynamics and negotiation", "-The constructive use of power", "- Selection of Groups", "- Selection of Negotiation dates", "September", "19 & 21", "- Introduction to Interest-based Negotiation", "- Separate the people from the problem", "- Work together to create option that satisfy both sides", "- Negotiating with power", "Fisher & Ury,", "September", "26 & 28", "- Claiming Value in Negotiation - - Creating value in Negotiation", "Malhotra & Bazerman", "- Blind Spots in Negotiation", "- Confronting Lies & Deception", "- Recognizing & Resolving Ethical Dilemmas", "- Negotiating from a Position for Weakness", "- When Not to Negotiate", "Malhotra & Bazerman", "17 & 19", "Legal limits on negotiation -- unconscionability and other concepts", "24 & 26", "Review Concepts and Practices for Negotiations", "“The Sluggers”", "31 &", "- Evaluations and Debrief reports due Friday by 4pm", "- Evaluations and Debrief reports due Friday by 4pm", "14 & 16", "- Evaluations and Debrief reports due Friday by 4pm", "21 & 23", "- Evaluations and Debrief reports due Friday by 4pm", "28 & 30", "- Evaluations and Debrief reports due Friday by 4pm", "The Conflict Resolution Toolbox: Models & Maps for Analyzing, Diagnosing, and Resolving Conflict.", "(Chapters 3 & 7 in particular) No", "New York: John Wiley & Sons Inc.", "Foolproof Strategies for Successfully Negotiating Your Way Through Every Situation Pollan, Stephen & Mark Levine. 1994.", "And a list of useful Definitions", "Team Negotiations & Debrief Reports 30%", "These should be contextualized and demonstrate engaged reading and summarization of text and ideas.", "Produce a realistic scenario for negotiation using the course material.", "Criteria for Design of Role Plays:", "Create Case (e.g. describe context, players & specific roles for team members as appropriate, issues)", "Incorporate at least 3 different issues for each side to resolve", "Incorporate an issue for deception for each side", "Incorporate an update that changes the game mid-negotiation", "Include in the package a section “For the Instructor”, outlining the key issues and what strategies or tactics from the text you expect will relate, as well as how these might play out in your scenario.", "lawsuits", "family dispute", "insurance claim", "environmental issues", "hostage negotiations", "getting humanitarian aid to affected communities in a conflict zone", "Debrief reports – Friday after the negotiation", "If you are not present in several class, it is not possible to make this up later.", "Email communication with instructor", "I will respond in a timely manner.", "I request that you use gender-neutral language except where you are referring to a specificgender.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "You can self-declare an absence on Quest for pandemic-related reasons or short-term reasons.", "Obtain a Verification of Illness Form (VIF) for other conditions and follow the instructions below for submission of a VIF and/or supporting documentation.", "This course includes the independent development and practice of specific skills, such as critical thinking, original writing and reflective practices.", "Library for research-based assignments", "Cross-listed courses"]}, {"course_id": 35, "course_code": "PHIL 215", "course_name": "PHIL215 - Professional and Business Ethics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["11:30AM -", "V. Fernandes", "Study of ethical and moral issues that typically arise in professional and business activity.", "In the context of this course we will look specifically at ethical issues and principles of conduct that are relevant to professionals and business people.", "Topics include: fundamentals of moral and political theory, ethical decision-making, professional responsibility, corporate social responsibility, and equality, among other things.", "Like many other courses in philosophy, this series of lectures, readings, and discussions will deal with a critical analysis of many and varied views regarding life, existence, values, religious belief, etc.", "Form an opinion on the importance of ethical reasoning in business and professional contexts.", "Identify ethical problems in complex professional and business related situations.", "Apply ethical concepts to particular business and professional situations.", "Explain the roles of professional codes of conduct and codes of ethics in real world contexts.", "1 Jan 6 - 10 Introduction", "Module 2 Check-in", "3 Jan 20 - 24 Ethical Decision Making", "Module 3 Check-in", "5 Feb 3 - 7 Equality & Discrimination", "Module 6 Check-in", "7 Feb 24 - 28 Markets & the Environment", "Module 7 Check-in", "Module 9 Check-in", "Module 10 Check-in", "11 Mar 24 - 28 Whistle-blowing and Codes of Ethics", "Module 11 Check-in", "Module 12 Check-in", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 36, "course_code": "PSYCH 339", "course_name": "PSYCH339 - Personnel Psychology (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Email: james.beck@uwaterloo.ca", "This course provides an overview of the major topics, theories, and empirical findings in the field of personnel psychology.", "By the end of this course you should have a strong working knowledge of a variety of topics that are critical to organizational functioning.", "Define job performance and describe how it is measured in organizations", "Understand the basics of measuring psychology constructs, including the topics of reliability and validity", "Identify common psychological constructs used for personnel selection", "Identify common methods used in personnel selection, including pros and cons associated with them", "Describe how personnel selection decisions are made", "Understand the legal and ethical issues involved in personnel selection", "1 Wed 04-Sep Introduction to course", "11 Wed 13-Nov Selection decision-making", "12 Mon 18-Nov Legal and ethical issues in selection", "Dark motives and elective use of brainteaser interview questions.", "Sona Participation and Research Experience Marks", "The two options for earning research experience grades; participation in research through online remotely operated and In Lab studies, as well as article review; are described below.", "Students may complete any combination of these options to earn research experience grades.", "Participation enables students to learn first-hand about psychology research and related concepts.", "Educational focus of participation in research", "To maximize the educational benefits of participating in research, students will receive feedback information following their participation in each study detailing the following elements:", "Provisions to ensure confidentiality of data", "**", "Identify the psychological concepts in the article and indicate the pages in the textbook that are applicable.", "Clearly evaluate the application or treatment of those concepts in the article.", "Intellectual property includes items such as:", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "This course includes the independent development and practice of specific skills, such as critical assessment of writing in a clear, concise, and persuasive manner.", "Library for research-based assignments"]}, {"course_id": 0, "course_code": "ACTSC 221", "course_name": "ACTSC221 - Introductory Financial Mathematics (Non-Specialist Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["ACTSC 221", "ACTSC 221 001", "I work from home on Tuesday and Thursday and I will have some availability on those days for Teams-based meetings.", "Email: bmatheson@uwaterloo.ca", "The theory of rates of interest and discount; annuities and sinking funds with practical applications to mortgage and bond questions.", "View requirements for ACTSC 221", "Be able to understand the basics of what drives the price of a stock using the Dividend Discount Model (DDM).", "Day", "Test Date & Coverage", "Module 1: Introduction to Interest: Sections a to d", "Module 1: Introduction to Interest: Sections e to i", "A1", "A2", "Family Day - No Lecture", "Module 3: Loans and Debts: Sections a and b", "Module 3: Loans and Debts: Sections c and d", "A4", "These dates largely correspond to when you should be done a given week’s work.", "I feel that you should attempt them after you finish the week’s studying to see how you are grasping the materials."]}, {"course_id": 1, "course_code": "CS 234", "course_name": "CS234 - Data Types and Structures (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Data Types and Structures Fall 2024", "MarkUs problems Email IAs at the course account", "Microsoft Teams problems Email ISG Coordinator Scott King", "Missed assignment or quiz Email ISG Coordinator Scott King", "Extenuating circumstances Email ISG Coordinator Scott King", "Error in mark entry Email IAs at the course account", "ISG Coordinator", "Introduction to commonly used data types, including lists, sets, mappings, and trees.", "This course introduces widely used and effective methods of data organization, focusing on data structures, their algorithms, and the performance of these algorithms.", "Students who successfully complete the course can use these tools to design and develop efficient programs for a wide variety of applications.", "Audience", "Students wishing to understand how choices made in program design can significantly affect performance and how to make these choices", "Highly recommended for students in Information Management and similar fields and for those in the Mathematics/Teaching plan", "The initial topics in CS 234 will present some material new to those coming out of CS 116 (but covered in CS 136) and some material new to those coming out of CS 136 (but covered in CS 116).", "Co-requisites: None", "Rance D. Neśaise, Data Structures and Algorithms Using Python, Wiley, 2010", "Describe basic quadratic sorting algorithms, such as Selection Sort or Insertion Sort.", "Given a simple, well-specified computational task, write a program in a high-level imperative language (e.g., Python, C, or Java) and generate appropriate test cases.", "Use as appropriate simple types, built-in compound types and control idioms, such as selection, iteration, and recursion.", "Explain the benefits of using abstract data types (ADTs) and data structures, and more generally, the concepts of modularity and data hiding, in solving problems in a wide variety of application areas.", "Understand the differing points of view of the user and provider of an ADT and the use of an interface to communicate between views.", "Explain and use the concepts of asymptotic running time, order notation, worst-case, average-case, and best-case complexity, and lower and upper bounds.", "Given a simple algorithm written in pseudocode, determine and informally justify its asymptotic running time, as expressed in order notation.", "Explain the basic structure of memory, including the distinction between external and internal memory and the concept of paging.", "Explain the complexity of some common implementations of these ADTs.", "Given a well-specified computational problem, determine which (if any) ADTs would be suitable.", "Explain how specialized data structures can lead to efficient solutions to specific real-world problems.", "Topics: User and provider viewpoints, planning and coding stages, abstract data types, modularity and data hiding, ADT Multiset, pseudocode, memory model", "Topics: Best, worst, and average-case running times, order notation, algorithm analysis", "Topics: Graph terminology, ADT Undirected Graph, ADT Directed Graph, implementations, depth-first search, breadth-first search", "Topics: Average-case analysis, interpolation search, heuristics, hashing, bucket sort, radix sort", "Notice of Recording", "Should problems occur, your early drafts serve as backups in case of computer problems, and provide evidence of your having attempted to submit work before the deadline.", "Re-mark requests", "The subject should be \"Ax re-mark request\" for x the number of the assignment.", "In the body of the email, include the rationale for the re-mark and the parts of the question that need atttention.", "Exam policies and missed examinations", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 3, "course_code": "AMATH 250", "course_name": "AMATH250 - Introduction to Differential Equations (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Differential Equations Winter 2025", "Solving linear differential equations: first- and second-order scalar equations and first-order vector equations.", "The main purpose of the course is to explore how first and second order differential equations (DEs) are used to model physical systems and predict their behaviour.", "first order linear DE models of compartment problems, atomic decay, and bodies in motion;", "first order separable DE models of population growth;", "a first order exact DE model of the electric dipole;", "second order linear DE models for oscillatory systems such as mass-spring-damper systems and electrical circuits;", "second order nonlinear DE models for suspended cables and rocket motion;", "linear vector DE models of multiple compartment problems and species interactions.", "Both analytical solution techniques and qualitative methods (direction field analysis, dimensional analysis, and phase portraits) will be presented as ways to gain information about system behaviour.", "We will investigate conditions for existence, uniqueness, and continuity of solutions of both first and second order initial value problems, and for systems in the plane.", "Maple will be used to generate numerical and graphical solutions, to illustrate concepts graphically, and to explore model behaviour.", "increase your comprehension of some of the many ways that differential equations can help us understand the real world;", "develop your ability to understand a mathematical model for a specific situation;", "explore analytical and qualitative solution methods for first and second order differential equations, and the use of Maple; and", "Please choose only one of the two options below.", "Submission Instructions", "Copyright Notice", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as solving differential equations.", "Library for research-based assignments"]}, {"course_id": 4, "course_code": "AMATH 251", "course_name": "AMATH251 - Introduction to Differential Equations (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Introduction to Differential Equations (Advanced Level)", "Email: cbauch@uwaterloo.ca", "Email: apunnavajhala@uwaterloo.ca", "This course offers a more theoretical treatment of differential equations and solution methods.", "In addition, emphasis will be placed on computational analysis of differential equations and on applications in science and engineering.", "Newton's enthusiasm was due to his success in using differential equations to give the first mathematical description of planetary orbits.", "Can you imagine what his reaction would be to the present widespread use of differential equations, with applications ranging from the space shuttle guidance system to epidemic models and neural networks?", "learn how to solve simple differential equations", "understand how differential equations can be applied in various fields", "We will cover portions of the following chapters from Boyce & DiPrima, in order:", "Chapter 1: Introduction to DEs", "Chapter 2: First-order differential equations", "Chapter 3: Second-order differential equations", "Chapter 7: Systems of linear equations", "Chapter 8: Numerical methods", "Chapter 9: Nonlinear differential equations and stability", "Elementary Differential Equations and Boundary Value problems.", "Assignments are to be brought to the start of lecture as a hard copy.", "Notice of Recording", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 5, "course_code": "AMATH 343", "course_name": "AMATH343 - Discrete Models in Applied Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Discrete Models in Applied Mathematics Fall 2023", "Difference equations and discrete dynamical systems.", "Mathematical models are taken from ecology, biology, economics, and other fields.", "Many such systems evolve over continuous time and can be modelled by differential equations, however, there are some systems for which the evolution is more appropriately described using discrete time intervals - for example, plant and animal populations where breeding and other effects can be assumed to take place at particular times of the year.", "As with differential equations, difference equations can be classified as linear difference equations and nonlinear difference equations.", "First, we will examine linear difference equations and a number of standard methods to solve them.", "The asymptotic behaviour of nonlinear systems can be quite complicated, leading to such things as “bifurcations,” “chaos,” and “fractals.”", "A few simple models will be studied in order to understand certain aspects of this behaviour.", "We will explore the notion of “fractal dimension” as well as some simple methods of generating fractal sets.", "Time permitting, we will look at iterated function systems (IFS), a simple, yet powerful, geometric method of generating and studying fractal sets.", "Week Of", "Week Number", "Introduction to Difference Equations & Some Applications", "Linear Difference Equations", "Linear Difference Equations", "A1 Due", "Linear Difference Equations", "Nonlinear Dynamics", "Nonlinear Dynamics", "Nonlinear Dynamics", "Chaotic Systems", "A4 Due", "Chaotic Systems", "Introduction to Difference Equations, With Illustrative Examples from Economics, Psychology and Sociology, by S. Goldberg (Wiley 1958).", "An Introduction to Difference Equations, Third Edition, by S. Elaydi (Springer 2005).", "Mathematical Models in Biology, by L. Edelstein-Keshet (SIAM Press 2005).", "An Introduction to Chaotic Dynamical Systems, by R.L. Devaney (Benjamin Cummings 1989).", "Your solutions must be legible, detailed and well-organized, indicating the logic and methods used in obtaining the answer and not merely a scribble of formulas and equations.", "In fact, you may view the assignments as a guide to what you are expected to know in this course.", "MIDTERM & FINAL EXAM"]}, {"course_id": 6, "course_code": "AMATH 331", "course_name": "AMATH331 - Applied Real Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["04:00PM - 05:20PM", "henry.shum@uwaterloo.ca", "Email: henry.shum@uwaterloo.ca", "Give mathematical definitions of limits for sequences of real numbers, vectors, and functions.", "Define open, closed, bounded, compact, and complete sets, and distinguish these concepts.", "Determine whether a vector-valued function is continuous or discontinuous .", "2.6-2.7", "Jan 27-31 Euclidean space, sequences and convergence in Rn, closed sets  1.2, 4.1-4.3 Assign 1", "Feb 24-28 Uniform continuity, normed vector spaces 5.1, 5.5, 6.1, 7.1  Midterm", "Mar 3 - 7 Normed and inner product spaces, sequences of functions 7.1, 7.2, 7.4, 8.1, 8.2", "Mar 31-Apr 4 Finite-dimensional spaces, series of functions 7.3, 7.5, 7.6, 8.4 Assign 4", "Real Analysis and Applications: Theory in Practice Available online: https://proxy.lib.uwaterloo.ca/login?url=http://dx.doi.org/10.1007/978-0-387-98098-0 No 0", "Principles of Mathematical Analysis.", "Topics covered in each assignment will be those of roughly the two weeks up to and including Monday of the week before the deadline.", "The final exam will be registrar-scheduled and in-person, if possible, with a duration of 150 minutes.", "Re-mark Request Policy", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 7, "course_code": "AMATH 332", "course_name": "AMATH332 - Applied Complex Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Applied Complex Analysis Winter 2025", "02:30PM - 03:20PM", "Complex numbers, Cauchy-Riemann equations, analytic functions, conformal maps and applications to the solution of Laplace's equation, contour integrals, Cauchy integral formula, Taylor and Laurent expansions, residue calculus and applications.", "In the case of illness, a VIF will be required.", "If the midterm is missed, after your instructor has verified you have valid reasons for it, and has received a VIF in case of illness, the weight will be shifted to the final exam.", "If the final exam is missed, and valid reasons are found for it, together with a VIF in case of illness, a grade of INC will be given to the student as long as assignments and midterms have seen a good performance.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 8, "course_code": "PMATH 331", "course_name": "PMATH331 - Applied Real Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["04:00PM - 05:20PM", "henry.shum@uwaterloo.ca", "Email: henry.shum@uwaterloo.ca", "Give mathematical definitions of limits for sequences of real numbers, vectors, and functions.", "Define open, closed, bounded, compact, and complete sets, and distinguish these concepts.", "Determine whether a vector-valued function is continuous or discontinuous .", "2.6-2.7", "Jan 27-31 Euclidean space, sequences and convergence in Rn, closed sets  1.2, 4.1-4.3 Assign 1", "Feb 24-28 Uniform continuity, normed vector spaces 5.1, 5.5, 6.1, 7.1  Midterm", "Mar 3 - 7 Normed and inner product spaces, sequences of functions 7.1, 7.2, 7.4, 8.1, 8.2", "Mar 31-Apr 4 Finite-dimensional spaces, series of functions 7.3, 7.5, 7.6, 8.4 Assign 4", "Real Analysis and Applications: Theory in Practice Available online: https://proxy.lib.uwaterloo.ca/login?url=http://dx.doi.org/10.1007/978-0-387-98098-0 No 0", "Principles of Mathematical Analysis.", "Topics covered in each assignment will be those of roughly the two weeks up to and including Monday of the week before the deadline.", "The final exam will be registrar-scheduled and in-person, if possible, with a duration of 150 minutes.", "Re-mark Request Policy", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 9, "course_code": "PMATH 332", "course_name": "PMATH332 - Applied Complex Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Applied Complex Analysis Winter 2025", "02:30PM - 03:20PM", "Complex numbers, Cauchy-Riemann equations, analytic functions, conformal maps and applications to the solution of Laplace's equation, contour integrals, Cauchy integral formula, Taylor and Laurent expansions, residue calculus and applications.", "In the case of illness, a VIF will be required.", "If the midterm is missed, after your instructor has verified you have valid reasons for it, and has received a VIF in case of illness, the weight will be shifted to the final exam.", "If the final exam is missed, and valid reasons are found for it, together with a VIF in case of illness, a grade of INC will be given to the student as long as assignments and midterms have seen a good performance.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 10, "course_code": "PMATH 333", "course_name": "PMATH333 - Introduction to Real Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Real Analysis Fall 2024", "11:30AM - 12:20PM RCH 112", "Topics discussed include the completeness properties of the reals; the density of the rationals; the topology of real n-dimensional space: open and closed sets, connectedness, compactness (by open covers), the Heine-Borel theorem, completeness; sequences in real n-dimensional space: convergence, Cauchy sequences, subsequences, the Bolzano-Weierstrass theorem; multivariable functions: limits, point-wise and uniform continuity, the extreme value theorem, uniform convergence of sequences of functions, Taylor's theorem, term-by-term differentiation of power series; integration in real n-dimensional space: Riemann integrability, Fubini's theorem for continuous functions on rectangles, term-by-term integration of power series.", "Ordered Fields", "The Riemann Integral", "Chapter 4. Sequences and Series of Functions", "Topology in Euclidean Space", "Differentiation in Euclidean Space", "Chapter 7. Jordan Content and Integration in Euclidean Space", "Course materials can be found at http://www.math.uwaterloo.ca/~snew/", "A suggested text is An Introduction to Analysis, by William Wade."]}, {"course_id": 11, "course_code": "PMATH 351", "course_name": "PMATH351 - Real Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Real Analysis Winter 2025", "09:30AM - 10:20AM RCH 301", "Email: kghare@uwaterloo.ca", "Email: nmrslavitch@uwaterloo.ca", "Email: s352lee@uwaterloo.ca", "Normed and metric spaces, open sets, continuous mappings, sequence and function spaces, completeness, contraction mappings, compactness of metric spaces, finite-dimensional normed spaces, Arzela-Ascoli theorem, existence of solutions of differential equations, Stone-Weierstrass theorem.", "Week 7: February 24 - 28 Section 3.1 - 3.2 Midterm February 28,", "Please note, you will be responsible for all material on assignments for midterms and final exams.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 12, "course_code": "PMATH 352", "course_name": "PMATH352 - Complex Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Complex Analysis Winter 2025", "Complex numbers provide the natural setting in which to study differentiable functions.", "Cauchy's theorem plays a central role in this subject, and many important results follow from it: Cauchy's integral formula, the theory of Taylor and Laurent series, Cauchy's residue theorem, the argument principle, the fundamental theorem of algebra, the maximum modulus theorem, Mittag-Lefler expansions, and Weierstrass products.", "We’ll start the course with a basic review of complex numbers, and the complex exponential and logarithm, complex analytic functions, and make our way towards Cauchy's theorem and its wonderful consequences.", "My lectures will draw on a number of books and sources, but I recommend Knopp's Elements of the Theory of Functions, and his Theory of Functions Parts I and II.", "Another reference is Marsden and Hoffman's Basic Complex Analysis.", "3) analytic functions, Cauchy Riemann equations", "6) complex integration", "8) Cauchy's Integral Formulas"]}, {"course_id": 13, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 14, "course_code": "CO 255", "course_name": "CO255 - Introduction to Optimization (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Introduction to Optimization (Advanced Level)", "08:30AM - 09:50AM MC 4040", "Linear optimization: feasibility theorems, duality, the simplex algorithm.", "Know a variety of optimization algorithms, including the Simplex method, cutting plane methods, and descent methods.", "Know and apply the definition and properties of convex sets and functions.", "Write the dual of a linear programming problem and understand the properties relating the primal and dual.", "Apply optimization methods to common continuous and discrete problems including game theory, flow, scheduling, and data science.", "Linear programming, Fourier-Motzkin elimination, and Farkas's lemma.", "Duality in linear programming.", "Convex optimization and the KKT conditions.", "Discrete optimization and total unimodularity.", "Applications of total unimodularity to matching and flow problems", "Application of nonlinear optimization to data science", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course.", "If you have questions or concerns about these matters, please email mathadvisor@uwaterloo.ca."]}, {"course_id": 15, "course_code": "CO 380", "course_name": "CO380 - Mathematical Discovery and Invention (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Mathematical Discovery and Invention Spring 2024", "Email: sejaques@uwaterloo.ca", "Teaching assistants available for drop-in help and discussion:", "List roughly a dozen standard problem solving techniques and provide examples in which each is useful", "Select and apply standard problem solving techniques as appropriate to a given problem", "Exception: each student can use one 72-hour extension they can apply to one assignment."]}, {"course_id": 16, "course_code": "CO 480", "course_name": "CO480 - History of Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["History of Mathematics Spring 2023", "09:30AM - 10:20AM STC 0010", "logan.crew@uwaterloo.ca", "Understand and solve a variety of basic mathematical problems of historical interest.", "Compare and contrast modern mathematics with its historical development.", "Examine equity, diversity, and inclusion in historical and modern mathematics.", "Tutte Introduction Discussion     Friday, May 19, 2023, at 11:55 PM Ungraded", "5/15-5/19", "Egypt", "Euclid: The Elements", "5/23-5/26", "6/12-6/16", "Al-Khwarizmi", "6/19-6/23", "Al-Andalus", "6/26-6/30", "7/4-7/7", "7/10-7/14", "7/17-7/21", "7/24-7/28", "7/31", "Introduction Discussion Ungraded", "The First Edition is a complete version of your project.", "In the Editorial Review, your group will be randomly and anonymously assigned the First Edition of another equally-sized group for peer review using PEAR.", "In such a situation, we might consider flexible options, such as changing project requirements, and providing a mechanism for groups to break apart that no longer have the capability to meet in a suitable work environment.", "If you would require further assistance because of multiple required absences, contact me via email and we can discuss on a case-by-case basis.", "Late submissions for projects cannot be accepted, particularly due to the timely nature required for distributing First Editions for editorial review, and the necessity of preparing timely reviews for your peers.", "You are always welcome to email the course instructor with questions, and some extreme circumstances may be handled separately on a case-by-case basis, but do not depend on this."]}, {"course_id": 17, "course_code": "CS 230", "course_name": "CS230 - Introduction to Computers and Computer Systems (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computers and Computer Systems Winter 2025", "08:30AM - 09:50AM MC 1085", "10:00AM - 11:20AM MC 2065", "10:30AM - 11:20AM MC 4045", "11:30AM - 12:20PM MC 2017", "MC6228", "TBA", "cs230@uwaterloo.ca", "TBA", "TBA", "An introduction to hardware and software concepts used in computer systems.", "Specific topics include machine-level programming, memory organization, and basic I/O mechanisms.", "Build and Execute", "Program in assembly language", "Understand the basics of machine internals", "Understand the basic elements of the compilation cycle", "Understand the basic principles of multiprocessing", "Note: Submissions for programming questions should only use code and concepts taught during lectures.", "Use of code or advanced concepts not taught in the course will be viewed as a possible violation of Academic Integrity for passing off someone else's work as your own.", "The assignments have a flexible late-day system detailed here:", "These cannot be used on quizzes.", "Multiple assignment extensions can be used on one assignment and/or split across different assignments.", "You do not need a reason to use assignment extensions, you may use them as you please.", "These servers are shared with all other CS courses.", "Students are expected to start assignments early in case something unexpected occurs closer to the deadline.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 18, "course_code": "CS 330", "course_name": "CS330 - Management Information Systems (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Management Information Systems Winter 2025", "Email: kevin.lanctot@uwaterloo.ca", "An introduction to information systems and their strategic role in business.", "Topics include types of information systems, organizational requirements, systems development strategies, decision support systems, data and information management, and information systems management, control, and implementation.", "This course is aimed at students who are not CS majors but are interested in continuing their study of computer science beyond first year.", "Make informed decisions about using technology in a business environment.", "Define and explain the characteristics of a variety of business information systems.", "Describe strategic roles and management usage for information systems in business.", "Understand the relationships among various information systems.", "A1", "Feb 25, 27 Topic 4 - Introduction to IS (Ch 1 in text)", "A2", "A4", "A copy of the 7th edition will be placed on 3-hour reserve in the Davis Library.", "Evaluation", "If you miss the final assessment, you will be given an INC if there is a strong reason for missing it (generally a serious medical issue verified by a VIF).", "This course includes the independent development and practice of specific skills, such as designing information systems.", "Library for research-based assignments", "Physical and Mental Health", "See https://uwaterloo.ca/campus-wellness/ for a list of on-campus supports and workshops.", "In particular:", "Intellectual property includes items such as:"]}, {"course_id": 19, "course_code": "CS 338", "course_name": "CS338 - Computer Applications in Business: Databases (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Computer Applications in Business: Databases Winter 2025", "A user-oriented approach to the management of large collections of data.", "Design relational databases", "Construct SQL queries for data retrieval", "Develop strategies for data storage and backup", "Introduction and Terminology", "Relational Data Model", "Relational Algebra", "SQL: Aggregation and Grouping", "SQL: Data and Schema Modifications", "SQL: Null Values", "ER Models", "EER Model", "EER to Relation Mapping", "DBMS Concepts and Architecture", "Transaction Processing", "Database Recovery", "Database Security", "Distributed Databases", "Business Analytics", "We highly recommend thoroughly understanding and verifying your assignment solutions to set yourselves up for success in this course since  exams in CS 338 will be closed-book, and without a strong understanding of the assignments, you may find the exams challenging."]}, {"course_id": 20, "course_code": "CS 370", "course_name": "CS370 - Numerical Computation (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["10:00AM - 11:20AM MC 2034", "Monday -", "Monday", "Principles and practices of basic numerical computation as a key aspect of scientific computation.", "Approximation by splines, fast Fourier transforms, solution of linear and nonlinear equations, differential equations, floating point number systems, error, stability.", "Understand floating point number representations and their limitations", "Analyze rounding error in a floating point calculation", "Perform stability and trunction error analyses of time integrators", "Understand and perform the fast Fourier transform for 1D and 2D numerical data", "Solve linear systems and perform basic linear algebra manipulations using LU factorizations", "Evaluate asymptotic behavior of numerical linear algebra operations in terms of floating point operations", "Use power iteration to find the dominant eigenvalue of a matrix", "Week of Jan 20: Splines & Parameterized Curves", "Week of Mar 3: FFT Applications", "Week of Mar 10: Google Page Rank / Power iteration", "Week of Mar 17: Gaussian Elimination & LU factorization", "Week of Mar 23: Numerical Linear Algebra Norms and Conditioning", "Week of Mar 31: More Numerical Linear Algebra, End of classes", "You should start the first assignment as soon as possible to begin setting up and getting familiar with these tools.", "The official guide for installing and using Jupyter is here: https://docs.jupyter.org/en/latest/install.html", "There are a huge number of online sources of introductory material for working with Jupyter/Python.", "The focus of this course is on learning general numerical computing concepts, rather than the syntax of a particular programming language.", "Please inform the instructor to make the deadline adjustment.", "Your code is an important part of the assignment, and as such it should be readable and well-commented.", "Assignment figures and graphs should be carefully thought out and labelled to present the data and your conclusions in an effective and clear manner.", "Any code and algorithms you write should be sufficiently well documented through code comments or descriptions as to be readily understood.", "This code submission should allow the TAs to run your code if and when necessary to verify the results that your code produces.", "Collaboration and Plagiarism", "We encourage you to discuss general concepts and problems with classmates, TAs, and instructors.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Intellectual property includes items such as:", "Avoiding Academic Offenses", "With these facts in mind, one way that everyone in our class can contribute to a safer and more equitable learning environment is to  stay home when you are ill and, at minimum, wear a mask if you suspect you might be contagious.", "A range of on- and off-campus resources are available including:"]}, {"course_id": 21, "course_code": "CS 371", "course_name": "CS371 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 22, "course_code": "CS 430", "course_name": "CS430 - Applications Software Engineering (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Applications Software Engineering Fall 2024", "Email: nasif.ahmed@uwaterloo.ca", "An investigation into the role and function of software engineering practice in the construction of computer based systems.", "Topics include: requirements and specification; documentation techniques; analysis and design; implementation; testing and maintenance; management issues.", "Object-Oriented & Classical Software Engineering 8th ed., by by S.R. Schach QA76.758.S318 2011 No", "This means that you must decide whether to exercise your option to submit late before the deadline, and refrain from making a partial submission in this case.", "This course includes the independent development and practice of specific skills, such as selecting which life-cycle model, team organization, testing strategy, etc. would be most appropriate in a given situation, then justifying your choice using the concepts presented during the lectures.", "Library for research-based assignments"]}, {"course_id": 23, "course_code": "CS 436", "course_name": "CS436 - Networks and Distributed Computer Systems (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Networks and Distributed Computer Systems Winter 2025", "Mohammad Abuyaghi", "Email: mohammad.abuyaghi@uwaterloo.ca", "An introduction to networks, protocols, and distributed systems.", "Exemplify the basic functionality and components of an operating system.", "Recall, explain, and compare transmission media and access control schemes.", "Recall, summarize, and exemplify connection management and reliable message transmission.", "Recall, explain, and compare naming and name resolution techniques, including mobility.", "Recall, summarize, and explain security/privacy concepts in network protocols and distributed systems", "Recall, explain, and compare high-level communication services and distribution services.", "We will take a ‘top-down’ approach to networking and distributed systems, focusing on the networking concepts and distributed systems mechanisms underlying widely used networked applications and systems.", "Application layer", "Network layer", "Routing principles: Link state and distance vector algorithms, hierarchical routing, routing among autonomous systems.", "Security", "Distributed systems", "Design principles: End-to-end principle, hierarchy, replication and failover, etc.", "A Top-Down Approach, James Kurose & Keith Ross, Pearson No", "Distributed Systems: Principles and Paradigms, Maarten Van Steen & Andrew S. Tanenbaum, Prentice Hall No", "Try not to leave these until the last minute.", "In case of a missed exam, a VIF must be uploaded to the university's online portal.", "Continuity of Education Plan", "This includes relevant web sources.", "Intellectual property includes items such as:"]}, {"course_id": 24, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 25, "course_code": "MATH 247", "course_name": "MATH247 - Calculus 3 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Topology on RN: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. (~3 weeks)", "Differentiation: partial differentiability, differentiability, chain rule, [midterm likely here], Taylor polynomials, extreme value problems. (~4 weeks)", "Integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. (~3 weeks)", "Local properties of continuously differentiable functions:  open mapping theorem, inverse function theorem, implicit function theorem. (~2 weeks)", "11:30AM - 12:20PM QNC 2501", "Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem.", "Topology of real n-dimensional space: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. Differential calculus on multivariable functions: partial differentiability, differentiability, chain rule, Taylor polynomials, extreme value problems. Riemann integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem."]}, {"course_id": 26, "course_code": "MATH 239", "course_name": "MATH239 - Introduction to Combinatorics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics Winter 2025", "11:30AM - 12:20PM MC 4059", "09:30AM - 10:20AM MC 4021", "P. Nelson", "08:30AM - 09:20AM QNC 1502", "S. Pfannerer-Mittas", "10:30AM - 11:20AM MC 4058", "11:30AM - 12:20PM MC 4058", "09:30AM - 10:20AM MC 4042", "02:30PM - 03:20PM", "10:30AM - 11:20AM PHY 150", "04:30PM - 05:20PM", "You should have no reason to contact them directly, but you can find their email addresses through Learn.", "First name Last name", "Guilherme Zeus Dantas E Moura", "Theodore Morrison", "Matthew Kroeker", "Introduction to graph theory: colourings, matchings, connectivity, planarity.", "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.", "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 27, "course_code": "MATH 249", "course_name": "MATH249 - Introduction to Combinatorics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics (Advanced Level)", "09:30AM - 10:20AM MC 2017", "For graph theory, while we will focus on the same topics covered in MATH 239 (planarity and bipartite matching), our coverage of those topics will differ substantially in depth and in the techniques that we employ; in particular, we will see striking applications of algebra.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 28, "course_code": "PMATH 320", "course_name": "PMATH320 - Euclidean Geometry (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["10:30AM - 11:20AM RCH 207", "Euclid's axioms, triangle centres, conic sections, compass-and-straightedge constructions, isometries of the Euclidean plane and of Euclidean space, regular and star-shaped polygons, tessellations of the Euclidean plane, regular and quasi-regular polyhedra, symmetries of polygons and polyhedra, four-dimensional polytopes, sphere packings, and the kissing problem.", "Axioms (Euclid, straight-edge and compass)", "Conic sections", "Sphere packings and the kissing problem", "They will each be worth 5% for a combined total of  50% of your grade."]}, {"course_id": 30, "course_code": "PMATH 330", "course_name": "PMATH330 - Introduction to Mathematical Logic (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Mathematical Logic Winter 2025", "08:30AM - 09:20AM", "I’m a researcher in mathematical logic, so this course forms the backbone of my career.", "A broad introduction to mathematical logic.", "The notions of logical consequence and derivation are introduced in the settings of propositional and first order logic, with discussions of the completeness theorem and satisfiability", "We will spend the first half of the course covering propositional logic, with a midterm on February 14.", "We will spend the second half covering first-order logic.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 31, "course_code": "PMATH 340", "course_name": "PMATH340 - Elementary Number Theory (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "09:30AM - 10:20AM MC 4060", "Office hour: Wednesday, 1:00pm - 2:00pm", "Solve linear diophantine equations", "Compute continued fraction expansions of rational numbers", "Convince their friends and family that number theory is excellent", "A Friendly Introduction to Number Theory (by Silverman)", "Scheme 2 - Available if you sit all 3 quizzes and score above 75% in each of them.", "A1 - 24th", "A2 - 7th Feb", "A4 - 14th Mar", "Q1 - 31st", "Q2 - 7th Mar", "There will be no midterms!", "In case of a missed assessment, you should notify your instructor via email within 24 hours of the assessment's completion/due date in order to receive an accommodation.", "Notice of Recording"]}, {"course_id": 32, "course_code": "PMATH 432", "course_name": "PMATH432 - Mathematical Logic (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Mathematical Logic Fall 2024", "Pending approval, I hope to teach a graduate topics course in model theory (PMATH 930) in the Fall of 2025.", "Topics: The completeness and compactness theorems of first order logic.", "Zermelo-Fraenkel set theory and ordinals/cardinals.", "First-order languages and structures, syntactic provability and semantic truth, the soundness and completeness theorems, compactness and its consequences, elementary equivalence, the ZFC axioms of set theory, ordinals, cardinals, computability, and Gödel's incompleteness theorem."]}, {"course_id": 34, "course_code": "PMATH 334", "course_name": "PMATH334 - Introduction to Rings and Fields with Applications (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM MC 4041", "This course provides an introduction to the fundamental algebraic structures of rings and fields, with an emphasis on their properties and applications.", "Topics include polynomial rings, field extensions, and their connections to areas such as number theory and geometry.", "Memerize fundamental concepts of algebraic structures, including groups, rings, integral domains, fields, vector space, etc.", "Analyze structures of rings and fields using homomorphisms.", "Analyze and identify reducibility of a polynomial over a field", "Understand field extension and be able to construct extension fields", "Understand some standard algebra proof techniques.", "Week 3 Integral Domains and Fields Chapter 3", "Week 9 Unique Factorization Domains, Divisibility in Polynomial Rings Chapter 6, 7", "Week 12 Extension Fields Chapter 9", "Week 13 Straight-edge and Compasses Constructions  Chapter 10", "Evaluation", "While collaboration in understanding the material is encouraged, the work submitted must be your own, written independently.", "For example, submitting 60 minutes late will result in a maximum possible score of 40%, assuming a perfect score.", "Calculators and reference sheet are not permitted during these assessments.", "Accommodation Requests", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as reading and writing proofs.", "Library for research-based assignments"]}, {"course_id": 35, "course_code": "PMATH 336", "course_name": "PMATH336 - Introduction to Group Theory with Applications (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Group Theory with Applications Fall 2023", "08:30AM - 09:20AM", "Section/chapter numbers refer to the free online textbook \"Abstract Algebra: Theory and Applications,\" 2022 edition, by Thomas W. Judson.", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 36, "course_code": "PMATH 347", "course_name": "PMATH347 - Groups and Rings (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Groups and Rings Fall 2024", "08:30AM - 09:20AM", "Objective: This course is designed to introduce the theory of groups and rings to students.", "Group Theory: Understand fundamental concepts such as groups, subgroups, and homomorphisms, and apply key theorems like Lagrange’s theorem and Sylow theorems.", "Ring Theory: Learn the properties and structures of rings, ideals, and polynomial rings, including integral domains and fields.", "Their total marks are equal to an assignment and can be used to replace the second-lowest assignment mark.", "Tests will be conducted online at the scheduled time slots", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 37, "course_code": "PMATH 348", "course_name": "PMATH348 - Fields and Galois Theory (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Fields and Galois Theory Winter 2025", "08:30AM - 09:20AM", "Fields, algebraic and transcendental extensions, minimal polynomials, splitting fields, and the structure of finite fields.", "Solvable groups and the insolvability of the quintic.", "fields, algebraic and transcendental extensions, minimal polynomials, splitting fields, finite fields, separable polynomials", "Since quizzes are timed assessments, it is important to know the contents well before taking them.", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 38, "course_code": "PSYCH 101", "course_name": "PSYCH101 - Introductory Psychology (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Email: nhwegenschimmel@uwaterloo.ca", "One challenge of online course work can be the absence of a social network.", "There are two discussion boards set up for you to communicate with your classmates to facilitate your success in the course.", "Please be generous in your participation on these discussion boards, returning occasionally to read and respond to your classmates.", "The goal here is to facilitate communication between students and to reduce redundancies in correspondence, which can be overwhelming in online formats.", "A general survey course designed to provide the student with an understanding of the basic concepts and techniques of modern psychology as a behavioural science.", "Introductory Psychology will introduce students to the fundamental theories, concepts, methods, and issues encountered in the field of psychology.", "In addition to learning the core concepts of the field, this course is also meant to instruct the student in the scientific method (as it is used in the social sciences), to give students insight into themselves and their relationships with others, and to develop skills that will help students be successful in university and beyond.", "Explain and apply the core concepts of psychology.", "This will provide a foundation of knowledge upon which you can build in upper year psychology courses.", "Gain greater insight into yourself, others, and the human condition: Apply core concepts to yourself and others; recognize and value human diversity.", "Module 10: Behaviour in Groups", "Introduction to psychology.", "Introduce Yourself Non-completion -2%", "Extensions for extenuating circumstances may be granted at the discretion of the instructor.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 39, "course_code": "PSYCH 101R", "course_name": "PSYCH101R - Introductory Psychology (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["10:00AM - 11:20AM REN 2106", "serena.mcdiarmid@uwaterloo.ca", "11:30AM -", "serena.mcdiarmid@uwaterloo.ca", "Instructor - Serena McDiarmid, MASc, BEd, Sessional Instructor, Social Development Studies", "serena.mcdiarmid@uwaterloo.ca Pronouns she/her", "“I went to the University of Waterloo for my undergraduate degree in health studies and even took some courses at Renison!", "I loved learning about people and ways I could help them, but I also felt a lot of pressure to get high grades and stand out.", "I realized that mistakes were okay and a normal part of learning, and that a bad grade didn't make me a bad person.", "Instructor - Cameron Smith, PhD, Sessional Professor, Social Development Studies", "“I began my university career in Mathematics and Business Administration.", "I remember feeling like I went from being a big fish in a little pond to being a guppy in the ocean.", "It honestly took me a few years before I really felt like I knew what I was doing and got used to studying at a university level.", "Q: Can I play the two professors off of each other like a sitcom Mom and Dad?", "A general survey course designed to provide the student with an understanding of the basic concepts and techniques of modern psychology as a behavioural science.", "We will explore topics ranging from human development throughout the lifespan, to learning and memory, to psychological disorders and the therapies that are used to treat them.", "Explain key concepts from across the discipline of psychology using appropriate terminology.", "Describe the methods of investigation used in psychology, and the strengths and limitations of these methods.", "Identify and communicate the influence of psychological concepts on behaviour and/or systems in everyday situations.", "Apply the findings of psychological research to your life and to important issues in our society and the world at large.", "Sept 11 & 13: Human Development", "Prof. Smith", "Sept 18 & 20: Research Methods", "Prof. Smith", "Sept 27: Senses & Perception", "Prof. Smith", "Prof. Smith", "Prof. Smith", "Prof. Smith", "It is available through a number of different avenues.", "Digital e-version can be purchased at https://uwaterloo-store.vitalsource.com/products/psychology-in-modules-david-g-myers-c-nathan-v9781319355487?term=9781319132095.", "Although we do not officially recommend it using the 12th edition, the differences in these editions are not major.", "From our experience, students can build their skills in note taking, studying, understanding concepts, and test-taking as the term goes on.", "Each quiz contributes to students’ grade enough to make the time and effort they put into it worthwhile, but not so much that a particularly challenging week in their lives will have a significant impact on their final grade.", "Quizzes are multiple choice", "If you want to help a friend succeed, there are other ways to do that without committing academic misconduct - such as studying together.", "*", "As students in this course, you will be exposed to many new ideas and concepts that other people in your life would find useful and interesting!", "In this assignment, your goal is to choose one of the concepts introduced in the first five weeks of class and teach someone else about it.", "Ideas of what videos could look like:", "A narrated slideshow", "A persuasive speech", "A doodle video", "Your co-workers", "The information must be accurate and demonstrate a depth of understanding about the meaning and significance of the concept/topic.", "You will also be exposed to new ideas that relate strongly to your own life.", "How was the concept/theory relevant to the situation?", "Sona Participation and Research Experience Marks", "Participation enables students to learn first-hand about psychology research and related concepts.", "Educational focus of participation in research", "To maximize the educational benefits of participating in research, students will receive feedback information following their participation in each study detailing the following elements:", "Provisions to ensure confidentiality of data", "Participation in remotely operated and in-person in lab studies has increment values of 0.5 participation credits (grade percentage points) for each 30-minutes of participation.", "**", "Identify the psychological concepts in the article and indicate the pages in the textbook that are applicable.", "Clearly evaluate the application or treatment of those concepts in the article.", "Accommodation for Students with Disabilities", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Do you want professors and interviewers to call you by a different first name?"]}, {"course_id": 40, "course_code": "PSYCH 211", "course_name": "PSYCH211 - Developmental Psychology (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Demonstrating your learning through 3 non-cumulative tests spread across the semester.", "Course Philosophy and Expectations", "The course designers have taken independent study time into account when structuring the course, and have developed lecture videos surveying many of the core concepts to further support your learning.", "Also keep in mind that the members of the course team are human beings as well trying their best to make this a positive experience for everyone involved.", "Read, interpret, and communicate the methods and findings of academic research papers.", "Apply their knowledge of developmental processes in childhood to the real world, including their own lives!", "To order your textbook(s), please choose one of the following options:", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "eText with Achieve access code", "In the case of emergency that may result in late submission, please contact the course instructor(s) to discuss potential extensions.", "Accommodation requests based on religious/cultural grounds", "Requests for alternate sittings for tests, quizzes, or final exams based on religious/cultural grounds must be made to the Associate Dean of Undergraduate Studies for the Faculty of Arts in writing by the following deadlines:", "If such a conflict arises, the Associate Chair for Undergraduate Affairs is available for consultation and to mediate a resolution between the student and instructor.", "The University's Indigenization Strategy website", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 41, "course_code": "PSYCH 212", "course_name": "PSYCH212 - Educational Psychology (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Instructor: Dr. Maureen Drysdale", "Please email Dr. D and copy the TAs to request one.", "Please provide several possible times for scheduling the meeting.", "A consideration of the main variables affecting learning in the classroom with special focus upon the conditions essential to efficient learning.", "The content of this course includes aspects of human development related to learning, theories of learning, and the application of psychological principles in educational settings.", "Understand aspects of human development through the school years.", "Explain how we learn and experience learning problems.", "Module 3: Self, social, and moral development Quiz 1", "Module 9: Social cognitive views of learning and motivation and motivation in learning and teaching", "For medical exceptions - see policy for accommodations and deferrals below.", "We encourage all students to complete the quizzes and case studies with integrity.", "This course includes the independent development and practice of specific skills, such as responding to short-answer questions on the quizzes.", "Extensions and Deferrals Policy for All Assessments", "Only one short-term absence can be self-declared per academic term.", "Students can self-declare one Covid-19-related absence in an academic term.", "We understand that these circumstances can be troubling, and you may need to speak with someone for emotional support.", "Resources from Centre for Innovation in Campus Mental Health"]}, {"course_id": 43, "course_code": "STAT 331", "course_name": "STAT331 - Applied Linear Models (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Applied Linear Models Winter 2025", "08:30AM - 09:50AM MC 4020", "02:30PM - 03:20PM", "RCH 101", "Thursdays from 3:00-4:00pm in M3 3021", "Modelling the relationship between a response variable and several explanatory variables (an output-input system) via regression models.", "Model diagnostics and improvement.", "Algorithms for variable selection.", "Review of basic Normal theory, t, chi-squared, and F distributions.", "Simple linear regression.", "Analysis of variance.", "Multiple linear regression, variable selection techniques, indicator variables, diagnostics.", "Brief introduction to non-linear regression, factorial experimentation.", "Registered students can enroll in the class discussion board through Piazza.", "Search for your question first before posting.", "Do not expect a full solution to your question.", "To help maintain a safe, respectful, and productive community in which we – students and teaching team alike – can take risks in our learning/teaching, tackle challenging concepts, and ultimately grow as learners, we should endeavor to follow these mutual expectations:", "Explain the main concepts of linear regression models.", "Understand the methods of least squares and maximum likelihood estimation for model parameters.", "Interpret the model and its parameters (e.g., regression coefficients) in the context of any application.", "Draw inferences from a fitted model about the parameters of interest and make predictions.", "Apply the previous two outcomes when fitting linear models to real data using R.", "Assess model quality by diagnosing violations in underlying model assumptions (and identify strategies for improvement).", "Evaluate competing fitted models built using various model selection methods (and choose between them).", "Introduction", "The Straight Line Model", "Model formulation and interpretation", "Least squares estimation", "Mean response and residual variance estimation", "Introduction to R/RStudio", "Maximum likelihood estimation", "Estimators and their properties", "Important distributions", "Distributions of estimators", "Confidence intervals", "O - Ch. 2-4", "Straight Line Model in R", "Prediction intervals", "Intervals in R", "Hypothesis testing", "O - Ch. 4-5", "ANOVA and F test", "Model limits", "Data transformations", "O - Ch. 4-6", "O - Ch. 7", "A1 and Q1 Solutions", "Multivariate normal distribution", "The Linear Model", "Examples", "O - Ch. 8-9", "Estimation", "Estimators and their properties", "Distributions of estimators", "O - Ch. 9, 11, 12", "ANOVA and F test", "Significance tests", "General linear hypothesis", "O - Ch. 9, 11, 12", "A2 and Midterm Solutions", "Case Study: South African heart disease", "Nested models", "Additional sum of squares", "O - Ch. 12", "Outliers", "O - Ch. 13-14", "Influence", "O - Ch. 14-15", "A3 and Q2 Solutions", "One-variable-at-a-time selection methods", "Criteria-based selection methods", "O - Ch. 16", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solve exercises from the textbook on your own.", "Introduction to Regression Modeling by Abraham and Ledolter This textbook is an optional reference book (available for free on LEARN).", "R and R-Studio Free software.", "To serve as an opportunity to demonstrate your understanding, application, and integration of the course material, including practical application of the skills/concepts with the statistical software, R.", "Missed Assignment: The time window to complete these assessments are generous and, in general, a sickness lasting a couple of days will not be enough of a reason to ask for alternative accommodations and/or extension.", "Tips for Success", "Students should critically compare their work with available solutions and against the solutions of fellow classmates.", "Notice of Recording", "To help you decide if you should isolate, you can use the provincial self-assessment tool.", "In the scenario where we must transition back online the following contingencies will be used:", "These materials are made available for the personal use of students registered in the current offering of this course.", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical proofs and the fitting, interpretation, and assessment of linear models in real applications.", "Library for research-based assignments"]}, {"course_id": 44, "course_code": "STAT 332", "course_name": "STAT332 - Sampling and Experimental Design (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Sampling and Experimental Design Winter 2025", "Email: schonlau@uwaterloo.ca", "Designing sample surveys.", "Analysis of variance.", "Designing for comparison of groups.", "Sampling: explain the effect of the finite population correction", "Sampling: Design and analyze a stratified random sample", "Experimental: Explain factorial design", "Experimental: Compare and contrast experimental design and observational studies", "5 2025-01-21 6 regress A1 out", "15 2025-03-04 4 Anova/F-test", "Slides Online in learn Yes 0", "Slides:  I am reworking some slides and will post them one-by-one into learn before class.", "data collection) 2%", "Activities supporting in-class analysis: The in-class analysis will require data collection (and possibly other activities).", "All team members must meaningfully contribute to the analysis and to coding.", "Projects must not use data sets that one of the team members has used for similar projects in previous courses.", "You must write up solutions using your own words and write your own programs.", "Give a clear explanation as to why you think you deserve a different mark."]}]