[{"course_id": 54, "course_code": "CHEM 400", "course_name": "CHEM400 - Special Topics in Chemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Special Topics in Chemistry Winter 2025", "A selection of current and advanced topics of interests in many areas of chemistry.", "\"Quantum Mechanics in Chemistry\" is the title for this section of Chem400", "In the Winter 2025 term the focus of the course will be electronic structure theory and a smaller segment on coupled electron-nuclear motion, developing theory beyond the Born Oppenheimer approximation.", "The course will cover a description of the basic electronic structure problem introducing an atomic orbital basis set, Slater determinants and the Slater-Condon rules.", "In another segment we will discuss vibronic coupling, introducing diabatic electronic states and simple model problems and introduce techniques to solve them using simple Python programs.", "Have a good understanding of the electronic structure problem in Chemistry and how it connects to thermochemistry.", "Have an in depth understanding of the Hartree-Fock method and the basic Hartree-Fock algorithm.", "Be able to construct Hamiltonian matrix for small problems using Slater-Condon rules", "Have introductory knowledge of Coupled Cluster methods for ground and excited states, and the concept of size-consistency.", "Have introductory understanding of non-adiabatic nuclear dynamics going beyond the Born-Oppenheimer approximation.", "Week 1,2: General introduction to quantum mechanics and the main uses in chemistry / thermochemistry.", "Discussion of fundamental principles of Density Functional Theory.", "Extension to multiple electronic surfaces.", "Vibronic models beyond Born-Oppenheimer.", "Notice of Recording", "Since assignments are at the core of the assessment for the class, I want everybody to do all of these assignments.", "Students can contact the instructor."]}, {"course_id": 55, "course_code": "CHEM 404", "course_name": "CHEM404 - Physicochemical Aspects of Natural Waters (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Physicochemical Aspects of Natural Waters Fall 2024", "This will be followed by a review of fundamental thermodynamic concepts, including chemical potential, Gibbs free energy, thermodynamic equilibrium, enthalpy and entropy.", "Carbon dioxide equilibria in natural waters will then be briefly discussed.", "understand the complex processes determining the fate of pollutants in natural waters", "predict the fate of chemicals in natural waters based on their physicochemical properties", "Acids and bases in water", "Sorption", "Diffusion", "Stumm and Morgan, J. Wiley & Sons, Inc. (GB 855.S78 1996) Supplementary reading No", "Each student will be required to present a critical summary of an original research paper published in current scientific literature (please note that no review papers will be allowed)."]}, {"course_id": 56, "course_code": "CHEM 430", "course_name": "CHEM430 - Special Topics in Biochemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Special Topics in Biochemistry Winter 2025", "08:30AM - 09:20AM", "RCH 204", "D. Sychantha", "Discussion of specialized topics related to the research interests of the members of the Centre.", "For example, recent offerings have included: Metalloproteins and Metalloenzymes; Heme Proteins; Chemistry of Enzymatic Reaction Mechanisms; Peptides - Synthesis, Structure and Function; Food Enzymology; Advanced Microbial Physicology; NMR in Biological Systems.", "Antibiotics play essential roles in all branches of healthcare, and the emergence and spread of antibiotic-resistant bacteria pose a significant risk to public health.", "It will also explore the complexities of antimicrobial resistance mechanisms and practical approaches to overcome them.", "The chemical characteristics of antibiotics", "The biological interactions of antibiotics with bacteria and humans", "The mode of action of major antibiotic classes", "Methods for antitbioc discovery"]}, {"course_id": 57, "course_code": "CHEM 432", "course_name": "CHEM432 - Metabolism 2 (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "11:30AM - 12:20PM", "RCH 211", "Dara Gilbert", "Biosynthesis and mode of action of selected cofactors.", "Structure-function relationships of enzymes.", "THF and vitamin B12 reactions", "Changes to these and other pathways in cancer", "engineering these pathways in microorganisms to produce useful chemicals", "For each of these topics we will cover the chemistry and enzymes of each step in the pathway.", "How the inhibition of some of the enzymes involved can that human diseases such and autoimmune disorders and cancer.", "to learn the chemistry of the steps in the pathways covered", "to understand the chemical \"logic\" of these steps", "to be able to interpret data and even propose experiments to exploit the pathways to treat diseases and synthesize useful compounds", "develop skills for working in groups", "Biochemistry 4th edition Voet and Voet", "Fundamentals of Biochemistry: Life at the molecular level by Voet, Voet and Pratt", "mock OGS proposal 40", "participation in class discussion includes pop quizzes 10", "Notice of Recording", "Oral presentations will be recorded so that I can mark them.", "you must completely rewrite source material in your own words.", "quotations marks around large sections of text do not make it okay"]}, {"course_id": 58, "course_code": "CHEM 433", "course_name": "CHEM433 - Advanced Biochemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Advanced Biochemistry Winter 2025", "08:30AM - 09:50AM MC 4041", "Department of Chemistry", "Biochemistry of nitric oxide.", "Lectures will also include class discussion of journal articles covering problems in biochemistry related to topics in this course.", "Understand the major nitrogen and ammonia assimilation pathways in nature", "Understand the major catabolic and biosynthetic pathways for the amino acids", "Be able to draw the chemical structures of the intermediates in these pathways", "Be able to draw and explain the chemical mechanisms of the enzymes involved in these metabolic pathways", "Ammonia Assimilation", "a.  glutamine synthetase", "Glutamate Family of Amino Acids", "Aspartate Family of Amino Acids", "Aromatic Amino Acids", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 59, "course_code": "CHEM 464", "course_name": "CHEM464 - Spectroscopy in Organic Chemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM RCH 211", "10:00AM - 11:20AM RCH 309", "Elucidation and identification of organic structures by contemporary spectroscopic techniques.", "Apply various spectroscopic techniques for structure elucidation of organic compounds including stereochemistry", "Explain how basic structure and bonding principles influence spectroscopic signals", "Explain the fundamental principles of spectroscopic techniques used for elucidating the structures of organic molecules", "In order to achieve these learning outcomes, students should note the following:", "Fundamental principles are important - do not try to apply advanced techniques without understanding the basics", "Week 1-3          1H NMR Spectroscopy: Basic principles, chemical shift, spin-spin coupling, equivalence of nuclei", "Notice of Recording"]}, {"course_id": 60, "course_code": "CHEM 481", "course_name": "CHEM481 - Rational Design of Potential Drug Candidates (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Rational Design of Potential Drug Candidates Fall 2024", "S. Kalyaanamoorthy", "subha.kalyaanamoorthy@uwaterloo.ca", "Instructor: Dr. Subha Kalyaanamoorthy", "This course provides an introduction to strategies for design of potential drug candidates.", "It builds upon molecular modelling principles introduced in CHEM340 and will apply them to specific problems in drug design.", "Topics include conformational analysis, molecular mechanics, and molecular dynamics; computational studies of drug-receptor interactions, docking of small organic molecules to biological receptors, and alteration of molecular structures for improvement of bioactivity.", "Understand the drug discovery cycle, and different concepts in drug discovery", "Learn about different computational drug discovery methods and their usage and applications", "Gain hands-on experience on different software programs that can be used for drug discovery applications", "Learn the basics of programming using Unix-based commands and TCL scripts", "Learn to perform basic molecular modelling, structure visualization, biomolecular interaction analyses, molecular simulations and their applications to drug discovery", "Notice of Recording"]}, {"course_id": 61, "course_code": "CHEM 494A", "course_name": "CHEM494A - Research Project (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["C2 281", "/B may not be taken concurrently without prior permission of the CHEM494 co-ordinator.", "- develop an understanding of research in a specific area by reading the relevant scientific literature", "- translate and integrate the skills and knowledge learned during their undergraduate studies and apply them to an independent research project", "- interpret their results and rationalize them in the context of their hypothesis", "- communicate their research and associated findings through oral presentation and defense", "- communicate their research area, experimental findings and conclusions through their research reports", "Please see course LEARN site for submission of reports via Dropbox.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 62, "course_code": "CHEM 494B", "course_name": "CHEM494B - Research Project (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["10:30AM - 11:20AM RCH 207", "C2 281", "A continuation of CHEM494A. CHEM494A/B may not be taken concurrently without prior permission of the CHEM494 co-ordinator.", "- develop am understanding of research in a specific area by reading the relevant scientific literature", "- translate and integrate the skills and knowledge learned during their undergraduate studies and apply them to an independent research project", "- interpret their results and rationalize them in the context of their hypothesis", "- communicate their research and associated findings through oral presentation and defense", "- communicate their research area, experimental findings and conclusions through their research reports", "Please see course LEARN site for submission of reports via Dropbox.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 0, "course_code": "CHEM 121", "course_name": "CHEM121 - Physical and Chemical Properties of Matter (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Physical and Chemical Properties of Matter Fall 2024", "B. Power", "A first-year chemistry course for students in chemistry-based programs.", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "describe the energy levels of the H atom in terms of atomic orbitals and quantum numbers", "describe the electronic structure of atoms and justify the organization of the periodic table", "predict trends in the properties of the elements", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and understand molecular shape and stability in terms of electron count", "describe the behaviour and interactions of molecules in gases", "predict the effects of intermolecular interactions on the properties of gases and liquids", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "You must submit the University of Waterloo Verification of Illness (VIF) form  by emailing a clear scanned copy to bothyour instructor and science.advisor@uwaterloo.ca", "This course includes the independent development and practice of specific skills, such as problem solving in a chemical and scientific context.", "Library for research-based assignments"]}, {"course_id": 1, "course_code": "CHEM 121L", "course_name": "CHEM121L - Chemical Reaction Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Contact:  Drop in questions are welcome during the hours stated above.", "Questions sent in the wee hours of the morning, the day your report is due, may not receive a response in time!", "Record their name and contact information in your lab manual.", "The CHEM 121L course is an in-depth introduction to the chemistry laboratory environment and provides an opportunity to develop basic lab skills, as well as introducing some basic aspects of experimental design.", "Skillfully perform procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Determine appropriate tools for required accuracy of a given analysis", "Evaluate and follow scientific protocols, and modify them as required to complete an analysis, design and test experimental protocols", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Section", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "- studying cis and trans isomers", "Qualitative and Quantitative Analysis", "Introduction to Chromatography", "- quantify a cation using ion exchange", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 2, "course_code": "CHEM 125", "course_name": "CHEM125 - Chemical Reactions, Equilibria and Kinetics (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["CHEM 125 is a first-year Chemistry course for students in Chemistry-based programs.", "A first-year chemistry course for students in chemistry-based programs.", "Introduction to chemical equilibria.", "Describe the energy and entropy changes that accompany physical and chemical changes.", "Calculate the equilibrium constant for a reaction using the standard thermodynamic properties of reactants and products.", "Predict the direction of spontaneous change for a given set of initial conditions for a variety of chemical systems.", "Apply equilibrium principles to a variety of chemical reaction types including gas-phase reactions, acid-base reactions, precipitation reactions, complexation reactions and redox reactions.", "Analyze oxidation-reduction reactions and identify species being oxidized and reduced.", "Explain the basic construction of, uses of, and the differences between galvanic and electrolytic cells.", "CHEM 121 and CHEM 125 comprise a full-year course in introductory chemistry.", "Course Structure and Continuity Plans", "Chemistry Study Hall:  Starting the 2nd week of classes, there will be a first-year study hall on Tuesdays and Thursdays from 5:30 pm - 6:50 pm in STC 1012.", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 3, "course_code": "CHEM 125L", "course_name": "CHEM125L - Chemical Reaction Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and to modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Section", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- analysing real world samples and", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 4, "course_code": "CHEM 140", "course_name": "CHEM140 - Introduction to Scientific Calculations (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Scientific Calculations Winter 2025", "jake.fisher@uwaterloo.ca", "The application of numeric computing software to perform basic calculations, data analysis, regression analysis, plotting of scientific graphs, data manipulation, and equation solving will be covered in this course, with an emphasis placed upon chemical and biochemical concepts and applications.", "These exercises draw on examples from chemistry, biochemistry, and other scientific disciplines, showcasing the many ways Excel can be used as a problem-solving and analytical tool for scientific investigations and tasks.", "Key Scientific and Analytical Concepts Covered:", "Overviews of the basic use and application of Excel", "Scientific plotting and graphs", "Advanced spreadsheet topics", "Statistical analysis in science", "Regression analysis in science", "Solving equations", "Basic calculus and algebraic operations", "Data exchange and manipulation", "Engage students in scientific exercises that enhance their understanding of concepts discussed in other courses.", "5 Session 04 Linear Regression Analysis Pre‐Lab Exercise 04 Friday, Jan 31, 2025 at 5:30 PM ET Friday, Feb 7, 2025 at 5:30 PM ET", "Excel Skills Test", "All In-Class Exercises can be found in the CHEM140 Course Notes and Exercises Manual", "Adobe Acrobat Reader", "Spreadsheet Skills Test 20%", "Please refer to the Introduction section of the CHEM 140 Course Notes and Exercises manual for details.", "Please refer to Electronic Submissions section of the CHEM 140 Course Notes and Exercises manual for details.", "Supporting documentation will be considered on a case by case basis.", "The pre-lab exercises will be accessible for a period of one week.", "Students are given one week to complete the pre-lab exercise and in-class exercises for a given Chem 140 session.", "A student must provide credible evidence that their in-class exercise was completed BEFORE the specified deadline.", "If a resolution between the student and teaching assistant cannot be found, the instructor will re-grade the entire in-class exercise, upon request of the student.", "There are no make-up Skills Test."]}, {"course_id": 5, "course_code": "CHEM 209", "course_name": "CHEM209 - Introductory Spectroscopy and Structure (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Spectroscopy and Structure Fall 2024", "11:30AM - 12:20PM RCH 309", "Email: afkennywilby@uwaterloo.ca", "The nature of electromagnetic radiation and an elementary outline of quantum mechanics in one dimension.", "For each of microwave, infrared, Raman, electronic, photoelectron, and nuclear magnetic resonance spectroscopy, the nature of the molecular energy levels involved and the type of molecular information that can be obtained using it are examined.", "Understand the electromagnetic spectrum and the energies, frequencies and wavelengths that characterize it; understand and apply the wave-particle duality of light and the concept of photons", "Recognize the various types of quantized energy in atomic and molecular systems and know their origins", "Understand basic molecular orbital theory for simple molecules, and the descriptions of symmetry applied to them", "Understand and apply the concepts of spectroscopy as an interaction between light and matter, including the Bohr resonance condition; Interpret atomic spectra in terms of the underlying structure of atoms in modern quantum theory", "Assign, interpret and predict the spectra arising from molecules interacting with electromagnetic radiation ranging from microwaves for molecular rotations, infrared for molecular vibrations, visible-ultraviolet for electronic transitions, to X-rays for photoelectronic transitions from molecular core orbitals", "Introduction to Spectroscopy (4 weeks): The electromagnetic spectrum, photon theory of light, interaction of light and molecules.", "Review of molecular orbital theory and electronic structure.", "Spectroscopy involving those levels.", "Combination of rotation and vibration in diatomics.", "Ionization of core electrons.", "7. Nuclear magnetic resonance (NMR) spectroscopy (1 week): Basic theory and practical applications of NMR for simple molecules.", "An Introduction to Spectroscopy and Quantum Structure, by W. Scott Hopkins (Cambridge Scholars Publishing, 2023) Recommended reading material No", "Physical Chemistry: A Molecular Approach by Donald A. McQuarrie and John D. Simon", "They are mostly meant to keep you follow the material and understand fundamental concepts.", "Homework assignments are a longer and more involving set of problems and will be given after we finish a given course unit (or midway through for longer units).", "If missed, a weighted final exam grade will be used for a mid-term grade."]}, {"course_id": 6, "course_code": "CHEM 212", "course_name": "CHEM212 - Structure and Bonding (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Structure and Bonding Spring 2024", "An introduction to the principles of chemical structure and bonding, with emphasis on their application to inorganic systems.", "Topics include atoms, orbitals, and periodicity; localized bonding models; symmetry and group theory; and molecular orbital theory.", "0.1 Improve general analytical and problem solving skills.", "0.2 Improve physical conceptualization and 3-dimensional visualization.", "1.1 Understand and use mathematical and graphical descriptions of atomic orbitals.", "1.3 Understand and use orbital models and effective nuclear charge in the description of polyelectronic atoms.", "1.4 Rationalize the physical origins of periodic properties and trends, and use these explanations predictively.", "2.1 Construct Lewis structures from molecular formulae and predict stereochemistry using the VSEPR model.", "2.2 Understand mathematical basis and properties underlying valence bond hybrid orbitals.", "2.3 Construct valence bond hybrid orbitals corresponding to observed geometries.", "3.1 Identify and mathematically define 3-D point symmetry operations.", "4.2 Construct MO energy level diagrams for diatomic and polyatomic species using manual and symmetry-defined approaches.", "Introduction MF&T Ch. 1", "a.   quantum mechanics and hydrogenic atoms", "Geometric structure and localized bonding models MF&T Ch. 3**", "a.   stereochemical nomenclature and drawing (also Appendix D", "b.   Lewis structures in the 3rd edition)", "d.   valence bond theory ***", "a.   molecular point symmetry", "Molecular orbital theory MF&T Ch. 5", "a.   homonuclear diatomics", "b.   heteronuclear diatomics", "c.   monocentric molecules", "d.   polycentric molecules", "Molecular models are useful for visualizing structures and symmetries.", "The most useful kits for inorganic chemistry allow the construction of trigonal bipyramidal and octahedral geometries, in addition to tetrahedral stereocenters.", "A 10-minute in-person quiz will be given at the end of each tutorial problem solving session.", "A 2.5-hour in-person final exam covering the entire course will be given during the final exam period, with times and conditions set by the Registrar.", "(5) Students who miss the final exam for legitimate reasons will write a make-up final exam following completion of an INC agreement.", "Normally, this make-up exam will be written by the second week of the following term in a special session scheduled by the Faculty of Science."]}, {"course_id": 7, "course_code": "CHEM 220", "course_name": "CHEM220 - Intro Analytical Chemistry (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Intro Analytical Chemistry Fall 2024", "09:30AM - 10:20AM EXP 1689", "10:30AM - 11:20AM EXP 1689", "C2-275A", "For issues regarding grades/absences please email Stacey", "Emphasis on planning and decision-making in the analytical process.", "Introduction to Analytical Chemistry Chapter 1: 1-13", "Significant Figures", "Experimental Error", "Statistics", "Statistical Analysis", "Calibration Methods", "Calculations in Statistics and Calibration Methods", "Gravimetric and Combustion Analysis", "Monoprotic and Polyprotic Acid-Base Equilibria", "Gravimetric and Chemical Equilibria Problems", "Titrations – Introduction", "Instrumentation for Spectroscopy", "Absorption Spectrometry", "Fluorometry", "Introduction to Analytical Separations Chapter 29: 821-855 Work on Questions at end of course notes and provided on OWL platform.", "870-882", "Electrochemistry and", "Electroanalytical Techniques", "Applications of Analytical Chemistry", "Applications of Analytical Chemistry", "Students who do not write a test and who do not provide a valid reason, will have that test recorded as zero.", "Students who miss a test with an approved absence will not be provided a make-up test.", "Additional practice problems can be found at the end of each section of course notes.", "Notice of Recording", "Suggested practice problems will be posted via the textbook online system and at the end of each section of course notes.", "This course focusses on the independent development and practice of specific skills related to analytical chemistry.", "Intellectual property includes items such as:"]}, {"course_id": 9, "course_code": "CHEM 250L", "course_name": "CHEM250L - Physical Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM C2 168", "jake.fisher@uwaterloo.ca", "02:30PM - 05:20PM C2 168", "jake.fisher@uwaterloo.ca", "08:30AM - 11:20AM C2 168", "jake.fisher@uwaterloo.ca", "02:30PM - 05:20PM C2 168", "jake.fisher@uwaterloo.ca", "E-mail:   jake.fisher@uwaterloo.ca", "Students will be introduced to techniques and instruments used in modern chemical research.", "Selected experiments include topics such as the examination of binary-liquid systems, the spectrophotometric determination of the pKa, determination of dissociation constants via conductivity, oxygen bomb calorimetry, and an experimental examination of quantum mechanics.", "To provide the fundamental knowledge and practical experience in the area of physical chemistry.", "To gain an appreciation and understanding of the more complex problems", "A", "B", "C", "D", "E", "F", "I", "Sept 24 Sept 26", "I", "A", "B", "C", "D", "E", "F", "I", "A", "B", "C", "D", "E", "F", "Oct 22 Oct 24 G H I J A B C D E F", "I", "A", "B", "C", "D", "C", "D", "E", "F", "I", "A", "B", "Please refer to the Introduction section of the CHEM 250L Laboratory Manual for details.", "Email a scanned copy of the VIF to the laboratory instructor.", "Supporting documentation will be considered on a case by case basis.", "Equations should be created using the Equation Editor found in MS-Word or a comparable equation editor.", "Re-grading Reports:  If there a concern related as to how a lab report was graded, the student should first consult the teaching assistant responsible for marking the report.", "If a resolution between the student and teaching assistant cannot be found, the laboratory instructor will re-grade the entire report."]}, {"course_id": 10, "course_code": "CHEM 254", "course_name": "CHEM254 - Introductory Chemical Thermodynamics (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["08:30AM - 09:20AM", "RCH 306", "B. Power", "Instructor: Bill Power", "An introduction to the first, second, and third laws of thermodynamics and the application of these laws to ideal systems, mixtures, and chemical reactions.", "Thermodynamic principles are used to study changes in state, including phase changes, and to establish the link between the equilibrium constant and the properties of the substances involved in a chemical reaction.", "This course is a basic introduction to thermodynamics with emphasis on applications in chemistry.", "The course provides the necessary background to study changes in state of many physical and chemical systems.", "Define and apply the four laws of thermodynamics", "Identify, describe and ultimately design a variety of physical and chemical systems through their internal changes and/or interactions with their surroundings", "Quantify internal energy U, heat q, work w, enthalpy H, entropy S and Gibbs energy G in that same variety of physical and chemical systems", "Predict spontaneous change in systems of varying complexity", "Explain and quantify transformations involving both pure substances and mixtures using thermodynamic concepts", "There will be online and in-class assignments, on a rotating interval of about two weeks.", "It will occur in a 2.5 hour time slot sometime between April 9 and April 25 (I have no control over this scheduling).", "I will have a copy on reserve in the library (https://www.reserves.uwaterloo.ca/ares/ares.dll?Action=10&Form=50&Value=222108) and the price listed here is for a one-year electronic subscription.", "In addition, I have prepared a number of narrated powerpoint lectures, which I hope you will find useful in learning the material.", "Each lecture also has notes that provide written transcripts of what I am speaking, in case that helps you to learn some of the terms.", "One will be tutorial assignments which you will complete the first half of the problem individually, then work on an extension of the problem in groups of 4.", "CHEM 254 - Winter 2025 | General | Microsoft Teams", "I will provide any materials there as well as on LEARN, just in case one or the other has access issues.", "Four of the assignments, involving both individual and group work in a team-based learning (TBL) format, should help you to be able to assess different thermodynamic systems and learn to use the appropriate thermodynamic tools.", "The other four assignments, to be completed individually and much broader in scope and effort required, will help you to apply those skills to more complex and realistic physical and chemical systems.", "These may cover several chapters at a time.", "This course includes the independent development and practice of specific skills, such as problem solving in a chemical and scientific context.", "Library for research-based assignments"]}, {"course_id": 11, "course_code": "CHEM 264", "course_name": "CHEM264 - Organic Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Structure and bonding in organic chemistry.", "Isomerism and stereoisomerism in organic compounds.", "Name basic organic molecules", "Draw resonance structures and identify major and minor contributors.", "Draw organic molecules in three dimensions and identify the lowest and highest energy conformations.", "Understand the reactivity of a variety of molecules containing a variety of functional groups.", "Nomenclature: 2.1- 2.3", "Chapter 1.1 and 1.3", "Module 6 Acids and Bases", "Module 6 Acids and Bases", "Held in OPT 347", "Oct. 21", "Held in OPT 347", "Exam Period** Comprehensive Exam All course material", "Organic Chemistry I & II: A Live Interactive Textbook Textbook Yes", "When you sign into the textbook, you will see the chapter models in the left window.", "If a student posts a question in the Ace dialog box, students engage in a private conversation with the AI agent.", "In these conversations, Ace can have a back-and-forth with a single user, and that conversation will only be visible to the poster.", "Molecular Modelling Kits: Students are encouraged to use molecular modeling kits during tests and exams.", "The SUO schedules make-up exams.", "After 1 year, the INC converts"]}, {"course_id": 12, "course_code": "CHEM 340", "course_name": "CHEM340 - Introductory Computational Chemistry (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["CHEM 340", "jake.fisher@uwaterloo.ca", "An introduction to the theory and practice of computational methods used in chemistry, through the use of molecular modeling software.", "The investigation of the structure and behavior of various chemical systems, including topics such as electronic structure, geometry of molecules, calculation of potential energy surfaces for reactions, will be explored.", "The course introduces the students to molecular modeling tools by working through a series of exercises using the molecular modeling software, Gaussian (from Gaussian Inc.).", "Examples are drawn from many areas of chemistry, illustrating the kinds of information obtainable from molecular mechanics and molecular orbital computational techniques.", "The modeling concepts that will be acquired through the course include the following:", "creation of Z-matrices", "single point energy calculations versus geometry optimization.", "To introduce students to common molecular modeling software that they can use throughout their chemistry studies and more advance molecular modeling courses", "To engage the students in molecular modeling exercises that will complement and enhance their understanding of concepts being discussed in other classes", "2 Session 01 Introduction to Molecular Modelling", "Computational Project Proposal", "8 Session 05 Modelling in Solution", "Adobe Acrobat Reader", "Supporting documentation will be considered on a case by case basis.", "Equations should be created using the Equation Editor found in MS-Word or a comparable equation editor.", "Re-grading Hand-in Exercises:  If there a concern related as to how a hand-in exercise was graded, the student should first consult the teaching assistant responsible for marking the hand-in exercise."]}, {"course_id": 13, "course_code": "CHEM 350", "course_name": "CHEM350 - Chemical Kinetics and Statistical Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Chemical Kinetics and Statistical Mechanics Winter 2025", "10:00AM - 11:20AM QNC 2502", "Basic chemical kinetics; treatment of kinetic data; complex reaction mechanisms; fast reactions; the canonical ensemble and the canonical partition function; statistical mechanics applied to chemistry; statistical theory of reaction rates.", "Describe the principles of the kinetic theory of gases, with particular emphasis on the Maxwell-Boltzmann distribution, and use these principles to interpret gas behaviour.", "Demonstrate a clear understanding of basic probability theory, using it to analyze and predict the behavior of microscopic systems.", "Employ the canonical ensemble framework to derive and utilize the canonical partition function, understanding how it connects microscopic states to macroscopic thermodynamic properties.", "Apply statistical mechanics methods to analyze chemical processes, illustrating the connection between partition functions and the equilibrium constant.", "Integrate this understanding with statistical theories (e.g., transition state theory) to predict rate constants and assess factors that influence reaction speed.", "Interpret and treat kinetic data using appropriate mathematical models, critically analyze multi-step reaction mechanisms, and employ the necessary approximations (e.g., initial velocities, steady-state approximation) to derive reaction rate laws."]}, {"course_id": 14, "course_code": "CHEM 350L", "course_name": "CHEM350L - Physical Chemistry Laboratory 2 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["jake.fisher@uwaterloo.ca", "jake.fisher@uwaterloo.ca", "E-mail:   jake.fisher@uwaterloo.ca", "This advanced laboratory builds upon fundamental knowledge of physical chemistry gained in the introductory physical chemistry laboratory, CHEM250L. The experiments are designed to illustrate the principles and theories of thermodynamics, kinetics, spectroscopy, and quantum mechanics.", "CHEM 350L is an subsequent physical chemistry laboratory following the introductory physical chemistry laboratory, CHEM 250L.", "The student will be introduced to techniques and instruments used in modern chemical research.", "CHEM 350L consists of a series of experiments designed to illustrate the concepts and theories of thermodynamics, kinetics, spectroscopy and quantum mechanics.", "To provide the fundamental knowledge and practical experience in the area of physical chemistry.", "To gain an appreciation and understanding of the more complex problems", "A", "B", "C", "D", "E", "F", "I", "A", "B", "C", "D", "E", "F", "I", "A", "B", "C", "D", "E", "F", "I", "A", "B", "C", "D", "I", "A", "B", "C", "D", "E", "F", "I", "A", "B", "E", "F", "I", "A", "B", "C", "D", "E", "F", "I", "C", "D", "E", "F", "I", "A", "B", "C", "D", "E", "F", "Please refer to the Introduction section of the CHEM 350L Laboratory Manual for details.", "Email a scanned copy of the VIF to the laboratory instructor.", "Supporting documentation will be considered on a case by case basis.", "Equations should be created using the Equation Editor found in MS-Word or a comparable equation editor.", "Re-grading Reports:  If there a concern related as to how a lab report was graded, the student should first consult the teaching assistant responsible for marking the report.", "If a resolution between the student and teaching assistant cannot be found, the laboratory instructor will re-grade the entire report."]}, {"course_id": 15, "course_code": "CHEM 356", "course_name": "CHEM356 - Introductory Quantum Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Quantum Mechanics Fall 2024", "Historical background; the differential equation approach to quantum mechanics; treatments of solvable problems such as the particle-in-a-box, harmonic oscillator, rigid rotator and the hydrogen atom; introduction to approximation methods for more complicated systems.", "This theoretical framework will lead us to understand deeply some very basic concepts in chemistry and physics.", "In this course we will focus on model problems that can be solved with 'relatively little' effort and which illustrate the nature of the quantum world and will introduce you to thinking 'quantum'.", "Moreover these simple models often lead to surprisingly quantitative understanding of observed excitations of atoms, molecules and materials.", "A major theme concerns the electronic structure of atoms and simple molecules.", "Operator techniques will be introduced as a powerful tool to solve a variety of problems in an elegant and uniform manner.", "It contains short summaries (Mathchapters) of mathematical methods that can serve as either brief reviews of or introductions to the material.", "Problems and Solutions for McQuarrie's Quantum Chemistry,", "A free pdf of the McQuarrie book is available here", "Understand the essential formulation of quantum mechanics: States, Superpositions, Eigenstates, Operators, Probabilities.", "Understand (at a basic level)", "History: Relativity, Planck’s radiation law, Einstein Photo-electric effect,", "Time-dependent Schrödinger equation and Ehrenfest theorem.", "Variational principle and basis set expansions, matrix formulations quantum mechanics.", "Problems and Solutions for McQuarrie's Quantum Chemistry,ISBN 9781891389528 This is a solution manual for problems in McQuarrie No", "In particular we will discuss the postulates of quantum mechanics and their 'ensemble Interpretation'.", "There will also be a handout discussing the most basic H atom, using angular momentum theory in operator form.", "I plan to introduce a section on quantum computing.", "TBA"]}, {"course_id": 16, "course_code": "CS 115", "course_name": "CS115 - Introduction to Computer Science 1 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Computer Science 1 Winter 2025", "Diren Swayze", "An introduction to the fundamentals of computer science through the application of elementary programming patterns in the functional style of programming.", "As we are aware of the varied ways in which this material might be of use in the future, we have included concepts that are beautiful and universal.", "Because of the fundamental nature of the concepts taught in CS 115, the course can serve both students whose primary interest in computers is in their use in their chosen areas of study and students intending to minor in CS.", "Module 01: Introduction Monday January 6", "Module 03: Strings and Symbols Monday January 13", "Module 06: Structural Recursion Monday February 3", "Module 08: Local Evaluation Monday February 24", "Module 09: Higher-Order Functions Monday March 3", "Exams", "You can submit each of those files as many times as you like before the deadline.", "Every time you submit a file, we'll run some basic checks on it to make sure it looks valid, and send you preliminary feedback via email.", "Re-marking", "The forms will be in a Survey on Learn for each assignment for two weeks."]}, {"course_id": 17, "course_code": "CS 116", "course_name": "CS116 - Introduction to Computer Science 2 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Computer Science 2 Winter 2025", "Monday -", "Monday", "07:00PM - 08:50PM", "E. Dupont", "E. Dupont", "E. Dupont", "10:00AM - 11:20AM MC 4045", "02:30PM - 03:20PM", "08:30AM - 09:20AM", "09:30AM - 10:20AM MC 4042", "10:30AM - 11:20AM MC 4060", "11:30AM - 12:20PM MC 4060", "02:30PM - 03:20PM", "This course builds on the techniques and patterns learned in CS115 while making the transition to use of an imperative language.", "Use higher-order functions to improve the readability and efficiency of programs", "Describe the basic memory model for mutation of basic types, lists, and objects in Python", "Distinguish between constant, linear, quadratic, and exponential running times of algorithms", "Write useful Python programs using console and file input and output for practical tasks", "All times are given in Eastern Time.", "Important!", "In order to maintain a level of success in the course, students should not miss the completion of any modules.", "Students should check their basic tests email to ensure that the code meets the specification exactly.", "Please make sure you do this often!", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 18, "course_code": "CS 234", "course_name": "CS234 - Data Types and Structures (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Data Types and Structures Fall 2024", "MarkUs problems Email IAs at the course account", "Microsoft Teams problems Email ISG Coordinator Scott King", "Missed assignment or quiz Email ISG Coordinator Scott King", "Extenuating circumstances Email ISG Coordinator Scott King", "Error in mark entry Email IAs at the course account", "ISG Coordinator", "Introduction to commonly used data types, including lists, sets, mappings, and trees.", "This course introduces widely used and effective methods of data organization, focusing on data structures, their algorithms, and the performance of these algorithms.", "Students who successfully complete the course can use these tools to design and develop efficient programs for a wide variety of applications.", "Audience", "Students wishing to understand how choices made in program design can significantly affect performance and how to make these choices", "Highly recommended for students in Information Management and similar fields and for those in the Mathematics/Teaching plan", "The initial topics in CS 234 will present some material new to those coming out of CS 116 (but covered in CS 136) and some material new to those coming out of CS 136 (but covered in CS 116).", "Co-requisites: None", "Rance D. Neśaise, Data Structures and Algorithms Using Python, Wiley, 2010", "Describe basic quadratic sorting algorithms, such as Selection Sort or Insertion Sort.", "Given a simple, well-specified computational task, write a program in a high-level imperative language (e.g., Python, C, or Java) and generate appropriate test cases.", "Use as appropriate simple types, built-in compound types and control idioms, such as selection, iteration, and recursion.", "Explain the benefits of using abstract data types (ADTs) and data structures, and more generally, the concepts of modularity and data hiding, in solving problems in a wide variety of application areas.", "Understand the differing points of view of the user and provider of an ADT and the use of an interface to communicate between views.", "Explain and use the concepts of asymptotic running time, order notation, worst-case, average-case, and best-case complexity, and lower and upper bounds.", "Given a simple algorithm written in pseudocode, determine and informally justify its asymptotic running time, as expressed in order notation.", "Explain the basic structure of memory, including the distinction between external and internal memory and the concept of paging.", "Explain the complexity of some common implementations of these ADTs.", "Given a well-specified computational problem, determine which (if any) ADTs would be suitable.", "Explain how specialized data structures can lead to efficient solutions to specific real-world problems.", "Topics: User and provider viewpoints, planning and coding stages, abstract data types, modularity and data hiding, ADT Multiset, pseudocode, memory model", "Topics: Best, worst, and average-case running times, order notation, algorithm analysis", "Topics: Graph terminology, ADT Undirected Graph, ADT Directed Graph, implementations, depth-first search, breadth-first search", "Topics: Average-case analysis, interpolation search, heuristics, hashing, bucket sort, radix sort", "Notice of Recording", "Should problems occur, your early drafts serve as backups in case of computer problems, and provide evidence of your having attempted to submit work before the deadline.", "Re-mark requests", "The subject should be \"Ax re-mark request\" for x the number of the assignment.", "In the body of the email, include the rationale for the re-mark and the parts of the question that need atttention.", "Exam policies and missed examinations", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 19, "course_code": "CS 370", "course_name": "CS370 - Numerical Computation (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["10:00AM - 11:20AM MC 2034", "Monday -", "Monday", "Principles and practices of basic numerical computation as a key aspect of scientific computation.", "Approximation by splines, fast Fourier transforms, solution of linear and nonlinear equations, differential equations, floating point number systems, error, stability.", "Understand floating point number representations and their limitations", "Analyze rounding error in a floating point calculation", "Perform stability and trunction error analyses of time integrators", "Understand and perform the fast Fourier transform for 1D and 2D numerical data", "Solve linear systems and perform basic linear algebra manipulations using LU factorizations", "Evaluate asymptotic behavior of numerical linear algebra operations in terms of floating point operations", "Use power iteration to find the dominant eigenvalue of a matrix", "Week of Jan 20: Splines & Parameterized Curves", "Week of Mar 3: FFT Applications", "Week of Mar 10: Google Page Rank / Power iteration", "Week of Mar 17: Gaussian Elimination & LU factorization", "Week of Mar 23: Numerical Linear Algebra Norms and Conditioning", "Week of Mar 31: More Numerical Linear Algebra, End of classes", "You should start the first assignment as soon as possible to begin setting up and getting familiar with these tools.", "The official guide for installing and using Jupyter is here: https://docs.jupyter.org/en/latest/install.html", "There are a huge number of online sources of introductory material for working with Jupyter/Python.", "The focus of this course is on learning general numerical computing concepts, rather than the syntax of a particular programming language.", "Please inform the instructor to make the deadline adjustment.", "Your code is an important part of the assignment, and as such it should be readable and well-commented.", "Assignment figures and graphs should be carefully thought out and labelled to present the data and your conclusions in an effective and clear manner.", "Any code and algorithms you write should be sufficiently well documented through code comments or descriptions as to be readily understood.", "This code submission should allow the TAs to run your code if and when necessary to verify the results that your code produces.", "Collaboration and Plagiarism", "We encourage you to discuss general concepts and problems with classmates, TAs, and instructors.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Intellectual property includes items such as:", "Avoiding Academic Offenses", "With these facts in mind, one way that everyone in our class can contribute to a safer and more equitable learning environment is to  stay home when you are ill and, at minimum, wear a mask if you suspect you might be contagious.", "A range of on- and off-campus resources are available including:"]}, {"course_id": 20, "course_code": "MATH 106", "course_name": "MATH106 - Applied Linear Algebra 1 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Applied Linear Algebra 1 Winter 2025", "Systems of linear equations.", "Introduction to vector spaces.", "We will see how to solve systems of linear equations using matrix methods before studying matrices as algebraic objects in their own right.", "Next, we will learn about the fundamental concepts of span, linear independence, and basis and learn how to determine whether a set is a subspace of Rn.", "After studying subspaces, we will study linear mappings, which map subspaces to subspaces.", "We will discuss the geometric interpretation of these mappings and study their fundamental subspaces.", "Finally, we will learn how to calculate the determinant of a matrix and use this knowledge to diagonalize square matrices.", "Provide a graphical and algebraic description of vectors, lines, and planes in R^n", "Model and solve mathematical and discipline-specific problems using systems of linear equations", "Perform basic algebraic operations on matrices", "Given a set of vectors in R^n, determine whether it is linearly independent, a spanning set of R^n, or a basis of R^n", "Given a basis and a vector in standard coordinates, use matrix methods to calculate its coordinate vectors", "Given a set in R^n, determine whether it is a subspace of R^n", "Given a mapping L: R^n --> R^m, determine whether it is linear", "Given a linear mapping, choose the appropriate algorithm find a basis for each of its fundamental subspaces", "Given a square matrix, calculate its determinant and provide a geometric interpretation of this value", "Communicate ideas and concepts relating to linear algebra using accurate mathematical language and notation", "Calculators", "Avoiding Academic Offences", "I am committed to creating a learning environment where diverse perspectives are recognized and valued as a source of strength.", "School-Life Conflict"]}, {"course_id": 21, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 22, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 23, "course_code": "CHEM 233", "course_name": "CHEM233 - Fundamentals of Biochemistry (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Evgeniy Panzhinskiy", "Additional office hours can be booked in person or online upon request", "The fundamental chemical and physical properties of amino acids, nucleic acids, carbohydrates and lipids are then discussed in detail.", "The organization of these building blocks into more complex structures such as proteins, enzymes, polynucleotides, polysaccharides, and biological membranes will be described.", "The structure and function of representative proteins such as myoglobin and hemoglobin and enzymes such as chymotrypsin will also be discussed.", "Applications and importance of the above to real world situations will be provided.", "Develop an understanding of the importance of aqueous solutions in biochemical processes.", "Understand the basic thermodynamic principles that govern the chemistry of biological processes in both qualitative and quantitative examples", "Calculate a charge of amino acids and proteins as a function of pH", "Analyze the kinetic properties using the Michaelis-Menten model of enzyme kinetics", "Draw the organic mechanisms for representative enzyme catalyzed reactions", "Unerstand simple carbohydrate chemistry and some representative glycoprotein and glycolipid structures as well as their functions", "Illustrate chemical basis of nucleotide pairing and identify different structural forms of DNA and RNA", "Predict the flow of information from DNA to RNA", "Compare the structure and physical properties of lipids and fatty acids, and understand their role in the formation of membrane bilayers", "Take all the information learned this term and develop a deeper understanding of the chemical processes that lead to life as we know it", "Suggested supplementary reading in \"Biochemistry Free for All\" (BFA)", "VVP Chapter 1.3 Thermodynamics", "BFA: Introduction: Basic Chemistry, pages 25-31", "BFA: Introduction: Water and Buffers, pages 34-49", "VVP chapter 3 Amino Acids and Polypeptides", "VVP Chapters 4.1 - 4.3 Secondary, Tertiary and Quaternary Structure", "BFA: Protein Structure: pages 74-108", "VVP Appendix A.1 and A.2", "BFA: Basic Techniques: pages 857-870, 894-895", "Week 6: Protein folding and Introduction to hemoglobin", "VVP Chapter 4.4 Protein Folding and Unfolding", "Week 8: Enzyme Kinetics", "BFA Catalysis Basic Principles: pages 337-380", "BFA Mechanisms: pages 381-395", "BFA Structure and Function of Carbohydrates: pages 190-217", "BFA Structure and Function of Nucleic Acids: pages 167-189", "BFA Structure and Function of Lipids: pages 222-233; Membranes: pages 269-336", "A virtual textbook can be found at https://bio.libretexts.org/Bookshelves/Biochemistry/Fundamentals_of_Biochemistry_(Jakubowski_and_Flatt)", "Notice of Recording", "Emails can be received 24 hours per day.", "This official verification is necessary before any action can be taken.", "Students should carefully consider the wisdom of missing a test or an exam.", "Expectation of Academic Integrity", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 24, "course_code": "CHEM 237", "course_name": "CHEM237 - Introductory Biochemistry (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:20AM", "RCH 101", "10:30AM - 11:20AM RCH 101", "ESC 227", "Structure and properties of proteins and enzymes.", "develop a molecular level understanding of biological processes to achieve this the following learning outcomes will be", "in both qualitative and quantitative examples", "evaluate unknown thermodynamic parameters from given values of others.", "I equilibrium constants from standard free energy changes.", "qualitatively describe the composition of solutions of a weak acid or base as a function of pH.", "calculate the precise", "recognize the 20 amino acids that are commonly found in proteins and identify compounds derived from them", "calculate the charge on an amino acid side chain as a function of pH", "know the 4 levels of protein structure and the covalent and non covalent interactions that stabilize them", "explain how to purify proteins using the physical and chemical properties of the proteins", "determine the primary sequence of a protein given the appropriate data", "understand basic chemical kinetics and the application to biological systems", "determine the mechanism of inhibition of an enzyme using", "the structure of fatty acids and membrane lipids", "the structures of cell membranes and how the fatty acid composition of those membranes affects membrane structure and fluidity", "the structure of simple sugars and polysaccharides and the chemistry of the reactions in which they participate", "Suggested supplementary reading in \"Biochemistry Free for All\".", "Biochemistry free for all: Introduction Water and Buffers, pages 34-49", "VVP chapters 3 and 4.1", "Biochemistry free for all pages 53-70", "Appendix A.1 and A.2", "Chapter 4.2 and 4.3", "Biochemistry free for all.", "pp 74-108", "Week 6  Protein folding and Introduction to hemoglobin", "Chapter 4 - Biochemistry in focus", "Biochemistry free for all pages 128-141", "first kinetics Chapter 10 then mechanisms Chapter 9", "Biochemistry free for all pages 337-362", "Biochemistry free for all pp 190-217", "Biochemistry free for all pp 222-233", "Biochemistry free for all pp 287 - 312", "Notice of Recording"]}, {"course_id": 26, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 27, "course_code": "PHYS 111", "course_name": "PHYS111 - Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["An introduction to physics for students intending to concentrate their further studies in biology, dentistry, medicine and paramedicine; includes particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.", "The main physics principles and laws covered in PHYS 111 include: “Particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.”", "PHYS 111 focuses on basic physics principles and laws, on conceptual understanding and problem-solving skills, and an appreciation for the power of physics in explaining how nature works, in the contexts of both the physical and life sciences.", "Physics Principles and Laws: By the end of the course, students will be able to construct scientifically sound explanations of a variety of basic physical phenomena by applying basic physics principles/laws.", "define linear momentum, and calculate and compare momenta of various real-life objects;", "define and calculate impulse, and establish the conditions for conservation of linear momentum; and", "apply the laws of conservation of momentum and energy to collisions.", "Problem-Solving Skills and Strategies: By the end of the course, students will be able to creatively apply a variety of structured problem-solving strategies:", "interpret, visualize and convert the problem into a physical model (e.g., draw a free body diagram);", "evaluate the result — does it make sense?", "These problem-solving skills are useful in the students’ own disciplines and beyond.", "More detailed information about the course elements which contribute to the final grade will be given in the learn sight and in future outline updates", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 28, "course_code": "PHYS 111L", "course_name": "PHYS111L - Physics 1 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "Derin Erisoglu-Akyildiz", "Saba Karimi", "Do Yun Park", "jbschrie@uwaterloo.ca", "s38karim@uwaterloo.ca", "first for minor issues", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "12 & 13", "Complete end-of-term surveys before Dec. 3", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 29, "course_code": "PHYS 121", "course_name": "PHYS121 - Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["An introductory course in physics for students intending to concentrate their future studies in the physical sciences, optometry, or mathematics; includes vectors (dot and cross products), particle kinematics and dynamics, forces in nature, work and energy, conservation of energy and linear momentum, rotational kinematics and dynamics, and conservation of angular momentum.", "Doing Physics - quantities, dimensions, units", "Point Dynamics - force, motion, Newton's laws", "Conservation of Energy - work and energy, conservative systems", "Conservation of linear Momentum - momentum and systems of particles", "Understand the following concepts:", "- Linear kinematics: the relationship between distance, velocity and acceleration.", "- Linear dynamics: a consequence of forces and momentum, and how they interrelate.", "- Kinetic energy, potential energy, work, and their interrelationships.", "We will also re-examine these concepts in a rotating coordinate frame using angular kinematic variables along with torque and angular momentum.", "6 Module 06:  Kinetic and Potential Energy", "7 Module 06:  Kinetic and Potential Energy", "8 Module 07:  Linear Momentum", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- eText + Student Access Code", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- Print Format + Student Access Code"]}, {"course_id": 30, "course_code": "PHYS 121L", "course_name": "PHYS121L - Mechanics Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Mechanics Laboratory Fall 2024", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "Julian Meunier", "Soorna Choheili", "Reza Asadi", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "complete introductory surveys", "complete introductory surveys,", "Complete end-of-term surveys", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 31, "course_code": "PHYS 112", "course_name": "PHYS112 - Physics 2 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:30AM - 11:20AM DC 1350", "S. Idziak", "08:30AM - 09:20AM", "Email: idziak@uwaterloo.ca", "Email: james.forrest@uwaterloo.ca", "A continuation of PHYS111; includes simple harmonic motion, electrostatic force and potential, electric current and power, DC circuits, magnetic field and induction, wave motion, sound, and optics.", "To develop the ability to solve problems in areas related to oscillations and waves, electricity and magnetism, and optics", "Understand physical concepts associated with oscillations, waves, sound, electricity and magnetism, and optics", "Apply concepts of force and energy and recognize when acceleration is not constant", "Solve simple physical systems using physical concepts", "Draw relevant sketches from information given in word problems", "Develop physically relevant equations from information given in word problems", "Convert complex problems into a series of sub-problems and solve", "Topic Textbook Chapters                                                                            Number of lectures", "Electric Forces & Fields (Serway) Chapter 15: 1-5", "Electric Potential & Energy (Serway) Chapter 16", "Current and Resistance (Serway) Chapter 17: 1-6", "Magnetic Flux & Induction   1", "College Physics: A Strategic Approach by Jones, Knight, and Field This was suggested for 111.", "I do not find that these books are great but they are available for no cost.", "Please help to create a welcoming and inclusive environment.", "An exam-like problem will be posted each week on LEARN.", "2 points will be given for each clicker response with an additional 1 point for each correct response.", "What happens if I join the course late:", "Missed a regular assignment:", "Emails can be received 24 hours per day.", "Remember that falsely claiming you are ill can result in academic polices per Policy 71.", "Email communications:", "Notice of Recording"]}, {"course_id": 32, "course_code": "PHYS 112L", "course_name": "PHYS112L - Physics 2 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Sean Dougherty", "Aney Kapadia", "Kayra Erisoglu-Akyildiz", "jbschrie@uwaterloo.ca", "s2doughe@uwaterloo.ca", "Course Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"'", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 3 - Circuits", "Experiment 4 - Circuits", "Experiment 5 - Circuits", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 33, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 34, "course_code": "PHYS 122L", "course_name": "PHYS122L - Waves, Electricity and Magnetism Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 2 - Circuits", "Experiment 5 - Magnetic Fields of a Coil", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 35, "course_code": "CHEM 494A", "course_name": "CHEM494A - Research Project (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["C2 281", "/B may not be taken concurrently without prior permission of the CHEM494 co-ordinator.", "- develop an understanding of research in a specific area by reading the relevant scientific literature", "- translate and integrate the skills and knowledge learned during their undergraduate studies and apply them to an independent research project", "- interpret their results and rationalize them in the context of their hypothesis", "- communicate their research and associated findings through oral presentation and defense", "- communicate their research area, experimental findings and conclusions through their research reports", "Please see course LEARN site for submission of reports via Dropbox.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 36, "course_code": "CHEM 494B", "course_name": "CHEM494B - Research Project (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["10:30AM - 11:20AM RCH 207", "C2 281", "A continuation of CHEM494A. CHEM494A/B may not be taken concurrently without prior permission of the CHEM494 co-ordinator.", "- develop am understanding of research in a specific area by reading the relevant scientific literature", "- translate and integrate the skills and knowledge learned during their undergraduate studies and apply them to an independent research project", "- interpret their results and rationalize them in the context of their hypothesis", "- communicate their research and associated findings through oral presentation and defense", "- communicate their research area, experimental findings and conclusions through their research reports", "Please see course LEARN site for submission of reports via Dropbox.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 37, "course_code": "CHEM 200", "course_name": "CHEM200 - Introduction to Laboratory Techniques (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Laboratory Techniques Fall 2024", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Design experiments that highlight the theory and application of synthetic laboratory techniques", "Formulate an action plan within safety scenarios using material safety data", "Identify relevant information from scientific databases and peer-reviewed literature", "Learn and apply proven study strategies", "Create and peer review short writing pieces", "The seminar is held weekly, with different topics introduced each week; a more specific schedule can be found on LEARN.", "General Policies", "Safety scenarios in the lab assignment:", "Grading: TA should be contacted first; if concern not resolved, then please contact course instructor", "Expectation of the Students in the Lab", "General Information", "Students that cannot find a partner before the first lab session will be assigned a partner at the start of the first lab session.", "Students will be assigned to a locker the first lab session and continue working in that location throughout the term.", "Glassware and equipment must be cleaned after use (please refer to basic lab techniques for glassware cleaning procedures)."]}, {"course_id": 38, "course_code": "CHEM 220L", "course_name": "CHEM220L - Quantitative Chemical Analysis Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Quantitative Chemical Analysis Laboratory Fall 2024", "08:30AM - 11:20AM C2 273", "08:30AM - 11:20AM C2 273", "Stacey Lavery", "C2-275A", "Feel free to email and set up a meeting.", "Please make sure to email the GC and HPLC TAs for questions regarding those experiments.", "Basic analytical principles are illustrated through chemical analysis of several “unknown” samples.", "Be familiar volumetric titrations, gravimetric analysis, spectrophotometry, gas and liquid chromatography", "Sept. 24-26", "Oct. 22-24", "Values submitted with a greater number of significant figures than required will have one mark deducted from the accuracy mark.", "Values submitted with less significant figures than required will be assigned a grade of 3/10 until the correct values are submitted.", "Resubmissions will result in a one-mark deduction from the newly assigned mark.", "This course focusses on the independent development and practice of specific skills related to analytical chemistry.", "Intellectual property includes items such as:"]}, {"course_id": 39, "course_code": "CHEM 224L", "course_name": "CHEM224L - Analytical Instrumentation Laboratory (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Analytical Instrumentation Laboratory Spring 2024", "Stacey Lavery", "C2-275A", "I will be working from home Tuesdays and Fridays", "Experiment 4 Spectrophotometric Analysis of Manganese in Steel", "Analysis of Preservatives in the Food Industry", "Sharpie© or other marker appropriate for glassware", "Values submitted with a greater number of significant figures than required will have one mark deducted from the accuracy mark.", "Values submitted with less significant figures than required will be assigned a grade of 3/10 until the correct values are submitted.", "Resubmissions will result in a one-mark deduction from the newly assigned mark.", "(Please use the same online form for Resubmits and make a comment of “Resubmit” – do not email the instructor your new values.)", "Students must submit their reports via Crowdmark.", "The book will be reviewed and initialed at the end of each lab period.", "Grading will be based off of observed analytical technique in the lab, accuracy of their unknown analysis, and completion of a mock lab book during the exam period.", "*", "Prelab quizzes must also be completed in preparation of the lab period.", "o This course focusses on the independent development and practice of specific skills related to analytical chemistry.", "Intellectual property includes items such as:"]}, {"course_id": 40, "course_code": "CHEM 265L", "course_name": "CHEM265L - Organic Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "Design experiments that highlight the theory and application of synthetic laboratory techniques and select organic reactions from CHEM 264 and 265", "Analyze experimental data including experimental properties and spectroscopic data obtained in the lab or provided by the instructor to draw conclusions about the experiment", "Safety glasses can be re-used from a previous course as long as they cover the front and sides of the eyes or can be purchased from any available source ($5-30).", "The plan of action for each unit is due the first day you plan to start that unit.", "Prelab notebook work for each unit is due the first day you plan to start that unit.", "Illness and Short-Term Absence Policies:", "Students can not use the 48-hour short term absence to miss a laboratory session.", "Students that cannot find a partner before the first lab session will be assigned a partner at the start of the first lab session.", "Students will be assigned to a locker the first lab session and continue working in that location throughout the term.", "Glassware and equipment must be cleaned after use (please refer to basic lab techniques for glassware cleaning procedures)."]}, {"course_id": 41, "course_code": "CHEM 310L", "course_name": "CHEM310L - Inorganic Chemistry Laboratory 2 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Synthesis of transition and non-transition metal compounds.", "Possess a strong base of fundamental knowledge and practical experience in the area of inorganic chemistry", "Use specific specialized techniques to synthesize a variety of transition metal compounds.", "Characterize various properties of synthesized transition metal compounds using a variety of instruments and techniques.", "Library for research-based assignments"]}, {"course_id": 42, "course_code": "CHEM 313L", "course_name": "CHEM313L - Inorganic Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["CHEM 313L", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "E-mail:   ch2siu@uwaterloo.ca", "Introduction to synthetic inorganic chemistry.", "Students will be introduced to techniques and instruments used in modern chemical research.", "Selected experiments include topics such as molecular orbital calculations of fullerenes and the syntheses and characterization of quantum dots, high-temperature superconductors, and silicon compounds.", "Provide the student with the fundamental knowledge and practical experience in the area of inorganic chemistry", "Gain an appreciation and understanding of the more complex problems in which they may encounter further in their future chemistry careers", "Illustrate the principles and theories of structure and bonding of inorganic compounds", "Syntheses of Silicon Compounds", "Molecular Orbital and Infrared Spectra Calculations of a Lewis Acid:Base Adduct BF3:NH3", "Molecular Orbital Calculation and Electrochemistry of Fullerenes", "Syntheses and UV-Vis of ZnS Quantum Dots", "Solid State Synthesis of High-Temperature YBa2Cu3O7-d (0 < d < 0.5) Superconductor"]}, {"course_id": 43, "course_code": "CHEM 335L", "course_name": "CHEM335L - Advanced Biochemistry Laboratory (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Advanced Biochemistry Laboratory Winter 2025", "Any concerns regarding the marking of lab assignments should first be directed to the teaching assistant that marked your report.", "Finally, this course aims to improve the student’s scientific communication skills through the practice of (i) protocol development and writing; (ii) the understanding and analysis of various kinds of experimental data; (iii) scientific writing with both formal and informal laboratory submissions; and (iv) various data fitting models.", "Date Module Submissions", "Week 4 3a - Enzyme Kinetics with Lactate Dehydrogenase", "Clothing that covers the entirety of your legs Yes", "Students should come prepared for each laboratory period with a written plan in their lab notebook.", "Check the requirements for each lab period and be sure to make suitable preparations.", "table of contents", "entry for each lab week (include flowchart/procedural summary, pre-lab assignment and recorded data)", "use of ink and no liquid paper", "TA initials on raw data", "meaningful labels for all data entered and use of units", "descriptive observations", "overall flow and appearance", "Design/perform and analyze experimental investigations (mandatory) 72%", "Post-lab reports will require the presentation and analysis of data followed by responding to questions relating to the related concepts.", "The following schedule of tasks have been incorporated to ensure your preparation and completion of each In-lab experience.", "· Library for research-based assignments", "Notice of Recording", "The practical exam will be cancelled and its grade contribution removed.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 44, "course_code": "CHEM 360L", "course_name": "CHEM360L - Senior Organic Chemistry Laboratory (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["11:30AM - 05:20PM", "Selected microscale synthetic experiments for students in year three chemistry and biochemistry programs, including spectroscopic identification of organic compounds.", "Design experiments that highlight the theory and application of synthetic laboratory techniques and select organic reactions from CHEM 265 and CHEM 360", "Analyze experimental data including experimental properties and spectroscopic data obtained in the lab or provided by the instructor to draw conclusions about the experiment", "Prepare experimental procedures using journal-article formatting", "Prepare a technical report for a mock company", "Safety glasses can be re-used from a previous course as long as they cover the front and sides of the eyes or can be purchased from any available source ($5-30).", "All of these details can be found on LEARN.", "The plan of action for each unit is due the first day you plan to start that unit.", "Prelab notebook work for each unit is due the first day you plan to start that unit.", "Illness and Short-Term Absence Policies:", "Students can not use the 48-hour short term absence to miss a laboratory session.", "Students that cannot find a partner before the first lab session will be assigned a partner at the start of the first lab session.", "Students will be assigned to a locker the first lab session and continue working in that location throughout the term.", "Glassware and equipment must be cleaned after use (please refer to basic lab techniques for glassware cleaning procedures)."]}, {"course_id": 45, "course_code": "CHEM 221", "course_name": "CHEM221 - Multi-Component Analysis (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Analytical Chemistry: Multi‐component analysis Winter 2025", "CHEM 221", "08:30AM - 09:50AM PHY 150", "•   Alexander Sweett", "Emphasis on planning and decision-making in the analytical process."]}, {"course_id": 46, "course_code": "CHEM 265", "course_name": "CHEM265 - Organic Chemistry 2 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM RCH 305", "09:30AM - 10:20AM RCH 112", "Aromaticity and simple MO theory of conjugated systems.", "Applications of spectroscopic techniques in organic chemistry.", "The emphasis of this course is on the development of problem-solving skills in the context of structure elucidation, synthesis and mechanism of reaction of organic compounds.", "This course aims to reinforce the fundamental aspects of organic chemistry and show how these can be used to explain physical properties and reactivity patterns of organic molecules.", "To understand the mechanisms of common reactions of carbonyl containing compounds.", "Here are some tips to ensuring you do not violate this policy:", "Do not “snip” drawings from online sources, either draw them yourself using a chemical drawing program or by hand.", "Notice of Recording", "Here are some tips to ensuring you do not violate this policy:", "Do not “snip” drawings from online sources, either draw them yourself using a chemical drawing program or by hand."]}, {"course_id": 47, "course_code": "CHEM 310", "course_name": "CHEM310 - Transition Element Compounds and Inorganic Materials (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["The inorganic, organic, and solid state chemistry of the d-block elements.", "The structure and physical properties of co-ordination compounds and transition metal containing solids.", "The role of transition metal organometallics in catalysis.", "The first (and major) part of the course will cover the chemistry and electronic structure of simple coordination compounds; the effects of ligand fields on magnetism, electronic spectra, substitution and redox behaviour will be examined.", "In the second part, the properties of transition metal containing solids will be discussed along with the uses of these systems in, for example, lasers, and heterogeneous catalysts.", "• Understand the important roles that transition metal inorganic chemistry plays in materials and biological processes;", "• Describe and explain the bonding inherent to transition metal inorganic complexes;", "• Discuss the impact and influence of the unpaired electrons in the d-block elements in the spectroscopic, optical and magnetic properties of the materials and proteins that contain them;", "• Apply basic crystal field and molecular orbital concepts to explain the structures of coordination complexes.", "Configuration of d-elements, d-orbitals and shapes of coordination complexes.", "Crystal field effects in transition metal chemistry.", "Module 2: Symmetry, group theory, and character tables for inorganic complexes.", "Metal-ligand σ and π-bonding, and the origin of the spectro-electrochemical series.", "Module 4: Optical and Magnetic properties of TM complexes.", "Electronic and charge-transfer spectra of transition metal ions.", "Magnetic behaviour of metal ions.", "Descriptive chemistry of various geometries and the complexes that form them.", "Reduction and oxidation chemistry of the transition metal elements", "Substitutions; thermodynamic and kinetic stability; mechanisms of redox reactions in proteins.", "Carbonyl complexes and metallocenes.", "In the case of a missed final, the final can be taken the next time the course is offered."]}, {"course_id": 48, "course_code": "CHEM 313", "course_name": "CHEM313 - Main Group and Solid State Chemistry (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Main Group and Solid State Chemistry Winter 2025", "08:30AM - 09:20AM", "This course provides a detailed examination of the structure and bonding in main group and solid state compounds, including valence bond and molecular orbital theory for describing electronic structures, Hueckel and extended Hueckel approximations.", "Structures of simple solids, including close packing of spheres and derived ionic lattice types; aspects of chemical crystallography, Bravais lattices, point groups, space groups, crystal planes, and X-ray diffraction; Ionic interactions in gases and solution; the thermodynamics of acid-base interactions; descriptive chemistry and characterization of main group element compounds.", "Apply bonding theories to interpret experimentally observed trends in acid-base interactions", "Communicate the basic principles of solid state structures", "Understand X-ray diffraction and its application to structural analysis of solid state materials", "Estimate electronic structure of solids", "3 weeks of solid state symmetry and electronic structure"]}, {"course_id": 49, "course_code": "CHEM 331", "course_name": "CHEM331 - Fundamentals of Metabolism 1 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Dara Gilbert", "Email: d2gilber@uwaterloo.ca", "First we will cover general principles of thermodynamics and high energy compounds ( NTPs, NAD(P)+ and fats).", "And some general principles of the energy metabolism and the regulation of metabolic pathways.", "draw the chemical structures of the intermediates in these pathways and use this information to understand and ever predict similar pathways in other organisms", "draw the chemical mechanisms of the enzymes involved in these metabolic pathways and to use that information to apply it to new systems and the synthesis of starting materials for synthesis.", "understand the interconnection of these pathways and the basis, of the regulation and coordination of these pathways.", "see how disruptions in these pathways lead to different disease states", "predict new uses of these pathways for the synthesis of useful compounds such as biofuels", "Week 8-9: Fatty acid oxidation and biosynthesis and cholesterol metabolism   J and F chapter 17 and 21", "I will be using the online textbook", "Notice of Recording", "Re-creating test questions and answers without the express permission of the course instructor"]}, {"course_id": 50, "course_code": "CHEM 357", "course_name": "CHEM357 - Physical Biochemistry (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Physical Biochemistry Winter 2025", "10:30AM - 11:20AM RCH 307", "B. Power", "Instructor: Bill Power", "The use of diffusion, ultracentrifugation, osmotic pressure, electrophoresis and X-ray diffraction to study the properties of biopolymers.", "This course is meant to provide you with a basic introduction to physical chemistry as applied to the life sciences with emphasis on applications in biochemistry.", "This course will cover the basics of thermodynamics and their applications to biological molecules and systems, their transport properties, chemical and enzyme kinetics, and physical techniques used to establish and investigate the structures of biological macromolecules.", "I will aim to provide you with all the background necessary to cover the many topics in this course, from entropy and thermodynamic principles from the 18th century to modern applications such as AI which resulted in half of the the 2024 Nobel Prize in Chemistry going to Google's DeepMind leaders Demis Hassabis and John Jumper for their development of AlphaFold, a protein structure database (of 220 million structures!).", "In return you should have some familiarity with the basics of biochemistry and biological structures and terminology, as well as some comfort working with derivatives, including partial derivatives, integrals and differential equations.", "Understand the four laws of thermodynamics and their applications to biological systems", "Understand the importance of Gibbs free energy and chemical potential in describing physical and chemistry transformations", "Understand the basics of chemical kinetics and rate laws and mechanisms", "Be able to characterize enzyme kinetics using the Michaelis-Menten description and describe competition and inhibition in such mechanisms", "Know how to apply and interpret structural tools such as optical and NMR spectroscopy, X-ray diffraction and computational tools to biological macromolecules", "There will be online and in-class assignments, on a rotating interval of about two weeks.", "It will occur in a 2.5 hour time slot sometime between April 9 and April 25 (I have no control over this scheduling).", "Weeks 1 to 3:   Thermodynamics, its Laws and its Applications", "Week 10:            Biomolecular Structure; Optical Spectroscopy", "Weeks 11 to 12: NMR Spectroscopy; X-ray Diffraction; AI Methods and AlphaFold", "We will cover much of this book, though perhaps not in detail in some sections, and it should be a useful resource.", "I will have a copy on reserve in the library (https://www.reserves.uwaterloo.ca/ares/ares.dll?Action=10&Form=50&Value=222107) and the price listed here is for a one-year electronic subscription (https://www.pearson.com/en-ca/subject-catalog/p/physical-chemistry-principles-and-applications-in-biological-sciences/P200000006771/9780137612826).", "This course includes the independent development and practice of specific skills, such as problem solving in a chemical and scientific context.", "Library for research-based assignments"]}, {"course_id": 51, "course_code": "CHEM 360", "course_name": "CHEM360 - Organic Chemistry 3 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["08:30AM - 09:50AM MC 2034", "Email: graham.murphy@uwaterloo.ca", "FMO theory, organometallics, and transition metal-catalyzed C-C bond formation.", "Chemistry 360 builds on the concepts and chemistry taught in CHEM 264 and CHEM 265.", "If you want to do well in CHEM 360, you should re-familiarize yourself with some of the material in your introductory organic chemistry courses.", "More specifically, CHEM 360 will familiarize students with some of the modern synthetic methods for the formation of carbon-carbon sigma bonds in organic compounds.", "An array of anionic, cationic, pericyclic, and organometallic methods will be introduced as part of three general sections, and the factors governing the mechanistic, stereochemical and regiochemical course of these processes will be presented and discussed as appropriate.", "Section 1 will cover enols and enolates, condensations and a-substitutions of carbonyl compounds (acid- and base-catalyzed), and conjugate addition to a,b-unsaturated carbonyl compounds (acid- and base-catalyzed).", "Section 2  will cover pericyclic reactions (cycloadditions under thermal and photochemical conditions), with an emphasis on how an appreciation of frontier molecular orbitals allows for prediction of the reactivity of the systems (thermal and photochemical conditions), as well as relative reaction rates, regiochemistry and stereochemistry.", "Section 3  will present transition-metal catalysis and organometallic reactions, with a particular emphasis on Pd-catalyzed cross-coupling reactions.", "1) To learn to use curve arrow formalism to “push” pairs of electrons in writing resonance forms and in sketching electron flow in chemical reactions.", "To be able to use the understanding of reactions mechanisms to predict the outcome of these chemical reactions (mechanistic reasoning to interpret pattern of reactivity).", "4) To be able to identify intermediates versus transition states in an energy diagram for all fundamental condensation reactions and be able to determine the difference between kinetically and thermodynamically controlled reactions, identify equilibrium and reaction rates, and relate to the energy of the transitions state, starting material, and final products.", "7) To be able to identify neutral cyclic transitions states, involving bond-forming and bond-breaking events, in cycloaddition reactions, under thermal and photochemical conditions.", "To be able to use frontier molecular orbitals (FMO’s) to predict the reactivity of cycloadditions under thermal and photochemical conditions, as well as relative reaction rates, regiochemistry and stereochemistry (Endo rule).", "11) To be able to generate catalytic cycles for common cross-coupling reactions, namely Suzuki, Stille, Heck, Sonogashira, and Buchwald-Hartwig (Buchwald-Hartwig amination), as well as variations involving carbon monoxide.", "No Free Online Access", "No e-textbook can be sourced from the publisher, starting from $49.49 USD", "The exams are in-person, and any conflicts with the timing of these exams should be brought to my attention ASAP for possible alternate exam scheduling.", "This will be 75 minutes in length and will be worth 25% of your course grade.", "This will be 75 minutes in length and will be worth 25% of your course grade.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 52, "course_code": "CO 481", "course_name": "CO481 - Introduction to Quantum Information Processing (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Quantum Information Processing Winter 2024", "Basics of computational complexity; basics of quantum information; quantum phenomena; quantum circuits and universality; relationship between quantum and classical complexity classes; simple quantum algorithms; quantum Fourier transform; Shor factoring algorithm; Grover search algorithm; physical realization of quantum computation; error-correction and fault-tolerance; quantum key distribution.", "This course aims to give a basic foundation in the field of quantum information processing (often just called \"quantum computing\").", "QIP is a multidisciplinary subject and therefore this course will introduce fundamental concepts in theoretical computer science and physics that will enable students to pursue further study in various aspects of QIP.", "Prerequisites: A solid background in basic linear algebra (e.g. a good performance in MATH 235 or MATH 114) is necessary.", "Explain the logical level functioning of quantum computers.", "Describe and analyze several elementary quantum algorithms.", "Introduction to Quantum Mechanics (6 hrs)", "Bloch sphere.", "Introduction to Computation and Computational Complexity (6 hrs)", "Quantum circuits.", "Basic complexity classes.", "Quantum Algorithms (9 hrs)", "Basic algorithms.", "Implementations of quantum information processors.", "An Introduction to Quantum Computing, by Kaye et al.", "Students may assist each other in working through assignment problems, as"]}, {"course_id": 53, "course_code": "CS 230", "course_name": "CS230 - Introduction to Computers and Computer Systems (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Computers and Computer Systems Winter 2025", "08:30AM - 09:50AM MC 1085", "10:00AM - 11:20AM MC 2065", "10:30AM - 11:20AM MC 4045", "11:30AM - 12:20PM MC 2017", "MC6228", "TBA", "cs230@uwaterloo.ca", "TBA", "TBA", "An introduction to hardware and software concepts used in computer systems.", "Specific topics include machine-level programming, memory organization, and basic I/O mechanisms.", "Build and Execute", "Program in assembly language", "Understand the basics of machine internals", "Understand the basic elements of the compilation cycle", "Understand the basic principles of multiprocessing", "Note: Submissions for programming questions should only use code and concepts taught during lectures.", "Use of code or advanced concepts not taught in the course will be viewed as a possible violation of Academic Integrity for passing off someone else's work as your own.", "The assignments have a flexible late-day system detailed here:", "These cannot be used on quizzes.", "Multiple assignment extensions can be used on one assignment and/or split across different assignments.", "You do not need a reason to use assignment extensions, you may use them as you please.", "These servers are shared with all other CS courses.", "Students are expected to start assignments early in case something unexpected occurs closer to the deadline.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 54, "course_code": "CS 330", "course_name": "CS330 - Management Information Systems (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Management Information Systems Winter 2025", "Email: kevin.lanctot@uwaterloo.ca", "An introduction to information systems and their strategic role in business.", "Topics include types of information systems, organizational requirements, systems development strategies, decision support systems, data and information management, and information systems management, control, and implementation.", "This course is aimed at students who are not CS majors but are interested in continuing their study of computer science beyond first year.", "Make informed decisions about using technology in a business environment.", "Define and explain the characteristics of a variety of business information systems.", "Describe strategic roles and management usage for information systems in business.", "Understand the relationships among various information systems.", "A1", "Feb 25, 27 Topic 4 - Introduction to IS (Ch 1 in text)", "A2", "A4", "A copy of the 7th edition will be placed on 3-hour reserve in the Davis Library.", "Evaluation", "If you miss the final assessment, you will be given an INC if there is a strong reason for missing it (generally a serious medical issue verified by a VIF).", "This course includes the independent development and practice of specific skills, such as designing information systems.", "Library for research-based assignments", "Physical and Mental Health", "See https://uwaterloo.ca/campus-wellness/ for a list of on-campus supports and workshops.", "In particular:", "Intellectual property includes items such as:"]}, {"course_id": 55, "course_code": "CS 338", "course_name": "CS338 - Computer Applications in Business: Databases (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Computer Applications in Business: Databases Winter 2025", "A user-oriented approach to the management of large collections of data.", "Design relational databases", "Construct SQL queries for data retrieval", "Develop strategies for data storage and backup", "Introduction and Terminology", "Relational Data Model", "Relational Algebra", "SQL: Aggregation and Grouping", "SQL: Data and Schema Modifications", "SQL: Null Values", "ER Models", "EER Model", "EER to Relation Mapping", "DBMS Concepts and Architecture", "Transaction Processing", "Database Recovery", "Database Security", "Distributed Databases", "Business Analytics", "We highly recommend thoroughly understanding and verifying your assignment solutions to set yourselves up for success in this course since  exams in CS 338 will be closed-book, and without a strong understanding of the assignments, you may find the exams challenging."]}, {"course_id": 56, "course_code": "CS 467", "course_name": "CS467 - Introduction to Quantum Information Processing (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Quantum Information Processing Winter 2024", "Basics of computational complexity; basics of quantum information; quantum phenomena; quantum circuits and universality; relationship between quantum and classical complexity classes; simple quantum algorithms; quantum Fourier transform; Shor factoring algorithm; Grover search algorithm; physical realization of quantum computation; error-correction and fault-tolerance; quantum key distribution.", "This course aims to give a basic foundation in the field of quantum information processing (often just called \"quantum computing\").", "QIP is a multidisciplinary subject and therefore this course will introduce fundamental concepts in theoretical computer science and physics that will enable students to pursue further study in various aspects of QIP.", "Prerequisites: A solid background in basic linear algebra (e.g. a good performance in MATH 235 or MATH 114) is necessary.", "Explain the logical level functioning of quantum computers.", "Describe and analyze several elementary quantum algorithms.", "Introduction to Quantum Mechanics (6 hrs)", "Bloch sphere.", "Introduction to Computation and Computational Complexity (6 hrs)", "Quantum circuits.", "Basic complexity classes.", "Quantum Algorithms (9 hrs)", "Basic algorithms.", "Implementations of quantum information processors.", "An Introduction to Quantum Computing, by Kaye et al.", "Students may assist each other in working through assignment problems, as"]}, {"course_id": 57, "course_code": "CS 475", "course_name": "CS475 - Computational Linear Algebra (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Computational Linear Algebra Spring 2024", "Basic concepts and implementation of numerical linear algebra techniques and their use in solving application problems.", "Special methods for solving linear systems having special features.", "QR and SVD methods for solving least squares problems.", "Computation and uses of these decompositions in practice.", "Basic concepts and implementation of numerical linear algebra techniques and their use in solving application problems.", "Special methods for solving linear systems having special features.", "QR and SVD methods for solving least squares problems.", "Computation and uses of these decompositions in practice.", "Solving special linear systems", "Understanding least squares problems and some applications", "Numerical Linear Algebra}, L.N. Trefethen and D. Bau III, SIAM, QA184.T74, 1997 Optional No", "Iterative Methods for Sparse Linear Systems, 2nd edition}, Y. Saad, SIAM, QA188.S17, 2003 Optional No", "Applied Numerical Linear Algebra, J. Demmel, SIAM QA184.D455, 1997.", "Undergrads", "Please inform the instructor to make the deadline adjustment.", "Your code is an important part of the assignment, and as such it should be readable and well-commented.", "Assignment figures and graphs should be carefully thought out and labelled to present the data and your conclusions in an effective and clear manner.", "Any code and algorithms you write should be sufficiently well documented through code comments or descriptions as to be readily understood.", "This code submission should allow the TAs to run your code if and when necessary to verify the results that your code produces.", "This could be a literature survey of a subtopic in numerical linear algebra, an empirical comparison/implementation of several related algorithms, an application of numerical linear algebra to another field, the design of a novel numerical linear algebra algorithm, or a theoretical analysis of the performance of a numerical linear algebra algorithm (new or old).", "Collaboration and Plagiarism:", "We encourage you to discuss general concepts and problems with classmates, TAs, and instructors.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Intellectual property includes items such as:", "Avoiding Academic Offenses", "Many students may be unaware of the line between acceptable and unacceptable academic behaviour, especially when discussing", "For information and tips related to academic integrity, students may", "Your suggestions are encouraged and", "The most severe COVID-related risks have lessened for many people, such as individuals", "With these facts in", "mind, one way that everyone in our class can contribute to a safer and more equitable learning environment is to stay home when you", "are ill and, at minimum, wear a mask if you suspect you might be contagious.", "A range of on- and off-campus resources are available", "the Six Nations that includes six miles on each side of the Grand River."]}, {"course_id": 58, "course_code": "PHYS 467", "course_name": "PHYS467 - Introduction to Quantum Information Processing (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Quantum Information Processing Winter 2024", "Basics of computational complexity; basics of quantum information; quantum phenomena; quantum circuits and universality; relationship between quantum and classical complexity classes; simple quantum algorithms; quantum Fourier transform; Shor factoring algorithm; Grover search algorithm; physical realization of quantum computation; error-correction and fault-tolerance; quantum key distribution.", "This course aims to give a basic foundation in the field of quantum information processing (often just called \"quantum computing\").", "QIP is a multidisciplinary subject and therefore this course will introduce fundamental concepts in theoretical computer science and physics that will enable students to pursue further study in various aspects of QIP.", "Prerequisites: A solid background in basic linear algebra (e.g. a good performance in MATH 235 or MATH 114) is necessary.", "Explain the logical level functioning of quantum computers.", "Describe and analyze several elementary quantum algorithms.", "Introduction to Quantum Mechanics (6 hrs)", "Bloch sphere.", "Introduction to Computation and Computational Complexity (6 hrs)", "Quantum circuits.", "Basic complexity classes.", "Quantum Algorithms (9 hrs)", "Basic algorithms.", "Implementations of quantum information processors.", "An Introduction to Quantum Computing, by Kaye et al.", "Students may assist each other in working through assignment problems, as"]}, {"course_id": 59, "course_code": "CHEM 266", "course_name": "CHEM266 - Basic Organic Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "11:30AM -", "Structure, nomenclature, and reactions of important classes of organic compounds.", "Stereochemistry and its role in reaction mechanisms.", "Name basic organic molecules", "Draw resonance structures and identify major and minor contributors", "Identify and describe the acidity and basicity of various molecules", "Draw organic molecules in three dimensions and identify the lowest and highest energy conformations", "Describe the stereochemical relationship between different molecules", "Explain chemical reactions using energy diagrams", "Understand the reactivity of a variety of molecules containing a variety of functional groups", "Molecular Modelling Kit No", "Notice of Recording"]}, {"course_id": 60, "course_code": "CHEM 266L", "course_name": "CHEM266L - Organic Chemistry Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["CHEM 266L", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "CHEM 266L 006", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Answers can be expected within 24 hours.", "Piazza is available for clarification questions but I will only provide quick answers as I prefer having longer conversations in person.", "View requirements for CHEM 266L", "Topics include acid-base chemistry, substitution reactions, Grignard reactions, liquid-liquid extraction, product isolation and purification.", "Be proficient with basic organic laboratory techniques including selecting proper glassware, measuring small and large quantities of solids and liquids, designing the setup required for simple synthetic reactions, filtration, and basic characterization.", "Understand and be able to design and execute a liquid-liquid extraction processes for the separation of ionizable acidic, ionizable basic, and non-ionizable (neutral) substances.", "Demonstrate independent thinking by answering questions in your own words, showing critical reflection beyond the initial description of observations and facts.", "Laboratory performance marks will be given by the Teaching Assistants and Lab Instructor and averaged for each in-person lab period.", "This is not directly the case; we do expect students to need a lot of clarifications when working in the lab for the first time.", "Laboratory Worksheets and Reports", "Questions similar to the pre-laboratory quizzes and reports will be used, but may be modified to be multiple choice.", "Human rights must be centered in our pedagogical practice to ensure students feel safe and respected into our instructional spaces.", "We also acknowledge that speaking of underrepresented groups in Science is a misnomer and we should speak of historically excluded persons as Black, Indigenous, Queer and Persons of Colour have contributed to chemical research since the inception of the field.", "Scheduling issues", "General Policies", "Aside from LEARN, we will use various software to facilitate the delivery of the laboratory.", "Important note: Since the manual is printed months before delivery of the lab, we may need to make corrections during the term.", "Expectation of Academic Integrity", "Be especially careful with sharing diagrams and mechanisms, as we often detect excessive collaboration when students share images.", "None-the-less all violations of academic misconduct will be dealt with be taken seriously and dealt with according to the consequences outlines in Policy 71."]}, {"course_id": 61, "course_code": "CHEM 267", "course_name": "CHEM267 - Basic Organic Chemistry 2 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["A continuation of the concepts of CHEM266, including material on amines, aromatics, enols and enolates, and nucleophilic addition and substitution at the carbonyl group.", "Introduction to nuclear magnetic resonance and infrared spectroscopy.", "CHEM 267 is a continuation of the study of fundamental aspects of organic chemistry begun in CHEM 266.", "The emphasis of the course is on the development of problem solving skills in the context of reaction mechanisms, structure-reactivity relationships and structure elucidation.", "The course will require you to understand why some molecular features lead to certain reactivity patterns and use that knowledge to make sound predictions in different but related systems.", "Topics include a description of chemical and physical properties of carbonyl, aromatic, and nitrogen compounds and an introduction to spectroscopic methods for the identification of organic molecules.", "Identify reagents and reaction conditions for the preparation of simple organic molecules.", "Explain synthetic pathways and devise simple synthetic strategies for the preparation of organic compounds", "Analyze IR and NMR spectra to identify simple organic compounds", "Introduction", "Conjugated p systems", "Reaction of Aromatic compounds", "Reaction of Aromatic compounds", "- Amines", "- Reaction of Aromatic compounds - Amines", "- Aldehydes and ketones", "CH 21.4.6 & 21.4.7", "Aldehydes and ketones", "Condensations and Alpha Substitutions of Carbonyl Compounds", "Condensations and Alpha Substitutions of Carbonyl Compounds", "- Condensation", "- Amines", "When you sign into the Textbook, you will see the chapter models in the left window.", "Purchase online or entering an access code purchased at your campus bookstore**", "Solving problems–making connections–and recognizing patterns are key steps to succeeding in this Course.", "Drop one midterm", "(closed-book)", "Comprehensive Final Examination: There will be a 2.5-hour exam held during the exam period and scheduled by the Registrar's Office.", "The final is a closed-book exam.", "If you become ill while away from the University and miss a test or an exam as a result of that illness, then you may supply a Doctor’s certificate covering the precise period of absence, provided the certificate includes a classification of the illness as slight, moderate, or severe.", "Students should carefully consider the wisdom of missing a test or exam."]}, {"course_id": 62, "course_code": "CHEM 267L", "course_name": "CHEM267L - Organic Chemistry Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Answers can be expected within 24 hours.", "Experiments include the reduction of vanillin; an electrophilic aromatic substitution; the synthesis of a fragrant ester using Fischer esterification and preparation of a fluorescent laser dye, 3-acetyl-7-(diethylamino)-2H-1-benzopyran-2-one.", "The organic chemistry laboratory provides students with opportunities to carry out some of the organic synthesis reactions encountered in CHEM 267 in a real-world experience.", "Additionally, students will become versed in several basic organic chemistry laboratory techniques including: liquid-liquid extraction, distillation, one and two solvent recrystallization and melting point determination, to name a few.", "Be proficient with basic organic laboratory techniques including selecting proper glassware, measuring small and large quantities of solids and liquids, designing the setup required for simple synthetic reactions, filtration, and basic characterization.", "Understand and be able to design and execute a liquid-liquid extraction processes for the separation of ionizable acidic, ionizable basic, and non-ionizable (neutral) substances.", "Scheduling issues", "Fillable form online for Möbius support", "Laboratory performance marks will be given by the Teaching Assistants and Lab Instructor and averaged for each in-person lab period.", "To receive 10/10 in performance this term you must show self-sufficiency by either replacing empty acetone bottles at the sink, refilling the DI water, letting your TA know the bottles at your workstation need a top-up and cleaning shared areas beyond your own.", "This is not directly the case; we do expect students to need a lot of clarifications when working in the lab for the first time.", "Laboratory Worksheets and Reports", "General Policies", "Aside from LEARN, we will use various software to facilitate the delivery of the laboratory.", "Important note: Since the manual is printed months before delivery of the lab, we may need to make corrections during the term."]}, {"course_id": 63, "course_code": "AMATH 382", "course_name": "AMATH382 - Computational Modelling of Cellular Systems (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Computational Modelling of Cellular Systems Winter 2024", "08:30AM - 09:50AM MC 4061", "B. Ingalls", "An introduction to dynamic mathematical modeling of cellular processes.", "The emphasis is on using computational tools to investigate differential equation-based models.", "This course provides an introduction to dynamic mathematical modeling of cellular processes.", "The emphasis will be on using computational tools to investigate models of cellular phenomena.", "The course then addresses models in four biological domains: metabolic networks, signal transduction pathways, gene regulatory networks and electrophysiology.", "Intended Audience: Third and fourth year students interested in dynamic modelling in molecular cell biology.", "Software: We will be making heavy use of packages for numerical simulation of differential equations.", "Appendix C of the course notes consists of tutorials on MATLAB and XPPAUT, which is a GUI-based package for dynamical systems analysis.", "Design and simulate ordinary differential equation models of chemical reaction networks", "Investigate differential equation models using phase plane analysis, sensitivity analysis, and bifurcation analysis", "Develop and interpret differential equation models of biomolecular networks in the context of cellular metabolism, signal transduction, gene regulation, and electrophysiology", "Design and simulate stochastic models of gene regulatory networks", "Provide critical analysis of kinetic models of intracellular networks in the scientific literature and communicate their potential and limitations", "Kinetic Modelling of Biochemical Networks", "Module 3. Dynamics and Stability", "Mathematical Modeling of Systems Biology posted: https://www.math.uwaterloo.ca/~bingalls/MMSB/ Yes", "Term project will be completed in groups of two.", "Oral presentations will be in person during 20-minute time-slots scheduled during the last week of lectures (45% of project grade)", "Notice of Recording"]}, {"course_id": 64, "course_code": "BIOL 266", "course_name": "BIOL266 - Introduction to Computational Biology (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Computational Biology Fall 2022", "Instructor: Prof. Andrew Doxey", "This course provides an introduction to computational methods in biology, including exploration of bioinformatics databases and tools, analysis of protein and DNA sequences, and computer-aided modelling of biological systems.", "Explore online bioinformatic databases to interact with DNA, protein, gene expression, structural, and systems biology data", "Compute optimal alignments between pairs of sequences using dynamic programming algorithms", "Perform multiple sequence alignments", "Perform 3D structural modelling and visualization of proteins", "Examine and analyze gene expression data from microarrays and RNA-seq experiments", "Understand the fundamentals of systems biology including network analysis and visualization of interactomes", "Data Type", "Introduction   None", "Molecular evolution I Trees Lab #4 - Phylogenetics I 2.2%", "Molecular evolution II Trees MIDTERM 30%", "Molecular evolution III Trees Lab #5 - Phylogenetics II 2.2%", "Structural modelling and biophysics Structures Lab #6 - Structural Modeling 2.2%", "Networks and Systems Biology Networks Lab #9 - Exploring the STRING database 2.2%"]}, {"course_id": 65, "course_code": "BIOL 382", "course_name": "BIOL382 - Computational Modelling of Cellular Systems (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Computational Modelling of Cellular Systems Winter 2024", "08:30AM - 09:50AM MC 4061", "B. Ingalls", "An introduction to dynamic mathematical modeling of cellular processes.", "The emphasis is on using computational tools to investigate differential equation-based models.", "This course provides an introduction to dynamic mathematical modeling of cellular processes.", "The emphasis will be on using computational tools to investigate models of cellular phenomena.", "The course then addresses models in four biological domains: metabolic networks, signal transduction pathways, gene regulatory networks and electrophysiology.", "Intended Audience: Third and fourth year students interested in dynamic modelling in molecular cell biology.", "Software: We will be making heavy use of packages for numerical simulation of differential equations.", "Appendix C of the course notes consists of tutorials on MATLAB and XPPAUT, which is a GUI-based package for dynamical systems analysis.", "Design and simulate ordinary differential equation models of chemical reaction networks", "Investigate differential equation models using phase plane analysis, sensitivity analysis, and bifurcation analysis", "Develop and interpret differential equation models of biomolecular networks in the context of cellular metabolism, signal transduction, gene regulation, and electrophysiology", "Design and simulate stochastic models of gene regulatory networks", "Provide critical analysis of kinetic models of intracellular networks in the scientific literature and communicate their potential and limitations", "Kinetic Modelling of Biochemical Networks", "Module 3. Dynamics and Stability", "Mathematical Modeling of Systems Biology posted: https://www.math.uwaterloo.ca/~bingalls/MMSB/ Yes", "Term project will be completed in groups of two.", "Oral presentations will be in person during 20-minute time-slots scheduled during the last week of lectures (45% of project grade)", "Notice of Recording"]}, {"course_id": 66, "course_code": "CHEM 400", "course_name": "CHEM400 - Special Topics in Chemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Special Topics in Chemistry Winter 2025", "A selection of current and advanced topics of interests in many areas of chemistry.", "\"Quantum Mechanics in Chemistry\" is the title for this section of Chem400", "In the Winter 2025 term the focus of the course will be electronic structure theory and a smaller segment on coupled electron-nuclear motion, developing theory beyond the Born Oppenheimer approximation.", "The course will cover a description of the basic electronic structure problem introducing an atomic orbital basis set, Slater determinants and the Slater-Condon rules.", "In another segment we will discuss vibronic coupling, introducing diabatic electronic states and simple model problems and introduce techniques to solve them using simple Python programs.", "Have a good understanding of the electronic structure problem in Chemistry and how it connects to thermochemistry.", "Have an in depth understanding of the Hartree-Fock method and the basic Hartree-Fock algorithm.", "Be able to construct Hamiltonian matrix for small problems using Slater-Condon rules", "Have introductory knowledge of Coupled Cluster methods for ground and excited states, and the concept of size-consistency.", "Have introductory understanding of non-adiabatic nuclear dynamics going beyond the Born-Oppenheimer approximation.", "Week 1,2: General introduction to quantum mechanics and the main uses in chemistry / thermochemistry.", "Discussion of fundamental principles of Density Functional Theory.", "Extension to multiple electronic surfaces.", "Vibronic models beyond Born-Oppenheimer.", "Notice of Recording", "Since assignments are at the core of the assessment for the class, I want everybody to do all of these assignments.", "Students can contact the instructor."]}, {"course_id": 67, "course_code": "CHEM 404", "course_name": "CHEM404 - Physicochemical Aspects of Natural Waters (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Physicochemical Aspects of Natural Waters Fall 2024", "This will be followed by a review of fundamental thermodynamic concepts, including chemical potential, Gibbs free energy, thermodynamic equilibrium, enthalpy and entropy.", "Carbon dioxide equilibria in natural waters will then be briefly discussed.", "understand the complex processes determining the fate of pollutants in natural waters", "predict the fate of chemicals in natural waters based on their physicochemical properties", "Acids and bases in water", "Sorption", "Diffusion", "Stumm and Morgan, J. Wiley & Sons, Inc. (GB 855.S78 1996) Supplementary reading No", "Each student will be required to present a critical summary of an original research paper published in current scientific literature (please note that no review papers will be allowed)."]}, {"course_id": 68, "course_code": "CHEM 430", "course_name": "CHEM430 - Special Topics in Biochemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Special Topics in Biochemistry Winter 2025", "08:30AM - 09:20AM", "RCH 204", "D. Sychantha", "Discussion of specialized topics related to the research interests of the members of the Centre.", "For example, recent offerings have included: Metalloproteins and Metalloenzymes; Heme Proteins; Chemistry of Enzymatic Reaction Mechanisms; Peptides - Synthesis, Structure and Function; Food Enzymology; Advanced Microbial Physicology; NMR in Biological Systems.", "Antibiotics play essential roles in all branches of healthcare, and the emergence and spread of antibiotic-resistant bacteria pose a significant risk to public health.", "It will also explore the complexities of antimicrobial resistance mechanisms and practical approaches to overcome them.", "The chemical characteristics of antibiotics", "The biological interactions of antibiotics with bacteria and humans", "The mode of action of major antibiotic classes", "Methods for antitbioc discovery"]}, {"course_id": 69, "course_code": "NE 451", "course_name": "NE451 - Simulation Methods (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Simulation Methods Fall 2024", "10:00AM - 11:20AM RCH 105", "08:30AM - 09:50AM DWE 3518", "This course provides an introduction to and an overview of computational methods that are currently employed for the simulation of structural and bulk properties of matter, particularly as applied to physical and biological systems at the nanometer scale.", "Topics to be covered in this course include energy functions and force fields, geometry optimization, normal mode analysis, and reaction--path techniques at the molecular level, and an introduction to the simulation of static and dynamic properties of substances via both Monte Carlo and molecular dynamics (MD) methodologies.", "Simulation Methods is a comprehensive course that covers a wide range of computational techniques used to simulate the structural and bulk properties of materials in physical and biological systems at the nanometer scale.", "By mastering these techniques, students can contribute to advancements in materials science and engineering, enabling them to tackle complex challenges in nanoscale materials research.", "In addition to theoretical concepts, each module includes a lab component where students gain hands-on experience with different software, practical simulation applications, and coding examples.", "This practical approach helps students apply the learned concepts to real-world material systems and build their computational skills", "Analyze and articulate the benefits and drawbacks of different computational methods", "Use High-performance computing for materials design", "Choose suitable computational approaches for addressing specific material properties and processing challenges", "Critically assess scientific literature that employs computational techniques", "Foundations and Theorems of DFT: Including the Hohenberg-Kohn Theorems.", "Kohn-Sham Method and Cycle: Understanding the Kohn-Sham approach and its practical applications.", "Exchange-Correlation Approximations: Various methods for approximating exchange-correlation.", "Basis Sets and Pseudopotentials: Gaussian and plane wave basis sets, and the theory of pseudopotentials.", "Module 2: Molecular Dynamics Simulation", "Newtonian Dynamics and Interaction Potentials: Basic principles and types of potentials (e.g., pair, Tersoff, ionic).", "MD Simulation Algorithms: Various algorithms such as Verlet, leapfrog, and Beeman's algorithms.", "Thermodynamic Equilibrium and Ensemble Averages: Concepts of equilibrium, ensemble averages, and thermostat methods.", "Boundary Conditions and Pressure Control: Handling boundary conditions and controlling pressure in simulations.", "Module 3: Introduction to Monte Carlo Method in Science and Engineering", "Basic Principles of Monte Carlo Methods: Introduction and foundational concepts.", "Metropolis-Hastings Algorithm: Including the simulation of the Ising model.", "Kinetic Monte Carlo Simulations: Basic principles and specific problems.", "Introduction to Graph Neural Networks (GNNs): Basics and importance in materials science.", "Structure and Function of GNN Layers: Including message passing and aggregation techniques.", "hands-on  Lab 3: Molecular Dynamics Simulations", "Internet connection Yes", "Linux Basic Commands", "Statistical Thermodynamics", "Required Software and Tools", "conda", "Quantum ESPRESSO", "LAMMPS Molecular Dynamics Simulator", "These assignments are designed to assess your ability to apply the skills and knowledge gained during the lab, reinforcing key concepts and contributing to your overall course grade", "Below are the key components of our assignment screening process:", "Identical submissions (whether it be", "This collaborative approach promotes a deeper understanding of the subject matter and nurtures critical evaluation skills among students.", "These tools allow students to run and test their programs efficiently, facilitating accurate assessments of their coding skills and simulation results."]}]