[{"course_id": 30, "course_code": "CHEM 494A", "course_name": "CHEM494A - Research Project (0.50)", "term_name": "Required Courses", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["C2 281", "/B may not be taken concurrently without prior permission of the CHEM494 co-ordinator.", "- develop an understanding of research in a specific area by reading the relevant scientific literature", "- translate and integrate the skills and knowledge learned during their undergraduate studies and apply them to an independent research project", "- interpret their results and rationalize them in the context of their hypothesis", "- communicate their research and associated findings through oral presentation and defense", "- communicate their research area, experimental findings and conclusions through their research reports", "Please see course LEARN site for submission of reports via Dropbox.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 31, "course_code": "CHEM 494B", "course_name": "CHEM494B - Research Project (0.50)", "term_name": "Required Courses", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["10:30AM - 11:20AM RCH 207", "C2 281", "A continuation of CHEM494A. CHEM494A/B may not be taken concurrently without prior permission of the CHEM494 co-ordinator.", "- develop am understanding of research in a specific area by reading the relevant scientific literature", "- translate and integrate the skills and knowledge learned during their undergraduate studies and apply them to an independent research project", "- interpret their results and rationalize them in the context of their hypothesis", "- communicate their research and associated findings through oral presentation and defense", "- communicate their research area, experimental findings and conclusions through their research reports", "Please see course LEARN site for submission of reports via Dropbox.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 32, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 33, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 35, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 36, "course_code": "PHYS 111", "course_name": "PHYS111 - Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["An introduction to physics for students intending to concentrate their further studies in biology, dentistry, medicine and paramedicine; includes particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.", "The main physics principles and laws covered in PHYS 111 include: “Particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.”", "PHYS 111 focuses on basic physics principles and laws, on conceptual understanding and problem-solving skills, and an appreciation for the power of physics in explaining how nature works, in the contexts of both the physical and life sciences.", "Physics Principles and Laws: By the end of the course, students will be able to construct scientifically sound explanations of a variety of basic physical phenomena by applying basic physics principles/laws.", "define linear momentum, and calculate and compare momenta of various real-life objects;", "define and calculate impulse, and establish the conditions for conservation of linear momentum; and", "apply the laws of conservation of momentum and energy to collisions.", "Problem-Solving Skills and Strategies: By the end of the course, students will be able to creatively apply a variety of structured problem-solving strategies:", "interpret, visualize and convert the problem into a physical model (e.g., draw a free body diagram);", "evaluate the result — does it make sense?", "These problem-solving skills are useful in the students’ own disciplines and beyond.", "More detailed information about the course elements which contribute to the final grade will be given in the learn sight and in future outline updates", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 37, "course_code": "PHYS 111L", "course_name": "PHYS111L - Physics 1 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "Derin Erisoglu-Akyildiz", "Saba Karimi", "Do Yun Park", "jbschrie@uwaterloo.ca", "s38karim@uwaterloo.ca", "first for minor issues", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "12 & 13", "Complete end-of-term surveys before Dec. 3", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 38, "course_code": "PHYS 121", "course_name": "PHYS121 - Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["An introductory course in physics for students intending to concentrate their future studies in the physical sciences, optometry, or mathematics; includes vectors (dot and cross products), particle kinematics and dynamics, forces in nature, work and energy, conservation of energy and linear momentum, rotational kinematics and dynamics, and conservation of angular momentum.", "Doing Physics - quantities, dimensions, units", "Point Dynamics - force, motion, Newton's laws", "Conservation of Energy - work and energy, conservative systems", "Conservation of linear Momentum - momentum and systems of particles", "Understand the following concepts:", "- Linear kinematics: the relationship between distance, velocity and acceleration.", "- Linear dynamics: a consequence of forces and momentum, and how they interrelate.", "- Kinetic energy, potential energy, work, and their interrelationships.", "We will also re-examine these concepts in a rotating coordinate frame using angular kinematic variables along with torque and angular momentum.", "6 Module 06:  Kinetic and Potential Energy", "7 Module 06:  Kinetic and Potential Energy", "8 Module 07:  Linear Momentum", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- eText + Student Access Code", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- Print Format + Student Access Code"]}, {"course_id": 39, "course_code": "PHYS 121L", "course_name": "PHYS121L - Mechanics Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Mechanics Laboratory Fall 2024", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "Julian Meunier", "Soorna Choheili", "Reza Asadi", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "complete introductory surveys", "complete introductory surveys,", "Complete end-of-term surveys", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 40, "course_code": "PHYS 112", "course_name": "PHYS112 - Physics 2 (0.50)", "term_name": "Required Courses", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:30AM - 11:20AM DC 1350", "S. Idziak", "08:30AM - 09:20AM", "Email: idziak@uwaterloo.ca", "Email: james.forrest@uwaterloo.ca", "A continuation of PHYS111; includes simple harmonic motion, electrostatic force and potential, electric current and power, DC circuits, magnetic field and induction, wave motion, sound, and optics.", "To develop the ability to solve problems in areas related to oscillations and waves, electricity and magnetism, and optics", "Understand physical concepts associated with oscillations, waves, sound, electricity and magnetism, and optics", "Apply concepts of force and energy and recognize when acceleration is not constant", "Solve simple physical systems using physical concepts", "Draw relevant sketches from information given in word problems", "Develop physically relevant equations from information given in word problems", "Convert complex problems into a series of sub-problems and solve", "Topic Textbook Chapters                                                                            Number of lectures", "Electric Forces & Fields (Serway) Chapter 15: 1-5", "Electric Potential & Energy (Serway) Chapter 16", "Current and Resistance (Serway) Chapter 17: 1-6", "Magnetic Flux & Induction   1", "College Physics: A Strategic Approach by Jones, Knight, and Field This was suggested for 111.", "I do not find that these books are great but they are available for no cost.", "Please help to create a welcoming and inclusive environment.", "An exam-like problem will be posted each week on LEARN.", "2 points will be given for each clicker response with an additional 1 point for each correct response.", "What happens if I join the course late:", "Missed a regular assignment:", "Emails can be received 24 hours per day.", "Remember that falsely claiming you are ill can result in academic polices per Policy 71.", "Email communications:", "Notice of Recording"]}, {"course_id": 41, "course_code": "PHYS 112L", "course_name": "PHYS112L - Physics 2 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Sean Dougherty", "Aney Kapadia", "Kayra Erisoglu-Akyildiz", "jbschrie@uwaterloo.ca", "s2doughe@uwaterloo.ca", "Course Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"'", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 3 - Circuits", "Experiment 4 - Circuits", "Experiment 5 - Circuits", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 42, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 43, "course_code": "PHYS 122L", "course_name": "PHYS122L - Waves, Electricity and Magnetism Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 2 - Circuits", "Experiment 5 - Magnetic Fields of a Coil", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 44, "course_code": "CHEM 209", "course_name": "CHEM209 - Introductory Spectroscopy and Structure (0.50)", "term_name": "Approved Courses List", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Introductory Spectroscopy and Structure Fall 2024", "11:30AM - 12:20PM RCH 309", "Email: afkennywilby@uwaterloo.ca", "The nature of electromagnetic radiation and an elementary outline of quantum mechanics in one dimension.", "For each of microwave, infrared, Raman, electronic, photoelectron, and nuclear magnetic resonance spectroscopy, the nature of the molecular energy levels involved and the type of molecular information that can be obtained using it are examined.", "Understand the electromagnetic spectrum and the energies, frequencies and wavelengths that characterize it; understand and apply the wave-particle duality of light and the concept of photons", "Recognize the various types of quantized energy in atomic and molecular systems and know their origins", "Understand basic molecular orbital theory for simple molecules, and the descriptions of symmetry applied to them", "Understand and apply the concepts of spectroscopy as an interaction between light and matter, including the Bohr resonance condition; Interpret atomic spectra in terms of the underlying structure of atoms in modern quantum theory", "Assign, interpret and predict the spectra arising from molecules interacting with electromagnetic radiation ranging from microwaves for molecular rotations, infrared for molecular vibrations, visible-ultraviolet for electronic transitions, to X-rays for photoelectronic transitions from molecular core orbitals", "Introduction to Spectroscopy (4 weeks): The electromagnetic spectrum, photon theory of light, interaction of light and molecules.", "Review of molecular orbital theory and electronic structure.", "Spectroscopy involving those levels.", "Combination of rotation and vibration in diatomics.", "Ionization of core electrons.", "7. Nuclear magnetic resonance (NMR) spectroscopy (1 week): Basic theory and practical applications of NMR for simple molecules.", "An Introduction to Spectroscopy and Quantum Structure, by W. Scott Hopkins (Cambridge Scholars Publishing, 2023) Recommended reading material No", "Physical Chemistry: A Molecular Approach by Donald A. McQuarrie and John D. Simon", "They are mostly meant to keep you follow the material and understand fundamental concepts.", "Homework assignments are a longer and more involving set of problems and will be given after we finish a given course unit (or midway through for longer units).", "If missed, a weighted final exam grade will be used for a mid-term grade."]}, {"course_id": 45, "course_code": "CHEM 310L", "course_name": "CHEM310L - Inorganic Chemistry Laboratory 2 (0.50)", "term_name": "Approved Courses List", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Synthesis of transition and non-transition metal compounds.", "Possess a strong base of fundamental knowledge and practical experience in the area of inorganic chemistry", "Use specific specialized techniques to synthesize a variety of transition metal compounds.", "Characterize various properties of synthesized transition metal compounds using a variety of instruments and techniques.", "Library for research-based assignments"]}, {"course_id": 46, "course_code": "CHEM 313", "course_name": "CHEM313 - Main Group and Solid State Chemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Main Group and Solid State Chemistry Winter 2025", "08:30AM - 09:20AM", "This course provides a detailed examination of the structure and bonding in main group and solid state compounds, including valence bond and molecular orbital theory for describing electronic structures, Hueckel and extended Hueckel approximations.", "Structures of simple solids, including close packing of spheres and derived ionic lattice types; aspects of chemical crystallography, Bravais lattices, point groups, space groups, crystal planes, and X-ray diffraction; Ionic interactions in gases and solution; the thermodynamics of acid-base interactions; descriptive chemistry and characterization of main group element compounds.", "Apply bonding theories to interpret experimentally observed trends in acid-base interactions", "Communicate the basic principles of solid state structures", "Understand X-ray diffraction and its application to structural analysis of solid state materials", "Estimate electronic structure of solids", "3 weeks of solid state symmetry and electronic structure"]}, {"course_id": 47, "course_code": "CHEM 323", "course_name": "CHEM323 - Analytical Instrumentation (0.50)", "term_name": "Approved Courses List", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Analytical Instrumentation Fall 2024", "08:30AM - 09:50AM MC 4041", "Prof. Vassili Karanassios", "Office: C2-277 (often in the labm C2-265)", "Introduction to chemometrics and to computer interfacing.", "To know how to employ spectrochemical insrtumentation for chemical analysis", "Week 08 and Week 09 - CHAPTER 08 - FLAMES, SAMPLE INTRODUCTION & GRAPHITE FURNACE", "Week 10 - ICP-AES & PLASMA MINIATURIZATION", "Week  11 and Week 12 - ICP-MS & MINIATURIZATION IN MASS SPECTROMETRY", "This course includes the independent development and practice of specific skills, such as [chemical analysis].", "Library for research-based assignments"]}, {"course_id": 48, "course_code": "CHEM 350L", "course_name": "CHEM350L - Physical Chemistry Laboratory 2 (0.50)", "term_name": "Approved Courses List", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["jake.fisher@uwaterloo.ca", "jake.fisher@uwaterloo.ca", "E-mail:   jake.fisher@uwaterloo.ca", "This advanced laboratory builds upon fundamental knowledge of physical chemistry gained in the introductory physical chemistry laboratory, CHEM250L. The experiments are designed to illustrate the principles and theories of thermodynamics, kinetics, spectroscopy, and quantum mechanics.", "CHEM 350L is an subsequent physical chemistry laboratory following the introductory physical chemistry laboratory, CHEM 250L.", "The student will be introduced to techniques and instruments used in modern chemical research.", "CHEM 350L consists of a series of experiments designed to illustrate the concepts and theories of thermodynamics, kinetics, spectroscopy and quantum mechanics.", "To provide the fundamental knowledge and practical experience in the area of physical chemistry.", "To gain an appreciation and understanding of the more complex problems", "A", "B", "C", "D", "E", "F", "I", "A", "B", "C", "D", "E", "F", "I", "A", "B", "C", "D", "E", "F", "I", "A", "B", "C", "D", "I", "A", "B", "C", "D", "E", "F", "I", "A", "B", "E", "F", "I", "A", "B", "C", "D", "E", "F", "I", "C", "D", "E", "F", "I", "A", "B", "C", "D", "E", "F", "Please refer to the Introduction section of the CHEM 350L Laboratory Manual for details.", "Email a scanned copy of the VIF to the laboratory instructor.", "Supporting documentation will be considered on a case by case basis.", "Equations should be created using the Equation Editor found in MS-Word or a comparable equation editor.", "Re-grading Reports:  If there a concern related as to how a lab report was graded, the student should first consult the teaching assistant responsible for marking the report.", "If a resolution between the student and teaching assistant cannot be found, the laboratory instructor will re-grade the entire report."]}, {"course_id": 49, "course_code": "CHEM 356", "course_name": "CHEM356 - Introductory Quantum Mechanics (0.50)", "term_name": "Approved Courses List", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Introductory Quantum Mechanics Fall 2024", "Historical background; the differential equation approach to quantum mechanics; treatments of solvable problems such as the particle-in-a-box, harmonic oscillator, rigid rotator and the hydrogen atom; introduction to approximation methods for more complicated systems.", "This theoretical framework will lead us to understand deeply some very basic concepts in chemistry and physics.", "In this course we will focus on model problems that can be solved with 'relatively little' effort and which illustrate the nature of the quantum world and will introduce you to thinking 'quantum'.", "Moreover these simple models often lead to surprisingly quantitative understanding of observed excitations of atoms, molecules and materials.", "A major theme concerns the electronic structure of atoms and simple molecules.", "Operator techniques will be introduced as a powerful tool to solve a variety of problems in an elegant and uniform manner.", "It contains short summaries (Mathchapters) of mathematical methods that can serve as either brief reviews of or introductions to the material.", "Problems and Solutions for McQuarrie's Quantum Chemistry,", "A free pdf of the McQuarrie book is available here", "Understand the essential formulation of quantum mechanics: States, Superpositions, Eigenstates, Operators, Probabilities.", "Understand (at a basic level)", "History: Relativity, Planck’s radiation law, Einstein Photo-electric effect,", "Time-dependent Schrödinger equation and Ehrenfest theorem.", "Variational principle and basis set expansions, matrix formulations quantum mechanics.", "Problems and Solutions for McQuarrie's Quantum Chemistry,ISBN 9781891389528 This is a solution manual for problems in McQuarrie No", "In particular we will discuss the postulates of quantum mechanics and their 'ensemble Interpretation'.", "There will also be a handout discussing the most basic H atom, using angular momentum theory in operator form.", "I plan to introduce a section on quantum computing.", "TBA"]}, {"course_id": 50, "course_code": "CHEM 357", "course_name": "CHEM357 - Physical Biochemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Physical Biochemistry Winter 2025", "10:30AM - 11:20AM RCH 307", "B. Power", "Instructor: Bill Power", "The use of diffusion, ultracentrifugation, osmotic pressure, electrophoresis and X-ray diffraction to study the properties of biopolymers.", "This course is meant to provide you with a basic introduction to physical chemistry as applied to the life sciences with emphasis on applications in biochemistry.", "This course will cover the basics of thermodynamics and their applications to biological molecules and systems, their transport properties, chemical and enzyme kinetics, and physical techniques used to establish and investigate the structures of biological macromolecules.", "I will aim to provide you with all the background necessary to cover the many topics in this course, from entropy and thermodynamic principles from the 18th century to modern applications such as AI which resulted in half of the the 2024 Nobel Prize in Chemistry going to Google's DeepMind leaders Demis Hassabis and John Jumper for their development of AlphaFold, a protein structure database (of 220 million structures!).", "In return you should have some familiarity with the basics of biochemistry and biological structures and terminology, as well as some comfort working with derivatives, including partial derivatives, integrals and differential equations.", "Understand the four laws of thermodynamics and their applications to biological systems", "Understand the importance of Gibbs free energy and chemical potential in describing physical and chemistry transformations", "Understand the basics of chemical kinetics and rate laws and mechanisms", "Be able to characterize enzyme kinetics using the Michaelis-Menten description and describe competition and inhibition in such mechanisms", "Know how to apply and interpret structural tools such as optical and NMR spectroscopy, X-ray diffraction and computational tools to biological macromolecules", "There will be online and in-class assignments, on a rotating interval of about two weeks.", "It will occur in a 2.5 hour time slot sometime between April 9 and April 25 (I have no control over this scheduling).", "Weeks 1 to 3:   Thermodynamics, its Laws and its Applications", "Week 10:            Biomolecular Structure; Optical Spectroscopy", "Weeks 11 to 12: NMR Spectroscopy; X-ray Diffraction; AI Methods and AlphaFold", "We will cover much of this book, though perhaps not in detail in some sections, and it should be a useful resource.", "I will have a copy on reserve in the library (https://www.reserves.uwaterloo.ca/ares/ares.dll?Action=10&Form=50&Value=222107) and the price listed here is for a one-year electronic subscription (https://www.pearson.com/en-ca/subject-catalog/p/physical-chemistry-principles-and-applications-in-biological-sciences/P200000006771/9780137612826).", "This course includes the independent development and practice of specific skills, such as problem solving in a chemical and scientific context.", "Library for research-based assignments"]}, {"course_id": 51, "course_code": "CHEM 363", "course_name": "CHEM363 - Organic Process Chemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["09:30AM - 10:20AM B2 350", "Determine what in-process assays and controls are necessary to regulate runaway reactions and minimizing impurities", "Introduction to process chemistry", "Safety", "Safety", "Safety", "Route selection", "Route selection", "Route selection", "Effects of Water", "In process controls", "Practical considerations for scale", "Continuous operations", "I have used the textbook as a guideline on what topics to teach and have used some of the examples given in the textbook.", "I'll form these groups and post them on LEARN after the first week of class.", "After researching multiple production processes, you'll write a paper that provides an overview of these methods and critically assesses their pros and cons based on the criteria and concepts covered in this course.", "Then, as a group, you'll compare and contrast these methods, ultimately recommending the most suitable option for scaled-up production."]}, {"course_id": 52, "course_code": "CHEM 370", "course_name": "CHEM370 - Introduction to Polymer Science (0.50)", "term_name": "Approved Courses List", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Introduction to Polymer Science Fall 2024", "10:00AM - 11:20AM EIT 2053", "Basic definitions and polymer nomenclature, molecular weight distributions and averages, molecular weight measurements, step-growth and free radical chain-growth polymerization reactions, chain conformations, glass transition, crystallization, and mechanical properties of polymers.", "Understand the models and measurement of polymer chain dimensions.", "Know the general techniques to characterize polymer molecular weight and understand their principles.", "Remember the nature of step-growth polymerization and analyze the kinetics", "Differentiate chain-growth and step-growth polymerization and their kinetics", "Understand the key feature of controlled radical polymerization", "Know basic characterization methods and terms for polymer mechanical properties", "The whole course includes seven chapters, and each chapter will have a correlating assignment after it is completed.", "Introduction to Polymers (Third Edition) Robert J. Young and Peter A. Lovell No"]}, {"course_id": 53, "course_code": "CHEM 400", "course_name": "CHEM400 - Special Topics in Chemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Special Topics in Chemistry Winter 2025", "A selection of current and advanced topics of interests in many areas of chemistry.", "\"Quantum Mechanics in Chemistry\" is the title for this section of Chem400", "In the Winter 2025 term the focus of the course will be electronic structure theory and a smaller segment on coupled electron-nuclear motion, developing theory beyond the Born Oppenheimer approximation.", "The course will cover a description of the basic electronic structure problem introducing an atomic orbital basis set, Slater determinants and the Slater-Condon rules.", "In another segment we will discuss vibronic coupling, introducing diabatic electronic states and simple model problems and introduce techniques to solve them using simple Python programs.", "Have a good understanding of the electronic structure problem in Chemistry and how it connects to thermochemistry.", "Have an in depth understanding of the Hartree-Fock method and the basic Hartree-Fock algorithm.", "Be able to construct Hamiltonian matrix for small problems using Slater-Condon rules", "Have introductory knowledge of Coupled Cluster methods for ground and excited states, and the concept of size-consistency.", "Have introductory understanding of non-adiabatic nuclear dynamics going beyond the Born-Oppenheimer approximation.", "Week 1,2: General introduction to quantum mechanics and the main uses in chemistry / thermochemistry.", "Discussion of fundamental principles of Density Functional Theory.", "Extension to multiple electronic surfaces.", "Vibronic models beyond Born-Oppenheimer.", "Notice of Recording", "Since assignments are at the core of the assessment for the class, I want everybody to do all of these assignments.", "Students can contact the instructor."]}, {"course_id": 54, "course_code": "CHEM 404", "course_name": "CHEM404 - Physicochemical Aspects of Natural Waters (0.50)", "term_name": "Approved Courses List", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Physicochemical Aspects of Natural Waters Fall 2024", "This will be followed by a review of fundamental thermodynamic concepts, including chemical potential, Gibbs free energy, thermodynamic equilibrium, enthalpy and entropy.", "Carbon dioxide equilibria in natural waters will then be briefly discussed.", "understand the complex processes determining the fate of pollutants in natural waters", "predict the fate of chemicals in natural waters based on their physicochemical properties", "Acids and bases in water", "Sorption", "Diffusion", "Stumm and Morgan, J. Wiley & Sons, Inc. (GB 855.S78 1996) Supplementary reading No", "Each student will be required to present a critical summary of an original research paper published in current scientific literature (please note that no review papers will be allowed)."]}, {"course_id": 55, "course_code": "CHEM 430", "course_name": "CHEM430 - Special Topics in Biochemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Special Topics in Biochemistry Winter 2025", "08:30AM - 09:20AM", "RCH 204", "D. Sychantha", "Discussion of specialized topics related to the research interests of the members of the Centre.", "For example, recent offerings have included: Metalloproteins and Metalloenzymes; Heme Proteins; Chemistry of Enzymatic Reaction Mechanisms; Peptides - Synthesis, Structure and Function; Food Enzymology; Advanced Microbial Physicology; NMR in Biological Systems.", "Antibiotics play essential roles in all branches of healthcare, and the emergence and spread of antibiotic-resistant bacteria pose a significant risk to public health.", "It will also explore the complexities of antimicrobial resistance mechanisms and practical approaches to overcome them.", "The chemical characteristics of antibiotics", "The biological interactions of antibiotics with bacteria and humans", "The mode of action of major antibiotic classes", "Methods for antitbioc discovery"]}, {"course_id": 56, "course_code": "CHEM 432", "course_name": "CHEM432 - Metabolism 2 (0.50)", "term_name": "Approved Courses List", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "11:30AM - 12:20PM", "RCH 211", "Dara Gilbert", "Biosynthesis and mode of action of selected cofactors.", "Structure-function relationships of enzymes.", "THF and vitamin B12 reactions", "Changes to these and other pathways in cancer", "engineering these pathways in microorganisms to produce useful chemicals", "For each of these topics we will cover the chemistry and enzymes of each step in the pathway.", "How the inhibition of some of the enzymes involved can that human diseases such and autoimmune disorders and cancer.", "to learn the chemistry of the steps in the pathways covered", "to understand the chemical \"logic\" of these steps", "to be able to interpret data and even propose experiments to exploit the pathways to treat diseases and synthesize useful compounds", "develop skills for working in groups", "Biochemistry 4th edition Voet and Voet", "Fundamentals of Biochemistry: Life at the molecular level by Voet, Voet and Pratt", "mock OGS proposal 40", "participation in class discussion includes pop quizzes 10", "Notice of Recording", "Oral presentations will be recorded so that I can mark them.", "you must completely rewrite source material in your own words.", "quotations marks around large sections of text do not make it okay"]}, {"course_id": 57, "course_code": "CHEM 433", "course_name": "CHEM433 - Advanced Biochemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Advanced Biochemistry Winter 2025", "08:30AM - 09:50AM MC 4041", "Department of Chemistry", "Biochemistry of nitric oxide.", "Lectures will also include class discussion of journal articles covering problems in biochemistry related to topics in this course.", "Understand the major nitrogen and ammonia assimilation pathways in nature", "Understand the major catabolic and biosynthetic pathways for the amino acids", "Be able to draw the chemical structures of the intermediates in these pathways", "Be able to draw and explain the chemical mechanisms of the enzymes involved in these metabolic pathways", "Ammonia Assimilation", "a.  glutamine synthetase", "Glutamate Family of Amino Acids", "Aspartate Family of Amino Acids", "Aromatic Amino Acids", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 58, "course_code": "CHEM 481", "course_name": "CHEM481 - Rational Design of Potential Drug Candidates (0.50)", "term_name": "Approved Courses List", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Rational Design of Potential Drug Candidates Fall 2024", "S. Kalyaanamoorthy", "subha.kalyaanamoorthy@uwaterloo.ca", "Instructor: Dr. Subha Kalyaanamoorthy", "This course provides an introduction to strategies for design of potential drug candidates.", "It builds upon molecular modelling principles introduced in CHEM340 and will apply them to specific problems in drug design.", "Topics include conformational analysis, molecular mechanics, and molecular dynamics; computational studies of drug-receptor interactions, docking of small organic molecules to biological receptors, and alteration of molecular structures for improvement of bioactivity.", "Understand the drug discovery cycle, and different concepts in drug discovery", "Learn about different computational drug discovery methods and their usage and applications", "Gain hands-on experience on different software programs that can be used for drug discovery applications", "Learn the basics of programming using Unix-based commands and TCL scripts", "Learn to perform basic molecular modelling, structure visualization, biomolecular interaction analyses, molecular simulations and their applications to drug discovery", "Notice of Recording"]}, {"course_id": 0, "course_code": "MATH 117", "course_name": "MATH117 - Calculus 1 for Engineering (0.50)", "term_name": "1A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Monday, Friday -", "11:30AM - 12:20PM E7 5353", "S. D'Alessio", "Friday -", "Friday", "04:30PM - 05:20PM E7 4053", "03:30PM - 04:20PM E7 5353", "Friday -", "Friday", "04:30PM - 05:20PM", "03:30PM - 04:20PM E7 5343", "02:30PM - 03:20PM", "08:30AM - 09:20AM", "S. D'Alessio", "09:30AM - 10:20AM STC 0060", "S. D'Alessio", "03:30PM - 04:20PM", "02:30PM - 04:20PM QNC 1506", "DWE 3522A", "DWE 3517", "08:30AM - 10:20AM DWE 1515", "08:30AM - 10:20AM DWE 3522A", "08:30AM - 10:20AM QNC 1506", "10:30AM - 12:20PM DWE 3522A", "10:30AM - 12:20PM MC 4058", "10:30AM -", "Functions of engineering importance; review of polynomial, exponential, and logarithmic functions; trigonometric functions and identities.", "Inverse functions (logarithmic and trigonometric).", "Limits and continuity.", "Applications of the derivative, max-min problems, Mean Value Theorem.", "Demonstrate skill in manipulating functions and performing calculations such as partial fraction decompositions and expressing piecewise defined functions in terms of Heaviside functions", "Read and use mathematical definitions", "Demonstrate skill in evaluation of limits, derivatives and integrals", "Use integration to calculate areas between and lengths of curves, find average values of functions, and calculating volumes of solids of revolution", "Sketch curves described in polar coordinates", "Use limits and derivatives to sketch graphs of functions or solve optimization problems", "Use integration to calculate areas enclosed by segments of curves in polar coordinates, and lengths of such curve segments", "Conic Sections", "Composition of Functions, Inverses and Symmetry", "Piecewise-Defined and Heaviside Functions", "Inequalities", "Partial Fractions", "Trigonometric, Hyperbolic and Inverse Trig Functions", "Sequences", "Limits and Proving Limits", "Continuity", "IVT/EVT", "Differentiation Rules, Implicit / Logarithmic Differentiation, Derivatives on Inverse Functions", "MVT, Constant/Increasing/Decreasing Functions", "Week 7: October 14 - 18 No classes and no tutorials   Thanksgiving & Reading Week", "Local/Global Extreme & Optimization Problems", "Curve Sketching", "The Definite Integral", "FTC1 & FTC2", "Indefinite Integrals", "Method of Substitution", "Integration by Parts (IBP)", "Areas between Curves, Average Values", "Trig Substitutions", "Integration of Rational Functions", "Arc Length, Surface Area and Volume of Revolution", "Improper Integrals", "Polar Coordinates, Areas and Arc Length in Polar Coordinates", "If working in a group, each group member must write and submit their own solutions in their own words.", "Exams", "Notice of Recording"]}, {"course_id": 1, "course_code": "NE 100", "course_name": "NE100 - Introduction to Nanotechnology Engineering (0.50)", "term_name": "1A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Nanotechnology Engineering Fall 2024", "10:30AM - 11:20AM STC 0040", "r2fazaeli@uwaterloo.ca", "An introduction to nanotechnology engineering and its various applications from electronics to biology.", "Basic concepts related to nanomaterials and devices, fabrication approaches, and characterization methods.", "Introduction to engineering iterative design, computer aided design (CAD) and modelling.", "Application of CAD methods in relevant nanotechnology engineering problems.", "Design a 3D object using CAD", "Define the characteristics of individual work and an effective team", "Calculate basic statistics by hand and using a spreadsheet", "Design a process/integration to fabricate a given nanostructured component (via etching, lithography,polishing, thin-film deposition)", "Describe basic material science concepts using correct engineering terminology", "Introduction to nanotechnology and nanoscience", "Basic statistics", "Basic material concepts", "Small-scale fabrication techniques", "Bottom-up versus top-down processes and manufacturing", "Characterization techniques and concepts", "Introduction to Engineering Design", "Design constraints: costs; safety; sustainability, manufacturability; etc.", "Technical communication", "NE threads and buckets;", "Introduction to Materials Sciencefor Engineers, J.F. Shackelford,Pearson, (9th Edition).", "Engineering Design and Graphicswith SolidWorks, 2016, D. Bethune,Peachpit Press.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 2, "course_code": "NE 109", "course_name": "NE109 - Societal and Environmental Impacts of Nanotechnology (0.50)", "term_name": "1A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Societal and Environmental Impacts of Nanotechnology Fall 2024", "09:30AM - 10:20AM RCH 302", "09:30AM - 10:20AM STC 0040", "02:30PM - 03:20PM", "Howard Siu", "Nanotechnology in society; health and environmental sustainability; introduction to environmental life cycle assessments; engineering ethics, policies, and regulations; Canadian legal system, tort, and intellectual property; examples of nanotechnology innovation and commercialization.", "An introduction to the field of nanotechnology and its ability to impact society and affect sustainability.", "How utilization of nanotechnology has simultaneously improved societal standards of living and introduced new ethical, health, and environmental concerns will be examined.", "Topics covered will include: the history of changing perceptions of and attention devoted to developments in nanotechnology; special health and environmental concerns associated with nanomaterials; the development and means of implementation of regulations to deal with the use of nanomaterials; ethical issues associated with nanotechnology and its applications.", "Relevant case studies will be presented and discussed.", "Analyze case study problems from regulatory, ethical, and legal perspectives", "Be familiar with the concepts of intellectual property and, more specifically, the patenting process", "Impact on the Environment: Forms of man-made pollution, their effects upon the environment, and standard methods of waste-water treatment.", "Applications of nanotechnology in medicine will also be examined.", "Regulating Nanotechnology:  An examination of the purpose of regulations, including the concepts of life-cycle analyses, environmental management systems, risk assessment, cost-benefit analyses, and the precautionary principle.", "Science & Technology and Politics: A quick introduction on how government policies can influence the development of science and technology.", "Ethics: Types of ethics, ethics pertaining specifically to professional engineering and science, as illustrated through a number of case studies.", "Tort Law: Canadian legal system, criteria for a tort, potential nanotechnology torts in the near future, and examination of several case studies.", "Intellectual Property: Types of intellectual property, application for patents in Canada, potential concerns facing patent applications for nano-enabled inventions.", "Business Structure: Pros and cons of sole ownership, partnership, incorporation.", "Top Hat may require a paid subscription, and a full breakdown of all subscription options available can be found here: www.tophat.com/pricing.", "This course includes the independent development and practice of specific skills, such as sustainability impact analysis.", "Library for research-based assignments"]}, {"course_id": 3, "course_code": "NE 111", "course_name": "NE111 - Introduction to Programming for Engineers (0.25)", "term_name": "1A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Programming for Engineers Fall 2024", "email jgostick@uwaterloo.ca", "Email", "Amaan Fathima", "Arshia Fazeli", "Casey Dudding", "Th 16:30-17:30 in QNC 5324", "Email bardia.kamali@uwaterloo.ca", "Office E2-1719", "Introduction to programming and numerical computing using a high-level interpreted programming language.", "use the syntax and features of Python", "appreciate the role of the underlying computer hardware on the performance of a computer program", "use functions to create “code” that is concise, organized and readable", "control the order of execution of a program using relational operators and conditional statements", "store and retrieve data from Python’s various data containers such as lists", "use for-loops to scan data stored in various containers and perform calculations as needed", "develop multistep numerical calculations to compute results, such as scientific calculations", "use state-of-the-art libraries to extend Python’s capabilities to scientific calculations", "visualize data using a variety of graph styles", "read and write data from memory", "Week 3 Logic and Flow Control: Introduction to Boolean logic; use of relational operators; applying logic to collections; controlling execution.", "Week 4 Working with Text: Deep dive into strings; converting and formatting strings; performing operations on strings.", "Week 5 Files and IO: Introduction to the file system; reading and writing files; installing external libraries; introduction to version control.", "Week 8 Writing Pythonic Code Crafting advanced functions; documenting functions; dealing with error conditions; using collections fully; mastering comprehensions; mastering for-loops.", "Week 8b Creating Data Dashboards: Using Streamlit to create graphical user interfaces.", "Week 10 Numerical Computing with Numpy Part 2: Multidimensional arrays; fancy indexing; applications in linear algebra.", "Week 12 Introduction to Object Oriented Programming: An introduction to OOP principles; classes; inheritance; data encapsulation.", "Practical Programming: An Introduction to Computer Science Using Python 3.6 by Gries, Campbell, and Montojo This book is available electronically free of charge No", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 4, "course_code": "NE 112", "course_name": "NE112 - Linear Algebra for Nanotechnology Engineers (0.50)", "term_name": "1A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Linear Algebra for Nanotechnology Engineers Fall 2024", "09:30AM - 10:20AM STC 0040", "08:30AM - 09:20AM", "Solution of linear equations: elimination and iterative methods.", "Eigenvalues and eigenvectors with engineering applications.", "Prerequisite knowledge: Secondary school mathematics, including real numbers, 2d- and 3d-vectors, the Euclidean norm, dot products and right angles between vectors, matrices, solving systems of linear equations, functions, polynomials, differentiation, sets, set membership, intersection and union.", "Describe real and complex vector spaces, both finite and infinite-dimensional.", "Understand linear independence and bases.", "Solve a system of linear equations, considering the concept of numerical instabilities.", "Describe the concept of a singular-value decomposition.", "Also, the Department of Electrical and Computer Engineering cancels classes during mid-term week and, instead, offers make-up lectures.", "Introduction to axioms and complex numbers.", "Geometric series, real n-dimensional vectors, the zero vector, geometric interpretations, equality, 2-d vectors vs complex complex n-dimensional vectors and scalar multiplication and vector addition.", "Properties of vector spaces, linear combination of vectors, other vector spaces, subspaces, normed vector spaces and inner product spaces.", "Inner products on other vector spaces, orthogonality, the Pythagorean theorem, projections, the Cauchy-Bunyakovsky-Schwarz inequality, the Gram-Schmidt algorithm, and finding solutions to systems of linear equations.", "A systematic approach to solving systems of linear equations, matrices, augmented matrices, zero rows, leading zeros, leading non-zero entries, row-echelon form, and backward substitution.", "Row operations, Gaussian elimination with partial pivoting, solutions to homogeneous systems of linear equations, linear dependence and independence of vectors.", "Spans and subspaces, bases and dimension, introduction to linear maps and linear operators, the superposition principle, special linear maps and linear operators, the range and null space of a linear map, and the vector space of linear maps.", "The composition of linear maps, linear operators, row operations as linear operators, the determinant, trace and inverse, and matrices of orthonormal vectors and their inverses.", "Introduction to matrix decompositions, the PLU decomposition, the adjoint of a linear map, its properties, the transpose, the conjugate transpose, self-adjoint and skew-adjoint linear operators, normal operators, isometric operators, and linear regression and least squares.", "An introduction to linear algebra for nanotechnology engineering with applications in Matlab https://ece.uwaterloo.ca/~ne112/Lecture_materials/An%20introduction%20to%20linear%20algebra%20for%20undergraduate%20engineering%20with%20applications%20in%20Matlab.pdf Yes", "Notice of Recording", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca.", "Intellectual property includes items such as:"]}, {"course_id": 5, "course_code": "NE 121", "course_name": "NE121 - Chemical Principles (0.50)", "term_name": "1A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "10:30AM - 11:20AM RCH 302", "09:30AM - 10:20AM STC 0040", "Email: x335wang@uwaterloo.ca", "ONC 3619", "Introduction to the first, second, and third laws of thermodynamics.", "Applications of chemical equilibrium principles to proton-transfer reactions.", "Electronic structure of atoms and molecules.", "Electronic structure of atoms and molecules.", "Introduction to the first, second, and third laws of thermodynamics.", "Applications of chemical equilibrium principles to proton-transfer and electron transfer reactions.", "- Apply stoichiometric principles to quantify the amounts of reactants and products consumed or produced by a chemical reaction,", "- Describe H-atom electron orbitals and their quantum numbers, and be able to draw electron configuration for atoms in periodic table,", "-Understand the principles of analytic techniques based on the properties of nucleons and electrons,", "- Draw structures of molecules and predict the three-dimensional shape and bond angles,", "- Apply understanding of thermodynamics to calculate equilibrium constants, be able to use them to calculate concentrations at equilibrium and understand how they are related to rate constants.", "----Periodicity, mass balance for chemical reactions, analytic techniques based on nucleon and nuclear reactions", "---Electron orbitals, quantum effects, configuration, electron-related properties for atoms, analytic techniques based on electrons.", "---Intermolecular interactions and Ideal gas leading to the concept of energy (then quiz 2),", "---The first law for thermodynamics leading to concept of enthalpy,", "---Chemical kinetics, equilibriums and energy analysis of chemical reactions.", "Notice of Recording"]}, {"course_id": 6, "course_code": "MATH 119", "course_name": "MATH119 - Calculus 2 for Engineering (0.50)", "term_name": "1B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "02:30PM - 03:20PM", "S. D'Alessio", "03:30PM - 04:20PM E7 5343", "09:30AM - 10:20AM STC 0040", "S. D'Alessio", "11:30AM - 12:20PM RCH 302", "08:30AM - 09:20AM", "S. D'Alessio", "04:30PM - 05:20PM", "Tuesday -", "08:30AM - 10:20AM DWE 1515", "08:30AM - 10:20AM QNC 1506", "08:30AM - 10:20AM DWE 3522A", "02:30PM - 04:20PM MC 4060", "02:30PM - 04:20PM QNC 1506", "02:30PM - 04:20PM QNC 1506", "02:30PM - 04:20PM QNC 1506", "Functions of several variables: partial derivatives, linear approximation and differential, gradient and directional derivative, optimization and Lagrange multipliers.", "Vector-valued functions: parametric representation of curves, tangent and normal vectors, line integrals and applications.", "Calculate derivatives of multivariate functions (including use of the general chain rule)", "Find maxima and minima of functions of two variables, with or without constraints", "Calculate integrals of multivariate functions over a variety of domains (the focus will be on two-variable problems)", "Estimate roots of functions using Newton’s Method", "Estimate values of integrals using Taylor Polynomials and Taylor’s Inequality", "Calculate Taylor Series efficiently for a variety of functions", "Test the convergence of infinite series", "Evaluate limits using Taylor Series", "Multivariable Functions, Level Curves,", "Contour Plots, Partial Derivatives", "Linear Approximation and Differentials,", "Parametric Equations,", "Optimization", "in Cartesian Coordinates", "Double Integrals in Polar Coordinates,", "Inequality", "Manipulating Power Series, Applications", "If working in a group, each group member must write and submit their own solutions in their own words.", "Exams", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 7, "course_code": "NE 110", "course_name": "NE110 - Introduction to Nanomaterials Health Risks (0.50)", "term_name": "1B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Introduction to Nanomaterials Health Risks Winter 2025", "11:30AM - 12:20PM STC 0020", "04:30PM - 05:20PM", "E-mail:                  ch2siu@uwaterloo.ca", "Environmental chemical impacts, transport, and bio-accumulation.", "Introduction to UN Sustainable Development Goals.", "Students will assemble these ideas and examine the role of nanotechnology in sustainable development.", "- Understand the fundamentals of toxicology and epidemiological study design", "- Understand what governs the distribution of chemicals in the environment and the risks of bioaccumulation", "- Understand chemical risk assessment and the process needed to evaluate worker and public safety", "- Be able to describe the role of nanotechnology engineering in sustainable development", "Impact of engineering on society and the environment: An ability to analyze social and environmental aspects of engineering activities.", "Such ability includes an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society, the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "- Hazard identification", "- Introduction to Toxicology", "How do carbon nanotubes and asbestos compare?  - Introduction to Nanotoxicology", "What are effects due to inhaled chemicals?  - Inhalation risks", "Are nanomaterials in foods or in skin products safe?", "- Ingestions and Dermal risks", "How can you know that something causes cancer?", "- Carcinogenicity", "Roundup© case-study - how to pull data together", "Arsenic case-study - Carcinogenicity and Mutagenicity", "- Bioaccumulation", "Don't we know enough to stop chemical disasters?", "- Case studies", "- UN SDGs", "Can Nanotechnology engineering impact sustainability?", "- Nanotechnology case studies", "Are people sicker in Canada?", "- Epidemiological studies", "- Confounders and Bias", "- Cohorts study designs", "- Causal Inference", "Case-study : Bromopropane - Exposure limits", "How can you communicate science to a general audience?", "- Clinical Trials", "How you can know if a test is likely to be wrong?", "Sensor sensitivity and specificity", "- Sensor Predictive Values", "Nanomaterials - how to characterize these materials", "Nano sensors - Examples", "Save the World Pitch:", "Students will be placed into groups and will prepare a slide and ~3min pitch.", "Submissions with a high degree of similarity will be brought to the Associate Dean for resolution.", "Know how to paraphrase work into your own words - A plagiarism offence can place you on disciplinary probation:", "(2022), APA style is an easy citation format for first-time learners.", "APA style is an easy citation format for first-time learners.", "What do you put in a References section?", "Alphabetical list of all authors.", "Do you include other general sources that are not specifically linked to a citation in the text?", "ASK before submitting!", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 8, "course_code": "NE 113", "course_name": "NE113 - Introduction to Computational Methods (0.50)", "term_name": "1B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Computational Methods Winter 2025", "04:30PM - 05:20PM", "Problem solution plotting, and creating complex programs in an engineering prototypical programming environment.", "Elementary numerical methods: Taylor-series summations, roots of equations, roots of polynomials, direct and indirect solution methods for systems of linear, and nonlinear algebraic equations, integration.", "Applications in nanotechnology engineering.", "Understand fundamental programming concepts and effectively apply them to solving engineering problems of interest.", "Be able to design and implement simple computer scripts in Matlab.", "Have a sound understanding of basic numerical techniques for solving nonlinear equations, systems of linear equations, and performing numerical integration.", "Introduction to Engineering Computation", "Linear Algebraic equations, GE", "Roots of equations", "Solving linear equations, iterative methods", "Solving non-linear equations", "Numerical Integration", "Curve fitting", "Steven Chapra, Applied Numerical Methods with MATLAB for Engineers & Scientists, 4th Ed., McGraw Hill (2018).", "Steven Chapra, Numerical Methods for engineers Seventh Edition, McGraw Hill No", "This course includes the independent development and practice of programming skills that cannot be replaced by generative AI (GenAI).", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 9, "course_code": "NE 125", "course_name": "NE125 - Introduction to Materials Science and Engineering (0.50)", "term_name": "1B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Materials Science and Engineering Winter 2025", "NE 125", "10:30AM - 11:20AM STC 0020", "11:30AM - 12:20PM STC 0020", "04:30PM - 05:20PM", "08:30AM - 10:20AM", "08:30AM - 09:20AM QNC 1506", "08:30AM - 09:20AM QNC 1506", "Prof. Aiping Yu", "Processing and concepts of engineering design of materials.", "View requirements for NE 125", "1-  Materials for Engineering", "2- Atomic Bonding", "3-", "4- Diffusion", "5- Mechanical Behavior", "6- Thermal Behavior", "13- Electronic Materials", "Preparation for exams:", "The following link shows the Engineering supplies:"]}, {"course_id": 10, "course_code": "NE 131", "course_name": "NE131 - Physics for Nanotechnology Engineering (0.50)", "term_name": "1B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Physics for Nanotechnology Engineering Winter 2025", "04:30PM - 05:20PM", "10:30AM - 11:20AM STC 0020", "10:30AM - 11:20AM STC 0020", "08:30AM - 09:20AM", "DWE 3522A", "08:30AM - 09:20AM", "DWE 3522A", "A first course in physics that introduces basic topics in classical mechanics, wave mechanics, and physical optics.", "Interpret a physical system using the principles of classical mechanics", "Describe the dynamics of objects by performing calculations using classical mechanics", "Identify and solve appropriate equations for waves and sound", "Describe optical properties based on propagation and interference/diffraction", "Describe the object/image relationship in various lens and mirror systems with appropriate equations", "Motion along a straight line", "Vectors", "Motion in two and three dimensions", "Forces and motion I and II", "Kinetic energy and work", "Potential energy and conservation of energy", "Center of mass and linear momentum", "Rotation", "Equilibrium and elasticity", "Oscillation", "Waves I", "Electromagnetic waves", "Images", "Interference", "Diffraction", "Apr 9: Final examination period begins", "May 20: Standing decisions and official grades available in Quest", "Note: You do not need to purchase a code if you already did so in the Fall.", "Access instructions are provided on LEARN, as well as code redemption instructions to use after the grace period expires.", "Important - Only concepts and material covered in the slides will be included in the assignments and exams.", "There are 9 weekly assignments, except for during reading week and midterm week.", "Be mindful of the well-being of your classmates.", "Also look at https://uwaterloo.ca/engineering/undergraduate-students/academic support/illness-and-circumstances", "All the academic regulations and support information related to the first year are available at https://uwaterloo.ca/engineering/undergraduate students/first-year", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline).", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 11, "course_code": "NE 140", "course_name": "NE140 - Linear Circuits (0.50)", "term_name": "1B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Linear Circuits Winter 2025", "Monday, Friday -", "04:30PM - 05:20PM", "10:30AM - 11:20AM STC 0020", "Friday -", "Friday", "08:30AM - 10:20AM", "E-mail", "QNC 2609/ Microsoft Teams", "Duty", "E-mail", "Microsoft Teams", "Capacitance, inductance, electrical energy dissipation, and first-order transient response circuits.", "Introduction to the fundamentals of electronic waste recycling.", "Identify the fundamental tools of linear circuit analysis that will be useful to all engineers (learning the “alphabet” of circuits),", "Apply basic laws: Ohms law, KVL, KCL and power calculations,", "Examine circuits containing energy storage elements,", "Determine transient and steady state responses of first order circuits,", "Examine phasor frequency domain analysis,", "Analyze and design different circuits using ideal op-amps,", "Identify and design different types of filters.", "State and understand the fundamental issues underlying e-waste recycling.", "F", "X", "April", "Basic analysis of linear circuit theory: Voltage and current; Passive sign convention; Ohm's law; Kirchhoff's laws", "Nodal and Mesh analysis of resistive circuits", "Transient response for first-order circuits.", "Operational Amplifiers circuit configuration.", "Frequency filters circuit configuration.", "Introduction to the fundamentals of electronic waste recycling.", "Title: 180 Day e-text for Electric Circuits 12th ed", "Author: AC Nilsson & Riedel", "Price:  $77.99 To order the access code and receive it instantly, please follow the first link below.", "https://uwaterloo-store.vitalsource.com/products/electric-circuits-subscription-james-w-nilsson-susan-riedel-v9780137648368", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 12, "course_code": "NE 215", "course_name": "NE215 - Probability and Statistics (0.50)", "term_name": "2A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Probability and Statistics Fall 2024", "04:00PM - 05:20PM", "This course introduces statistical methods for analyzing and interpreting process data.", "Basic statistical", "design and statistical quality control.", "Define the role of statistics in engineering problem-solving and decision-making", "Apply statistically rigorous methodologies of data collection and treatment", "Assess for significance, independence, sample size and other common statistical measures using appropriate testing methodologies", "Perform industry-standard quality and control assessments of process data", "Module & Chapter Topics", "Introduction to NE 215", "1: Statistics in Engineering", "ical, and probabilistic models", "7–9 3: Statistical Parameters", "Ch. 11.1–11.7 Least-squares method, Simple linear regression and test-", "ing, Multiple linear regression", "Ch. 15 Set limits and control limits, Common industrial mea-", "Probability & Statistics for Engineers, 9th Edition, R.A. Johnson, Pearson 2019", "Students will be given due notice, in the first", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 13, "course_code": "NE 216", "course_name": "NE216 - Advanced Calculus and Numerical Methods 1 (0.50)", "term_name": "2A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Advanced Calculus and Numerical Methods 1 Fall 2024", "04:00PM - 05:20PM", "Email: thompson@uwaterloo.ca Best method of contact", "Boundary value problems and applications to quantum mechanics.", "2 1st-order linear ODE; Numerical solution of general 1st order ODE’s, Euler’s method.", "Local and global errors.", "Superposition principle; 2nd-order linear ODE’s with constant coefficients.", "5 Small oscillations in physical systems; free oscillations; damping.", "System of linear ODEs with constant coefficients: eigenvectors and eigenvalues.", "8 Matrix method for ODE systems.", "Introduction to Laplace transform.", "Schrödinger equation for particle in a box.", "Introduction to Fourier series.", "12 Periodic extensions; complex Fourier series and Parseval’s Theorem.", "Evaluation"]}, {"course_id": 14, "course_code": "NE 220L", "course_name": "NE220L - Materials Science and Engineering Laboratory (0.25)", "term_name": "2A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 11:20AM QNC 2614", "08:30AM - 11:20AM QNC 2614", "08:30AM - 11:20AM QNC 2614", "Arrange for assistance via email", "Teaching Assistants Name and Email:", "Impact Testing QNC 2613 Maggie Wong m228wong@uwaterloo.ca", "Thermal Gravimetric Analysis QNC 2613 Mahsa Barjini Khabbaz mbarjinikhabbaz@uwaterloo.ca", "Experimental exercises will study the physical properties and characteristics of materials, including mechanical, thermal, electrical, and structural/morphological properties at different length scales.", "Specific samples relevant to a characterization technique are utilized to demonstrate its usefulness.", "In addition, analyses of Low-Density Polyethylene (LDPE), High Density Polyethylene (HDPE), HDPE + 10 wt.% Graphene black, and HDPE + 2.5 wt.% Plasticizer are carried out to demonstrate the power of applying multiple characterization techniques to a family of related materials.", "A SolidWorks simulation is used to further enhance understanding of characterization.", "The set of experiments provided in this laboratory course is intended to introduce the capabilities of each equipment, provide hands-on experience in conducting the experiment and analyzing the data, and demonstrate how to obtain a thorough understanding of the properties of these materials by employing a series of complementary analysis methods.", "Apply the reaction rate law and heat capacity expression to demonstrate comprehensive analysis resulted from the complementary characterization techniques.", "Develop a comprehensive understanding of material properties in realistic situations.", "Topics to be covered in the laboratory periods:", "Different polymer samples will be used to demonstrate the capabilities of each instrument.", "Although only polymer samples will be tested during this course, it is important to notice that these techniques can be transferrable to other types of solid materials, such as ceramics and metals.", "The impact test subjects the material to high-speed deformation.", "This exercise also includes converting the polymer from pellet form to moulded bars for impact testing and dog\u0002bones for tensile testing using a hot press or an injection moulder.", "TGA will also be used to determine the composition of a copolymer and the activation energy of a degradation reaction using the Flynn-Wall-Ozawa method.", "The thermal properties of amorphous and semi-crystalline polymers will be analyzed by DSC.", "The approximate length of time required for completing the pre-laboratory safety test and completion of the pre-laboratory exercise should not exceed the number of hours that were taken to do the laboratory exercise itself.", "Several of the experiments allow sufficient time to complete the laboratory report during the laboratory period and can be submitted before leaving the lab.", "Make-up laboratory sessions will generally not be accommodated in the absence of extenuating circumstances as assessed by the Laboratory Instructor or without a valid medical certificate.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 15, "course_code": "NE 222", "course_name": "NE222 - Organic Chemistry for Nanotechnology Engineers (0.50)", "term_name": "2A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Organic Chemistry for Nanotechnology Engineers Fall 2024", "04:00PM - 05:20PM", "Technical Assistance", "E-mail: learnhelp@uwaterloo.ca", "Nomenclature, stereochemistry, and reactions of important classes of organic compounds.", "Aromaticity and simple molecular orbital theory of conjugated systems.", "Applications to nanomaterials and/or devices.", "Bonding, structure and nomenclature in organic chemistry.", "Physical properties, simple reactions associated with the important functional groups and their mechanisms.", "Nomenclature", "Acids and Bases", "Conformational analysis and Stereochemistry", "Elimination Reactions", "Reactions of Alkenes and Alkynes", "Reactions of Alcohols", "Name basic organic molecules", "Draw resonance structures and identify major and minor contributors", "Identify and describe the acidity and basicity of various molecules", "Draw organic molecules in three dimensions and identify the lowest and highest energy conformations", "Explain chemical reactions using energy diagrams", "Predict the product outcome of reactions using reaction mechanisms, labeling products as major and minor", "Understand the reactivity of a variety of molecules containing a variety of functional groups", "Molecular Kit No", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 16, "course_code": "NE 241", "course_name": "NE241 - Electromagnetism (0.50)", "term_name": "2A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electromagnetism Fall 2024", "08:30AM - 11:20AM QNC 2611", "08:30AM - 11:20AM QNC 2611", "08:30AM - 11:20AM QNC 2611", "E-mail", "Coulomb's law, electric field and electric flux, Gauss's law, electric potential, potential and field, magnetic field, Ampere's law, solenoid, electromagnetic induction, magnetic flux, Lenz' law, Faraday's law, capacitors and capacitance, inductors and inductance, Maxwell's equations, electromagnetic fields and waves, polarization.", "Welcome to the NE 241 laboratory!", "In lab 3, you will study different configurations of parallel plate capacitors and measure charge distribution and capacitance for different configurations.", "In lab 4, you will investigate the electric field and potential of different objects using COMSOL software.", "In lab 5, you will measure magnetic fields for different objects, self-inductance, and explore the induced emf concepts.", "F", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 17, "course_code": "COMMST 100", "course_name": "COMMST100 - Interpersonal Communication (0.50)", "term_name": "2A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["jclausen@uwaterloo.ca (please do not use the D2L email system)", "I monitor my email M-F, 9:00 am - 5:00 pm.", "Focuses on the one-to-one, face-to-face communication in both the personal and professional realms.", "Such topics as verbal and non-verbal interactions, listening, and the better management of interpersonal communication will be studied.", "In this course, we will work to understand more fully how we communicate (and are communicated to) in the world we live in and to develop the tools to research, apply, and practice key interpersonal communication concepts in our everyday lives.", "Students will be encouraged to identify, negotiate, and challenge existing communicative norms as they explore a range of interpersonal and intrapersonal issues that include culture, identity, and power.", "Understand the complexity of communication as a human process of shared meaning- making in the context of power, history, and culture", "Increase your capacity to recognize and enhance yours and others’ agency – the ability to make a difference in the world for yourself and others – and understand the implications of your communication behaviours for yourself and others", "Understand communication as a practice and improve your critical and creative communication competencies by developing your ability to use writing and other media of communication to create meaning", "This entails opportunities for student-directed inquiry, challenge and risk-taking, and reflection on your roles and responsibilities", "Reflect on your role in fostering the public good (the multifaceted well-being of individuals and groups), begin to imagine a better future, and make decisions in your communication that can transform the communities to which you belong", "Recognize diverse linguistic practices and modes of expression as resources for writers and speakers", "Introduction", "Read: Meaning as Co-Created", "Read: “Cultural and Historical Influences: Communication Competence in Context”", "Exceeds assignment guidelines; strong and consistently applied definition of audience and purpose; thoughtful and innovative adaptation of the subject to the audience’s needs; subject developed and organized at every level for listener comprehension; speaker uses language appropriately, effectively and even inventively; maintains relaxed, inviting delivery free of verbal fillers and distractions; cites sources appropriately both in spoken and written work; submits well prepared required materials.", "Your entries should be roughly two typewritten, double- spaced pages each although they can go slightly over.", "While the amount you write under each heading may change week to week, this format allows you to address each area regularly.", "Decide how often you will communicate and in what manner.", "Decide how you will divide the workload and handle conflicts.", "Handing in a clear contract will earn 5%.", "Your job will be to engage the class and apply what we are reading to people’s own opinions, experience, etc. Sign up for this assignment is on a first-come/first-served basis starting during week two of classes.", "Group Presenation 2: Final Presenation You and your group will create a fifteen-minute videotaped presentation exploring a problem in interpersonal communication and proposing a solution for that problem.", "This presentation will involve research into a specific issue related to interpersonal communication and creating good reasons for following your proposed solution.", "This course includes the independent development and practice of specific skills, such as self reflection, critical thinking skills and interpersonal communication.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 18, "course_code": "COMMST 223", "course_name": "COMMST223 - Public Speaking (0.50)", "term_name": "2A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["In the case of service interruptions to the LEARN system, please see the LEARN Service Interruption Policy https://uwaterloo.ca/secretariat-general-counsel/service-interruptions-online-learning-environment-guidelines", "A workshop course involving design and delivery of various kinds of speeches, and the development of organizational, vocal, listening, and critical skills.", "Apply speech communication concepts in designing and delivering public speeches and digital productions", "Understand and negotiate cultural assumptions and expectations in public address", "Foundations of a public speaking performance", "Your first speech: Informing about your language", "First speech workshop: a life story of the language I speak (voice, body, presence)", "First speech presentation 1", "First speech presentation 2", "Oct. 3: Read: Evaluating speeches critically (Zarefsky & Engels)", "First speech presentation 3", "Discussion and Introduction to Second Speech Assignment: Persuading a local audience", "(and Choosing your topic -CH 6 .Zarefsky & Engels)", "Your second speech: persuading a local audience", "(Ch 14 and Ch 16 -up until 16.5-, Zarefsky & Engels)", "Second Speech Development", "Exercise # 2: Describe a local situation and evaluate it as a problem for your peers - 90 sec. speech", "Mediated public speaking: Persuading a Digital Audience", "Read; Appendix B, Ch. 16, Zarefsky & Engels", "Development & Research of your project", "Nov. 26 &", "Second Speech: Persuading a Local Audience 30%", "Third Speech: Persuading a Digital Audience 30%", "First Speech: Informing about your language", "The goal of this speech is for you to inform your audience about how your mother tongue  background, individual experience, and culture impact your self-concept, language use, sense of audience perceptions, constraints stemming from communicative norms, and methods you employ to negotiate various rhetorical situations.", "Second Speech: Persuading a Local Audience", "Third Speech: Persuading a Digital Audience", "3 short speech excercises: 3.33% each for a total of 10%", "You should also write a few brief notes on why you chose each quotation.", "How does it relate to the class?", "The moderator is responsible for running the class in an efficient and creative manner: introducing speakers, organizing the discussions with the evaluators, initiating class comments, and generally making sure that the session runs smoothly and according to schedule.", "90-Second Short Speech Exercises  (3 total, marked for completion):", "These public speaking exercisesintroduce students to fundamental rhetorical concepts and strategies.", "Over the course of the semester, you will present three exercises as 90-second speeches in front of the class or in small groups.", "For the first and second major assignments of the term, you will offer and accept productive feedback and produce brief analyses of your peers’ speeches in two-page, double-spaced papers (one each for the first and second major speech rounds).", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 19, "course_code": "EMLS 101R", "course_name": "EMLS101R - Oral Communications for Academic Purposes (0.50)", "term_name": "2A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["& Location:", "Email:                         christa.schuller@uwaterloo.ca", "Designed specifically for students for whom English is not the first language, this course introduces group discussion strategies and presentation skills.", "A focus on pronunciation and vocabulary assists learners to better engage in conversations and listen to and deliver English presentations.", "This is achieved with the focus on gambits, voice quality, and speech clarity, which assist learners in developing strategies to better engage in discussions, and listen to and deliver English presentations in both remote and face-to-face contexts.", "Create and organize discussions and presentations", "Use a clear and appropriate format", "Develop relevant and well formatted materials (PowerPoint slides and discussion notes)", "Select effective introductions and conclusions to engage the audience", "Clearly express their ideas verbally and non-verbally", "Use communication gambits and signpost language effectively during discussions as well as individual and team presentations", "Use body language and space on stage to enhance the expression of ideas", "Listen for main ideas and details of some selected TED talks to form opinions on current socio-cultural, educational, environmental, and technological issues", "Critically evaluate various sources of information and then incorporate these sources in oral communication to create strong, academic support for their ideas", "Topics & Activities In-class Activities & Assignments Home                 Assignments", "Nonverbal communication- Importance of body language", "Introduction to group discussion assignment", "Analysis of non-verbal communication of selected presenters", "Small talk & non-verbal communication practice", "Main ideas and brief summary of TED Talks", "Question types for semi-formal discussion", "Discussion facilitation and gambits", "Non-verbal communication during a discussion", "Discussion skills", "Introduction to informative presentation introductions and conclusions", "Introduction to individual  presentations: thesis statement and format", "Chunking, pausing and focus words", "Writing thesis statements", "Pausing and focus words", "Effective PowerPoint slide design & APA citations", "Opening and closing a presentation", "Practice designing a slide and presenting its content", "Sample presentation", "Submitting PPT and Outline", "Submitting PPT and Outline", "Introduction to product review", "Inventions and innovations; product features", "Brainstorming for main ideas", "March 24 - 28", "Product review development – outline and slides", "Sample product review slides & outline", "Search for support materials, content development & slide design", "Product review presentations", "You will also need to watch the presentations of the other students and actively participate in the Q & A sessions following these presentations.", "A self-reflection on your preparation for the presentation, its delivery, and the Q & A will follow.", "A brief Q & A session will then follow.", "You will also need to watch the presentations of the other students and actively participate in the Q & A sessions following these presentations.", "These quizzes will cover the concepts related to academic and professional presentations, both individual and co-delivered, as well as discussions.", "Electronic Device Policy", "This course includes the independent development and practice of specific skills, such as collecting, synthesizing, and analyzing information; developing and practicing oral skills; critically evaluating and elaborating on ideas.", "Library for research-based assignments", "You can earn an EMLS Diploma by completing four EMLS courses and earning a cumulative average of 65%.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 20, "course_code": "EMLS 102R", "course_name": "EMLS102R - Clear Communication in English Writing (0.50)", "term_name": "2A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Clear Communication in English Writing Winter 2025", "K. Williams", "k33willi@uwaterloo.ca", "Designed specifically for students for whom English is not the first language, this course offers sentence-level instruction in grammar and idiom to teach students to produce, evaluate, and edit writing under time constraints.", "It emphasizes readability and error reduction in sentences and paragraphs.", "Identify sentence organization patterns and use them accurately and appropriately.", "Consider the importance of purpose and audience for specific writing tasks.", "In the case of emergency that may result in late submission, please contact the course instructor(s) to discuss potential extensions.", "You can earn an EMLS Diploma by completing four EMLS courses and earning a cumulative average of 65%.", "This course includes the independent development and practice of specific skills, such as writing sentences with grammatical accuracy and sentence structure, being able to edit writing for grammatical errors, developing and increasing vocabulary skills, and writing required organization patterns.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 21, "course_code": "EMLS 129R", "course_name": "EMLS129R - Written Academic English (0.50)", "term_name": "2A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Designed specifically for students for whom English is not the first language, this writing skills course provides instruction in grammar, sentence and paragraph structure, elements of composition, and academic essay writing, including a focus on theme, development of central ideas, exposition, and argumentation.", "The course provides instruction in grammatical accuracy, written fluency, and conventional essay patterns.", "This writing course is for students whose first language is not English.", "recognize and write conventional patterns of essay organization such as definition, compare-contrast and argument,", "use appropriate grammar structures to achieve accuracy in writing,", "draft and edit to achieve fluency in writing,", "Library for research-based assignments"]}, {"course_id": 22, "course_code": "ENGL 109", "course_name": "ENGL109 - Introduction to Academic Writing (0.50)", "term_name": "2A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Academic Writing Winter 2025", "View requirements for ENGL 109", "You will learn about different forms of academic writing, as well as the processes that great writers engage in to create their best work.", "Even programs like engineering, or accounting, or geography include major writing assignments, especially in upper years, in part because they recognize that careers in those fields require far more writing than students might expect.", "Because we value learning as a social activity, and thus recognize that writers and readers learn from one another, much of your work in English 109 will involve different kinds of collaboration with your peers.", "think critically and communicate effectively;", "These quick interactive elements provide opportunities to test your understanding of course concepts but are not graded.", "Standard of Work", "Every member of this course—instructors as well as students—has rights and responsibilities to ensure a pleasant and productive experience for all.", "Online Etiquette", "Exemptions from late penalties can only be given where there are significant extenuating circumstances.", "Intellectual property includes items such as:", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 24, "course_code": "NE 217", "course_name": "NE217 - Advanced Calculus and Numerical Methods 2 (0.50)", "term_name": "2B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Advanced Calculus and Numerical Methods 2 Spring 2024", "10:00AM - 11:20AM MC 4020", "10:00AM - 11:20AM MC 4020", "Friday -", "Friday", "02:30PM - 05:20PM", "Email: thompson@uwaterloo.ca", "Green's, Gauss', and Stokes' Theorems: Applications to electromagnetism and fluid mechanics.", "First order PDEs.", "Second order linear PDEs", "Numerical methods and the CFL condition.", "Matrix and relaxation methods.", "A vector calculus description of the finite element method.", "Stoke’s theorem, scalar and vector surface integrals."]}, {"course_id": 25, "course_code": "NE 225", "course_name": "NE225 - Structure and Properties of Nanomaterials (0.50)", "term_name": "2B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Structure and Properties of Nanomaterials Spring 2024", "08:30AM - 09:50AM MC 4020", "10:00AM - 11:20AM MC 4020", "Friday -", "Friday", "02:30PM - 05:20PM", "Email: aklinkova@uwaterloo.ca", "Email: nhdelva@uwaterloo.ca", "Electronic orbitals in atoms, molecules and the solid state.", "Structures and properties of covalent and ionic solid nanoparticles including their catalytic, electrochemical, electrical, optical and magnetic properties.", "Semiconductors and carbon/silicon-based nanoparticles.", "Module 3: C-based Nanomaterials and Self-Assembly", "Provide basic interpretation of molecular orbitals and band diagrams [", "Calculate standard cell potential, equilibrium constant and standard free energy for redox reactions [", "Explain the basics of metal nanoparticle synthesis using reductive chemistry [", "Determine simple unit cells, coordination numbers, and symmetry elements in crystalline solids [", "Describe the structure of carbon-based materials and its effect on their properties [1b, 2c]", "Understand molecular self-organization in micelles, bilayers and liposomes and their application in drug delivery", "Describe the driving forces behind nanoparticle self-assembly [1b, 2c, 4c]", "Interpret potential energy diagrams in (electro)catalytic reactions [", "Describe electron flow in photocatalysis [1b, 2c]", "Week of", "Atomic orbitals, molecular orbitals, homonuclear and heteronuclear diatomic electronic configuration, triatomic electronic configuration, σ, π, and δ bonds", "Doping and electronic band structure, quantum dots and other semiconductor nanostructures", "Crystalline solids, crystal systems, basic unit cells, symmetry elements", "Self-assembly of nanoparticles; chiral nematic phases", "Basics of catalysis, potential energy diagrams, catalytic active sites, thermal catalytic reactions and nanocatalyst examples", "Basics of photocatalysis and electrocatalysis using nanoparticles", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 26, "course_code": "NE 226", "course_name": "NE226 - Characterization of Materials (0.50)", "term_name": "2B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 09:50AM MC 4020", "10:00AM - 11:20AM MC 4020", "Friday -", "Friday", "02:30PM - 05:20PM", "Email: vmaheshw@uwaterloo.ca", "Teaching Assistant:    Saikiran Khamgaonkar", "Email:             s2khamgaonkar@uwaterloo.ca", "Materials composition and chemical bonding analysis.", "In-situ analysis and monitoring of fabrication process parameters.", "Analyze these interactions for the principles of Infrared and Raman spectroscopy.", "Understanding electron waves and their generation and use in electron microscopy.", "Similar understanding and ability to analyze and evaluate materials with other techniques such as XEDS.", "Basics of waves and light matter interaction                                                 2-3 Weeks", "Infrared and Raman Spectroscopy                                                                 2-3 Weeks", "Light Microscopy and Electron microscopy                                                  3-4 Weeks", "X-ray Emission Spectroscopy, XEDS and XWDS, Auger Electron", "Spectroscopy, X-ray photoelectron Spectroscopy                                         Time permitting", "XRD and basics of crystal structures                                                             Time permitting", "Secondary mass ion spectroscopy", "Materials characterization: Introduction to microscopic and spectroscopic methods", "Solid state chemistry and its application", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 27, "course_code": "NE 226L", "course_name": "NE226L - Laboratory Characterization Methods (0.25)", "term_name": "2B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["01:30PM - 04:20PM QNC 2614", "Tuesday -", "QNC 2614", "01:30PM - 04:20PM QNC 2614", "01:30PM - 04:20PM QNC 2614", "Dr. Yael Zilberman-Simakov", "First Name Last Name Email Address Lab Exercise Exercise Starting Location", "Sarah  Rezaei  sarah.rezaei@uwaterloo.ca FT-IR QNC 2614", "This laboratory course introduces students to six materials characterization techniques employed routinely by nanotechnology engineers in their practices.", "Prepare samples for and safely operate all six instruments for most common analysis situations.", "Choose an appropriate set of starting conditions to begin analysis.", "in-lab performance 10", "15 in-laboratory 15", "in-lab performance 10", "in-laboratory submission 20"]}, {"course_id": 28, "course_code": "NE 242", "course_name": "NE242 - Semiconductor Physics and Devices (0.50)", "term_name": "2B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Semiconductor Physics and Devices Spring 2024", "10:00AM - 11:20AM MC 4020", "08:30AM - 09:50AM MC 4020", "Friday -", "Friday", "02:30PM - 05:20PM", "11:30AM - 12:20PM MC 4020", "Introduction to the physical principles and electrical behaviour of semiconductor materials and devices: electronic band structure, charge carriers, doping, carrier transport, pn-junctions, metal-oxide-semiconductor capacitors, transistors, and related optoelectronic devices (photodetectors, light emitting diodes, solar cells).", "Analyze pn junctions using basic concepts and equations, and", "Crystal Structure of Solids", "Quantum Theory of Solids", "Quantum Theory of Solids", "-equilibrium Excess Carriers in Semiconductors", "PN Junction Diode", "MOS Capacitors", "MOSFETs", "MOSFETs", "MOSFETs - Additional Concepts", "MOSFETs - Additional Concepts", "Optical Devices", "Optical Devices", "This course includes the independent development and practice of specific problem-solving skills related to semiconductor physics and devices.", "Library for research-based assignments"]}, {"course_id": 29, "course_code": "NE 281", "course_name": "NE281 - Biology for Nanotechnology Engineers (0.50)", "term_name": "2B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Biology for Nanotechnology Engineers Spring 2024", "NE 281", "NE 281 001", "08:30AM - 09:50AM MC 4020", "08:30AM - 09:50AM MC 4020", "Friday -", "Friday", "02:30PM - 05:20PM", "NE 281 201", "NE 281 202", "NE 281 101", "11:30AM - 12:20PM MC 4020", "NE 281:", "Introduction to cell biology.", "Critical molecular processes of living organisms.", "Applications to nanobiotechnology.", "Accurately use language of biology to describe problems and challenges when working with living systems.", "Match fundamental concepts in biology and chemistry to their application when working with living systems.", "Describe how nanoengineering applies interdisciplinary sources of knowledge to solve complex problems.", "Introduction to Cell Biology", "Solving cell biology problems", "Biomolecules", "Hofer & Lutolf, 2021", "Catalysis and Bioenergetics", "Catalysis and Bioenergetics", "Midterm - Tues June 18, normal lecture time & room", "Cell division", "TBA", "Working in a cell biology lab", "Cell communication", "Ethics", "TBA", "The text provides comprehensive coverage of foundational research and core biology concepts through an evolutionary lens.", "Biology includes rich features that engage students in scientific inquiry, highlight careers in the biological sciences, and offer everyday applications.", "Midterm: Midterm will be short answer and multiple choice.", "Exam will be short answer and multiple choice.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 30, "course_code": "MSE 261", "course_name": "MSE261 - Engineering Economics: Financial Management for Engineers (0.50)", "term_name": "3A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Economics: Financial Management for Engineers Winter 2025", "10:30AM -", "12:20PM RCH 306", "S. Mortazavian Farsani", "10:30AM - 11:20AM RCH 306", "Depreciation models and asset replacement analysis.", "View requirements for MSE 261", "Engineers are often required by society to make responsible decisions on complex issues that have financial, economic, political and environmental elements.", "This course presents engineering economics as a key part of an engineer’s decision-making mandate.", "Engineering Economics focuses on basic principles and applications of economic decision-making between alternatives encountered in engineering systems projects.", "Apply basic financial calculations, useful in personal life and business [", "4. Recognize the impact of inflation and taxation in making engineering economics decisions [11b]", "Analyze the public centered projects by their costs and benefits (dis-benefits) to society and environment [9a, 9b, 11b]", "Understand and analyze the components of financial statements and use them in investment decisions and preparing business plans [1c, 11b]", "The course will be dynamic and hence, the weekly schedule provided in this document is tentative and subject to slight changes in order to adapt to the needs and conditions the class may face.", "Week of", "Introduction", "Cash Flow Analysis", "-", "Replacement Analysis", "Inflation", "Public Sector Decision Making", "Introduction to Project Management", "Engineering Economics: Financial Decision Making for Engineers (7th Edition).", "Engineering Economic Analysis (4th Canadian Edition).", "Quizzes are non-cumulative while midterm and final exams are cumulative in the sense that final exam covers whatever covered after the midterm content.", "In case of any technical issues uploading the files, please email the TAs right away.", "All assessments will be also submitted online in that case.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 31, "course_code": "NE 318", "course_name": "NE318 - Continuum Mechanics for Nanotechnology Engineering (0.50)", "term_name": "3A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Continuum Mechanics for Nanotechnology Engineering Spring 2024", "04:00PM - 05:20PM", "03:30PM - 04:20PM", "DWE 3522", "Linear elastic solids: Hooke's Law, infinitesimal elasticity theory.", "Introduction to Newtonian viscous fluids: hydrostatics, Navier-Stokes equations, flow regimes, and the Reynolds number.", "Course Objectives: An introduction to solid mechanics, fluid mechanics, and anisotropic properties of materials.", "Obtain knowledge in the introduction to solid mechanics, fluid mechanics, and anisotropic properties of materials", "4                     Small scale mechanical properties - Stress and strain applications in thin films and devices    Stanford Class Notes", "6                     Fluidic mechanics, conservation laws, viscosity, momentum transports                               Bird- Ch 0", "8                     Shell momentum balances in laminar flow, Navier-Stokes Equations                                   Bird – Ch 1-2", "9                     The equation of change for isothermal systems                                                                    Bird – Ch 3", "11                   Shell Energy Balances and Temperature Distributions in Solids and Laminar Flow,              Bird – Ch 10", "12                   Shell Energy Balances and Temperature Distributions in Solids and Laminar Flow,              Bird – Ch 10", "This course includes the independent development and practice of specific skills, such as solving continuum problems.", "Library for research-based assignments"]}, {"course_id": 32, "course_code": "NE 320L", "course_name": "NE320L - Characterization of Materials Laboratory (0.25)", "term_name": "3A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["NE 320L", "08:30AM - 11:20AM QNC 2614", "08:30AM - 11:20AM QNC 2614", "08:30AM - 11:20AM QNC 2614", "08:30AM - 11:20AM QNC 2614", "08:30AM - 11:20AM QNC 2614", "NE 320L 006", "08:30AM - 11:20AM QNC 2614", "The laboratory exercises focus upon the synthesis and characterization of nano-based materials.", "Specifically, the synthesis of carbon nanotubes, quantum dots, magnetic ceramics, or other common nanomaterials will be investigated, and sample preparations for various characterization tools will be carried out.", "Understand the protocols used to synthesize nanomaterials and prepare them for characterization", "Understand the basis for why the specific techniques are used to characterize the materials", "Appreciate the synthetic techniques used such as working in inert condition and the handling of the nanomaterials", "Observe the usage of each nanomaterial in a real-life application."]}, {"course_id": 33, "course_code": "NE 332", "course_name": "NE332 - Quantum Mechanics (0.50)", "term_name": "3A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Quantum Mechanics Spring 2024", "04:00PM - 05:20PM", "04:00PM - 05:20PM QNC 1502", "Historical background; the differential equation approach to quantum mechanics; treatments of solvable problems such as the particle-in-a-box, harmonic oscillator, rigid rotor, and the hydrogen atom; introduction to approximation methods for more complex systems; application to solid state problems, including band theory.", "This theoretical framework will lead us to understand deeply some very basic concepts in chemistry and physics.", "In this course we will focus on model problems that can be solved with 'relatively little' effort and which illustrate the nature of the quantum world and will introduce you to thinking 'quantum'.", "Moreover these simple models often lead to surprisingly quantitative understanding of observed excitations of atoms, molecules and materials.", "A major theme concerns the electronic structure of atoms and simple molecules.", "Operator techniques will be introduced as a powerful tool to solve a variety of problems in an elegant and uniform manner.", "It contains short summaries (Mathchapters) of mathematical methods that can serve as either brief reviews of or introductions to the material.", "Problems and Solutions for McQuarrie's Quantum Chemistry,", "A free pdf of the McQuarrie book is available here", "Understand the essential formulation of quantum mechanics: States, Superpositions, Eigenstates, Operators, Probabilities.", "Understand (at a basic level)", "History: Relativity, Planck’s radiation law, Einstein Photo-electric effect,", "Time-dependent Schrödinger equation and Ehrenfest theorem.", "Variational principle and basis set expansions, matrix formulations quantum mechanics.", "Introduction Gaussian: Optimization + Frequency (tut.)", "Problems and Solutions for McQuarrie's Quantum Chemistry,ISBN 9781891389528 This is a solution manual for problems in McQuarrie No", "In particular we will discuss the postulates of quantum mechanics and their 'ensemble Interpretation'.", "There will also be a handout discussing the most basic H atom, using angular momentum theory in operator form.", "I plan to introduce a section on quantum computing.", "TBA"]}, {"course_id": 34, "course_code": "NE 333", "course_name": "NE333 - Macromolecular Science (0.50)", "term_name": "3A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "04:00PM - 05:20PM", "Chemical kinetics, step-growth and free-radical chain-growth polymerizations, polymer recycling and sustainable design.", "Module 3: Chemical kinetics: introduction to rate of chemical reactions and chemical mechanisms.", "identify, list and discuss types of polymer chain structures", "understand and discuss types of polymer and their properties", "evaluate and use methods to calculate molecular weight averages and distributions", "understand role of polymerization mechanisms and calculate conversion and molecular weight of polymer reactions", "identify and select polymer materials based on environmental attributes", "Introduction to Polymers", "Terminology, Properties and Applications", "Molecular weight averages and determinations: theory and experimental", "Molecular weight distributions", "Molecular weight measurement (colligative properties)", "Molecular weight measurement (GPC)", "Introduction to Chemical Kinetics (rate laws, reaction order, half-life time)", "Introduction to polymer chemistry: Classification of polymerization reactions", "Step-growth polymerization: Examples and requirements", "Step-growth polymerization: Mechanisms and kinetics", "Chain-growth polymerization: Molecular weight", "Chain-growth radical polymerization (elementary steps)", "*", "Sustainable polymers: Product design environmental footprint (CES EcoAudit Software) *", "The Chemistry of Polymers, John W. Nicholson, 5th Edition Royal Society of Chemistry", "Polymer Chemistry - Properties and Applications, Andrew J. Peacock, Allison Calhoun, Hanser", "The fundamental goal of the marking scheme is to create a structure for assessments enabling a fair grade that reflects many aspects of learning in NE333.", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 35, "course_code": "NE 343", "course_name": "NE343 - Microfabrication and Thin-Film Technology (0.50)", "term_name": "3A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Microfabrication and Thin Film-Technology Spring 2024", "04:00PM - 05:20PM", "Substrate preparation.", "Homoepitaxy, heteroepitaxy, and molecular-beam epitaxy.", "Physical and chemical vapor deposition.", "This course is held with ECE 433: Fabrication Technologies for Micro and Nano Devices", "Explain how plasma discharges and how to create them.", "Determine junction formation processes for microelectronic device needs.", "Explain nanopatterning principles and limits of optical lithography.", "Section 6: Optical Lithography and its limits", "Section 10: Transistor and CMOS Fabrication"]}, {"course_id": 36, "course_code": "NE 307", "course_name": "NE307 - Introduction to Nanosystems Design (0.25)", "term_name": "3B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Nanosystems Design Fall 2024", "RCH 307", "Course Instructor & FYDP Coordinator:", "Office: E3-3141", "Email:  h2aziz@uwaterloo.ca", "Introduction to the engineering design process: problem definition and needs analysis; process synthesis, analysis, optimization and troubleshooting; safety and environmental protection in design; written and oral communication for design reports.", "Students form four-person design teams and start a team-oriented project based on the knowledge and skills acquired in previous courses and on co-operative work terms, culminating in a design proposal presentation.", "View requirements for NE 307", "Use engineering design methods to identify and define a project problem", "Appraise themselves and others as an effective member and/or leader in the team", "Demonstrate effective communication through the use of an oral and written project proposal", "Critique the presentation style and technical design project proposal of their peer", "Engineering Design – A Systematic Approach Paul G., Beitz W., Feldhusen J., and Grote K.H., “Engineering Design – A Systematic Approach”, 3rd Ed., Springer, 2007.", "Team selection & team contract (1 per team)", "Team FYDP Proposal", "If a critique session is missed by a student, that student must complete 2 new critique sessions as assigned by the instructor.", "A CRedit/INComplete grade will be issued by the course instructor based on timely submission and satisfactory performance in each of the submissions described above.", "Each team member will receive the same grade unless the team presents a case for differential grades."]}, {"course_id": 37, "course_code": "NE 330L", "course_name": "NE330L - Macromolecular Science Laboratory (0.25)", "term_name": "3B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Lab exercises exploring the synthesis and characterization of polymers, copolymers, and soft nanomaterial structures.", "• Prepare epoxy resin test pieces for physical and thermal testing.", "• Make and isolate polymers of methyl methacrylate by employing, RAFT controlled polymerization techniques.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 38, "course_code": "NE 334", "course_name": "NE334 - Statistical Thermodynamics (0.50)", "term_name": "3B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Statistical Thermodynamics Fall 2024", "11:30AM -", "Instructor: Professor Pierre-Nicholas Roy", "Review of statistical concepts.", "Canonical and grand canonical ensembles.", "General formulation of statistical thermodynamics.", "Have the background in statistical thermodynamics necessary for its application to macroscopic systems.", "Be familiar with thermodynamics concepts.", "Understand the canonical and grand ensembles from first principles and develop expressions for thermodynamic properties.", "Determine partition functions and employ them for the evaluation of thermodynamic quantities from microscopic properties, particularly those of a spectroscopic nature, of the individual molecules constituting macroscopic systems.", "Work with statistical mechanical concepts into tackle real world examples and compute thermodynamic properties.", "Use Python scripts to solve statistical mechanics problems and present results graphically.", "Introduction", "2.1 Thermodynamics I", "2.2 Thermodynamics II", "September 24", "Classical statistical mechanics, Electric and Magnetic Phenomena", "9.1 Chemical Equilibrium", "9.2 Chemical Equilibrium/Quantum Statistics", "10.1 Quantum Statistics", "10.1 Quantum Statistics", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 39, "course_code": "NE 336", "course_name": "NE336 - Micro and Nanosystem Computer-Aided Design (0.50)", "term_name": "3B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Micro and Nanosystem Computer-Aided Design Fall 2024", "08:30AM - 09:50AM RCH 307", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Department of Chemical Engineering", "Email me -> pmahmoud@uwaterloo.ca", "E6-5002", "E6-5002", "E6-3116", "Review of differential-equation systems, constitutive relations, boundary conditions, and solvers for complex, coupled transport problems pertinent to micro and nanosystems.", "Numerical schemes for nonlinear systems.", "Basic modelling and simulation of micro and nanosystems, and fluidic systems.", "Describe mathematical algorithms for a range of common problems of engineering interest (including root finding, systems of simultaneous equations, interpolation, differentiation and integration).", "Describe related numerical concepts, such as types of error, stability, convergence.", "Apply numerical methods to the solution of engineering design problems using python and COMSOL.", "Part I Review on Numerical methods", "Root Finding methods : system of equations", "Part II Numerical methods for ordinary differential equations", "Boundary-value problems", "Part III Numerical methods for partial differential equations", "Finite difference methods, Elliptic PDEs", "Finite Element Analysis", "Part IV Multi-physics problems", "Illustrative multi-physics problems", "Basic num. methods", "Introduction to COMSOL", "Numerical Methods for Engineers and Scientists A., Subramaniam, V., Second Edition, Wiley and Sons, 2011.", "Introduction to Finite Elements in Engineering, Chandrupatla, T. and Belegundu, A., Third edition, Prentice Hall, 2002.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as intermediate programming skills and numerical analysis.", "Library for research-based assignments"]}, {"course_id": 40, "course_code": "NE 340L", "course_name": "NE340L - Microfabrication and Thin-Film Technology Laboratory (0.25)", "term_name": "3B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Microfabrication and Thin-Film Technology Laboratory Fall 2024", "01:30PM - 05:20PM", "01:30PM - 05:20PM", "01:30PM - 05:20PM", "Yizun Wang - y2735wang@uwaterloo.ca", "Nikolay - Videnov nikolay.videnov@uwaterloo.ca", "Alex Xu - alexander.haoyan.xu@uwaterloo.ca", "Lab topics may include thin film deposition by PECVD and PVD (sputtering); photolithography; dry and wet etching; and C-V and I-V analysis of MIS structures.", "View requirements for NE 340L", "Know safety procedures for a cleanroom laboratory", "Be able to fabricate a set of thin film MIS structures and measure their C-V and I-V characteristics", "Topics to be covered in the laboratory periods:", "C-V and I-V analysis of MIS structures", "Students use the wafer that they have fabricated in Lab 1 and Lab 2, and conduct C-V measurements of nine structures, I-V measurements of three structures, and carry out calculations of the densities of the deposited films, the dielectric constant of the silicon nitride, substrate doping, and compare their values with published literature data.", "Semiconductor Physics and Devices: Basic Principles “Semiconductor Physics and Devices: Basic Principles”, Neamen, Donald A. QC611.N39 2012 No", "In addition, students can use the text book “Semiconductor Physics and Devices: Basic Principles”, Neamen, Donald A. QC611.N39 2012, as a guide for learning the lab contents and writing final report.", "You can use this link; https://oculwtl.primo.exlibrisgroup.com/permalink/01OCUL_WTL/pa2qcq/alma9943040243505162", "Although labs are performed in groups, marks are allocated in each lab for individual in-laboratory performances.", "In each of the first two labs a safety quiz is required to be completed prior the start of the lab."]}, {"course_id": 41, "course_code": "NE 352", "course_name": "NE352 - Surfaces and Interfaces (0.50)", "term_name": "3B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 11:20AM RCH 105", "08:30AM - 09:50AM RCH 105", "Surfaces and interfaces in microelectronics and nanofabrication.", "Capillary phenomena and molecular self-assembly.", "Describe the origin of a variety of interfacial phenomena", "Calculate surface/interfacial forces and potential energies of micro- and nano-scale systems", "Design experiments to measure interfacial tension, including the selection of appropriate tools", "Analyze experimental data to determine surface characteristics", "Design surfaces to create stable or unstable dispersions", "4 Sept 25th 3 Electric double layer: Poisson-Boltzmann, Gouy-Chapman-Stern theories", "10 Nov 6th 6 Polymers and surfaces, adsorption phenomena, stabilization vs. flocculation mechanisms", "13 Nov 27th 8 Surface area and pore-size analysis", "I encourage you to buy one of these as it will be helpful for future reference.", "Intermolecular and Surface Forces, By Jacob N. Israelachvili, 3rdedition", "Intellectual property includes items such as:", "Graduate Attribute Program Indicators", "A knowledge base for engineering: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "1a Demonstrate understanding of concepts in mathematics.", "1b Demonstrate understanding of concepts in natural science.", "1c Demonstrate understanding of engineering fundamentals.", "1d Demonstrate understanding of specialized engineering knowledge.", "2. Problem Analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "3a Create investigative studies of complex engineering problems.", "3b Gather information from relevant sources to address complex engineering problems.", "4. Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "4a Define design requirements and specifications for complex, open-ended engineering problems.", "4b Critically evaluate and compare design choices.", "7. Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "8a Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Impact of Engineering: An ability to analyze social and environmental aspects of engineering activities.", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "10a Identify ethical and unethical behavior in professional situations.", "10b Identify how an engineer is accountable to multiple stakeholders in engineering practice.", "Life-long Learning: An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge.", "12a Identify gaps in their knowledge, skills and abilities."]}, {"course_id": 42, "course_code": "GENE 403", "course_name": "GENE403 - Interdisciplinary Design Project 1 (0.50)", "term_name": "4A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Email", "Tuesday 2:30pm-4pm & Thursday 10am-11am in MC 2037", "In the course they will formulate and communicate an interdisciplinary engineering problem or opportunity; develop a feasible design project proposal and plan; generate feasible solutions that address the formulated problem; evaluate alternatives and identify preferred solution; address safety, regulatory, sustainability and professional ethics requirements, as appropriate; effectively manage design project technical and non-technical risks using project management tools and techniques; deliver a report and/or a presentation that summarizes the work completed; work effectively as an interdisciplinary team member and/or team leader.", "View requirements for SCI 300", "On the heels of launching the Future Cities Institute, UW is offering a new special course: an interdisciplinary capstone course involving students and professors from multiple faculties working together to explore the complex challenges of Future Cities.", "In the first half of the course (Fall 2024), you will develop a deep understanding of the focal problem through months of thoughtful research, building the foundation for your project (e.g. problem definition, situation analysis, conducting a literature review, solutions identification and evaluation, and managing your team and your project and developing your communication skills).", "Where i-capstone differs is that you get to engage with other motivated learners from across faculties to leverage your unique perspectives, knowledge and skills, to contribute to solution-oriented projects that demonstrate mastery of problem-solving, critical thinking, and communication on a selected topic under the theme of Future Cities.", "Didactic vs Dialectic Instruction", "This is a solitary experience.", "Clearly define the interdisciplinary problem to be solved", "Identify multiple solutions that can address the focal problem", "Apply critical thinking, data collection and analysis skills to determine the optimal solution", "Understand a wide range of techniques, tools, skills, concepts, frameworks and professional practices from various disciplines", "Select and apply appropriate techniques, tools, skills, concepts, frameworks and professional practices for a particular project", "Introduction to i-Capstone", "Oct 9 Environmental Scan", "Mapping Actor and Leverage Points", "&", "Potential Solutions & Action Plan", "Divide & conquer often does not work well for capstone projects: the work needs to be integrated.", "Team friction/conflicts are a normal part of working life, and finding collaborative ways to resolve them is an important professional skill.", "The instructor can assist in helping the team find ways to move forwards together.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "Environmental Scan  Monday, October 21st", "You must specify the sections you want addressed and a rationale for why it deserves consideration, with specific reference to the rubric and assessment criteria.", "Only in exceptional cases will this penalty be waived!", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "This course includes the independent development and practice of specific skills, such as critical analysis and effective communication.", "Library for research-based assignments", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 43, "course_code": "NE 408", "course_name": "NE408 - Nanosystems Design Project (0.50)", "term_name": "4A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Nanosystems Design Project Fall 2024", "11:30AM - 12:20PM RCH 105", "Course Instructor & FYDP Coordinator:", "Office: E3-3141", "The Fourth Year Design Project is a three course sequence with NE307 “Introduction to Nanosystems Design” in the 3B term, NE408 “Nanosystems Design Project” in the 4A term, and NE409 “Nanosystems Design Project and Symposium” in the 4B term.", "You will work through the design process and the initial development and testing of your project.", "Define a specification for an engineering problem", "Develop a solution to a problem using the design process (including iterating to the solution)", "Work effectively on a team to tackle a technical problem", "Identify and analyze relevant health & safety, sustainability and economic aspects of an engineering project", "Perform experimental investigation appropriate to a design challenge, including selection and use of tools", "Perform literature investigation appropriate to a design challenge.", "Design Description", "Design Description", "Revised Project Plan & Milestones", "** Class meeting #3 ** in RCH 105", "Verification Plan", "Test Plan", "Design Verification & Stage 1 of Prototype Implementation:", "Progress Update", "Quality of technical communication 20%", "Design process execution and engineering analysis 30-35%", "4% Revised Project Plan & Milestones", "30-35% Design process execution and engineering analysis", "The file name must show the FYDP number as well as the submission number."]}, {"course_id": 44, "course_code": "NE 454A", "course_name": "NE454A - Nano-Electronics Laboratory 1 (0.25)", "term_name": "4A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 02:20PM QNC 2611", "08:30AM - 02:20PM QNC 2611", "08:30AM - 02:20PM QNC 2611", "08:30AM - 02:20PM QNC 2611", "08:30AM - 02:20PM QNC 2611", "08:30AM - 02:20PM QNC 2611", "NE454-A (Nano-electronics): design, simulation and prototyping of an oscillator circuit coupled with the design of an optimized PCB layout of the circuit that serves as a direct replacement for a commercial quartz crystal microbalance oscillator circuit.", "The PCB board will be populated with components, mounted in the QCM system and subjected to validation tests to determine if the design criteria for the circuit have been met in the follow-up laboratory sequence in NE 455A. Each student-designed oscillator circuit board will be compared directly, in a side-by-side comparison, with a commercial QCM system.", "Application of experimental tools and techniques in nano-electronics.", "Experimental exercises may involve circuit simulation and design, circuit prototyping, design of a driver circuit for a quartz crystal microbalance (QCM), printed circuit board (PCB) design and layout optimization, and the use of various characterization instrumentation.", "NE454-A (Nano-electronics): design, simulation and prototyping of an oscillator circuit coupled with the design of an optimized PCB layout of the circuit that serves as a direct replacement for a commercial quartz crystal microbalance oscillator circuit.", "The PCB board will be populated with components, mounted in the QCM system and subjected to validation tests to determine if the design criteria for the circuit have been met in the follow-up laboratory sequence in NE 455A. Each student-designed oscillator circuit board will be compared directly, in a side-by-side comparison, with a commercial QCM system.", "Examine the principles of oscillating circuits.", "Operate PSpice circuit simulation software tool to be familiar with its syntax.", "Create and design an optimized PCB layout using the EAGLECAD software, a package to prepare it for commercial fabrication.", "Communicate clearly and effectively in written and/or visual form through working in the lab and writing technical reports.", "F", "However, laboratory manuals are supplied online for each of the four laboratory exercise sequences.", "In-lab Report 1", "In-lab Report 3", "PCB Design Submission", "Total", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 45, "course_code": "NE 454B", "course_name": "NE454B - Nano-Instrumentation Laboratory 1 (0.25)", "term_name": "4A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Nano-Instrumentation Laboratory 1 Fall 2024", "08:30AM - 02:20PM E2 3344", "08:30AM - 02:20PM E2 3344", "08:30AM - 02:20PM E2 3344", "08:30AM - 02:20PM E2 3344", "08:30AM - 02:20PM E2 3344", "08:30AM - 02:20PM E2 3344", "Application of experimental tools and techniques involved in nanotechnology.", "Experimental exercises may involve simulation, design, optimization of micro-electro-mechanical-system (MEMS) devices, and the generation of a mask layout.", "Apply different modeling schemes to model MEMS devices", "Knowledge of multi-user processes", "Design MEMS devices which satisfy the requirements and constraints", "Able to use a layout software", "Generate a mask layout of MEMS devices based upon established design rules", "Topics to be covered in the laboratory sessions:", "Session 2 Individual design selections and work on all necessary lumped modeling and FEM analysis using COMSOL Multiphysics to evaluate the feasibility of device operation.", "Session 3  Hands-on training on Layout Editor software followed by mask layout generation of all successful MEMS actuator designs to be fabricated using the NE455B microfabrication process and based upon established design rules.", "Students should submit their reports in the Dropbox on UW Learn webpage."]}, {"course_id": 46, "course_code": "NE 454C", "course_name": "NE454C - Nanobiosystems Laboratory 1 (0.25)", "term_name": "4A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 02:20PM QNC 2614", "08:30AM - 02:20PM QNC 2614", "08:30AM - 02:20PM QNC 2614", "08:30AM - 02:20PM QNC 2614", "08:30AM - 02:20PM QNC 2614", "08:30AM - 02:20PM QNC 2614", "Arrange for assistance via email", "Arrange for assistance via email", "Application of experimental tools and techniques in nanobiotechnology.", "This lab deals with design and simulation of microfluidic devices used for the synthesis of nanoparticles.", "A biosensor will be designed and synthesized based on the enzymatic nanoparticle growth for determination of glucose in aqueous solutions.", "Different synthetic conditions and protocols, such as conventional synthesis and microfluidics, are employed; sizes of nanoparticles are characterized using dynamic light scattering and UV-Vis spectroscopy.", "Perform the synthesis of gold nanoparticles through chemical reduction of gold salts.", "Characterize nanoparticle sizes using dynamic light scattering and UV-Vis spectroscopy and study the effect of different reducing agents on the size of the nanoparticles.", "Design a biosensor through the enzymatic growth of the gold nanoparticles to monitor biological processes.", "Design of microfluidic devices and fabricate microfluidic channels in order to modify the synthesis of gold nanoparticles.", "Session 1: Introduction to microfluidic synthesis of nanoparticles and COSMOL design of microfluidic channels.", "Design a biosensor through the enzymatic growth of the gold nanoparticles to quantitatively determine glucose concentration in an aqueous solution.", "Session 3: Design and fabrication of microfluidic channels, followed by synthesis of gold nanoparticles using microfluidic channels.", "However, laboratory manuals are supplied online for each of the four laboratory exercise sequences.", "**Note:", "Although most laboratory exercises are performed in groups, marks are allocated individually in each laboratory session for in-laboratory performance and laboratory notebook record keeping.", "Make-up laboratory sessions will generally not be accommodated in the absence of extenuating circumstances as assessed by the Laboratory Instructor or without a valid medical certificate.", "The presentation template can be found on LEARN.", "Library for research-based assignments"]}, {"course_id": 47, "course_code": "NE 454D", "course_name": "NE454D - Nanostructured Materials Laboratory 1 (0.25)", "term_name": "4A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["NE 454D", "Application of experimental tools and techniques in nanomaterials.", "View requirements for NE 454D", "The first stage is to image and analyze an aluminum oxide filtration membrane which is to be employed as a hard template for the synthesis of nanowires.", "A determination of the membrane porosity by analysis of SEM images allows the estimation of the electric charge needed in an electrolytic process to fill the pores with a chosen metal, ultimately allowing production of nanowires containing segments of different metals.", "Operate the SEM to image an aluminum oxide filtration membrane and nanowires structure using different SEM outputs.", "Analyze the SEM picture using ImageJ software and estimate porosity.", "Design an appropriate nanowire composition and synthesis protocol", "Use electrolytic plating methods for wire production.", "Recommend an updated model with improved accuracy for filling nano-pores", "Communicate clearly and effectively in oral, written and/or visual form through working in a lab team and writing technical", "Week 2 in QNC", "Although most laboratory exercises are performed in pairs, marks are allocated in each laboratory session for in-laboratory performance and laboratory notebook record keeping for each individual student."]}, {"course_id": 48, "course_code": "GENE 404", "course_name": "GENE404 - Interdisciplinary Design Project 2 (0.50)", "term_name": "4B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Interdisciplinary Design Project 2 Winter 2025", "At the end of this course students will be able to re-formulate and re-communicate an engineering problem or opportunity (as appropriate); revise and communicate a feasible design project plan; revise solutions that address the formulated problem (as appropriate); implement and verify design solutions by analysis, test or prototype; communicate design solutions using accepted data formats, working documents and oral presentations; address safety, regulatory, sustainability and professional ethics requirements, as appropriate; effectively manage and communicate design project plans, technical and non-technical risks, using project management tools and techniques; work effectively as an interdisciplinary team member and/or team leader.", "View requirements for SCI 300", "On the heels of launching the Future Cities Institute, UW is offering a new special course: an interdisciplinary capstone course involving students and professors from multiple faculties working together to explore the complex challenges of Future Cities.", "In the first half of the course (Fall 2024), you will develop a deep understanding of the focal problem through months of thoughtful research, building the foundation for your project (e.g. problem definition, situation analysis, conducting a literature review, solutions identification and evaluation, and managing your team and your project and developing your communication skills).", "Where i-capstone differs is that you get to engage with other motivated learners from across faculties to leverage your unique perspectives, knowledge and skills, to contribute to solution-oriented projects that demonstrate mastery of problem-solving, critical thinking, and communication on a selected topic under the theme of Future Cities.", "Didactic vs Dialectic Instruction", "This is a solitary experience.", "Parts for Physical Prototypes", "Clearly define the interdisciplinary problem to be solved", "Identify multiple solutions that can address the focal problem", "Apply critical thinking, data collection and analysis skills to determine the optimal solution", "Understand a wide range of techniques, tools, skills, concepts, frameworks and professional practices from various disciplines", "Select and apply appropriate techniques, tools, skills, concepts, frameworks and professional practices for a particular project", "Available in the library No", "Divide & conquer often does not work well for capstone projects: the work needs to be integrated.", "Team friction/conflicts are a normal part of working life, and finding collaborative ways to resolve them is an important professional skill.", "-", "-", "Abstracts & team photo LEARN Feb 10", "3:30-7:30pm", "Final self & team member evaluation Peer Scholar via LEARN Apr 9", "End-of-Term Individual reflection & advice for younger cohorts PebblePad via LEARN Apr 9", "Disclaimer", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 49, "course_code": "NE 409", "course_name": "NE409 - Nanosystems Design Project and Symposium (0.50)", "term_name": "4B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Nanosystems Design Project and Symposium Winter 2025", "02:30PM - 03:20PM", "QNC 2502", "Course Instructor & FYDP Coordinator:", "The FYDP consultant is the primary point of contact for discussing technical and scientific issues at the various stages of the project.", "Completion and presentation of the design project from NE307 and NE408.", "Teams communicate their design in the form of a final report, a poster, and a seminar presentation.", "Define a specification for an engineering problem", "Develop a solution to a problem using the design process", "Work effectively on a team to tackle a technical problem", "Identify and analyze relevant health & safety, sustainability and economic aspects of an engineering project", "Perform experimental investigation appropriate to a design challenge, including selection and use of tools", "Perform literature investigation appropriate to a design challenge", "The instructor intends to meet with each team during the first 4 weeks of the term The scheduling of these meetings will be arranged by email", "*** Class meeting #1 ***", "*** Class meeting #2 ***", "Abstract", "Peer Evaluation form", "The title page should show your FYDP ID, title, and names of the team members and the consultant", "The first page should give a brief description of the progress made on your prototype construction and testing, preferably in bullet form, since the submission of your NE408 Interim Report and until the date of completing the progress update.", "The second page should give a detailed account of each team member’s activities and contributions to the FYDP progress during the period covered by the Progress Update, and the hours spent in each activity.", "This information should be presented in a table of the format shown below.", "The total number of hours spent by each member should then be calculated and recorded at the bottom of the table as shown below.", "Total hrs: Member A: ….hrs", "Member C: ….hrs", "Member D: ….hrs", "Be prepared to submit a softcopy of the seminar slides in the designated dropbox and/or on computers in the seminars room.", "The final design specification (complete description of your design, including the design choices that were made and the engineering analysis underlying those choices)", "A complete account of design prototype construction and testing work as well as an analysis of test results vs “conceptual” verifications and establishing the level of success of the design in meeting customer requirements.", "These forms will be confidential and will not be shared with the other team members.", "More details will be provided at a later date but the evaluation will focus primarily on: 1) quality of the design specification (complete description of your design) and test plan, 2) engineering analysis (the analysis behind your design choices) 3) prototype construction & testing, 4) design verification/validation and success in meeting customer requirements, and 5) quality of technical communication.", "Safety", "The file name must show the FYDP number as well as the submission title.", "10) Information in the three progress updates may be used in assessing the level of contribution of each team member to the FYDP work (in terms of both the amount of time and the quality of contributions).", "A = (total number of hours spent by a team hour towards FYDP work / average total number of hours spent by the other team members)"]}]