[{"course_id": 98, "course_code": "ECE 360", "course_name": "ECE360 - Power Systems and Smart Grids (0.50)", "term_name": "List 1", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Power Systems and Smart Grids Fall 2024", "ECE 360", "ECE 360 001", "Office: E3-4111, Ext: 37063", "Email: GBommali@uwaterloo.ca", "Email: aomar@uwaterloo.ca", "Fundamentals of power systems, analysis techniques including power flow and symmetrical fault analyses, and the basics of distribution systems and smart grids.", "View requirements for ECE 360", "This course provides a comprehensive overview of power systems and smart grids, exploring their fundamental concepts, components, and operations.", "Students will gain insights into the generation, transmission, distribution, and utilization of electrical energy, as well as the emerging technologies and trends shaping the future of the power industry.", "Analyzing power systems is vital for their operation, utilizing techniques like Power Flow Analysis to monitor voltage and power flow and identify potential issues such as bottlenecks.", "Symmetrical Fault Analysis assesses system resilience against faults.", "Distribution systems, the final delivery point, incorporate smart grids that enhance functionality through technologies like smart meters, renewable energy integration, advanced communication networks, and energy storage solutions to improve efficiency, reliability, and sustainability of power distribution.", "Develop the capability to identify and analyze power systems encompassing generation, transmission, and distribution.", "Acquire the ability to integrate renewable energy sources into power systems and leverage smart grid technologies to enhance grid efficiency and modernization.", "Navigate the regulatory and economic aspects of power systems, adapting to changes in deregulation and energy economics.", "Develop strong problem-solving and innovative thinking skills to address the evolving needs of the energy sector.", "Acquire a solid foundation in the theoretical and practical aspects of power systems and smart grids, preparing for a successful career in electrical engineering.", "Power Systems: Power system structure: generation, transmission and distribution system, load profiles and characteristics; Deregulation; Smart grids.", "Per Unit System: importance of per unit system,  concept of base quantities, process of converting actual quantities to per unit values, per unit system for analyzing power systems.", "Fault Analysis and Protection: Three-phase symmetrical faults; Basic concepts of protection, elements of protection systems.", "Protection zones, Primary and backup protection, Protection system requirements, Protective relays, Application of protection systems.", "Distribution Systems: Distribution system configurations; Voltage drop and loss calculations; Shunt capacitors in distribution systems; Distribution automation", "Smart Grids: Philosophy and concept of smart grids, Smart homes and smart meters; requirements; concept of smart loads and customer engagement; self healing and restoration paths.", "Power Systems Analysis and Design, Glover , Sarma and Overbye, SI version, 5th Edition, Cengage Learning, 2012 No", "Come to the lab with a clear understanding of what you are meant to accomplish, or with clear questions, so that the teaching team can help you.", "Lab Study – 0: Lab Safety & Equipment Introduction", "Lab Study – 4: Power Systems Load Flow Studies", "Lab Study – 5: Short Circuit Analysis and Protection Simulations"]}, {"course_id": 99, "course_code": "ECE 373", "course_name": "ECE373 - Radio Frequency and Microwave Circuits (0.50)", "term_name": "List 1", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Radio Frequency and Microwave Circuits Fall 2024", "ECE 373", "ECE 373 001", "Email", "ECE 373:", "Review of transmission line and scattering matrix representation of radiofrequency (RF) circuits, multiport RF networks, modern RF and microwave planar technology, lumped and distributed microstrip circuits, microwave couplers, Hybrids, resonators, filters, Low-noise amplifiers (LNAs), RF oscillators and mixers, computer-aided design (CAD) tools for RF circuits, hybrid and monolithic RF circuits.", "View requirements for ECE 373", "Design and analyse RF passive circuits such as couplers, power dividers, and filters.", "Design and analyse of RF active circuits such as low noise amplifiers, oscillators and mixers.", "Get familiar with the usage of Advanced Design Tools for simulating RF circuits.", "Transmission line theories and generalized matrix representation of RF circuits", "Analysis of multiport RF networks", "Introduction to modern microwave planar technologies", "Lumped and distributed microstrip circuits", "Analysis of microstrip circuits", "Microstrip couplers, hybrids and impedance matching networks", "Microwave resonators and filters", "Design of RF low noise amplifiers (LNA’s)", "Design of RF oscillators and mixers", "Use of existing commercial CAD design tools for RF circuits", "Computer-Aided Design of Microwave Circuits [", "] K. C. Gupta, Computer-Aided Design of Microwave Circuits, Dedham, Mass.: Artech, No", "Microwave Transistor Amplifier: Analysis and Design [", "By the end of the labs, students will be able to use Keysight’s Advanced Design System (ADS) circuit and Electromagnetic (EM) simulator to simulate and design RF circuits.", "The list of circuits includes couplers, filters, and low noise amplifiers.", "Lab 1: Introduction to Keysight’s Advanced Design System (ADS) tool", "Lab 2: Passive Circuit Design", "Lab 3: Passive/Active Circuit Design", "Lab 4: S-parameter Measurements using Vector Network Analyser", "· No open-toed shoes or bare feet in the lab, and no running in the lab.", "Phone numbers for", "Ambulance and UW police are 911 & x22222, respectively.", "· See the poster near the door for first Aid/emergency procedures."]}, {"course_id": 100, "course_code": "ECE 320", "course_name": "ECE320 - Computer Architecture (0.50)", "term_name": "List 2", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 320", "Monday, Friday -", "10:00AM - 11:20AM E7 4417", "04:00PM - 05:20PM E7 4053", "* different hours will be announced for reading week, midterm week and the exam period", "Artem Klashtorny <aklashto@uwaterloo.ca>", "Office hours: Thursdays @ 4-5pm in E5-5131 starting in Week 9", "Office hours: Fridays @ 4-5pm in E5-4011 starting in Week 9", "Organization and performance of uniprocessors, pipelined processors, dynamically scheduled processors, parallel processors and multiprocessors; memory and cache structures; multiprocessor algorithms and synchronization techniques; special-purpose architectures.", "View requirements for ECE 320", "Out-of-Order Pipelines", "Dynamic scheduling, register renaming, speculative execution", "Data-Level Parallelism", "GPGPU programming, Many-Core processors", "Domain-Specific Computing", "Design and implement a pipelined scalar processor", "Explain the memory system including concepts of virtual memory, cache coherency and memory consisteny", "Understand trends and in computer architecture and quantitative-based design", "3 Sept 16-20 PD0** Make-up lec", "7 Oct 21-25 Midterm week***", "The lab project is to develop a pipelined RISC-V processor in Verilog and implement it on an FPGA.", "PD1-PD6 are done in groups of two.", "Communication and Q&A: piazza.com/uwaterloo.ca/fall2024/ece320"]}, {"course_id": 101, "course_code": "ECE 351", "course_name": "ECE351 - Compilers (0.50)", "term_name": "List 2", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 351", "ECE 351 001", "10:00AM - 11:20AM E7 4417", "08:30AM - 09:50AM E7 4417", "View requirements for ECE 351", "Write a circuit synthesizer and a circuit simulator for circuits described in a subset of VHDL.", "Learn the theoretical aspects of compilers and language design.", "Build a practical rudimentary compiler.", "Understand how language design can be seen as a general form of problem solving.", "-", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 102, "course_code": "ECE 356", "course_name": "ECE356 - Database Systems (0.50)", "term_name": "List 2", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Database Systems Fall 2024", "ECE 356", "ECE 356 001", "11:30AM -", "08:30AM - 09:50AM E7 4417", "Data models, file systems, database system architectures, query languages, integrity and security, database design.", "View requirements for ECE 356", "Relational databases empower the vast majority of dynamic websites as well as a variety of information management systems in private and public sector organizations.", "ECE356 explores the concepts and techniques that make such databases convenient, efficient, and reliable.", "The course additionally includes an introduction to data mining and NoSQL.", "model data using entity-relationship (ER) diagrams", "understand the relational model and design a relational schema for a data set", "execute SQL commands against a remote database using Java Database Connectivity (JDBC)", "identify integrity constraints and functional dependencies in data", "apply the theory of database normalization to optimize the design of a relational schema", "understand the basics of transaction execution, concurrency control, and recovery in databases", "understand SQL injection attacks, as well as password hashing and salting", "perform simple data mining and analytics operations on real data sets", "design a denormalized schema for a NoSQL database", "September 4-10 intro, relational model SSH, mysql command line tool     first week of classes", "September 11-17 relational algebra, SQL relational algebra", "October 2-8 normalization normal forms and normalization", "Exams", "A make-up final exam, if offered by the instructor, may be scheduled in a future academic term.", "The instructor will not offer a make-up midterm, and will instead consider shifting the weight of a missed midterm towards the final exam.", "Members of the teaching team may also evaluate students' proficiency in the use of software in connection with lab work.", "If a student's solution differs substantially from the solution recognized by the teaching team, the student may be asked to provide sample inputs and outputs to evaluate the correctness of their solution.", "Collaboration", "Exams may cover both theory and practice, including your ability to read and write SQL code.", "Notice of Recording"]}, {"course_id": 103, "course_code": "ECE 358", "course_name": "ECE358 - Computer Networks (0.50)", "term_name": "List 2", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 358", "10:00AM - 11:20AM E7 4417", "Email", "Prof. Catherine Rosenberg", "Mike Cooper-Stachowsky", "Substitute Instructor", "Dr. Abdalla Mohamed Hussein", "Maryam Amini", "maryam.amini@uwaterloo.ca", "yuan.quan@uwaterloo.ca", "Mohammad Abuyaghi", "This course is a comprehensive introduction to computer networks.", "View requirements for ECE 358", "Revised Description: This course is a comprehensive introduction to computer networks.", "The lower-level outcomes are:", "Have a good understanding of protocols and networking design concepts.", "Have a working knowledge of socket programming.", "Have a working knowledge of transport protocols with a special emphasis on TCP and retransmission protocols.", "Example of LAN technologies: Ethernet and switches.", "Synthesis: a day in the life of a web request", "LAB1: Development of a simulator of a single transmission system.", "Examination", "If you miss the midterm without a valid reason, that midterm earns a score of zero.", "Lab marking and reports submissions", "Instructions for how to package your files and submit are in the lab manuals."]}, {"course_id": 104, "course_code": "CS 445", "course_name": "CS445 - Software Requirements Specification and Analysis (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Software Requirements Specification and Analysis Winter 2025", "10:00AM - 11:20AM MC 2035", "Email:x784chen@uwaterloo.ca", "Email: ar2elsha@uwaterloo.ca", "Email: d3pang@uwaterloo.ca", "Models, notations, and processes for software requirements identification, representation, analysis, and validation.", "ECE 451: View requirements for ECE 451", "The week of", "Deliverables", "1 Introduction", "3 RE Reference Model", "Jan 13 4 Domain Model 4 Domain Model D0 – Group members & Project idea", "Jan 27 7 Functional Modelling 8 OCL D1 – Domain Model & Stakeholders", "Feb 10 10 Quality Requirements 10 Quality Requirements D2 -  Use case Diagram & Description", "Feb 24 11 Requirements Conflict management 12 Prioritizing Requirements D3 – Functional Model & OCL", "Mar 3 13 Cost Estimation 14 Risk Analysis D4 – State Diagram", "Mar 17 15 Temporal Logic 16 Validation and Verification D5 – Cost Estimation & Risk Analysis", "Mar 31 17 Software Project Management 18 Requirement Engineering for AI Systems D6 - Quality Attributes and Temporal Logic", "Ability to separate requirements from specifications from domain assumptions and argue that a specification + domain assumptions satisfy requirements", "Ability to model requirements in a variety of modelling paradigms", "Ability to elicit and document non-functional requirements such that the to-be-developed software can be objectively tested for their satisfaction", "Ability to use tools to manage a Software Development Team.", "Why is requirements analysis complex?", "Functions as a modelling notation.  Pre- and post-conditions.", "Use-case diagrams.", "Functions over a class diagram.", "Modelling dynamic behaviour of a software system.", "UML State Machines.", "Specification patterns.", "7: Model Integration (1 hour)", "The expected contents and organization of a Software Requirements Specification (SRS).", "AI vs non-AI Systems based on what we covered in this course.", "Braek and Haugen, Engineering real-time systems: an object-oriented methodology using SDL, Prentice-Hall, 1993.", "Larman, Applying UML and Patterns, Prentice Hall, 2004.", "Maciaszek, Requirements Analysis and System Design, Addison Wesley, 2001.", "Bray, An Introduction to Requirements Engineering, Addison-Wesley, 2002.", "Nuseibeh and Zave, Software Requirements and Design:", "van Lamsweerde, Requirements Engineering: From System Goals to UML Models to Software Specifications, Wiley, 2009.", "Brooks, The Design of Design, Addison Wesley, 2010.", "Alan Davis, Just Enough Requirements Management: Where Software Development Meets Marketing, Dorset House Publishing, 2005.", "The project can be related to requirements engineering or a more general software engineering topic.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 105, "course_code": "CS 446", "course_name": "CS446 - Software Design and Architectures (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Software Design and Architectures Winter 2025", "10:00AM - 11:20AM MC 1056", "10:00AM - 11:20AM MC 1056", "10:00AM - 11:20AM MC 1056", "- Saarang Agarwal <saarang.agarwal@>", "- Bihui Jin <bihui.jin@>", "- Daniel Phan <daniel.phan@>", "- Amber Wang <jiale.wang@>", "ECE 452: View requirements for ECE 452", "Differentiate how various architectural styles and design patterns enhance and degrade a system’s functional, non-functional and human value properties;", "Create and implement an architecture and design, refining it into a complete system;", "1 Jan 06 Mon Introduction to Class", "Jan 15 Wed Use Cases, Human Values", "Jan 17 Fri **P0** Team Formation", "Jan 31 Fri **P2** Project Proposal", "Feb 12 Wed **P3** Iteration 1 Demo", "Feb 26 Wed Design Patterns 2 - Structural", "9 Mar 03 Mon Design Patterns 3 - Behavioral", "Mar 05 Wed **P4** Iteration 2 Demo", "10 Mar 10 Mon Design Patterns 4", "Mar 19 Wed **P5** Iteration 3 Demo", "Apr 02 Wed **P6** Final Presentation", "Apr 04 Fri **P7** Final Report", "Jan 17 P0: Team Formation -", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 106, "course_code": "CS 447", "course_name": "CS447 - Software Testing, Quality Assurance, and Maintenance (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "04:00PM - 05:20PM", "Weiyi Shang <wshang@uwaterloo.ca>", "Introduces students to systematic testing of software systems.", "ECE 453: View requirements for ECE 453", "Organized testing can help identify problems in software systems, enabling developers to fix these problems.", "And easier-to-test software is better software.", "• You will be able to create and evaluate test suites for reasonably-sized software systems.", "• You will learn how to effectively test during the software engineering process.", "Creating tests", "Test minimization", "Week 12 March 27th Field testing", "Late policy: every person can have a late (max 24 hours) deliverable once", "Notice of Recording"]}, {"course_id": 107, "course_code": "ECE 406", "course_name": "ECE406 - Algorithm Design and Analysis (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Algorithm Design and Analysis Winter 2025", "ECE 406", "ECE 406 001", "11:30AM -", "E. Creager", "04:00PM - 05:20PM", "E. Creager", "04:00PM - 05:20PM", "• Rushabh Solanki", "ECE 406:", "Design and analysis of efficient, correct algorithms.", "Advanced data structures, divide-and-conquer algorithms, recurrences, greedy algorithms, dynamic programming, graph algorithms, search and backtrack, inherently hard and unsolvable problems, approximation and randomized algorithms, and amortized analysis.", "View requirements for ECE 406", "How to design efficient algorithms using divide and conquer, greedy algorithms, and dynamic programming.", "The kinds of problems that can be solved with linear programming, and why they can be solved efficiently.", "What it means to reduce one problem to another, and how it used in complexity analysis", "Introduction to algorithms Chapter 0 0.5 hours", "Divide and conquer algorithms Chapter 2 5 hours", "Graphs, decompositions and depth-first search Chapter 3 3 hours", "Linear Programming: Simplex algorithm, duality theorem Chapter 7 4 hours", "No lectures during ECE midterms week (Feb 24--28)", "LEC001] Tue 2:30--3:30pm in E7-5353", "Assignments Information and Guidelines: Assignments are given roughly every other week, and their primary goal is to give you practice in designing and analyzing algorithms.", "You must list these collaborators at the top of the first page of your assignment (there is no penalty for listing collaborators, but it ensures we do not falsely identify plagiarism).", "In submitting an assignment, you are “signing off on your work” as described in the academic integrity form at https://uwaterloo.ca/academic-integrity/. The penalty for a first plagiarism offence is -100% for the assignment.", "* Each student must turn in a signed academic integrity form to confirm their understanding of the above policies.", "Notice of Recording"]}, {"course_id": 108, "course_code": "ECE 409", "course_name": "ECE409 - Cryptography and System Security (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Cryptography and System Security Winter 2025", "04:00PM - 05:20PM", "08:30AM - 09:50AM E7 5353", "Introduction to cryptology and computer security, theory of secure communications, points of attack, conventional cryptographic systems, public key cryptographic systems, standards, firewalls, wireless system security, applications.", "View requirements for ECE 409", "This course will provide introduction to  cryptography and system security.", "It covers  basic concepts in cryptography and system security,   types of attacks, trust and threat models,  pseudorandomness, computational security,  symmetric-key  cryptography,  public-key cryptography,   attacks on cryptographic operations,   network security protocols,   wireless system security and privacy,  applications in IoT systems,   special topics on  privacy preserving  AI,   quantum key  distribution and post-quantum cryptography.", "Explain the principles of cryptography and system security.", "Explain how practical schemes of symmetric-key cryptography and public-key cryptography are designed and implemented.", "Analyze the security and privacy protections in wireless systems and their applications in IoT.", "Apply security principles to solve problems in concrete applications.", "Introduction  to Cryptography  and System Security", "Cryptography and cryptanalysis", "Basic protections: encryption and authentication", "Classification of cryptosystems", "Basic  concepts of secure systems.", "Types of attacks,  trust and threat model", "Computational security and one-way functions", "Chapter 3. Symmetric-key Cryptographic Systems", "Arithmetics of binary finite fields", "Secure hash functions: SHA1, SHA2 and SHA3", "MAC and forgery attack", "Time-memory trade-off attacks and attacks by AI", "Public-key Cryptographic Systems", "Arithmetic operations", "Security of public-key cryptography (factorization, DL, LWE)", "Practical public-key systems (DH, RSA, DSA, ECC)", "Fault side-channel attacks", "Network Security Protocols", "Implementing secure systems:  PKI  and  X.509 certificates", "Hop-by-hop versus end-to-end protections and VPN", "Chapter 6. Wireless System Security", "5G security architecture for IoT security and privacy", "Privacy preserving machine learning: secret sharing; securing federate learning", "Basic concepts for quantum cryptography", "Quantum key distribution", "Post-quantum cryptography", "Communication System Security L.L. Chen and G. Gong", "R. Anderson, Security Engineering A Guide to Building Dependable Distributed Systems, Wiley, 2014 (Anderson14).", "Schneier on Security, http://www.schneier.com/blog/. A blog covering current computer security and privacy issues.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 109, "course_code": "ECE 414", "course_name": "ECE414 - Wireless Communications (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 414", "ECE 414 001", "Transmission and reception techniques for wireless channels.", "Fundamentals of cellular communications and multiple-access schemes.", "understand the basic characteristics of wireless channels.", "appreciate the fundamental role of diversity in wireless communications.", "have a deep understanding of different transmission and reception techniques.", "have a basic understanding of cellular systems.", "analyze and compare the performance of different coding schemes."]}, {"course_id": 110, "course_code": "ECE 416", "course_name": "ECE416 - Advanced Topics in Networking (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Advanced Topics in Networking Winter 2025", "TBA", "TBA", "TBA", "Access code to sign up (if not already enrolled): ece416-w25", "View requirements for ECE 416", "Understand the structure, addressing, and operational aspects of IPv6, and evaluate its advantages over IPv4 in addressing scalability and security challenges", "Understand the principles of Quality of Service (QoS) in networking, including techniques and protocols used to manage bandwidth, reduce latency, prioritize traffic, and ensure reliable data transmission for diverse applications.", "Examine the concepts of mobility in 4G and 5G networks, including tunnel routing mechanisms, and assess their impact on network performance and application delivery.", "Investigate IoT architectures, protocols, and security challenges, and understand their applications in smart environments and industrial systems.", "Conduct research-driven projects on advanced networking topics, present findings through technical papers and presentations, and engage in constructive peer discussions", "Introduction and review of ECE 358", "Introduction to Security in Computer Networks", "Software defined networks", "Security in Computer Networks (Will be split across different layers)", "Month", "F", "Deliverables", "Multiple dropboxes has been created for your submissions as follows:", "Partial/full solutions for these problem sets will be posted on the course website.", "This course includes the independent development and practice of specific skills, such as writing a white paper.", "Library for research-based assignments"]}, {"course_id": 111, "course_code": "ECE 417", "course_name": "ECE417 - Image Processing (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Image Processing Winter 2025", "Monday, Friday -", "Topics include intensity transformations for image enhancement, two-dimensional discrete Fourier transform, spatial and frequency domain linear image filtering, nonlinear image filtering, binary image processing, edge detection, image segmentation, and digital video processing basics.", "View requirements for ECE 417", "This course also includes advanced topics including statistical and perceptual image modeling and processing; and compression, streaming, robustness, and scalability issues in visual communications.", "Understand basic theories and methodologies of digital image processing", "Digital image and video processing: Intensity transformations for image enhancement; spatial domain linear filtering; frequency domain linear filtering; nonlinear image filtering; image sampling and interpolation; motion and digital video processing.", "Image analysis and understanding: Edge detection; image segmentation; energy preserving and energy compaction; principle component analysis and independent component analysis; sparse representations; wavelet and multiresolution image analysis; non-linear image analysis.", "Statistical and perceptual image modeling and processing: Spatial domain image statistics; Fourier domain statistical image models; wavelet domain statistical image models; Markov random field models; computational models of the human visual system; perceptual image quality assessment and processing; data-driven and learning-based image processing algorithms.", "Visual communications: compression, quality, streaming, robustness and scalability: Video compression and standards; quality-of-service and quality-of-experience; adaptive video streaming; error resilient visual coding and communications; scalable image and video coding and communications.", "Electronic copies of lectures and study materials will be provided at course web site.", "Additional references include research papers published in journals, conferences and open-source archives that can be found online.", "Homework assignments are not graded but will be helpful for students to understand basic image processing concepts and algorithms, and will also be helpful for the preparation of the final exam.", "A research project that attempts some new investigations in a specific direction.", "The project presentation slides and reports should be submitted via Dropboxes at LEARN."]}, {"course_id": 112, "course_code": "ECE 423", "course_name": "ECE423 - Embedded Computer Systems (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Embedded Computer Systems Winter 2025", "04:00PM - 05:20PM", "Emon Sarkar esarkar@uwaterloo.ca", "Specification and design of embedded systems, specification languages, hardware/software co-design, performance estimation, co-simulation, verification, validation, embedded architectures, processor architectures and software synthesis, system-on-a-chip paradigm, retargetable code generation and optimization, verification and validation, environmental issues and considerations.", "View requirements for ECE 423", "Part I: Introduction", "Part II: Embedded Systems and SoC Design", "4.5", "Part VII: Embedded Architecture: System Architecture", "4.5", "Part X: System Software for Embedded Multicores", "The deliverables for each assignment consist of a demo and a report.", "Help sessions will be scheduled in the lab room E2 2356A every week, starting on the second week of classes and excluding reading week, on the following day and time: Wednesday 2:00PM-5:00PM.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 113, "course_code": "ECE 432", "course_name": "ECE432 - Radio Frequency Integrated Devices and Circuits (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Radio Frequency Integrated Devices and Circuits Spring 2024", "08:30AM - 09:50AM E7 4433", "S. Su", "04:00PM - 05:20PM", "An introduction to the theory and practice of Radio Frequency (RF) Integrated Circuit design.", "Physics and modelling of RF integrated components such as resistor, inductor, capacitor (RLC) passives, diodes, metal oxide semiconductor field-effect transistors (MOSFETs), high electron mobility transistors, hetero-junction bipolar transistors.", "An introduction to radio frequency and high-speed integrated circuit design.", "Topics include physics and modelling of passive components (diode, R, L, C, transformer, and transmission line) and transistors (MOSFETs and BJTs) on a silicon chip; design of transistor-level circuit building blocks, including wideband/tuned amplifiers, frequency synthesizers (e.g., oscillators, phase-locked loops), mixers and multipliers, power amplifiers, filters; signal processing and conditioning techniques and analysis of modern communication and computing systems.", "Innovative and complete designs may be good candidates for peer-reviewed publications in IEEE CASS and SSCS.", "Students will use industry-standard design tools and flows, with potential for top designs to be ported to advanced CMOS technologies, fabricated, and measured at UWaterloo.", "Analyze and design the main circuit blocks of a modern transceiver", "Specify components, circuits and sub-systems for use in high-speed/RF circuits", "Describe the behavior of RF and high-speed systems in terms of sensitivity, dynamic range, etc.", "Device Physics and Modeling (Diode, MOS and BJT)", "Amplifiers (Basic Topologies and Biasing) Homework 1", "Impedance Matching and Filters Homework 2", "Tuned Amplifiers (Narrowband LNAs) Lab 3", "Communication and Computing Systems Lab 4", "Signal Processing and Modulation Techniques Homework 4", "Mixers and Multipliers Lab 5", "Power Amplifiers, Nonlinearity and Distortion Homework 5", "A. S. Sedra & K. C. Smith, Microelectronic Circuits 8th edition Yes", "laptop/desktop used for simulations Yes", "If you miss both exams, it will be handled on a case-by-case basis."]}, {"course_id": 114, "course_code": "ECE 433", "course_name": "ECE433 - Fabrication Technologies for Micro and Nano Devices (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Fabrication Technologies for Micro and Nano Devices Spring 2024", "ECE 433", "ECE 433 001", "04:00PM - 05:20PM", "ECE 433:", "Plasma-assisted and wet-chemical etch processes.", "Fabrication processes for transistors, complementary metal-oxide semiconductor (CMOS), and thin film devices.", "Micro-electro-mechanical systems (MEMS) technology.", "Process techniques for nanoelectronic devices.", "Explain how plasma discharges and how to create them.", "Determine junction formation processes for microelectronic device needs.", "Explain nanopatterning principles and limits of optical lithography.", "Section 6: Optical Lithography and its limits", "Section 10: Transistor and CMOS Fabrication", "Fabrication lab visits Mandatory"]}, {"course_id": 115, "course_code": "ECE 444", "course_name": "ECE444 - Integrated Analog Electronics (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Integrated Analog Electronics Winter 2025", "11:30AM -", "04:00PM - 05:20PM", "08:30AM - 09:50AM E7 4433", "Email", "Analog electronics exploits the physical behaviour of electronic devices to create electronic systems.", "The performance of single and multiple transistor amplifying stages are studied.", "Followed by a study of biasing, current mirror, and output stages, which are then combined in the study of operational amplifier circuits.", "Frequency response and feedback are then reviewed leading to a detailed study of stability and compensation for multistage and operational amplifiers.", "View requirements for ECE 444", "Analog integrated circuits (ICs) exploit the physical behaviour of electronic devices to create electronic systems.", "We will study the performance of single- and multiple-transistor amplifying stages.", "This is followed by a study of biasing, current mirrors, and output stages, which are then combined in the study of operational amplifiers.", "We then review frequency response and feedback, leading to a detailed study of stability and compensation for multistage and operational amplifiers.", "We will mostly study complementary metal-oxide-semiconductor (CMOS) circuits, but will use bipolar junction transistors (BJTs) for certain applications.", "The course finishes with a look at switched-capacitor circuits and data converters, including analog-to-digital converters (ADCs) and digital-to-analog converters (DACs).", "The knowledge and skills you will learn in this course will prepare you to:", "Pursue graduate studies in IC design (this is usually necessary to work as an IC designer in industry).", "Analyze and design some common analog IC components.", "Model and simulate analog IC components at different levels of abstraction.", "MOSFETs: regions of operation, small-signal models, body effect, weak inversion, intrinsic gain, and transition frequency", "Cascode operational transconductance amplifiers (OTAs) and Gm-C filters", "Current and voltage references", "CMOS two-stage OTA and frequency compensation", "Power amplifiers and output stages", "Data converters", "**NOTE:", "Closed book and closed notes", "Non-programmable, non-graphing scientific calculator is allowed", "A formula sheet will be provided", "The labs involve using LTspice from Analog Devices to design and simulate various circuit blocks using a commercially-available CMOS IC technology.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as circuit simulation.", "Library for research-based assignments"]}, {"course_id": 116, "course_code": "ECE 445", "course_name": "ECE445 - Integrated Digital Electronics (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Integrated Digital Electronics Spring 2024", "Monday, Friday -", "04:00PM - 05:20PM E7 4043", "Complementary Metal-Oxide Semiconductor (CMOS) inverter; combinational CMOS circuit design - logic styles for low power, high performance circuits; sequential CMOS circuit design - flip-flops, pipelines, Schmitt trigger; CMOS arithmetic circuits; interconnect parasitic; clocking and timing considerations in digital Very Large Scale Integration (VLSIs).", "Design digital MOS integrated circuit logic circuits", "MOS Transistor"]}, {"course_id": 117, "course_code": "ECE 451", "course_name": "ECE451 - Software Requirements Specification and Analysis (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Software Requirements Specification and Analysis Winter 2025", "10:00AM - 11:20AM MC 2035", "Email:x784chen@uwaterloo.ca", "Email: ar2elsha@uwaterloo.ca", "Email: d3pang@uwaterloo.ca", "Models, notations, and processes for software requirements identification, representation, analysis, and validation.", "ECE 451: View requirements for ECE 451", "The week of", "Deliverables", "1 Introduction", "3 RE Reference Model", "Jan 13 4 Domain Model 4 Domain Model D0 – Group members & Project idea", "Jan 27 7 Functional Modelling 8 OCL D1 – Domain Model & Stakeholders", "Feb 10 10 Quality Requirements 10 Quality Requirements D2 -  Use case Diagram & Description", "Feb 24 11 Requirements Conflict management 12 Prioritizing Requirements D3 – Functional Model & OCL", "Mar 3 13 Cost Estimation 14 Risk Analysis D4 – State Diagram", "Mar 17 15 Temporal Logic 16 Validation and Verification D5 – Cost Estimation & Risk Analysis", "Mar 31 17 Software Project Management 18 Requirement Engineering for AI Systems D6 - Quality Attributes and Temporal Logic", "Ability to separate requirements from specifications from domain assumptions and argue that a specification + domain assumptions satisfy requirements", "Ability to model requirements in a variety of modelling paradigms", "Ability to elicit and document non-functional requirements such that the to-be-developed software can be objectively tested for their satisfaction", "Ability to use tools to manage a Software Development Team.", "Why is requirements analysis complex?", "Functions as a modelling notation.  Pre- and post-conditions.", "Use-case diagrams.", "Functions over a class diagram.", "Modelling dynamic behaviour of a software system.", "UML State Machines.", "Specification patterns.", "7: Model Integration (1 hour)", "The expected contents and organization of a Software Requirements Specification (SRS).", "AI vs non-AI Systems based on what we covered in this course.", "Braek and Haugen, Engineering real-time systems: an object-oriented methodology using SDL, Prentice-Hall, 1993.", "Larman, Applying UML and Patterns, Prentice Hall, 2004.", "Maciaszek, Requirements Analysis and System Design, Addison Wesley, 2001.", "Bray, An Introduction to Requirements Engineering, Addison-Wesley, 2002.", "Nuseibeh and Zave, Software Requirements and Design:", "van Lamsweerde, Requirements Engineering: From System Goals to UML Models to Software Specifications, Wiley, 2009.", "Brooks, The Design of Design, Addison Wesley, 2010.", "Alan Davis, Just Enough Requirements Management: Where Software Development Meets Marketing, Dorset House Publishing, 2005.", "The project can be related to requirements engineering or a more general software engineering topic.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 118, "course_code": "ECE 452", "course_name": "ECE452 - Software Design and Architectures (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Software Design and Architectures Winter 2025", "10:00AM - 11:20AM MC 1056", "10:00AM - 11:20AM MC 1056", "10:00AM - 11:20AM MC 1056", "- Saarang Agarwal <saarang.agarwal@>", "- Bihui Jin <bihui.jin@>", "- Daniel Phan <daniel.phan@>", "- Amber Wang <jiale.wang@>", "ECE 452: View requirements for ECE 452", "Differentiate how various architectural styles and design patterns enhance and degrade a system’s functional, non-functional and human value properties;", "Create and implement an architecture and design, refining it into a complete system;", "1 Jan 06 Mon Introduction to Class", "Jan 15 Wed Use Cases, Human Values", "Jan 17 Fri **P0** Team Formation", "Jan 31 Fri **P2** Project Proposal", "Feb 12 Wed **P3** Iteration 1 Demo", "Feb 26 Wed Design Patterns 2 - Structural", "9 Mar 03 Mon Design Patterns 3 - Behavioral", "Mar 05 Wed **P4** Iteration 2 Demo", "10 Mar 10 Mon Design Patterns 4", "Mar 19 Wed **P5** Iteration 3 Demo", "Apr 02 Wed **P6** Final Presentation", "Apr 04 Fri **P7** Final Report", "Jan 17 P0: Team Formation -", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 119, "course_code": "ECE 453", "course_name": "ECE453 - Software Testing, Quality Assurance, and Maintenance (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "04:00PM - 05:20PM", "Weiyi Shang <wshang@uwaterloo.ca>", "Introduces students to systematic testing of software systems.", "ECE 453: View requirements for ECE 453", "Organized testing can help identify problems in software systems, enabling developers to fix these problems.", "And easier-to-test software is better software.", "• You will be able to create and evaluate test suites for reasonably-sized software systems.", "• You will learn how to effectively test during the software engineering process.", "Creating tests", "Test minimization", "Week 12 March 27th Field testing", "Late policy: every person can have a late (max 24 hours) deliverable once", "Notice of Recording"]}, {"course_id": 120, "course_code": "ECE 454", "course_name": "ECE454 - Distributed Computing (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Distributed Computing Spring 2024", "ECE 454", "ECE 454 001", "10:00AM - 11:20AM E7 4043", "08:30AM - 09:50AM E7 4043", "04:00PM - 05:20PM E7 4043", "ECE 454 101", "07:00PM - 07:50PM E7 4043", "Teaching Team Member Role Office Email", "Dr. Tahsin Reza Instructor DC-2536 tahsin.reza@uwaterloo.ca", "ECE 454:", "Principles of distributed computing; architectures and middleware; servers, processes, and virtualization; upper-layer network protocols, interprocess communication and remote procedure calling; concurrency, synchronization and distributed algorithms, dependable distributed systems and fault tolerance.", "Antirequisite: Must not have taken or concurrently enrolled in CS 454/654 - Distributed Systems.", "Understand the architectures, protocols and algorithms underlying modern distributed systems.", "Understand fundamental techniques for making distributed systems scalable and dependable, and reason about design trade-offs.", "Use a scalable data processing framework to solve fundamental analytics problems.", "Use a fault-tolerant coordination service for configuration management, synchronization, and failure detection in a distributed software system.", "Use a stream processing engine to perform real-time analytics.", "Discuss the relative merits of distributed versus centralized systems.", "Distributed Systems 4th", "Unauthorized collaboration and copying of material constitute academic offences under Policy 71.", "If a student’s solution differs substantially from the solution(s) accepted by the teaching team the student may be asked to provide sample inputs and outputs to evaluate the correctness of their solution.", "Alternatively, the teaching team may accept a modified solution for regrading and apply a penalty.", "Unauthorized collaboration and copying of material constitute academic offences under Policy 71.", "Intellectual Property: Learning materials used in this course contain the intellectual property of current and past members of the teaching team.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 121, "course_code": "ECE 455", "course_name": "ECE455 - Embedded Software (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Embedded Software Spring 2024", "ECE 455", "Monday, Friday -", "11:30AM -", "04:00PM - 05:20PM E7 4043", "- Name: Sebastian Fischmeister", "- Email: sfischme@uwaterloo.ca", "- Name: Murray Dunne", "- Email: mdunne@uwaterloo.ca", "- Office hours: on demand in Microsoft Teams", "- Email: mdpintur@uwaterloo.ca", "- Office hours: on demand in Microsoft Teams", "ECE 455:", "This course covers computing elements, structures in embedded software, resource access protocols, uniprocessor scheduling, programming-language support, languages for MDD (model-driven development), worst-case execution time analysis, and overview of embedded distributed systems.", "Explain real-time systems and associated terms and vocabulary", "Perform schedulability checks for task on single-processor systems", "Perform worst-case execution time analysis", "Understand qualification and certification and the application of ISO 26262 in the automotive space", "Understand clock-driven scheduling", "Define and program temporal controls in programs", "Design fault tolerant systems", "M3: Embedded Systems Debugging", "M5: Worst-case Execution Time Analysis", "M6: Clock-driven Scheduling", "M7: Priority-driven Scheduling", "M9b: Failure Mode and Effects Analysis", "M10: Safety-critical Systems Standards", "M12: Embedded System Security", "Computers as Components: Principles of Embedded Computing System Design.", "Introduction to Embedded Systems: A Cyber-physical Systems Approach.", "Dependability: Basic concepts and terminology.", "Dependability: Basic Concepts and Terminology.", "In Handbook of Real-time and Embedded Systems.", "Notice of Recording"]}, {"course_id": 122, "course_code": "ECE 457A", "course_name": "ECE457A - Co-operative and Adaptive Algorithms (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Co-operative and Adaptive Algorithms Fall 2024", "ECE 457A", "E7 3343", "• Huda Diab Abdulgalil: Email hdiababd@uwaterloo.ca", "The course starts by addressing the ill-structured problems and need for computational intelligence methods.", "It introduces the concepts of heuristics and their use in conjunction with search methods, solving problems using heuristics and metaheuristics, constraints satisfaction.", "The course also introduces the concepts of co-operation and adaptations and how they are influencing new methods for solving complex problems.", "The course starts by illustrating how the concepts of co-operation and adaptation are manifested in nature and how such models are inspiring new types of solutions methods.", "Topics to be covered include search algorithms, game playing, constraints satisfaction, meta-heuristics, evolutionary computing methods, swarm intelligence, ant-colony algorithms, particle swarm methods, adaptive and learning algorithms and the use of these algorithms in solving continuous and discrete problems that arise in engineering applications.", "View requirements for ECE 457A", "Motivate the need for algorithms that exhibit a degree of intelligence: logical, computational, and biologically inspired.", "Introduce the concepts of cooperation and adaptations and how they are influencing new methods for solving complex problems.", "Illustrate the use of these algorithms in solving continuous and discrete, and machine learning problems", "Introduction: About this course, AI, Adaptation, Cooperation, goals and definitions of artificial intelligence;", "ill-structured problems and need for approximate algorithms, cooperation and adaptation in nature.", "Search: state space problem formulation and representation;", "use of heuristic search methods and meta-heuristic algorithms", "Trajectory Methods: Tabu search", "Engineering use cases", "Engineering use cases", "Mathematical Models of Genetic Algorithms", "Introduction to Swarm Intelligence: cooperation and adaptation methods inspired by nature.", "Engineering use cases", "Engineering use cases", "Evolutionary Programming: Continuous and Discrete EP", "Finite State Machine Optimization", "Evolutionary Strategies", "Self-Adaptive Evolution Strategies", "Introduction to evolutionary computing Introduction to evolutionary computing, by Eiben and A, Smith, J.E, Springer, Berlin, 2003.", "Search and Optimization by Metaheuristics Techniques and Algorithms Inspired by Nature Search and Optimization by Metaheuristics Techniques and Algorithms Inspired by Nature Ke-Lin Du, M. N. S. Swamy No", "Search Algorithms Types: Breadth and Depth First Search Algorithm Search Algorithms Types: Breadth and Depth First Search Algorithm Merium Hazem Anwar Labib Bishara, Merihan Hazem Anwar Labib Bishara No", "**The lecture notes are copy-right protected material.", "Such behaviour includes:", "Adhering to the principles of academic integrity when conducting and reporting research.”"]}, {"course_id": 123, "course_code": "ECE 457B", "course_name": "ECE457B - Fundamentals of Computational Intelligence (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Fundamentals of Computational Intelligence Winter 2025", "ECE 457B", "Monday, Friday -", "10:00AM - 11:20AM E7 5353", "04:00PM - 05:20PM", "Da Saem Lee : ds3lee@uwaterloo.ca", "Communication and Discussion", "If you really have a critical time issue, or you don't want the TA's to see the message (for any reason at all), then you should send Prof. Crowley a direct message on Teams chat in addition to email.", "Model-based prediction and classification.", "Multiple examples and case studies such as autonomous driving, intelligent manufacturing, natural language understanding, speech recognition, computer vision, stock market prediction, disease early detection and diagnosis.", "View requirements for ECE 457B", "It encompasses a broad spectrum of supervised learning topics, including nonparametric and parametric models, linear and nonlinear approaches, deep learning paradigms, and probabilistic models.", "Theoretical knowledge is translated into practice through tutorials on industry-standard tools such as PyTorch and Keras.", "Interactive classroom discussions will pivot around both the practical trade- offs inherent in real-world applications and the theoretical underpinnings that provide an intuitive grasp of the field.", "These topics are an outline, and each year some subset of non-core topics will be skipped due to time constraints and in order to benefit students through deeper focus.", "Classification I", "Distance based - k-Nearest Neighbours (kNN)", "Fundamentals of Parameter Estimation and Learning", "MAP Implementation as Classification: Naive Bayes Algorithm", "Dimensionality Reduction and Manifold Learning", "Vector Embeddings : TF-IDF, Word2Vec, BERT", "Kernel Methods and Latent Models", "k-Means Algorithm, DBScan Algorithm", "Anomaly Detection: Classification, Outlier, Density, and Isolation based", "Classification III : Data, Image and Time-series classification using Deep Learning", "Representation Learning II: Auto-encoders and Variational Auto-Encoders", "Attention and Transformer Networks", "Some additional information and links might be here for older courses.", "A visual grading tool for pdfs submissions of tests and assignments, allows limited online test with mark-down text entry and multiple choice questions.", "Some assignments and tests might be made available online for submission using this tool as well.", "Arxiv Tutorials - pdfs will be posted to hypothes.is and others links will be provided to a number of detailed tutorials on some course topics.", "The first half covers many of basics of this course, while the second half focusses on Deep Learning only.", "Exams", "Completing the assignments will require multiple skills:", "familiarity with statistical, probabilistic analysis of data and results", "logical design and clear description of a expeirmental methodology", "programming various algorithms for processing, training and analysis of data to achieve given tasks (programming will be in Python using libraries such as sci-kit learn and tensorflow, pytorch, pandas)", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 124, "course_code": "ECE 457C", "course_name": "ECE457C - Reinforcement Learning (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["04:00PM - 05:20PM E7 4043", "Introduction to reinforcement learning (RL) theory and algorithms for learning decision-making policies in situations with uncertainty and limited information.", "Suggested Background", "The course will use some concepts from ECE 203 and ECE 307 on Bayesian Probability and Statistics, these will be reviewed but familiarity will help significantly.", "All other concepts needed for the course will be introduced directly.", "Identify and Explain the component theoretical concepts of Reinforcement Learning systems.", "Evaluate the performance of a particular RL system on a given domain through proper experimental design, statistical analysis and visualization", "Assess and critique the applicability of general RL concepts and specific RL algorithms to various problem tasks in Data Science, Artificial Intelligence, Planning, Control, and Machine Learning.", "Motivation and Context", "Importance of reasoning and decision making about uncertainty.", "Decision making under uncertainty:", "Theory, Bellman equations", "Value Iteration, Policy Iteration", "Other variants of these", "Value Function Approximation", "supervised training, back-propagation", "Experience replay buffers, mini-batch training and other methods of training and architecture", "Actor-Critic methods", "Decision Transformers", "Other Uses of RL Concepts", "Human Preference Elicitation - especially for Foundation Models and Large Language Models", "Moral Psychology - theories on human moral reasoning rely heavily on RL concept", "Wrap-up and Review", "Dimitrakakis2019", "Once you get through the first half of our course, many of the concepts on this site will be familiar to you.", "Family Tree of Algorithms - Here, a list of algorithms at the cuttingedge of RL as of 1 year ago to so, so it'sa good place to find out more.", "But in a fast growing field, it may be a bit out of date about the latest now. https://spinningup.openai.com/en/latest/spinningup/rl_intro2.html", "Piazza : ECE457C Discussions - TBD", "A visual grading tool for pdfs submissions of tests and assignments, allows limited online test with mark-down text entry and multiple choice questions.", "Some assignments and tests might be made available online for submission using this tool as well.", "Assignment will involve a mixture of short answers, mathematical solutions, programming in python and reporting of results of performance and outcomes of trained RL policies on provided simulated environments.", "Recipe for success:", "University can be a challenging environment and it is normal to need support from time-to-time.", "see these slides on university policy for COVID-19 safety once in-person classes begin again.", "If the student has a medical reason why they cannot wear a mask they should contact the professor electronically and provide proof of this.", "Whena student asks or answersa question it may be difficult for them to be heard while wearing a mask.", "Students can find the Illness Self-declaration form in the  Personal Information section of Quest.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 125, "course_code": "ECE 458", "course_name": "ECE458 - Computer Security (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Monday, Friday -", "10:00AM - 11:20AM E7 4043", "04:00PM - 05:20PM E7 4043", "07:00PM - 07:50PM E7 4043", "ECE 750 001", "Monday, Friday -", "10:00AM - 11:20AM E7 4043", "04:00PM - 05:20PM E7 4043", "Dr Kami Vaniea", "Cameron Hadfield <cmlhadfield@uwaterloo.ca>", "Introduction to computer security.", "Models of security.", "Software security, vulnerabilities, threats, defenses and secure-software development processes.", "Secure design principles, techniques and security evaluation.", "ECE 750:", "If these are used, the instructor will make a best effort to record the lecture.", "Conflicts with these time slots are fine and should not prevent a student from doing well in the course.", "Recognise common security threats against computer systems and know the basic mechanisms to address them", "Think critically about security threats using the STRIDE model and break down the concept of \"security\" into its component parts", "Know the most common programming flaws and how they can manifest in code", "Explain what the lock icon near the URL bar means (or the \"connection is secure\" in Chrome)", "Read a URL correctly and learn why doing so in all cases is nearly impossible for humans", "Explain what a cookie is and why it gives people more control than advertising codes used by mobile phones", "Basics of Security - Thinking about security in a structured way (CH1)", "Trust and threat model", "Running example of HTTPS", "Introduction to Usable Security and Privacy", "Access control concepts", "Password based authentication", "Multi-factor authentication and passwordless authentication", "Kerberos and open-authorization", "Introduction to phishing (scam) attacks", "Cryptography Basics (CH2.3)", "Pseudorandom generation", "Symmetric-key vs Asymmetric cryptography", "Public-key cryptography and digital signature", "Malicious code - Malware", "Memory security", "Basics of network securityThis is", "Firewalls and VPN", "Security of IEEE 802.11 and 4G-LTE/5G", "Attacks on clients and servers", "Email security", "Applications", "Schneier on Security http://www.schneier.com/blog/ A blog covering current computer security and privacy issues.", "The lab contains many hand-on experiments and some crafted attacks can be launched under their speciﬁc environment for better understanding them.", "The instructor and/or TAs may use custom internally developed scripts to check for high overlap between coursework submissions.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 126, "course_code": "ECE 459", "course_name": "ECE459 - Programming for Performance (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 459", "Monday, Friday -", "08:30AM - 09:50AM E7 5353", "04:00PM - 05:20PM", "Monday, Friday -", "04:00PM - 05:20PM", "11:30AM -", "07:00PM - 07:50PM E7 5353", "07:00PM - 07:50PM E7 5353", "About Prof. Zarnett", "Then I got the AIF in the mail and decided I didn't want to study Computer Engineering after all.", "I'm an Associate Professor of Electrical and Computer Engineering.", "Some of you will know me as the previous Director of Software Engineering from back when you were in 1A. I studied math/CS yet convinced PEO to license me as a P.Eng.", "My research interests focus on using compiler and static analysis techniques to ensure program correctness.", "The LI is responsible for technical matters related to the assignments: git.uwaterloo.ca, git in general, administering the systems where you need to run your labs.", "And I enjoy engaging in discussions about these fields.", "Thanushon Sivakaran <tsivakar@uwaterloo.ca>", "Profiling computer systems; bottlenecks, Amdahl's law.", "View requirements for ECE 459", "Many modern software systems must process large amounts of data, either in the form of huge data sets or vast numbers of (concurrent) transactions.", "This course introduces students to techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs.", "These techniques will enable you to design and build critical software infrastructure, especially in an age of Big Data.", "While you may have seen some of these ideas in the context of operating systems (ECE350/SE350/CS350/MTE241) and concurrency (ECE252/CS343), this course gives you tools to make code run faster.", "Design and apply techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs.", "We intend to use these slots until we reach the end of the course material.", "The notes cite a number of sources, some of which are useful books.", "Rust familiarization and use of nonblocking I/O;", "Auto‐grading and auto‐feedback systems, including marmoset, may be used for the evaluation of some of your assignments.", "Acceptable collaboration includes discussing ideas and structures with others, as well as helping others debug their code.", "If your code is too close in structure to someone else's code, you are going to have a problem.", "Or, let's sum this up in two short instructions:", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, ChatGPT) and how such tools can be used to write and test code.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be diﬃcult to interpret on a discussion forum.", "The human visual system has evolved to perceive saber‐toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text‐mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 127, "course_code": "ECE 462", "course_name": "ECE462 - Electrical Distribution Systems (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electrical Distribution Systems Spring 2024", "ECE 462", "10:00AM - 11:20AM E7 4433", "04:00PM - 05:20PM", "This course provides the students an understanding of the operation, analysis, and design of electric power distribution systems, starting with estimation of the loads on the network to the detail design of the distribution system networks.", "The primary objective of the course is to provide students with the skills to understand the analytical and design methods and modern tools for solution of problems associated with electric distribution system engineering.", "This course teaches electric distribution system engineering planning and operation principles.", "Important concepts and various tools of distribution system engineering are discussed in this course.", "The topics covered in this course include the structure of the distribution systems in Ontario, smart grids, load characteristics & load metrics, distribution system feeder modelling, voltage drop and power loss calculations, distribution system reliability, voltage regulation and application of capacitor to distribution system.", "Understand distribution systems main components", "Realize the main elements of smart grids", "Perform the basic calculations related to distribution systems operation", "Recognize the modern tools to control the operation of distribution system", "Apply artificial intelligence tools to distribution systems applications", "Number of Weeks", "Distribution System and Smart Grid Overview", "Ontario Distribution Systems", "Sub-transmission systems", "Distribution Substation", "Primary Distribution", "Secondary distribution", "Smart Grids", "Load Characteristics and Metrics", "Distribution System Feeder Modelling", "Underground cables modelling", "Voltage Drop and Power Loss Calculations", "Voltage Drop Calculations Using Allocated Loads", "Voltage Drop Calculations Using the Approximate Method", "Voltage Drop Calculations Using the K Factors", "Voltage Drop Calculations Using the Exact Lumped Load Model", "Voltage Drop Calculations Using Lumping the Loads in Geometric Configurations", "Power Loss Calculations", "Distribution Systems Load Flow Analysis", "Distribution System Reliability", "Distribution Reliability", "Standard Reliability Metrics", "Methods to Improve Reliability", "Application of Voltage Regulators", "Quality of Service and Voltage Standards", "Voltage Regulation", "Step-Voltage Regulators", "Voltage Regulators Data and Ratings calculations", "Three-phase Voltage Regulators", "Application of Capacitors", "Power Factor Correction", "Fixed Shunt Capacitors", "Approach for Sizing Fixed Capacitance", "Capacitor Banks Switching Control", "Distribution System Modeling and Analysis, by Kerstin, W. H., CRC Press 2018, ISBN 9781498772136 Textboob No", "Distribution System Engineering: Salama Lecture Notes No", "Distribution System Modeling and Analysis, by Kerstin, W. H., CRC Press 2018, ISBN 9781498772136", "Electric Power Distribution Handbook’ Short, Thomas Allen Short, 2014, CRC Press, ISBN 1466598654", "Electric distribution systems Sallam, A. A. (Abdelhay A.) Hoboken, N.J. : Wiley-IEEE Press 2018, Online ISBN:9781119509332 Reference Book No", "Electric power engineering handbook 2nd ed.", "Electrical transmission and distribution reference book Fifth Edition, 1997 Electric Systems Technology Institute ABB Power T&D Company Reference Book No", "The transmission and distribution of electrical energy, 3d ed.", "Students do not need to submit their solutions of the assignments and these solutions carry no weight in the final course marks.", "The course project is a survey on one of the applications of artificial intelligence tools to distribution systems.", "The midterm exam is a multiple-choice test.", "The link for these live sessions will be posted for each lecture on LEARN Calendar", "Students are expected to attend all online live lectures for learning and skill development", "In this case, the above marking scheme may be adjusted.", "Students will be notified of any changes to the marking scheme well in advance before the end of the term.", "In case of whole term online lectures, and exams will be held online"]}, {"course_id": 128, "course_code": "ECE 463", "course_name": "ECE463 - Design and Applications of Power Electronic Converters (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Design and Applications of Power Electronic Converters Spring 2024", "11:30AM -", "04:00PM - 05:20PM", "Switching characteristics of power semiconductor devices.", "Computer simulation of power electronic circuits.", "Analysis, design, and applications of power converters.", "Introduction to power electronics.", "Input and output filter design.", "Analysis, design, average modeling, control, and applications of power electronic converters.", "Design input/output second-order low-pass L-C filters for power electronic converters.", "Describe switching characteristics of power semiconductor devices.", "Quantify switching and conduction losses, and efficiency, in power electronic converters.", "Analyze, Design, model and control DC/DC and DC/AC switch-mode converters.", "Explain the role of power electronics in industrial applications.", "An extra lab session is used to introduce computer simulation of power electronic converters in PSIM environment.", "Power Electronic Circuit Simulation using PSIM", "Lab 3. DC Motor Speed Control using DC-to-DC converters", "The members in each lab/project group are expected to make equal contributions in all aspects.", "The project will focus on design and simulation of a power electronic system.", "Power Electronic Circuits Simulation using PSIM", "Using a recorded video, students will be introduced to PSIM and how to use the software to simulate power electronic circuits, with examples on DC/DC converters.", "Sections", "201 & 202", "201 & 202", "201 & 202", "Design and Simulation of a Power Electronics System", "Notice of Recording", "Email Correspondences:"]}, {"course_id": 129, "course_code": "ECE 464", "course_name": "ECE464 - High Voltage Engineering and Power System Protection (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["High Voltage Engineering and Power System Protection Winter 2025", "ECE 464", "11:30AM -", "11:30AM -", "04:00PM - 05:20PM", "ECE 464 101", "08:00PM -", "E-mails", "The course provides the fundamentals concepts of generation and measurements of high voltage ac, dc, and impulses.", "Briefly introduces the students to basic conduction and breakdown mechanisms of insulating materials.", "The scope of this course also includes understanding the basic protection system, studying the principles for protecting different elements and studying different technologies used in designing protective relays.", "Exposure to several state-of-art high voltage testing techniques of power system components will ensure that students have knowledge of the industrial solutions to the management of the problems associated with overvoltage and the protection mechanisms used.", "View requirements for ECE 464", "Lab 5: Electrostatic Analysis using COMSOL – An Introduction to Simulation Studies", "Part A: Generation and Measurement of High Voltages and Testing", "Sub-Topics", "Introduction", "Power and Energy Systems", "Importance of HV in power systems", "HV transmission system - growth", "HVAC and HVDC systems", "Components of high voltage power system", "Introduction to various insulation systems", "Introduction to power system protection devices", "HV Generation for Testing", "Origin of high voltage stresses", "HV testing requirements", "Test facilities", "Destructive and non-destructive tests", "AC power frequency sources", "Special test transformers", "Single and cascade transformers", "AC resonant circuits", "Generation of DC Voltages", "Rectifier circuits", "Voltage doubler", "Voltage multiplier circuits", "Electrostatic generators", "Basic impulse insulation levels", "Impulse voltage generation and analysis", "Use of standard test data and correction factors", "Resistive dividers", "Capacitive dividers", "Mixed dividers", "Low voltage arm connections and measuring instruments", "Part B: Basics of Conduction and Breakdown Mechanisms in Dielectrics", "Sub-Topics", "Source of charge carriers · High field conduction", "Collision mechanisms and ionization · Primary and secondary processes", "Statistical and formative time lags", "Impulse time-volt characteristics", "Visible corona; Corona inception and extinction", "Dielectric strength · Intrinsic breakdown", "Electromechanical breakdown", "Thermal equilibrium and breakdown", "PD Detection methods", "Discharge in cavities", "Breakdown and Conduction Mechanisms in Liquids", "Source of charge carriers – role of impurities", "Cavitation/bubble theory", "Applications – transformers, cables, etc.", "Part C: Insulation Coordination and Power System Protection", "Sub-Topics", "Overvoltages and Insulation coordination", "External and internal insulations", "Characteristics of overvoltages · Electric stress and electric strength", "Clearances and withstand levels", "Practices in insulation coordination", "Pollution and environmental influence", "Overvoltage protection", "Surge propagation and surge impedance", "Gapped silicon carbide arresters", "Gapless metal oxide arresters", "Time-voltage coordination", "Introduction to Overcurrent Protection", "Basic definitions", "Protection coordination", "Aspects of power system protection", "Faults in power systems", "Types of faults · Protection coordination", "Instrumentation Transformers", "Current transformers (CTs)", "CT_ saturation and accuracy", "System Protection Components", "Reclosers", "Overcurrent Protection Coordination", "Building blocks of protection system", "Principle of over current protection", "Art and Science of Protection · Zones of protection", "Primary and Backup · Protective devices and characteristics", "Protection requirements · Coordinating over current devices · Time-dial setting · Time-current characteristic (TCC) curves", "Coordination time intervals · Desirable Protection Attributes"]}, {"course_id": 130, "course_code": "ECE 467", "course_name": "ECE467 - Power Systems Analysis, Operations, and Markets (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Power Systems Analysis, Operations, and Markets Winter 2025", "10:00AM - 11:20AM E7 4433", "04:00PM - 05:20PM", "Professor Kankar Bhattacharya", "This course provides a basic understanding of the main issues relevant to the operation, analysis, and management of power grids, and gives an introduction to the functioning of electricity markets.", "The course covers the following main technical and economic issues relevant to system operators, utilities and analysts: power system economic operations; short-term operation of power systems; power flow; introduction to optimal power flows; overview of electricity markets; fault calculations; and basic concepts in power system stability and control.", "View requirements for ECE 467", "Understand the fundamentals of power system operation in a traditional vis-a-vis a competitive environment.", "Understand the technical issues arising in power system operations in conjunction with the economic aspects.", "Able to develop mathematical models and simulation tools to analyze the operational and control problems in power systems and electricity markets.", "Number of Lectures", "Sub-Topics", "Power System Economic Operations", "Short-term Operation of Power Systems", "Unit Commitment problem formulation and solution", "Hydro-thermal coordination and solution", "Power Flow Analysis", "Electricity Markets", "Fault Analysis", "Unsymmetrical faults.", "Power system stability and control", "It will require developing a power grid simulation model and carrying out specific case studies."]}, {"course_id": 131, "course_code": "ECE 474", "course_name": "ECE474 - Radio and Wireless Systems (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Radio and Wireless Systems Winter 2025", "S. Boumaiza", "slim.boumaiza@uwaterloo.ca", "04:00PM - 05:20PM", "Modern transmitter and receiver architectures, Noise and linearity in radio and wireless systems, Design considerations of RF/microwave subsystems, radio and wireless system designs, CAD tools for radio and wireless systems, Antennas, Radio wave propagation models, Indoor radio, Satellite communication, Personal communication systems (PCSs).", "View requirements for ECE 474", "View requirements for ECE 770", "Designers of building blocks often ignore the motivation behind the various specifications they are given and their connections with the overall system performance once integrated into a radio communication system.", "As radio and wireless systems pose increasingly stringent specifications, integration of component-level building blocks to system-level design process is essential and circuit design and radio system engineering will merge.", "This course covers a wide range of radio and wireless systems aspects including communication signals and the underlying modulation and multiple access techniques, tradeoffs among different transceiver (transmitter/receiver) architectures (conventional and modern), antennas and radio waves propagation, and design considerations of RF/microwave building blocks, radio and wireless systems.", "In particular, it links circuit design specifications and system requirements defined in wireless standards.", "This course will equip students with the basics in modern radio and wireless systems design by", "- Learning the overall picture of conventional and modern radio and wireless systems", "- understanding the tradeoffs between different transceiver architectures in relation to a given communication standard", "- evaluating the impact of different impairments in radio and wireless systems on performance, including interference, different noise sources and nonlinearity", "- learning how to use computer aide design tools to assess the system level performance of radio transceivers and links", "- distinguishing and analyzing the propagation issues on several radio and wireless systems", "Introduction to Modulation and Multiple Access Techniques (2 Weeks)", "System level Key Characteristics and Parameters in Radio and Wireless Systems (3 Weeks)", "Noise/Linearity Budget for Radio & Wireless Systems", "Low Noise Amplifiers,", "Mixers & Modulators (IQ)", "Power Amplifiers", "Receivers Architectures", "Basic Antenna Operation", "Antenna Types and Specifications", "Special Topics on Radio & Wireless Systems (1 Week)", "Design Project/Lab: To let students have a chance to practice and understand the subjects learned in the course, several design and simulation cases of wireless link aspects using the SystemVue CAD tool from Keysight Technologies are assigned as the course project.", "The students will have also a chance to experience the theory covered in the course and to validate the project simulations in a laboratory where they will have access to state-of-the-art equipment.", "Michael Steer, Microwave and RF Design – A System Approach, SciTech, 2010.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 133, "course_code": "ECE 481", "course_name": "ECE481 - Digital Control Systems (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Digital Control Systems Spring 2024", "yash.pant@uwaterloo.ca", "11:30AM -", "Dynamic system modelling and basic system identification.", "Sampled data systems.", "Digital control system design: emulation methods, z-domain, frequency domain, pole placement.", "Implementation of digital controllers.", "Design controllers to deal with basic nonlinear effects.", "Explain how sampling rates affect the performance of a digital control system and how to account for the sampling rate when you design feedback controllers.", "Discretize a plant in order to do control design directly in the discrete-time domain and discretize a continuous control law to implement it in a computer program.", "Test stability of discrete-time systems and quantify dynamic performance of these systems.", "Design digital control laws by emulation, in both the z-domain and the frequency domain.", "Design techniques include deadbeat control and pole placement.", "Motivating examples, introduction to discrete-time control systems and sampled-data control systems.", "Bounded-input bounded-output stability, feedback stability, time-domain specifications, steady-state performance, frequency domain analysis.", "Pole placement controller design for continuous-time systems in the s-domain, incorporating tracking specifications.", "State-space models, linearization, inverting static non-linearities, static friction.", "Linear discrete-time systems (4 lectures)", "Discretize the plant and design the controller in the discrete-time domain, stability tests, design in the frequency domain, design in the time-domain.", "Optimization-based control of constrained systems (1 lecture)", "Introduction to optimal control, effect of constraints, Model Predictive Control.", "The optional suggested textbook is: Digital Control System Analysis and Design, 4th edition, C.L.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as linear algebra for control system analysis and design, implementation in Matlab/Simulink .", "Library for research-based assignments"]}, {"course_id": 134, "course_code": "ECE 486", "course_name": "ECE486 - Robot Dynamics and Control (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Robot Dynamics and Control Spring 2024", "ECE 486 / ECE 780", "ECE 486 001", "ECE 486 101", "08:00PM -", "ECE 486 201", "ECE 780 001", "ECE 486:", "Introduction to the study of robotics focusing on the mechanics and control of serial manipulators.", "Topics include rigid body motion, forward and inverse kinematics, differential kinematics, forward and inverse dynamics, trajectory generation, motion planning, and feedback control.", "This course will introduce students to dynamic modeling and control techniques for robotic systems, and expose them to some cutting-edge research.", "Dynamics of manipulators", "Optimization-based robot control", "May 7 Introduction to robot dynamics and control", "May 23 Dynamic model of manipulators 6 [", "CONTROL OF MANIPULATORS", "Jun 27 Control of driftless systems 14", "Jul 4 Control of differentially flat systems 14", "OPTIMIZATION-BASED ROBOT CONTROL", "Jul 18 Invariance and control barrier functions 4 [", "The lecturing deliverable will consist in a 15-minute presentation of a topic not covered in class and independently studied.", "Magnus Egerstedt, Robot Ecology: Constraint-Based Design for Long-Duration Autonomy, Princeton University Press, 2021 No", "ECE 486", "The project will consist of a mobile manipulation task using the DJI RoboMaster EP programmed in", "The code developed to complete the project", "The reports must be formatted using", "The project will consist of the solution to a problem in the student’s research area using the techniques", "– Section II: Novelty and/or impact", "– Section III: How robot dynamics and control techniques play a key role", "– Section V: Metric for success", "– Section I: Introduction", "– Section III: Materials and methods", "The code developed to complete the project"]}, {"course_id": 135, "course_code": "ECE 488", "course_name": "ECE488 - Multivariable Control Systems (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Multivariable Control Systems Winter 2025", "ECE 488", "Monday, Friday -", "D. Davison", "04:00PM - 05:20PM", "ECE 488 101", "08:00PM -", "D. Davison", "Instructor Dan Davison", "EIT-3114", "Review of feedback control design fundamentals; SISO controller parameterizations; the fundamental effect of MIMO interaction; introduction to state-space models in continuous and discrete time; SISO techniques for MIMO design; optimal control; model-predictive control design; state estimation; decoupling, MIMO PID control design; applications in areas such as aerospace systems.", "View requirements for ECE 488", "Course pre-requisites:", "This course builds on classical control theory from a first control course (ECE380, MTE360, BME356, SYDE352, or equivalent).", "I assume you have good working knowledge of Laplace transforms, transfer functions, Bode plots, block diagrams, and basic control tools (Routh-Hurwitz stability test, root locus plots, Nyquist plots, design of PID/lead/lag controllers).", "To develop tools that allow us to analyze and design control systems that have multiple inputs and/or multiple outputs.", "(7) Proficiently interpret and analyze MIMO systems (Chapter 4)", "(9) Proficiently manipulate and analyze MIMO state-space systems (Chapter 5)", "(11) Explain the advantages and disadvantages of state-space and transfer-function techniques for MIMO control (Chapter 5)", "Tests and final exam", "Tests and final exam", "Tests and final exam", "Tests and final exam", "Tests and final exam", "\"Impact of engineering on society and the environment\"", "\"Economics and project management\"", "Mon Feb 10 Lecture Ch 3 pp.157-164 and P3 & P4", "These slots will compensate for lectures that are cancelled during the ECE Midterm Week.", "You can send a print request online at https://wstore.uwaterloo.ca/pages/w-print-student.", "Chapter 4:  \"Control System Design\", by Goodwin, Graebe, and Salgado, 2001", "Summary of marked components", "Tests and final exam", "Any reason for missing a test, other than those listed above, results in a score of zero on that test.", "The purpose of the Project Exercises is to increase your understanding of the techniques and ideas presented in the lectures by applying them to a quasi-realistic system.", "In-person students who faithfully attend the in-person lectures can get bonus marks.", "I will occasionally distribute slips to each person present in the lecture room.", "Correctly answer a simple question on the slip, and put the slip in the box at the front of the room.", "Most of the 36 lecture videos explain how a random subset of viewers can get a 0.5% bonus mark.", "Mixed learning modes:  Students who switch between in-person and online learning may collect a mixture of in-person and online bonus marks."]}, {"course_id": 136, "course_code": "ECE 493", "course_name": "ECE493 - Special Topics in Electrical and Computer Engineering (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Social Robotics - Foundations, Technology and Applications of Human-Centered Robotics Winter 2025", "ECE 750 / ECE 493", "ECE 750 / ECE 493 001", "10:00AM - 11:20AM E7 5353", "kerstin.dautenhahn@uwaterloo.ca", "04:00PM - 05:20PM", "08:00PM -", "Prof. Kerstin Dautenhahn:", "E5-5027", "kerstin.dautenhahn@uwaterloo.ca", "ECE 750:", "View requirements for ECE 750", "View requirements for ECE 493", "The course will provide an introduction to the research field of social robotics, with a particular human-centered perspective.", "Robots that can interact socially in an effective and acceptable manner with people have become increasingly important for applications ranging from robot-assisted therapy for people with special needs, robotic assistants for older people and care home residents, robots as tools in education or robotic co-workers for a new generation of  industrial robot that emphasize human-machine collaboration and communication.", "Students will gain an understanding of the concepts and theories underlying social robotics, as well as research methodologies and techniques to realize socially intelligent robots and design, plan and evaluate human-robot interaction experiments.", "Understand concepts and theories underlying social robotics", "Apply research methodologies and techniques to realize socially intelligent robots", "Design, plan, and evaluate human-robot interaction experiments", "Demonstrate scientific writing and presentation skills", "Explain how psychology and social sciences can inform the engineering of social robots", "Understand basic principles of sensors, actuators and multi-model interaction and communication for social robots", "Explain examples of robot computational architectures used in human-robot interaction", "Definitions of social robots and requirements of robots’ social skill and their relevance to robotics and Artificial Intelligence in real-world applications", "The role of affective expressions of social robots and modelling emotions to facilitate human-robot engagement", "Evaluating usability, user experience and acceptance of social robots", "Guidelines of how to write up social robotics research for a scientific publication", "Overview of cognitive architectures for socially intelligent robots", "Featuring interdisciplinary research in social robotics based on research from other fields, e.g. from (developmental) psychology, ethology or primatology", "Roles of social robots in human society and their potential impact on society and wellbeing", "Selected examples of applications of social robots e.g. in care, therapy, education, rehabilitation and co-worker scenarios will be discussed throughout the course", "Ethical, safety and privacy issues as relevant to social robotics will be discussed throughout the course", "Course Grading for Graduate Students:", "20% Individual discussion paper: Students will reflect on work in Science Fiction involving the concepts of social and intelligent robots, and reflect on the relevance to today’s robotics technology in robotics and Artificial Intelligence.", "Students can choose the work and discuss the selection with the instructor.", "Students are required to write a report that motivates, describes and discusses those behaviours in light of the state of the art literature, and describe an experimental design for a human-robot interaction experiment where those behaviours could be tested and analyzed.", "Specifically, students’ reports will be evaluated based on a) the literature review demonstrating the level of knowledge in this domain, b) the relevance of the identified research questions and hypotheses, c) the depth of the proposed research program, d) the range, complexity and quality of the implemented and documented robot behaviours, e) the detailed description of the methodology used to carry out and analyze this program of work, f) the user study conducted and how results are presented and analysed, and finally, g) a critical evaluation of possible limitations of the expected outcomes and backup plans in order to address  possible delays and technical difficulties encountered during the implementation of the work.", "Note, those skills can also be applied to related fields of Human-Computer Interaction (HCI), Human Factors etc.", "20% Individual discussion paper: Students will reflect on work in Science Fiction involving the concepts of social and intelligent robots, and reflect on the relevance to today’s robotics technology in robotics and Artificial Intelligence.", "Students can choose the work and discuss the selection with the instructor.", "Students are required to write a report that motivates, describes and discusses those behaviours in light of the state of the art literature, and describe a possible experimental design for a human-robot interaction experiment where those implemented behaviours could be tested and analyzed.", "Specifically, students’ reports will be evaluated based on a) the literature review demonstrating the level of knowledge in this domain, b) the relevance of the identified research questions and hypotheses, c) the depth of the proposed research program, d) the range, complexity and quality of the implemented and documented robot behaviours, e) the detailed description of the methodology used to carry out and analyze this program of work, f) a critical evaluation of possible limitations of the expected outcomes and backup plans in order to address  possible delays and technical difficulties encountered during the implementation of the work.", "Note, those skills can also be applied to related fields of Human-Computer Interaction (HCI), Human Factors etc.", "Notice of Recording"]}, {"course_id": 137, "course_code": "ECE 495", "course_name": "ECE495 - Autonomous Vehicles (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 495", "ECE 495 001", "Monday, Friday -", "11:30AM -", "04:00PM - 05:20PM", "Mahdi Naseri mahdi.naseri@uwaterloo.ca", "Autonomous driving system overview; computer vision basics, deep learning for perception, motion modelling and state estimation, localization and mapping, object tracking, behavioral planning and reinforcement learning, path planning and vehicle control, safety and verification and validation, adoption and impact.", "View requirements for ECE 495", "Linear algebra", "Basic mechanics", "Feedback control", "Basic programming skills in Python and C++", "Design and implement perception functions using classical and deep learning computer vision techniques", "Formulate and implement Extended Kalman Filter for dynamic state estimation", "Understand and implement basic vehicle control and trajectory methods", "Understand the limitations and risks of current methods and be aware of future research and industry trends", "Functional Architecture", "WISE ADS", "Image representation", "Image filtering", "Lane detection using classical computer vision", "Image features", "Linear regression", "Neural network training", "Implementing vanilla neural network from scratch", "U2 Semantic segmentation", "Training a deep network for semantic segmentation", "Deep network for object detection", "U1 Dynamic system modeling", "Probabilistic models", "Bayes filtering", "U2 Occupancy grid mapping", "Vehicle modeling – Part 1", "U1 Lateral vehicle control", "Longitudinal vehicle control", "Vehicle controller", "Motion planning problem", "Motion planning methods", "The in-person lecture slots will be used for covering selected topics from the course material, answering and discussing the sample practice questions, and guest lectures on emerging research topics.", "Additional material covered in guest lectures may be included in exams as bonus questions.", "However, some students may prefer to read text explaining these concepts.", "A recent book discusses the major functions of autonomous vehicles, touching on many of the topics covered in the course and beyond", "Creating Autonomous Vehicle Systems, Second Edition, Morgan and Claypool Publishers, 2020", "Section 4.2: Edge Detection", "Section 3.2: Linear Filtering", "Sections 3.1 and 3.2: Linear Regression", "Neural networks", "Section 7.3: Semantic Segmentation", "Section 7.2: Object detection", "Vehicle modeling", "Motion planning", "Computer Vision: Algorithms and Applications.", "An Introduction to Statistical Learning with Applications in R. Springer, 2017 (available online through UW library)", "Kalman and Bayesian Filters in Python.", "Automatic Steering Methods for Autonomous Automobile Path Tracking.", "A Survey of Motion Planning and Control Techniques for Self-driving Urban Vehicles.", "Design Space of Behaviour Planning for Autonomous Driving.", "Online courses", "Coursera has a Self-Driving Cars Specialization, which you can access at", "The specialization has four courses:", "Introduction to Self-Driving Cars", "State Estimation and Localization for Self-Driving Cars", "Visual Perception for Self-Driving Cars", "Motion Planning for Self-Driving Cars", "Object detection can be a tricky concept to grasp.", "Finally, the Stanford course on Convolutional Neural Networks for Visual Recognition (cs231n) gives a great introduction to neural networks in general and convolutional neural networks in particular.", "Advanced reading", "The following two papers cover the trajectory planning concepts discussed in the course (these algorithms are used in the WISE ADS stack that operates UW Moose):", "I am including the following books here in case you want to deepen your knowledge on some of the topics covered in the course.", "State Estimation for Robotics.", "7 Implementing a simple trajectory planner Fri, Apr 4 12", "Collaboration & Plagiarism: Plagiarism, taking credit for work that others did, is not permitted, and this applies to source code as well as exams.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 138, "course_code": "ECE 499", "course_name": "ECE499 - Engineering Project (0.50)", "term_name": "List 3", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Email: mcrowley@uwaterloo.ca", "View requirements for ECE 499", "In doing so, they are expected to demonstrate initiative and ability to define a problem and develop a solution logically and accurately, so that they can appreciate, discriminate, and draw conclusions from observations and ideas.", "They also need to demonstrate they can make recommendations and communicate effectively by means of a written report on their work.", "This allows sufficient time for the readers to evaluate the report and provide a grade.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 139, "course_code": "ECE 224", "course_name": "ECE224 - Embedded Microprocessor Systems (0.50)", "term_name": "List 4", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Embedded Microprocessor Systems Fall 2024", "ECE 224", "ECE 224 001", "Monday, Friday -", "E7 4043", "ECE 224 002", "Monday, Friday -", "08:30AM - 09:50AM E7 4043", "11:30AM - 12:20PM E7 4043", "Rabiul Islam r25islam@uwaterloo.ca", "Emon Sarkar esarkar@uwaterloo.ca", "View requirements for ECE 224", "Course introduction: In this course, you will explore the design of embedded systems and computer interfaces.", "How should data be organized?", "When should data be exchanged?", "What conditions must be satisfied to reliably exchange data?", "Identify system realities (such as noise, jitter, metastability, and transmission line effects) and select suitable approaches for managing these realities in an embedded computer system.", "Compare and critically assess design tradeoffs in an embedded computer system.", "Analyze the effects of synchronization mechanisms on the operational characteristics of an embedded computer system.", "Design hardware and software components to reliably connect devices to an embedded computer system.", "Course Introduction", "An introduction to the teaching team, course expectations, deliverables, marking scheme, and a very brief introduction to interfacing concepts.", "Embedded Systems", "A review of the fundamentals of embedded systems and the terminology associated with embedded systems.", "Interfacing Software, Device Drivers and Synchronization", "A review of embedded software design concepts, followed by a discussion of synchronization concepts and analysis.", "A detailed examination of the design and behavior of drivers for shared and transmission lines, including considerations of signal integrity.", "Buses and Interconnections", "A comparison of the functional behavior and timing behavior of synchronous, asynchronous, partially interlocked asynchronous, semi-synchronous, and split cycle bus systems.", "Arbitration", "A detailed examination of alternatives for interconnection arbitration including both centralized and distributed arbitration techniques.", "Parallel Interfacing", "This includes an examination of the role of the interface in matching bus timing and signaling characteristics with a device's timing and signaling characteristics.", "Serial Interfacing", "This includes a comparison of asynchronous communication techniques and synchronous techniques as well as the protocols for serial communication.", "Error Detection and Correction", "An introduction to error detection and error correction including a discussion of error types, differences in detection and correction, and one example of an error correcting code (the Hamming code).", "Analog Interfacing", "An introduction to digital-to-analog interfacing, analog-to-digital interfacing, and sample-and-hold circuitry.", "This includes a discussion of static and dynamic errors.", "Examples", "You may use these exams to assess your preparation for the exams in the course.", "Assessment Estimated Completion Time Completion Date", "Lab studies: Lab studies are to be completed in groups of two.", "Students then write C software using the Intel Nios II Software Build Tools to control their embedded system to achieve a specified design goal.", "Lab Study 0: This is an introductory lab study that examines the design of a system-on-a-programmable chip (SOPC) design.", "In this lab, students design, build, and test a 32-bit microprocessor system based on the Nios II processor core.", "The hardware design and the board support package serve as a starting point for both Lab Study 1 and Lab Study 2.", "In this lab study, students design a software system that uses pushbuttons, LEDs, 7-segment displays, timers, polling loops, and multiple interrupt handlers to conduct an experiment into servicing a device.", "In this lab study, students design a software system to read a pre-recorded audio file from an SD card, process the audio data, and play it back on a speaker using a DAC.", "Students are given broad latitude to design the system.", "When a lab study builds upon previous submissions, comments such as \"In the previous submission, concerns were expressed related to the number of sample points in the experiment.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm and those who support others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 140, "course_code": "ECE 252", "course_name": "ECE252 - Systems Programming and Concurrency (0.50)", "term_name": "List 4", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Systems Programming and Concurrency Fall 2024", "ECE 252", "ECE 252 001", "Monday, Friday -", "11:30AM -", "E7 4043", "Monday, Friday -", "10:00AM - 11:20AM E7 4043", "M. Cooper-Stachowsky", "11:30AM - 12:20PM E7 4043", "ECE 252 101", "E7 4043", "ECE 252 102", "04:30PM - 05:20PM", "ECE 252 201", "08:30AM - 11:20AM E2 3346", "ECE 252 202", "ECE 252 204", "08:30AM - 11:20AM E2 3346", "Mike Cooper-Stachowsky (Section 2): Mike came to the university of Waterloo in 2014 where he worked in the first year office helping new students transition into university.", "He is particularly interested in operating systems and systems programming, and learned a lot by writing his own kernel for the x86.", "Manavjit Singh Dhindsa -- ms2dhind@uwaterloo.ca", "Sheikh Abrar Tahmid -- sa2tahmi@uwaterloo.ca", "ECE 252:", "Performance and correctness of concurrent systems.", "Deadlock detection and recovery; file systems.", "View requirements for ECE 252", "This course assumes you are comfortable programming in a low level programming language (likely C++ from your Algorithms and Data Structures course).", "Apply standard concurrency scenarios such as producer-consumer, readers-writers, dining philosophers, as well as deadlock and starvation.", "Interact with the Linux operating system through the command-line interface and the C language API.", "Use inter-process communication such as shared memory and message queues.", "Do you need a textbook?", "To request that a question be re-marked, you will need to submit your request in writing via e-mail to the instructor.", "Collaboration and Group Work.", "Please bring this situation to the attention of the course staff as soon as possible so that can be resolved quickly.", "However, each group must submit their own, independently-developed code for each lab.", "Similarly, each person must submit their own, independently-developed code for each assignment.", "I suggest you avoid looking at other people’s code entirely, but if you do, then you should not be doing that anywhere you might be writing your own code.", "The temptation to write your code just like what you see is simply too high.", "However, penalties may be more severe for repeat offenders (see below for information on Academic Integrity).", "All of the above applies to multiple instances — a student caught in several incidents of academic dishonesty will be subject to the above penalties for each of the incidents.", "Laptop and Device Policy: The human visual system has evolved to perceive saber-toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text-mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "Piazza is a great tool for collaboration and it allows rapid but asynchronous exchange of infor mation.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be difficult to interpret on a discussion forum.", "In either case, we will cancel all the in-person lectures and in-class exercises during the relevant period and try to have some online synchronous video lectures during that period.", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, Chat- GPT) and how such tools can be used to write and test code.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 141, "course_code": "ECE 327", "course_name": "ECE327 - Digital Hardware Systems (0.50)", "term_name": "List 4", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Digital Hardware Systems Winter 2025", "ECE 327 / ECE 627", "10:00AM - 11:20AM E7 4053", "11:30AM -", "ECE 327 101", "ECE 327 201", "04:30PM - 05:20PM E7 4053", "04:30PM - 05:20PM", "04:30PM - 05:20PM E7 4053", "Maran Ma: E2-3354A Wednesday 1:30-2:30pm", "Design and modelling of digital hardware systems using a hardware description language.", "Power analysis and optimization.", "View requirements for ECE 327", "ECE 627:", "Introduction to power analysis and optimization.", "Introduction to faults and testing.", "View requirements for ECE 627", "The design and engineering of computing chips is an exciting, and valuable skill that spans multiple engineering disciplines including software engineering, parallel programming, verification and reasoning, compilation techniques, down to physical/analog/electrical effects.", "This course will help open the door to careers in the richly-rewarding chip design industry in a variety of roles such as RTL developers, verification engineers, system-level developers, and future leaders and managers.", "ECE327 will be vital to navigate these exciting times.", "We must think about and understand concurrent operations at a cycle-by-cycle level of abstraction.", "There are commonly used paradigms, and design patterns that we must known when organizing the RTL code.", "We will learn how to break down a complex design into these components, and learn how to reason about correctness, and understand their translation to hardware primitives.", "Most digital design are constrained to fit specific cost targets, and the analysis tools help guide the design process with appropriate feedback.", "These compilation iterations are fundamental to digital design and a good designer knows how to direct the tools, rewrite Verilog code, and generate the desired hardware.", "A class project will be used to tie together all the key design lessons we learn in this course.", "We will be developing a large-language model (LLM) solution involving a matrix multiplier as part of the project.", "Describe hardware components at the RTL-level in Verilog, verify these designs through simulation, and map these design to an FPGA fabric.", "Introduction - Introduction to hardware design, quick look at concurrency, debugging, synthesis and entire hardware design flow.", "Reasoning about parallelism in Verilog and drawing timing waveforms/diagrams from the code and vice versa.", "State Machines - Sequential logic design in the form of controllers (or state machines).", "Retiming - Automating pipelining of feed-forward datapaths.", "Strategies and ideas for retiming steps.", "Static Scheduling - Time-shared reuse of hardware resources.", "Construction of static scheduling tables based on resource constraints.", "Design of state machine controllers, and datapaths building blocks.", "Dynamic Scheduling - Dynamic scheduling of resource shared datapaths.", "Timing Analysis - Understanding clock frequency and algorithms for timing analysis.", "Elmore Delay - Simplified high-level model of wire delays.", "Power - Power/energy analysis of hardware components.", "Analytical expressions for power and energy.", "ECE627-only] FPGAs - FPGA Logic, Interconnect, and Architecture, Introduction to reconfigurable hardware/FPGAs, understanding logic design, interconnect and overall composition.", "For relevant labs, the course uses the AMD/Xilinx Pynq FPGA boards available in E2-2356A.", "FPGA board deployment will be done as part of some of the labs, and you will get a chance to rectify errors should this fail.", "Remember, the final exam covers the entire course!", "Precise determination will be done on a case-by-case basis.", "- For any missed graded item, we offer the option of taking a final if you miss it for a legitimate reason as per university guidelines.", "Plagiarism in ECE327 will likely manifest in the form of copying RTL code, scripts, bitstreams as-is or recast with minor modifications.", "We have a MOSS configuration to check code plagiarism and we take this seriously.", "We understand that these circumstances can be troubling, and you may need to speak with someone for emotional support."]}, {"course_id": 142, "course_code": "ECE 350", "course_name": "ECE350 - Real-Time Operating Systems (0.50)", "term_name": "List 4", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Real-Time Operating Systems Winter 2025", "ECE 350", "ECE 350 001", "08:30AM - 09:50AM E7 4053", "11:30AM -", "ECE 350 201", "01:30PM - 04:20PM E2 2356A", "ECE 350 202", "01:30PM - 04:20PM E2 2356A", "01:30PM - 04:20PM E2 2356A", "ECE 350 101", "10:00AM - 11:20AM E7 4053", "About Prof. Zarnett", "8 years industry engineering experience in display & imaging", "Research specialization brain-machine interfacing", "Ahmed Elbaroudy - ammaelba@uwaterloo.ca", "Neeraj Nagar - nnagar@uwaterloo.ca", "Memory and virtual memory and caching; I/O devices, drivers, and permanent storage management; process scheduling; queue management in the kernel; real-time kernel development.", "Aspects of multi-core operating systems.", "View requirements for ECE 350", "Understand the differences between non-real-time and real-time operating system.", "The course notes should be pretty much everything you need for this course.", "I read them so you don’t have to!", "They are neither required nor recommended, but I'll list them here in case you truly wish to look at them.", "Operating Systems Internals and Design Principles (9th Edition).", "Please bring this situation to the attention of the course staff as soon as possible so that can be resolved quickly.", "However, each group must submit their own, independently-developed code for each lab.", "Similarly, each person must submit their own, independently-developed code for each assignment.", "I suggest you avoid looking at other people’s code entirely, but if you do, then you should not be doing that anywhere you might be writing your own code.", "The temptation to write your code just like what you see is simply too high.", "However, penalties may be more severe for repeat offenders (see below for information on Academic Integrity).", "All of the above applies to multiple instances — a student caught in several incidents of academic dishonesty will be subject to the above penalties for each of the incidents.", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, ChatGPT) and how such tools can be used to write and test code.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be diﬃcult to interpret on a discussion forum.", "The human visual system has evolved to perceive saber‐toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text‐mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions."]}, {"course_id": 0, "course_code": "ECE 305", "course_name": "ECE305 - Introduction to Quantum Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 3, "major_name": "Quantum Engineering Specialization", "topics": ["Notice of Recording", "Introduction to Quantum Mechanics Fall 2024", "ECE 305", "11:30AM -", "04:00PM - 05:20PM", "Introduction to quantization, wave-particle duality, and the uncertainty principle.", "Introduction to approximation methods including time-independent perturbation theory.", "View requirements for ECE 305", "Learn basic mathematics for quantum mechanics", "Understand the fundamental concepts of quantum mechanics: quantization, wave-particle duality, the uncertainty principles", "Learn how to solve Schrödinger equations for exemplary problems: particle-in-a-box, finite-height potential, a harmonic oscillator", "Learn modern applications of quantum mechanics", "Make-Up-F", "Tutorial-Th", "Introduction", "Stern-Gerlach", "Math/Matrix Notation", "Quantum State Vectors", "Linear Algebra", "Ch. 2.3-2.4", "Expectation Values", "Calculating expectation values", "Expectation values", "Schrödinger Equation", "Schrödinger Equation", "Spin Precession", "Energy Eigenvalue Equation", "Schrödinger Equation", "Wavefunction", "Wavefunction", "Wavefunction", "Nov.11-15", "Nov.18-22", "Finite Squarewell", "Nov.25-29", "Quantum Cryptography", "Quantum Mechanics: A Paradigms Approach by David H. McIntyre Yes", "Linear Algebra Lecture Material: https://ece.uwaterloo.ca/~ne112/Lecture_materials/.", "Notice of Recording"]}, {"course_id": 1, "course_code": "ECE 405A", "course_name": "ECE405A - Quantum Information Processing Devices (0.50)", "term_name": "Required Courses", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 3, "major_name": "Quantum Engineering Specialization", "topics": ["Quantum Information Processing Devices Fall 2024", "This course introduces physical implementations of quantum computers with an emphasis on common and connecting themes.", "The course topics include the review of quantum mechanics, criteria to build quantum computers, quantum circuit models, and four quantum hardware platforms (nuclear magnetic resonance, optical photons, trapped ions, and superconducting systems) in terms of qubit definition, universal gate sets, initialization, measurement strategies, and decoherence processes.", "View requirements for ECE 405A", "Introduction to quantum computing", "Topics: History of quantum computing, DiVincenzo criteria, quantum circuits, computational complexity, quantum error correction", "Special Topic: Repetition code", "Review of quantum mechanics", "Spins", "Special Topic: Silicon-based spins", "Optics", "Topics: Electromagnetic field quantization, single-photon sources/detectors, Knill-Laflamme-Milburn protocol, dual-rail encoding, linear optical elements, probabilistic gates, measurement-based and continuous variable quantum computing", "Topics: Ion traps, trapped ion motion, electronic states, Lamb-Dicke regime, ion-laser interactions, Cirac-Zoller and Molmer-Sorensen gates", "Superconducting circuits", "Identify the advantages of quantum computing over classical computing.", "Use quantum mechanics to model each of the studied implementations of quantum computing.", "Map quantum operations onto various hardware platforms.", "Assess how different implementations of quantum computing satisfy the DiVincenzo criteria.", "Compare and contrast different methods of quantum computing.", "Evaluate historical and modern quantum computing literature.", "Week Dates Theme Monday Wednesday Book Sections Deliverables", "5 Sep 30, Oct 2 Spins Initialization & Noise Silicon-Based Spins 3.6, 3.7, 3.8 Project Topic", "6 Oct 7, 9 Optics EM Field Quantization Sources & Detectors 4.1, 4.2, 4.3 Assignment 2", "8 Oct 21, 23 Optics Gates & BB84 QKD Measurement & CV Based QC 4.4, 4.5, 4.6, 4.7, 4.8, 4.9 Abstract", "11 Nov 11, 13 SC Circuits Superconducting Circuits Circuit QED & Control 6.1, 6.2, 6.3, 6.4, 6.5, 6.6 Assignment 4", "12 Nov 18, 20 SC Circuits Measurement & Noise Bosonic Qubits 6.7, 6.8, 6.9", "Building Quantum Computers: A Practical Introduction by Shayan Majidy, Christopher Wilson, and Raymond Laflamme Virtual copies of the textbook chapters will be provided in the event hard copies are unavailable.", "Priority given on a \"first-come, first-served\" basis", "Presentation slots will be assigned on a \"first-come, first-served\" basis", "Penalty-free extensions will be considered for extenuating circumstances at the discretion of the instructor.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 3, "course_code": "ECE 405C", "course_name": "ECE405C - Programming of Quantum Computing Algorithms (0.50)", "term_name": "Required Courses", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 3, "major_name": "Quantum Engineering Specialization", "topics": ["Programming of Quantum Computing Algorithms Winter 2025", "ECE 405C / ECE 730", "Monday, Friday -", "04:00PM - 05:20PM", "ECE 730 002", "Monday, Friday -", "04:00PM - 05:20PM", "Email: nayoung.kim(at)uwaterloo.ca", "The course will teach basic elements to create quantum circuits in quantum computers: qubits, single-qubit gates, two-qubit gates, quantum operators, and measurements.", "View requirements for ECE 405C", "ECE 730:", "View requirements for ECE 730", "Learn the basic elements of quantum circuits", "Learn the fundamentals of representative quantum algorithms", "Learn how to program quantum circuits and quantum algorithms via quantum computers or quantum cloud services", "Introduction to Quantum Computing - Qubits", "Quantum Circuits and Queries", "Quantum Algorithms", "Quantum Programming", "Study Break", "Phase Estimation Algorithm", "Quantum Simulation", "Quantum Error Correction", "Qiskit tutorials for quantum machine learning: https://qiskit.org/learn/course/machine-learning-course/"]}, {"course_id": 4, "course_code": "ECE 405D", "course_name": "ECE405D - Superconducting Quantum Circuits (0.50)", "term_name": "Required Courses", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 3, "major_name": "Quantum Engineering Specialization", "topics": ["Superconducting Quantum Circuits Winter 2025", "Monday, Friday -", "11:30AM -", "04:00PM - 05:20PM", "This course offers applications of superconductivity in quantum information devices and circuits at microwave frequencies.", "Introducing the basic physics of superconductivity, superconducting transmission lines and cavity resonators are presented as the elementary passive components in quantum circuits.", "Josephson junctions as an active element in superconducting electronics is introduced and it is shown how a qubit can be constructed based on various two-level system manipulated in Josephson junctions.", "Single qubit operation and qubit coupling in the form of circuit cavity electrodynamics and their associated qubit readout are discussed.", "Some existing quantum computers such as IBM Q System One and Google Sycamore are briefly introduced.", "View requirements for ECE 405D", "Week 1/2: Basics of superconductivity (BCS theory, two fluid model, microwave propagation in superconductors)", "Week 11/12: Quantum systems (introduction to IBM Q system, Google Sycamore)", "Principles of Superconducting Quantum Computers by Daniel D. Stancil, Gregory T. Byrd Yes free", "Building Quantum Computers, A Practical Introduction by SHAYAN MAJIDY, CHRISTOPHER WILSON, AND RAYMOND LAFLAMME No"]}, {"course_id": 0, "course_code": "CHE 102", "course_name": "CHE102 - Chemistry for Engineers (0.50)", "term_name": "1A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Chemistry for Engineers Winter 2025", "CHE 102", "E. Boghaert", "Eline Boghaert (eline.boghaert@uwaterloo.ca)", "While this course can be completed asynchronously online, synchronous online sessions will be held on Wednesday from 11:30 AM - 12:30 PM and Friday from 12:30 PM - 1:30 PM to review key concepts, demonstrate problem solving and answer questions.", "Stoichiometric calculations, properties of gases, properties of liquids and solutions, gas phase chemical equilibrium, ionic equilibrium in aqueous solution, oxidation-reduction reactions, chemical kinetics.", "View requirements for CHE 102", "Explain the behavior of ideal systems (including different states of matter, physical and chemical equilibrium and reaction kinetics) in terms of the molecular nature of matter.", "Write balanced chemical reactions and perform stoichiometric calculations.", "Identify which principles of physical chemistry are relevant to the analysis of problems involving physical and chemical equilibrium and rates of reaction.", "Select and apply an appropriate law to solve problems involving physical and chemical equilibrium and rates of reaction.", "Apply course concepts to identify and analyze concerns regarding the safety and/or sustainability of a chemical process.", "Unit 1: Introduction and Stoichiometry Week 1", "Introduction Lesson 1: Introduction to Significant Digits, Line Calculations and Unit Conversions (1.4, 1.5, 1.7)", "Lesson 5.1: Chemical Equilibrium and Equilibrium Constants (15.1-15.4)", "Unit 6: Equilibrium in Electrochemical Systems Week 11", "Lesson participation grades for each lesson are evenly weighted in the total lesson participation grade.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 1, "course_code": "CIVE 104", "course_name": "CIVE104 - Mechanics 1 (0.25)", "term_name": "1A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["11:30AM - 12:20PM RCH 302", "10:00AM - 11:20AM STC 0060", "Monday -", "Monday", "07:00PM - 08:50PM", "11:30AM - 12:20PM RCH 305", "02:30PM - 03:20PM", "RCH 204", "03:30PM - 04:20PM", "RCH 204", "02:30PM - 03:20PM", "08:30AM - 09:50AM CPH 3604", "Monday -", "Monday", "07:00PM - 08:50PM", "09:00AM - 09:50AM CPH 3604", "Force systems; vectors, forces and moments; equilibrium and free body diagrams.", "Solve 2-D equilibrium on a particle", "Solve 2-D equilibrium in a rigid body", "Demonstrate required engineering skills", "Statics and Mechanics of Materials sixtyh edition by R.C. Hibbeler, Pearson Prentice-Hall, 2022 No", "Mechanics I handout available on LEARN Yes", "Identify forces and loads applied on structures (30%)", "ILO 2: Solve 2-D equilibrium in a rigid body (30%)", "Calculate net forces and moments on rigid bodies (30%)", "Solve forces using equilibrium equations (35%)", "Identify ethical and unethical behavior in professional situations (10%)", "Identify gaps in your knowledge, skills and abilities (15%)"]}, {"course_id": 2, "course_code": "MATH 116", "course_name": "MATH116 - Calculus 1 for Engineering (0.50)", "term_name": "1A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["03:30PM - 04:20PM", "RCH 301", "RCH 301", "08:30AM - 09:20AM", "03:30PM - 04:20PM", "Monday, Friday -", "11:30AM - 12:20PM", "02:30PM - 03:20PM", "09:30AM - 10:20AM RCH 103", "11:30AM - 12:20PM RCH 103", "11:30AM - 12:20PM STC 0060", "02:30PM - 03:20PM", "02:30PM - 03:20PM", "10:30AM - 11:20AM RCH 101", "09:30AM - 10:20AM RCH 110", "03:30PM - 04:20PM", "07:00PM - 08:50PM", "RCH 204", "DWE 3516", "PHY 313", "02:30PM - 04:20PM DWE 3518", "08:30AM - 10:20AM RCH 204", "08:30AM - 10:20AM MC 4063", "08:30AM - 10:20AM MC 4060", "08:30AM - 10:20AM MC 4058", "02:30PM - 04:20PM MC 4060", "DWE 1515", "DWE 3522A", "Applications of the integral.", "Use trigonometric, exponential, and logarithmic functions to solve a variety of problems.", "Use differentiation to solve a variety of application problems including curve sketching, related rates, and optimization problems.", "Introduction and Review of Functions (Domain, Range, etc.)", "Compositions of Functions", "Inverses of Functions", "Odd and Even Functions, Transformations", "Piecewise and Heaviside Function", "Trigonometric and \"Inverse\" Trigonometric Functions", "Exponential and Logarithmic Functions", "Hyperbolic Trig Functions", "Limits", "Continuity", "§ 2.1-2.4", "Differentiation", "Implicit and Logarithmic Differentiation", "Curve Sketching Techniques", "Optimization Problems", "§ 4.2-4.8", "Linear Approximation, Differentials", "The Definite Integral", "Indefinite Integrals", "Integration by Substitution", "Integration by Parts", "In particular:"]}, {"course_id": 3, "course_code": "COMMST 191", "course_name": "COMMST191 - Communication in the Engineering Profession (AE, CIVE, ENVE, GEOE) (0.50)", "term_name": "1A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["jclausen@uwaterloo.ca (please do not use the D2L email system)", "I monitor my email M-F, 9:00 am - 5:00 pm.", "I am teaching multiple communication courses, and especially early in the sememster, I cannot always quickly know whch course you are referring to just from your email.", "In this course students in Architectural, Civil, Environmental, and Geological Engineering will enhance oral and written communication competencies in contexts relevant to the engineering profession.", "In this course, you will work to enhance your written and oral technical communication competencies in contexts relevant to the engineering profession as well as to your future career.", "More generally, in this course, you should anticipate learning what professional norms of technical communication and dominant forms of sharing knowledge prevail within and across the fields of engineering.", "Yet this course also attempts to impart awareness and appreciation for how these communicative forms are matters of social context and sites of negotiation and contestation.", "By extension, this progression also encourages you to find a place and voice in the conversations within your fields of study and to reflect upon the meaning and shape of available forums for technical communication.", "I perceive our classroom as a co-constructed space, in which readings and discussions may frequently challenge your attitudes, your unconsciously held beliefs, or your positions on current issues.", "To ensure a safe and open space in which all can converse and learn productively, it is vital that we conduct our relationships with respect and an ethic of care.", "Describe and apply conventions, genres, norms, and values of communication in an engineering discipline;", "Compose persuasive, audience-specific technical arguments;", "Analyze and summarice technical content in clear and concise ways;", "Deliver effective oral presentations; and", "Appraise and reflect on their own compositions, and those of their peers, to strategically revise and edit documents and presentations", "Objectives for Students of Communication Studies", "You (students) will understand the complexity of communication as a human process of shared meaning-making in the context of power, history, and culture.", "You will increase your capacity to recognize and enhance yours and others’ agency – the ability to make a difference in the world for yourself and others – and understand the implications of your communication behaviors for yourself and others.", "Recognize diverse linguistic practices and modes of communication as resources for writers and speakers.", "You will understand communication as a practice, and improve your critical and creative communication competencies by developing your ability to use writing, speaking, and other media of communication to create effective and engaging artifacts.", "Your will reflect on your role in fostering the public good (the multifaceted well-being of individuals and groups), begin to imagine a better future, and make decisions in your communication that can transform the communities to which you belong.", "Introduction to Communication/What is this course about?", "Audience Analysis", "Demographics and Professional Audiences", "Researching and Describing Technical Subjects", "Chapter 11: Technical Definitions and Descriptions", "In-class Oral Proposals", "Document Design and Models of Communication", "Feb 15-21  R    E    A    D    I    N    G      W    E    E    K", "March 4: Research Abstract", "Stakeholder Analysis and Persuasion", "“Identifying and Analyzing Stakeholders and Their Interests” (Online)", "Nov. 14:  Stakeholder Analysis In-class Activity", "Ethics", "Joy Buolamwini, “How I’m Fighting Bias in Algorithms,” TED (Video)", "Engagement and contribution is demonstrated in a number of ways.", "At the end of the term you will have a chance to make the case for what grade you believe you should receive with a self-assessment.", "Did I contribute something for each of the activities (if any) listed for that week?", "Did I make my contributions available to my peers in a timely manner that they can respond and engage with it?", "In this assignment, you will choose a specific topic related to civil engineering and identify an overarching problem to produce a project proposal.", "In this assignment you will creating a proposal in response to an imagined request for proposals (RFP) from a contractor in the industry, and presenting that proposal in a short three-minute pitch for your classmates, who will consider the persuasiveness of your proposal.", "Failures of retaining walls", "Failures of suspension bridges", "Importance and justification of arches", "Role of surveying in engineering", "In groups of 2 or 3, you will provide a technical summary of that element for a public, non-specialist audience.", "You will present a summary of the project element as a poster presentation on a standard 24x36 inch poster board using a combination of written and graphic communication.", "We may be involved in a public displaying of the posters we create, alongside students from other sections of Engineering Communication on evening in February over in one of the Engineering buildings.", "Part 2: Research Abstract", "The abstract should provide information relevant to solutions to the problem you articulated in your proposal and continue to advocate for a particular solution/recommendations.", "For the final project you will create a policy brief aimed at a clear stakeholder audience.", "Instructions", "A formal policy brief includes the following sections:", "Executive summary", "Explanation of results", "identify and address a specific policy-making audience", "explain the current research on this topic in clear, non-technical language", "highlight the features of the research most relevant for policy makers and stakeholders", "make one or two recommendations based on your synthesis of the research", "Natural Resource Development", "Climate Change Impact", "Mass Transportation Design", "Communicative competencies will play a significant role in distinguishing the most successful engineers from others who are equally skilled technicians but who lack the ability to communicate effectively.", "You will hand-in a 200 word individual reflection on the process of translating engineering concepts for a public non-expert audience.", "You should reflect on what skills, competencies and concepts you used in creating your final project.", "What do you think are your strengths and weaknesses in communicative competencies?", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 4, "course_code": "ENGL 191", "course_name": "ENGL191 - Communication in the Engineering Profession (AE, CIVE, ENVE, GEOE) (0.50)", "term_name": "1A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["e-mail: cgiannak@uwaterloo.ca", "In this course students in Architectural, Civil, Environmental, and Geological Engineering will enhance oral and written communication competencies in contexts relevant to the engineering profession.", "View requirements for ENGL 191", "Students will enhance their critical-thinking skills and creative competencies to better understand meaning-making, perception, and responsibility.", "Explain the role of reports, the press, advertising, video and other communications media in engineering [", "Demonstrate command of appropriate writing skills and style [", "Construct a persuasive technical argument [", "Week 1: Professional Communication in Engineering", "- Introduction to Course; Writing Email/Letters for the Workplace; Loss Control Bulletin/Saving Email; Intro to Assignment 1: Pitch Email", "Week 2: Communicating Problems in Engineering", "- Swales CARS model of Engineering Articles; Info-Seeking Module; Proposal Pre-Research Exercise; Bibliographies", "- Engineering Case Studies; Cases: Responding and Reporting; Usability Testing; Introduction to Assignment 3: Engineering Proposal; Week 6 Check-In", "- Introduction to Engineering Proposals; Writing Winning Proposals; Charts & Budgets", "- Audience and Appeals; Applying rhetorical and persuasive techniques; Applying Swales CARS to the proposal genre; Introduce Assignment 4: Reflection", "Week 9: Designing Documents & Layouts", "Writing in the Technical Fields: A Practical Guide.", "You will be able to access and complete key components of the course at a week-to-week pace online.", "Content for each week will be delivered in the form of modules.", "The main assignments in the course function as parts of a whole: the pitch, progress report, proposal, and reflection form a course-long project whose theme and structure you should consider from the start of the term.", "The proposal, in addition to being a well-conceived, clearly structured, and persuasive document, is intended to communicate an engineering idea you wish to pursue, an idea you will first present through the pitch email.", "We will discuss how to do this in our first weeks together.", "Assessment & Accommodation", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 5, "course_code": "CIVE 115", "course_name": "CIVE115 - Linear Algebra (0.25)", "term_name": "1A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Linear Algebra Fall 2024", "10:00AM - 11:20AM STC 0060", "03:30PM - 04:20PM", "10:00AM - 11:20AM RCH 105", "11:30AM - 12:20PM RCH 103", "10:00AM - 11:20AM RCH 105", "11:30AM - 12:20PM RCH 103", "02:30PM - 03:20PM", "08:30AM - 09:50AM CPH 3604", "11:30AM - 12:20PM", "WEEF TAs are also available but students are strongly encouraged to seek help first from a member of the teaching team.", "Linear systems of equations, matrices, and determinants.", "Introduction to the eigenvalue problem.", "This course introduces fundamental linear algebra concepts such as linear systems of equations, matrices, vector spaces, and the eigenvalue problem with emphasis on applications used by civil, environmental, geological, and architectural engineers.", "Construct and systematically solve systems of linear equations.", "Predict the solution properties given the properties of the system.", "Construct vectors and perform vector operations (e.g., length, dot, and cross products) by hand.", "Identify and solve basic eigenvalue and eigenvector problems.", "Linear systems of two and three variables, substitution, elimination, graphical solutions; ordered lists, vectors, parameters; Systems of equations as matrices and vectors, elementary row operations, reduced row echelon form, Gaussian elimination, rank, independent and dependent equations, solution sets; homogeneous systems and solutions", "Matrices: general, vectors, zero, transpose, square, diagonal, triangular, identity, symmetric; rank, independent and dependent rows and columns; Matrix arithmetic: equality, addition, scalar multiplication, matrix multiplication; Inverse matrix: procedure, properties, inverse method of solving a system; Elementary matrices", "Vectors in Rn: standard and geometric, addition and scalar multiplication, length, unit vectors; vector equations of lines, planes and hyperplanes; dot product, projections, cross and box product in 3D; linear independence, linear dependence, span, basis, change of basis", "Matrix-vector multiplication as a linear transformation;", "Eigenvalues and eigenvectors: definition, procedure, interpretation;", "A First Course in Linear Algebra: an Open Text, by Lyryx Learning, Version 2017 Revision A, based on original text by K. Kuttler, 2012.", "The use of a basic scientific calculator is allowed in this course.", "Each student is responsible for verifying their calculator meets these restrictions.", "Axle Fulcrum Gear Helix Lever Multi-Media Pulley Wedge WEEF Wheel", "Exams", "Both will be individual closed-book tests.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 6, "course_code": "ENVE 115", "course_name": "ENVE115 - Linear Algebra (0.25)", "term_name": "1A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Linear Algebra Fall 2024", "10:00AM - 11:20AM STC 0060", "03:30PM - 04:20PM", "10:00AM - 11:20AM RCH 105", "11:30AM - 12:20PM RCH 103", "10:00AM - 11:20AM RCH 105", "11:30AM - 12:20PM RCH 103", "02:30PM - 03:20PM", "08:30AM - 09:50AM CPH 3604", "11:30AM - 12:20PM", "WEEF TAs are also available but students are strongly encouraged to seek help first from a member of the teaching team.", "Linear systems of equations, matrices, and determinants.", "Introduction to the eigenvalue problem.", "This course introduces fundamental linear algebra concepts such as linear systems of equations, matrices, vector spaces, and the eigenvalue problem with emphasis on applications used by civil, environmental, geological, and architectural engineers.", "Construct and systematically solve systems of linear equations.", "Predict the solution properties given the properties of the system.", "Construct vectors and perform vector operations (e.g., length, dot, and cross products) by hand.", "Identify and solve basic eigenvalue and eigenvector problems.", "Linear systems of two and three variables, substitution, elimination, graphical solutions; ordered lists, vectors, parameters; Systems of equations as matrices and vectors, elementary row operations, reduced row echelon form, Gaussian elimination, rank, independent and dependent equations, solution sets; homogeneous systems and solutions", "Matrices: general, vectors, zero, transpose, square, diagonal, triangular, identity, symmetric; rank, independent and dependent rows and columns; Matrix arithmetic: equality, addition, scalar multiplication, matrix multiplication; Inverse matrix: procedure, properties, inverse method of solving a system; Elementary matrices", "Vectors in Rn: standard and geometric, addition and scalar multiplication, length, unit vectors; vector equations of lines, planes and hyperplanes; dot product, projections, cross and box product in 3D; linear independence, linear dependence, span, basis, change of basis", "Matrix-vector multiplication as a linear transformation;", "Eigenvalues and eigenvectors: definition, procedure, interpretation;", "A First Course in Linear Algebra: an Open Text, by Lyryx Learning, Version 2017 Revision A, based on original text by K. Kuttler, 2012.", "The use of a basic scientific calculator is allowed in this course.", "Each student is responsible for verifying their calculator meets these restrictions.", "Axle Fulcrum Gear Helix Lever Multi-Media Pulley Wedge WEEF Wheel", "Exams", "Both will be individual closed-book tests.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 7, "course_code": "GEOE 115", "course_name": "GEOE115 - Linear Algebra (0.25)", "term_name": "1A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Linear Algebra Fall 2024", "10:00AM - 11:20AM STC 0060", "03:30PM - 04:20PM", "10:00AM - 11:20AM RCH 105", "11:30AM - 12:20PM RCH 103", "10:00AM - 11:20AM RCH 105", "11:30AM - 12:20PM RCH 103", "02:30PM - 03:20PM", "08:30AM - 09:50AM CPH 3604", "11:30AM - 12:20PM", "WEEF TAs are also available but students are strongly encouraged to seek help first from a member of the teaching team.", "Linear systems of equations, matrices, and determinants.", "Introduction to the eigenvalue problem.", "This course introduces fundamental linear algebra concepts such as linear systems of equations, matrices, vector spaces, and the eigenvalue problem with emphasis on applications used by civil, environmental, geological, and architectural engineers.", "Construct and systematically solve systems of linear equations.", "Predict the solution properties given the properties of the system.", "Construct vectors and perform vector operations (e.g., length, dot, and cross products) by hand.", "Identify and solve basic eigenvalue and eigenvector problems.", "Linear systems of two and three variables, substitution, elimination, graphical solutions; ordered lists, vectors, parameters; Systems of equations as matrices and vectors, elementary row operations, reduced row echelon form, Gaussian elimination, rank, independent and dependent equations, solution sets; homogeneous systems and solutions", "Matrices: general, vectors, zero, transpose, square, diagonal, triangular, identity, symmetric; rank, independent and dependent rows and columns; Matrix arithmetic: equality, addition, scalar multiplication, matrix multiplication; Inverse matrix: procedure, properties, inverse method of solving a system; Elementary matrices", "Vectors in Rn: standard and geometric, addition and scalar multiplication, length, unit vectors; vector equations of lines, planes and hyperplanes; dot product, projections, cross and box product in 3D; linear independence, linear dependence, span, basis, change of basis", "Matrix-vector multiplication as a linear transformation;", "Eigenvalues and eigenvectors: definition, procedure, interpretation;", "A First Course in Linear Algebra: an Open Text, by Lyryx Learning, Version 2017 Revision A, based on original text by K. Kuttler, 2012.", "The use of a basic scientific calculator is allowed in this course.", "Each student is responsible for verifying their calculator meets these restrictions.", "Axle Fulcrum Gear Helix Lever Multi-Media Pulley Wedge WEEF Wheel", "Exams", "Both will be individual closed-book tests.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 8, "course_code": "MATH 118", "course_name": "MATH118 - Calculus 2 for Engineering (0.50)", "term_name": "1B Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:30AM - 11:20AM RCH 110", "02:30PM - 03:20PM", "RCH 306", "09:30AM - 10:20AM RCH 105", "RCH 306", "10:30AM - 11:20AM RCH 103", "RCH 204", "02:30PM - 03:20PM", "02:30PM - 04:20PM MC 4060", "Monday -", "Monday", "Linear and separable first order differential equations, applications.", "Parametric curves and polar coordinates, arc length and area.", "Get experience in writing well-organized and readable mathematical solutions, so that you will be able to communicate mathematical or technical ideas.", "Select an appropriate integration technique and apply it to solve indefinite or definite integrals.", "Find a power series representation of a function and find a closed form for a function represented by a power series.", "Understand the formal definition of the limit of a sequence and use it to prove basic limits.", "Understand the principle of mathematical induction and use it to prove some mathematical statements.", "Integration by substitution (review)", "Integration by parts (review)", "Trigonometric integrals", "Trigonometric substitution and completing the square", "Partial fractions", "Numerical integration", "Error bounds for numerical integration", "Improper integrals", "First make up lecture occurs", "Separable DEs, linear first-order DEs", "Applications of DEs", "Sequences, limits of sequences", "Recursively-defined sequences, mathematical induction", "Appendix A", "Integral test, p-series", "Comparison tests", "Second make up lecture occurs", "-", "Winter reading week", "-", "Absolute vs. conditional convergence", "Ratio and root tests", "Estimating sums", "Power series", "Taylor and Maclaurin series", "Sums of power series", "Applications of series", "Parametric equations", "Polar coordinates, polar curves", "Area and arc length of polar curves", "In particular:"]}, {"course_id": 9, "course_code": "AE 123", "course_name": "AE123 - Electrical Circuits and Instrumentation (0.50)", "term_name": "1B Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electrical Circuits and Instrumentation Spring 2024", "Friday -", "Friday", "10:30AM - 12:20PM", "Duty", "E-mail", "Meagan Alexandra Yerxa LAB Coordinator E2-1786 mayerxa@uwaterloo.ca", "Function and characteristics of basic electrical transducers.", "Basics of data acquisition.", "Identify main components in measurement systems.", "Design a basic measurement system.", "1 May 06-10 Introduction to sensors, measurement and data acquisition  First week, no Lab", "2 May 13-17 Current, Voltage, Power, Energy, Circuit Elements, KCL, KVL,  Lab 1: Introduction to circuit and measurement", "3 May 20-24 Introduction to Circuits Resistances in Series & Parallel, Equivalent Resistance Analysis, Voltage Divider & Current Divider  Lab 2: Circuit building", "13 Jul 29 – 30 Introduction to smart homes NO LAB", "Electrical Engineering: Principles and Applications, A.R. Hambley, 7th edition No", "Demos for circuit basics: https://youtube.com/playlist?list=PLDkq31epwdjxzg5AHIOsDk0dry4lAW5Sl"]}, {"course_id": 10, "course_code": "CIVE 123", "course_name": "CIVE123 - Electrical Circuits and Instrumentation (0.50)", "term_name": "1B Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electrical Circuits and Instrumentation Winter 2025", "Monday, Friday -", "10:00AM - 11:20AM RCH 302", "Duty", "E-mail", "Function and characteristics of basic electrical transducers.", "Basics of data acquisition.", "Demos for circuit basics: https://youtube.com/playlist?list=PLDkq31epwdjxzg5AHIOsDk0dry4lAW5Sl", "3 1&2 Current, Voltage, Power and Energy,", "4 2&3 Basic resistive circuit techniques", "9 6 Operational Amplifiers", "10 7 Capacitors and inductors", "12 9 AC Circuit Analysis - I"]}, {"course_id": 11, "course_code": "ENVE 123", "course_name": "ENVE123 - Electrical Circuits and Instrumentation (0.50)", "term_name": "1B Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Electrical Circuits and Instrumentation Spring 2024", "11:30AM - 12:20PM E2 1732", "08:30AM - 09:20AM E2 1732", "Friday -", "Friday", "10:30AM - 12:20PM", "E-mail", "QNC 2609/ Microsoft Teams", "Duty", "E-mail", "Basharat Mehmood", "First Year Tutors and WEEF Lab Tas", "E2-1719B", "E2-1786", "Function and characteristics of basic electrical transducers.", "Basics of data acquisition.", "Function and characteristics of basic electrical transducers.", "Basics of data acquisition.", "Apply knowledge of engineering to the analysis and design of electrical circuits,", "Identify and solve engineering problems in the circuits’ area,", "Design electric systems, components for different required applications.", "Identify the fundamental tools of linear circuit analysis that will be useful to all engineers (learning the “alphabet” of circuits), Apply basic laws: Ohms law, KVL, KCL and power calculations, Measure resistive networks’ and simplify complicated networks, Analyze different circuit analysis techniques, Analyze and design different circuits using ideal op-amps, Examine circuits containing energy storage elements, Examine phasor frequency domain analysis, State and understand the fundamental of electrical transducers.", "Identify the fundamental tools of linear circuit analysis that will be useful to all engineers (learning the “alphabet” of circuits),", "Apply basic laws: Ohms law, KVL, KCL and power calculations,", "Analyze and design different circuits using ideal op-amps,", "Examine circuits containing energy storage elements,", "Examine phasor frequency domain analysis,", "State and understand the fundamental of electrical transducers.", "1 May 06-10 Introduction to Measurement System First week, no Lab", "2 May 13-17 Introduction to Basic concepts Current, Voltage, Power, Energy, and Circuit Elements,  Lab 1 activity", "3 May 20-24 Introduction to Ohm’s law, KCL, KVL, Circuits Resistances in Series & Parallel, Voltage Divider & Current Divider  Lab 2 activity", "8 June 24-28 Operational and Instrumentational Amplifiers  Lab 5 activity", "12 July 22-26 AC Circuit Analysis - II Lab Project", "13 July 29-30 Introduction to smart homes No Activity", "It is very important for students to attempt solving the problems on their own regularly to reinforce their comprehension of the concepts and analysis techniques presented throughout the term, and for after-exams happiness.", "KVL and KCL", "Circuits Resistances, Voltage Divider & Current Divider", "Midterms Week", "8 June 24-28", "Operational Amplifiers", "Capacitors and inductors", "AC Circuit Analysis", "Room Number", "TBD", "TBD", "Basharat Mehmood", "TBD", "E2-1786", "We will closely follow “Electrical Engineering: Principles & Applications” 7/E by Hambley, Pearson", "First, students will use theory to create a high-quality design for a sensor system, then they will test and validate their design.", "Notice of Recording", "EnveGeoe123 course include the independent development and practice of specific skills as mentioned above."]}, {"course_id": 12, "course_code": "GEOE 123", "course_name": "GEOE123 - Electrical Circuits and Instrumentation (0.50)", "term_name": "1B Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Electrical Circuits and Instrumentation Spring 2024", "11:30AM - 12:20PM E2 1732", "08:30AM - 09:20AM E2 1732", "Friday -", "Friday", "10:30AM - 12:20PM", "E-mail", "QNC 2609/ Microsoft Teams", "Duty", "E-mail", "Basharat Mehmood", "First Year Tutors and WEEF Lab Tas", "E2-1719B", "E2-1786", "Function and characteristics of basic electrical transducers.", "Basics of data acquisition.", "Function and characteristics of basic electrical transducers.", "Basics of data acquisition.", "Apply knowledge of engineering to the analysis and design of electrical circuits,", "Identify and solve engineering problems in the circuits’ area,", "Design electric systems, components for different required applications.", "Identify the fundamental tools of linear circuit analysis that will be useful to all engineers (learning the “alphabet” of circuits), Apply basic laws: Ohms law, KVL, KCL and power calculations, Measure resistive networks’ and simplify complicated networks, Analyze different circuit analysis techniques, Analyze and design different circuits using ideal op-amps, Examine circuits containing energy storage elements, Examine phasor frequency domain analysis, State and understand the fundamental of electrical transducers.", "Identify the fundamental tools of linear circuit analysis that will be useful to all engineers (learning the “alphabet” of circuits),", "Apply basic laws: Ohms law, KVL, KCL and power calculations,", "Analyze and design different circuits using ideal op-amps,", "Examine circuits containing energy storage elements,", "Examine phasor frequency domain analysis,", "State and understand the fundamental of electrical transducers.", "1 May 06-10 Introduction to Measurement System First week, no Lab", "2 May 13-17 Introduction to Basic concepts Current, Voltage, Power, Energy, and Circuit Elements,  Lab 1 activity", "3 May 20-24 Introduction to Ohm’s law, KCL, KVL, Circuits Resistances in Series & Parallel, Voltage Divider & Current Divider  Lab 2 activity", "8 June 24-28 Operational and Instrumentational Amplifiers  Lab 5 activity", "12 July 22-26 AC Circuit Analysis - II Lab Project", "13 July 29-30 Introduction to smart homes No Activity", "It is very important for students to attempt solving the problems on their own regularly to reinforce their comprehension of the concepts and analysis techniques presented throughout the term, and for after-exams happiness.", "KVL and KCL", "Circuits Resistances, Voltage Divider & Current Divider", "Midterms Week", "8 June 24-28", "Operational Amplifiers", "Capacitors and inductors", "AC Circuit Analysis", "Room Number", "TBD", "TBD", "Basharat Mehmood", "TBD", "E2-1786", "We will closely follow “Electrical Engineering: Principles & Applications” 7/E by Hambley, Pearson", "First, students will use theory to create a high-quality design for a sensor system, then they will test and validate their design.", "Notice of Recording", "EnveGeoe123 course include the independent development and practice of specific skills as mentioned above."]}, {"course_id": 13, "course_code": "CIVE 121", "course_name": "CIVE121 - Computational Methods (0.50)", "term_name": "1B Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Computational Methods Winter 2025", "08:30AM - 09:50AM RCH 302", "Introduction to computer programming, examples of efficient numerical algorithms for basic scientific computations.", "Programming and problem solving concepts introduced in the course will be incorporated into group projects involving civil, environmental, or geological engineering applications.", "MATLAB is an easy and readable programming language and is an excellent choice for those who are learning programming for the first time.", "Students who complete this course will gain a fundamental understanding of computer programming techniques and be able to operate, analyze, and visualize all types of data for future engineering studies.", "It is an introductory programming course that utilizes MATLAB to illustrate general concepts in computer programming.", "Compose working, efficient, and readable MATLAB scripts in various ways.", "Debug your code to identify and fix programming errors.", "Identify suitable keywords to search for code snippets on the web."]}, {"course_id": 14, "course_code": "ENVE 121", "course_name": "ENVE121 - Computational Methods (0.50)", "term_name": "1B Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Computational Methods Spring 2024", "08:30AM - 09:20AM", "03:30PM - 04:20PM", "08:30AM - 09:20AM E2 1732", "03:30PM -", "Introduction to computer programming, examples of efficient numerical algorithms for basic scientific computations.", "Programming and problem-solving concepts introduced in the course will be incorporated into projects involving architectural engineering applications.", "Introduction to computer programming, examples of efficient numerical algorithms for basic scientific computations.", "Programming and problem solving concepts introduced in the course will be incorporated into group projects involving civil, environmental, or geological engineering applications.", "MATLAB is an easy and readable programming language and is an excellent choice for those who are learning programming for the first time.", "Students who complete this course will gain a fundamental understanding of computer programming techniques and be able to operate, analyze, and visualize all types of data for future engineering studies.", "It is an introductory programming course that utilizes MATLAB to illustrate general concepts in computer programming.", "\"Linear algebra\" (AE/CIVE/ENVE/GEOE 115) is a prerequisite for this course, which you already learned in the 1A term.", "Folders", "Kahoot", "Compose working, efficient, and readable MATLAB scripts in various ways.", "Debug your code to identify and fix programming errors.", "Identify suitable keywords to search for code snippets on the web.", "Type and run all scripts of sample solutions in the course material and tutorial videos.", "Module 01 Basic MATLAB Programming N/A", "Module 05 Built-in Functions May 29", "Lectures are to deliver fundamental knowledge and information in each module and are not to give a direction on how to solve your homework assignments or quizzes.", "\"MATLAB-A Practical Introduction to Programming and Problem Solving,\" Elsevier, 2018.", "\"MATLAB for Engineers,\" Pearson, 2017.", "To encourage participation, when students ask at least one question each month in LEARN, they will receive 1 point of an engagement extra points each month.", "Please be respectful of your peers, instructor, and others in your posts and comments.", "It is a compilation of frequently asked questions for each Module.", "Students receive 1.5 point if they simply join ALL kahoot sessions in the corresponding module.", "Step 1: Go to the Kahoot!", "The instructor will show the pin number in each game.", "You are ready for joining the game", "For example, updating programming logic or shortening the scripts will be greatly helpful that you can employ such code in your future script.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Experience has shown that the students who copy friend's solutions do not know how to make them different and tend to not bother to change their friends' code."]}, {"course_id": 15, "course_code": "GEOE 121", "course_name": "GEOE121 - Computational Methods (0.50)", "term_name": "1B Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Computational Methods Spring 2024", "08:30AM - 09:20AM", "03:30PM - 04:20PM", "08:30AM - 09:20AM E2 1732", "03:30PM -", "Introduction to computer programming, examples of efficient numerical algorithms for basic scientific computations.", "Programming and problem-solving concepts introduced in the course will be incorporated into projects involving architectural engineering applications.", "Introduction to computer programming, examples of efficient numerical algorithms for basic scientific computations.", "Programming and problem solving concepts introduced in the course will be incorporated into group projects involving civil, environmental, or geological engineering applications.", "MATLAB is an easy and readable programming language and is an excellent choice for those who are learning programming for the first time.", "Students who complete this course will gain a fundamental understanding of computer programming techniques and be able to operate, analyze, and visualize all types of data for future engineering studies.", "It is an introductory programming course that utilizes MATLAB to illustrate general concepts in computer programming.", "\"Linear algebra\" (AE/CIVE/ENVE/GEOE 115) is a prerequisite for this course, which you already learned in the 1A term.", "Folders", "Kahoot", "Compose working, efficient, and readable MATLAB scripts in various ways.", "Debug your code to identify and fix programming errors.", "Identify suitable keywords to search for code snippets on the web.", "Type and run all scripts of sample solutions in the course material and tutorial videos.", "Module 01 Basic MATLAB Programming N/A", "Module 05 Built-in Functions May 29", "Lectures are to deliver fundamental knowledge and information in each module and are not to give a direction on how to solve your homework assignments or quizzes.", "\"MATLAB-A Practical Introduction to Programming and Problem Solving,\" Elsevier, 2018.", "\"MATLAB for Engineers,\" Pearson, 2017.", "To encourage participation, when students ask at least one question each month in LEARN, they will receive 1 point of an engagement extra points each month.", "Please be respectful of your peers, instructor, and others in your posts and comments.", "It is a compilation of frequently asked questions for each Module.", "Students receive 1.5 point if they simply join ALL kahoot sessions in the corresponding module.", "Step 1: Go to the Kahoot!", "The instructor will show the pin number in each game.", "You are ready for joining the game", "For example, updating programming logic or shortening the scripts will be greatly helpful that you can employ such code in your future script.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Experience has shown that the students who copy friend's solutions do not know how to make them different and tend to not bother to change their friends' code."]}, {"course_id": 16, "course_code": "CIVE 153", "course_name": "CIVE153 - Earth Engineering (0.50)", "term_name": "1B Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Earth Engineering Winter 2025", "Monday, Friday -", "08:30AM - 09:50AM RCH 302", "10:30AM - 11:20AM RCH 302", "10:30AM - 11:20AM RCH 305", "Keith Delaney", "Email: keith.delaney@uwaterloo.ca", "Email: anne.allen@uwaterloo.ca", "Email: jen.parks@uwaterloo.ca", "Azi Zebarjadian - a2zebarj@uwaterloo.ca", "The course develops a geological knowledge for applications to any physical environment and provides an appreciation of the impact of engineering work on the environment.", "Topics include mineral and rock identification, the rock cycle, structural geology and tectonics, geology of Canada, effects of water, ice and wind.", "Students are also introduced to the concept of geologic time, topographic and geologic maps, and the basic principles and tools used to determine geologic history.", "Gain insight into why engineers are continually challenged by the science behind a complex and changing earth.", "Understand and apply engineering design principles in the context of a changing earth.", "Gain basic experience in identifying earth materials and in earth material testing.", "Establish the academic background required to take advanced earth sciences and geotechnical engineering courses.", "Geology and Soils Labs: This course includes seven laboratory sessions that will be held during the term.", "Students need to self-organize into case study groups, with the same number of students in each group.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 17, "course_code": "ENVE 153", "course_name": "ENVE153 - Earth Engineering (0.50)", "term_name": "1B Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Earth Engineering Spring 2024", "Monday, Friday -", "10:00AM - 11:20AM E2 1732", "03:30PM - 04:20PM E2 1732", "The course develops a geological knowledge for applications to any physical environment and provides an appreciation of the impact of engineering work on the environment.", "Topics include mineral and rock identification, the rock cycle, structural geology and tectonics, geology of Canada, effects of water, ice and wind.", "Students are also introduced to the concept of geologic time, topographic and geologic maps, and the basic principles and tools used to determine geologic history.", "Gain insight into why engineers are continually challenged by the science behind a complex and changing earth.", "Understand and apply engineering design principles in the context of a changing earth.", "Gain basic experience in identifying earth materials and in earth material testing.", "Establish the academic background required to take advanced earth sciences and geotechnical engineering courses.", "Lecture & Deliverables Schedule:", "of", "4 May 26 L9: Earth systems L10: Earth systems L11: Igneous rocks", "of", "Lab Groups 201 & 203 Lab Groups 202 & 204", "4 May 26 Soils: Atterberg Limit – 201 & 203  Soils: Atterberg Limit – 202 & 204", "6 June 9 Geology: Minerals – 201 & 203  Geology: Minerals – 202 & 204", "8 June 23 Geology: Igneous Rocks – 201 & 203  Geology: Igneous Rocks – 202 & 204", "9 June 30 Geology: Sedimentary & Metamorphic Rocks – 201 & 203  Geology: Sedimentary & Metamorphic Rocks – 202 & 204", "10 July 7 Geology: Geological Maps – 201 & 203  Geology: Geological Maps – 202 & 204", "Soils labs are in DWE 1427", "Geology labs are in EIT 1013", "of", "Monday", "Friday", "(Design Day)", "Soils Report – Introduction"]}, {"course_id": 18, "course_code": "GEOE 153", "course_name": "GEOE153 - Earth Engineering (0.50)", "term_name": "1B Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Earth Engineering Spring 2024", "Monday, Friday -", "10:00AM - 11:20AM E2 1732", "03:30PM - 04:20PM E2 1732", "The course develops a geological knowledge for applications to any physical environment and provides an appreciation of the impact of engineering work on the environment.", "Topics include mineral and rock identification, the rock cycle, structural geology and tectonics, geology of Canada, effects of water, ice and wind.", "Students are also introduced to the concept of geologic time, topographic and geologic maps, and the basic principles and tools used to determine geologic history.", "Gain insight into why engineers are continually challenged by the science behind a complex and changing earth.", "Understand and apply engineering design principles in the context of a changing earth.", "Gain basic experience in identifying earth materials and in earth material testing.", "Establish the academic background required to take advanced earth sciences and geotechnical engineering courses.", "Lecture & Deliverables Schedule:", "of", "4 May 26 L9: Earth systems L10: Earth systems L11: Igneous rocks", "of", "Lab Groups 201 & 203 Lab Groups 202 & 204", "4 May 26 Soils: Atterberg Limit – 201 & 203  Soils: Atterberg Limit – 202 & 204", "6 June 9 Geology: Minerals – 201 & 203  Geology: Minerals – 202 & 204", "8 June 23 Geology: Igneous Rocks – 201 & 203  Geology: Igneous Rocks – 202 & 204", "9 June 30 Geology: Sedimentary & Metamorphic Rocks – 201 & 203  Geology: Sedimentary & Metamorphic Rocks – 202 & 204", "10 July 7 Geology: Geological Maps – 201 & 203  Geology: Geological Maps – 202 & 204", "Soils labs are in DWE 1427", "Geology labs are in EIT 1013", "of", "Monday", "Friday", "(Design Day)", "Soils Report – Introduction"]}, {"course_id": 19, "course_code": "ENVE 275", "course_name": "ENVE275 - Environmental Chemistry (0.50)", "term_name": "2A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Environmental Chemistry Winter 2025", "Equilibrium chemistry including Log-concentration diagrams, titration and buffering intensity, dissolution/precipitation, carbonate system, hardness, and complex formation.", "Classification, nomenclature, physical/chemical parameters and partitioning of organic compounds.", "Basic redox chemistry including: half cell reactions, Faraday and Nernst equations, and pE-pH diagrams.", "Appreciate the role of chemistry in environmental engineering.", "Develop the capabilities to solve problems by combining several chemistry concepts.", "Appreciate simple methods to determine dissolved ionic species in solution.", "Develop conceptual knowledge of equilibrium, equilibrium constant, and their applications to systems at equilibrium.", "Use chemical thermodynamics to estimate equilibrium.", "Calculate acid-base equilibria, buffering capacity and the role they play in environmental systems.", "Understand metal speciation and its relationship to pH.", "Estimate hardness and alkalinity.", "Develop skills for balancing oxidation-reduction reactions, and understand pE-pH diagrams.", "Write a simple laboratory report including data and analysis.", "Application of chemistry in environmental engineering; natural water and its composition; methods of expressing concentration: concentration units, electroneutrality; ionic strength.", "Week 3-4: Chemical reaction in aqueous solution"]}, {"course_id": 20, "course_code": "ERS 215", "course_name": "ERS215 - Environmental and Sustainability Assessment 1 (0.50)", "term_name": "2A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Environmental and Sustainability Assessment 1 Winter 2025", "Instructor: Felicitas Egunyu felicitas.egunyu@uwaterloo.ca", "An introduction to processes and techniques for incorporating environmental considerations in planning and evaluating proposals for future undertakings that may have significant social and biophysical effects.", "The course provides an overview of methodologies for, and controversies surrounding, the design and conduct of biophysical and socioeconomic impact studies, and the testing of reported findings.", "View requirements for ERS 215", "Key topics and themes will be elaborated on through videos and by regular attention to case studies.", "Assigned readings throughout the semester are critical for providing additional depth and breadth.", "Group reading discussion and assignments provide an opportunity for integrating key topics and themes, as well as for linking them with the broader scholarly literature on environmental assessment.", "From this course you will develop a key understanding of what an EA should be and therefore, you can apply this knowledge and understanding to any assessment act.", "Define the aims and objectives of environmental/impact assessments, as well as key terms and concepts in EA/IA", "Identify the roles and relevance of EA/IA as a potential venue that can contribute to sustainability", "Describe the different steps and components of an EA/IA process in Canada", "Apply EA/IA principles for best practices to case studies and critically analyze the strengths and weaknesses of environmental assessment", "Introduction to Environmental Impact Assessment: A Guide to Principles and Practice, 4th Edition.", "Introduction to Environmental Impact Assessment: A Guide to Principles and Practice, 4th Edition.", "Introduction to Environmental Impact Assessment: A Guide to Principles and Practice, 4th Edition.", "(Similar to A and A+ in the previous system)", "(Similar to B+ and A- in the previous system)", "(Similar to B- and B in the previous system)", "(Similar to D-, D and D+ in the previous system)", "(Similar to F and F+ in the previous system)", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 21, "course_code": "ENVE 223", "course_name": "ENVE223 - Differential Equations and Balance Laws (0.50)", "term_name": "2A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Differential Equations and Balance Laws Winter 2025", "10:00AM - 11:20AM RCH 309", "08:30AM - 09:20AM", "An introduction to ordinary differential equations with applications to mass and energy balance problems in engineering.", "Standard methods of solution of first and second order linear equations with constant coefficients.", "Numerical methods for solving ordinary differential equations.", "Many practical physical and engineering problems can be analyzed using mathematical models formulated in terms of ordinary differential equations; these often arise from the application of mass, momentum, or energy balance laws.", "The objective of this course is to equip engineering students with a working knowledge of the methods which are used to solve these equations.", "Differential equations are introduced, along with standard methods of solution for first and second order linear equations with constant coefficients.", "identify and differentiate between the various types of differential equations; with this knowledge, be able to identify the most appropriate method of solution", "pose appropriate boundary or initial conditions and solve that equation using standard methods for given a mathematical problem statement expressed in terms of a linear differential equation", "check whether a solution to a differential equation is correct", "think critically about a mathematical problem and evaluate the validity of results from mathematical methods", "appreciate the utility and value of having an education in mathematics as part of their training as an engineer", "Canadian Engineering Accreditation Board", "Piazza – Wiki-style Q&A; primary way to get & give text-based help in ENVE/GEOE 223", "Drop-in Hours", "Students are very welcome and encouraged to meet with the teaching team in scheduled drop-in hours.", "1 Jan 6-10 CH1: Introductory concepts and definitions, simply integrable and separable solutions", "2 Jan 13-17 CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties, substitution", "3 Jan 20-24 CH3: Applications of linear first-order ODEs", "4 Jan 27-31 CH4: Solving homogeneous linear higher-order ODEs with constant coefficients A1, Jan 28", "6 Feb 10-14 CH6: Applications of linear higher-order linear ODEs", "Reading Week & Family Day", "7 Feb 24-28 CH7: Slope fields and numerical solution of first-order ODEs A2, Feb 25", "Notes of Diffy Qs, Differential Equations for Engineers, Jiří Lebl, Creative Commons, 2024.", "Calculus for Engineers (4e), Donald Trim, Pearson, 2007.", "Common first-year calculus text.", "CH1: Introductory concepts & definitions, simply integrable & separable solutions 0.2,3; 1.1,3 15.1,2", "CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties; substitution 1.4", "CH3: Applications of linear first-order ODEs 1.4 15.2,3,5", "CH4: Solving homogeneous linear higher-order ODEs with constant coefficients 2.1-3 15.6-8", "CH5: Solving non-homogeneous linear higher-order ODEs with constant coefficients using the method of undetermined coefficients 2.5 15.9", "CH6: Applications of linear higher-order linear ODEs  2.4 15.10", "CH7: Slope fields and numerical solution of first-order ODEs 1.2,7", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "extenuating circumstance", "This course includes the independent development and practice of engineering specific skills.", "Campus Supports", "Library for research-based assignments"]}, {"course_id": 22, "course_code": "GEOE 223", "course_name": "GEOE223 - Differential Equations and Balance Laws (0.50)", "term_name": "2A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Differential Equations and Balance Laws Winter 2025", "10:00AM - 11:20AM RCH 309", "08:30AM - 09:20AM", "An introduction to ordinary differential equations with applications to mass and energy balance problems in engineering.", "Standard methods of solution of first and second order linear equations with constant coefficients.", "Numerical methods for solving ordinary differential equations.", "Many practical physical and engineering problems can be analyzed using mathematical models formulated in terms of ordinary differential equations; these often arise from the application of mass, momentum, or energy balance laws.", "The objective of this course is to equip engineering students with a working knowledge of the methods which are used to solve these equations.", "Differential equations are introduced, along with standard methods of solution for first and second order linear equations with constant coefficients.", "identify and differentiate between the various types of differential equations; with this knowledge, be able to identify the most appropriate method of solution", "pose appropriate boundary or initial conditions and solve that equation using standard methods for given a mathematical problem statement expressed in terms of a linear differential equation", "check whether a solution to a differential equation is correct", "think critically about a mathematical problem and evaluate the validity of results from mathematical methods", "appreciate the utility and value of having an education in mathematics as part of their training as an engineer", "Canadian Engineering Accreditation Board", "Piazza – Wiki-style Q&A; primary way to get & give text-based help in ENVE/GEOE 223", "Drop-in Hours", "Students are very welcome and encouraged to meet with the teaching team in scheduled drop-in hours.", "1 Jan 6-10 CH1: Introductory concepts and definitions, simply integrable and separable solutions", "2 Jan 13-17 CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties, substitution", "3 Jan 20-24 CH3: Applications of linear first-order ODEs", "4 Jan 27-31 CH4: Solving homogeneous linear higher-order ODEs with constant coefficients A1, Jan 28", "6 Feb 10-14 CH6: Applications of linear higher-order linear ODEs", "Reading Week & Family Day", "7 Feb 24-28 CH7: Slope fields and numerical solution of first-order ODEs A2, Feb 25", "Notes of Diffy Qs, Differential Equations for Engineers, Jiří Lebl, Creative Commons, 2024.", "Calculus for Engineers (4e), Donald Trim, Pearson, 2007.", "Common first-year calculus text.", "CH1: Introductory concepts & definitions, simply integrable & separable solutions 0.2,3; 1.1,3 15.1,2", "CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties; substitution 1.4", "CH3: Applications of linear first-order ODEs 1.4 15.2,3,5", "CH4: Solving homogeneous linear higher-order ODEs with constant coefficients 2.1-3 15.6-8", "CH5: Solving non-homogeneous linear higher-order ODEs with constant coefficients using the method of undetermined coefficients 2.5 15.9", "CH6: Applications of linear higher-order linear ODEs  2.4 15.10", "CH7: Slope fields and numerical solution of first-order ODEs 1.2,7", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "extenuating circumstance", "This course includes the independent development and practice of engineering specific skills.", "Campus Supports", "Library for research-based assignments"]}, {"course_id": 23, "course_code": "ENVE 224", "course_name": "ENVE224 - Probability and Statistics (0.50)", "term_name": "2A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Instructor (first-half)", "E2-3322", "TBD", "TBD", "TBD", "TBD", "TBD", "TBD", "TBD", "john.quilty", "spbuis", "Role of probability in engineering and decision-making under uncertainty.", "Basic probability concepts.", "Introduction to regression analysis.", "Introduction to design of experiments and statistical quality control.", "Probability concepts and statistics are used to quantify this “uncertainty” and hopefully reduce the “risk” in our design and decision-making.", "This course aims to introduce students to the basic concepts of probability and statistics.", "Mathematical Expectation", "Statistical Estimation", "Regression Analysis", "By the end of this course students should be able to understand and use the following concepts:", "Statistical estimation", "Hypothesis testing", "Regression analysis", "Probability and Statistics for Engineers and Scientists, 9th Ed.", "These problem sets are ungraded and meant for you to test and apply the concepts learned in the lectures.", "Notice of Recording"]}, {"course_id": 24, "course_code": "GEOE 224", "course_name": "GEOE224 - Probability and Statistics (0.50)", "term_name": "2A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Instructor (first-half)", "E2-3322", "TBD", "TBD", "TBD", "TBD", "TBD", "TBD", "TBD", "john.quilty", "spbuis", "Role of probability in engineering and decision-making under uncertainty.", "Basic probability concepts.", "Introduction to regression analysis.", "Introduction to design of experiments and statistical quality control.", "Probability concepts and statistics are used to quantify this “uncertainty” and hopefully reduce the “risk” in our design and decision-making.", "This course aims to introduce students to the basic concepts of probability and statistics.", "Mathematical Expectation", "Statistical Estimation", "Regression Analysis", "Mathematical Expectation", "Statistical Estimation", "Regression Analysis", "Probability and Statistics for Engineers and Scientists, 9th Ed.", "These problem sets are ungraded and meant for you to test and apply the concepts learned in the lectures.", "Notice of Recording"]}, {"course_id": 25, "course_code": "ENVE 280", "course_name": "ENVE280 - Fluid Mechanics (0.50)", "term_name": "2A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Fluid Mechanics Winter 2025", "10:00AM - 11:20AM RCH 103", "02:30PM - 04:20PM E3 2103", "02:30PM - 04:20PM E3 2103", "02:30PM - 04:20PM E3 2103", "08:30AM - 09:20AM", "10:00AM - 11:20AM RCH 103", "TA office hours will be announced in the first week of the term.", "An introduction to fluid mechanics.", "Fluid properties.", "The momentum equation and applications.", "Characterize fluids and fluid systems based on their properties and system variables", "2. Analyze and compute static fluid pressures, forces, and moments", "3. Evaluate mathematical models of basic dynamic fluid systems using principles of mass conservation, energy conservation, and momentum conservation", "4. Design basic pipe and pumped systems for viscous liquids", "Communicate laboratory findings through clear and concise reporting", "1 Jan 07 Welcome, Syllabus, and Introduction to Fluid Mechanics", "Jan 30 Fluid Motion and Continuity", "Feb 27 Dimensional Analysis", "8 Mar 04 Darcy-Weisbach Friction Factor", "9 Mar 11 Pipe design I", "It will follow a closed-book format, with an equation sheet provided as part of the exam booklet.", "Labs will be conducted in groups of four.", "The labs will be conducted in E3-2103.", "Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca"]}, {"course_id": 26, "course_code": "GEOE 280", "course_name": "GEOE280 - Fluid Mechanics (0.50)", "term_name": "2A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Fluid Mechanics Winter 2025", "10:00AM - 11:20AM RCH 103", "02:30PM - 04:20PM E3 2103", "02:30PM - 04:20PM E3 2103", "02:30PM - 04:20PM E3 2103", "08:30AM - 09:20AM", "10:00AM - 11:20AM RCH 103", "TA office hours will be announced in the first week of the term.", "An introduction to fluid mechanics.", "Fluid properties.", "The momentum equation and applications.", "Characterize fluids and fluid systems based on their properties and system variables", "2. Analyze and compute static fluid pressures, forces, and moments", "3. Evaluate mathematical models of basic dynamic fluid systems using principles of mass conservation, energy conservation, and momentum conservation", "4. Design basic pipe and pumped systems for viscous liquids", "Communicate laboratory findings through clear and concise reporting", "1 Jan 07 Welcome, Syllabus, and Introduction to Fluid Mechanics", "Jan 30 Fluid Motion and Continuity", "Feb 27 Dimensional Analysis", "8 Mar 04 Darcy-Weisbach Friction Factor", "9 Mar 11 Pipe design I", "It will follow a closed-book format, with an equation sheet provided as part of the exam booklet.", "Labs will be conducted in groups of four.", "The labs will be conducted in E3-2103.", "Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca"]}, {"course_id": 27, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "2B Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}, {"course_id": 28, "course_code": "ENVE 277", "course_name": "ENVE277 - Air Quality Engineering (0.50)", "term_name": "2B Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Basic atmospheric science and meteorology to support the fate and transport of air pollutants.", "Overview of control and treatment methods.", "Indoor air exposure estimates and the function of the HVAC components.", "Understand the basics of current and emerging atmospheric issues", "Be familiar with control and treatment methods and perform simple designs to mitigate air quality issues", "3 Sep 23-27 Atmospheric Issues 3 2/3 A1 (Ch.1-3)", "Introduction to Atmospheric Chemistry, Daniel J. Jacob, Princeton University Press, 2000.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}]