[{"course_id": 33, "course_code": "BIOL 382", "course_name": "BIOL382 - Computational Modelling of Cellular Systems (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Computational Modelling of Cellular Systems Winter 2024", "08:30AM - 09:50AM MC 4061", "B. Ingalls", "An introduction to dynamic mathematical modeling of cellular processes.", "The emphasis is on using computational tools to investigate differential equation-based models.", "This course provides an introduction to dynamic mathematical modeling of cellular processes.", "The emphasis will be on using computational tools to investigate models of cellular phenomena.", "The course then addresses models in four biological domains: metabolic networks, signal transduction pathways, gene regulatory networks and electrophysiology.", "Intended Audience: Third and fourth year students interested in dynamic modelling in molecular cell biology.", "Software: We will be making heavy use of packages for numerical simulation of differential equations.", "Appendix C of the course notes consists of tutorials on MATLAB and XPPAUT, which is a GUI-based package for dynamical systems analysis.", "Design and simulate ordinary differential equation models of chemical reaction networks", "Investigate differential equation models using phase plane analysis, sensitivity analysis, and bifurcation analysis", "Develop and interpret differential equation models of biomolecular networks in the context of cellular metabolism, signal transduction, gene regulation, and electrophysiology", "Design and simulate stochastic models of gene regulatory networks", "Provide critical analysis of kinetic models of intracellular networks in the scientific literature and communicate their potential and limitations", "Kinetic Modelling of Biochemical Networks", "Module 3. Dynamics and Stability", "Mathematical Modeling of Systems Biology posted: https://www.math.uwaterloo.ca/~bingalls/MMSB/ Yes", "Term project will be completed in groups of two.", "Oral presentations will be in person during 20-minute time-slots scheduled during the last week of lectures (45% of project grade)", "Notice of Recording"]}, {"course_id": 34, "course_code": "CO 351", "course_name": "CO351 - Network Flow Theory (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["In case of (medical or other) emergencies, or private issues, send E-mail to the instructor.", "Network simplex and primal-dual algorithms.", "Applications to problems of transportation, distribution, job assignments, and critical-path planning.", "The course covers mathematical models for optimization problems on networks.", "The max-flow-min-cut theorem has many applications including its implication of the Menger theorem in graph theory.", "Additionally, the course presents several algorithms for solving optimization problems on networks.", "Linear programming and LP duality are central to the design and analysis of some of the algorithms.", "- maximum flows and minimum cuts (max-flow/min-cut theorem, preflow-push algorithm);", "- applications to problems in transportation, distribution, job assignments, and critical-path planning, etc.", "1 Sep. 4-6 Review linear programming and graph theory", "4 Sep. 23-27 Shortest di-paths problem A1", "11 Nov. 18-22 Minimum cost flow A4", "\"Network Flow Algorithms\" (grad-level book) by D.P.Williamson http://www.networkflowalgs.com/ No", "This is a closed-book exam.", "This is a closed-book exam.", "Students are advised to invest in a reliable internet connection and a reliable device (for a fraction of the cost of UW tuition).", "The answer to most common issues as well as how-to videos can be found at"]}, {"course_id": 35, "course_code": "CO 370", "course_name": "CO370 - Deterministic OR Models (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Deterministic OR Models Winter 2025", "Mahtab Alghasi: Wednesdays from 11am-12pm in MC5488", "An applications-oriented course that illustrates how various mathematical models and methods of optimization can be used to solve problems arising in business, industry, and science.", "Formulate computational tasks as optimization problems of appropriate type", "Understand optimization concepts surrounding real world challenges (sensitivity analysis, robust optimization, stochastic optimization)", "Have some familiarity with algorithmic techniques and heuristics for solving optimization problems", "Part I: Formulations", "Flows", "Integer Programs that reduce to Linear Programs", "Part 2: Real World Challenges that can be addressed in Optimization", "Robust optimization", "Stochastic Optimization", "Part 3: Algorithms and Heuristics for Solving Optimization", "Branch and Bound", "Please sign yourself up at", "A missed test will be treated the same as a mark of zero.", "The answer to most common issues as well as how-to videos can be found at", "To avoid issues, only use your UWaterloo email, never use multiple email addresses.", "Illnesses and INC", "In case of a", "short period of illness and a strong performance in the course we should be able to simply", "Copyright Information"]}, {"course_id": 36, "course_code": "CO 372", "course_name": "CO372 - Portfolio Optimization Models (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Portfolio Optimization Models Fall 2024", "10:00AM - 11:20AM MC 2034", "Computational optimization methodologies underlying portfolio problems in finance.", "Computational linear algebra, determining derivatives, quadratic, and nonlinear optimization.", "Applications of optimization in finance such as volatility surface determination and global minimization for value-at-risk.", "Assignments include formulation and analysis of models used in portfolio optimization as well as some Matlab coding.", "Analyze and code optimization methods for portfolio models.", "Week 1: Linear algebra review", "Week 2: Solving a portfolio optimization problem with QR factorization; symmetric matrices", "Week 3: Three formulations of portfolio optimization", "Week 5: Risk-free security; Sharpe ratio; capital market line", "Week 7: Numerical linear algebra; null space method", "Week 8: Active set methods and parametric programming", "Week 11: Nonlinear programming and applications to portfolio optimization", "Week 12: Advanced topics: arbitrage, factor models, conditional independence, risk parity, machine learning in portfolio optimization", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course.", "·   In Fall 2022, a second self-declaration form was created for students to declare a short-term absence."]}, {"course_id": 38, "course_code": "CO 452", "course_name": "CO452 - Integer Programming (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Formulation of problems as integer linear programs.", "Solution by branch-and-bound and cutting plane algorithms.", "Introduction to the theory of valid inequalities and polyhedral combinatorics.", "Integer Programming is a mathematical program that can be seen as a linear program with the additional requirement that some (or all) of the variables are required to take on integer values.", "While linear programming is already very useful in modeling problems and can be solved well using either interior point methods or the simplex method, {\\bf Integer programs, or IPs} have a much broader range of applications.", "In this course we will explore an upper-level undergraduate/basic graduate introduction to the topic of Integer Programming.", "Understand basic theory and algorithms behind integer programming approaches", "Basic geometric definitions: Convex/affine/linear combinations.", "Basic polyhedral theory: Faces, facets, extreme points.", "Integral polyhedra and Total Dual Integrality.", "Union of polyhedra and representability.", "Equivalence of optimization and separation.", "Gomory cuts and other cutting planes.", "Rank and closures.", "Branch-and-bound: Basic ideas and extensions.", "Theoretical and computational results.", "This includes technical problems in your submission, like power outage, no internet access, etc.", "Collaboration", "Re-marking policies", "Note that your solution will be very carefully examined during a re-mark.", "In addition such student needs to be in good standing.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as undertanding theory and algorithms for some classes of optimization models.", "Library for research-based assignments"]}, {"course_id": 39, "course_code": "CO 454", "course_name": "CO454 - Scheduling (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Scheduling Spring 2024", "10:00AM - 11:20AM DWE 3517", "E-mail : nikhil.kumar2@uwaterloo.ca", "An overview of practical optimization problems that can be posed as scheduling problems.", "Simple and efficient combinatorial algorithms for easy problems.", "Scheduling problems form a large part of resource allocation problems where sparse resources have to be assigned over time to complete tasks and optimize over one or multiple objectives.", "The course will also contain a brief overview of computational complexity and various techniques for the design of efficient exact and approximate algorithms.", "Scheduling problems: Modeling and notations", "Single-machine Models, Optimal schedules, Exact algorithms", "Computational complexity - P, NP, NP-completeness.", "Multiple-machine models, approximation algorithms.", "Dynamic Programming and its application to scheduling", "Linear and Integer Programming techniques", "Scheduling: Theory, Algorithms, and Systems Author: Michael Pinedo No", "Algorithm Design Authors: Jon Kleinberg and Eva Tardos No"]}, {"course_id": 40, "course_code": "CO 456", "course_name": "CO456 - Introduction to Game Theory (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Game Theory Fall 2024", "A broad introduction to game theory and its applications to the modeling of competition and cooperation in business, economics, and society.", "Classical game theory studies the competitive and cooperative behaviour of rational and self‐interested individuals in strategic environments.", "It speciﬁcally develops beautiful analytic tools to analyze and model situations in which a person’s welfare is a function not only of their own actions, but also those of others.", "This course is meant to be a broad and mathematical introduction to game theory and its appications.", "We will attempt to cover these topics:", "This class is meant to be a broad and mathematical introduction to game theory and its applications.", "Game Theory Basics, Bernhard von Stengel http://www.maths.lse.ac.uk/personal/stengel/lectnotes1-7.pdf No", "An Introduction to Game Theory, Martin J. Osborne https://www.economics.utoronto.ca/osborne/igt/ No", "Mechanism Design and Approximation, Jason D. Hartline http://jasonhartline.com/MDnA/ No", "As the title implies, a basic introduction to various topics in game theory.", "An introduction to game theory and equilibria from a computer science perspective.", "An Introduction to Game Theory, Martin J. Osborne.", "The text contains a section on game theory, and some chapters about matching games.", "Mechanism Design and Approximation, Jason D. Hartline.", "These notes were written for a graduate class, and cover mechanism design from an advanced perspective.", "Your submission must be clear and legible, and in the correct orientation.", "You are expected to work on the assignment problems and submit them well ahead of the deadline, in case of technical difficulty.", "You must write up your own solutions without seeking help from anyone, and list the names of your collaborators in each of the assignment problems involved.", "This is a closed-book exam, no aids are allowed.", "A missed test will be treated the same as a mark of zero.", "This is a closed-book exam, no aids are allowed.", "Re-marking policies", "Note that your solution will be very carefully examined during a re-mark.", "In case of serious illness during the final exam, you may be granted a grade of INC provided that", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as finding Nash equilibria and applying game theory to real life applications.", "Library for research-based assignments"]}, {"course_id": 41, "course_code": "CO 463", "course_name": "CO463 - Convex Optimization and Analysis (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Convex Optimization and Analysis Winter 2024", "An introduction to the modern theory of convex programming, its extensions and applications.", "Structure of convex sets, separation and support, subgradient calculus for convex functions, Fenchel conjugacy and duality, Lagrange multipliers.", "Ellipsoid method for convex optimization.", "Determine whether sets and functions are convex and supply a proof", "Compute conjugates and subdifferentials of convex functions and duals of norms", "Determine Lagrange duals and necessary and sufficient conditions for convex optimization problems", "Recognize standard forms of convex programming", "Implement some convex optimization algorithms and use a convex optimization modeling language", "Convex sets", "Convex functions", "Characterization in terms of first and second derivative", "Conjugacy", "Norms and sublinear functions", "Convex optimization", "Standard forms of convex programming", "Basics of monotone operator theory", "First-order methods", "H. Bauschke and P. Combettes, Convex analysis and monotone operator theory in Hilbert spaces, 2017.", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 43, "course_code": "CO 471", "course_name": "CO471 - Semidefinite Optimization (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Semidefinite Optimization Spring 2023", "04:00PM - 05:20PM", "Optimization over convex sets described as the intersection of the set of symmetric, positive semidefinite matrices with affine spaces.", "Theoretical and practical consequences of these formulations.", "Duality theory and algorithms.", "Optimization over convex sets described as the intersections of the set of symmetric, positive semidefinite matrices with affine spaces.", "Formulations of problems from combinatorial optimization, graph theory, number theory, probability and statistics, engineering design and control theory.", "Theoretical and practical consequences of these formulations.", "Duality theory and algorithms.", "Topics Include: Optimization over convex sets described as the intersection of the set of symmetric, positive semideﬁnite matrices with aﬃne spaces: Semideﬁnite optimization vastly generalizes linear programming where variable vectors may be replaced with matrix variables and, in addition to linear equations and inequalities, one may utilize constraints requiring some of the matrix variables to be symmetric and positive semideﬁnite.", "duality theory for semideﬁnite optimization,", "algorithms for semideﬁnite optimization: ellipsoid method, ﬁrst‐order methods and primal‐dual interior‐point methods for semideﬁnite optimization, and approximation algorithms based on semideﬁnite optimization,", "formulations of problems from combinatorial optimization, graph theory, number theory, probability and statistics, complexity analysis of algorithms, engineering design and control theory, theoretical and practical consequences of these formulations,", "Polyhedral and Semidefinite Programming Methods in Combinatorial Optimization"]}, {"course_id": 44, "course_code": "CO 485", "course_name": "CO485 - The Mathematics of Public-Key Cryptography (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["The Mathematics of Public-Key Cryptography Fall 2024", "08:30AM - 09:50AM DWE 3517", "An in-depth study of public-key cryptography.", "Public-key encryption, digital signatures, key establishment, elliptic curve cryptography, post-quantum cryptography.", "An in-depth study of public-key cryptography, including: number-theoretic problems - prime generation, integer factorization, discrete logarithms; public-key encryption; digital signatures; key establishment; elliptic curve cryptography; post-quantum cryptography; and security proofs.", "An in-depth study of public-key cryptography and number-theoretic problems related to the efficient and secure use of public-key cryptographic schemes.", "Algorithmic number theory: Primality testing, integer factorization problem, discrete logarithm problem, elliptic curve discrete logarithm problem.", "Additional topics: Pairing-based cryptography, post-quantum cryptography.", "An Introduction to Mathematical Cryptography (2nd ed.), Hoffstein, Pipher, and Silverman.", "The quizzes are intended to reinforce basic concepts that are, in some sense, \"too easy\" to put in an assignment (e.g., definitions, simple calculations).", "Assignments: Right now I expect a total of 6 assignments in the course.", "Late assignments will be given a grade of 0 and I reserve the right not to grade them.", "Exception: Any student who self-declares a short-term absence overlapping with an assignment due date receives a 48-hour extension on the assignment without penalty, and assignments submitted within this extension period will be graded."]}, {"course_id": 45, "course_code": "CO 487", "course_name": "CO487 - Applied Cryptography (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Instructor: Samuel Jaques", "Email: sejaques@uwaterloo.ca", "Timothy Miller", "Nicolas Swanson", "A broad introduction to modern cryptography, highlighting the tools and techniques used to secure internet and messaging applications.", "It is one of the core technologies for securing the emerging information infrastructure.", "This course is a comprehensive introduction to modern cryptography that is aimed primarily at those interested in applications.", "In the area of public-key cryptography, topics will include an overview of specific systems (Diffie–Hellman, RSA, DSA, etc.) and a few advanced protocols.", "The security of these schemes and the use of public-key techniques for generating digital signatures will be described.", "Linear and differential cryptanalysis of ciphers.", "Define the main information security goals of confidentiality, integrity, authentication, and availability", "Explain the intended security properties of each cryptographic primitive and analyze relationships between security properties", "Explain mathematical techniques underlying standardized cryptographic algorithms", "Identify flaws in uses of cryptographic algorithms", "Determine which cryptographic algorithms can be used and combined to build systems with desired functionality and security", "Understand and contextualize the cryptography and security around them in daily life", "0 1 (Jan 6-8) Introduction", "Symmetric Encryption", "3.6 9 Elliptic Curve Cryptography 4 Yes", "4   Applications", "Understanding Cryptography: From Established Symmetric and Asymmetric Ciphers to Post-Quantum Algorithms, 2nd edition, Springer, 2024 Primary reference.", "A1: January 23", "A4: March 20", "This will be clearly indicated for each such question.", "In that case you are required to work independently.", "These questions will test your ability to identify the important concepts introduced in lectures, and your understanding of them.", "In particular:", "Please inform us of these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 46, "course_code": "CS 341", "course_name": "CS341 - Algorithms (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Algorithms Winter 2025", "10:00AM - 11:20AM MC 4061", "08:30AM - 09:50AM MC 1056", "The study of efficient algorithms and effective algorithm design techniques.", "Topics include divide and conquer algorithms, recurrences, greedy algorithms, dynamic programming, graph search and backtrack, problems without algorithms, NP-completeness and its implications.", "DPV", "Introduction to Algorithms, by Cormen, Leiserson, Rivest and Stein, MIT Press.", "describe the main idea first,", "Extensions and Other Accommodations on Assignments", "Students can currently self-declare two kinds of absences on Quest: short-term absence and pandemic-related absence.", "Since a short-term absence lasts 2 days, this means the only accommodation we offer for a short-term absence is a 48 hour extension.", "If you request accommodations through AccessAbility Services (AAS) by filling out a Missed Course Component form, the accommodation is determined on a case-by-case basis through consultation with AAS, but will generally be one of the above options unless your situation is unusual.", "If you collaborate with others, you must clearly indicate the collaboration for each problem.", "This is not a software engineering course; we will not test your code against inputs that do not match our specifications.", "Continuity Plan", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 47, "course_code": "CS 431", "course_name": "CS431 - Data-Intensive Distributed Analytics (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Data-Intensive Distributed Analytics Fall 2024", "10:00AM - 11:20AM MC 2035", "Introduces non-CS major students to infrastructure for data-intensive analytics, with a focus on abstractions, frameworks, and algorithms that allow developers to distribute computation across many machines.", "Topics include core concepts (partitioning, replication, locality, consistency), computational models (MapReduce, dataflows, stream processing, bulk-synchronous parallel), and applications.", "Explain the key concepts in distributed big data projects", "Write clean and efficient Hadoop MapReduce and Spark code", "Understand and design distributed algorithms for the analysis of textual, graph, and relational data", "Explain the design issues involved with distributed relational and non-relational database systems such as Apache HBase / Google BigTable", "Introduction to Distributed Text Processing 1", "Introduction to Hadoop MapReduce 3", "Introduction to Apache Spark 3", "Distributed Database Systems 3", "This course includes the independent development and practice of specific skills, such as designing MapReduce and Spark code.", "Library for research-based assignments"]}, {"course_id": 48, "course_code": "CS 451", "course_name": "CS451 - Data-Intensive Distributed Computing (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Data-Intensive Distributed Computing Winter 2025", "10:00AM - 11:20AM MC 2017", "RCH 307", "10:00AM - 11:20AM MC 2017", "RCH 307", "Introduces students to infrastructure for data-intensive computing, with a focus on abstractions, frameworks, and algorithms that allow developers to distribute computations across many machines.", "Topics include core concepts (partitioning, replication, locality, consistency), computational models (MapReduce, dataflows, stream processing, bulk-synchronous parallel), and applications.", "Explain the key concepts in distributed big data projects", "Write clean and efficient Hadoop MapReduce and Spark code", "Understand and design distributed algorithms for the analysis of textual, graph, and relational data", "Explain the design issues involved with distributed relational and non-relational database systems such as Apache HBase / Google BigTable", "Introduction to Distributed Text Processing 1", "Introduction to Hadoop MapReduce 3", "Introduction to Apache Spark 3", "Distributed Database Systems 3", "This course includes the independent development and practice of specific skills, such as designing MapReduce and Spark code.", "Library for research-based assignments"]}, {"course_id": 49, "course_code": "CS 466", "course_name": "CS466 - Algorithm Design and Analysis (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Algorithm Design and Analysis Fall 2024", "Monday -", "Monday", "Sepehr Assadi - sassadi@uwaterloo.ca", "MohammadHossein Ebtehaj - mhebtehaj@uwaterloo.ca", "General information", "Mathematical maturity, and a strong background in probability, data structures, and algorithm design.", "I invite you to let me know about what I can stop, start, or continue doing to make sure every one of my students feels valued and can engage actively in our learning community.", "This is an advanced algorithm design and analysis course, aimed at undergraduate students interested in a deep dive in theoretical computer science (TCS), as well as graduate students doing research in TCS.", "Probabilistic analysis: Randomized algorithms, Concentration inequalities, Balls-and-bins", "Linear programming: Basics, Duality, Center-of-gravity algorithm, Rounding", "Multiplicative weight update (MWU): Expert problem, Fast packing/covering linear programs", "Random walks: Connectivity in RL, Perfect matchings in regular bipartite graphs, Sampling", "Dynamic graph algorithms: Connectivity, Approximate matching", "Parallel algorithms: Matching in RNC, Isolation lemma", "design and analyze algorithms for a wide range of canonical problems studied in this course, and even more importantly, for new problems that you may have not encountered directly yet,", "know a wide range of algorithmic and mathematical tools commonly used in design and analysis of algorithms, and", "have a basic familiarity with various algorithmic models of computation studied in TCS.", "Probabilistic Background and Concentration inequalities", "Streaming distinct elements, Limited independence hash functions", "Balls-and-bins experiments: Power of two choices via random graph theory", "MSTs: Basics, Fredman-Tarjan algorithm", "MSTs: Karger-Klein-Tarjan algorithm", "Linear programming (LP): Basics and Applications", "Linear Programming (LP): Duality and Integrality gaps", "Linear Programming (LP): More on Integrality gaps, Dual fitting for set cover", "Linear Programming (LP): Primal-dual for bipartite matching", "Online matching with a primal-dual analysis", "Graph sketches: Connectivity and L0-samplers", "Random walks: fundamental theorem of Markov chains, connectivity in RL", "Random walks: Perfect matching in regular bipartite graphs", "DP09 Devdatt P. Dubhashi and Alessandro Panconesi, Concentration of Measure for the Analysis of Randomised Algorithms.", "V20 Nisheeth K. Vishnoi, Algorithms for Convex Optimization.", "AHK12", "Please refer to the Course Webpage for a list of papers related to the topics discussed in the lectures.", "This is a list of some other closely related courses taught elsewhere:", "Randomised and Advanced Algorithms, Winter 2024 by Clément Canonne @ University of Sydney.", "Advanced Algorithms, Spring 2023 by Anupam Gupta @ CMU.", "Advanced Algorithms, Fall 2021 by Mohsen Ghaffari @ ETH.", "Advanced Algorithm Design, Fall 2022 by Matt Weinberg and Huacheng Yu @ Princeton.", "Advanced Topics in Algorithms, Fall 2021 by Kent Quanrud @ Purdue.", "Advanced Algorithms, Winter 2020 by Aleksandar Nikolov @ University of Toronto.", "CS466/666: Algorithm Design and Analysis, Spring 2024 by Rafael Oliveira", "CS466/666: Algorithm Design and Analysis, Fall 2024 by Sepehr Assadi", "CS466/666: Algorithm Design and Analysis, Fall 2022 by Therese Biedl", "CS466/666: Algorithm Design and Analysis, Spring 2022 by Lap Chi Lau", "Course Project (only for graduate students in CS 666) 15%", "15% Course Project (only for graduate students in CS 666)", "The solutions should be turned in as a single pdf file containing the answers to the assignment questions in order.", "For students: LaTeX tremendously helps you in writing clean and well-structured proofs (a necessity for a rigorous proof ) as well as editing an already written proof further.", "For submissions, only one member of the group submits the full solutions on Crowdmark and lists the name of their partners in the group.", "In this case, all members of the group lose one of their extensions.", "However, you can bring in a one-page cheat sheet with you to the exam.", "The final exam follows the same policies as the mid-term exam for blank solutions, one-page cheat sheet, and missed exams.", "Course Project (only for graduate students registered in CS 666)", "Policies and Statements", "Email is fast and tends to give the illusion of constant and immediate access.", "Also, please use email only to communicate specific concerns, questions, or comments regarding your experience in the course, or setting up appointments for in-person meetings outside office hours in case necessary.", "I am using bunch of different email filters to manage my (unmanageable) inbox and I may not get to see emails without this format at all...", "Please let us know ways to improv", "Please inform us of these at the start of the course.", "Your Health & Well-Being", "This is a challenging course with various advanced topics and not-so-easy assignments and exams.", "All of these are going to be time and energy consuming.", "I expect that any assignment or exam you submit in this course will be your own product and follows the collaboration and external resources policies specified earlier in this course outline.", "Intellectual property includes items such as:"]}, {"course_id": 50, "course_code": "CS 476", "course_name": "CS476 - Numeric Computation for Financial Modeling (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Numeric Computation for Financial Modeling Winter 2025", "10:00AM - 11:20AM MC 2035", "Erik Hintz", "The interaction of financial models, numerical methods, and computing environments.", "Basic computational aspects of option pricing and hedging.", "Numerical methods for stochastic differential equations, strong and weak convergence.", "Finite difference methods for the Black-Scholes equation.", "Methods for portfolio optimization, effect of data errors on portfolio weights.", "The interaction of financial modes, numerical methods, and computing environments.", "Basic computational aspects of option pricing and hedging.", "Numerical methods for stochastic differential equations, strong and weak convergence.", "Finite difference methods for Black-Scholes equation.", "Methods for portfolio optimization, effect of data errors on portfolio weights.", "apply and understand modern numerical algorithms for use in financial applications.", "The following are the tentative topics in chronological order:", "Introduction to financial markets:", "Introduction to stocks, bonds, options", "no arbitrage pricing", "option pricing on lattices", "Black Scholes model and Ito's Lemma", "Random variate generation", "Option pricing", "VaR and CVaR estimation", "Correlate assets", "PDEs for European and American Options", "Explicit and Implicit Finite Difference Methods", "4. Calibration and Optimization", "Option model calibration", "CVaR portfolio optimization", "non-linear optimzation", "Your Crowdmark submission must include all code and relevant output; code must be reasonably well commented.", "The first weeks will be spent on introducing some basics of financial markets/financial mathematics.", "), usually a make-up examination will take place at a time mutually agreed-upon.", "To have your document considered for regrading you must formulate a request in writing by email to the instructor, providing the problem and a reason for why you believe it should be regraded.", "A mechanic encounters a problem, analyzes it, and fixes it with the tools from her/his toolbox."]}, {"course_id": 51, "course_code": "CS 479", "course_name": "CS479 - Neural Networks (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["04:00PM - 05:20PM", "04:00PM - 05:20PM", "Mohamed Hibat-Allah", "Xinyu Crystina Zhang", "Andy Zheng", "Junteng Zheng", "Simple neuron models and networks of neurons.", "Advanced topics, including adversarial inputs and biologically plausible learning methods.", "Formulate a neural learning method as gradient-based optimization", "Derive a neural learning method based on energy minimization", "Design neural-network solutions for different learning scenarios", "Identify some commonalities between artificial neural networks and the brain", "-", "Introduction, Neuron Models", "Hodgkin-Huxley", "Leaky Integrate-and-Fire", "-", "Synapses", "Formulation of Learning", "Loss functions", "-", "Error Backpropagation", "-", "Automatic Differentiation", "-", "Overfitting", "Optimization Considerations", "SGD", "Momentum", "-", "Vision", "-", "No classes", "-", "-", "Autoencoders", "Vector Embeddings", "-", "Advanced Autoencoders", "Diffusion Networks", "-", "-", "Population Coding", "Optimal linear decoding", "Transformations", "Dynamics", "-", "Biological backprop", "Instructions will be given for each programming assignment.", "A1 Jan 22 Neuron and synapse models", "A4 Mar 19 Recurrent networks", "The projects will be done in groups of 2 students, and will involve implementing a method from a paper, and reproducing some of its results.", "Continuity of In-Person Course Components", "The assignment procedures will not be affected by a cancellation of in-person classes since they are distributed and submitted online.", "Students will be given a 24-hour period during which the exam must be written.", "What you can do: GenAI can be used as a smart substitute for Google search, e.g., code debugging, finding plotting commands.", "What you can't do: GenAI must not be used to code up the logic of a solution, or part of a solution."]}, {"course_id": 52, "course_code": "CS 480", "course_name": "CS480 - Introduction to Machine Learning (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Machine Learning Winter 2025", "10:00AM - 11:20AM DWE 1501", "Introduction to modelling and algorithmic techniques for machines to learn concepts from data.", "Optimization-based learning: loss minimization. regularization.", "This is especially useful in complex tasks such as natural language processing, information retrieval, data mining, computer vision and robotics where it is not practical for a programmer to enumerate all possible situations in order to specify suitable instructions for all situations.", "The course will introduce the basics of machine learning and data analysis, and demonstrate how machine learning techniques have impacted life and society.", "The course starts with some classical tasks and algorithms in machine learning, then transitions to modern advances and successful applications in real life, and finally ends with discussions on the societal impact that machine learning has generated.", "A significant part of the course will be devoted to raising students' awareness on such ethical issues, including how to make machine learning algorithms fair and unbiased, how to protect individual privacy without compromising learning, how machine learning algorithms might be attacked, how to measure and improve the security of machine learning algorithms, and how to make machine learning algorithms explainable and interpretable.", "Recognize and formalize a task as a machine learning problem", "Identify suitable algorithms to tackle different machine learning problems", "Understand and implement a plethora of foundational machine learning algorithms", "Apply machine learning algorithms to real datasets", "Become aware of potential ethical and safety issues of machine learning on society", "Introduction (first lecture: Jan 7, 2025)", "Linear Regression", "Reproducing Kernels", "Multi-layer Perceptron", "Deep Neural Networks", "Attention", "Decision Trees", "Flow Models", "Variational Autoencoders", "Diffusion Models"]}, {"course_id": 53, "course_code": "CS 482", "course_name": "CS482 - Computational Techniques in Biological Sequence Analysis (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Computational Techniques in Biological Sequence Analysis Winter 2025", "P. Millan Arias", "Dr. Pablo Millan Arias", "Email: pmillana[at]uwaterloo[dot]ca", "Email: mmwrana@uwaterloo.ca", "Email: j364zhu@uwaterloo.ca", "Computer science principles and algorithms in biological sequence analysis.", "Topics include algorithms for sequence comparison, for large-scale database search in biological databases, for sequence assembly, for evolutionary tree reconstruction, for identifying important features in DNA and RNA sequences, and underlying computational techniques for understanding strings and trees and for making probabilistic inferences.", "Topics include algotithms for sequence comparison, for large-scale database search in biological databases, for sequence assembly, for evolutionary tree reconstruction, for identifying important featrues in DNA and RNA sequences, and underlying computational techniques for understanding strings and trees and for making probabilistic inferences.", "Due to the large volume of data generated by genome sequencing and cellular measurements of gene expression changes, computer science and mathematics have profoundly changed the science of modern biology.", "Computational methods are now critical to developing experimental and analytical tools in biological sciences.", "Prerequisites: Students are not required to have any prior knowledge of molecular biology, but some understanding of basic biological concepts is beneficial.", "Get a first approximation to modern technologies being used as a substitute for classical algorithms to gain more insight into various biological mechanisms.", "Gain practical experience in obtaining data from online resources and analyzing the data within an appropriate biological context.", "L02 Jan 8 A primer in Computational Biology", "L05 Jan 20 Sequence Database search / Multiple Sequence Alignment", "L07 Jan 27 Genome assembly and mapping", "L10 Feb 5 Alignment free methods Deep Learning in Genomics", "L14 Mar 3 RNA-Sequencing & Gene Expression", "L18 Mar 17 RNA & protein structure prediction", "L20 Mar 24 Single-cell genomics", "L22 Mar 31 Foundations in Deep Learning: Transformer Models", "Nature Computational Biology compendium which collected a series of tutorials about classic computational biology-related topics, is available at: link", "Bioinformatics Algorithms: An Active Learning Approach (3rd Edition) (2018) by Phillip Compeau and Pavel Pevzner", "For each assignment, the source code and the assignment report will be reviewed and graded by the TA.", "The source code should be readable, runnable, and pass the tests.", "The project report should be detailed enough for the TA to run the code and expected to have the following sections: introduction, implementation details, results, and discussion.", "No justification is required for a late submission.", "Make-up exams require permission in advance with a doctor’s excuse in the case of illness."]}, {"course_id": 55, "course_code": "CS 487", "course_name": "CS487 - Introduction to Symbolic Computation (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Symbolic Computation Winter 2025", "10:00AM - 11:20AM MC 4020", "An introduction to the use of computers for symbolic mathematical computation, involving traditional mathematical computations such as solving linear equations (exactly), analytic differentiation and integration of functions, and analytic solution of differential equations.", "Objectives: To introduce students to how symbolic computation is done and broaden their knowledge of algorithmic techniques used to efficiently solve problems in many different algebraic and geometric settings, their limitations, and to gain a deeper understanding about symbolic algorithms and how to analyze them.", "Basic arithmetic operations with polynomials", "Polynomial Factoring (univariate, multivariate, and over finite fields as well as over the rationals)", "Multivariate Polynomial Division", "Groebner Bases", "Basic Algorithms in Group Theory", "Applications", "Algorithms for Computer Algebra The book is optional No 210.71", "Please inform the instructor to make the deadline adjustment.", "Your code is an important part of the assignment, and as such it should be readable and well-commented.", "Assignment figures and graphs should be carefully thought out and labelled to present the data and your conclusions in an effective and clear manner.", "Any code and algorithms you write should be sufficiently well documented through code comments or descriptions as to be readily understood.", "This code submission should allow the TAs to run your code if and when necessary to verify the results that your code produces.", "This could be a literature survey of a subtopic in numerical linear algebra, an empirical comparison/implementation of several related algorithms, an application of numerical linear algebra to another field, the design of a novel numerical linear algebra algorithm, or a theoretical analysis of the performance of a numerical linear algebra algorithm (new or old).", "Collaboration and Plagiarism:", "We encourage you to discuss general concepts and problems with classmates, TAs, and instructors.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Intellectual property includes items such as:", "Avoiding Academic Offenses", "Many students may be unaware of the line between acceptable and unacceptable academic behaviour, especially when discussing", "For information and tips related to academic integrity, students may", "The most severe COVID-related risks have lessened for many people, such as individuals", "With these facts in mind, one way that everyone in our class can contribute to a safer and more equitable learning environment is to stay home when you are ill and, at minimum, wear a mask if you suspect you might be contagious.", "A range of on- and off-campus resources are available"]}, {"course_id": 56, "course_code": "STAT 440", "course_name": "STAT440 - Computational Inference (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Computational Inference Winter 2025", "PHY 313", "Introduction to and application of computational methods in statistical inference.", "Monte Carlo evaluation of statistical procedures, exploration of the likelihood function through graphical and optimization techniques.", "Topics include expectation-maximization, Bootstrapping, Markov Chain Monte Carlo, and other computationally intensive methods.", "A1 Feb 4th", "A4 Apr 3rd"]}, {"course_id": 57, "course_code": "STAT 441", "course_name": "STAT441 - Statistical Learning - Classification (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["10:00AM - 11:20AM B1 271", "Email: mlysy@uwaterloo.ca", "STAT 841: View requirements for STAT 841", "Describe the basic principles and methods of statistical classification.", "Know when to use each of these methods on a given dataset.", "Evaluate and compare the output of various classifiers.", "An Introduction to Statistical Learning with Applications in R, by James, Witten, Hastie & Tibshirani https://www.statlearning.com", "There will be two closed-book midterms worth 15% each on the following dates:", "There are no make-up midterms in this course.", "Discussion Board", "Please self-enroll at https://piazza.com/uwaterloo.ca/winter2025/stat441841cm763.", "You can generally expect a response from TAs within two business days.", "Software", "Material and assignments will require the use of R and Python programming languages, as well as the technical document writing programs for these languages: R Markdown and Quarto.", "Regrades", "Email", "Emails which do not adhere to this standard will generally be ignored.", "Intellectual property includes items such as:", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 58, "course_code": "STAT 442", "course_name": "STAT442 - Data Visualization (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Data Visualization Winter 2025", "11:30AM - 12:20PM B1 271", "Discussion Board", "Email", "Response time", "Both human perception and statistical properties inform the methods used to display and visually explore categorical, continuous, time-ordered, map, and high dimensional data.", "Statistical concepts visually presented include variability, densities, quantiles, conditioning, and hypothesis testing.", "Interactive graphics include linking, brushing, motion, and the navigation of high dimensional spaces guided via projection indices.", "Interpret and critique the most commonly used kinds of visualizations today.", "Create a variety of univariate, bivariate, and multivariate graphs using base R and the tidyverse.", "Look up the necessary code to complete additional graphs not covered here.", "Book - Data Science - A First Introduction.", "Book - The Chicago Guide to Multivariate Analysis, Jane E. Miller", "Book - Cool Infographics - Effective Communication with Data Visualization and Design, Randy Krum.", "Industry Paper - Making Data Meaningful, United Nations Economic Commission for Europe.", "Notice of Recording", "No waiving of this penalty will occur for technical issues.", "Details can be found here: https://uwaterloo.ca/math/accommodations", "Phone: 519-884-0000 extension 213", "Lots of people look like they have it together in public and online when they're a mess inside too.", "They got you into university, so they've already done most of the work, but at this point, the most they can really do for you decide if you can get into graduate school before doing industry experience.", "Don't let that be your reason for thinking this is as good as it gets.", "In particular:", "Please inform me of these at the start of the course."]}, {"course_id": 59, "course_code": "STAT 444", "course_name": "STAT444 - Statistical Learning - Advanced Regression (0.50)", "term_name": "List 3", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Statistical Learning - Advanced Regression Spring 2024", "Topics cover a wide selection of advanced methods useful to address the challenges arising from real-world and high-dimensional data; methods include robust regression, nonparametric regression such as smoothing splines, kernels, additive models, tree based methods, boosting and bagging, and penalized linear regression methods such as the ridge regression, lasso, and their variants.", "Students will gain an appreciation of the mathematical and statistical concepts underlying the methods and also computational experience in applying the methods to real data.", "Topics cover a wide selection of advanced methods useful to address the challenges arising from real-world and high-dimensional data; methods include robust regression, nonparametric regression such as smoothing splines, kernels, additive models, tree-based methods, boosting and bagging, and penalized linear regression methods such as the ridge regression, lasso, and their variants.", "Students will gain an appreciation of the mathematical and statistical concepts underlying the methods and also computational experience in applying the methods to real data.", "2 Nonlinear Regression I: Basis functions and Splines 3 – 4", "4 Predictive Modelling I: Error Estimation and Model Assessment 7 – 9", "Generalized Additive Models: An Introduction with R https://www.taylorfrancis.com/books/mono/10.1201/9781315370279/generalized-additive-models-simon-wood No"]}, {"course_id": 0, "course_code": "AMATH 242", "course_name": "AMATH242 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 1, "course_code": "CS 370", "course_name": "CS370 - Numerical Computation (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["10:00AM - 11:20AM MC 2034", "Monday -", "Monday", "Principles and practices of basic numerical computation as a key aspect of scientific computation.", "Approximation by splines, fast Fourier transforms, solution of linear and nonlinear equations, differential equations, floating point number systems, error, stability.", "Understand floating point number representations and their limitations", "Analyze rounding error in a floating point calculation", "Perform stability and trunction error analyses of time integrators", "Understand and perform the fast Fourier transform for 1D and 2D numerical data", "Solve linear systems and perform basic linear algebra manipulations using LU factorizations", "Evaluate asymptotic behavior of numerical linear algebra operations in terms of floating point operations", "Use power iteration to find the dominant eigenvalue of a matrix", "Week of Jan 20: Splines & Parameterized Curves", "Week of Mar 3: FFT Applications", "Week of Mar 10: Google Page Rank / Power iteration", "Week of Mar 17: Gaussian Elimination & LU factorization", "Week of Mar 23: Numerical Linear Algebra Norms and Conditioning", "Week of Mar 31: More Numerical Linear Algebra, End of classes", "You should start the first assignment as soon as possible to begin setting up and getting familiar with these tools.", "The official guide for installing and using Jupyter is here: https://docs.jupyter.org/en/latest/install.html", "There are a huge number of online sources of introductory material for working with Jupyter/Python.", "The focus of this course is on learning general numerical computing concepts, rather than the syntax of a particular programming language.", "Please inform the instructor to make the deadline adjustment.", "Your code is an important part of the assignment, and as such it should be readable and well-commented.", "Assignment figures and graphs should be carefully thought out and labelled to present the data and your conclusions in an effective and clear manner.", "Any code and algorithms you write should be sufficiently well documented through code comments or descriptions as to be readily understood.", "This code submission should allow the TAs to run your code if and when necessary to verify the results that your code produces.", "Collaboration and Plagiarism", "We encourage you to discuss general concepts and problems with classmates, TAs, and instructors.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Intellectual property includes items such as:", "Avoiding Academic Offenses", "With these facts in mind, one way that everyone in our class can contribute to a safer and more equitable learning environment is to  stay home when you are ill and, at minimum, wear a mask if you suspect you might be contagious.", "A range of on- and off-campus resources are available including:"]}, {"course_id": 2, "course_code": "CS 371", "course_name": "CS371 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 3, "course_code": "AMATH 342", "course_name": "AMATH342 - Computational Methods for Differential Equations (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Computational Methods for Differential Equations Winter 2025", "10:00AM - 11:20AM PAS 2083", "An introduction to numerical methods for ordinary and partial differential equations.", "Ordinary differential equations: multistep and Runge-Kutta methods; stability and convergence; systems and stiffness; boundary value problems.", "Partial differential equations: finite difference methods for elliptic, hyperbolic and parabolic equations; stability and convergence.", "Analyze and implement numerical methods for ordinary differential equations", "Analyze and implement finite difference methods for partial differential equations", "Runge-Kutta methods: 3 weeks", "Linear multistep method: 3 weeks", "Computer Methods for Ordinary Differential Equations and Differential-Algebraic Equations.", "Numerical Solution of Partial Differential Equations.", "A first course in the numerical analysis of differential equations.", "Finite Difference Methods for Ordinary and Partial Differential Equations.", "SIAM 2007", "You can discuss problems and compare answers with your classmates.", "Do NOT email me about taking an extension unless your circumstances require a longer extension.", "Late Assignments and make-up midterm:"]}, {"course_id": 4, "course_code": "CS 475", "course_name": "CS475 - Computational Linear Algebra (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Computational Linear Algebra Spring 2024", "Basic concepts and implementation of numerical linear algebra techniques and their use in solving application problems.", "Special methods for solving linear systems having special features.", "QR and SVD methods for solving least squares problems.", "Computation and uses of these decompositions in practice.", "Basic concepts and implementation of numerical linear algebra techniques and their use in solving application problems.", "Special methods for solving linear systems having special features.", "QR and SVD methods for solving least squares problems.", "Computation and uses of these decompositions in practice.", "Solving special linear systems", "Understanding least squares problems and some applications", "Numerical Linear Algebra}, L.N. Trefethen and D. Bau III, SIAM, QA184.T74, 1997 Optional No", "Iterative Methods for Sparse Linear Systems, 2nd edition}, Y. Saad, SIAM, QA188.S17, 2003 Optional No", "Applied Numerical Linear Algebra, J. Demmel, SIAM QA184.D455, 1997.", "Undergrads", "Please inform the instructor to make the deadline adjustment.", "Your code is an important part of the assignment, and as such it should be readable and well-commented.", "Assignment figures and graphs should be carefully thought out and labelled to present the data and your conclusions in an effective and clear manner.", "Any code and algorithms you write should be sufficiently well documented through code comments or descriptions as to be readily understood.", "This code submission should allow the TAs to run your code if and when necessary to verify the results that your code produces.", "This could be a literature survey of a subtopic in numerical linear algebra, an empirical comparison/implementation of several related algorithms, an application of numerical linear algebra to another field, the design of a novel numerical linear algebra algorithm, or a theoretical analysis of the performance of a numerical linear algebra algorithm (new or old).", "Collaboration and Plagiarism:", "We encourage you to discuss general concepts and problems with classmates, TAs, and instructors.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Intellectual property includes items such as:", "Avoiding Academic Offenses", "Many students may be unaware of the line between acceptable and unacceptable academic behaviour, especially when discussing", "For information and tips related to academic integrity, students may", "Your suggestions are encouraged and", "The most severe COVID-related risks have lessened for many people, such as individuals", "With these facts in", "mind, one way that everyone in our class can contribute to a safer and more equitable learning environment is to stay home when you", "are ill and, at minimum, wear a mask if you suspect you might be contagious.", "A range of on- and off-campus resources are available", "the Six Nations that includes six miles on each side of the Grand River."]}, {"course_id": 5, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 6, "course_code": "CO 255", "course_name": "CO255 - Introduction to Optimization (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Notice of Recording", "Introduction to Optimization (Advanced Level)", "08:30AM - 09:50AM MC 4040", "Linear optimization: feasibility theorems, duality, the simplex algorithm.", "Know a variety of optimization algorithms, including the Simplex method, cutting plane methods, and descent methods.", "Know and apply the definition and properties of convex sets and functions.", "Write the dual of a linear programming problem and understand the properties relating the primal and dual.", "Apply optimization methods to common continuous and discrete problems including game theory, flow, scheduling, and data science.", "Linear programming, Fourier-Motzkin elimination, and Farkas's lemma.", "Duality in linear programming.", "Convex optimization and the KKT conditions.", "Discrete optimization and total unimodularity.", "Applications of total unimodularity to matching and flow problems", "Application of nonlinear optimization to data science", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course.", "If you have questions or concerns about these matters, please email mathadvisor@uwaterloo.ca."]}, {"course_id": 7, "course_code": "CS 245", "course_name": "CS245 - Logic and Computation (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Logic and Computation Winter 2025", "10:30AM - 11:20AM MC 4041", "Formalizing the notions of correct and incorrect reasoning, defining what is computable, and exploring the limits of computation.", "The course covers a variety of topics related to logic and computation that are required as background for other courses in Computer Science.", "It differs both in tone and content from a logic course one would typically find in a mathematics program.", "Develop mathematical reasoning skills", "Improve understanding of propositional and first-order logic, including key notions, such as: expressing natural language statements as logical formulas, distinguishing between correct and incorrect reasoning (between valid and invalid logical arguments), constructing a formal proof, distinguishing between syntax and semantics", "Explore the limits of computers, including decidability and undecidability", "Introduction", "Structural induction and its use in proving statements about formulas", "Adequate sets of connectives", "Soundness and completeness of formal deduction", "Applications of propositional logic to computer science, such as: Automated proofs: Resolution, Davis-Putnam Procedure; Hardware and software veriﬁcation", "First-Order Logic", "Limitations of propositional logic, and the necessity of first-order logic for reasoning about objects and properties", "Quantiﬁers, universe of discourse, translation between English and first-order logic formulas", "Syntax of first-order logic: terms, formulas", "Semantics of first-order logic: valuations", "Proving argument validity in first-order logic (semantically)", "Formal deduction in first-order logic; Proving argument validity by formal deduction (syntactically)", "Applications of first-order logic to computer science, such as: Automated theorem provers and veriﬁers; Databases", "Decidability and Peano Arithmetic", "Turing Machine as a model of computation", "Undecidability: Basic notions, undecidability of the Halting Problem and other decision problems", "The Peano axioms for number theory (including the induction axiom), undecidability of Peano Arithmetic", "An Important Application of Logic to Computer Science", "Hoare triples", "partial and total correctness", "Formalize English sentences into properly formed formulas in the propositional and first-order logic and, conversely, interpret such formulas in English", "Formalize the notion of correct reasoning and proof, and be able to construct formal proofs", "Realize the limitation of formal proof systems", "Understand the applications of logic to computer science", "This means that you must decide whether to exercise your option to submit late before the deadline, and refrain from making a partial submission in this case.", "There will be a marked quiz due in each week when there will not be a Crowdmark assignment due or a mid-term examination.", "This course includes the independent development and practice of specific skills, including writing numerous proofs using numerous abstract definitions.", "Library for research-based assignments"]}, {"course_id": 8, "course_code": "CS 245E", "course_name": "CS245E - Logic and Computation (Enriched) (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["10:00AM - 11:20AM MC 2034", "Tuesday -", "This includes:", "Basic sematic notions:", "Truth tables", "A formal proof system for Propositional logic", "Soundness and completeness theorems for the proof system", "Basic sematic notions", "Structures for a vocabulary", "Logical truths and logical implications", "Translations between FOL formulas and English and mathematical statements.", "A formal proof system for Predicate logic", "Soundness theorem for the proof system", "However, the focus of this version of the course is more on fundamental and mathematical concepts (on the expense of developing technical skills, such as designing formal proofs).", "We will use propositional logic as a main tool for demonstration key logical concepts such as", "Structural induction its justification and many applications.", "soundness and completeness theorems", "the expressive power of the logic (what can and what cannot be expressed).", "We will revisit these topics for first order logic.", "Finally, we will discuss applications of logic to computer science, in particular showing limitations of computations (undesirability)."]}, {"course_id": 9, "course_code": "PMATH 330", "course_name": "PMATH330 - Introduction to Mathematical Logic (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Introduction to Mathematical Logic Winter 2025", "08:30AM - 09:20AM", "I’m a researcher in mathematical logic, so this course forms the backbone of my career.", "A broad introduction to mathematical logic.", "The notions of logical consequence and derivation are introduced in the settings of propositional and first order logic, with discussions of the completeness theorem and satisfiability", "We will spend the first half of the course covering propositional logic, with a midterm on February 14.", "We will spend the second half covering first-order logic.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 10, "course_code": "PMATH 432", "course_name": "PMATH432 - Mathematical Logic (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Mathematical Logic Fall 2024", "Pending approval, I hope to teach a graduate topics course in model theory (PMATH 930) in the Fall of 2025.", "Topics: The completeness and compactness theorems of first order logic.", "Zermelo-Fraenkel set theory and ordinals/cardinals.", "First-order languages and structures, syntactic provability and semantic truth, the soundness and completeness theorems, compactness and its consequences, elementary equivalence, the ZFC axioms of set theory, ordinals, cardinals, computability, and Gödel's incompleteness theorem."]}, {"course_id": 11, "course_code": "SE 212", "course_name": "SE212 - Logic and Computation (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Notice of Recording", "Logic and Computation Fall 2024", "08:30AM - 09:50AM DWE 3516", "10:00AM - 11:20AM DWE 3516", "Mon 11:30-12:30pm in person DC2335", "ISG Coordinator", "Sylvie Davies ISC email", "Proof systems and styles.", "Formal models of computation.", "Logic-based specification.", "Applications in software engineering.", "All students in good standing in the software engineering program are prepared to learn the material covered in SE212.", "read and write logical statements in propositional and predicate logic.", "prove theorems in propositional and predicate logic.", "know there are multiple ways to prove these theorems.", "verify formally that functions within a program are correct (verification in the small).", "understand there is a mathematical theory associated with software engineering.", "This course is about the \"first principles\" of the logical theory behind software engineering.", "Students will be introduced to logical notation (both propositional and predicate logic), and basic methods of proof.", "Specification and program correctness are the main applications of logic taught in this course.", "Week 1: Introduction and Motivation.", "Week 8: Formal Specification in Z Readings: Grassman Ch. 8", "Week 9: Formal Specification in Z", "Courseware pack contains chapters from:", "Projects may be completed in groups of two.", "Students may be selected randomly or on a case-by-case basis and will be notified in advance.", "Exam Information", "Notice of Recording", "Avoiding Academic Offenses", "You can avoid crossing the line by discussing a problem in terms of its general case or in terms of a related problem.", "However, appropriately penalties for cheating in a specific case are decided by the Assistant Dean for Students in the Faculty of Mathematics.", "Students may be selected randomly or on a case-by-case basis and will be notified in advance.", "\"This course includes the independent development and practice of specific skills, such as logical reasoning.", "In particular:", "Please inform of us these at the start of the course.", "Continuity Plans"]}, {"course_id": 12, "course_code": "CS 246", "course_name": "CS246 - Object-Oriented Software Development (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Object-Oriented Software Development Winter 2025", "10:00AM - 11:20AM MC 1056", "10:30AM - 11:20AM MC 3003", "11:30AM - 12:20PM MC 3003", "Tuesday -", "Ross Evans rpevans@uwaterloo.ca", "Introduction to object-oriented programming and to tools and techniques for software development.", "Designing, coding, debugging, testing, and documenting medium-sized programs: reading specifications and designing software to implement them; selecting appropriate data structures and control structures; writing reusable code; reusing existing code; basic performance issues; debuggers; test suites.", "This course introduces students to object-oriented programming in C++ to facilitate designing, coding, debugging, testing, and documenting medium-sized programs.", "Students learn to read a specification and design software to implement it.", "Important skills are selecting appropriate data structures and control structures, writing reusable code, reusing existing code, understanding basic performance issues, developing debugging skills, and learning to test a program.", "C++", "Introduction to C++", "I/O and Strings", "Basic language constructs and Functions", "Exceptions", "Introduction to Templates", "Exception safety", "Template functions and algorithms", "Object-Oriented Programming", "UML class models", "Constructors and Destructors", "Encapsulation", "Inheritance", "Design patterns: Iterator, Observer, Decorator, Factory method, Template method, Non-virtual interface (NVI), and the Pimpl idiom", "Inheritance: vtables", "Multiple inheritance", "Design quality", "MVC (model-view-controller) architecture", "Design, implement, test, and debug C++ programs to solve problems requiring hundreds of lines of code, making appropriate use of", "types, variables, arrays, strings, and dynamic memory; loops, conditionals, and other control structures; structures, unions, and enumerations; procedures and functions; the preprocessor; formatted and unformatted I/O", "a subset of the STL, including vector, list, and map", "assertions and exceptions", "test suites for regression testing, white and black box testing", "structured programming, incremental development", "interface design, abstractions, information hiding, cohesion and coupling", "a subset of UML to specify classes, objects and relationships among them", "a selection of design patterns", "Explain the following properties of the memory model used in C++, including their impact on time and space efficiency when designing code: bytes vs. words, memory as an array, run-time stack and stack frames, memory allocation on the heap vs. automatic allocation on the stack, pointers as memory addresses, the representation of objects in memory", "You must complete A0 in order to receive marks for the rest of the course.", "A1 Basic C++ Monday, January 20 Monday, January 27 5", "A2 Introduction to OOP Monday, February 3 Monday, February 10 6", "A4 Design Patterns Monday, March 10 Monday, March 17 8", "Note: Marmoset is not a compiler!", "Do not submit C++ code to Marmoset, without first attempting to compile it yourself.", "Students from different sections can be in the same group.", "Working on a group is an important learning experience for software development in a team.", "Students in a group will be responsible for forming and managing the group.", "Please be very careful in selecting your group as there are always groups that end up having major issues every term.", "Exams", "Examination Date Final Grade Weight", "Each weekly set of problems completed succesfully can be used to replace 0.5% of the final grade from the final exam.", "In the case where both a midterm and final exam can be held, the final course grade will be calculated from the following components and weights:", "To pass the course, you must satisfy these three conditions:", "A grade of at least 45% on the weighted average of assignments A1-A4", "Assignments1to4  = (A1*5 + A2*6 + A3*6 + A4*8) / 25", "Normal = A1*5 + A2*6 + A3*6 + A4*8 + A5*15 + Midterm*20 + Final*(40-0.5*TutorialsCompleted) + 0.5*TutorialsCompleted", "if (MidtermInPerson==TRUE && FinalInPerson==TRUE)", "else", "if (MidtermInPerson==FALSE && FinalInPerson==TRUE)", "else", "if (MidtermInPerson==TRUE && FinalInPerson==FALSE)", "else", "if (MidtermInPerson==FALSE && FinalInPerson==FALSE)", "else", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 13, "course_code": "CS 246E", "course_name": "CS246E - Object-Oriented Software Development (Enriched) (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Object-Oriented Software Development (Enriched)", "Tuesday -", "CS246 description: Introduction to object-oriented programming and to tools and techniques for software development.", "Designing, coding, debugging, testing, and documenting medium-sized programs: reading specifications and designing software to implement them; selecting appropriate data structures and control structures; writing reusable code; reusing existing code; basic performance issues; debuggers; test suites.)", "functions and classes as the basic building blocks for abstractions", "function and class templates; exception safety", "object-oriented design principles; design patterns", "language features in combination", "Software library development for general client use.", "Principles of object-oriented software design.", "A selection of software design patterns.", "A1     10%", "Office hours: the list of office hours can be found at https://student.cs.uwaterloo.ca/~cs246e/F24/officehours.shtml", "Note: Marmoset is not a compiler!", "Please do not submit C++ code to Marmoset without first attempting to compile it yourself.", "The release test for a problem gives you the result of running your program on one basic test case (usually a case that appears in the assignment specification).", "So be sure to test your code thoroughly, so that you pass as many of our secret tests as possible.", "Testing", "Hand-Marking", "Note that correctly-working code is only one component of an assignment mark.", "Intellectual property includes items such as:", "CAN I POST MY CODE ONLINE?", "The second complicating factor concerns the question of who actually owns assignment solutions.", "The instructor supplies the question, a framework for the solution (including rules, guidelines, and possibly some starter code or libraries) and has in mind the general structure of what a correct solution ought to look like.", "the instructor(s) may permit posting of only those portions of assignments that were not provided as starter code;", "The instructors' policy for a given offering of a course will be stated in the course outline.", "If you wish to share your code with potential employers, and your instructor does not permit you to publicly post your solutions, you may host your code in a private repository, and provide a password to potential employers (for example, on your resume).", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 14, "course_code": "CS 247", "course_name": "CS247 - Software Engineering Principles (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Software Engineering Principles Spring 2024", "10:00AM - 11:20AM STC 0060", "02:30PM - 03:20PM", "Ross Evans", "Systematic methods for designing, coding, testing, and documenting medium-sized programs.", "Demonstrate knowledge learned in CS 137/138 and CS 241 by being able to program in C/C++ (structures, strings, procedural abstractions, pointers, addresses, recursion, classes, polymorphism, STL vector container).", "Module Design (12) hours", "ADT design, function and operator overloading", "Modules and interfaces", "Invariants + Encapsulation", "Object-Oriented Design and Programming (12) hours", "Exceptions, Exception Safety", "OO design principles, patterns, and idioms", "Multiple and Virtual Inheritance", "UML modelling", "Incremental development (make)", "STL algorithms", "Iterators", "You are responsible for checking these resources regularly.", "Design and implement data abstractions (ADTs, polymorphic objects, generic functions) in C++.", "Express software designs and behaviour using basic UML models.", "Use simple software tools effectively, including makefiles, gdb, version control.", "Intellectual property includes items such as:", "Since part of the marks will come from automatically compiling and testing your code, it is imperative that your code compile and run in the student environment, linux.student.cs.uwaterloo.ca.", "A1 Part 1: Fri 2024-05-24", "A1 Part 2: Fri 2024-05-31", "It is imperative that your code compile and run in the student environment, linux.student.cs.uwaterloo.ca.", "Some degree of collaboration is beneficial: you can learn a lot from others; you can avoid getting stuck; and teaching someone else can be the best way to cement your own understanding of a difficult concept.", "You must destroy any materials that you and others create during the meeting.", "The only circumstance under which a project may not be handed in is if ALL group members declare an absence (a special case of this would be that you did the project yourself).", "In that case, the accommodation is an INC in the course, and you will have to do the project in a future term.", "Do not wait until the last minute to submit, just in case there are problems with your internet connection, Marmoset, or your submission.", "Re-marking Policy", "Clearly state the questions you want re-marked and include any supporting evidence for your case.", "Requests that include code changes to fix failing test cases will be ignored since you are expected to test your code thoroughly in advance of the submission.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 15, "course_code": "STAT 340", "course_name": "STAT340 - Stochastic Simulation Methods (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Stochastic Simulation Methods Winter 2025", "STAT 340", "10:30AM - 11:20AM MC 4045", "Office hours: Fridays, 1:00pm - 2:00pm, in M3 - 2106", "Random variate generation in the univariate and multivariate case, Monte Carlo integration, advanced computer implementation, variance reduction, statistical analysis of simulated data, extensions to challenging simulation problems.", "Mathematical treatment of the underlying stochastic concepts and proofs.", "View requirements for STAT 340", "Random variate generation in the univariate and multivariate case, Monte Carlo integration, advanced com- puter implementation, variance reduction, statistical analysis of simulated data, extensions to challenging simulation problems.", "Mathematical treatment of the underlying stochastic concepts and proofs.", "1)  Introduction to simulation and Rprogramming;", "4)  Inversion method, acceptance-rejection method, table-look up method to sample from non-uniform distributions;", "Sampling from multivariate distributions and copulas;", "7)  Monte-Carlo estimators and its properties;", "Further topics time-permitting", "iClicker Rules", "), usually a make-up examination will take place at a time mutually agreed-upon.", "To have your document considered for regrading you must formulate a request in writing by email to the instructor, providing the problem and a reason for why you believe it should be regraded.", "A mechanic encounters a problem, analyzes it, and fixes it with the tools from her/his toolbox."]}, {"course_id": 16, "course_code": "STAT 341", "course_name": "STAT341 - Computational Statistics and Data Analysis (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Computational Statistics and Data Analysis Winter 2025", "04:00PM - 05:20PM", "10:00AM - 11:20AM EIT 1015", "04:30PM - 05:20PM", "Megan French", "Daniel Zhang", "While personal matters can be communicated via email, Piazza should be the primary platform for Q&A outside of class.", "A computationally focused approach to statistical reasoning in the context of real data.", "Functional programming in R and algorithms will be used to define interesting attributes of finite populations and their sampling characteristics.", "Understand the fundamentals of population-based statistical analyses, as well as implicitly/explicitly defined population attributes", "Understand the basics of sampling and the underlying ideas/mechanisms of probability sampling and related issues", "Understand the basics of inductive inference including target and study populations, measurements, comparing subpopulations, random intervals and coverage probabilities, and resampling methods such as bootstrap", "Generate high-quality visualization and inferential statistics R output for the topics above", "Prepare reports that communicate your statistical analyses using LaTeX and R Markdown.", "Jan. 6 Introduction to the course", "location and scale invariance/equivariance", "Power transformations and linear relationships", "Implicitly defined Attributes", "Solving system of equations Assignment #1", "Iteratively re-weighted least-squares", "Sampling mechanisms and inclusion probabilities", "Sampling design", "9. Mar. 3 Anatomy of tests of significance", "A t-like discrepancy measure  Assignment #2", "Mar. 10 Multiple testing", "Student-t-based intervals", "Mar. 17  Introduction to resampling methods", "Bootstrap in regression", "Multiple samples and prediction", "Decomposition of APSE, bias-variance trade-off", "Training and Test sets", "K-fold cross validation Assignment #3", "Each folder will contain five files, e.g. for section 2.1-", "There will be a 2.5-hour, closed book, cumulative final exam during the Final Examination Period: April 9 – April 25.", "An INC grade is rarely granted and will be considered on a case-by-case basis, with decisions based largely on your performance throughout the semester.", "Self-Declared COVID-19 Related Absences: You may self-declare one absence per term during the formal lecture period for influenza-like illnesses.", "Course Software: R is a language and a free statistical computing and graphics software that we will use extensively throughout the course.", "The only time you may run into trouble is if you call a function from a package to handle a task you have been asked to code out explicitly.", "For example, if you are asked to code a function that calculates the mean of a vector in R, and your solution is to just call the function mean(), then you will not receive any marks.", "Communication: When you email your instructor, make sure you include the following information in your email:", "Including non-English characters in your email (sometimes imposed by installing a non-English operating system) prompts UW servers to spam your emails for the instructor.", "These characters most often appear in (not exclusively) the subject line, From, To, and Date/Time portions of previous communications if you reply to an email.", "You must use the web-based email platform if you suspect that you have non-English characters in your emails imposed by your computer, phone, tablet, etc.", "This course includes the independent development and practice of specific skills related to computational statistics and data analysis.", "Phone: 519-884-0000 extension 213"]}, {"course_id": 17, "course_code": "AMATH 343", "course_name": "AMATH343 - Discrete Models in Applied Mathematics (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Discrete Models in Applied Mathematics Fall 2023", "Difference equations and discrete dynamical systems.", "Mathematical models are taken from ecology, biology, economics, and other fields.", "Many such systems evolve over continuous time and can be modelled by differential equations, however, there are some systems for which the evolution is more appropriately described using discrete time intervals - for example, plant and animal populations where breeding and other effects can be assumed to take place at particular times of the year.", "As with differential equations, difference equations can be classified as linear difference equations and nonlinear difference equations.", "First, we will examine linear difference equations and a number of standard methods to solve them.", "The asymptotic behaviour of nonlinear systems can be quite complicated, leading to such things as “bifurcations,” “chaos,” and “fractals.”", "A few simple models will be studied in order to understand certain aspects of this behaviour.", "We will explore the notion of “fractal dimension” as well as some simple methods of generating fractal sets.", "Time permitting, we will look at iterated function systems (IFS), a simple, yet powerful, geometric method of generating and studying fractal sets.", "Week Of", "Week Number", "Introduction to Difference Equations & Some Applications", "Linear Difference Equations", "Linear Difference Equations", "A1 Due", "Linear Difference Equations", "Nonlinear Dynamics", "Nonlinear Dynamics", "Nonlinear Dynamics", "Chaotic Systems", "A4 Due", "Chaotic Systems", "Introduction to Difference Equations, With Illustrative Examples from Economics, Psychology and Sociology, by S. Goldberg (Wiley 1958).", "An Introduction to Difference Equations, Third Edition, by S. Elaydi (Springer 2005).", "Mathematical Models in Biology, by L. Edelstein-Keshet (SIAM Press 2005).", "An Introduction to Chaotic Dynamical Systems, by R.L. Devaney (Benjamin Cummings 1989).", "Your solutions must be legible, detailed and well-organized, indicating the logic and methods used in obtaining the answer and not merely a scribble of formulas and equations.", "In fact, you may view the assignments as a guide to what you are expected to know in this course.", "MIDTERM & FINAL EXAM"]}, {"course_id": 18, "course_code": "AMATH 382", "course_name": "AMATH382 - Computational Modelling of Cellular Systems (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Notice of Recording", "Computational Modelling of Cellular Systems Winter 2024", "08:30AM - 09:50AM MC 4061", "B. Ingalls", "An introduction to dynamic mathematical modeling of cellular processes.", "The emphasis is on using computational tools to investigate differential equation-based models.", "This course provides an introduction to dynamic mathematical modeling of cellular processes.", "The emphasis will be on using computational tools to investigate models of cellular phenomena.", "The course then addresses models in four biological domains: metabolic networks, signal transduction pathways, gene regulatory networks and electrophysiology.", "Intended Audience: Third and fourth year students interested in dynamic modelling in molecular cell biology.", "Software: We will be making heavy use of packages for numerical simulation of differential equations.", "Appendix C of the course notes consists of tutorials on MATLAB and XPPAUT, which is a GUI-based package for dynamical systems analysis.", "Design and simulate ordinary differential equation models of chemical reaction networks", "Investigate differential equation models using phase plane analysis, sensitivity analysis, and bifurcation analysis", "Develop and interpret differential equation models of biomolecular networks in the context of cellular metabolism, signal transduction, gene regulation, and electrophysiology", "Design and simulate stochastic models of gene regulatory networks", "Provide critical analysis of kinetic models of intracellular networks in the scientific literature and communicate their potential and limitations", "Kinetic Modelling of Biochemical Networks", "Module 3. Dynamics and Stability", "Mathematical Modeling of Systems Biology posted: https://www.math.uwaterloo.ca/~bingalls/MMSB/ Yes", "Term project will be completed in groups of two.", "Oral presentations will be in person during 20-minute time-slots scheduled during the last week of lectures (45% of project grade)", "Notice of Recording"]}, {"course_id": 19, "course_code": "AMATH 383", "course_name": "AMATH383 - Introduction to Mathematical Biology (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Introduction to Mathematical Biology Winter 2025", "Email: cbauch@uwaterloo.ca", "Email: TBD", "Students develop an intuition for describing the biological world in mathematical terms, by writing down and analyzing mathematical models of biological systems.", "Students also collaborate in team projects where they are required to construct, analyze and interpret models using mathematical software packages, and present their work to the class.", "Biology prerequisites are not necessary, but knowledge of differential equations and matrix algebra is required.", "Sampling of material offered: ecology (exponential growth models, logistic growth models, predator-prey dynamics, competition models); epidemiology (compartmental models of childhood infectious diseases, influenza); microbiology (slime mold growth; cell cycles); population genetics; and physiology.", "Techniques learned will include stability analysis of discrete-time models and ordinary differential equations, phase plane methods and qualitative solutions, travelling wave solutions of partial differential equations, and use of mathematical software for modelling.", "In some populations, dynamics can be broken down into discrete stages (for instance, insects that reproduce only during a particular time of year).", "In these cases, difference equations that describe time is a discrete way are appropriate models.", "We will discuss the theory of linear and nonlinear difference equations and their applications in biology.", "We will introduce the topic of ordinary differential equation models and their formulation and analysis in the context of biological problems.", "In both parts I and II, we will emphasise how appropriate assumptions can simplify the biological problem, how important variables can be identified and how difference/differential equations can be tailored to describe the essential features of a biological process.", "After defining the problem and formulating a consistent set of equations, we will turn to the analysis of their solutions.", "Introduction to Spatially Distributed Systems, Partial Differential Equations and Other Methodologies.", "In order to analyze them it is necessary to develop models that capture spatial structure of real populations.", "Partial differential equations can provide means for modeling spatially structured biological processes.", "We will briefly introduce these methodologies and demonstrate how they can be applied to study spatio-temporal dynamics of biological phenomena.", "construct, analyze and interpret mathematical models of biological systems.", "Linear Difference Equations", "Growth Model", "Day 2: Plant population growth model", "Day 3: How to solve linear systems of", "difference equations; red blood cell model", "Nonlinear Difference Equations", "equations and cobwebbing, chaos", "difference equations", "Day 3: cheyne-stokes model, logsitic model", "stability analysis", "Nonlinear Difference Equations", "Day 2: nicholson-bailey model", "competition model", "Day 1: logistic growth ODE model", "Day 2: chemostat model", "Models", "sketching qualitative solutions", "Day 2: phase portrait for chemostat model", "interpretation of eigenvectors and", "eigenvalues", "ODEs: Epidemic Models", "Day 1: infectious disease epidemiology and Malthusean models", "Day 2: compartmental models", "Day 3: phase portrait for SIR model, herd", "reading", "ODEs: Ecological Models", "Day 1: Lotka-Volterra predator prey model", "Day 2: extensions to Lotka-Volterra model", "Models", "PDEs: Introduction to PDEs", "derivation of 1-D balance equation from", "mass conservation principles", "PDEs: PDE models", "reports and", "Mathematical Models in Biology.", "If a student misses a test for medical or compassionate reasons, no makeup test will be administered.", "Students will work in groups of 4 to construct, analyze and interpret a model of their own design.", "The project topic must be approved by the instructor, and should be relevant to biological systems.", "In particular, it should contain:", "This should briefly summarize the motivation and methods and highlight the key results.", "• Introduction: explaining background and motivating the problem of interest.", "• Methods: explain the model equations and parameter values.", "• Discussion: comment on what you have discovered and what research you think needs to be carried out in the future to make further progress on the", "I can suggest appropriate references, answer questions, and generally give you advice."]}, {"course_id": 21, "course_code": "AMATH 455", "course_name": "AMATH455 - Control Theory (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["11:30AM -", "System theory in both time and frequency domain, state-space computations, stability, system uncertainty, loopshaping, linear quadratic regulators, and estimation.", "System theory in both time and frequency domain, state-space computations, stability, system uncertainty, loopshaping, linear quadratic regulators and estimation.", "The aim of this course is to provide a solid understanding of the mathematical foundations of control theory for linear systems.", "Topics to be covered include state space and frequency domain representations, controllability and observability, open and closed loop stability, state feedback and stabilization, detectability, observers and linear quadratic regulators.", "Both theoretical and practical aspects of the material will be addressed.", "linear systems theory,", "Applications, both in class and in the lab, will be used to illustrate and motivate the theory.", "Master state-space and frequency domain formulations of linear systems", "Investigate controllability and observability of linear time-invariant systems", "Use linearization techniques to deal with nonlinear systems", "Determine transfer functions of control systems", "Master time and frequency responses", "Investigate internal stability and stabilization of a linear system", "Investigate detectability, output feedback, and external stability of a linear system", "Investigate closed-loop stability of linear systems", "Investigate the Linear Quadratic Regulator", "Jan 29 – Feb 2  Realization & minimal realizations, poles and zeros", "Feedback Systems: An Introduction for Scientistsand Engineers.", "Linear System Theory and Design.", "Hespanha, Joao P. Linear Systems Theory.", "Please consider informing us and indicating your pronouns and preferred name.", "Library for research-based assignments"]}, {"course_id": 23, "course_code": "BIOL 382", "course_name": "BIOL382 - Computational Modelling of Cellular Systems (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Notice of Recording", "Computational Modelling of Cellular Systems Winter 2024", "08:30AM - 09:50AM MC 4061", "B. Ingalls", "An introduction to dynamic mathematical modeling of cellular processes.", "The emphasis is on using computational tools to investigate differential equation-based models.", "This course provides an introduction to dynamic mathematical modeling of cellular processes.", "The emphasis will be on using computational tools to investigate models of cellular phenomena.", "The course then addresses models in four biological domains: metabolic networks, signal transduction pathways, gene regulatory networks and electrophysiology.", "Intended Audience: Third and fourth year students interested in dynamic modelling in molecular cell biology.", "Software: We will be making heavy use of packages for numerical simulation of differential equations.", "Appendix C of the course notes consists of tutorials on MATLAB and XPPAUT, which is a GUI-based package for dynamical systems analysis.", "Design and simulate ordinary differential equation models of chemical reaction networks", "Investigate differential equation models using phase plane analysis, sensitivity analysis, and bifurcation analysis", "Develop and interpret differential equation models of biomolecular networks in the context of cellular metabolism, signal transduction, gene regulation, and electrophysiology", "Design and simulate stochastic models of gene regulatory networks", "Provide critical analysis of kinetic models of intracellular networks in the scientific literature and communicate their potential and limitations", "Kinetic Modelling of Biochemical Networks", "Module 3. Dynamics and Stability", "Mathematical Modeling of Systems Biology posted: https://www.math.uwaterloo.ca/~bingalls/MMSB/ Yes", "Term project will be completed in groups of two.", "Oral presentations will be in person during 20-minute time-slots scheduled during the last week of lectures (45% of project grade)", "Notice of Recording"]}, {"course_id": 24, "course_code": "CO 351", "course_name": "CO351 - Network Flow Theory (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["In case of (medical or other) emergencies, or private issues, send E-mail to the instructor.", "Network simplex and primal-dual algorithms.", "Applications to problems of transportation, distribution, job assignments, and critical-path planning.", "The course covers mathematical models for optimization problems on networks.", "The max-flow-min-cut theorem has many applications including its implication of the Menger theorem in graph theory.", "Additionally, the course presents several algorithms for solving optimization problems on networks.", "Linear programming and LP duality are central to the design and analysis of some of the algorithms.", "- maximum flows and minimum cuts (max-flow/min-cut theorem, preflow-push algorithm);", "- applications to problems in transportation, distribution, job assignments, and critical-path planning, etc.", "1 Sep. 4-6 Review linear programming and graph theory", "4 Sep. 23-27 Shortest di-paths problem A1", "11 Nov. 18-22 Minimum cost flow A4", "\"Network Flow Algorithms\" (grad-level book) by D.P.Williamson http://www.networkflowalgs.com/ No", "This is a closed-book exam.", "This is a closed-book exam.", "Students are advised to invest in a reliable internet connection and a reliable device (for a fraction of the cost of UW tuition).", "The answer to most common issues as well as how-to videos can be found at"]}, {"course_id": 25, "course_code": "CO 353", "course_name": "CO353 - Computational Discrete Optimization (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Notice of Recording", "Computational Discrete Optimization Winter 2025", "08:30AM - 09:50AM E2 1732", "Formulations of combinatorial optimization problems, greedy algorithms, dynamic programming, branch-and-bound, cutting plane algorithms, decomposition techniques in integer programming, approximation algorithms.", "A discrete optimization problem, broadly speaking, involves a discrete set of feasible solutions and a real-valued objective function that assigns a value to each solution.", "Discrete optimization problems are of immense practical importance, are solved every day (sometimes each hour or more frequently) by many Fortune 500 companies;  well-known problems in the class include", "This course provides an introduction to the broad field of discrete optimization and covers several classes of commonly used techniques for the design of algorithms, including:", "Dynamic programming,", "We will discuss algorithmic efficiency and introduce the basics of complexity theory.", "For NP-hard problems, we will explore the field of approximation algorithms, which provides efficient methods for computing solutions with guaranteed quality.", "Students will complete two practical projects as part of the course, where they will develop, implement, and test algorithms for specific discrete optimization problems.", "formulate discrete optimization problems;", "identify and apply algorithms that can be used to solve selected discrete optimization problems;", "prove correctness of above algorithms and results related to the structures of discrete optimization problems.", "\"The Design of Approximation Algorithms\" by David Williamson, David Shmoys No", "\"Approximation Algorithms\" by Vijay Vazirani No", "\"The Design of Approximation Algorithm\" by David Williamson, David Shmoys;", "\"Approximation Algorithms\" by Vijay Vazirani.", "Each collaboration and resource used to prepare the submission should be appropriately acknowledged in the submission.", "Projects are to be done in groups of two-three.", "Submissions not following the specified format might be assessed based only on their performance and correctness of their output without providing feedback.", "In case you are not able to participate in some of the assessments please visit this webpage to submit the required information.", "Notice of Recording", "If due to changes in regulations and guidelines, it becomes impossible for us to hold in-person lectures and office hours, the lectures and office hours will be held over Zoom."]}, {"course_id": 27, "course_code": "CO 370", "course_name": "CO370 - Deterministic OR Models (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Deterministic OR Models Winter 2025", "Mahtab Alghasi: Wednesdays from 11am-12pm in MC5488", "An applications-oriented course that illustrates how various mathematical models and methods of optimization can be used to solve problems arising in business, industry, and science.", "Formulate computational tasks as optimization problems of appropriate type", "Understand optimization concepts surrounding real world challenges (sensitivity analysis, robust optimization, stochastic optimization)", "Have some familiarity with algorithmic techniques and heuristics for solving optimization problems", "Part I: Formulations", "Flows", "Integer Programs that reduce to Linear Programs", "Part 2: Real World Challenges that can be addressed in Optimization", "Robust optimization", "Stochastic Optimization", "Part 3: Algorithms and Heuristics for Solving Optimization", "Branch and Bound", "Please sign yourself up at", "A missed test will be treated the same as a mark of zero.", "The answer to most common issues as well as how-to videos can be found at", "To avoid issues, only use your UWaterloo email, never use multiple email addresses.", "Illnesses and INC", "In case of a", "short period of illness and a strong performance in the course we should be able to simply", "Copyright Information"]}, {"course_id": 28, "course_code": "CO 372", "course_name": "CO372 - Portfolio Optimization Models (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Notice of Recording", "Portfolio Optimization Models Fall 2024", "10:00AM - 11:20AM MC 2034", "Computational optimization methodologies underlying portfolio problems in finance.", "Computational linear algebra, determining derivatives, quadratic, and nonlinear optimization.", "Applications of optimization in finance such as volatility surface determination and global minimization for value-at-risk.", "Assignments include formulation and analysis of models used in portfolio optimization as well as some Matlab coding.", "Analyze and code optimization methods for portfolio models.", "Week 1: Linear algebra review", "Week 2: Solving a portfolio optimization problem with QR factorization; symmetric matrices", "Week 3: Three formulations of portfolio optimization", "Week 5: Risk-free security; Sharpe ratio; capital market line", "Week 7: Numerical linear algebra; null space method", "Week 8: Active set methods and parametric programming", "Week 11: Nonlinear programming and applications to portfolio optimization", "Week 12: Advanced topics: arbitrage, factor models, conditional independence, risk parity, machine learning in portfolio optimization", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course.", "·   In Fall 2022, a second self-declaration form was created for students to declare a short-term absence."]}, {"course_id": 30, "course_code": "CO 452", "course_name": "CO452 - Integer Programming (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Formulation of problems as integer linear programs.", "Solution by branch-and-bound and cutting plane algorithms.", "Introduction to the theory of valid inequalities and polyhedral combinatorics.", "Integer Programming is a mathematical program that can be seen as a linear program with the additional requirement that some (or all) of the variables are required to take on integer values.", "While linear programming is already very useful in modeling problems and can be solved well using either interior point methods or the simplex method, {\\bf Integer programs, or IPs} have a much broader range of applications.", "In this course we will explore an upper-level undergraduate/basic graduate introduction to the topic of Integer Programming.", "Understand basic theory and algorithms behind integer programming approaches", "Basic geometric definitions: Convex/affine/linear combinations.", "Basic polyhedral theory: Faces, facets, extreme points.", "Integral polyhedra and Total Dual Integrality.", "Union of polyhedra and representability.", "Equivalence of optimization and separation.", "Gomory cuts and other cutting planes.", "Rank and closures.", "Branch-and-bound: Basic ideas and extensions.", "Theoretical and computational results.", "This includes technical problems in your submission, like power outage, no internet access, etc.", "Collaboration", "Re-marking policies", "Note that your solution will be very carefully examined during a re-mark.", "In addition such student needs to be in good standing.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as undertanding theory and algorithms for some classes of optimization models.", "Library for research-based assignments"]}, {"course_id": 31, "course_code": "CO 454", "course_name": "CO454 - Scheduling (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Scheduling Spring 2024", "10:00AM - 11:20AM DWE 3517", "E-mail : nikhil.kumar2@uwaterloo.ca", "An overview of practical optimization problems that can be posed as scheduling problems.", "Simple and efficient combinatorial algorithms for easy problems.", "Scheduling problems form a large part of resource allocation problems where sparse resources have to be assigned over time to complete tasks and optimize over one or multiple objectives.", "The course will also contain a brief overview of computational complexity and various techniques for the design of efficient exact and approximate algorithms.", "Scheduling problems: Modeling and notations", "Single-machine Models, Optimal schedules, Exact algorithms", "Computational complexity - P, NP, NP-completeness.", "Multiple-machine models, approximation algorithms.", "Dynamic Programming and its application to scheduling", "Linear and Integer Programming techniques", "Scheduling: Theory, Algorithms, and Systems Author: Michael Pinedo No", "Algorithm Design Authors: Jon Kleinberg and Eva Tardos No"]}, {"course_id": 32, "course_code": "CO 456", "course_name": "CO456 - Introduction to Game Theory (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Introduction to Game Theory Fall 2024", "A broad introduction to game theory and its applications to the modeling of competition and cooperation in business, economics, and society.", "Classical game theory studies the competitive and cooperative behaviour of rational and self‐interested individuals in strategic environments.", "It speciﬁcally develops beautiful analytic tools to analyze and model situations in which a person’s welfare is a function not only of their own actions, but also those of others.", "This course is meant to be a broad and mathematical introduction to game theory and its appications.", "We will attempt to cover these topics:", "This class is meant to be a broad and mathematical introduction to game theory and its applications.", "Game Theory Basics, Bernhard von Stengel http://www.maths.lse.ac.uk/personal/stengel/lectnotes1-7.pdf No", "An Introduction to Game Theory, Martin J. Osborne https://www.economics.utoronto.ca/osborne/igt/ No", "Mechanism Design and Approximation, Jason D. Hartline http://jasonhartline.com/MDnA/ No", "As the title implies, a basic introduction to various topics in game theory.", "An introduction to game theory and equilibria from a computer science perspective.", "An Introduction to Game Theory, Martin J. Osborne.", "The text contains a section on game theory, and some chapters about matching games.", "Mechanism Design and Approximation, Jason D. Hartline.", "These notes were written for a graduate class, and cover mechanism design from an advanced perspective.", "Your submission must be clear and legible, and in the correct orientation.", "You are expected to work on the assignment problems and submit them well ahead of the deadline, in case of technical difficulty.", "You must write up your own solutions without seeking help from anyone, and list the names of your collaborators in each of the assignment problems involved.", "This is a closed-book exam, no aids are allowed.", "A missed test will be treated the same as a mark of zero.", "This is a closed-book exam, no aids are allowed.", "Re-marking policies", "Note that your solution will be very carefully examined during a re-mark.", "In case of serious illness during the final exam, you may be granted a grade of INC provided that", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as finding Nash equilibria and applying game theory to real life applications.", "Library for research-based assignments"]}, {"course_id": 33, "course_code": "CO 463", "course_name": "CO463 - Convex Optimization and Analysis (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Notice of Recording", "Convex Optimization and Analysis Winter 2024", "An introduction to the modern theory of convex programming, its extensions and applications.", "Structure of convex sets, separation and support, subgradient calculus for convex functions, Fenchel conjugacy and duality, Lagrange multipliers.", "Ellipsoid method for convex optimization.", "Determine whether sets and functions are convex and supply a proof", "Compute conjugates and subdifferentials of convex functions and duals of norms", "Determine Lagrange duals and necessary and sufficient conditions for convex optimization problems", "Recognize standard forms of convex programming", "Implement some convex optimization algorithms and use a convex optimization modeling language", "Convex sets", "Convex functions", "Characterization in terms of first and second derivative", "Conjugacy", "Norms and sublinear functions", "Convex optimization", "Standard forms of convex programming", "Basics of monotone operator theory", "First-order methods", "H. Bauschke and P. Combettes, Convex analysis and monotone operator theory in Hilbert spaces, 2017.", "Notice of Recording", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 35, "course_code": "CO 471", "course_name": "CO471 - Semidefinite Optimization (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Semidefinite Optimization Spring 2023", "04:00PM - 05:20PM", "Optimization over convex sets described as the intersection of the set of symmetric, positive semidefinite matrices with affine spaces.", "Theoretical and practical consequences of these formulations.", "Duality theory and algorithms.", "Optimization over convex sets described as the intersections of the set of symmetric, positive semidefinite matrices with affine spaces.", "Formulations of problems from combinatorial optimization, graph theory, number theory, probability and statistics, engineering design and control theory.", "Theoretical and practical consequences of these formulations.", "Duality theory and algorithms.", "Topics Include: Optimization over convex sets described as the intersection of the set of symmetric, positive semideﬁnite matrices with aﬃne spaces: Semideﬁnite optimization vastly generalizes linear programming where variable vectors may be replaced with matrix variables and, in addition to linear equations and inequalities, one may utilize constraints requiring some of the matrix variables to be symmetric and positive semideﬁnite.", "duality theory for semideﬁnite optimization,", "algorithms for semideﬁnite optimization: ellipsoid method, ﬁrst‐order methods and primal‐dual interior‐point methods for semideﬁnite optimization, and approximation algorithms based on semideﬁnite optimization,", "formulations of problems from combinatorial optimization, graph theory, number theory, probability and statistics, complexity analysis of algorithms, engineering design and control theory, theoretical and practical consequences of these formulations,", "Polyhedral and Semidefinite Programming Methods in Combinatorial Optimization"]}, {"course_id": 36, "course_code": "CO 485", "course_name": "CO485 - The Mathematics of Public-Key Cryptography (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["The Mathematics of Public-Key Cryptography Fall 2024", "08:30AM - 09:50AM DWE 3517", "An in-depth study of public-key cryptography.", "Public-key encryption, digital signatures, key establishment, elliptic curve cryptography, post-quantum cryptography.", "An in-depth study of public-key cryptography, including: number-theoretic problems - prime generation, integer factorization, discrete logarithms; public-key encryption; digital signatures; key establishment; elliptic curve cryptography; post-quantum cryptography; and security proofs.", "An in-depth study of public-key cryptography and number-theoretic problems related to the efficient and secure use of public-key cryptographic schemes.", "Algorithmic number theory: Primality testing, integer factorization problem, discrete logarithm problem, elliptic curve discrete logarithm problem.", "Additional topics: Pairing-based cryptography, post-quantum cryptography.", "An Introduction to Mathematical Cryptography (2nd ed.), Hoffstein, Pipher, and Silverman.", "The quizzes are intended to reinforce basic concepts that are, in some sense, \"too easy\" to put in an assignment (e.g., definitions, simple calculations).", "Assignments: Right now I expect a total of 6 assignments in the course.", "Late assignments will be given a grade of 0 and I reserve the right not to grade them.", "Exception: Any student who self-declares a short-term absence overlapping with an assignment due date receives a 48-hour extension on the assignment without penalty, and assignments submitted within this extension period will be graded."]}, {"course_id": 37, "course_code": "CO 487", "course_name": "CO487 - Applied Cryptography (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Instructor: Samuel Jaques", "Email: sejaques@uwaterloo.ca", "Timothy Miller", "Nicolas Swanson", "A broad introduction to modern cryptography, highlighting the tools and techniques used to secure internet and messaging applications.", "It is one of the core technologies for securing the emerging information infrastructure.", "This course is a comprehensive introduction to modern cryptography that is aimed primarily at those interested in applications.", "In the area of public-key cryptography, topics will include an overview of specific systems (Diffie–Hellman, RSA, DSA, etc.) and a few advanced protocols.", "The security of these schemes and the use of public-key techniques for generating digital signatures will be described.", "Linear and differential cryptanalysis of ciphers.", "Define the main information security goals of confidentiality, integrity, authentication, and availability", "Explain the intended security properties of each cryptographic primitive and analyze relationships between security properties", "Explain mathematical techniques underlying standardized cryptographic algorithms", "Identify flaws in uses of cryptographic algorithms", "Determine which cryptographic algorithms can be used and combined to build systems with desired functionality and security", "Understand and contextualize the cryptography and security around them in daily life", "0 1 (Jan 6-8) Introduction", "Symmetric Encryption", "3.6 9 Elliptic Curve Cryptography 4 Yes", "4   Applications", "Understanding Cryptography: From Established Symmetric and Asymmetric Ciphers to Post-Quantum Algorithms, 2nd edition, Springer, 2024 Primary reference.", "A1: January 23", "A4: March 20", "This will be clearly indicated for each such question.", "In that case you are required to work independently.", "These questions will test your ability to identify the important concepts introduced in lectures, and your understanding of them.", "In particular:", "Please inform us of these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 38, "course_code": "CS 341", "course_name": "CS341 - Algorithms (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Algorithms Winter 2025", "10:00AM - 11:20AM MC 4061", "08:30AM - 09:50AM MC 1056", "The study of efficient algorithms and effective algorithm design techniques.", "Topics include divide and conquer algorithms, recurrences, greedy algorithms, dynamic programming, graph search and backtrack, problems without algorithms, NP-completeness and its implications.", "DPV", "Introduction to Algorithms, by Cormen, Leiserson, Rivest and Stein, MIT Press.", "describe the main idea first,", "Extensions and Other Accommodations on Assignments", "Students can currently self-declare two kinds of absences on Quest: short-term absence and pandemic-related absence.", "Since a short-term absence lasts 2 days, this means the only accommodation we offer for a short-term absence is a 48 hour extension.", "If you request accommodations through AccessAbility Services (AAS) by filling out a Missed Course Component form, the accommodation is determined on a case-by-case basis through consultation with AAS, but will generally be one of the above options unless your situation is unusual.", "If you collaborate with others, you must clearly indicate the collaboration for each problem.", "This is not a software engineering course; we will not test your code against inputs that do not match our specifications.", "Continuity Plan", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 39, "course_code": "CS 431", "course_name": "CS431 - Data-Intensive Distributed Analytics (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Data-Intensive Distributed Analytics Fall 2024", "10:00AM - 11:20AM MC 2035", "Introduces non-CS major students to infrastructure for data-intensive analytics, with a focus on abstractions, frameworks, and algorithms that allow developers to distribute computation across many machines.", "Topics include core concepts (partitioning, replication, locality, consistency), computational models (MapReduce, dataflows, stream processing, bulk-synchronous parallel), and applications.", "Explain the key concepts in distributed big data projects", "Write clean and efficient Hadoop MapReduce and Spark code", "Understand and design distributed algorithms for the analysis of textual, graph, and relational data", "Explain the design issues involved with distributed relational and non-relational database systems such as Apache HBase / Google BigTable", "Introduction to Distributed Text Processing 1", "Introduction to Hadoop MapReduce 3", "Introduction to Apache Spark 3", "Distributed Database Systems 3", "This course includes the independent development and practice of specific skills, such as designing MapReduce and Spark code.", "Library for research-based assignments"]}, {"course_id": 40, "course_code": "CS 451", "course_name": "CS451 - Data-Intensive Distributed Computing (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Data-Intensive Distributed Computing Winter 2025", "10:00AM - 11:20AM MC 2017", "RCH 307", "10:00AM - 11:20AM MC 2017", "RCH 307", "Introduces students to infrastructure for data-intensive computing, with a focus on abstractions, frameworks, and algorithms that allow developers to distribute computations across many machines.", "Topics include core concepts (partitioning, replication, locality, consistency), computational models (MapReduce, dataflows, stream processing, bulk-synchronous parallel), and applications.", "Explain the key concepts in distributed big data projects", "Write clean and efficient Hadoop MapReduce and Spark code", "Understand and design distributed algorithms for the analysis of textual, graph, and relational data", "Explain the design issues involved with distributed relational and non-relational database systems such as Apache HBase / Google BigTable", "Introduction to Distributed Text Processing 1", "Introduction to Hadoop MapReduce 3", "Introduction to Apache Spark 3", "Distributed Database Systems 3", "This course includes the independent development and practice of specific skills, such as designing MapReduce and Spark code.", "Library for research-based assignments"]}, {"course_id": 41, "course_code": "CS 466", "course_name": "CS466 - Algorithm Design and Analysis (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Algorithm Design and Analysis Fall 2024", "Monday -", "Monday", "Sepehr Assadi - sassadi@uwaterloo.ca", "MohammadHossein Ebtehaj - mhebtehaj@uwaterloo.ca", "General information", "Mathematical maturity, and a strong background in probability, data structures, and algorithm design.", "I invite you to let me know about what I can stop, start, or continue doing to make sure every one of my students feels valued and can engage actively in our learning community.", "This is an advanced algorithm design and analysis course, aimed at undergraduate students interested in a deep dive in theoretical computer science (TCS), as well as graduate students doing research in TCS.", "Probabilistic analysis: Randomized algorithms, Concentration inequalities, Balls-and-bins", "Linear programming: Basics, Duality, Center-of-gravity algorithm, Rounding", "Multiplicative weight update (MWU): Expert problem, Fast packing/covering linear programs", "Random walks: Connectivity in RL, Perfect matchings in regular bipartite graphs, Sampling", "Dynamic graph algorithms: Connectivity, Approximate matching", "Parallel algorithms: Matching in RNC, Isolation lemma", "design and analyze algorithms for a wide range of canonical problems studied in this course, and even more importantly, for new problems that you may have not encountered directly yet,", "know a wide range of algorithmic and mathematical tools commonly used in design and analysis of algorithms, and", "have a basic familiarity with various algorithmic models of computation studied in TCS.", "Probabilistic Background and Concentration inequalities", "Streaming distinct elements, Limited independence hash functions", "Balls-and-bins experiments: Power of two choices via random graph theory", "MSTs: Basics, Fredman-Tarjan algorithm", "MSTs: Karger-Klein-Tarjan algorithm", "Linear programming (LP): Basics and Applications", "Linear Programming (LP): Duality and Integrality gaps", "Linear Programming (LP): More on Integrality gaps, Dual fitting for set cover", "Linear Programming (LP): Primal-dual for bipartite matching", "Online matching with a primal-dual analysis", "Graph sketches: Connectivity and L0-samplers", "Random walks: fundamental theorem of Markov chains, connectivity in RL", "Random walks: Perfect matching in regular bipartite graphs", "DP09 Devdatt P. Dubhashi and Alessandro Panconesi, Concentration of Measure for the Analysis of Randomised Algorithms.", "V20 Nisheeth K. Vishnoi, Algorithms for Convex Optimization.", "AHK12", "Please refer to the Course Webpage for a list of papers related to the topics discussed in the lectures.", "This is a list of some other closely related courses taught elsewhere:", "Randomised and Advanced Algorithms, Winter 2024 by Clément Canonne @ University of Sydney.", "Advanced Algorithms, Spring 2023 by Anupam Gupta @ CMU.", "Advanced Algorithms, Fall 2021 by Mohsen Ghaffari @ ETH.", "Advanced Algorithm Design, Fall 2022 by Matt Weinberg and Huacheng Yu @ Princeton.", "Advanced Topics in Algorithms, Fall 2021 by Kent Quanrud @ Purdue.", "Advanced Algorithms, Winter 2020 by Aleksandar Nikolov @ University of Toronto.", "CS466/666: Algorithm Design and Analysis, Spring 2024 by Rafael Oliveira", "CS466/666: Algorithm Design and Analysis, Fall 2024 by Sepehr Assadi", "CS466/666: Algorithm Design and Analysis, Fall 2022 by Therese Biedl", "CS466/666: Algorithm Design and Analysis, Spring 2022 by Lap Chi Lau", "Course Project (only for graduate students in CS 666) 15%", "15% Course Project (only for graduate students in CS 666)", "The solutions should be turned in as a single pdf file containing the answers to the assignment questions in order.", "For students: LaTeX tremendously helps you in writing clean and well-structured proofs (a necessity for a rigorous proof ) as well as editing an already written proof further.", "For submissions, only one member of the group submits the full solutions on Crowdmark and lists the name of their partners in the group.", "In this case, all members of the group lose one of their extensions.", "However, you can bring in a one-page cheat sheet with you to the exam.", "The final exam follows the same policies as the mid-term exam for blank solutions, one-page cheat sheet, and missed exams.", "Course Project (only for graduate students registered in CS 666)", "Policies and Statements", "Email is fast and tends to give the illusion of constant and immediate access.", "Also, please use email only to communicate specific concerns, questions, or comments regarding your experience in the course, or setting up appointments for in-person meetings outside office hours in case necessary.", "I am using bunch of different email filters to manage my (unmanageable) inbox and I may not get to see emails without this format at all...", "Please let us know ways to improv", "Please inform us of these at the start of the course.", "Your Health & Well-Being", "This is a challenging course with various advanced topics and not-so-easy assignments and exams.", "All of these are going to be time and energy consuming.", "I expect that any assignment or exam you submit in this course will be your own product and follows the collaboration and external resources policies specified earlier in this course outline.", "Intellectual property includes items such as:"]}, {"course_id": 42, "course_code": "CS 476", "course_name": "CS476 - Numeric Computation for Financial Modeling (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Numeric Computation for Financial Modeling Winter 2025", "10:00AM - 11:20AM MC 2035", "Erik Hintz", "The interaction of financial models, numerical methods, and computing environments.", "Basic computational aspects of option pricing and hedging.", "Numerical methods for stochastic differential equations, strong and weak convergence.", "Finite difference methods for the Black-Scholes equation.", "Methods for portfolio optimization, effect of data errors on portfolio weights.", "The interaction of financial modes, numerical methods, and computing environments.", "Basic computational aspects of option pricing and hedging.", "Numerical methods for stochastic differential equations, strong and weak convergence.", "Finite difference methods for Black-Scholes equation.", "Methods for portfolio optimization, effect of data errors on portfolio weights.", "apply and understand modern numerical algorithms for use in financial applications.", "The following are the tentative topics in chronological order:", "Introduction to financial markets:", "Introduction to stocks, bonds, options", "no arbitrage pricing", "option pricing on lattices", "Black Scholes model and Ito's Lemma", "Random variate generation", "Option pricing", "VaR and CVaR estimation", "Correlate assets", "PDEs for European and American Options", "Explicit and Implicit Finite Difference Methods", "4. Calibration and Optimization", "Option model calibration", "CVaR portfolio optimization", "non-linear optimzation", "Your Crowdmark submission must include all code and relevant output; code must be reasonably well commented.", "The first weeks will be spent on introducing some basics of financial markets/financial mathematics.", "), usually a make-up examination will take place at a time mutually agreed-upon.", "To have your document considered for regrading you must formulate a request in writing by email to the instructor, providing the problem and a reason for why you believe it should be regraded.", "A mechanic encounters a problem, analyzes it, and fixes it with the tools from her/his toolbox."]}, {"course_id": 43, "course_code": "CS 479", "course_name": "CS479 - Neural Networks (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["04:00PM - 05:20PM", "04:00PM - 05:20PM", "Mohamed Hibat-Allah", "Xinyu Crystina Zhang", "Andy Zheng", "Junteng Zheng", "Simple neuron models and networks of neurons.", "Advanced topics, including adversarial inputs and biologically plausible learning methods.", "Formulate a neural learning method as gradient-based optimization", "Derive a neural learning method based on energy minimization", "Design neural-network solutions for different learning scenarios", "Identify some commonalities between artificial neural networks and the brain", "-", "Introduction, Neuron Models", "Hodgkin-Huxley", "Leaky Integrate-and-Fire", "-", "Synapses", "Formulation of Learning", "Loss functions", "-", "Error Backpropagation", "-", "Automatic Differentiation", "-", "Overfitting", "Optimization Considerations", "SGD", "Momentum", "-", "Vision", "-", "No classes", "-", "-", "Autoencoders", "Vector Embeddings", "-", "Advanced Autoencoders", "Diffusion Networks", "-", "-", "Population Coding", "Optimal linear decoding", "Transformations", "Dynamics", "-", "Biological backprop", "Instructions will be given for each programming assignment.", "A1 Jan 22 Neuron and synapse models", "A4 Mar 19 Recurrent networks", "The projects will be done in groups of 2 students, and will involve implementing a method from a paper, and reproducing some of its results.", "Continuity of In-Person Course Components", "The assignment procedures will not be affected by a cancellation of in-person classes since they are distributed and submitted online.", "Students will be given a 24-hour period during which the exam must be written.", "What you can do: GenAI can be used as a smart substitute for Google search, e.g., code debugging, finding plotting commands.", "What you can't do: GenAI must not be used to code up the logic of a solution, or part of a solution."]}, {"course_id": 44, "course_code": "CS 480", "course_name": "CS480 - Introduction to Machine Learning (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Introduction to Machine Learning Winter 2025", "10:00AM - 11:20AM DWE 1501", "Introduction to modelling and algorithmic techniques for machines to learn concepts from data.", "Optimization-based learning: loss minimization. regularization.", "This is especially useful in complex tasks such as natural language processing, information retrieval, data mining, computer vision and robotics where it is not practical for a programmer to enumerate all possible situations in order to specify suitable instructions for all situations.", "The course will introduce the basics of machine learning and data analysis, and demonstrate how machine learning techniques have impacted life and society.", "The course starts with some classical tasks and algorithms in machine learning, then transitions to modern advances and successful applications in real life, and finally ends with discussions on the societal impact that machine learning has generated.", "A significant part of the course will be devoted to raising students' awareness on such ethical issues, including how to make machine learning algorithms fair and unbiased, how to protect individual privacy without compromising learning, how machine learning algorithms might be attacked, how to measure and improve the security of machine learning algorithms, and how to make machine learning algorithms explainable and interpretable.", "Recognize and formalize a task as a machine learning problem", "Identify suitable algorithms to tackle different machine learning problems", "Understand and implement a plethora of foundational machine learning algorithms", "Apply machine learning algorithms to real datasets", "Become aware of potential ethical and safety issues of machine learning on society", "Introduction (first lecture: Jan 7, 2025)", "Linear Regression", "Reproducing Kernels", "Multi-layer Perceptron", "Deep Neural Networks", "Attention", "Decision Trees", "Flow Models", "Variational Autoencoders", "Diffusion Models"]}, {"course_id": 45, "course_code": "CS 482", "course_name": "CS482 - Computational Techniques in Biological Sequence Analysis (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Computational Techniques in Biological Sequence Analysis Winter 2025", "P. Millan Arias", "Dr. Pablo Millan Arias", "Email: pmillana[at]uwaterloo[dot]ca", "Email: mmwrana@uwaterloo.ca", "Email: j364zhu@uwaterloo.ca", "Computer science principles and algorithms in biological sequence analysis.", "Topics include algorithms for sequence comparison, for large-scale database search in biological databases, for sequence assembly, for evolutionary tree reconstruction, for identifying important features in DNA and RNA sequences, and underlying computational techniques for understanding strings and trees and for making probabilistic inferences.", "Topics include algotithms for sequence comparison, for large-scale database search in biological databases, for sequence assembly, for evolutionary tree reconstruction, for identifying important featrues in DNA and RNA sequences, and underlying computational techniques for understanding strings and trees and for making probabilistic inferences.", "Due to the large volume of data generated by genome sequencing and cellular measurements of gene expression changes, computer science and mathematics have profoundly changed the science of modern biology.", "Computational methods are now critical to developing experimental and analytical tools in biological sciences.", "Prerequisites: Students are not required to have any prior knowledge of molecular biology, but some understanding of basic biological concepts is beneficial.", "Get a first approximation to modern technologies being used as a substitute for classical algorithms to gain more insight into various biological mechanisms.", "Gain practical experience in obtaining data from online resources and analyzing the data within an appropriate biological context.", "L02 Jan 8 A primer in Computational Biology", "L05 Jan 20 Sequence Database search / Multiple Sequence Alignment", "L07 Jan 27 Genome assembly and mapping", "L10 Feb 5 Alignment free methods Deep Learning in Genomics", "L14 Mar 3 RNA-Sequencing & Gene Expression", "L18 Mar 17 RNA & protein structure prediction", "L20 Mar 24 Single-cell genomics", "L22 Mar 31 Foundations in Deep Learning: Transformer Models", "Nature Computational Biology compendium which collected a series of tutorials about classic computational biology-related topics, is available at: link", "Bioinformatics Algorithms: An Active Learning Approach (3rd Edition) (2018) by Phillip Compeau and Pavel Pevzner", "For each assignment, the source code and the assignment report will be reviewed and graded by the TA.", "The source code should be readable, runnable, and pass the tests.", "The project report should be detailed enough for the TA to run the code and expected to have the following sections: introduction, implementation details, results, and discussion.", "No justification is required for a late submission.", "Make-up exams require permission in advance with a doctor’s excuse in the case of illness."]}, {"course_id": 47, "course_code": "CS 487", "course_name": "CS487 - Introduction to Symbolic Computation (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Introduction to Symbolic Computation Winter 2025", "10:00AM - 11:20AM MC 4020", "An introduction to the use of computers for symbolic mathematical computation, involving traditional mathematical computations such as solving linear equations (exactly), analytic differentiation and integration of functions, and analytic solution of differential equations.", "Objectives: To introduce students to how symbolic computation is done and broaden their knowledge of algorithmic techniques used to efficiently solve problems in many different algebraic and geometric settings, their limitations, and to gain a deeper understanding about symbolic algorithms and how to analyze them.", "Basic arithmetic operations with polynomials", "Polynomial Factoring (univariate, multivariate, and over finite fields as well as over the rationals)", "Multivariate Polynomial Division", "Groebner Bases", "Basic Algorithms in Group Theory", "Applications", "Algorithms for Computer Algebra The book is optional No 210.71", "Please inform the instructor to make the deadline adjustment.", "Your code is an important part of the assignment, and as such it should be readable and well-commented.", "Assignment figures and graphs should be carefully thought out and labelled to present the data and your conclusions in an effective and clear manner.", "Any code and algorithms you write should be sufficiently well documented through code comments or descriptions as to be readily understood.", "This code submission should allow the TAs to run your code if and when necessary to verify the results that your code produces.", "This could be a literature survey of a subtopic in numerical linear algebra, an empirical comparison/implementation of several related algorithms, an application of numerical linear algebra to another field, the design of a novel numerical linear algebra algorithm, or a theoretical analysis of the performance of a numerical linear algebra algorithm (new or old).", "Collaboration and Plagiarism:", "We encourage you to discuss general concepts and problems with classmates, TAs, and instructors.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Intellectual property includes items such as:", "Avoiding Academic Offenses", "Many students may be unaware of the line between acceptable and unacceptable academic behaviour, especially when discussing", "For information and tips related to academic integrity, students may", "The most severe COVID-related risks have lessened for many people, such as individuals", "With these facts in mind, one way that everyone in our class can contribute to a safer and more equitable learning environment is to stay home when you are ill and, at minimum, wear a mask if you suspect you might be contagious.", "A range of on- and off-campus resources are available"]}, {"course_id": 48, "course_code": "PMATH 370", "course_name": "PMATH370 - Chaos and Fractals (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["11:30AM - 12:20PM QNC 1502", "E-mail: bmadill@uwaterloo.ca", "The mathematics of iterated functions, properties of discrete dynamical systems, Mandelbrot and Julia sets.", "Week of", "Iteration and Orbits", "Graphical Analysis and Fixed Points", "Bifurcations and the Cantor Set A1", "Symbolic Dynamics", "Iterated Function Systems I Midterm", "Iterated Function Systems II", "March 25*", "Guest Speakers", "Guest Speakers A4", "A First Course in Chaotic Dynamical Systems Author: Devaney Yes", "b) Assignments may be done in groups of up to 3 people."]}, {"course_id": 49, "course_code": "STAT 440", "course_name": "STAT440 - Computational Inference (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Computational Inference Winter 2025", "PHY 313", "Introduction to and application of computational methods in statistical inference.", "Monte Carlo evaluation of statistical procedures, exploration of the likelihood function through graphical and optimization techniques.", "Topics include expectation-maximization, Bootstrapping, Markov Chain Monte Carlo, and other computationally intensive methods.", "A1 Feb 4th", "A4 Apr 3rd"]}, {"course_id": 50, "course_code": "STAT 441", "course_name": "STAT441 - Statistical Learning - Classification (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["10:00AM - 11:20AM B1 271", "Email: mlysy@uwaterloo.ca", "STAT 841: View requirements for STAT 841", "Describe the basic principles and methods of statistical classification.", "Know when to use each of these methods on a given dataset.", "Evaluate and compare the output of various classifiers.", "An Introduction to Statistical Learning with Applications in R, by James, Witten, Hastie & Tibshirani https://www.statlearning.com", "There will be two closed-book midterms worth 15% each on the following dates:", "There are no make-up midterms in this course.", "Discussion Board", "Please self-enroll at https://piazza.com/uwaterloo.ca/winter2025/stat441841cm763.", "You can generally expect a response from TAs within two business days.", "Software", "Material and assignments will require the use of R and Python programming languages, as well as the technical document writing programs for these languages: R Markdown and Quarto.", "Regrades", "Email", "Emails which do not adhere to this standard will generally be ignored.", "Intellectual property includes items such as:", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 51, "course_code": "STAT 442", "course_name": "STAT442 - Data Visualization (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Notice of Recording", "Data Visualization Winter 2025", "11:30AM - 12:20PM B1 271", "Discussion Board", "Email", "Response time", "Both human perception and statistical properties inform the methods used to display and visually explore categorical, continuous, time-ordered, map, and high dimensional data.", "Statistical concepts visually presented include variability, densities, quantiles, conditioning, and hypothesis testing.", "Interactive graphics include linking, brushing, motion, and the navigation of high dimensional spaces guided via projection indices.", "Interpret and critique the most commonly used kinds of visualizations today.", "Create a variety of univariate, bivariate, and multivariate graphs using base R and the tidyverse.", "Look up the necessary code to complete additional graphs not covered here.", "Book - Data Science - A First Introduction.", "Book - The Chicago Guide to Multivariate Analysis, Jane E. Miller", "Book - Cool Infographics - Effective Communication with Data Visualization and Design, Randy Krum.", "Industry Paper - Making Data Meaningful, United Nations Economic Commission for Europe.", "Notice of Recording", "No waiving of this penalty will occur for technical issues.", "Details can be found here: https://uwaterloo.ca/math/accommodations", "Phone: 519-884-0000 extension 213", "Lots of people look like they have it together in public and online when they're a mess inside too.", "They got you into university, so they've already done most of the work, but at this point, the most they can really do for you decide if you can get into graduate school before doing industry experience.", "Don't let that be your reason for thinking this is as good as it gets.", "In particular:", "Please inform me of these at the start of the course."]}, {"course_id": 52, "course_code": "STAT 444", "course_name": "STAT444 - Statistical Learning - Advanced Regression (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Statistical Learning - Advanced Regression Spring 2024", "Topics cover a wide selection of advanced methods useful to address the challenges arising from real-world and high-dimensional data; methods include robust regression, nonparametric regression such as smoothing splines, kernels, additive models, tree based methods, boosting and bagging, and penalized linear regression methods such as the ridge regression, lasso, and their variants.", "Students will gain an appreciation of the mathematical and statistical concepts underlying the methods and also computational experience in applying the methods to real data.", "Topics cover a wide selection of advanced methods useful to address the challenges arising from real-world and high-dimensional data; methods include robust regression, nonparametric regression such as smoothing splines, kernels, additive models, tree-based methods, boosting and bagging, and penalized linear regression methods such as the ridge regression, lasso, and their variants.", "Students will gain an appreciation of the mathematical and statistical concepts underlying the methods and also computational experience in applying the methods to real data.", "2 Nonlinear Regression I: Basis functions and Splines 3 – 4", "4 Predictive Modelling I: Error Estimation and Model Assessment 7 – 9", "Generalized Additive Models: An Introduction with R https://www.taylorfrancis.com/books/mono/10.1201/9781315370279/generalized-additive-models-simon-wood No"]}, {"course_id": 0, "course_code": "ECE 105", "course_name": "ECE105 - Classical Mechanics (0.50)", "term_name": "1A Term", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Classical Mechanics Fall 2024", "ECE 105", "ECE 105 001", "Forces in nature and Newton's laws, dynamics and circular motion, work, energy, and conservation of energy.", "Linear momentum and linear impulse, rotational dynamics.", "View requirements for ECE 105", "identify the underlying physical principles relevant to a given physics problem", "develop a strategy how to solve the probelm", "employ the appropriate mathematical knowledge to do so", "Kinematics in 1D", "Free Fall, Kinematics in 2D and", "Relative motion", "Forces:", "Normal force and Tension", "Conservation of energy", "Linear momentum, Impulse", "Conservation of Linear momentum", "(1D, 2D & Relative Motion, Forces, Work, Energy conservation)", "Rot. kinetic energy, Moment of inertia, Torque", "Angular momentum conservation", "Rolling motion", "Static equilibrium", "SMH, Mass – spring systems", "SMH Energy", "December", "“Physics for Scientists and Engineers”, 2nd edition by Hawkes et.al.", "Mastering Physics online tool Yes", "The purpose of the assignments is for you to practice the fundamental techniques in a low-pressure environment.", "The total duration of each quiz is 60 min (50 min for writing the solutions and 10 min grace period for uploading pictures of the hand-written solutions).", "Make sure that where you write has a stable internet connection.", "Inability to submit because of your internet connection will require evidence of completion by the deadline.", "In case you cannot attend the FE due to illness of family emergency, contact the 1st", "Notice of Recording", "No parts of this course will be recorded"]}, {"course_id": 1, "course_code": "ECE 150", "course_name": "ECE150 - Fundamentals of Programming (0.50)", "term_name": "1A Term", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "ECE 150", "04:30PM - 05:20PM", "10:30AM - 11:20AM E7 5353", "08:30AM - 10:20AM", "Monday, Friday -", "11:30AM - 12:20PM E7 5353", "08:30AM - 10:20AM", "03:30PM - 04:20PM E7 5343", "02:30PM - 03:20PM", "08:30AM - 09:20AM", "08:30AM - 10:20AM", "Software design process in a high-level programming environment.", "Programming fundamentals, language syntax, simple data types, control constructs, functions, parameter passing, recursion, classes, arrays and lists, list traversals, introduction to searching and sorting algorithms, basic object-oriented design, polymorphism and inheritance, simple testing and debugging strategies, pointers and references, basic memory management.", "View requirements for ECE 150", "Instruct computers to carry out operational tasks using the C++ language.", "Demonstrate the ability to perform both procedural programming and object-oriented programming.", "Demonstrate the ability to test and debug programs.", "Also, the Department of Electrical and Computer Engineering cancels classes during mid-term week and, instead, offers make-up lectures.", "Libraries and function calls; writing functions; assertions; code-development strategies; writing tests and comments; and logging.", "Debugging; binary and hexadecimal numbers; integer data types; bitwise and bit-shift operators; floating-point data types; constant variables; and the default value of parameters.", "Addresses and pointers; dynamic memory allocation including that of arrays; lifetime of dynamically allocated memory; problems with pointers; and protecting pointers with const.", "Searching of arrays; sorted arrays; binary search; selection and insertion sort; and introduction to recursive algorithms and recursive mathematical functions.", "Solving problems recursively; the class data structure; namespaces; and functions on objects.", "Operator overloading; issues with member variables; using member functions; throwing and catching exceptions; classes; encapsulation; and constructors.", "Copies of objects; assignment of objects; the destructor; dynamic memory allocation in classes; weaknesses with arrays; linked lists; and a linked list with dynamic memory allocation.", "Adding a size list member variable and a tail pointer member variable; concatenating two linked lists; inheritance; a base linked list class; a window class for graphical user interfaces; exception classes and polymorphism; and a widget class for graphical user interfaces.", "Source code for Projects be submitted through the Marmoset.", "MOSS is used to verify that all source code in projects is not plagiarized from peers either from this offering or previous offerings of this course.", "Notice of Recording", "Generative artificial intelligence: This course includes the independent development and practice of specific skills, such as software design and development.", "Library for research-based assignments", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 2, "course_code": "ECE 190", "course_name": "ECE190 - Engineering Profession and Practice (0.25)", "term_name": "1A Term", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Profession and Practice Fall 2024", "08:30AM - 09:20AM E7 5353", "D. Davison", "11:30AM - 12:20PM E7 5353", "02:30PM - 03:20PM", "D. Davison", "04:30PM - 05:20PM", "03:30PM - 04:20PM E7 5343", "D. Davison", "Instructor Dan Davison", "o  Tuesdays 10:30am - 12:30pm in EIT 3114 and", "First-Year Engineering Tutors Noah Witzke", "TBD", "tbd@uwaterloo.ca Provide support during in-person activities", "Also see the contact information in the CFE Information folder on LEARN.", "Introduction to electrical and computer engineering with an emphasis on the profession of engineering, and engineering design.", "Additional topics include co-op fundamentals for engineering students, professional development, and diversity training with a goal of understanding the roles and responsibilities of the professional engineer in society.", "View requirements for ECE 190", "(4) Describe the steps of the engineering design process and apply them to a small design project", "(5) Define sustainable development and describe ways in which environmental sustainability and engineering are related", "(6) Explain the central ethical duties in engineering, and make justifiable decisions to solve simple ethical problems", "(7) Analyze and control risks in simple engineering and workplace settings", "(8) Explain the three design-team traps of ignorance, staleness, and social loafing and identify techniques to help avoid them", "(9) Define professional development and explain the role of professional development in engineering", "(11) Describe the three components of project management, construct a PERT chart, and identify a project's critical path", "\"Knowledge base for engineering\"", "\"Investigation\"", "\"Design\"", "6a", "\"Impact of engineering on society and the environment\" [", "\"Economics and project management\" [", "- Introduction to ECE190", "- Introduction to CFE and co-op Spare", "- Engineering profession", "- Working in teams  Spare Groups 1-40 attend in person", "- ECE190 groups meet and sign the Group Agreement Form", "- Engineering design process Groups 1-20 attend in person", "- Design activity Part 1 Groups 21-40 attend in person (group activity)", "- Design activity Part 1", "- Sustainability Groups 1-20 attend in person", "- Design activity Part 2 Groups 21-40 attend in person (group activity)", "- Design activity Part 2", "- Design-team traps Spare Spare", "- Professional development", "- Entrepreneurship Spare Spare", "- Measurement and", "Course materials on LEARN Must have a reliable internet connection.", "Textbook: \"Engineering Design:", "Textbook: \"Designing Engineers: An Introductory Text\", by Susan McCahan, Philip Anderson, Mark Kortschot, Peter E. Weiss, and Kimberly A. Woodhouse, 2015.", "Summary of marked components", "To increase lecture engagement, you should write down key points in your own words – I provide lecture summary sheets on LEARN that can be used for this purpose.", "The midterm test and final exam are closed-book, written individually, and consist of randomized multiple-choice questions based on the slide decks covered in the course lectures.", "Question format:  43 randomized multiple-choice questions", "Any reason for missing the midterm, other than those listed above, results in a score of zero on the midterm.", "Question format:  68 randomized multiple-choice questions", "Students who miss the final exam for one of these reasons will be eligible to write a deferred exam.", "Students who miss any final exam should contact the First-Year Engineering Office as soon as possible."]}, {"course_id": 3, "course_code": "ECE 198", "course_name": "ECE198 - Project Studio (0.25)", "term_name": "1A Term", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 198", "ECE 198 001", "08:30AM - 10:20AM E2 1792", "08:30AM - 09:20AM E7 5353", "10:30AM - 12:20PM E2 1792", "08:30AM - 10:20AM E2 1792", "08:30AM - 09:20AM", "The Course Instructor is responsible for overseeing the instructional design and coordinating the delivery of the course, including managing the Teaching Assistants.", "Amirhossein Akbarian", "Mohammadamin Hosseini", "Eric Yu", "sa7hosse@uwaterloo.ca", "View requirements for ECE 198", "The intention of this course is to provide students with an opportunity to apply engineering concepts in a small multidisciplinary design project to solve a specific problem.", "Apply critical thinking skills to specify, design, and verify an engineering solution.", "Quantify a series of specifications to define the project stakeholder’s design and performance requirements.", "Apply mathematical and scientific principles within quantitative technical analysis in order to design a solution that meets the specifications.", "Specify and demonstrate test methods to evaluate the design’s performance.", "Implement a prototype to test and verify the design.", "Develop and deploy basic software on a microcontroller, with the use of an Integrated Development Environment.", "Both partners must attend each meeting.", "It is highly recommended that students prepare to submit in advance of the deadline with enough time in advance just in case of unexpected submission difficulties.", "In addition, students may choose to make a submission that they know does not have a possibility of earning a perfect grade.", "It may be preferable to make a submission for partial grade than to incur a late penalty.", "It specifies key quantified requirements that the system is intended to fulfil.", "Design Document", "Implementation Demo", "The Implementation Demo is a live presentation and demonstration of the implementation of the system or a prototype of the system, designed by the project group.", "STM32 Nucleo development board https://wstore.uwaterloo.ca/ece-198-kit.html Yes", "STM32 Nucleo development board", "While for capital-intensive equipment such as lab instrumentation it makes sense to amortize the cost of the equipment across many students, in cases where materials are considered \"consumable\" or more individual in nature, it makes more sense for students to each own their own materials.", "In addition, this same development board will be used in the ECE 298 course in second year.", "At the end of term, be sure to retain your Nucleo-F401RE development board for future courses.", "Initial technical information about the Nucleo-F401RE board can be found here:", "The UW Engineering Society provides an electronics and components shop called RidgidWare in E7:", "4-core processor", "USB-A port", "If a project partner proceeds to make submission despite raised concerns, a complaint can be submitted to the Teaching Assistant, who will investigate.", "Style for References and Citations", "As a research tool it can be helpful in generating leads or avenues of research to investigate.", "As an editing tool, it can be helpful in exploring alternate ways to communicate that may be more effective.", "However, it can be easy to over-use this technology.", "There are some key risks to over-using AI.", "Second, you will not come to an understanding of the key purposes and functions of an engineering design process.", "These records must include details of the AI system used and details of the inputs submitted to the system.", "Some AI systems may have been trained on data sets without appropriate permission from the owners of the data.", "Verification"]}, {"course_id": 4, "course_code": "MATH 115", "course_name": "MATH115 - Linear Algebra for Engineering (0.50)", "term_name": "1A Term", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Linear Algebra for Engineering Fall 2024", "02:30PM - 03:20PM", "RCH 301", "RCH 301", "10:30AM - 11:20AM E7 5353", "02:30PM - 03:20PM", "E. Dupont", "03:30PM - 04:20PM E7 5343", "10:30AM - 12:20PM RCH 301", "10:30AM - 12:20PM", "PHY 313", "E. Dupont", "08:30AM - 09:20AM", "08:30AM - 10:20AM PHY 313", "08:30AM - 10:20AM RCH 309", "10:30AM - 11:20AM RCH 103", "11:30AM - 12:20PM RCH 103", "RCH 204", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "08:30AM - 10:20AM EV3 4412", "08:30AM - 10:20AM MC 4058", "02:30PM - 03:20PM", "09:30AM - 10:20AM RCH 302", "F. Al-Faisal", "10:30AM - 12:20PM MC 4063", "10:30AM - 12:20PM MC 4060", "10:30AM - 11:20AM RCH 110", "F. Al-Faisal", "03:30PM - 04:20PM", "02:30PM - 04:20PM MC 4060", "DWE 3522", "Tuesday -", "07:00PM - 08:50PM", "Linear equations, matrices, and determinants.", "Introduction to vector spaces.", "Eigenvalues and diagonalization.", "Present solutions to problems in a clear and logical manner with all steps being fully justified.", "Understand the basic operations of addition and scalar multiplication as they apply to vectors, matrices and linear transformations.", "Find the solution to a system of linear equations using matrices and elementary row operations.", "Understand matrix algebra and its connection to systems of equations.", "Have both a geometric and an algebraic understanding of span, linear independence, bases and subspaces.", "Recognize the link between matrices and linear transformations, and understand that many common geometric operations such as projections, reflections and rotations are linear transformations.", "Develop a basic algebraic and geometric understanding of complex numbers and complex polynomials.", "Determine the eigenvalues and eigenvectors of a matrix and diagonalize a matrix.", "1.1 Vectors in Rn", "1.2 Linear Combinations", "1.3 The Norm and the Dot Product", "1.4 Vector Equations of Lines and Planes", "1.5 The Cross Product in R3", "1.6 The Scalar Equation of Planes in R3", "1.7 Projections", "Chapter 2 Systems of Linear Equations", "2.1 Introduction and Terminology", "2.2 Solving Systems of Linear Equations", "2.3 Rank", "2.4 Homogeneous Systems of Linear Equations", "3.1 Matrix Algebra", "3.2 The Matrix-Vector Product", "3.3 The Matrix Equation Ax=b", "3.4 Matrix Multiplication", "3.5 Matrix Inverses", "4.1 Spanning Sets", "4.2 Geometry of Spanning Sets", "4.3 Linear Dependence and Linear Independence", "4.4 Subspaces of Rn", "4.5 Bases and Dimension", "4.6 Fundamental Subspaces of a Matrix", "Chapter 5 Linear Transformations", "5.1 Matrix Transformations and Linear Transformations", "5.2 Examples of Linear Transformations", "5.3 Operations on Linear Transformations", "5.4 Inverses of Linear Transformations", "5.5 The Kernel and the Range", "Chapter 6 Determinants", "6.1 Determinants and Invertibility", "6.2 Elementary Row and Column Operations", "6.3 Properties of Determinants", "7.1 Basic Operations", "7.2 Conjugate and Modulus", "7.3 Polar Form", "7.4 Complex Polynomials", "7.5 Complex nth Roots", "Chapter 8 Eigenvalues and Eigenvectors", "8.1 Introduction", "8.2 Computing Eigenvalues and Eigenvectors", "8.3 Eigenspaces", "8.4 Diagonalization", "8.5 Powers of Matrices", "Linear Algebra for Engineering Fall 2024 Course Notes Required text provided on LEARN Yes", "Linear Algebra with Applications by Keith Nicholson Optional text provided on LEARN No", "The Linear Algebra for Engineering Fall 2024 Course Notes is the required text for this course, and is available on LEARN.", "The text Linear Algebra with Applications is an optional text also available on LEARN for those students looking for an alternate exposition of the material and/or additional problems to work on.", "Students looking for extra practice beyond the course notes are welcome to attempt problems in the corresponding sections of the optional textbook.", "Python Assignments: Throughout the term, there will be 5 equally weighted assignments where students will use python to execute some prewritten code in an effort to explore some larger-scale applications of linear algebra.", "If you find yourself in a situation where you are missing multiple assessments, then you are advised to contact both your instructor and the First Year Engineering Office to make sure you have the proper supports in place to succeed in this courses.", "To be clear - such websites are not allowed to be used for the completion of any part of the course MATH 115, and students are not permitted to share questions from the course anywhere.", "Generative AI: This course includes the independent development and practice of specific skills, such as computations, problem solving and proof writing.", "Library for research-based assignments"]}, {"course_id": 5, "course_code": "MATH 117", "course_name": "MATH117 - Calculus 1 for Engineering (0.50)", "term_name": "1A Term", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Monday, Friday -", "11:30AM - 12:20PM E7 5353", "S. D'Alessio", "Friday -", "Friday", "04:30PM - 05:20PM E7 4053", "03:30PM - 04:20PM E7 5353", "Friday -", "Friday", "04:30PM - 05:20PM", "03:30PM - 04:20PM E7 5343", "02:30PM - 03:20PM", "08:30AM - 09:20AM", "S. D'Alessio", "09:30AM - 10:20AM STC 0060", "S. D'Alessio", "03:30PM - 04:20PM", "02:30PM - 04:20PM QNC 1506", "DWE 3522A", "DWE 3517", "08:30AM - 10:20AM DWE 1515", "08:30AM - 10:20AM DWE 3522A", "08:30AM - 10:20AM QNC 1506", "10:30AM - 12:20PM DWE 3522A", "10:30AM - 12:20PM MC 4058", "10:30AM -", "Functions of engineering importance; review of polynomial, exponential, and logarithmic functions; trigonometric functions and identities.", "Inverse functions (logarithmic and trigonometric).", "Limits and continuity.", "Applications of the derivative, max-min problems, Mean Value Theorem.", "Demonstrate skill in manipulating functions and performing calculations such as partial fraction decompositions and expressing piecewise defined functions in terms of Heaviside functions", "Read and use mathematical definitions", "Demonstrate skill in evaluation of limits, derivatives and integrals", "Use integration to calculate areas between and lengths of curves, find average values of functions, and calculating volumes of solids of revolution", "Sketch curves described in polar coordinates", "Use limits and derivatives to sketch graphs of functions or solve optimization problems", "Use integration to calculate areas enclosed by segments of curves in polar coordinates, and lengths of such curve segments", "Conic Sections", "Composition of Functions, Inverses and Symmetry", "Piecewise-Defined and Heaviside Functions", "Inequalities", "Partial Fractions", "Trigonometric, Hyperbolic and Inverse Trig Functions", "Sequences", "Limits and Proving Limits", "Continuity", "IVT/EVT", "Differentiation Rules, Implicit / Logarithmic Differentiation, Derivatives on Inverse Functions", "MVT, Constant/Increasing/Decreasing Functions", "Week 7: October 14 - 18 No classes and no tutorials   Thanksgiving & Reading Week", "Local/Global Extreme & Optimization Problems", "Curve Sketching", "The Definite Integral", "FTC1 & FTC2", "Indefinite Integrals", "Method of Substitution", "Integration by Parts (IBP)", "Areas between Curves, Average Values", "Trig Substitutions", "Integration of Rational Functions", "Arc Length, Surface Area and Volume of Revolution", "Improper Integrals", "Polar Coordinates, Areas and Arc Length in Polar Coordinates", "If working in a group, each group member must write and submit their own solutions in their own words.", "Exams", "Notice of Recording"]}]