[{"course_id": 11, "course_code": "BIOL 451", "course_name": "BIOL451 - Advanced Ecology and Evolution (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Advanced Ecology and Evolution Fall 2024", "04:00PM - 05:20PM B2 350", "Email: julie.messier@uwaterloo.ca", "Students will read and analyze scientific papers to deepen their understanding of core topics in ecology and evolution and how they are related.", "Deepen your understanding of some core ecological concepts (Ecological Niches, Plasticity, Trade-Offs, Competition, Community Assembly and Climate change), of their nuances, and of the links among these concepts.", "Understand how these concepts are studied in primary literature by reading and discussing scientific paper with peers.", "Recognize how individual scientific papers build knowledge in a field by identifying their key elements (Knowledge Gaps, Research Questions, Hypotheses, Experimental Designs and Main Results), synthesizing the papers individually and discussing them with peers.", "Reading Week - break", "Module2 Lecture – Lotka-Volterra competition model", "Paper reports", "Group paper reports: During class, small groups of 3 or 4 will discuss a subset of the questions in the paper reports and produce a consensus answer for the group.", "The average score  each student receives from their group-members for their contribution will be multiplied with the group score to produce each student’s individual score.", "In groups of 3 students will explore the relationships between climate change and a topic in Ecology and Evolution.", "Team-member evaluations: Using peerScholar, team members will evaluate each other’s contribution to each assessment, producing a score between 0 and 1.2.", "The average score each student receives from their team-members will be multiplied with the team score to produce each student’s individual score.", "The literature review will provide a list of closely related references with the main point of each paper, a first draft of the Research Questions and a first draft of the Thesis.", "2.3 Paper presentation", "Students choosing to attend class online instead of in-person without a valid excuse will earn half marks.", "You must contact me well ahead of time regarding important matters as I cannot guarantee to be able to reply in time for last-minute emergencies.", "All these constitute official announcements.", "Classroom Etiquette", "Science VIF information can be found here.", "Contingency plans for missed classes", "Alternative plans in case of illness", "Alternative plan", "Offenses include the following:", "Avoiding Academic Offenses", "All students are expected to know what constitutes an academic offense and thereby avoid committing them by doing the following:", "Resolution of Academic Offenses", "Instructors must notify the Associate Dean of the infraction in writing with all supporting evidence."]}, {"course_id": 13, "course_code": "CHEM 120", "course_name": "CHEM120 - General Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry 1 Winter 2025", "RCH 101", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "The second part of this course is concerned with explaining periodicity and trends in chemical reactivity in terms of the electronic structure of atoms and molecules.", "Topics covered in this part of the course include the quantum theory of the hydrogen atom; electron configurations in multi-electron atoms; ionic and covalent bonding; Lewis structures, valence shell electron repulsion theory and molecular geometry; quantum mechanical bonding theories, including valence bond theory and molecular orbital theory.", "Additional topics may include an introduction to electron-transfer reactions, including the assignment of oxidation states and the balancing of oxidation-reduction reactions.", "assess the greenness of a chemical reaction using Atom Economy and E-Factor metrics.", "describe the electronic structure of atoms in terms of quantum theory using atomic orbitals and quantum numbers.", "justify the organization of the periodic table and predict trends in the properties of the elements.", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and explain molecular shape and stability in terms of electron count.", "describe the interactions of molecules in solids, liquids, and gases to compare physical and reactive properties.", "Course Structure and Continuity Plans", "No extensions will be granted for Participation Challenges, but each student can drop one participation challenge from their overall grade.", "Printed spiral bound copies of the course notes can be purchased online from the UW bookstore https://wstore.uwaterloo.ca/", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare pandemic-related illnesses on Quest (Information at this link)", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 14, "course_code": "CHEM 120L", "course_name": "CHEM120L - General Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 1 Fall 2024", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Be sure to record their name and contact information in your lab manual.", "Skillfully perform basic procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "1,3,5,7,9,11", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Sept 19 - 24", "1,3,5,7,9,11", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "1,3,5,7,9,11", "- studying cis and trans isomers", "Oct 24-29", "1,3,5,7,9,11", "Titration as an Analysis Tool", "- identify an unknown solid acid", "1,3,5,7,9,11", "Introduction to Chromatography", "- quantify a cation using ion exchange", "1,3,5,7,9,11", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 15, "course_code": "CHEM 123", "course_name": "CHEM123 - General Chemistry 2 (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry 2 Winter 2025", "09:30AM - 10:20AM STC 1012", "Introduction to chemical equilibria.", "Describe the energy and entropy changes that accompany physical and chemical changes.", "Calculate the equilibrium constant for a reaction using the standard thermodynamic properties of reactants and products.", "Predict the direction of spontaneous change for a given set of initial conditions for a variety of chemical systems.", "Apply equilibrium principles to a variety of chemical reaction types including gas-phase reactions, acid-base reactions, precipitation reactions, complexation reactions and redox reactions.", "Analyze oxidation-reduction reactions and identify species being oxidized and reduced.", "Explain the basic construction of, uses of, and the differences between galvanic and electrolytic cells.", "CHEM 120 and CHEM 123 comprise a full-year course in introductory chemistry.", "Course Structure and Continuity Plans", "Chemistry Study Hall:  Starting the 2nd week of classes, there will be a first-year study hall on Tuesdays and Thursdays at 5:30 pm - 6:50 pm in STC 1012.", "You can attend as many Study Hall Sessions as you would like - grab your friends and connect with your TAs!", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 16, "course_code": "CHEM 123L", "course_name": "CHEM123L - General Chemistry Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 2 Winter 2025", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- a real life analysis", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 17, "course_code": "CHEM 266", "course_name": "CHEM266 - Basic Organic Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "11:30AM -", "Structure, nomenclature, and reactions of important classes of organic compounds.", "Stereochemistry and its role in reaction mechanisms.", "Name basic organic molecules", "Draw resonance structures and identify major and minor contributors", "Identify and describe the acidity and basicity of various molecules", "Draw organic molecules in three dimensions and identify the lowest and highest energy conformations", "Describe the stereochemical relationship between different molecules", "Explain chemical reactions using energy diagrams", "Understand the reactivity of a variety of molecules containing a variety of functional groups", "Molecular Modelling Kit No", "Notice of Recording"]}, {"course_id": 18, "course_code": "EARTH 121", "course_name": "EARTH121 - Introductory Earth Sciences (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Earth Sciences Fall 2024", "Students will learn to think like a geoscientist by adopting four ways of thinking that take into account a systems approach, a variety of spatial and temporal scales, and field thinking.", "Recognize the dynamic nature of Earth through an examination of the interactive components of the Rock Cycle.", "Extrapolate meaning from everyday geologic material and predict occurrence and origin.", "Week 1: Introduction and Four Ways of Thinking 1a and 1b Discussion: Introduce Yourself", "Week 2: Introduction to Rocks 2a Field Notes Journal 2: Are minerals important?", "Week 3: Introduction to the Rock Cycle 2b Field Notes Journal 3: What do you see in the video?", "Week 4: Introduction to the Rock Classification 2c Field Notes Journal 4: Is this depiction of the Rock Cycle complete and accurate?", "Week 5: Geologic Time and Geologic Time Scale 3a and 3b Field Notes Journal 5: How do I create a simplified Geologic Time Scale?", "Please note emails can be received 24 hours per day", "Short-term Absence", "Covid-19-related Absence", "Intellectual property includes items such as:"]}, {"course_id": 19, "course_code": "EARTH 121L", "course_name": "EARTH121L - Introductory Earth Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Earth Sciences Laboratory Fall 2024", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Email: keith.delaney@uwaterloo.ca", "Sahar Soltani - sahar.soltani@uwaterloo.ca / LABS 001 & 003", "By far, the majority of people qualified as geologists spend their time using their knowledge working 'in the field', or in exploration, putting principles learned in theory and in the laboratory, into practice.", "Identify common mineral and rocks based on their identification properties", "Understand the rock cycle and how minerals and rocks are formed", "Understand the theory of plate tectonics and how it has shaped the Earth's surface over time", "Qualitatively and Quantitatively describe earthquakes and some of their processes", "Read and interpret data from both topographic and geologic maps", "Understand the immense history and geologic record of our planet", "Understand the factors influencing climate change and quantify how the planet is changing", "Will assess Mineral and Rock Identification knowledge with real samples.", "Lab 8 Earth Structures", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "Situation where VIFs are not Appropriate"]}, {"course_id": 20, "course_code": "EARTH 122", "course_name": "EARTH122 - Introductory Environmental Sciences (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Environmental Sciences Winter 2025", "08:30AM - 09:50AM STC 1012", "I hold a PhD in Earth & Environmental Sciences from the University of Waterloo (2014) and an HBSc in Earth & Environmental Sciences from McMaster University (2006).", "You might notice I'm looking pretty pregnant!", "I'm conveniently due on April 27 BUT in the unlikely even that I have a baby really early, the excellent Dr. Keith Delaney (who has taught this class for many years) will step in at the end.", "Discussions", "Questions of a personal nature", "Office: EIT 2051D (very back of Earth & Environmental Sciences main office)", "Email: msrosamo@uwaterloo.ca", "Grad TA contact info can be found in the EARTH 122L syllabus.", "Course topics include sustainable development and the availability and use of natural resources, principles of ecology and environmental science, biogeochemical cycles, climate and climate change, soils and food supply, energy systems, surface water and groundwater, waste generation and management, pollution, and catastrophic natural processes.", "Describe common global environmental issues and the role of environmental science in identifying, understanding, and solving these issues.", "Interpret and manipulate simple box models of environmental systems", "Interpret scientific diagrams and graphs pertaining to environmental science", "1 January 06 - 10 Intro to Environmental Science & Matter, Energy and Physical Environment Chps 1 & 2", "2 January 13 - 17 Earth Systems/Ecosystems & Evolution, Biodiversity, Population Ecology Chps 3 & 4", "3 January 20 - 24 Species Interactions/Community Ecology & Human Population Chps 5 & 6", "Soils & Soil Resources*", "8 February 24 - 28 Freshwater Systems/Water Resources & Marine, Coastal Systems, Fisheries Chps 11 & 12 Quiz 6 - Chapters 11 & 12 Content Mon. Mar 3  5:00PM 3", "10 March 10 - 14 Global Climate Change & Fossil Fuels: Energy Use/Impacts Chps 14 & 15", "Energy Alternatives & Mineral Resources & Mining", "Quiz 8 - Chapters 15 & 16 & 17 Content*", "12 March 24 - 28 Managing our Waste & Environmental Health Hazards Chps 18 & 19 Quiz 9 - Chapters 18 & 19 Content Mon. Mar 31 5:00PM 3", "A Look at Environmental Science and Natural Hazards & Final Exam Study Guide / Discussion", "following these guidelines: https://uwaterloo.ca/science-undergraduate-office/academic-policies-and-procedures/accommodation-illness-or-other-extenuating-circumstances."]}, {"course_id": 21, "course_code": "EARTH 122L", "course_name": "EARTH122L - Introductory Environmental Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introductory Environmental Sciences Laboratory Winter 2025", "EARTH 122L", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Sana Ahmad has a BSc degree in Honours Co-op Environmental Science with a Geoscience Specialization from the University of Waterloo.", "Discussions", "Questions of a personal nature", "Office: EIT 2046 (within the Earth & Environmental Sciences main office)", "Email: s76ahmad@uwaterloo.ca", "Please put EARTH 122L in your email subject line so I don't miss it!", "Please do not send them personal emails!", "View requirements for EARTH 122L", "Use GPS devices and GIS software to locate points of interest and create a map", "ALL LABS ARE HELD IN ROOM: EIT 1013 (ground floor of EIT  - same building as Earth Sciences Museum)", "8 February 24 - 28 Coastal Processes and Problems: Loving Our Coasts to Death?", "10 March 10 - 14 On-Campus Water Sampling and GPS Data Collection Field Sampling and Data Collection Lab around UW Campus", "13 March 31 - April 03 Landscape Geology: Glaciers and Deserts & Climate Change: Pleistocene Records, Milankovitch Cycles Lab 8: Landscape Geology and Climate Change End of Lab 7%", "Note used copies are also fine!", "The format of the final exam will be run digitally through the LEARN Quiz system in the last week of the course, not during the formal exam period.", "Notice of Recording", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "These can be completed digitally now!", "This official verification is necessary before any action can be taken and can be downloaded from the Health Services website.", "Situation where VIFs are not Appropriate", "Example citations:", "\"References"]}, {"course_id": 22, "course_code": "EARTH 123", "course_name": "EARTH123 - Introductory Hydrology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Dr. Rosamond is the International Lecturer for Water Sciences in the Department of Earth & Environmental Sciences at the University of Waterloo.", "She loves learning about water, especially nutrients and greenhouse gases in streams in rivers.", "Email: msrosamo@uwaterloo.ca", "Education", "2014 - PhD, Earth & Environmental Sciences, University of Waterloo, Waterloo, ON, Canada", "2006 - Honours BSc, Earth & Environmental Science (Sedimentology Specialization), McMaster University, Hamilton ON, Canada", "Philosophy of Teaching", "Dr. Rosamond's teaching philosophy focuses on (a) active learning techniques, including field and laboratory experience, and practical demonstrations in class, (b) building on the mathematical and chemical fundamentals in Earth Sciences.", "She is interested in adapting curricula to include experiential learning, focus on students' analytical skills, and to scaffold skills and concepts across courses in Earth & Environmental Sciences.", "Yizhi is a graduate student in Earth & Environmental Sciences at University of Waterloo, looking at groundwater contamination.", "Email: y278yuan@uwaterloo.ca", "The material is both qualitative and quantitative in nature and focuses on the circulation of water through the atmosphere, soil, groundwater aquifers, as well as looking at both the global fresh and marine water systems.", "Emphasis is placed on the physical aspects of hydrology, and the geologic and environmental factors that control the occurrence and cycling of water on Earth, as well as the impacts caused by population growth, contamination, urbanization or land use management, and climate change.", "View requirements for EARTH 123", "Describe the complexity and inter-connections of the global hydrological cycle;", "Apply basic qualitative techniques for describing earth systems processes related to water and water movements;", "Create and critique a simple water balance equation for a lake, river, or groundwater system;", "Introduce Yourself &", "All times are in China Standard Time.", "December", "Can be purchased through e-book sellers.", "These are a mix of multiple choice, matching, and mathematical questions.", "Surveys", "Discussions", "Notice of Recording", "We will assess what to do on a case-by-case basis."]}, {"course_id": 23, "course_code": "EARTH 223", "course_name": "EARTH223 - Field Methods in Hydrology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrology Fall 2024", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "This course consists of field exercises and lectures designed to provide students with practical hands-on experience conducting a variety of hydrological monitoring techniques.", "This course is designed to provide hands-on field experience in the use of standard hydrologic monitoring techniques.", "The main objectives of this course are to use a variety of hydrologic data collection techniques in practical settings to answer hydrologic questions, identify the difficulty and importance of collecting good field data, and determine the accuracy/error of different measurement methods quantitatively and qualitatively.", "A Module will consist of two elements: (1) an activity in the field and (2) lecture and tutorial to review the fundamental concepts and discuss the data collected in the field.", "During each activity you will be working in groups of ~4.", "Assessment for each Module will consist of a pre-activity quiz administered on LEARN and an assignment that must be completed individually and uploaded to LEARN.", "Interpret the data in a hydrological context to explain groundwater/surface-water interactions, quantify water balances, and understand sources of contaminants found in water.", "Explain how drinking water in the Region of Waterloo is obtained, managed, and treated to ensure a safe and adequate supply.", "A Module will consist of two elements: (1) an activity in the field and (2) lecture and tutorial to review the fundamental concepts and discuss the data collected in the field.", "During each activity you will be working in groups of ~4.", "Assessment for each Module will consist of a pre-activity quiz administered on LEARN and an assignment that must be completed individually and uploaded to LEARN.", "Field Class Field Class Field Class Field Class", "Introduction (complete online)", "Sept 23**", "Sept 23**", "Sept 25**", "Sept 25**", "Oct 14**", "Oct 14**", "Oct 16**", "Oct 16**", "Oct 28**", "Oct 28**", "Oct 30**", "Oct 30**", "-", "Nov 25**", "-", "Nov 25**", "-", "-", "* complete virtually on your own", "***If possible", "These videos are designed to prepare you for the upcoming field activity and must be completed prior to the scheduled field activity time.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Must be uploaded as a single file", "Notice of Recording", "The field work is a critical part of this course and often you will be working in teams and so your lack of attendance may also result in some hardship for your group.", "You must be present for each field activity in order to get full credit for that activity  – unexcused absences will result in a 20% penalty for each missed field activity.", "For this reason, all students must complete WHMIS (Workplace Hazardous Materials Information System training) module before their first field activity session and provide proof of their training by uploading a picture of their form to DROPBOX.", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline).", "The policy can be found at: http://www.adm.uwaterloo.ca/infosec/Policies/policy33.htm", "Note on Avoidance of Academic Offences: Studying and working in groups to learn material can be a very valuable practice and is encouraged.", "Library for research-based assignments", "Strategies for learning online", "6 strategies for effective learning"]}, {"course_id": 24, "course_code": "EARTH 342", "course_name": "EARTH342 - Geomorphology and GIS Applications (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Geomorphology and GIS Applications Fall 2024", "changcheng.li@uwaterloo.ca", "04:00PM - 05:20PM", "changcheng.li@uwaterloo.ca", "Characteristics and development of various landforms (e.g. mountain belts, volcanoes, impact craters, and those created by erosion/deposition of rivers/glaciers) are introduced.", "Application of Geographic Information Systems (GIS) to Earth Sciences.", "Basic concepts of GIS and GIS applications in mineral exploration industry and in fieldwork are introduced.", "View requirements for EARTH 342", "Introduction to Geomorphology", "Various landforms and their development processes", "Introduction to ArcGIS", "Vector data model and raster data model", "Map projection and coordinate system", "Data input", "Basic applications of ArcGIS in mineral exploration and mining industry", "Spatial data analysis", "Interpretation of satellite image and air photos", "Introduction to ArcGIS", "GIS for Assessment report for a mineral exploration company", "Make a geological map", "Enhance contrast in colour between different rock units in Landsat satellite images", "One example of natural hazard assessment using spatial data analysis in ArcGIS", "Input and organize geographic data in ArcGIS and present them using maps", "Prepare base maps needed for geological field mapping", "Set up a web map for digital mapping in a group and collect data using mobile devices", "Make a geological map in ArcGIS based on field mapping data and interpretations", "Make drill hole location maps for assessment reports for a mineral exploration company", "Carry out basic spatial analysis to assess a natural hazard in a given scientific model and make maps to present spatial analysis results", "Examination regulations as outlined in the current UW undergraduate calendar are to be followed.", "In this course, the following will be considered as academic misconduct and unacceptable:", "Re-creating exam questions and answers without the express permission of the course instructor"]}, {"course_id": 25, "course_code": "ERS 215", "course_name": "ERS215 - Environmental and Sustainability Assessment 1 (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Environmental and Sustainability Assessment 1 Winter 2025", "Instructor: Felicitas Egunyu felicitas.egunyu@uwaterloo.ca", "An introduction to processes and techniques for incorporating environmental considerations in planning and evaluating proposals for future undertakings that may have significant social and biophysical effects.", "The course provides an overview of methodologies for, and controversies surrounding, the design and conduct of biophysical and socioeconomic impact studies, and the testing of reported findings.", "View requirements for ERS 215", "Key topics and themes will be elaborated on through videos and by regular attention to case studies.", "Assigned readings throughout the semester are critical for providing additional depth and breadth.", "Group reading discussion and assignments provide an opportunity for integrating key topics and themes, as well as for linking them with the broader scholarly literature on environmental assessment.", "From this course you will develop a key understanding of what an EA should be and therefore, you can apply this knowledge and understanding to any assessment act.", "Define the aims and objectives of environmental/impact assessments, as well as key terms and concepts in EA/IA", "Identify the roles and relevance of EA/IA as a potential venue that can contribute to sustainability", "Describe the different steps and components of an EA/IA process in Canada", "Apply EA/IA principles for best practices to case studies and critically analyze the strengths and weaknesses of environmental assessment", "Introduction to Environmental Impact Assessment: A Guide to Principles and Practice, 4th Edition.", "Introduction to Environmental Impact Assessment: A Guide to Principles and Practice, 4th Edition.", "Introduction to Environmental Impact Assessment: A Guide to Principles and Practice, 4th Edition.", "(Similar to A and A+ in the previous system)", "(Similar to B+ and A- in the previous system)", "(Similar to B- and B in the previous system)", "(Similar to D-, D and D+ in the previous system)", "(Similar to F and F+ in the previous system)", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 26, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 27, "course_code": "PHYS 111", "course_name": "PHYS111 - Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["An introduction to physics for students intending to concentrate their further studies in biology, dentistry, medicine and paramedicine; includes particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.", "The main physics principles and laws covered in PHYS 111 include: “Particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.”", "PHYS 111 focuses on basic physics principles and laws, on conceptual understanding and problem-solving skills, and an appreciation for the power of physics in explaining how nature works, in the contexts of both the physical and life sciences.", "Physics Principles and Laws: By the end of the course, students will be able to construct scientifically sound explanations of a variety of basic physical phenomena by applying basic physics principles/laws.", "define linear momentum, and calculate and compare momenta of various real-life objects;", "define and calculate impulse, and establish the conditions for conservation of linear momentum; and", "apply the laws of conservation of momentum and energy to collisions.", "Problem-Solving Skills and Strategies: By the end of the course, students will be able to creatively apply a variety of structured problem-solving strategies:", "interpret, visualize and convert the problem into a physical model (e.g., draw a free body diagram);", "evaluate the result — does it make sense?", "These problem-solving skills are useful in the students’ own disciplines and beyond.", "More detailed information about the course elements which contribute to the final grade will be given in the learn sight and in future outline updates", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 28, "course_code": "STAT 202", "course_name": "STAT202 - Introductory Statistics for Scientists (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Statistics for Scientists Winter 2025", "R. Metzger", "R. Metzger", "jenny.tieu@uwaterloo.ca", "02:30PM - 03:20PM", "jenny.tieu@uwaterloo.ca", "R. Metzger", "02:30PM - 03:20PM", "PHY 313", "jenny.tieu@uwaterloo.ca", "R. Metzger", "Methods for data summary and presentation.", "Estimation, hypothesis testing, two-sample techniques and paired comparisons, regression, correlation.", "Evaluate the strengths and weaknesses of a simple sampling technique.", "Given a set of data:", "Build a simple linear model for a dataset.", "Perform simple statistical test to determine whether:", "A population mean and proportion differs from a particular value.", "A simple linear regression model parameter is significant.", "Probability Functions (PF) and Cumulative Distribution Functions (CDF):", "Differentiate between a Binomial and Poisson experiment.", "Define simple sample spaces and calculate simple probabilities.", "Calculate the sample mean and sample variance of a linear combination.", "Linear Relationships (Covariance and Correlation), Time Series, Scatterplots, Linear Regression", "Instructor(s) will go over a problem set.", "Regression analysis", "Sample design", "Poisson Distribution, Normal Distribution", "Instructor(s) will go over a problem set.", "Inference", "Instructor(s) will go over a problem set.", "Inference", "Inference", "- location TBD", "≥50", "No considerations are given for individual technical issues.", "This is a cumulative test that will cover the entire course.", "Late Tests will be given a zero mark.", "Note for your circumstance to be deemed valid you must have been incapacitated for a significant portion of the assessment window.", "A circumstance that incapacitates a student for a month or longer is unlikely to be accommodated – in such a case we ask that you please speak to your academic advisor and consider dropping the course.", "In the past some of the issues below have cropped up in my courses:", "Make sure you start online quizzes early, hand in assignments early, etc in case of unforeseen technical issues!", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 29, "course_code": "BIOL 150", "course_name": "BIOL150 - Organismal and Evolutionary Ecology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Organismal and Evolutionary Ecology Fall 2023", "11:30AM - 12:20PM RCH 101", "Learn Discussion Board", "Email and Appointment Requests", "Coverage includes hypothesis testing and the nature of scientific inquiry, basic population genetics, physiological ecology, life histories, dispersal, basic population and community ecology, macroevolution, systematics and classification, as well as functional morphology.", "The theory of evolution unites the whole of biology and all living organisms into a coherent body of knowledge, allowing comparisons across all forms of life.", "Ecology describes how organisms interact with their environment and each other to create interdependent systems from microscopic to global scales.", "These disciplines are fundamentally tied together: evolution is the primary mechanism by which species adapt to their environment; ecological interactions and environmental variability drive natural selection.", "You will also carry out simulated lab assignments to test the principles of evolution, design ecological experiments to test alternate hypotheses about the conservation of species and manipulate demographic parameters to test their influence on population growth.", "Understand the principles of scientific methodology", "Define ecological and evolutionary terms, such as the niche, adaptation, and altruism", "Illustrate these mechanisms in the context of course examples", "Explain how ecological interactions and evolution are interconnected", "Sign code of conduct and upload to LEARN.", "2) Sept 8 Evolution for Ecology Section 1: Evolution and Ecology are Intertwined", "4) Sept 13 Evolution for Ecology", "5) Sept 15 Evolution for Ecology Section 3: Genetics and Evolution", "6) Sept 18 Evolution for Ecology Section 4: Managing the Evolution of Resistance", "9) Sep 25 Physiological Ecology Section 1: Trade-offs and Species Distributions", "15) Oct 9-13 Holiday – No classes Understanding Experimental Design Simulation due by Oct 16, 11:59 pm", "16) Oct 16 Empiricism in Ecology Understanding Experimental Design Simulation due by 11:59 pm (best 2/3 for 10%)", "It is important that you review the information below before you subscribe to the SimUText for Organismal Ecology and Evolution - Chapters at University of Waterloo.", "SimUText Application Installers", "SimUText Application Installers", "At the end of every unit, you will work individually to develop a concept map using Cmap Cloud to visually display the relationships among what you consider the key concepts in the unit.", "These should represent your personal comprehension of how the concepts relate to each other, and no two should be identical.", "Also, class will entail a lot of discussion that won’t be represented in PPT slides.", "The simulations include one on Evolution in Ecology, one on Experimental Design in Ecology and one on Population Growth.", "The learning outcome for the unit tests is to demonstrate your recall and comprehension of the material covered in the units and to incentivize keeping up with the readings and attending lectures and reviewing for the final exam.", "The learning outcome is to demonstrate recall, synthesis and integration of material learned during the course.", "The final exam will consist of multiple-choice, T/F, solve the equation type of questions and integration questions that are designed to test your basic and deeper understanding of the course concepts.", "Important note regarding tests and exams", "Unit tests will be completed for the first 4 units of the course.", "Ensure you have a reliable internet connection and functional computer to complete them – technical challenges encountered during remote completion are not an excuse for missed tests.", "I will have a limited number of printed back-ups for students in class who experience technical difficulties.", "You will need to have a reliable internet connection and functional computer to complete the exams.", "Emails can be received 24 hours per day.", "If you miss a make-up exam for any reason, you will be given a DNW, and must petition the Associate Dean of Science if you feel you missed it for a valid reason.", "At the discretion of the instructor, you may be permitted to write a make-up exam.", "The timing will be conveyed to you via e-mail if you are eligible for a make-up.", "If you follow these steps,", "I will consider granting an extension", "Students are responsible for their own behavior and should be mindful of the impact that their actions have on the wellbeing of others.", "Act in a respectful and open manner when listening to the views and ideas of others.", "Participate fully in the discussion boards: make sure your answers are to the best of your ability and that you respond to others’ posts.", "Signature"]}, {"course_id": 30, "course_code": "BIOL 251", "course_name": "BIOL251 - Fundamentals of Ecology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM B2 151", "02:30PM - 05:20PM B2 151", "Mike Allen", "Email: mike.allen@uwaterloo.ca", "Email: brwolff@uwaterloo.ca", "Claire Schon", "Email: d4andradepereira@uwaterloo.ca", "This course provides students with an introduction to the breadth of the ecology discipline, including laboratory and field components.", "It covers hypothesis testing and the nature of scientific inquiry, organismal, population, community, and ecosystem levels of ecology.", "Lab 2: Prepare test populations of bean beetles to use in a population estimation exercise; set up a capture/mark/recapture experiment using the Lincoln-Peterson Method; examine the results of the experiment using basic statistics to determine the reliability of the Lincoln-Peterson Method under these conditions; prepare a short report conveying the results, along with comments on the experimental design etc.", "Lab 4: Understand the life history of goldenrod, gall flies and their predators; be able to dissect galls and identify larvae using a dichotomous key; collect gall/larval data and hypothesize about any interactions between the species involved.", "12 Nov 18-22 Eutrophication Analysis"]}, {"course_id": 32, "course_code": "BIOL 458", "course_name": "BIOL458 - Quantitative Ecology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Quantitative Ecology Fall 2022", "04:00PM - 05:20PM", "04:00PM - 05:20PM", "Email:  owoody@uwaterloo.ca", "The course addresses the integration of mathematical and statistical tools to solve problems in ecology, using examples from individual, population, community, and ecosystem scales.", "Select appropriate data for testing hypotheses", "Analyze simple ecological models", "Compare model predictions and data", "Dyer, R.J. 2009: Biological Data Analysis Using R on Learn No", "Lander, J.P. 2014: R for everyone: advanced analytics and graphics (2nd edition) No", "The midterm is an assessment of your ability to identify and explain concepts and theories in ecology, as well as formulate and analyze statistical and mathematical models.", "The final report will be used to assess your ability to identify and explain relevant concepts and theories in ecology, as well as formulate and analyze statistical and mathematical models using the R programming environment."]}, {"course_id": 33, "course_code": "CHEM 233", "course_name": "CHEM233 - Fundamentals of Biochemistry (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Evgeniy Panzhinskiy", "Additional office hours can be booked in person or online upon request", "The fundamental chemical and physical properties of amino acids, nucleic acids, carbohydrates and lipids are then discussed in detail.", "The organization of these building blocks into more complex structures such as proteins, enzymes, polynucleotides, polysaccharides, and biological membranes will be described.", "The structure and function of representative proteins such as myoglobin and hemoglobin and enzymes such as chymotrypsin will also be discussed.", "Applications and importance of the above to real world situations will be provided.", "Develop an understanding of the importance of aqueous solutions in biochemical processes.", "Understand the basic thermodynamic principles that govern the chemistry of biological processes in both qualitative and quantitative examples", "Calculate a charge of amino acids and proteins as a function of pH", "Analyze the kinetic properties using the Michaelis-Menten model of enzyme kinetics", "Draw the organic mechanisms for representative enzyme catalyzed reactions", "Unerstand simple carbohydrate chemistry and some representative glycoprotein and glycolipid structures as well as their functions", "Illustrate chemical basis of nucleotide pairing and identify different structural forms of DNA and RNA", "Predict the flow of information from DNA to RNA", "Compare the structure and physical properties of lipids and fatty acids, and understand their role in the formation of membrane bilayers", "Take all the information learned this term and develop a deeper understanding of the chemical processes that lead to life as we know it", "Suggested supplementary reading in \"Biochemistry Free for All\" (BFA)", "VVP Chapter 1.3 Thermodynamics", "BFA: Introduction: Basic Chemistry, pages 25-31", "BFA: Introduction: Water and Buffers, pages 34-49", "VVP chapter 3 Amino Acids and Polypeptides", "VVP Chapters 4.1 - 4.3 Secondary, Tertiary and Quaternary Structure", "BFA: Protein Structure: pages 74-108", "VVP Appendix A.1 and A.2", "BFA: Basic Techniques: pages 857-870, 894-895", "Week 6: Protein folding and Introduction to hemoglobin", "VVP Chapter 4.4 Protein Folding and Unfolding", "Week 8: Enzyme Kinetics", "BFA Catalysis Basic Principles: pages 337-380", "BFA Mechanisms: pages 381-395", "BFA Structure and Function of Carbohydrates: pages 190-217", "BFA Structure and Function of Nucleic Acids: pages 167-189", "BFA Structure and Function of Lipids: pages 222-233; Membranes: pages 269-336", "A virtual textbook can be found at https://bio.libretexts.org/Bookshelves/Biochemistry/Fundamentals_of_Biochemistry_(Jakubowski_and_Flatt)", "Notice of Recording", "Emails can be received 24 hours per day.", "This official verification is necessary before any action can be taken.", "Students should carefully consider the wisdom of missing a test or an exam.", "Expectation of Academic Integrity", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 34, "course_code": "CHEM 237", "course_name": "CHEM237 - Introductory Biochemistry (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:20AM", "RCH 101", "10:30AM - 11:20AM RCH 101", "ESC 227", "Structure and properties of proteins and enzymes.", "develop a molecular level understanding of biological processes to achieve this the following learning outcomes will be", "in both qualitative and quantitative examples", "evaluate unknown thermodynamic parameters from given values of others.", "I equilibrium constants from standard free energy changes.", "qualitatively describe the composition of solutions of a weak acid or base as a function of pH.", "calculate the precise", "recognize the 20 amino acids that are commonly found in proteins and identify compounds derived from them", "calculate the charge on an amino acid side chain as a function of pH", "know the 4 levels of protein structure and the covalent and non covalent interactions that stabilize them", "explain how to purify proteins using the physical and chemical properties of the proteins", "determine the primary sequence of a protein given the appropriate data", "understand basic chemical kinetics and the application to biological systems", "determine the mechanism of inhibition of an enzyme using", "the structure of fatty acids and membrane lipids", "the structures of cell membranes and how the fatty acid composition of those membranes affects membrane structure and fluidity", "the structure of simple sugars and polysaccharides and the chemistry of the reactions in which they participate", "Suggested supplementary reading in \"Biochemistry Free for All\".", "Biochemistry free for all: Introduction Water and Buffers, pages 34-49", "VVP chapters 3 and 4.1", "Biochemistry free for all pages 53-70", "Appendix A.1 and A.2", "Chapter 4.2 and 4.3", "Biochemistry free for all.", "pp 74-108", "Week 6  Protein folding and Introduction to hemoglobin", "Chapter 4 - Biochemistry in focus", "Biochemistry free for all pages 128-141", "first kinetics Chapter 10 then mechanisms Chapter 9", "Biochemistry free for all pages 337-362", "Biochemistry free for all pp 190-217", "Biochemistry free for all pp 222-233", "Biochemistry free for all pp 287 - 312", "Notice of Recording"]}, {"course_id": 36, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 37, "course_code": "BIOL 211", "course_name": "BIOL211 - Introductory Vertebrate Zoology (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["10:30AM - 11:20AM M3 1006", "An introduction to the structure, evolution, and development of vertebrate organ systems, explored through lectures and laboratory exercises.", "Understand the diversity of vertebrates that exist in the world", "Know some of the anatomy, physiology, reproductive strategies, behaviour and ecology of vertebrates", "Be familiar with the basic techniques of dissection through laboratory sessions", "Introduction to vertebrate zoology", "Bony fishes", "Adaptations of synapsids & sauropsids", "Turtles", "Tuatara, lizards & snakes", "Bird origins & adaptations", "Lab Manual Introduction to Vertebrate Zoology Available at bookstore Yes 28", "Call number UWD 1528"]}, {"course_id": 38, "course_code": "BIOL 241", "course_name": "BIOL241 - Introduction to Applied Microbiology (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introduction to Applied Microbiology Winter 2025", "RCH 101", "Course Lecturer: Dr. Kesen Ma; kma@uwaterloo.ca; office hours & virtual meetings (Zoom) by appointment only", "Laboratory Instructor: Dr. Cheryl Duxbury; cduxbury@uwaterloo.ca; office hours & virtual meetings (Microsoft Teams) by appointment only", "Introduction to microbial ecology, environmental microbiology, food microbiology, and medical microbiology explored through lectures and laboratory exercises.", "Topics in environmental microbiology include biogeochemical cycling and biological treatment of wastes and pollutants.", "Topics in medical microbiology include concepts of immunology and host-pathogen relationships.", "microbial ecology", "bacteria-bacteriophage interactions", "biodegradation and bioremediation • sewage treatment", "industrial microbiology", "host-parasite relationships - factors in microbial pathogenicity, innate barriers in the host", "immunology - innate, adaptive", "immunization; immune response diseases", "Extend Biol 240 and cover topics such as the diversity of microbial metabolism and habitat, the importance of microbes in nutrient cycling, biological treatment of pollution, use of microorganisms for the production of food, pharmaceuticals, and the role of microbes in human disease.", "Know the importance of microbes to life as we know it, and the applications of useful microbial characteristics.", "Enhance understanding of the roles that microbes play in the natural world .", "Learn more skills in aseptic laboratory techniques and know how to conduct some classical microbial testing of food, water, and soil.", "Lecture topics and relevant textbook chapters", "2021 & 2017.", "Microbial Ecology", "2. Bacteria-Bacteriophage Interactions", "Terrestrial & Aquatic Environments", "5. Biodegradation & Bioremediation", "Food & Industrial Microbiology", "(spoilage & preservation", "food & industrial processes)", "Immunology", "(innate, adaptive immunity,immunization & immune response diseases)", "Infectious Disease", "*note: this is the same textbook as used in BIOL 240 & BIOL 240L. The new 3rd edition of the book can be accessed via a subscription through Wiley ($57 for 150-day subscription, $134.95 for a lifetime subscription:", "This manual cannot be ordered online and must be purchased in person prior to your first lab.", "Both exams will be in a multiple-choice format (e.g., multiple choice, true/false, matching questions, fill in the gap).", "Notice of Recording", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Allowed", "Allowing under certain conditions", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 39, "course_code": "BIOL 310", "course_name": "BIOL310 - Invertebrate Zoology (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Invertebrate Zoology Fall 2024", "02:30PM - 05:20PM B2 150", "09:30AM -", "In the design of the course, I try to promote understanding of concepts of Invertebrate Zoology over simply memorizing terminology.", "I aim to provide a framework for you to see the importance of these animals in the functioning of global biodiversity - including in the human experience.", "I have every intention to try and be as flexible as I can with deadlines.", "I acknowledge you may be struggling and many of you feel dissociated from your professors and colleagues.", "I will tell stories and bad jokes and make space for accommodations.", "The first in person lab will run the week of Sept. 9.", "Missing multiple labs, where there is no option to join another section, will require a grade of INC to be submitted and the lab to be made up in Fall 2025.", "Identify key characteristics of a diversity of invertebrate taxa.", "Contrast the strategies used by invertebrates to carry-out the processes fundamental to life.", "Introduction", "Body Plans…", "Evolutionary Processes", "Feeding Methods", "Deposit Feeding", "Swimming", "Muscular creeping / crawling", "Midterm typically covers to this point", "Respiration & Circulation", "Terrestrial air-breathers", "Excretion & Osmoregulation", "Osmoregulation basics", "Excretory organs", "Reproduction & Development", "Defense & Behaviour", "Eusociality and Parasitism", "Insects 1 :Early fliers & Orthopteroid orders   Sept. 9", "Final Collection ID & Submission  Nov. 18", "Pre-lab 1 Assignment (due before first field lab) 3%", "Midterm is online & open book and all students will be provided 150 minutes to write the test, in accordance for Universal Design for Learning.", "IDing specimens with keys is an objective of this course and so a considerable portion of your mark will be determined from this assignment.", "This is a bonus mark that can be earned by either:", "a. Participating in a broader research project by completing BOTH", "b. Completing a short (250 word) summary of BIOL 310 core concepts at the end of term (dropbox to open in final week of classes).", "Note: Students may earn a \"bonus\" mark for participating in this research by completing the start and end of term surveys.", "This is a general rubric and specific details will be added in LEARN.", "It is a product of the student’s own thoughts/words/effort, unless group work is explicitly a part of the assignment.", "referencing the same source repeatedly can be formally described in the text a single time, rather than citing the same source after every sentence.", "Care & Effort", "There is a clear indication that effort has been taken to produce a submission that is free of major grammatical/spelling errors – scientific and taxonomic terms are spelled correctly and capitalized/italicized where necessary.", "Some errors may be present but these do not detract from the general flow and readability of the product.", "Submission & Length", "For concept map include the specific taxa or topics outlined in the lab instructions for each week.", "It is a product of the student’s own thoughts/words/effort.", "Major structures should be named, but exhaustive details and minor structures should be avoided here in effort to make the map concise.", "Do not list every detail in the text.", "The concept map creates a hierarchy of the materials (rather than a linear path) in order to provide insight into how animals in this taxon are similar/distinct from one another, and to animals outside this taxon.", "Connectedness of concepts show careful forethought and planning, rather than simply moving through the text, one item at a time.", "The organization of the concept map does not present material in a way that allows the student to build connections with multiple characteristics of these and other animals.", "Submission & Length", "Multiple maps should not be created for each units.", "Example Description: You may be asked to create a slide presentation that is directed at the first year Introductory Zoology class audience.", "Describe in your presentation the general placement of this taxon in the greater phylogeny of animals, the habitats where these animals are found, and methods of feeding, movement, respiration, excretion and reproduction should be presented (at an introductory level).", "It is a product of the student’s own thoughts/words/effort.", "referencing the same source repeatedly can be formally described in the text a single time, rather than citing the same source after every sentence.", "There is a clear indication that effort has been taken to produce a submission that is free of major grammatical/spelling errors – scientific and taxonomic terms are spelled correctly and capitalized/italicized where necessary.", "Some errors may be present but these do not detract from the general flow and readability of the product.", "No attempt to include relevant images to illustrate concepts.", "Audience", "Material is presented at a level appropriate for a first-year course.", "Material is presented at a level too advanced for a 1st year course.", "Submission & Length", "Notice of Recording", "In the case of an unwritten final exam, your course mark will be entered as DNW (32% for calculation of overall average)."]}, {"course_id": 43, "course_code": "BIOL 335L", "course_name": "BIOL335L - Molecular Biology Techniques (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Molecular Biology Techniques Winter 2025", "11:30AM - 12:20PM QNC 1506", "cheryl.duxbury@uwaterloo.ca", "STC 3019", "cheryl.duxbury@uwaterloo.ca", "STC 3019", "cheryl.duxbury@uwaterloo.ca", "Email – ljlemieux@uwaterloo.ca", "Email – cduxbury@uwaterloo.ca", "Selected experiments to provide students with a range of laboratory skills in recombinant DNA technology.", "Perform, troubleshoot and know theory of preparation, quantification, restriction analysis, cloning, transformation and pcr of DNA samples.", "2. Perform, troubleshoot and know theory of RNA preparation, analysis and detection via hybridization.", "3. Perform, troubleshoot and know theory of protein quantification, SDS-PAGE analysis and Western blotting analysis.", "Use CRISPR to genetically modify the chromosomal DNA of yeast.", "1 Jan 6-10  Lab skills: Exercise 1: Equipment use, Exercise 2: Preparation of solutions, Exercise 3: Preparation and Maintenance of Microbial cultures, and Exercise 4: Dilution series of both Fast Green and yeast cultures IN LAB MICROPIPETTING PRACTICAL", "2 Jan 13-17  Manipulating DNA: Exercise 1: Isolation of Genomic DNA from Calf Liver and Exercise 2: Restriction Enzyme Analysis of Lambda DNA, and Exercise 3: Preparing and running an agarose gel", "DNA Cloning I: Exercise 3: Restriction Digests of Plasmid and Insert DNA", "CRISPR I:  Exercise 5: Transformation of S. Pombe to Introduce CRISPR as a chromosomal mutagenesis tool", "PCR chromosomal DNA analysis: Exercise 1: DNA Isolation and PCR Reaction on DNA Isolated from Hair Follicle", "8 Mar 3-7         RNA Dot Blot I:  RNA Isolation, Analysis of RNA Quality by Formaldehyde Gel Electrophoresis, and dot blotting-includes the quantification of RNA by Nanodrop, preparation of membrane and spotting the RNA samples", "RNA Dot Blot II: Prehybridization and Hybridization of the Probe.", "Exercise 1: RNA Dot Blot Analysis from Arabidopsis", "10 Mar 17-21    SDS PAGE and Western blotting of Yeast Extracts: Exercise 1-5", "Emails can be received 24 hours per day.", "At the instructor's discretion, you may be permitted to take a make-up exam.", "The makeup exam may be in a different format than the missed examination (e.g. oral examination for the make-up).", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 44, "course_code": "BIOL 346", "course_name": "BIOL346 - Microbial Ecology and Diversity (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Microbial Ecology and Diversity Winter 2024", "02:30PM - 05:20PM", "07:00PM - 09:50PM B1 374", "Although microbial ecology has been transformed by modern molecular techniques, basic concepts of microbial ecology are important for explaining how microbial communities impact our environment and our lives.", "Microbial ecology focuses on microbial communities and factors governing their composition and diversity.", "Describe current methods in microbial ecology and design experiments with appropriate method selection", "Identify key microbial interactions and assess their impact on each participating organism", "Appreciate microbial diversity, and critically assess an organism's suitability for a given environment", "Describe microbial community succession and how it impacts larger biome development", "Appreciate the importance, function, and development of biofilms in microbial systems", "Describe how soil as a matrix influences microbial communities", "Conduct key environmental microbiology techniques in a wet lab setting", "Microbial Ecology: Fundamentals and Applications by R.M. Atlas, and R. Bartha", "Microbiology by L.M. Prescott, J.P. Harley, and D.A. Klein", "Principles and Applications of Soil Microbiology by D.M. Sylvia", "If you are isolating or ill, a make-up test date can be scheduled.", "Notice of Recording"]}, {"course_id": 45, "course_code": "BIOL 370", "course_name": "BIOL370 - Comparative Animal Physiology: Environmental Aspects (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Questions of a personal nature", "I receive a large volume of email and ensuring that course-related emails are clearly identified will help me to respond to all queries in a timely manner.", "A comparative study of salt and water balance, circulation, respiratory systems, nitrogenous excretion, and mechanisms of energy acquisition and metabolism in animals.", "\"A comparative study of salt and water balance, circulation, respiratory systems, nitrogenous excretion, and mechanisms of energy acquisition and metabolism in animals.", "In what ways is physiology similar across a wide range of animals?", "3) What are some of the environmental considerations among these various physiological processes?", "apply knowledge from prior physiology courses to non-model systems", "appreciate biodiversity and be familiar with a wide range of animals", "describe interactions between animal physiology and the environment", "compare physiological processes among different taxa", "present physiological data appropriately in graphical format", "communicate scientific understanding of animal physiology to a broader audience", "Discussions", "If you have a conflict and are unable to make this time just let me know and I will happily find another time for us to chat.", "Note: It gets very lonely sitting in a virtual room all by myself.", "I will be in the meeting room each week, but if nobody shows up within the first 10 minutes I will log out.", "However, the basic concepts are all covered in the book and students often find it valuable to read the more detailed explanations in the book, or simply to see the material presented in a slightly different manner.", "I haven't conducted an exhaustive search, but I did some random checks and every figure I looked for in the 4th edition was also in the 5th edition, just off by a few pages.", "The brochure assignment will be an exercise in taking specialized knowledge of animal physiology and presenting that in a format that is accessible for a general audience.", "There will be a short weekly quiz conducted in Learn outside of class time.", "These are short quizzes to ensure you grasped key concepts from lecture material.", "I will include reminders about weekly quizzes in an announcement to start each week.", "Exams", "Pseudo-cumulative means the exams aren't cumulative in the sense that each successive exam covers all content since the beginning of the course.", "However, while each exam is primarily focussed on material since the previous exam, there may be a small number of questions related to core concepts and major important ideas from throughout the course.", "My perspective on the cumulative aspects of the course is that there are certain 'big ideas' or 'core concepts' that I need to know and be aware of to be a successful and productive researcher, and then there are lots of specific details that I know are in a book on my shelf or just a quick internet search away.", "Submission Deadlines and Life Balance", "Accounting for human nature, when I have set a midnight deadline I have effectively asked people to work late into the night.", "Library for research-based assignments"]}, {"course_id": 46, "course_code": "BIOL 371", "course_name": "BIOL371 - Comparative Animal Physiology: Evolutionary Themes (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["RCH 204", "In my own research I'm particularly interested in the ecological energetics of bats and birds...mostly bats.", "In what ways is physiology similar across a wide range of animals?", "3) What are some of the evolutionary considerations among these various physiological processes?", "apply knowledge from prior physiology courses to non-model systems", "appreciate biodiversity and be familiar with a wide range of animals", "describe patterns of physiological diversity", "compare physiological processes among different taxa", "identify evolutionary patterns among different taxa", "communicate scientific understanding of animal physiology to a broader audience", "However, the basic concepts are all covered in the book and students often find it valuable to read the more detailed explanations in the book, or simply to see the material presented in a slightly different manner.", "I haven't conducted an exhaustive search, but I did some random checks and every figure I looked for in the 4th edition was also in the 5th edition, just off by a few pages.", "The quizzes are helpful to ensure you grasped key concepts from lecture material, but the also encourage you to go back over your notes and study regularly throughout the semester.", "I will include reminders about weekly quizzes in an announcement to start each week.", "Poster sessions are a common and standard method for researchers to present their work to their peers at scientific conferences.", "The challenge with poster presentations is extracting the core components of the study and presenting them in a clear and concise manner.", "This assessment will peel back the curtain to reveal some aspects of the scientific research community, and will also be an exercise in integrating and synthesizing knowledge from lectures to communicate the research to a broad audience.", "Exams", "Pseudo-cumulative means the exams aren't cumulative in the sense that each successive exam covers all content since the beginning of the course.", "However, while each exam is primarily focused on material since the previous exam, there may be a small number of questions related to core concepts and major important ideas from throughout the course.", "My perspective on the cumulative aspects of the course is that there are certain 'big ideas' or 'core concepts' that I need to know and be aware of to be a successful and productive researcher, and then there are lots of specific details that I know are on a book on my shelf or just a quick internet search away.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 47, "course_code": "BIOL 383", "course_name": "BIOL383 - Tropical Ecosystems (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Tropical Ecosystems Winter 2025", "08:30AM - 11:20AM RCH 309", "TBD", "This course examines the fundamental concepts of terrestrial ecosystems in tropical climates.", "Fundamental concepts in tropical terrestrial ecosystems", "Major tropical resource systems", "Fundamental Concepts of Tropical Ecosystems", "- Introduction to the course", "- Tropical biomes & ecoregions", "Major Tropical Resource Systems", "- Tropical vegetation", "- Tropical soils", "- Nutrient cycling, carbon &", "climate change", "- Forest landscapes & loss", "- Rainforest development and", "Dynamics", "-Tropical forest management", "- Humans & terrestrial", "ecosystems", "- Tropical agroecosystems &", "Tropical Ecology Yes 107.30", "Teaching & Learning Methods", "MODULE 1: Fundamental Concepts in Tropical Terrestrial Ecosystems", "MODULE 2: Major Tropical Resource Systems", "PowerPoint slides", "Notice of Recording"]}, {"course_id": 48, "course_code": "BIOL 414", "course_name": "BIOL414 - Parasitology (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Attention will be given to eukaryotic parasites impacting human and domestic animal health.", "I will try to promote understanding of concepts of parasitology over simply memorizing life cycles.", "I aim to provide a framework for you to see the importance of parasites in the functioning of global biodiversity - including in the human experience.", "This means that rubrics, while provided, may not always express exactly what needs to be presented on paper to earn a full grade.", "Describe how parasitism impacts life, from individuals to ecosystem", "List common aspects of host life that a parasite exploits and describe how these may be changed to improve public health / conservation initiatives", "Communicate science to a variety of audiences", "A number of guest lectures will occur.", "Week of", "Parasites & their hosts (3)", "Amoebas & Ciliates (4)", "Use of generative without clear description of prompts, outputs and annotated changes made will be considered a Policy 71 violation and can result in a zero grade.", "Mid January: Group contract - completed collaboratively and sent to Pinheiro via email by a representative", "Group member evaluation to be submitted following instructions TBA - Evaluation of group members will be an average of grades received", "Final Group member evaluation submitted following instructions TBA - Evaluation of group members will be an average of grades received", "Group Roles: These team roles increase each member’s understanding of the roles and of themselves as team members.", "There are four fundamental roles to consider: leader/facilitator, arbitrator/monitor, scribe/time keeper, and devil’s advocate.", "If there are multiple items on the agenda, you will first have a short discussion with the group as to how much time will be allocated to each item.", "Ensures that all arguments have been heard, and looks for holes in the group’s thinking, in case there is something overlooked.", "Notice of Recording"]}, {"course_id": 49, "course_code": "BIOL 439", "course_name": "BIOL439 - Environmental and Natural Products Biochemistry (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Environmental and Natural Products Biochemistry Fall 2024", "02:30PM - 05:20PM DC 1350", "okey.igboeli@uwaterloo.ca", "This course deals with the functions, distribution, and environmental ramifications of natural compounds produced by plants and other biological systems.", "Natural products are those compounds usually described as secondary metabolites, i.e., those apparently non-essential products whose physiological and ecological functions are either obscure or are of peripheral importance to the organism.", "However, many of these non-essential products have profound competitive, economic, and pharmacological significance; and as research proceeds, their physiological roles within the parent organisms are becoming clearer.", "As well, this course has a strong emphasis on how environmental chemical and physical processes impact on living organisms and their biochemistry.", "Describe the importance of physical, biological, and environmental concepts related to plant secondary metabolites.", "Integrate physical, biological, and environmental concepts related to different plant secondary metabolites.", "Introduction: Products of primary and secondary metabolism.", "Importance of secondary metabolites.", "Plant-derived pharmaceutical compounds", "Some of the papers are background on different subjects covered, others are examples of current research involving environmental and natural products biochemistry.", "This course includes the independent development and practice of specific skills, such as discussion of new knowledge in the field of natural products and their competitive, economic, and pharmacological significance.", "Library for research-based assignments"]}, {"course_id": 50, "course_code": "BIOL 447", "course_name": "BIOL447 - Environmental Microbiology (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Environmental Microbiology Fall 2024", "10:00AM - 11:20AM MC 4064", "10:00AM - 11:20AM MC 4064", "You can!", "A study of the environmental impact of microorganisms.", "Tutorials emphasize critical analysis of primary literature.", "Relate microbe-environment interactions to core concepts in microbiology and biochemistry", "Identify appropriate experimental methods to answer specific research questions", "Evaluate experimental designs in published research", "Effectively communicate critical evaluation to peers", "Introduction to cellular respiration and redox;", "Calculating the oxidation state of a carbon;", "Sampling & analysis", "Critical evaluation of research", "Important points to consider when critically evaluating published research papers;", "critical evaluation, part 1", "Algal and cyanobacterial blooms", "Chapter 6 - Microbial primary production and phototrophy;", "(2023)   (Introduction and Methods)", "critical evaluation, part 1", "critical evaluation, part 2", "Biodegradation & bioremediation", "critical evaluation, part 2", "Hydrocarbon degradation", "Passow U & Overton EB (2021) (review paper)", "Environmental impacts of viruses", "Chapter 10 - Ecology of viruses;", "Final exam - TBA", "You can miss up to 3 classes and still achieve full participation marks.", "I have chosen settings that make the scores as transparent as possible, and students can see their in-progress scores for each assignment.", "You can self-declare an absence on Quest in certain situations.", "The dates affected and degree of incapacitation will be used to determine follow-up action."]}, {"course_id": 52, "course_code": "BIOL 450", "course_name": "BIOL450 - Marine Biology (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Know and describe the ecology and evolution of marine organisms in the context of the habitat that they occupy and the selection pressures that have led to these adaptations.", "The textbook provides extra material that will enhance the student learning experience and understanding as it will expand on key concepts that we cover in class.", "Exams Format- The format for both the midterm and final exam may be multiple choice, true/false, matching, and short answer questions.", "I will first post the questions and give you a few days to go over them, and then post the answers.", "These recap sessions will be during class time and are an opportunity for us to go again together over concepts that require further clarification.", "Note that these recap sessions ARE NOT intended to go over again entire lecture topics so please be specific with what you are asking (you can point to specific slide numbers if easier).", "If I don’t get a lot of questions for these recap sessions, then we will move over to new material so please make sure to attend those sessions.", "Notice of Recording", "Do not share these with any third-party sites or on social media.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 54, "course_code": "BIOL 455", "course_name": "BIOL455 - Ecological Risk Assessment and Management (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Examination of the use of scientific information characterizing the risks posed to the environment by anthropogenic stresses.", "Discussions will take place in the context of aquatic ecology and presume a background of standard aquatic toxicology methods.", "Critical connections between assessment and management will be discussed in lectures and tutorials.", "Define problems in ecotoxicology", "Understand considerations involved in risk management decision making", "Apply statistical software to analyze environmental data sets", "Apply the above principles to case studies", "Introduction to Risk Assessment", "ERA Framework – Problem Formulation", "Biomarkers", "Writing Tips and Tools", "Obtaining Ecotox Data", "Fact Sheet", "Each team will complete a one-page fact sheet providing background information about their assigned pesticide.", "The quiz will be multiple choice and will be completed during lecture time.", "Each team will complete a risk assessment on their assigned pesticide using real data obtained from the United States Environmental Protection Agency’s ECOTOX database.", "Assessment results will be communicated in both oral and written forms.", "Team Evaluation", "For each of the three team based assignments all team members will assign their teammates and themselves a grade out of ten based on their team citizenship during the generation of the assignment.", "Failure to submit a team member evaluation will result in a grade of zero for the team member evaluation.", "Late submissions will be penalized at a rate of 10% per day for the first seven days.", "Extensions"]}, {"course_id": 56, "course_code": "BIOL 462", "course_name": "BIOL462 - Applied Wetland Science (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM DC 1351", "Shayna Meinzinger                                           sbmeinzinger@uwaterloo.ca            Office hours: by email appointment", "Advanced concepts on wetland ecosystems in the context of regional and global earth systems processes such as carbon and nitrogen cycling and climate change, applications of wetland paleoecology, use of isotopes and other geochemical tools in wetland science, and wetland engineering in landscape rehabilitation and ecotechnology.", "Current issues in Canada and abroad will be examined.", "We may also use unscheduled tutorial time for make-up classes if needed.", "Identify a wetland’s class using the Canadian the wetland classification system and define and describe form and type", "Describe wetland ecological function, biogeochemical function, and role in and impact by anthropogenic climate change", "Describe the basic principles and challenges associated with wetland restoration and creation, and the design of treatment wetlands", "Create (as a group) a short scientific report and infographic summazing scientific understanding of a wetland, including appropriate references", "Introduction   Chapter 1,2", "Safety Meeting for Field Trips", "7. Biogeochemistry II:  Carbon and Climate Change", "7. Biogeochemistry II: Carbon and Climate Change", "11 Nov. 12 7. Biogeochemistry II: Carbon and Climate Change   Chapter 16", "Guest lecture: Emilie Montreuil Strub and Rachel McNamee: Microplastics in Lakes", "Textbook and Readings", "Supplementary textbook that covers biogeochemistry better than Mitsch and Gosselink.", "Graduate school level so do not be alarmed!", "Reference-managing software Very handy to manage references for your group project.", "Useful for field day to document findings.", "It is a closed-book test worth ~40 marks.", "Task 0: Pick your group based on field site and topic and sign up under Learn: Groups--> Group Project.", "Task 1: Do the assigned readings and literature search for your wetland and create a draft \"concept map\" showing the interaction of geology/geomorphology, soils, water and plants in your wetland.", "Use this data for completion of Tasks 2-4.", "We strongly encourage you to have a rough draft ready a week before and use the last week to copyedit and refine the writing of your group members.", "Some class time will be used to go over appropriate scientific research methods and writing techniques.", "Notice of Recording", "Extensions and Accommodations", "Extensions and other accommodations will only be considered on a case-by-case basis.", "You are taking full responsibility for AI-generated materials as if you had produced them yourself: ideas must be attributed and facts must be true.", "In reference list:", "URL of the platform where the conversation took place].", "That all said, AIs can be interesting and fun!", "You are welcome to check them out and use them as a study aid.", "(Note: If you want to use ChatGPT, you must make a free account and provide your email and phone number."]}, {"course_id": 57, "course_code": "BIOL 470", "course_name": "BIOL470 - Methods of Aquatic Ecology (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Methods of Aquatic Ecology Fall 2024", "03:30PM - 04:20PM", "As an active researcher in aquatic ecology for more than 30 years (with the Fisheries and Oceans Canada, Environment Canada, Canadian Water Network and the University of Waterloo) the instructor (Prof. Mark Servos) will highlight and demonstrate some key techniques and share experiences based on extensive field work in Canada and elsewhere.", "Professor Mark Servos", "An introduction to methods used to sample and characterize the ecological structure and function of aquatic ecosystems, including basic aspects of the abiotic environment.", "Field trips to lake and stream sites are combined with laboratory analysis of samples and data.", "While the main emphasis is on the techniques, the exercises also provide direct experience with some of the natural and anthropogenic variation observable in aquatic systems.", "On-line background with readings and assignments,", "Field collections/demonstrations,", "Sample preparation, analysis and demonstrations,", "The impact of Belwood Lake on the ecology of the Grand River below the Shand Dam is used as a case study.", "Students will develop an understanding of the common methods used in aquatic ecology to study and assess biodiversity and change in aquatic ecosystems.", "It should be noted that the intention is not to cover every aspect of aquatic ecology but to apply methods and techniques that are common in current biomonitoring program.", "Identify and use common sampling equipment applied in aquatic ecology,", "Understand the physical and ecological structure and processes of a lake environment,", "Understand the physical and ecological structure of a stream environment,", "Put the ecological data collected into the context of the physical/biological environment,", "Field Trip/Lab", "Adaptation to Rivers", "Data Analysis and Review", "Practical Test and Data Analysis", "Freshwater Ecology: Concepts and Environmental Applications in Limnology, 3rd Edition, 2020.", "The assignments are all linked to the final interpretation and synthesis of the field sampling data and preparation of the final report.", "The first assignments focus on field sampling methods (supporting the field trips) and then analysis of the samples collected and data interpretation.", "Practical Test", "This will be a test of the acquired skills for field collections, sample preservation, identifications/methods.", "You will be issued a field lab book on the first class/lab.", "Please make drawing and included important aspects of filed collections methods, how to separate the common species collected/identified and data processing.", "If you need to miss a field trip it is very important to tell us in advance (so we can plan for it).", "If you miss a field trip or lab you are still responsible for all class material covered.", "If you come to the first lab and provide the password/code “rainbow darter” you will get your first stamp.", "Notice of Recording", "During this class we will take photos of the field and lab activities.", "Exceptions for Special Circumstances"]}, {"course_id": 58, "course_code": "BIOL 479", "course_name": "BIOL479 - Population Genetics and Evolution (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Population Genetics and Evolution Fall 2024", "11:30AM - 12:20PM EV2 2002", "Special emphasis is placed on the dynamic role these factors play in the process of population divergence, and ultimately speciation.", "To understand, integrate and apply the basic principles of population genetics to biological and evolutionary situations.", "Specific objectives for each topic will be indicated in the lecture notes.", "To successfully complete an assignment, you must make a very serious attempt to do each question, and your assignment must be of fourth year university quality in terms of legibility, and in the case of written answers, coherency.", "Exam Composition and Policy: The midterm exams will consist of roughly 50% calculations and a short answer question, and 50% multiple choice questions (as well as the words of the day bonus marks).", "Be sure to bring a calculator, your sheet of notes (see below) and WATCARD to both midterms and the final.", "Missing midterms frivolously is a bad strategy because the concepts in this course build on each other, and all exams are cumulative.", "You could also provide me with a very compelling compassionate reason, such as a serious family emergency before the exam.", "A make-up exam will be provided early in the winter term.", "Please do not use email to ask questions about course concepts and material.", "It is exceedingly difficult to explain concepts over email and I will not attempt to do so.", "Don’t waste your time (and mine) with these requests!"]}, {"course_id": 59, "course_code": "BIOL 485", "course_name": "BIOL485 - Conservation Biology (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["RCH 204", "E-mail: lmedina@uwaterloo.ca", "Drop-In Sessions: MonWed 2:30-3:00pm", "Claire Schon", "An introduction to conservation biology and the ongoing biodiversity crisis.", "Describe the origins of conservation biology", "Defend biodiversity in terms of the many ways we value it", "Calculate several biodiversity indices and discuss their relative merits", "Apply a life table analysis and interpret the results", "Create a conservation-themed hypothesis and describe a defensible means of testing it.", "Draft a concise and impactful research proposal", "Introduction to Conservation Biology", "The history and future of conservation biology", "Valuing biodiversity I", "Principles for the design and analysis of conservation studies I", "Feb 17 Reading Week Life Table Analysis Assignment & NSERC Proposal", "Reading Week Life Table Analysis Assignment & NSERC Proposal", "Mar 24 Conservation in human modified landscapes Chpt 13", "Roles of people in conservation", "Reconciliation and conservation", "No Readings"]}, {"course_id": 64, "course_code": "BIOL 499A", "course_name": "BIOL499A - Senior Honours Project (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["A senior-year research project."]}, {"course_id": 65, "course_code": "BIOL 499B", "course_name": "BIOL499B - Senior Honours Project (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["A senior-year research project."]}, {"course_id": 66, "course_code": "EARTH 221", "course_name": "EARTH221 - Introductory Geochemistry (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "EARTH 221", "EARTH 221 001", "EARTH 221 101", "RCH 306", "My PhD was completed in 2014 in nitrogen cycling and use of stable isotopes to understand N cycling in the Grand River, Ontario.", "EARTH 221:", "Introduction to environmental isotope geochemistry and radiometric dating.", "Basic aqueous geochemistry: pH, carbonate equilibrium, and common ions in natural waters.", "View requirements for EARTH 221", "Calculate basic geochemical parameters and create associated diagrams", "Identify applications of geochemistry for environmental problems/studies", "Present and discuss geochemical scientific literature", "Please read slides for Intro, element abundances, isotopes, chart of the nuclides, nucleosynthetic processes", "Highlights of Origin of Elements", "Periodic Table/Earth Formation", "Solar System geochemistry and planetary formation, composition of meteorites", "Chemistry of bulk Earth, atmosphere, oceans, crust, mantle, and core   A2 Misra p. 296 – 313, 326-344, 354-362", "Equilibrium constants, introduction to phase diagrams, basics of kinetics", "Basic concepts, laws of thermodynamics, Gibb's free energy.", "Igneous rock geochemistry", "A4 Misra p. 226 –  240, 310-313", "Introduction to Geochemistry.", "This grade includes:", "In groups of 4, you will present the findings of a recent scientific paper that includes some geochemistry.", "It is a closed book test.", "Typical question types may be multiple choice, interpreting diagrams, explaining concepts, and doing calculations (equations provided).", "Equations are provided and you should definitely bring a calculator.", "Notice of Recording", "Extensions and Accommodations", "Extensions and other accommodations will only be considered on a case-by-case basis.", "You are taking full responsibility for AI-generated materials as if you had produced them yourself: ideas must be attributed and facts must be true.", "In reference list:", "URL of the platform where the conversation took place]."]}, {"course_id": 67, "course_code": "EARTH 232", "course_name": "EARTH232 - Introductory Petrography (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["EARTH 232", "DWE 1515", "B. Kendall", "08:30AM - 11:20AM EIT 1009", "EARTH 232 102", "08:30AM - 11:20AM EIT 1009", "Introduction to silicate phase equilibria and the use of mineral stability diagrams to understand petrogenetic processes.", "Laboratory work focuses on using a transmitted light microscope to study the optic properties of minerals in order to identify them as well as observe rock textures and interpret geological histories.", "View requirements for EARTH 232", "Describe how magmas form and evolve to produce a variety of common igneous rocks", "Show how the different agents and types of metamorphism lead to the formation of common metamorphic rocks", "Understand how to use simple phase diagrams to interpret the geological history of a rock", "Use mineralogy and texture to interpret the geological history of a rock", "Identify and describe minerals and textures using a petrographic microscope", "Classify igneous, sedimentary, and metamorphic rocks", "Relate common rock associations to plate tectonic settings", "Introduction", "Igneous: Magma Differentiation", "Igneous: Binary Solid Solution Phase Diagrams", "Igneous: Binary Eutectic & Peritectic Phase Diagrams", "Igneous: Ternary Phase Diagrams", "Igneous: Classification & Occurrence", "Igneous: Classification & Occurrence", "Metamorphic: Zones and Facies", "Metamorphic: Phase Diagrams", "Metamorphic: Classification and Occurrence", "Sedimentary: Classification & Occurrence", "Sedimentary: Classification & Occurrence", "Textbook: Earth Materials - Introduction to Mineralogy and Petrology, 2nd Edition.", "Cornelius Klein and Anthony Philpotts.", "Textbook: Introduction to Optical Mineralogy, 4th Edition.", "On reserve in Davis Library - 3 hour loan.", "Textbook: Principles of Igneous and Metamorphic Petrology, 2nd Edition.", "Each rock type can only be claimed by one student.", "Final Exam: The closed-book final exam will be in-person and scheduled by the registrar.", "This course includes the independent development and practice of specific skills, such as synthesis and poster presentation of information on a student's chosen rock type, and laboratory mineral and rock descriptions.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office: https://uwaterloo.ca/sexual-violence-prevention-response-office", "An extensive list of campus resources can be found here: https://uwaterloo.ca/graduate-studies-postdoctoral-affairs/current-students/campus-resources-and-services", "Non-emergency Waterloo Regional Police Services - 519-653-7700", "St. Mary's Hospital - 519-744-3311", "Kitchener-Waterloo Sexual Assault Support Centre - 519-741-8633", "Stratford General Hospital - 519-272-8210", "EDI-R STATEMENT"]}, {"course_id": 68, "course_code": "EARTH 235", "course_name": "EARTH235 - Stratigraphic Approaches to Understanding Earth's History (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["08:30AM - 09:50AM EV2 2002", "jwjohnston@uwaterloo.ca", "10:00AM -", "jwjohnston@uwaterloo.ca", "10:00AM -", "jwjohnston@uwaterloo.ca", "Department of Earth and Environmental Sciences in the Faculty of Science @UWaterloo.", "At the University of Waterloo, Dr. Johnston teaches numerous classes such as Earth 121 - Introductory Earth Sciences, Earth 235 - Stratigraphic Approaches to Understanding Earth's History, Earth 390 - Methods in Geological Field Mapping, and occasional graduate classes such as Earth 691 Special Studies for MSc Students (i.e. Coastal Geology).", "He is a board member for the University of Waterloo Earth Science Museum and representative for the Geological Association of Canada on the North American Commission on Stratigraphic Nomenclature (former chair and vice chair).", "Discussions", "Email", "But please indicate the course name and number and reason for the email in the subject line.", "An introduction to stratigraphic principles and methods used in deciphering geological history.", "Techniques of collecting surface and subsurface geologic data and representation of stratigraphic data.", "Procedures applicable to the classification and nomenclature of stratigraphic units using the North American Stratigraphic Code.", "The development of stratigraphic sequences as controlled by global and regional tectonics and sea level fluctuations.", "Laboratory work will include construction and interpretation of various types of learning media such as traditional maps, cross sections, new physical and digital models, as well as extended reality.", "Describe and illustrate perspectives and applications of stratigraphy.", "Understand and apply the classification and nomenclature of stratigraphic units.", "Debate preservation potential though space and time.", "Professional Geoscientists Ontario - Student Member", "The level of geoscience education in a bachelor of science degree is considered to meet the minimum knowledge requirements recommended by Geoscientists Canada for admission to practice professional geoscience and for interprovincial (and international) mobility.", "Readings", "Week 1: Introduction and Collecting Geologic Data", "Module 1: Introduction Earth 235 Course Outline", "Introduce Yourself Discussion", "1c Field Techniques", "1d Field Notebook", "Module 4: Facies and Correlation 3a Facies", "3b Correlation", "Module 5: Introduction to the Stratigraphic Code (and Lithostratigraphic Chart for southern Ontario page) 4a", "Week 7: Canada's Structures and Introduction to Sequence Stratigraphy", "Module 10: Introduction to Sequence Stratigraphy 7a Sequence Stratigraphy", "Week 8: Relative Time and Absolute Dating and Age of the Earth", "Module 12: Absolute Dating and Age of the Earth", "Therefore, Dr. Johnston has compiled a unique set of readings from a variety textbooks and online sources.", "Instructions", "A complete set of labs is provided in Learn for each student to complete and then submit to the Learn Dropbox.", "Please follow these steps for each lab:", "Note: Labs are expected to be submitted in a well-organized, neat and legible fashion.", "Deliverables", "Your lab assignment must be submitted in the following file type:", "Most word processing software applications will allow you to save your file as a PDF; however, if you require software to create PDFs, some free options are listed below:", "Email subject line must include the course number and code and name of the assessment.", "Please email the entire EARTH 235 Team, including the TAs and your instructor to inform the entire Team and receive a prompt response.", "Please make sure you are registered with AAS first", "Intellectual property includes items such as:"]}, {"course_id": 69, "course_code": "EARTH 238", "course_name": "EARTH238 - Introductory Structural Geology (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Structural Geology Winter 2024", "EARTH 238", "03:30PM - 04:20PM", "EARTH 238 201", "changcheng.li@uwaterloo.ca", "EIT 1013", "changcheng.li@uwaterloo.ca", "EARTH 238 102", "EIT 1013", "changcheng.li@uwaterloo.ca", "*", "Discussions", "To the teaching team: This is a discussion topic for you to give suggestions to the teaching team and for them to know the questions you have.", "Concepts of stress and strain; elementary rock mechanics; description and classification of folds, faults, foliations, lineations and joints; use of primary structures; introduction to geometrical analysis.", "Labs will emphasize geometrical problems, including geological maps and cross sections, and stereographic projection.", "Understand the process in which various geological structures develop", "Perform kinematic analysis from some simple structures", "Record orientation data in the right format according geological convention", "Read a geological map and draw cross sections base on the map", "Use an equal-area net to conduct geometrical analysis", "iClicker Students can use either iClicker student App or iClicker remote Yes", "Basic Methods of Structural Geology.", "Students have to answer a question in a quiz correctly to get the mark.", "Examination regulations as outlined in the current UW undergraduate calendar are to be followed."]}, {"course_id": 71, "course_code": "EARTH 321", "course_name": "EARTH321 - Introduction to Geomicrobiology (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Geomicrobiology Fall 2024", "EARTH 321", "EARTH 321 001", "jenine.mccutcheon@uwaterloo.ca", "02:30PM - 05:20PM", "jenine.mccutcheon@uwaterloo.ca", "EARTH 321:", "This course will explore how microbial life influences geochemical cycles in natural environments and engineered systems.", "View requirements for EARTH 321", "Describe microbial requirements for life and use this information to design a suitable growth environment", "Identify various microbial energetic and nutritional pathways as related to geological substrates, including identifying electron donors/acceptors and mineral starting materials and by-products", "These skills should be demonstrated in the laboratory projects", "Course overview and introduction to geomicrobiology", "Module 1: Bacteria cell biology and reactivity", "Lab safety quiz & upload WHMIS to the Dropbox", "Module 3: Microbe-mineral interactions", "Oct. 21", "Oct. 24", "Module 5: Microbe-mineral structures", "Midterm follow-up", "Module 7: Extreme Environments I"]}, {"course_id": 72, "course_code": "EARTH 333", "course_name": "EARTH333 - Introductory Sedimentology (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["04:00PM - 05:20PM", "RCH 204", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Students can expect a response within 48 hours from Monday to Friday.", "TAs will also be available during in-person laboratory sessions.", "An introduction to sediment properties, sedimentation processes, and sedimentary deposits in a variety of depositional environments and climatic conditions.", "View requirements for EARTH 333", "Know the main principles, concepts and approaches pertaining to the study of sediments and sedimentary rocks", "Know the main modern sedimentary environments", "Interpret past sedimentary environments from the sedimentary record", "Appreciate societal relevance of sedimentology and know some of the possible applications", "Sedimentology and Stratigraphy, 2nd edition / Gary Nichols Electronic course reserve.", "Principles of Sedimentology and Stratigraphy, 5th edition / Sam Boggs Course reserve.", "A team rep must inform their TA of the team members and team name.", "Dropbox folders with limited access will be created for each team and linked to the gradebook.", "Penalties for late submissions:", "Weekends and holidays will not count when determining a late submission penalty"]}, {"course_id": 74, "course_code": "EARTH 421", "course_name": "EARTH421 - Advanced Geochemistry (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Advanced Geochemistry Fall 2024", "08:30AM - 09:50AM MC 4064", "01:00PM - 03:20PM", "08:30AM - 10:50AM EIT 1009", "Development of the three laws of thermodynamics; Gibbs free energy and equilibria constants.", "Introduction to various topics in aqueous geochemistry such as mineral equilibria, ion exchange, and redox equilibria.", "View requirements for EARTH 421", "Development of the three Laws of Thermodynamics; Gibbs free energy and equilibrium constants.", "Introduction to various topics in aqueous geochemistry, such as mineral equilibrium, ion exchange and redox equilibrium.", "Laboratory sessions will involve various activities related to acid-base equilibrium, redox reactions, chemical modeling, and analytical instrumentation methods.", "Thermodynamics offers Geoscientists a powerful tool to aid in the interpretation of near surface processes.", "It can be used to delineate the physicochemical conditions that led to a particular mineral assemblage; to discern whether a mineral assemblage could have resulted from equilibrium or disequilibrium (kinetic-controlled) conditions; to aid in decision-making in exploration geochemistry; and to design geochemical barriers and containment systems at waste disposal sites.", "Applications include geothermal systems, acid-mine drainage, carbon sequestration, and other near surface environmental systems.", "Develop thermodynamic principles most relevant to geochemical systems", "Understand the concepts of chemical equilibrium and metastability in the context of Earth systems", "Develop conceptual and empirical models to describe natural geochemical systems", "Apply geochemical principles toward achieving a sustainable use of Earth’s resources, including predicting the impacts of resource development and developing strategies for mitigation of impacts", "Communicate geochemical concepts to various audiences", "Introduction and review", "Thermodynamics of Pure Substances", "Examples: Steam separation in geothermal systems, CO2 compressibility for sequestration.", "Thermodynamics of Simple Mixtures", "Free Energy (G)", "Determining mineral phase transitions.", "The derivation of the equilibrium constant (K) from the first and second laws.", "The need for the third law and evidence; where thermodynamic data originates and its limitations", "Free energy calculations", "Aqueous Solutions", "Applications of acid-base and redox reactions in natural and perturbed systems.", "Aqueous geochemistry", "Solubility products and saturation indices; the influence of ion hydrolysis on mineral and gas solubilities.", "The Carbonate System", "An examination of carbonate gas-water-solid equilibrium and the factors that influence it.", "A look at analogous geochemical systems.", "Recommended reading for those pursuing advanced degrees in geochemistry."]}, {"course_id": 75, "course_code": "EARTH 440", "course_name": "EARTH440 - Quaternary Geology (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "02:30PM - 05:20PM", "Students can expect a response within 48 hours from Monday to Friday.", "The TA will also be available during in-person laboratory sessions.", "Glacial-interglacial cycles and sub-Milankovitch oscillations from ocean sediments and ice cores.", "Glacial sediment-land systems.", "Local field trips.", "View requirements for EARTH 440", "Local field trips focusing on the regional Quaternary geology and sedimentology of glacial sediments.", "Know the main principles, concepts and approaches pertaining to the study of Quaternary sediments and landforms (especially glacial sediments in Canada);", "Knowledge of the Quaternary geology of southern Ontario;", "Knowledge of the main applications of glacial geology;", "Gain experience recognising and investigating landforms and glaciogenic sediments using tools such as Google Earth and a GIS;", "Gain experience searching for and using public spatial datasets from various government agencies and other sources;", "Experiment and learn to create engaging and accurate stories about Quaternary geology features and maps", "Appreciation and basic knowledge of the complexity of changes that have occurred throughout the Quaternary Period", "The following textbooks have also been used in the development of this course:", "Field trips: Four field trips will occur during lecture and lab session hours in September and early October.", "The field trips are intended to give an overview of the glacial stratigraphy and sediment-landform assemblages in the region as well as some hands-on experience.", "You will be given the opportunity to learn some basic field description/measurement procedures.", "Important note: Field trip fees may be charged to cover direct costs of travel (essentially the cost of school bus transportation service).", "In-class quizzes: There will be a series of short in-class quizzes (~10-15 min each) throughout the term.", "Each team will have to prepare a StoryMap summarizing the field trips and with one particular aspect of the trips highlighted and explained in greater details.", "The second StoryMap will be about a specific map sheet area selected from a short list of available surficial geology maps produced by a government geological survey in recent years.", "The StoryMap will provide an overview of the main geological and geomorphological features of the map, and will also put the map into the broader regional context based on the available scientific literature.", "Notice of Recording", "Weekends and holidays will not count when determining a late submission penalty"]}, {"course_id": 76, "course_code": "EARTH 444", "course_name": "EARTH444 - Applied Wetland Science (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM DC 1351", "Shayna Meinzinger                                           sbmeinzinger@uwaterloo.ca            Office hours: by email appointment", "Advanced concepts on wetland ecosystems in the context of regional and global earth systems processes such as carbon and nitrogen cycling and climate change, applications of wetland paleoecology, use of isotopes and other geochemical tools in wetland science, and wetland engineering in landscape rehabilitation and ecotechnology.", "Current issues in Canada and abroad will be examined.", "We may also use unscheduled tutorial time for make-up classes if needed.", "Identify a wetland’s class using the Canadian the wetland classification system and define and describe form and type", "Describe wetland ecological function, biogeochemical function, and role in and impact by anthropogenic climate change", "Describe the basic principles and challenges associated with wetland restoration and creation, and the design of treatment wetlands", "Create (as a group) a short scientific report and infographic summazing scientific understanding of a wetland, including appropriate references", "Introduction   Chapter 1,2", "Safety Meeting for Field Trips", "7. Biogeochemistry II:  Carbon and Climate Change", "7. Biogeochemistry II: Carbon and Climate Change", "11 Nov. 12 7. Biogeochemistry II: Carbon and Climate Change   Chapter 16", "Guest lecture: Emilie Montreuil Strub and Rachel McNamee: Microplastics in Lakes", "Textbook and Readings", "Supplementary textbook that covers biogeochemistry better than Mitsch and Gosselink.", "Graduate school level so do not be alarmed!", "Reference-managing software Very handy to manage references for your group project.", "Useful for field day to document findings.", "It is a closed-book test worth ~40 marks.", "Task 0: Pick your group based on field site and topic and sign up under Learn: Groups--> Group Project.", "Task 1: Do the assigned readings and literature search for your wetland and create a draft \"concept map\" showing the interaction of geology/geomorphology, soils, water and plants in your wetland.", "Use this data for completion of Tasks 2-4.", "We strongly encourage you to have a rough draft ready a week before and use the last week to copyedit and refine the writing of your group members.", "Some class time will be used to go over appropriate scientific research methods and writing techniques.", "Notice of Recording", "Extensions and Accommodations", "Extensions and other accommodations will only be considered on a case-by-case basis.", "You are taking full responsibility for AI-generated materials as if you had produced them yourself: ideas must be attributed and facts must be true.", "In reference list:", "URL of the platform where the conversation took place].", "That all said, AIs can be interesting and fun!", "You are welcome to check them out and use them as a study aid.", "(Note: If you want to use ChatGPT, you must make a free account and provide your email and phone number."]}, {"course_id": 77, "course_code": "EARTH 458", "course_name": "EARTH458 - Physical Hydrogeology (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrogeology Fall 2024", "08:30AM - 09:50AM DWE 3519", "An introduction to the principles and theories of mineral deposit genesis.", "Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered.", "View requirements for EARTH 458L", "Applied geophysics provides geoscientists with a wide-range of non-invasive methods for characterizing the Earth's interior.", "This course is an introduction to the physical principles underlying field acquisition, processing, and data interpretation for commonly used applied geophysical techniques (seismic, electrical, electromagnetic induction, gravity, and magnetic methods).", "This course is not only pertinent for geoscientists but also for engineers and others interested in learning how physics can be used to explore the Earth's interior or perform non-destructive testing.", "Near-surface geophysics is used to characterize the shallow subsurface for a wide-spectrum of applications.", "This application-oriented course covers current methodology in near-surface geophysics, including electrical, electromagnetic, ground penetrating radar, seismic refraction, and well-logging methods.", "Techniques for geophysical data acquisition and interpretation are studied and applied to field data.", "Examples of the application of geophysical techniques to archeological, forensics, geotechnical, glaciology, and hydrogeological problems are examined.", "View requirements for EARTH 461", "A field-oriented course on current methodology in the general area of geotechnical or engineering geophysics as applied to environmental problems.", "Typical topics covered: well logging and time domain electromagnetic surveys for groundwater supply; magnetic and terrain conductivity surveys for waste materials; ground penetrating radar applications to stratigraphy and contamination; streaming potential surveys of dam leakage.", "A pre-lab quiz must be completed before attending each field lab.", "Labs will be completed in groups with field data recorded in field books or datasheets.", "These data will be used to a complete individual lab assignment.", "This site contains over 100 groundwater monitoring wells.", "Field lab activities involve:", "(3) Measurement of in-situ hydraulic conductivity using single-well response tests", "Each lab will provide you with a unique dataset that you will use to develop a conceptual site model of the local groundwater flow system.", "• Properly construct and interpret soil core logs using United Soil Classification System, and make lithostratigraphic interpretations using geophysical logs", "• Assess and interpret water level measurements through the construction of water table maps and flownets", "• Interpret single-well response tests including falling and rising head (slug) tests to determine in-situ hydraulic conductivity", "• Interpret hydraulic pumping tests to determine aquifer transmissivity and storage parameters and assess water resource vulnerability", "Each module will contain a series of recorded lecture slides and video demonstrations reviewing core concepts and guidelines for the upcoming field lab.", "Please include “Earth 458L” in the subject line of all e-mail communications as well as your Full Name and Student ID# in the text of the email.", "Hydrogeological equipment to make measurements and collect data (temporary use)", "Specialized hydrogeological software to complete certain assignments", "Datasheet to record field data", "Other data should be recorded in your field books and distributed to your group members as needed.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Notice of Recording", "Participation in Field Labs:", "These quizzes are designed to keep you on schedule and prepare you for the in-person field lab and assigned activities.", "There will be a 48-hour grace period to finalize the submission of your assigned activities without incurring any late penalty."]}, {"course_id": 78, "course_code": "EARTH 459", "course_name": "EARTH459 - Chemical Hydrogeology (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["10:00AM - 11:20AM PHY 150", "10:30AM - 11:20AM MC 4042", "View requirements for EARTH 459", "Overall learning objective: To provide an understanding of the basic principles of chemical hydrogeology as they relate to problem solving in various applications of geochemistry.", "Develop the skills to collect accurate and reliable physical, geochemical and microbiological measurements from groundwater flow systems", "Analyze geochemical and hydrogeological data to identify the processes that affect groundwater quality and cause groundwater contamination", "Develop management and remediation systems to protect groundwater quality and protect human and ecosystem health", "Part 1: Chemical principles and processes of water-rock interaction", "Introduction to chemical hydrogeology:", "Mineral-water interaction:", "Mineral-water interaction:", "Development of natural groundwater chemical sequences in flow systems:", "Redox reactions, redox sequences in groundwater flow systems", "Development of natural groundwater chemical sequences in flow systems:", "Introduction to chemical modelling:", "Case studies of groundwater contamination and remediation.", "Introduction to common scenarios of groundwater contamination and classes of contaminants considered in this course.", "Non-Aqueous Phase Liquids – dissolution and contamination patterns, vapour transport, implications for clean-up.", "Acid generating mine wastes and inorganic contaminants:", "Selected topics in chemical hydrogeology:", "Natural attenuation and in-situ remediation: Inorganic contaminants and radionuclides, approaches and case studies.", "Emerging contaminants in groundwater: Fate of pharmaceutical compounds and other emerging compounds in septic system and landfill plumes.", "Environmental Isotopes in Hydrogeology Authors: I.D. Clark and P. Fritz No 250", "This course includes the independent development and practice of specific skills, such as geochemical calculations.", "Library for research-based assignments"]}, {"course_id": 79, "course_code": "ERS 383", "course_name": "ERS383 - Tropical Ecosystems (0.50)", "term_name": "List 2", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Tropical Ecosystems Winter 2025", "ERS 383", "08:30AM - 11:20AM RCH 309", "TBD", "ERS 383:", "This course examines the fundamental concepts of terrestrial ecosystems in tropical climates.", "View requirements for ERS 383", "Fundamental concepts in tropical terrestrial ecosystems", "Major tropical resource systems", "Fundamental Concepts of Tropical Ecosystems", "- Introduction to the course", "- Tropical biomes & ecoregions", "Major Tropical Resource Systems", "- Tropical vegetation", "- Tropical soils", "- Nutrient cycling, carbon &", "climate change", "- Forest landscapes & loss", "- Rainforest development and", "Dynamics", "-Tropical forest management", "- Humans & terrestrial", "ecosystems", "- Tropical agroecosystems &", "Tropical Ecology Yes 107.30", "Teaching & Learning Methods", "MODULE 1: Fundamental Concepts in Tropical Terrestrial Ecosystems", "MODULE 2: Major Tropical Resource Systems", "PowerPoint slides", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 0, "course_code": "BIOL 150", "course_name": "BIOL150 - Organismal and Evolutionary Ecology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Organismal and Evolutionary Ecology Fall 2023", "11:30AM - 12:20PM RCH 101", "Learn Discussion Board", "Email and Appointment Requests", "Coverage includes hypothesis testing and the nature of scientific inquiry, basic population genetics, physiological ecology, life histories, dispersal, basic population and community ecology, macroevolution, systematics and classification, as well as functional morphology.", "The theory of evolution unites the whole of biology and all living organisms into a coherent body of knowledge, allowing comparisons across all forms of life.", "Ecology describes how organisms interact with their environment and each other to create interdependent systems from microscopic to global scales.", "These disciplines are fundamentally tied together: evolution is the primary mechanism by which species adapt to their environment; ecological interactions and environmental variability drive natural selection.", "You will also carry out simulated lab assignments to test the principles of evolution, design ecological experiments to test alternate hypotheses about the conservation of species and manipulate demographic parameters to test their influence on population growth.", "Understand the principles of scientific methodology", "Define ecological and evolutionary terms, such as the niche, adaptation, and altruism", "Illustrate these mechanisms in the context of course examples", "Explain how ecological interactions and evolution are interconnected", "Sign code of conduct and upload to LEARN.", "2) Sept 8 Evolution for Ecology Section 1: Evolution and Ecology are Intertwined", "4) Sept 13 Evolution for Ecology", "5) Sept 15 Evolution for Ecology Section 3: Genetics and Evolution", "6) Sept 18 Evolution for Ecology Section 4: Managing the Evolution of Resistance", "9) Sep 25 Physiological Ecology Section 1: Trade-offs and Species Distributions", "15) Oct 9-13 Holiday – No classes Understanding Experimental Design Simulation due by Oct 16, 11:59 pm", "16) Oct 16 Empiricism in Ecology Understanding Experimental Design Simulation due by 11:59 pm (best 2/3 for 10%)", "It is important that you review the information below before you subscribe to the SimUText for Organismal Ecology and Evolution - Chapters at University of Waterloo.", "SimUText Application Installers", "SimUText Application Installers", "At the end of every unit, you will work individually to develop a concept map using Cmap Cloud to visually display the relationships among what you consider the key concepts in the unit.", "These should represent your personal comprehension of how the concepts relate to each other, and no two should be identical.", "Also, class will entail a lot of discussion that won’t be represented in PPT slides.", "The simulations include one on Evolution in Ecology, one on Experimental Design in Ecology and one on Population Growth.", "The learning outcome for the unit tests is to demonstrate your recall and comprehension of the material covered in the units and to incentivize keeping up with the readings and attending lectures and reviewing for the final exam.", "The learning outcome is to demonstrate recall, synthesis and integration of material learned during the course.", "The final exam will consist of multiple-choice, T/F, solve the equation type of questions and integration questions that are designed to test your basic and deeper understanding of the course concepts.", "Important note regarding tests and exams", "Unit tests will be completed for the first 4 units of the course.", "Ensure you have a reliable internet connection and functional computer to complete them – technical challenges encountered during remote completion are not an excuse for missed tests.", "I will have a limited number of printed back-ups for students in class who experience technical difficulties.", "You will need to have a reliable internet connection and functional computer to complete the exams.", "Emails can be received 24 hours per day.", "If you miss a make-up exam for any reason, you will be given a DNW, and must petition the Associate Dean of Science if you feel you missed it for a valid reason.", "At the discretion of the instructor, you may be permitted to write a make-up exam.", "The timing will be conveyed to you via e-mail if you are eligible for a make-up.", "If you follow these steps,", "I will consider granting an extension", "Students are responsible for their own behavior and should be mindful of the impact that their actions have on the wellbeing of others.", "Act in a respectful and open manner when listening to the views and ideas of others.", "Participate fully in the discussion boards: make sure your answers are to the best of your ability and that you respond to others’ posts.", "Signature"]}, {"course_id": 1, "course_code": "BIOL 165", "course_name": "BIOL165 - Diversity of Life (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "An introduction to the diversity of living organisms from simple prokaryotes to complex eukaryotes.", "The characteristics that define these phyla", "Be able to compare and contrast life histories", "Introduction and Cell Biology", "Phylogeny and Classification", "Bacteria and Archaea", "Protists", "Library for research-based assignments"]}, {"course_id": 2, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}, {"course_id": 3, "course_code": "BIOL 240L", "course_name": "BIOL240L - Microbiology Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["BIOL 240L", "BIOL 240L 001", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 002", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 003", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 005", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 006", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 007", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 008", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 010", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 012", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 013", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 014", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 015", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 017", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 018", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 021", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "Email: cduxbury@uwaterloo.ca", "View requirements for BIOL 240L", "Main Objective Obtain a a good understanding of the basic techniques used in a microbiology lab to study and handle microorganisms safely.", "Apply staining techniques to differentiate and observe types of bacteria", "Appreciate proper aseptic technique while handling microorganisms in the lab and inoculating media", "Properly prepare slides for examination under the microscope", "Prepare and use dilutions to isolate pure cultures and to enumerate the number of organisms in a culture", "Exp 3: Basic Bacterial Shapes", "Exp 12: Pour-Plate Method", "Exp 14: Aseptic Technique in Pipette Handling", "Exp 15: Standard Plate Count Method", "Exp 17: Bacterial Flagella Stain", "Exp 19: Miniprep of Plasmid DNA", "Exp 20: Analysis of Plasmid and Genomic DNA", "Exp 21: Metabolic Activities of Bacteria", "Exp 30: Evaluation of Chemical Antimicrobial Agents", "Exp 31: Antibiotic Sensitivity Testing", "Exp 32: Isolation of Bacterial Mutants", "TBA", "Extra precautions must be taken to ensure the safety of yourself and those around us!", "Always be prepared for a quiz; they could be given at any time and they are cumulative!", "To make this happen, a flowchart for each experiment is required.", "The flowchart is similar to a \"map\" of your experiment and should be sufficiently detailed and include the most important information about the experimental steps and possible time management.", "The flowchart should NOT be a reiteration of the \"METHODS\" section in your manual.", "Please see Flowchart Help Sheet for a flowchart example.", "Your professionalism mark will be assigned by your TAs and will be assessed on the basis of your performance in the laboratory, attendance, and your degree of skill in microbiological techniques.", "More information will be given closer to date.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 4, "course_code": "CHEM 120", "course_name": "CHEM120 - General Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry 1 Winter 2025", "RCH 101", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "The second part of this course is concerned with explaining periodicity and trends in chemical reactivity in terms of the electronic structure of atoms and molecules.", "Topics covered in this part of the course include the quantum theory of the hydrogen atom; electron configurations in multi-electron atoms; ionic and covalent bonding; Lewis structures, valence shell electron repulsion theory and molecular geometry; quantum mechanical bonding theories, including valence bond theory and molecular orbital theory.", "Additional topics may include an introduction to electron-transfer reactions, including the assignment of oxidation states and the balancing of oxidation-reduction reactions.", "assess the greenness of a chemical reaction using Atom Economy and E-Factor metrics.", "describe the electronic structure of atoms in terms of quantum theory using atomic orbitals and quantum numbers.", "justify the organization of the periodic table and predict trends in the properties of the elements.", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and explain molecular shape and stability in terms of electron count.", "describe the interactions of molecules in solids, liquids, and gases to compare physical and reactive properties.", "Course Structure and Continuity Plans", "No extensions will be granted for Participation Challenges, but each student can drop one participation challenge from their overall grade.", "Printed spiral bound copies of the course notes can be purchased online from the UW bookstore https://wstore.uwaterloo.ca/", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare pandemic-related illnesses on Quest (Information at this link)", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 5, "course_code": "CHEM 120L", "course_name": "CHEM120L - General Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 1 Fall 2024", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Be sure to record their name and contact information in your lab manual.", "Skillfully perform basic procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "1,3,5,7,9,11", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Sept 19 - 24", "1,3,5,7,9,11", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "1,3,5,7,9,11", "- studying cis and trans isomers", "Oct 24-29", "1,3,5,7,9,11", "Titration as an Analysis Tool", "- identify an unknown solid acid", "1,3,5,7,9,11", "Introduction to Chromatography", "- quantify a cation using ion exchange", "1,3,5,7,9,11", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 6, "course_code": "CHEM 123", "course_name": "CHEM123 - General Chemistry 2 (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry 2 Winter 2025", "09:30AM - 10:20AM STC 1012", "Introduction to chemical equilibria.", "Describe the energy and entropy changes that accompany physical and chemical changes.", "Calculate the equilibrium constant for a reaction using the standard thermodynamic properties of reactants and products.", "Predict the direction of spontaneous change for a given set of initial conditions for a variety of chemical systems.", "Apply equilibrium principles to a variety of chemical reaction types including gas-phase reactions, acid-base reactions, precipitation reactions, complexation reactions and redox reactions.", "Analyze oxidation-reduction reactions and identify species being oxidized and reduced.", "Explain the basic construction of, uses of, and the differences between galvanic and electrolytic cells.", "CHEM 120 and CHEM 123 comprise a full-year course in introductory chemistry.", "Course Structure and Continuity Plans", "Chemistry Study Hall:  Starting the 2nd week of classes, there will be a first-year study hall on Tuesdays and Thursdays at 5:30 pm - 6:50 pm in STC 1012.", "You can attend as many Study Hall Sessions as you would like - grab your friends and connect with your TAs!", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 7, "course_code": "CHEM 123L", "course_name": "CHEM123L - General Chemistry Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 2 Winter 2025", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- a real life analysis", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 8, "course_code": "EARTH 121", "course_name": "EARTH121 - Introductory Earth Sciences (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Earth Sciences Fall 2024", "Students will learn to think like a geoscientist by adopting four ways of thinking that take into account a systems approach, a variety of spatial and temporal scales, and field thinking.", "Recognize the dynamic nature of Earth through an examination of the interactive components of the Rock Cycle.", "Extrapolate meaning from everyday geologic material and predict occurrence and origin.", "Week 1: Introduction and Four Ways of Thinking 1a and 1b Discussion: Introduce Yourself", "Week 2: Introduction to Rocks 2a Field Notes Journal 2: Are minerals important?", "Week 3: Introduction to the Rock Cycle 2b Field Notes Journal 3: What do you see in the video?", "Week 4: Introduction to the Rock Classification 2c Field Notes Journal 4: Is this depiction of the Rock Cycle complete and accurate?", "Week 5: Geologic Time and Geologic Time Scale 3a and 3b Field Notes Journal 5: How do I create a simplified Geologic Time Scale?", "Please note emails can be received 24 hours per day", "Short-term Absence", "Covid-19-related Absence", "Intellectual property includes items such as:"]}, {"course_id": 9, "course_code": "EARTH 121L", "course_name": "EARTH121L - Introductory Earth Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Earth Sciences Laboratory Fall 2024", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Email: keith.delaney@uwaterloo.ca", "Sahar Soltani - sahar.soltani@uwaterloo.ca / LABS 001 & 003", "By far, the majority of people qualified as geologists spend their time using their knowledge working 'in the field', or in exploration, putting principles learned in theory and in the laboratory, into practice.", "Identify common mineral and rocks based on their identification properties", "Understand the rock cycle and how minerals and rocks are formed", "Understand the theory of plate tectonics and how it has shaped the Earth's surface over time", "Qualitatively and Quantitatively describe earthquakes and some of their processes", "Read and interpret data from both topographic and geologic maps", "Understand the immense history and geologic record of our planet", "Understand the factors influencing climate change and quantify how the planet is changing", "Will assess Mineral and Rock Identification knowledge with real samples.", "Lab 8 Earth Structures", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "Situation where VIFs are not Appropriate"]}, {"course_id": 10, "course_code": "EARTH 122", "course_name": "EARTH122 - Introductory Environmental Sciences (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Environmental Sciences Winter 2025", "08:30AM - 09:50AM STC 1012", "I hold a PhD in Earth & Environmental Sciences from the University of Waterloo (2014) and an HBSc in Earth & Environmental Sciences from McMaster University (2006).", "You might notice I'm looking pretty pregnant!", "I'm conveniently due on April 27 BUT in the unlikely even that I have a baby really early, the excellent Dr. Keith Delaney (who has taught this class for many years) will step in at the end.", "Discussions", "Questions of a personal nature", "Office: EIT 2051D (very back of Earth & Environmental Sciences main office)", "Email: msrosamo@uwaterloo.ca", "Grad TA contact info can be found in the EARTH 122L syllabus.", "Course topics include sustainable development and the availability and use of natural resources, principles of ecology and environmental science, biogeochemical cycles, climate and climate change, soils and food supply, energy systems, surface water and groundwater, waste generation and management, pollution, and catastrophic natural processes.", "Describe common global environmental issues and the role of environmental science in identifying, understanding, and solving these issues.", "Interpret and manipulate simple box models of environmental systems", "Interpret scientific diagrams and graphs pertaining to environmental science", "1 January 06 - 10 Intro to Environmental Science & Matter, Energy and Physical Environment Chps 1 & 2", "2 January 13 - 17 Earth Systems/Ecosystems & Evolution, Biodiversity, Population Ecology Chps 3 & 4", "3 January 20 - 24 Species Interactions/Community Ecology & Human Population Chps 5 & 6", "Soils & Soil Resources*", "8 February 24 - 28 Freshwater Systems/Water Resources & Marine, Coastal Systems, Fisheries Chps 11 & 12 Quiz 6 - Chapters 11 & 12 Content Mon. Mar 3  5:00PM 3", "10 March 10 - 14 Global Climate Change & Fossil Fuels: Energy Use/Impacts Chps 14 & 15", "Energy Alternatives & Mineral Resources & Mining", "Quiz 8 - Chapters 15 & 16 & 17 Content*", "12 March 24 - 28 Managing our Waste & Environmental Health Hazards Chps 18 & 19 Quiz 9 - Chapters 18 & 19 Content Mon. Mar 31 5:00PM 3", "A Look at Environmental Science and Natural Hazards & Final Exam Study Guide / Discussion", "following these guidelines: https://uwaterloo.ca/science-undergraduate-office/academic-policies-and-procedures/accommodation-illness-or-other-extenuating-circumstances."]}, {"course_id": 11, "course_code": "EARTH 122L", "course_name": "EARTH122L - Introductory Environmental Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introductory Environmental Sciences Laboratory Winter 2025", "EARTH 122L", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Sana Ahmad has a BSc degree in Honours Co-op Environmental Science with a Geoscience Specialization from the University of Waterloo.", "Discussions", "Questions of a personal nature", "Office: EIT 2046 (within the Earth & Environmental Sciences main office)", "Email: s76ahmad@uwaterloo.ca", "Please put EARTH 122L in your email subject line so I don't miss it!", "Please do not send them personal emails!", "View requirements for EARTH 122L", "Use GPS devices and GIS software to locate points of interest and create a map", "ALL LABS ARE HELD IN ROOM: EIT 1013 (ground floor of EIT  - same building as Earth Sciences Museum)", "8 February 24 - 28 Coastal Processes and Problems: Loving Our Coasts to Death?", "10 March 10 - 14 On-Campus Water Sampling and GPS Data Collection Field Sampling and Data Collection Lab around UW Campus", "13 March 31 - April 03 Landscape Geology: Glaciers and Deserts & Climate Change: Pleistocene Records, Milankovitch Cycles Lab 8: Landscape Geology and Climate Change End of Lab 7%", "Note used copies are also fine!", "The format of the final exam will be run digitally through the LEARN Quiz system in the last week of the course, not during the formal exam period.", "Notice of Recording", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "These can be completed digitally now!", "This official verification is necessary before any action can be taken and can be downloaded from the Health Services website.", "Situation where VIFs are not Appropriate", "Example citations:", "\"References"]}, {"course_id": 12, "course_code": "EARTH 123", "course_name": "EARTH123 - Introductory Hydrology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Dr. Rosamond is the International Lecturer for Water Sciences in the Department of Earth & Environmental Sciences at the University of Waterloo.", "She loves learning about water, especially nutrients and greenhouse gases in streams in rivers.", "Email: msrosamo@uwaterloo.ca", "Education", "2014 - PhD, Earth & Environmental Sciences, University of Waterloo, Waterloo, ON, Canada", "2006 - Honours BSc, Earth & Environmental Science (Sedimentology Specialization), McMaster University, Hamilton ON, Canada", "Philosophy of Teaching", "Dr. Rosamond's teaching philosophy focuses on (a) active learning techniques, including field and laboratory experience, and practical demonstrations in class, (b) building on the mathematical and chemical fundamentals in Earth Sciences.", "She is interested in adapting curricula to include experiential learning, focus on students' analytical skills, and to scaffold skills and concepts across courses in Earth & Environmental Sciences.", "Yizhi is a graduate student in Earth & Environmental Sciences at University of Waterloo, looking at groundwater contamination.", "Email: y278yuan@uwaterloo.ca", "The material is both qualitative and quantitative in nature and focuses on the circulation of water through the atmosphere, soil, groundwater aquifers, as well as looking at both the global fresh and marine water systems.", "Emphasis is placed on the physical aspects of hydrology, and the geologic and environmental factors that control the occurrence and cycling of water on Earth, as well as the impacts caused by population growth, contamination, urbanization or land use management, and climate change.", "View requirements for EARTH 123", "Describe the complexity and inter-connections of the global hydrological cycle;", "Apply basic qualitative techniques for describing earth systems processes related to water and water movements;", "Create and critique a simple water balance equation for a lake, river, or groundwater system;", "Introduce Yourself &", "All times are in China Standard Time.", "December", "Can be purchased through e-book sellers.", "These are a mix of multiple choice, matching, and mathematical questions.", "Surveys", "Discussions", "Notice of Recording", "We will assess what to do on a case-by-case basis."]}, {"course_id": 13, "course_code": "EARTH 221", "course_name": "EARTH221 - Introductory Geochemistry (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "EARTH 221", "EARTH 221 001", "EARTH 221 101", "RCH 306", "My PhD was completed in 2014 in nitrogen cycling and use of stable isotopes to understand N cycling in the Grand River, Ontario.", "EARTH 221:", "Introduction to environmental isotope geochemistry and radiometric dating.", "Basic aqueous geochemistry: pH, carbonate equilibrium, and common ions in natural waters.", "View requirements for EARTH 221", "Calculate basic geochemical parameters and create associated diagrams", "Identify applications of geochemistry for environmental problems/studies", "Present and discuss geochemical scientific literature", "Please read slides for Intro, element abundances, isotopes, chart of the nuclides, nucleosynthetic processes", "Highlights of Origin of Elements", "Periodic Table/Earth Formation", "Solar System geochemistry and planetary formation, composition of meteorites", "Chemistry of bulk Earth, atmosphere, oceans, crust, mantle, and core   A2 Misra p. 296 – 313, 326-344, 354-362", "Equilibrium constants, introduction to phase diagrams, basics of kinetics", "Basic concepts, laws of thermodynamics, Gibb's free energy.", "Igneous rock geochemistry", "A4 Misra p. 226 –  240, 310-313", "Introduction to Geochemistry.", "This grade includes:", "In groups of 4, you will present the findings of a recent scientific paper that includes some geochemistry.", "It is a closed book test.", "Typical question types may be multiple choice, interpreting diagrams, explaining concepts, and doing calculations (equations provided).", "Equations are provided and you should definitely bring a calculator.", "Notice of Recording", "Extensions and Accommodations", "Extensions and other accommodations will only be considered on a case-by-case basis.", "You are taking full responsibility for AI-generated materials as if you had produced them yourself: ideas must be attributed and facts must be true.", "In reference list:", "URL of the platform where the conversation took place]."]}, {"course_id": 14, "course_code": "EARTH 223", "course_name": "EARTH223 - Field Methods in Hydrology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrology Fall 2024", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "This course consists of field exercises and lectures designed to provide students with practical hands-on experience conducting a variety of hydrological monitoring techniques.", "This course is designed to provide hands-on field experience in the use of standard hydrologic monitoring techniques.", "The main objectives of this course are to use a variety of hydrologic data collection techniques in practical settings to answer hydrologic questions, identify the difficulty and importance of collecting good field data, and determine the accuracy/error of different measurement methods quantitatively and qualitatively.", "A Module will consist of two elements: (1) an activity in the field and (2) lecture and tutorial to review the fundamental concepts and discuss the data collected in the field.", "During each activity you will be working in groups of ~4.", "Assessment for each Module will consist of a pre-activity quiz administered on LEARN and an assignment that must be completed individually and uploaded to LEARN.", "Interpret the data in a hydrological context to explain groundwater/surface-water interactions, quantify water balances, and understand sources of contaminants found in water.", "Explain how drinking water in the Region of Waterloo is obtained, managed, and treated to ensure a safe and adequate supply.", "A Module will consist of two elements: (1) an activity in the field and (2) lecture and tutorial to review the fundamental concepts and discuss the data collected in the field.", "During each activity you will be working in groups of ~4.", "Assessment for each Module will consist of a pre-activity quiz administered on LEARN and an assignment that must be completed individually and uploaded to LEARN.", "Field Class Field Class Field Class Field Class", "Introduction (complete online)", "Sept 23**", "Sept 23**", "Sept 25**", "Sept 25**", "Oct 14**", "Oct 14**", "Oct 16**", "Oct 16**", "Oct 28**", "Oct 28**", "Oct 30**", "Oct 30**", "-", "Nov 25**", "-", "Nov 25**", "-", "-", "* complete virtually on your own", "***If possible", "These videos are designed to prepare you for the upcoming field activity and must be completed prior to the scheduled field activity time.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Must be uploaded as a single file", "Notice of Recording", "The field work is a critical part of this course and often you will be working in teams and so your lack of attendance may also result in some hardship for your group.", "You must be present for each field activity in order to get full credit for that activity  – unexcused absences will result in a 20% penalty for each missed field activity.", "For this reason, all students must complete WHMIS (Workplace Hazardous Materials Information System training) module before their first field activity session and provide proof of their training by uploading a picture of their form to DROPBOX.", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline).", "The policy can be found at: http://www.adm.uwaterloo.ca/infosec/Policies/policy33.htm", "Note on Avoidance of Academic Offences: Studying and working in groups to learn material can be a very valuable practice and is encouraged.", "Library for research-based assignments", "Strategies for learning online", "6 strategies for effective learning"]}, {"course_id": 15, "course_code": "EARTH 231", "course_name": "EARTH231 - Mineralogy (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "EIT 1013", "This course provides a systematic study of the physical and chemical properties of the major rock-forming silicate minerals.", "Study of mineral chemistry, the internal geometry of crystalline solids and the interrelationship of crystal structure to the physical and chemical properties of minerals.", "Laboratory work focuses on observing and evaluating the physical properties of minerals and rocks in hand sample in order to identity them.", "This course includes a weekend field trip to Bancroft, Ontario.", "During lectures you will develop a theoretical understanding of the physical and chemical properties of minerals, both as discrete solid phases and as members of mineral assemblages.", "The field trip will be a two day trip stopping at various field sites to look at rocks and minerals in and around the Bancroft area.", "Develop a theoretical understanding of the physical and chemical properties of minerals, both as discrete solid phases and as members of mineral assemblages", "During labs you will get hands-on experience observing, describing, and identifying rock and mineral specimens", "EIT 1013", "Course introduction/ Introduction to minerals", "Introduction to minerals: Con’t", "Lab 3 – Group meet up/contracts and Metamorphic Minerals", "Mineral chemistry", "Structure part 3: Classification of silicate structures", "Oct. 21", "Bancroft sample ID lab", "***midterm in class Thurs Oct 24***", "Digital Submission: Preliminary Group Report and sample ID chart", "Amphiboles", "Micas", "Students can find the Illness Self-declaration form in the Personal Information section of Quest.", "If the midterm is missed, a make-up midterm will be scheduled when appropriate by the instructor.", "Re-creating test questions and answers without the express permission of the course instructor", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "Everyone needs a support system.", "This resource lists includes general campus resources, as well as those focused on EDI-R and mental health.", "Sexual Violence Prevention & Response Office: https://uwaterloo.ca/sexual-violence-prevention-response-office", "An extensive list of campus resources can be found here: https://uwaterloo.ca/graduate-studies-postdoctoral-affairs/current-students/campus-resources-and-services", "Non-emergency Waterloo Regional Police Services - 519-653-7700"]}, {"course_id": 16, "course_code": "EARTH 232", "course_name": "EARTH232 - Introductory Petrography (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["EARTH 232", "DWE 1515", "B. Kendall", "08:30AM - 11:20AM EIT 1009", "EARTH 232 102", "08:30AM - 11:20AM EIT 1009", "Introduction to silicate phase equilibria and the use of mineral stability diagrams to understand petrogenetic processes.", "Laboratory work focuses on using a transmitted light microscope to study the optic properties of minerals in order to identify them as well as observe rock textures and interpret geological histories.", "View requirements for EARTH 232", "Describe how magmas form and evolve to produce a variety of common igneous rocks", "Show how the different agents and types of metamorphism lead to the formation of common metamorphic rocks", "Understand how to use simple phase diagrams to interpret the geological history of a rock", "Use mineralogy and texture to interpret the geological history of a rock", "Identify and describe minerals and textures using a petrographic microscope", "Classify igneous, sedimentary, and metamorphic rocks", "Relate common rock associations to plate tectonic settings", "Introduction", "Igneous: Magma Differentiation", "Igneous: Binary Solid Solution Phase Diagrams", "Igneous: Binary Eutectic & Peritectic Phase Diagrams", "Igneous: Ternary Phase Diagrams", "Igneous: Classification & Occurrence", "Igneous: Classification & Occurrence", "Metamorphic: Zones and Facies", "Metamorphic: Phase Diagrams", "Metamorphic: Classification and Occurrence", "Sedimentary: Classification & Occurrence", "Sedimentary: Classification & Occurrence", "Textbook: Earth Materials - Introduction to Mineralogy and Petrology, 2nd Edition.", "Cornelius Klein and Anthony Philpotts.", "Textbook: Introduction to Optical Mineralogy, 4th Edition.", "On reserve in Davis Library - 3 hour loan.", "Textbook: Principles of Igneous and Metamorphic Petrology, 2nd Edition.", "Each rock type can only be claimed by one student.", "Final Exam: The closed-book final exam will be in-person and scheduled by the registrar.", "This course includes the independent development and practice of specific skills, such as synthesis and poster presentation of information on a student's chosen rock type, and laboratory mineral and rock descriptions.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office: https://uwaterloo.ca/sexual-violence-prevention-response-office", "An extensive list of campus resources can be found here: https://uwaterloo.ca/graduate-studies-postdoctoral-affairs/current-students/campus-resources-and-services", "Non-emergency Waterloo Regional Police Services - 519-653-7700", "St. Mary's Hospital - 519-744-3311", "Kitchener-Waterloo Sexual Assault Support Centre - 519-741-8633", "Stratford General Hospital - 519-272-8210", "EDI-R STATEMENT"]}, {"course_id": 17, "course_code": "EARTH 235", "course_name": "EARTH235 - Stratigraphic Approaches to Understanding Earth's History (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["08:30AM - 09:50AM EV2 2002", "jwjohnston@uwaterloo.ca", "10:00AM -", "jwjohnston@uwaterloo.ca", "10:00AM -", "jwjohnston@uwaterloo.ca", "Department of Earth and Environmental Sciences in the Faculty of Science @UWaterloo.", "At the University of Waterloo, Dr. Johnston teaches numerous classes such as Earth 121 - Introductory Earth Sciences, Earth 235 - Stratigraphic Approaches to Understanding Earth's History, Earth 390 - Methods in Geological Field Mapping, and occasional graduate classes such as Earth 691 Special Studies for MSc Students (i.e. Coastal Geology).", "He is a board member for the University of Waterloo Earth Science Museum and representative for the Geological Association of Canada on the North American Commission on Stratigraphic Nomenclature (former chair and vice chair).", "Discussions", "Email", "But please indicate the course name and number and reason for the email in the subject line.", "An introduction to stratigraphic principles and methods used in deciphering geological history.", "Techniques of collecting surface and subsurface geologic data and representation of stratigraphic data.", "Procedures applicable to the classification and nomenclature of stratigraphic units using the North American Stratigraphic Code.", "The development of stratigraphic sequences as controlled by global and regional tectonics and sea level fluctuations.", "Laboratory work will include construction and interpretation of various types of learning media such as traditional maps, cross sections, new physical and digital models, as well as extended reality.", "Describe and illustrate perspectives and applications of stratigraphy.", "Understand and apply the classification and nomenclature of stratigraphic units.", "Debate preservation potential though space and time.", "Professional Geoscientists Ontario - Student Member", "The level of geoscience education in a bachelor of science degree is considered to meet the minimum knowledge requirements recommended by Geoscientists Canada for admission to practice professional geoscience and for interprovincial (and international) mobility.", "Readings", "Week 1: Introduction and Collecting Geologic Data", "Module 1: Introduction Earth 235 Course Outline", "Introduce Yourself Discussion", "1c Field Techniques", "1d Field Notebook", "Module 4: Facies and Correlation 3a Facies", "3b Correlation", "Module 5: Introduction to the Stratigraphic Code (and Lithostratigraphic Chart for southern Ontario page) 4a", "Week 7: Canada's Structures and Introduction to Sequence Stratigraphy", "Module 10: Introduction to Sequence Stratigraphy 7a Sequence Stratigraphy", "Week 8: Relative Time and Absolute Dating and Age of the Earth", "Module 12: Absolute Dating and Age of the Earth", "Therefore, Dr. Johnston has compiled a unique set of readings from a variety textbooks and online sources.", "Instructions", "A complete set of labs is provided in Learn for each student to complete and then submit to the Learn Dropbox.", "Please follow these steps for each lab:", "Note: Labs are expected to be submitted in a well-organized, neat and legible fashion.", "Deliverables", "Your lab assignment must be submitted in the following file type:", "Most word processing software applications will allow you to save your file as a PDF; however, if you require software to create PDFs, some free options are listed below:", "Email subject line must include the course number and code and name of the assessment.", "Please email the entire EARTH 235 Team, including the TAs and your instructor to inform the entire Team and receive a prompt response.", "Please make sure you are registered with AAS first", "Intellectual property includes items such as:"]}, {"course_id": 18, "course_code": "EARTH 238", "course_name": "EARTH238 - Introductory Structural Geology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Structural Geology Winter 2024", "EARTH 238", "03:30PM - 04:20PM", "EARTH 238 201", "changcheng.li@uwaterloo.ca", "EIT 1013", "changcheng.li@uwaterloo.ca", "EARTH 238 102", "EIT 1013", "changcheng.li@uwaterloo.ca", "*", "Discussions", "To the teaching team: This is a discussion topic for you to give suggestions to the teaching team and for them to know the questions you have.", "Concepts of stress and strain; elementary rock mechanics; description and classification of folds, faults, foliations, lineations and joints; use of primary structures; introduction to geometrical analysis.", "Labs will emphasize geometrical problems, including geological maps and cross sections, and stereographic projection.", "Understand the process in which various geological structures develop", "Perform kinematic analysis from some simple structures", "Record orientation data in the right format according geological convention", "Read a geological map and draw cross sections base on the map", "Use an equal-area net to conduct geometrical analysis", "iClicker Students can use either iClicker student App or iClicker remote Yes", "Basic Methods of Structural Geology.", "Students have to answer a question in a quiz correctly to get the mark.", "Examination regulations as outlined in the current UW undergraduate calendar are to be followed."]}, {"course_id": 19, "course_code": "EARTH 333", "course_name": "EARTH333 - Introductory Sedimentology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["04:00PM - 05:20PM", "RCH 204", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Students can expect a response within 48 hours from Monday to Friday.", "TAs will also be available during in-person laboratory sessions.", "An introduction to sediment properties, sedimentation processes, and sedimentary deposits in a variety of depositional environments and climatic conditions.", "View requirements for EARTH 333", "Know the main principles, concepts and approaches pertaining to the study of sediments and sedimentary rocks", "Know the main modern sedimentary environments", "Interpret past sedimentary environments from the sedimentary record", "Appreciate societal relevance of sedimentology and know some of the possible applications", "Sedimentology and Stratigraphy, 2nd edition / Gary Nichols Electronic course reserve.", "Principles of Sedimentology and Stratigraphy, 5th edition / Sam Boggs Course reserve.", "A team rep must inform their TA of the team members and team name.", "Dropbox folders with limited access will be created for each team and linked to the gradebook.", "Penalties for late submissions:", "Weekends and holidays will not count when determining a late submission penalty"]}, {"course_id": 20, "course_code": "EARTH 342", "course_name": "EARTH342 - Geomorphology and GIS Applications (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Geomorphology and GIS Applications Fall 2024", "changcheng.li@uwaterloo.ca", "04:00PM - 05:20PM", "changcheng.li@uwaterloo.ca", "Characteristics and development of various landforms (e.g. mountain belts, volcanoes, impact craters, and those created by erosion/deposition of rivers/glaciers) are introduced.", "Application of Geographic Information Systems (GIS) to Earth Sciences.", "Basic concepts of GIS and GIS applications in mineral exploration industry and in fieldwork are introduced.", "View requirements for EARTH 342", "Introduction to Geomorphology", "Various landforms and their development processes", "Introduction to ArcGIS", "Vector data model and raster data model", "Map projection and coordinate system", "Data input", "Basic applications of ArcGIS in mineral exploration and mining industry", "Spatial data analysis", "Interpretation of satellite image and air photos", "Introduction to ArcGIS", "GIS for Assessment report for a mineral exploration company", "Make a geological map", "Enhance contrast in colour between different rock units in Landsat satellite images", "One example of natural hazard assessment using spatial data analysis in ArcGIS", "Input and organize geographic data in ArcGIS and present them using maps", "Prepare base maps needed for geological field mapping", "Set up a web map for digital mapping in a group and collect data using mobile devices", "Make a geological map in ArcGIS based on field mapping data and interpretations", "Make drill hole location maps for assessment reports for a mineral exploration company", "Carry out basic spatial analysis to assess a natural hazard in a given scientific model and make maps to present spatial analysis results", "Examination regulations as outlined in the current UW undergraduate calendar are to be followed.", "In this course, the following will be considered as academic misconduct and unacceptable:", "Re-creating exam questions and answers without the express permission of the course instructor"]}, {"course_id": 21, "course_code": "EARTH 355", "course_name": "EARTH355 - Water: Data to Decisions (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["EARTH 355 - Water: Data to Decisions Winter 2025", "EARTH 355", "11:30AM -", "Please put \"Earth 355\" and issue in your email subject line.", "This course explores approaches for interpreting environmental data to support water decisions using theoretical and computational techniques.", "View requirements for EARTH 355", "In addition, approximately one case study will be provided each week as reading material with an instructor led discussion during this time.", "By the end of this course, you should be able to design a study to test a scientific hypothesis by:", "Identifying relevant statistical techniques", "Assessing results of statistical techniques to form a conclusion (using hand calculations & coding language)", "Acknowledging data uncertainty in statistical and mechanistic water models", "Compiling Data", "Identify and frame decisions", "Identify data requirements for making the decision", "Develop a database of the data", "Drinking Water Advisories in Nine First Nations in Ontario", "Compiling your Dataset", "Introduction to Jupyter Notebook and R", "Poster Development", "Context and Hypothesis", "Descriptive Statistics", "Develop tabular and graphical representations of data", "Calculate central tendency and variance in a variety of ways", "Identify when log transforms should be used for central tendency", "Calculate a z-score and explain what it means", "Environmental Flows and Minimum Desirable Streamflows", "Data Structure, Descriptive Statistics & Histograms", "Poster Development", "Introduction (literature review)", "&", "Calculate confidence intervals", "Calculate interval estimates", "4: Aggregate Development", "4: Plotting Univariate Data and Extracting information from Plots", "Poster Development", "3 & 4: Introduction and Data Presentation", "Define a hypothesis", "Test a mean", "Differences between two groups of data", "Estimating Risks from Exposure to Methyl mercury", "Functions and Confidence Intervals", "Poster Development", "Data and Methods", "Analysis of Frequency Data", "Test a hypothesis using χ2 test", "Assessing Relationships and Associations", "Loops and Hypothesis Testing", "Poster Development", "Data and Methods", "Identifying Temporal Trends", "Intensification of Algal Blooms", "Temporal patterns and probability of occurrence", "Plotting Categorical Data and the Chi-Square Test", "Poster Development", "Data and Methods", "Perform a nearest-neighbour analysis", "Nearest neighbor", "Local averaging", "Inverse distance weighting", "Explain the concept of kriging", "Identifying Spatial Trends", "Water contamination and cancer clusters", "Spatial patterns and interpolation", "Loading R packages, Plotting Bivariate Quantitative Data, and the Runs Test", "Poster Development", "Submit draft poster", "Spatial Mapping, Quadrat Analysis, and Nearest-Neighbor Analysis", "Poster Development", "Correlation Analysis & Regression Analysis", "Calculate Pearson product moment correlation coefficient (R)", "Calculate a simple linear regression using least squares criterion", "Describe how multiple regression analyses are different from single linear regression", "Correlation", "Correlation and Linear Regression", "Correlation and Regression", "Poster Development", "Methods and Results", "Trends & Fit Metrics", "Determine if a time series has a monotonic trend using Mann-Kendall or Sens Slope", "Identify appropriate fit metrics to assess data", "Trends", "Trends in baseflow across Canada", "Trends and Fit Metrics", "Poster Development", "Methods and Results", "&", "Introduction/Context - 15%", "Conclusions & Recommendations - 15%", "For the in-class activities, you will be given a worksheet to solve a problem related to the topic of discussion.", "The draft will be peer-marked using a rubric provided on LEARN.", "There will be one open question where you will be asked to discuss a perspective of one of the case studies we covered in class."]}, {"course_id": 22, "course_code": "EARTH 390", "course_name": "EARTH390 - Methods in Geological Mapping (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 2, "major_name": "Environmental Sciences - Geoscience Specialization (Bachelor of Science - Honours)", "topics": ["Methods in Geological Mapping Winter 2025", "jwjohnston@uwaterloo.ca", "These instructors co-teach this field-focused course and combine expertise to enrich this learning experience for all students.", "EMAIL", "But please indicate the course name and number and reason for the email in the subject line.", "Field study in Sudbury and Whitefish Falls areas.", "Geological and geotechnical field techniques, map construction, and report writing.", "View requirements for EARTH 390", "All online modules and quizzes and mapping exercise must be completed and submitted before leaving for the field portion of EARTH 390.", "This is to help prepare students for the field trip/work, establishing a common knowledge and skill base and field safety and etiquette.", "Students will also find that a Sedimentology course (Earth 333) will come in very useful, as we will be mapping in a metamorphosed sedimentary terrain.", "Part of this field experience is very special because students are given permission to map on Whitefish River First Nations (WRFN) land, an area of cultural significance to Indigenous Peoples and world-class exposure of rock.", "Observe and record a variety of different types of geological information in the field.", "Make decisions based on field observations.", "Construct a geological map using student collected field observations and measurement.", "Interpret geological maps.", "Professional Geoscientists Ontario - Student Member", "The level of geoscience education in a bachelor of science degree is considered to meet the minimum knowledge requirements recommended by Geoscientists Canada for admission to practice professional geoscience and for interprovincial (and international) mobility.", "An essential part of preparing for a fun and prosperous time in the field is learning and testing your knowledge before leaving for the field portion of Earth 390 in northern Ontario.", "This will help keep everybody safe and maximize learning in this unique field experience.", "Any student not completing these cannot attend the field portion of EARTH 390.", "The majority of student grades in EARTH 390 are assigned to the FIELD portion of this course.", "Let's have some fun combining and applying previously learned and new student knowledge and skills in EARTH 390!", "Igneous Rocks Quiz", "Structural Geology", "Structural Geology Quiz", "Geological Cross Sections", "Geological Cross Sections", "Health and Safety/Field Etiquette", "Health and Safety/Field Etiquette", "Emergency Situations and Mitigation Quiz", "Mapping Exercise", "Mapping Exercise", "Digital Geological Mapping Introduction to Digital Geological Mapping Technologies Monday, February 10, 2025 at 8:00 AM Thursday, March 27, 2025 at 4:00 PM Ungraded", "Online quizzes and mapping exercise are completed before the field trip/work.", "Regional geology exercises, local geology report and map, individual assessment and field notebook are completed during the field trip/work.", "Satisfactory completion of ALL ASPECTS of the course is required.", "Whitefish River First Nation", "Our active work toward reconciliation has involved deepening our relationship in Whitefish River First Nation community talks, visits in the field, a summary report describing land-based learning, student research, and University of Waterloo’s Earth Science Museum outreach programs in the WRFN Shawanosowe School.", "Equity and Inclusion", "This course includes the independent development and practice of specific skills in the geosciences.", "Library for research-based assignments"]}]