[{"course_id": 60, "course_code": "ECE 457A", "course_name": "ECE457A - Co-operative and Adaptive Algorithms (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Co-operative and Adaptive Algorithms Fall 2024", "ECE 457A", "E7 3343", "• Huda Diab Abdulgalil: Email hdiababd@uwaterloo.ca", "The course starts by addressing the ill-structured problems and need for computational intelligence methods.", "It introduces the concepts of heuristics and their use in conjunction with search methods, solving problems using heuristics and metaheuristics, constraints satisfaction.", "The course also introduces the concepts of co-operation and adaptations and how they are influencing new methods for solving complex problems.", "The course starts by illustrating how the concepts of co-operation and adaptation are manifested in nature and how such models are inspiring new types of solutions methods.", "Topics to be covered include search algorithms, game playing, constraints satisfaction, meta-heuristics, evolutionary computing methods, swarm intelligence, ant-colony algorithms, particle swarm methods, adaptive and learning algorithms and the use of these algorithms in solving continuous and discrete problems that arise in engineering applications.", "View requirements for ECE 457A", "Motivate the need for algorithms that exhibit a degree of intelligence: logical, computational, and biologically inspired.", "Introduce the concepts of cooperation and adaptations and how they are influencing new methods for solving complex problems.", "Illustrate the use of these algorithms in solving continuous and discrete, and machine learning problems", "Introduction: About this course, AI, Adaptation, Cooperation, goals and definitions of artificial intelligence;", "ill-structured problems and need for approximate algorithms, cooperation and adaptation in nature.", "Search: state space problem formulation and representation;", "use of heuristic search methods and meta-heuristic algorithms", "Trajectory Methods: Tabu search", "Engineering use cases", "Engineering use cases", "Mathematical Models of Genetic Algorithms", "Introduction to Swarm Intelligence: cooperation and adaptation methods inspired by nature.", "Engineering use cases", "Engineering use cases", "Evolutionary Programming: Continuous and Discrete EP", "Finite State Machine Optimization", "Evolutionary Strategies", "Self-Adaptive Evolution Strategies", "Introduction to evolutionary computing Introduction to evolutionary computing, by Eiben and A, Smith, J.E, Springer, Berlin, 2003.", "Search and Optimization by Metaheuristics Techniques and Algorithms Inspired by Nature Search and Optimization by Metaheuristics Techniques and Algorithms Inspired by Nature Ke-Lin Du, M. N. S. Swamy No", "Search Algorithms Types: Breadth and Depth First Search Algorithm Search Algorithms Types: Breadth and Depth First Search Algorithm Merium Hazem Anwar Labib Bishara, Merihan Hazem Anwar Labib Bishara No", "**The lecture notes are copy-right protected material.", "Such behaviour includes:", "Adhering to the principles of academic integrity when conducting and reporting research.”"]}, {"course_id": 61, "course_code": "ECE 457B", "course_name": "ECE457B - Fundamentals of Computational Intelligence (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Fundamentals of Computational Intelligence Winter 2025", "ECE 457B", "Monday, Friday -", "10:00AM - 11:20AM E7 5353", "04:00PM - 05:20PM", "Da Saem Lee : ds3lee@uwaterloo.ca", "Communication and Discussion", "If you really have a critical time issue, or you don't want the TA's to see the message (for any reason at all), then you should send Prof. Crowley a direct message on Teams chat in addition to email.", "Model-based prediction and classification.", "Multiple examples and case studies such as autonomous driving, intelligent manufacturing, natural language understanding, speech recognition, computer vision, stock market prediction, disease early detection and diagnosis.", "View requirements for ECE 457B", "It encompasses a broad spectrum of supervised learning topics, including nonparametric and parametric models, linear and nonlinear approaches, deep learning paradigms, and probabilistic models.", "Theoretical knowledge is translated into practice through tutorials on industry-standard tools such as PyTorch and Keras.", "Interactive classroom discussions will pivot around both the practical trade- offs inherent in real-world applications and the theoretical underpinnings that provide an intuitive grasp of the field.", "These topics are an outline, and each year some subset of non-core topics will be skipped due to time constraints and in order to benefit students through deeper focus.", "Classification I", "Distance based - k-Nearest Neighbours (kNN)", "Fundamentals of Parameter Estimation and Learning", "MAP Implementation as Classification: Naive Bayes Algorithm", "Dimensionality Reduction and Manifold Learning", "Vector Embeddings : TF-IDF, Word2Vec, BERT", "Kernel Methods and Latent Models", "k-Means Algorithm, DBScan Algorithm", "Anomaly Detection: Classification, Outlier, Density, and Isolation based", "Classification III : Data, Image and Time-series classification using Deep Learning", "Representation Learning II: Auto-encoders and Variational Auto-Encoders", "Attention and Transformer Networks", "Some additional information and links might be here for older courses.", "A visual grading tool for pdfs submissions of tests and assignments, allows limited online test with mark-down text entry and multiple choice questions.", "Some assignments and tests might be made available online for submission using this tool as well.", "Arxiv Tutorials - pdfs will be posted to hypothes.is and others links will be provided to a number of detailed tutorials on some course topics.", "The first half covers many of basics of this course, while the second half focusses on Deep Learning only.", "Exams", "Completing the assignments will require multiple skills:", "familiarity with statistical, probabilistic analysis of data and results", "logical design and clear description of a expeirmental methodology", "programming various algorithms for processing, training and analysis of data to achieve given tasks (programming will be in Python using libraries such as sci-kit learn and tensorflow, pytorch, pandas)", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 62, "course_code": "ECE 457C", "course_name": "ECE457C - Reinforcement Learning (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["04:00PM - 05:20PM E7 4043", "Introduction to reinforcement learning (RL) theory and algorithms for learning decision-making policies in situations with uncertainty and limited information.", "Suggested Background", "The course will use some concepts from ECE 203 and ECE 307 on Bayesian Probability and Statistics, these will be reviewed but familiarity will help significantly.", "All other concepts needed for the course will be introduced directly.", "Identify and Explain the component theoretical concepts of Reinforcement Learning systems.", "Evaluate the performance of a particular RL system on a given domain through proper experimental design, statistical analysis and visualization", "Assess and critique the applicability of general RL concepts and specific RL algorithms to various problem tasks in Data Science, Artificial Intelligence, Planning, Control, and Machine Learning.", "Motivation and Context", "Importance of reasoning and decision making about uncertainty.", "Decision making under uncertainty:", "Theory, Bellman equations", "Value Iteration, Policy Iteration", "Other variants of these", "Value Function Approximation", "supervised training, back-propagation", "Experience replay buffers, mini-batch training and other methods of training and architecture", "Actor-Critic methods", "Decision Transformers", "Other Uses of RL Concepts", "Human Preference Elicitation - especially for Foundation Models and Large Language Models", "Moral Psychology - theories on human moral reasoning rely heavily on RL concept", "Wrap-up and Review", "Dimitrakakis2019", "Once you get through the first half of our course, many of the concepts on this site will be familiar to you.", "Family Tree of Algorithms - Here, a list of algorithms at the cuttingedge of RL as of 1 year ago to so, so it'sa good place to find out more.", "But in a fast growing field, it may be a bit out of date about the latest now. https://spinningup.openai.com/en/latest/spinningup/rl_intro2.html", "Piazza : ECE457C Discussions - TBD", "A visual grading tool for pdfs submissions of tests and assignments, allows limited online test with mark-down text entry and multiple choice questions.", "Some assignments and tests might be made available online for submission using this tool as well.", "Assignment will involve a mixture of short answers, mathematical solutions, programming in python and reporting of results of performance and outcomes of trained RL policies on provided simulated environments.", "Recipe for success:", "University can be a challenging environment and it is normal to need support from time-to-time.", "see these slides on university policy for COVID-19 safety once in-person classes begin again.", "If the student has a medical reason why they cannot wear a mask they should contact the professor electronically and provide proof of this.", "Whena student asks or answersa question it may be difficult for them to be heard while wearing a mask.", "Students can find the Illness Self-declaration form in the  Personal Information section of Quest.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 63, "course_code": "ECE 458", "course_name": "ECE458 - Computer Security (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Notice of Recording", "Monday, Friday -", "10:00AM - 11:20AM E7 4043", "04:00PM - 05:20PM E7 4043", "07:00PM - 07:50PM E7 4043", "ECE 750 001", "Monday, Friday -", "10:00AM - 11:20AM E7 4043", "04:00PM - 05:20PM E7 4043", "Dr Kami Vaniea", "Cameron Hadfield <cmlhadfield@uwaterloo.ca>", "Introduction to computer security.", "Models of security.", "Software security, vulnerabilities, threats, defenses and secure-software development processes.", "Secure design principles, techniques and security evaluation.", "ECE 750:", "If these are used, the instructor will make a best effort to record the lecture.", "Conflicts with these time slots are fine and should not prevent a student from doing well in the course.", "Recognise common security threats against computer systems and know the basic mechanisms to address them", "Think critically about security threats using the STRIDE model and break down the concept of \"security\" into its component parts", "Know the most common programming flaws and how they can manifest in code", "Explain what the lock icon near the URL bar means (or the \"connection is secure\" in Chrome)", "Read a URL correctly and learn why doing so in all cases is nearly impossible for humans", "Explain what a cookie is and why it gives people more control than advertising codes used by mobile phones", "Basics of Security - Thinking about security in a structured way (CH1)", "Trust and threat model", "Running example of HTTPS", "Introduction to Usable Security and Privacy", "Access control concepts", "Password based authentication", "Multi-factor authentication and passwordless authentication", "Kerberos and open-authorization", "Introduction to phishing (scam) attacks", "Cryptography Basics (CH2.3)", "Pseudorandom generation", "Symmetric-key vs Asymmetric cryptography", "Public-key cryptography and digital signature", "Malicious code - Malware", "Memory security", "Basics of network securityThis is", "Firewalls and VPN", "Security of IEEE 802.11 and 4G-LTE/5G", "Attacks on clients and servers", "Email security", "Applications", "Schneier on Security http://www.schneier.com/blog/ A blog covering current computer security and privacy issues.", "The lab contains many hand-on experiments and some crafted attacks can be launched under their speciﬁc environment for better understanding them.", "The instructor and/or TAs may use custom internally developed scripts to check for high overlap between coursework submissions.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 64, "course_code": "ECE 459", "course_name": "ECE459 - Programming for Performance (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["ECE 459", "Monday, Friday -", "08:30AM - 09:50AM E7 5353", "04:00PM - 05:20PM", "Monday, Friday -", "04:00PM - 05:20PM", "11:30AM -", "07:00PM - 07:50PM E7 5353", "07:00PM - 07:50PM E7 5353", "About Prof. Zarnett", "Then I got the AIF in the mail and decided I didn't want to study Computer Engineering after all.", "I'm an Associate Professor of Electrical and Computer Engineering.", "Some of you will know me as the previous Director of Software Engineering from back when you were in 1A. I studied math/CS yet convinced PEO to license me as a P.Eng.", "My research interests focus on using compiler and static analysis techniques to ensure program correctness.", "The LI is responsible for technical matters related to the assignments: git.uwaterloo.ca, git in general, administering the systems where you need to run your labs.", "And I enjoy engaging in discussions about these fields.", "Thanushon Sivakaran <tsivakar@uwaterloo.ca>", "Profiling computer systems; bottlenecks, Amdahl's law.", "View requirements for ECE 459", "Many modern software systems must process large amounts of data, either in the form of huge data sets or vast numbers of (concurrent) transactions.", "This course introduces students to techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs.", "These techniques will enable you to design and build critical software infrastructure, especially in an age of Big Data.", "While you may have seen some of these ideas in the context of operating systems (ECE350/SE350/CS350/MTE241) and concurrency (ECE252/CS343), this course gives you tools to make code run faster.", "Design and apply techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs.", "We intend to use these slots until we reach the end of the course material.", "The notes cite a number of sources, some of which are useful books.", "Rust familiarization and use of nonblocking I/O;", "Auto‐grading and auto‐feedback systems, including marmoset, may be used for the evaluation of some of your assignments.", "Acceptable collaboration includes discussing ideas and structures with others, as well as helping others debug their code.", "If your code is too close in structure to someone else's code, you are going to have a problem.", "Or, let's sum this up in two short instructions:", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, ChatGPT) and how such tools can be used to write and test code.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be diﬃcult to interpret on a discussion forum.", "The human visual system has evolved to perceive saber‐toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text‐mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 65, "course_code": "ME 262", "course_name": "ME262 - Introduction to Microprocessors and Digital Logic (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Notice of Recording", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "02:30PM - 03:20PM", "Number systems, logic gates, Boolean algebra.", "Karnaugh maps and combinational logic design.", "Sequential logic and state machines.", "Microcomputer structure and operation, I/O and interfacing.", "A calendar change to make the updates official is currently being processed:", "Number systems, logic gates, Boolean algebra.", "Karnaugh maps and combinational logic design.", "Sequential logic and state machines.", "Microcontroller I/O and interfacing.", "Use logic gates and common circuit blocks to build and analyze combinational logic circuits", "Explain different number systems and convert between bases, in particular decimal and binary and decimal and hexadecimal, which are commonly used in digital systems", "Manipulate and simplify circuits using Boolean algebra and Karnaugh maps", "Build control circuits using relays and basic electronic components", "Implement digital logic using industry grade tools such as Programmable Logic Controllers (PLC) and system simulations", "Develop and use state machines to implement and analyze sequential circuits", "9/4", "Introduction, Basic gates", "9/9", "Boolean algebra", "9/16", "Karnaugh maps, Number systems", "9/30", "Encoders and decoders, midterm review", "10/28", "Sequential logic", "Sensors and sensor technology", "Microcontrollers", "While a cell phone can be used, a device with a larger screen will give you a better experience.", "Exercises are not handed in; however, completion of these problems will allow you to regularly test and reinforce your comprehension of the concepts and analysis techniques presented throughout the term.", "In the case of an emergency, you must contact the instructor as soon as possible after the emergency has been dealt with.", "Can I reuse material from previous lab submissions?", "No, you must start with a blank page and redo the labs as though you are completing them for the first time.", "Exams", "The weight of the examination will not be changed", "**", "Notice of Recording", "In case of shutdown of in-person activities, the following arrangements will take place:", "Discussions and questions", "This course includes the independent development and practice of specific skills, such as using digital logic to solve problems and PLC implementations.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 66, "course_code": "ME 559", "course_name": "ME559 - Finite Element Methods (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Finite Element Methods Fall 2024", "03:30PM -", "DWE 2402", "Email: kinal@uwaterloo.ca", "Name: Johann Barry Scheepers", "Email: jbscheepers@uwaterloo.ca", "A course presenting the fundamental ideas involved in conventional finite element analysis in mechanical engineering.", "Interpret the philosophy behind principles, design and modelling considerations in using the finite element method (FEM).", "Derive the equations of motion from interpretations of various physical systems (trusses, beams, plates, etc.)", "Obtain analytical solutions to simple finite element problems (e.g., static truss networks).", "Develop an understanding of commercial finite element software packages (ANSYS, ABAQUS, etc.) for use in linear-elastic equilibrium problems and modal analyses.", "Communicate the most important methods, results and conclusions in a brief technical report.", "- Concept of stiffness analyses for simple spring systems", "- direct equilibrium approach", "- application of boundary conditions", "- solution of linear algebraic equations", "- discretization and interpolation", "- element stiffness equations using virtual work formulation", "- assembly into global stiffness equations", "- boundary conditions and solution", "- post-processing for strain and stress", "- higher order elements", "- meshing practice", "- convergence studies", "- imperfection analyses", "- solvers", "Thermal and fluid flow analysis:", "Basic Introduction No", "Advanced No"]}, {"course_id": 67, "course_code": "ME 566", "course_name": "ME566 - Computational Fluid Dynamics for Engineering Design (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Notice of Recording", "Computational Fluid Dynamics for Engineering Design Fall 2024", "01:30PM - 03:20PM", "DWE 2402", "Current lecture delivery plans", "All lectures will be recorded and made available on Learn, unless there is a technical issue preventing the recording.", "A course to develop the understanding required to simulate complex fluid flows, such as those found in turbo-machines, duct systems, and other engineering hardware.", "Course topics include the physics of complex viscous fluid flows, first- and second-order finite control volume discretization methods, iterative algorithms for the solution of sparse matrix equation sets, including multi-grid acceleration, boundary condition modelling, two-equation and Reynolds stress turbulence models, and grid generation techniques.", "Computational fluid dynamics software is used throughout the course to simulate and analyze complex fluid flows relevant to engineering applications.", "Introduce the major approximations implied in CFD analysis of complex turbulent flows and the methods for controlling the resulting errors.", "Develop a familiarity with the steps required to complete a flow analysis project: (c) Communicate the findings of a CFD analysis in a complete and concise report", "Develop an enriched understanding of the physics of complex fluid flows: (a) Analyze a simulated or measured flow field to determine the most significant flow processes using quantitative analysis [", "Introduce the major approximations implied in CFD analysis of complex turbulent flows and the methods for controlling the resulting errors: (a) Describe the basic computational methods used to obtain a solution and the relationship between CFD model specification and the CFD simulation", "Develop an enriched understanding of the physics of complex fluid flows: (a) Analyze a simulated or measured flow field to determine the most significant flow processes using quantitative analysis [", "Develop an enriched understanding of the physics of complex fluid flows: (c) Select an optimal flow design from a set of flow design alternatives", "Develop an enriched understanding of the physics of complex fluid flows: (b) Identify how the significant flow processes impact flow design performance", "Introduce the major approximations implied in CFD analysis of complex turbulent flows and the methods for controlling the resulting errors: (b) Generate a CFD simulation.", "(c) Evaluate a CFD simulation to determine the sensitivity of the simulation to the model components and parameters", "Introduce the major approximations implied in CFD analysis of complex turbulent flows and the methods for controlling the resulting errors: (c) Evaluate a CFD simulation to determine the sensitivity of the simulation to the model components and parameters.", "1.3 Application to a simple pipe network", "1.4 Role of goal in CFD simulation process", "2.2 Boundary conditions", "2.3 Tutorial", "The Governing Equations of Fluid Dynamics", "3.1 Flow kinematics", "3.2 Conservation of mass", "3.3 Conservation of momentum", "3.4 Generic form of governing equations", "4.1 1-D steady-state diffusion", "4.2 Example", "5. Convection-Diffusion problems", "5.1 steady 1-D equation - no source", "5.3 Upwind Differencing Scheme", "Solution of discretized equations", "6.1 Direct methods", "6.2 Indirect methods", "6.3 Multigrid methods", "7.1 Implicit vs Explicit scheme", "7.2 Implicit Scheme", "7.3 Explicit Scheme", "Turbulence models", "8.2 Reynolds averaged Navier Stokes equations", "8.3 Eddy viscosity models", "8.4 Wall corrections", "8.5 Advanced models", "An Introduction to Computational Fluid Dynamics: The Finite Volume Method, 2nd Edition, H.K. Versteeg and W. Malalasekera, 2007, Pearson Prentice Hall.", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as learning a new CFD package and in-depth understanding of the models and numerical methods with their limitations used in CFD.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 69, "course_code": "MSE 342", "course_name": "MSE342 - Principles of Software Engineering (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Principles of Software Engineering Winter 2025", "Topics include software development processes, requirements gathering and analysis, software design, specifications, estimation, scheduling, revision control, software testing, deployment, and team behaviour.", "View requirements for MSE 342", "Agile software development.", "Agile values and principles", "User role modeling", "Gathering and estimating user stories", "Integration tests (Cypress)", "Software refactoring", "Managing complex state logic in React using Redux and Context API", "Know the principles of Agile software development.", "Know the limitations of the Waterfall approach to software development.", "Be able to perform software version control in a team project.", "Week 1: Introduction to Agile", "Week 2: Scrum methodology: Roles and responsibilities", "Week 8: Managing complex states with Redux and React-Redux.", "Advanced Redux concepts.", "Justice J. Outside-In React Development: A TDD Primer.", "Teams are responsible for testing, debugging and deploying their own code.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 70, "course_code": "MSE 343", "course_name": "MSE343 - Human-Computer Interaction (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Human-Computer Interaction Fall 2024", "10:00AM - 11:20AM QNC 2502", "10:00AM - 11:20AM QNC 2502", "11:30AM - 12:20PM QNC 2502", "This course is designed to provide in-depth exposure to the concepts of human-computer interaction and methods of interactive information system design.", "The course will focus on techniques for building information systems that meet human needs and capabilities by following a system development lifecycle: user requirements analysis, information and interaction design, prototyping and evaluation.", "View requirements for MSE 343", "Explain and justify the benefits and drawbacks of user-centred design", "Describe guidelines and models that can be applied to interface design", "Apply a variety of methods to involve the people who use an application in the design process", "Evaluate the usability of an interface", "Explain and justify the benefits and drawbacks of user-centred design 1 KB c) Demonstrate understanding of engineering fundamentals.", "Describe guidelines and models that can be applied to interface design 1 KB d) Demonstrate understanding of specialized engineering knowledge", "Apply a variety of methods to involve the people who use an application in the design process 4 Des b) Generate and implement solutions to complex open-ended problems", "Evaluate the usability of an interface 4 Des c) Evaluate/test solutions and refine designs to better meet requirements", "Process and Requirements", "Introduction to HCI Chapters 1 & 9", "User-centred design Course Notes", "Gathering Requirements and Task-centred design Chapter 10", "Designing Alternatives + Prototyping", "Interface Types & Graphical screen design Chapter 6", "Evaluate", "Evaluating Interfaces with Users: Qualitative Methods Chapters 13 & 7", "Analytical Evaluation: Heuristic Evaluation & Fitts’ Law Chapter 15", "Social & Emotional Interaction Chapter 4 & 5", "Psychology of everyday things & Cognition Chapter 3 & Notes", "Interaction Design: Beyond human computer interaction, 4th edition.", "You will be working in a team of three to five for all these milestones.", "There will be a set of online and in-person activities taking the place of the lab session in this course.", "You can complete these by simply attending class and participating in the activities; there will be a time limit to submit your materials.", "Up until the date of the final exam, you may submit any submitted material for regrading under the following conditions:", "(Ask them first!)", "Extensions", "No extensions will be given after a submission date.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 72, "course_code": "MSE 446", "course_name": "MSE446 - Introduction to Machine Learning (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Introduction to Machine Learning Winter 2025", "04:00PM - 05:20PM", "Topics covered may include data cleaning and transformation, overfitting and generalization, n-fold cross validation, regression, decision trees, neural networks, rule finding, and clustering.", "View requirements for MSE 446", "Problem Analysis]", "Jan. 6   Introduction", "Mar. 31   Advanced topics", "Apr. 2   Advanced topics", "https://web.stanford.edu/~jurafsky/slp3/ Includes language models No 0", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 73, "course_code": "MSE 541", "course_name": "MSE541 - Search Engines (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["09:00AM - 09:50AM CPH 3681", "Topics include design and construction of retrieval systems, retrieval models, and evaluation of search engines.", "Search engines and recommendation systems are prevalent in society.", "Recommendation systems are a variant of search engines and are often found in shopping and media sites, e.g. Amazon, TikTok, Spotify, YouTube, and Netflix.", "The methodology for optimization and evaluation, as covered in the course, is applicable to both classical and the most modern of retrieval methods.", "The majority of the homework assignments require software design and implementation based on high level requirements and algorithms.", "The programming assignments are cumulative and require working software from the previous assignment to make the subsequent assignment also work.", "Course prerequisites are MSE 240 (Algorithms and Data Structures) and MSE 251 or MSCI 252 (Probability and Statistics for Engineers) but as a 500 level course, students need to be comfortable with less structure and higher expectations for self-regulated learning.", "Past experience has shown that students who are weak in their information systems skills, in particular computer programming, have significant difficulty with course expectations.", "In other words, your average in your introduction to programming and algorithms and data structures courses should be 80 or higher, and you should enjoy the process of computer programming.", "Identify, explain, and implement the key components of a search engine.", "Explain the advantages and disadvantages of in-situ, online, and offline evaluation methods.", "Make and justify decisions based on the outcome of experiments using statistics.", "Design and implement a search engine and evaluation framework.", "Design and conduct an experiment to test a proposed system change.[Des]", "Evaluation", "Retrieval Models", "Plagiarism software and alternatives: Plagiarism detection software will be used to screen assignments in this course.", "UW-Learn and Campuswire", "Please feel free to email the instructor and request an appointment.", "Failure to follow these classroom rules will result in a 3 stage escalation process:", "Do not contact the instructor by phone except in the case of emergency.", "Do not “drop in for a quick question”.", "No material may be copied from any source except when you must copy something as part of your answer, and in these cases, you must quote the copied material and cite the source.", "As much as possible, discussions of computer programs should be at the level of pseudo-code and not at the level of real computer code.", "Working in groups can be a great way to learn material better and faster.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 75, "course_code": "MSE 546", "course_name": "MSE546 - Advanced Machine Learning (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Advanced Machine Learning Winter 2025", "The course first reviews supervised and unsupervised learning methods, and then dives deeper into their assumptions, mathematical models, and underlying algorithms to help students systematically develop and enhance ML processes.", "View requirements for MSE 546", "Recognize and develop the mathematical background necessary to formulate and analyze advanced machine learning models", "Contrast supervised and unsupervised machine learning models, and examine common models that fall into these categories.", "Analyze learning models based on performance metrics", "Design and develop machine learning models (including neural network-based models) for a real-world learning task", "Understand and critique the limitations of contemporary machine learning models", "Introduction Course Logistics", "Math Background ML intro and Probability, Statistics and Information Theory", "Math Background Linear Algebra and Optimization in ML", "Supervised Deep Learning Deep Neural Networks for Tabular Data", "Supervised Deep Learning Deep Neural Networks for Images", "Supervised Deep Learning Deep Neural Networks for Sequences", "ML Training Considerations Training and Evaluating ML Models", "Non-Parametric Methods k-Nearest Neighbor", "Non-Parametric Methods Decision Trees", "Non-Parametric Methods Ensemble Methods", "Advanced Topics Real-world non-idealities: Dealing with limited data, bias, and fairness", "Advanced Topics Bandit models and Reinforcement Learning", "PiML1] Available for free under CC-BY-NC-ND license at https://probml.github.io/pml-book/book1.html Yes 0", "There may be a slight change in these dates as the course progresses.", "This flexibility allows us to create a balanced and productive environment for everyone involved.", "Each member needs to make a separate submission, where information on collaboration is clearly stated.", "They can be reached during their oﬃce hours in addition to requests on course communication platforms.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 76, "course_code": "MTE 204", "course_name": "MTE204 - Numerical Methods (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Numerical Methods Fall 2024", "MTE 204", "MTE 204 001", "08:30AM - 10:20AM E7 3343", "09:30AM - 10:20AM E7 3343", "Both online and in-person meetings will begin in the second week of the course.", "MTE 204:", "Number systems and machine errors; roots of non-linear equations; matrix calculations; Eigenvalue and Eigenvector calculations; interpolation and approximation; numerical integration and solution of ODE's (linear and non-linear) and systems of ODEs; calculation of series; solution methods for PDE's; use of numeric and symbolic computing tools.", "View requirements for MTE 204", "This course applies numerical methods to solve complex engineering problems where exact analytical solutions are impractical.", "MTE 202 - Ordinary Differential Equations is a pre-requisite course for MTE 204.", "MTE 100 – Introduction to Mechatronics Engineering", "MATH 115 - Linear Algebra", "MATH 116 - Calculus I", "MTE 111 – Introduction to Materials", "MTE 119 - Statics", "MTE 219 - Mechanics of Deformable Solids", "SYDE 182 - Dynamics", "Develop and implement algorithms for solving linear algebraic equations, utilizing techniques such as Gaussian elimination, LU decomposition, and iterative methods.", "Construct and evaluate curve fitting models using interpolation and regression techniques to approximate data and make predictions (1,2,3,4,5).", "Apply numerical techniques to partial differential equations (PDEs) using methods such as finite difference, finite element, and finite volume methods, and interpret the results in the context of engineering problems (1,2,3,4,5).", "The numbers in the parathesis refer to the Engineering Graduate Attributes defined by the Canadian Engineering Accreditation Board (CEAB):", "A knowledge base for engineering: Demonstrated competence in university-level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "Problem analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, and economic, environmental, cultural, and societal considerations.", "Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking, and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Impact of engineering on society and the environment: An ability to analyze social and environmental aspects of engineering activities.", "Such ability includes an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society, the uncertainties in the prediction of such interactions, and the concepts of sustainable design and development and environmental stewardship.", "Life-long learning: An ability to identify and to address their own educational needs in a changing world in ways sufficient to maintain their competence and to allow them to contribute to the advancement of knowledge.", "MTE 204-Fall 2024-Schedule of Course Activities and Assessments", "Make-up lectures are held in E7-3343 on Mondays and Tutorial on Tuesdays in E5-3102 on the dates and times indicated below.", "FRI", "8:30-10:20", "8:30-10:20", "8:30-10:20", "8:30-10:20", "8:30-10:20", "8:30-10:20", "8:30-10:20", "8:30-10:20", "Study Day", "Study Day", "Fall 2024 - MTE204 - Numerical Methods -Course Topics", "Modeling Computers and Error Analysis Part 1", "Approximation and Round-Off Errors Chapter 3", "Error definition & Round-off errors 3.3", "Roots of equations; Graphical methods 5.1", "Bracketing method for root finding: Bisection method 5.2", "Open methods for root finding: Fixed point & Newton Raphson 6.1, 6.2", "Secant method & Numerical root-finding: an engineering application 8.4", "Linear Algebraic Equation Part 3", "Systems of linear equations – Introduction & Naive Gauss elimination PT3.1-PT3.3, 9.1, 9.2", "Elimination Pitfall & Improving Techniques: pivoting and scaling  9.3, 9.4", "Special matrices; Gauss-Seidel & its improvement techniques 11.1, 11.2", "Least-Square Regression Chapter 17", "Linear regression and Linearization of nonlinear relationships 17.1", "Numerical Differentiation and Integration Part 6", "Integration of Equations Chapter 22", "Ordinary Differential Equations Part 7", "Euler’s method & its improvements 25.1, 25.2", "Ordinary Differential Equations Part 7", "General methods for boundary value problems 27.1", "Case Studies: Ordinary Differential Equations  Chapter 28", "Examples/Applications 28.1-28.4", "Introduction to finite difference method and finite volume method PT8.1-PT8.2", "Finite Difference: Elliptic Equations Chapter 29", "Solution techniques 29.2", "Boundary conditions  29.3", "Finite Difference: Parabolic Equations Chapter 30", "The heat conduction equation  30.1", "A simple implicit method  30.3", "Frank-Nicolson method 30.4", "Introduction to FEM: The general approach  31.1", "Major Exams: Both midterm and final exams are closed-book with a formula sheet permitted.", "Quizzes: The online quizzes will help you to solidify your understanding of the fundamental concepts.", "Sexual Violence Prevention & Response Office (SVPRO) supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 77, "course_code": "MTE 241", "course_name": "MTE241 - Introduction to Computer Structures and Real-Time Systems (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Introduction to Computer Structures and Real-Time Systems Fall 2024", "08:30AM - 09:20AM E7 3343", "08:30AM - 10:20AM E7 3343", "M. Cooper-Stachowsky", "MTE 241 202", "M. Cooper-Stachowsky", "M. Cooper-Stachowsky", "11:30AM -", "12:20PM E7 3343", "All software and also the law and ethics course one time -- let's discuss contract law if you're up for it?", "Mike Cooper-Stachowsky -- mstachowsky@uwaterloo.ca", "Introduction to computer organization, basic real-time concepts, process management, interprocess communication and synchronization, memory management, resource management, interrupt handling, concurrent programming, file systems.", "View requirements for MTE 241", "Describe the basic components of a computer system [KB(I)]*", "Perform Memory-Mapped I/O [KB(D)]", "Program a real-time application with multiple coordinated tasks [Des(D),Tools(D)]", "STM32F401RE Nucleo Board A microcontroller board for the labs.", "A Practical Introduction to Real-Time Systems For Undergraduate Engineering It's the textbook, available free in PDF form: https://ece.uwaterloo.ca/~dwharder/icsrts/Lecture_materials/A_practical_introduction_to_real-time_systems_for_undergraduate_engineering.pdf No", "Available for free in PDF form: https://github.com/jzarnett/mte241/ Yes", "You should purchase this board well in advance of the first lab and install the STM32CubeIDE software to test that it works.", "A small number of lab computers will have the software installed for your use.", "You will use the STM32F401RE microcontroller board and the STM32CubeIDE to write a real-time operating system in the C language.", "The questions are designed to test your understanding of the concepts you should have learned in the lab.", "Exams are in-person, closed-book.", "This paper must be a standard letter size.", "Laptop and Device Policy: The human visual system has evolved to perceive saber-toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text-mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "In either case, we will cancel all the in-person lectures and in-class exercises during the relevant period and try to have some online synchronous video lectures during that period.", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, Chat- GPT) and how such tools can be used to write and test code.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 78, "course_code": "MTE 262", "course_name": "MTE262 - Introduction to Digital Logic (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Notice of Recording", "Introduction to Digital Logic Winter 2025", "02:30PM - 03:20PM", "E7 3343", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "Number systems, logic gates, Boolean algebra.", "Karnaugh maps, and", "Implementation of combinational and sequential logic circuits on Field Programmable Gate Arrays (FPGA) boards.", "Sequential logic and state machines.", "Use logic gates and common circuit blocks to build and analyze combinational logic circuits", "Explain different number systems and convert between bases, in particular decimal and binary and decimal and hexadecimal, which are commonly used in digital systems", "Manipulate and simplify circuits using Boolean algebra and Karnaugh maps", "Implement digital logic using industry grade tools such as Field Programmable Gate Arrays (FPGAs), Programmable Logic Controllers (PLC) and system simulations", "Develop and use state machines to implement and analyze sequential circuits", "1 Introduction to Digital Logic", "3 Introduction to VHDL", "5 Boolean Algebra", "7 Number Systems", "9 Sequential Circuits", "W11 (Mar-25) PLC Introduction + Simulation", "While a cell phone can be used, a device with a larger screen will give you a better experience.", "The only exception to this rule is under extenuating circumstances, accommodations and submission of VIF (in case of illness).", "The only exception to this rule is under extenuating circumstances, accommodations and submission of VIF (in case of illness).", "There will be a total of 5 labs, where you will work in groups and will take place in-person in E7 – 3419.", "No extensions are allowed in submission of labs except under extenuating circumstances, accommodations and in case of approval of Verification of Illness.", "Exams", "**", "Do I have to do the labs again?", "Can I reuse material from previous lab submissions?", "No, you must start with a blank page and redo the labs as though you are completing them for the first time.", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as manipulating digital logic and programming devices such as PLCs.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 79, "course_code": "MTE 325", "course_name": "MTE325 - Microprocessor Systems and Interfacing for Mechatronics Engineering (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Notice of Recording", "Microprocessor Systems and Interfacing for Mechatronics Engineering Winter 2025", "03:30PM - 04:20PM", "E5 3102", "01:30PM - 04:20PM E3 3155", "01:30PM - 04:20PM E3 3155", "01:30PM - 04:20PM E3 3155", "book a meeting", "E7-3412", "Synchronization and data flow; interfacing to sensors and actuators;", "parallel, serial, and analog interfacing; buses; direct memory access (DMA); interfacing considerations; privacy and security considerations.", "View requirements for MTE 325", "Summarize the flow of data between software and hardware elements in an embedded system", "Describe the trade-offs between implementation alternatives for both hardware and software", "Outline the ethical implications of embedded system design choices", "Use industry-standard tools to implement and debug embedded systems", "Design an embedded system to perform a given task", "Projects provide students with an opportunity to explore selected concepts in a real-world context.", "Lectures and tutorials are held in person and attendance is expected at all sessions for learning and skill development.", "Jan 20th and Jan 22nd  Lab 1 – Introduction and setup (watch Learn for signup instructions closer to)", "Lab 2 – Synchronization Techniques", "Course Introduction An introduction to the teaching team, course expectations, deliverables, marking scheme, and a very brief introduction to interfacing concepts.", "Embedded Systems A review of fundamentals of embedded systems and the terminology associated with embedded systems.", "Embedded Design Model An introduction to the embedded design model used to develop a system for the remainder of the course.", "Embedded Software An overview of they key differences between software for embedded systems and general software development.", "Synchronization, Data Generation and Data Transfer A model for analyzing synchronization behaviour and performance and examples of synchronization analysis.", "Buses - Data Transfer A comparison of the functional behaviour and timing behaviour of synchronous, asynchronous, and partially interlocked asynchronous.", "Parallel Interfacing A detailed examination of the design of parallel interfaces.", "This includes an examination of the role of the interface in matching bus timing and signaling characteristics with a device's timing and signaling characteristics.", "Analog Interfacing An introduction to digital-to-analog interfacing, analog-to-digital interfacing, and sample-and-hold circuitry.", "This includes a comparison of asynchronous communication techniques and synchronous techniques as well as the protocols for serial communication.", "Buses - Arbitration A brief examination of alternatives for bus arbitration including a discussion of the operation and characteristics of daisy chained and non-daisy chained bus arbitration techniques.", "A brief examination of direct memory access including a discussion of hardware design implications, software implications, and system performance.", "Security and Ethics An overview of common security terminology and why it has become increasingly important for embedded systems.", "The ethical implications of today’s embedded systems applications will also be discussed.", "Other References", "Supplementary readings are available for most chapters on Learn No $0.00", "You are encouraged to subscribe in order to receive email copies of announcements.", "The LEARN calendar has been setup to specify reminders of important dates for the course.", "The Project module contains a description of the projects as well as files and resources that may be useful in completing the projects.", "You may use these exams to assess your preparation for the exams in the course.", "Your project average includes your grades for all project demonstrations and submissions.", "Students will need to make design decisions and use the resources that are typically available for a particular embedded system application.", "The purpose of this project is to provide practice with applications of course concepts and experience tackling an open-ended interfacing problem in preparation for their 3rd and 4th year design projects.", "Demonstration-based deliverables Can be completed anytime during lab sessions 3-6 19", "Submission-based deliverables Last day of class, 8:00 pm 5", "University of Waterloo Verification of Illness forms and self-declared absences will be taken into consideration only for the student to whom it applies, if appropriate.", "Notes for Students Repeating the Course", "Do I have to do the project again?", "Can I reuse material from previous submissions?", "It would also be helpful if you provided comments such as \"In the previous submission, concerns were expressed related to the definition of maximum stable frequency.", "Exams", "***Any guidelines UW releases on verification and declaration of illness for the term, will supersede the instructions given here***", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 80, "course_code": "MTE 544", "course_name": "MTE544 - Autonomous Mobile Robots (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Notice of Recording", "yue.hu@uwaterloo.ca", "11:30AM - 12:20PM E5 3102", "E3 3178", "yue.hu@uwaterloo.ca", "E3 3178", "yue.hu@uwaterloo.ca", "E3 3178", "yue.hu@uwaterloo.ca", "08:30AM - 11:20AM E3 3178", "yue.hu@uwaterloo.ca", "Location: E5 - 3102", "Fundamentals of autonomous mobile robotics, including both perception and planning for autonomous operation, sensor modelling, vehicle state estimation using Bayes Filters, Kalman Filters, and Particle Filters as well as onboard localization and mapping.", "Topics in planning include vehicle motion modelling and control, as well as graph based and probabilistic motion planning of (Micro Electro Mechanical Systems) MEMS devices.", "This course covers four fundamental topics of Autonomous Mobile Robotics; 1) modeling, 2) sensors and perception, 3) estimation (localization and mapping), 4) planning and navigation.", "Modeling covers kinematic models of various types of wheeled mobile robots.", "Sensors include various types and algorithms (for vision and range sensors).", "Estimation includes Bayesian estimation theory and its application to localization (and/or mapping).", "Topics in Planning include odometry motion models and graph-based and probabilistic motion planning as well as obstacle avoidance (reaction-based) methods.", "Discussions and questions - Piazza", "Sign-up link: https://piazza.com/uwaterloo.ca/fall2024/mte544, Access code: MTE544FALL2024.", "We have a few desktop computers (number subject to change depending on working conditions of the computers) that can be accessed remotely.", "User accounts are given on a per-request basis.", "A booking system will be set up for those choosing to use this solution.", "We have a total of 15 laptops (number subject to change depending on working conditions of laptops) that students can lend on a first-come-first-served basis.", "The lending time must not exceed one week each time.", "Develop kinematic models and controls for autonomous robots.", "Apply motion and measurement models to a variety of vehicles and sensors.", "Apply localization/mapping algorithms for perception within environments.", "Create collision free paths through environments based on maps.", "9/4 Course logistics and introduction", "9/4", "9/11 Kinematic models: 4 wheels, holonomic and omniwheel", "9/18 Introduction to sensors, Inertial sensors, Position Sensors", "9/24 Introduction to odometry, Range sensors (line-fit and RANSAC)", "-", "9/25", "10/1 Vision sensors and basics of image processing", "10/8 Introduction to localization, Discrete motion model", "10/29 Probabilistic Motion Model and Velocity Motion Model", "10/30 Probabilistic Measurement Model and Likelihood Field Model", "11/12 Introduction to planning, graph-based methods, Dijkstra", "11/13 A*, D*, introduction to random methods", "11/20 RRT*, Potential Field", "11/27 Explanation of take-home exam & course summary", "Fr1 Section: Friday 8:30-11:20 AM", "There will be a total of 4 in-person Lab sessions, taking place in E3-3178, in-person attendance is compulsory.", "If you need to switch to a different section, you need to inform the instructor and the TAs for the arrangement with one week notice (accommodations for late notices are allowed on a case-by-case evaluation basis).", "Lab#2 – Control the robot to follow a trajectory using a closed-loop controller.", "Lab#3 – Estimation and mapping: estimate robot motion from sensor data utilizing filters.", "The in-person lab is not meant for implementation but for testing and getting help from the TAs.", "Fail to submit a completed code will result in penalty on the lab report.", "Each member must demonstrate to have equally contributed to the report.", "Submit the report with a final version of your code, and attach a list of modifications made between the first version and the final version.", "About 2 weeks’ time will be given to complete each assignment.", "Notice of Recording", "In case of shutdown of in-person activities, the following arrangements will take place:", "This course includes the independent development and practice of specific skills, such as implementation of theory into practice (e.g. algorithms into code), knowledge of the mathematical models and algorithms, and being able to develop independent solutions for mobile robotics.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 81, "course_code": "MTE 546", "course_name": "MTE546 - Multi-Sensor Data Fusion (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Multi-Sensor Data Fusion Winter 2025", "DWE 2402", "Sensor data and information fusion systems.", "Sensor fusion approaches for estimation and decisions including weighted least squares, extended Kalman Filter, Dempster-Shafer evidential reasoning, artificial neural networks; Outlier rejection; Spatial and temporal registration.", "Course project involving independent study of one aspect of sensor data fusion.", "Discriminate between data, feature and decision fusion", "Use probability theory for uncertainty modeling, and decision fusion", "Classification and classifier fusion", "Evaluate the performance of decision making in discrete decision space (classification)", "Use Regression techniques to build model for sensors", "Perform model evaluation and model selection", "Detect and reject outliers using thresholding and clustering", "Implement weighted sum fusion", "Fuse measurement models and noisy data in Kalman filter framework", "Use Extended Kalman filter in fusing sensors and process model", "Use Unscented Kalman Filter in fusing sensors and process model", "Target tracking with Interactive Multiple Model Filters", "Use techniques such as OWA for decision fusion", "Use Fuzzy set theory and Fuzzy inference systems to fuse measurements and/or decisions", "Implement and use Artificial Neural Network to fuse multi-sensor/multi-feature data (regression and classification)", "Introduction, Basic definitions, Math review, Discrete decision fusion, Classifiers, Bayesian Classifier", "Tracking with Interactive Multiple Models (IMM), Ordered Weighted Averaging (OWA) fusion and Max-Entropy OWA fusion, Fuzzy set theory", "Fuzzy Logic, Fuzzy Inference system, Fuzzy fusion", "RBF networks,  examples of deep neural nets and their applications"]}, {"course_id": 82, "course_code": "SE 212", "course_name": "SE212 - Logic and Computation (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Notice of Recording", "Logic and Computation Fall 2024", "08:30AM - 09:50AM DWE 3516", "10:00AM - 11:20AM DWE 3516", "Mon 11:30-12:30pm in person DC2335", "ISG Coordinator", "Sylvie Davies ISC email", "Proof systems and styles.", "Formal models of computation.", "Logic-based specification.", "Applications in software engineering.", "All students in good standing in the software engineering program are prepared to learn the material covered in SE212.", "read and write logical statements in propositional and predicate logic.", "prove theorems in propositional and predicate logic.", "know there are multiple ways to prove these theorems.", "verify formally that functions within a program are correct (verification in the small).", "understand there is a mathematical theory associated with software engineering.", "This course is about the \"first principles\" of the logical theory behind software engineering.", "Students will be introduced to logical notation (both propositional and predicate logic), and basic methods of proof.", "Specification and program correctness are the main applications of logic taught in this course.", "Week 1: Introduction and Motivation.", "Week 8: Formal Specification in Z Readings: Grassman Ch. 8", "Week 9: Formal Specification in Z", "Courseware pack contains chapters from:", "Projects may be completed in groups of two.", "Students may be selected randomly or on a case-by-case basis and will be notified in advance.", "Exam Information", "Notice of Recording", "Avoiding Academic Offenses", "You can avoid crossing the line by discussing a problem in terms of its general case or in terms of a related problem.", "However, appropriately penalties for cheating in a specific case are decided by the Assistant Dean for Students in the Faculty of Mathematics.", "Students may be selected randomly or on a case-by-case basis and will be notified in advance.", "\"This course includes the independent development and practice of specific skills, such as logical reasoning.", "In particular:", "Please inform of us these at the start of the course.", "Continuity Plans"]}, {"course_id": 83, "course_code": "SE 350", "course_name": "SE350 - Operating Systems (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Operating Systems Winter 2025", "Mike Cooper-Stachowsky mstachow@uwaterloo.ca", "An introduction to the fundamentals of operating system function, and implementation.", "Topics include concurrency, synchronization, processes, threads, scheduling, memory management, file systems, device management, and security.", "10.I/O Management and Disk Scheduling (2h)", "William Stallings, Operating Systems: Internals and Design Principles Any edition from 7th onwards is acceptable No 50", "This course includes the independent development and practice of specific skills, such as C programming.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 84, "course_code": "SE 463", "course_name": "SE463 - Software Requirements Specification and Analysis (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Software Requirements Specification and Analysis Fall 2024", "RCH 211", "Daniel Berry, DC 3329, No telephone, dberry ATT uwaterloo DOTT ca", "So I cannot use a voice-only telephone.", "I can use a video communication medium if the bandwidth of the connection is high enough that the image gets updated at the frequency of television or movies and thus, the lip movement is smooth enough to be decipherable.\"", "Joel Rorseth, jerorset ATT uwaterloo DOTT ca", "Yelizaveta Brus, ybrus ATT uwaterloo DOTT ca", "Noble Saji Mathews, ns3mathe ATT uwaterloo DOTT ca", "Shimon, ssarefin ATT uwaterloo DOTT ca", "Mohamed Rouili, mrouili ATT uwaterloo DOTT ca", "Max Zhang, m492zhan ATT uwaterloo DOTT ca", "Introduces students to the requirements definition phase of software development; models, notations, and processes for software requirements, identification, representation, analysis, and validation.", "Day & Lecturer OR Topic & Main Slides", "Administration, Plans, and Requirements of the Course The Importance of Ignorance", "Requirements Engineering Reference Model: Domain Modeling", "Requirements Engineering Reference Model: Domain Modeling Classes: Concepts, Context, and Identification", "Classes: Concepts, Context, and Identification", "24 September", "Use Cases and Scenarios", "Use Cases and Scenarios", "IEEE Standard for SRSs", "User Interface Specifications", "Reading Week!!!", "Reading Week!!!", "User's Manual Advice User Interface Specifications", "User Interface Specifications", "Software Cost Estimation", "Ambiguity in Requirements Specifications", "Ambiguity in Requirements Specifications", "State Machine Diagrams", "Linear Temporal Logic System State of a State Machine", "Linear Temporal Logic Elicitation", "Elicitation", "3 December", "Requirements Modeling", "RE Reference Model", "Domain Modeling", "Assumptions and Exceptions Identification", "Requirements Specifications", "SE and RE Economics", "Cost Estimation", "RE in Agile Development", "Ambiguity in Requirements Specifications", "Verification and Validation", "Importance of Ignorance in RE", "Requirements Elicitation", "Things to Specify", "User Interfaces", "Formal Specification Notations", "Linear Temporal Logic", "The topics are listed in a rough order of dependency."]}, {"course_id": 85, "course_code": "SE 464", "course_name": "SE464 - Software Design and Architectures (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Notice of Recording", "Software Design and Architectures Fall 2024", "10:00AM - 11:20AM EV3 1408", "Weiyi Shang <wshang@uwaterloo.ca>", "include SE464 in subject line, or will get lost in email filters]", "explain the strengths and weaknesses of various architectural styles and design patterns / techniques.", "communicate and rationalize architectural and design decisions.", "Week 2 September 11th Design principles, UML+Design pattern flashback+ Architecture+NFP", "Week 3 September 18th Basics of system design: Scaling and cache", "Basics of system design: DB scaling: R DB", "Week 4 September 25th Basics of system design: DB scaling: NoSQL", "Week 5 September 30th Basics of system design: DB scaling: Consistency and choosing a DB", "Week 5 October 2nd Basics of system design: REST API", "Week 6 October 7th Basics of system design: micro services, load balancing", "Week 6 October 9th Basics Architecture design wrap up (lab 1 due by the end of the Friday)", "Week 12 November 18th Basics of system design: Authentication", "Notice of Recording"]}, {"course_id": 86, "course_code": "SE 465", "course_name": "SE465 - Software Testing and Quality Assurance (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Software Testing and Quality Assurance Winter 2025", "Introduces students to systematic testing of software systems.", "Engineering is about applying the appropriate amount of effort to make sure that systems work properly, especially systems that affect the public in some way.", "In this course, as software engineering students, you will learn about tools and techniques that you can use to make your software systems fit-for-purpose.", "write new test suites, improve existing test suites, and critique test suite quality using engineering judgment", "The week-by-week schedule might slip.", "I last taught SE 465 in Winter 2019 and the ECE 453 version in Winter 2023, but I think that you will benefit from the revamp I'm doing this term.", "Introduction", "Evaluating your tests: coverage, fuzzing, mutation-based fuzzing, mutation analysis", "Symbolic Execution", "Z3 SMT Solver", "Dynamic Symbolic Execution", "Semantics of Symbolic Execution", "Verification Condition Generation", "Bounded Model Checking", "Real-life Applications of Verification", "Metamorphic testing", "I anticipate that the final exam will be in-person, and that quizzes will be in-class in-person, though there are no guarantees.", "Acceptable collaboration includes discussing ideas and structures with others, as well as helping others debug their code.", "If your code is too close in structure to someone else's code, you are going to have a problem.", "Or, let's sum this up in two short instructions:", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, ChatGPT) and how such tools can be used to write and test code.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be diﬃcult to interpret on a discussion forum.", "The human visual system has evolved to perceive saber‐toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text‐mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 87, "course_code": "SYDE 192", "course_name": "SYDE192 - Digital Systems (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Digital Systems Spring 2024", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "Sign your email with your first and last name and your student number.", "Prereq: 1B Systems Design Engineering.", "The course also increases students' interest in software and hardware and prepares them for their co-op and future career.", "Explain the impoirtance of digital systems and computer architecture, (Attribute: 1d)", "2. Analyse internal components of digital systems and their technical details, (Attributes: 1d)", "4. Design digital systems that are reliable (observed behavior matches specifications), safe (avoid putting human lives in danger even in presence of errors and failures), and robust (ability to handle unspecified inputs and state), (Attributes: 3a)", "Communicate design of digital systems effectively in written documentation and oral presentation.", "construct meaning from oral, written, and graphic communication through interpreting, exemplifying,", "Instruction & Assessment:", "What you should be doing each week", "Suggested problem sets & solutions", "Microsoft Teams will be used as online platform:", "Online asynchronous lectures in case of any COVID-19disruptions", "Activities & Deliverables", "2 May 13 - 17 Binary Arithmetic and Digital Elements", "3 May 20 - 24 Combinational Logic and Combinational Circuits and Applications", "4 May 27 - 31 More on Combinational Logic and Combinational Circuits and Applications", "7 June 17 - 21 Sequential Circuits and Sequential Logic Design Assignment 3: due on Friday June 21", "8 June 24 - 28 More on Sequential Logic Design and Algorithmic State Machines", "Midterm Exam: Friday June 28 at 4:00pm in E5-6006 and E5-6008 (subject to change)", "3 Combinational Logic and Combinational Circuits and Applications 2, 3 N/A", "4 More on Combinational Logic and Combinational Circuits and Applications", "7 Sequential Circuits and Sequential Logic Design 2, 3, 4 N/A", "8 More on Sequential Logic Design and Algorithmic State Machines  2, 3, 4 N/A", "Harris and Harris: “Digital Design and Computer Architecture”.", "Patterson and Hennessy: \"Computer Organization and Design”.", "Mini Project Report & Code 10%", "Those will be marked for completion not for correctness.", "Each of these assignments may include analytical, numerical (using Falstad) and explanatory components exploring fundamental aspects of the material covered in the course.", "We may be using a circuit simulation software such as Falstad and TinkerCad.", "Systems Design Lab Kit: All students need to buy a lab kit that will be used in SYDE 192 and other courses in Systems Design Engineering.", "COVID-19 Emergency Self-Isolation:", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 88, "course_code": "SYDE 411", "course_name": "SYDE411 - Optimization and Numerical Methods (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Optimization and Numerical Methods Fall 2024", "08:30AM - 09:50AM E7 4433", "- Abbas Seifi, Professor   Email: aseifi@uwaterloo.ca", "Advanced methods for systems of linear equations.", "Linear programming, simplex and interior-point methods.", "Local and global optimization methods.", "This course introduces the applications of optimization modeling and numerical methods to various engineering optimization problems.", "It provides an overview of the formulation and classification of optimization problems arising in engineering and types of suitable optimization methods.", "Graphical solution methods for two-variable problems and optimization techniques for single-variable problems like region elimination approaches, interpolation algorithms, and direct root-finding methods are discussed.", "Linear Programming problem formulations and simplex and interior-point methods for solving such problems are discussed.", "Learn about different types of optimization problems in engineering design (GA: 1,4)", "2. Study types of optimizations methods and where they are applied, convexity, optimality criteria for unconstrained multivariable problems, and optimality conditions for constrained multivariable problems and proper software tools (GA: 1,2,5)", "Apply graphical solution method to solve two-variable optimization problems, and region elimination methods, interpolation methods, and direct root-finding methods to solve single-variable problems (GA: 1,2,5)", "Apply simplex and interior-point methods for solving Linear Programming problems (GA: 1,2,5)", "7. Apply constrained multivariable methods as well as multi-objective techniques to solve design optimization problems using Pareto optimality concept(GA: 3,4,5)", "Details and explanation of each attribute can be found at Graduate attributes | Engineering (uwaterloo.ca)", "Week 1 / LO: 1,2 Sept. 5  Introduction to Optimization", "Classification of Optimization Problems & Applications", "Slides", "Week 12 / LO: 6,7 Sept. 10-12 Functions of a Single Variable Optimization Problem Statement; Basic Concepts & Examples; Graphical Solutions; Optimality Conditions", "Week 3 / LO: 4 Sept. 17-19 Optimization of Single Variable Functions", "Unimodal Functions", "Bracketing & Region Elimination Golden Section and Fibonacci methods; Interpolation method", "Assign.1", "Week 4 / LO: 4 Sept. 24-26 Gradient-Based  Root-Finding Methods Newton–Raphson, quasi-Newton Method; Bisection & Secant methods;", "Convexity & Positive Definiteness", "Week 9 / LO: 3,7 Oct. 29 -31 Constrained Multivariate Optimization Optimality Conditions for Convex Nonlinear Programs; Example of KKT Conditions and Solutions; Design Optimization in MATLAB", "Assign.3", "Week 10 / LO: 6 Nov. 5-7 Linear Programming & Duality Theory", "LP Formulation; Graphical Solution & Simplex method", "Duality& Economic Interpretation", "Week 11 / LO: 6 Nov. 12-14 Interior-Point Methods (IPM) Affine-Scaling Interior-point method; Examples; primal-dual interior-point algorithms", "Week 12 / LO: 6,7 Nov. 19-21 Multi-objective Optimization  Quadratic Programming & Applications; Pareto Optimality; epsilon-Constrained Method", "Week 13 / LO: 1,3 Nov. 26- 28 Modern Global Optimization and Applications Genetic Algorithm and Examples; Applications in Design Optimization", "Introduction to Optimum Design, Elsevier Inc., 4th Edition, J. S. Arora, 2016 No", "Optimization Concepts and Applications in Engineering, Cambridge University Press, 2nd Edition, A. D. Belegundu, T. R. Chandrupatla, 2011 No", "The midterm exam will be taken in person and closed book.", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 89, "course_code": "SYDE 522", "course_name": "SYDE522 - Foundations of Artificial Intelligence (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["The objective of this course is to introduce students to fundamental concepts of artificial intelligence.", "Understand the basic concepts in Artificial Intelligence (CEAB requirements: 1d)", "Discuss how basic concepts lead to modern AI systems (CEAB requirements: 1d)", "Integrate ethical considerations when using AI (CEAB requirements: 10)", "Instruction", "Course slides and code notebooks will be posted on LEARN.", "W Sept 4 Introduction and Definitions", "M Sept 9 Perceptrons and Delta Rule", "M Sept 16 Evaluation Metrics and Experimental Validation", "M Sept 23 Linear SVMs", "M Nov 25  Extra Topics: Genetic Algorithms", "Late policy: If students have reasons for an assignment to be submitted late, they need to contact the instructor and accommodations can be made on a case-by-case basis.", "Course and Departmental Expectations", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.", "A.A.S. also offers learning strategy supports to all students that can be accessed through:"]}, {"course_id": 90, "course_code": "SYDE 542", "course_name": "SYDE542 - Interface Design (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Interface Design Winter 2025", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "Email: c2murad@uwaterloo.ca", "Wendy Ding", "Email: wendy.ding@uwaterloo.ca", "Email: s2marash@uwaterloo.ca", "This course focuses on the design of computer interfaces for simple to complex systems.", "Main topics include forms of visual display; auditory display and soft controls; context, navigation, and layout; development techniques; design for engagement.", "The intent of this course is to give you hands-on experience with some of the current popular techniques, design and research issues in user interface design.", "The emphasis is on learning a systematic design process, advanced knowledge elicitation techniques, and objective evaluation techniques and demonstrating competency in these areas.", "Learn the foundations of how humans interact with technology and how technology supports human-to-human communication", "Learn what makes interactive systems user-friendly", "Learn about designing digital technologies that mediate human communications", "Learn about evaluating interactive systems", "Demonstrate competency in Interface Design methods such as User Observations, Surveying/Interviewing, Data Analysis, Wireframing, Storyboarding, Prototyping, User Requirements Elicitation Techniques, User Modeling Techniques (Personas, Task Analysis), User Testing", "Jan 6                              Introduction", "Jan 13 User Observations & Affinity Diagramming", "A1: Observation and Ideation [", "Jan 20 Design Principles", "Feb 3 User Requirements & Design Recommendations", "Feb 10 Design of Interfaces; Ethics A3: Preliminary user observations, requirement gathering, design proposal", "Feb 25 Concepts of Visual Design", "First low-fi prototype, heuristic evaluation, and functionality freeze", "Interaction Design: Beyond Human - Computer Interaction (3rd, 4th, or 5th edition) (Yvonne Rogers, Helen Sharp, Jenny Preece) No $73", "Almost every week there will be time reserved for in-depth discussions, student presentations, development/design activities, design critiques, and studio-based participation and user trials.", "Attendance and presentation of designs for critique during the practical is expected.", "Teams are required to share workloads equally and fairly – their contributions will be marked both individually and as a team.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 91, "course_code": "SYDE 543", "course_name": "SYDE543 - Cognitive Ergonomics (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Piazza will be the main platform for Q&A. In case you need to contact the teaching team, make sure to add SYDE 543 to the beginning of the subject line.", "This course focuses on the role engineering psychology research plays in design of the information displays and devices associated with simple and complex cognitive tasks.", "Remember and comprehend important cognitive ergonomic concepts, theories, and principles", "Analyze human information processing constraints and limitations, and use it to identify cognitive ergonomics issues in systems design", "Apply cognitive ergonomics knowledge to produce improved designs considering human cognitive constraints", "Course Introduction", "Human-computer Communication", "Human Errors", "Senses", "Attention and Learning", "Control", "Empirical Evaluation", "Research Methods in Cognitive Ergonomics", "Decision Making", "Decision making and biases", "Working Memory", "Memory and Training", "Situation Awareness", "March 25,28", "Case study presentation", "Case study presentation", "Foundations for designing user-centered systems: What system designers need to know about people.", "Santa Barbara CA: Aegean Publishing Company No 120", "Alternatively, one of the team members can send the email and cc all the other team members.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "You will be clearly directed whether you are allowed to use these methods for each assignment."]}, {"course_id": 92, "course_code": "SYDE 548", "course_name": "SYDE548 - User Centred Design Methods (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["User Centred Design Methods Winter 2025", "UCD Mentors Pronouns Email Office Extra Help", "This course approaches the design of tasks, tools, products, and systems from a user-centered design perspective.", "Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process.", "Major topics include user research methods for usability and user experience, inspection methods, user testing, applied statistical analysis.", "SYDE 548 (UCD Methods) approaches the design of tasks, tools, products, and systems from a user-centered design perspective.", "Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process.", "Major topics include user research methods for usability and user experience, inspection methods, user testing, and applied statistical analysis.", "SYDE 548 User-Centred Design Methods is a technical elective.", "It builds from earlier SYDE core courses in design (SYDE-BME 161 Introduction to Design, SYDE-BME 162 Human Factors in Design, and SYDE-BME 361 Engineering Design).", "Motivated students willing to become familiar with basic human factors engineering can participate and contribute to course activities.", "Whether you are interested in becoming a UCD specialist, a certified ergonomist, or just want to be a wise designer or consumer, this course will supply you with a range of practical tools (methods).", "Our “In-class” sessions are used as workshops for interactions and hands-on skill development with different UR methods.", "Engineering Graduate Attribute]", "(A) Describe ethical UCD methods used for formal and informal design assessments with human participants.", "(B) Investigate & select appropriate ethical & equitable UCD methods for specific design situations.[2a, 3b, 10b]", "(C) Apply UCD method protocols to instructor-defined design situations.", "(D) Modify UCD method protocols to collect data for a student-defined design project.", "(E) Select and apply appropriate statistical analysis for given UCD data.", "(F) Design ethical UCD test plans for instructor-defined design situations.", "(G) Create User Research Portfolios describing ethical UCD methods, protocols, and lessons learned.", "CEAB Engineering Graduate Attribute", "Knowledge Base for Engineering", "2. Problem Analysis", "Data Analysis Quizzes,", "4. Design", "-", "Impact of Engineering on Society and the Environment", "Ethics & Equity", "Economics & Project Management", "-", "2. Situations of Concern, Design Impacts & Personas Quantifying Usability; Standard UX Questionnaires;", "SUS Scoring (standard and positive versions)", "3. Design Ethnography: UR Safaris & Secondary Research.", "Interviews & Distress Protocols.", "5. Thematic Analysis Methods - Part 1 Thematic Analysis Methods - Part 2", "Formative Design Walkthroughs & Estimating Formative Sample Sizes.", "UR Methods & GenAI Revisited.", "Quantifying the User Experience: Practical statistics for user research.", "An e-copy of the 1st edition can be accessed through UW Library Reserves.", "The User Experience Team of One: A Research and Design Survival Guide. 2nd edition.", "Hanington, B. & Martin, B (2019) Universal Methods of Design (Expanded & Revised): 125 Ways to research complex problems, develop innovative ideas, and design effective solutions.", "An e-copy of the 1st edition can be accessed through UW Library Reserves No", "Design Materials (for workshops, data collection, and analysis).", "The number of students who can access an e-copy at a given time may be limited.", "Since user-centred design and user research skills are valued by industry, it is important that each student submits original work and demonstrates their own value-added UR skills to earn credit for the course.", "Intellectual property includes items such as:"]}, {"course_id": 93, "course_code": "SYDE 552", "course_name": "SYDE552 - Computational Neuroscience (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["SYDE 552 / BIOL 487 - Computational Neuroscience Winter 2025", "04:30PM - 05:20PM E7 4417", "04:30PM - 05:20PM E7 4417", "Instructors Email Meeting Times", "TA Email Meeting Times", "Introduction to modelling and analysis of neurophysiological systems.", "Prerequisites: At least 3B Systems Design Engineering OR at least 3B in the Faculty of Science and one of CS (115, 135, 200) and a 200-level STAT course.", "Course Objectives: There are far more topics in computational neuroscience than can be covered in a single course.", "Throughout the course, we will emphasize the relationship between computational models and biological structure.", "Simulate and manipulate a variety of neuron models, from LIF to Hodgkin-Huxley", "Describe the organization of the primate visual system and compare it to convolutional networks", "Describe the organization of the hippocampus and its role in cognition", "Describe the organization of the basal ganglia and compare it to modern reinforcement learning techniques", "It should be noted that the last hour of the Wednesday session is meant to be a Tutorial, which will be run mostly as a free-form discussion about the topics brought up in the course materials", "Introduction", "Neuron Models", "3. Simple Neuron Models", "Synapses", "Perceptrons and Regression", "Intermediate and High-level Visual Processing", "Backpropagation and Convolutional Neural Networks", "Role in Cognition", "Modelling memory", "Modelling spatial navigation", "Role in Cognition", "Models of BG - Functional", "Models of BG - Anatomical", "Ongoing Research Topics", "• Biophysics of Drugs and Disorders (?)", "MIT Press https://www.deeplearningbook.org/", "Late work may be submitted via email for reduced credit."]}, {"course_id": 94, "course_code": "SYDE 556", "course_name": "SYDE556 - Simulating Neurobiological Systems (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Simulating Neurobiological Systems Fall 2024", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "This course develops and applies a general framework for understanding neural computation in the context of recent advances in theoretical and experimental neuroscience.", "Demonstrate a basic understanding of neural processes, neural mechanisms, theories of neural communication and computation, and theories of neural dynamics.", "Converse at a fundamental level with neuroscientists, psychologists, and neural and cogitive modelers.", "Design and Analyze simple and complex neural circuits for performing small- and large-scale neural computations.", "Apply engineering methods in signal processing, optimization, and control theory, among others, to characterizing and building neural circuits.", "Identify problems and solutions that may exploit the advantages of neural computation in an engineering context.", "Abbreviations", "KB - Knowledge base", "1b: Demonstrate understanding of concepts in natural science", "1c: Demonstrate understanding of engineering fundamentals", "1d: Demonstrate understanding of specialized engineering knowledge", "I - Investigation", "3b: Gather information from relevant sources to address complex engineering problems", "D - Design", "Critically evaluate and compare design choices", "Generate and refine potential solutions to complex, open-ended design problems", "UET - Use of Engineering Tools", "5a Select appropriate engineering tools, considering their limitations", "Sept 25 Chapter 5,6 Feedforward Transformations (I) #2 posted", "5 Sept 30 Chapters 5,6 Feedforward Transformations (II) #1 DUE*", "8 Oct 21 see notes Temporal Basis Functions #2 DUE*", "Neural Engineering: Representation, Computationa and Dynamics in Neurobiological Systems.", "On reserve in Library Yes", "Accommodation for Students with Disabilities", "Intellectual property includes items such as:", "of Waterloo for permission before uploading and sharing the intellectual property of others online(e.g., to an online repository).", "In many cases, instructors might be happy"]}, {"course_id": 95, "course_code": "SYDE 572", "course_name": "SYDE572 - Introduction to Pattern Recognition (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Introduction to Pattern Recognition Fall 2024", "Pattern features as components in a random vector representation.", "Applications; optical character recognition, speech recognition, industrial robot vision, medical diagnosis, remote sensing and satellite image analysis, fault detection and diagnosis in complex systems such as nuclear reactors.", "Understand the principles of fundamental pattern recognition concepts such as classification, feature extraction and selection, deep learning, etc.", "2. Apply learnt techniques and algorithms in assignments using Python", "3. Understand and contextualize the learnt concepts in applications of pattern recognition to science, engineering, and industry", "4. Design a pattern recognition system provided a task and a set of data.", "Problem Analysis", "Introduction, Pattern Recognition Problem Definition", "Parametric and Nonparametric Distance-Based Classification", "KNN and distance-based classification", "Parametric and Nonparametric Density Estimation", "Discriminant Functions", "Gaussian mixture models", "Parametric and Nonparametric Clustering", "Expectation Maximization", "Linear and nonlinear regression", "Ensemble classification", "Advanced topics", "An Introduction to Statistical Learning, James, Witten, Hastie, Tibshirani, 2nd Ed.", "Introduction to Machine Learning, Alpaydin.", "Dive into Deep Learning", "Various usefullinks and advisorcontact information can be foundhere:"]}, {"course_id": 96, "course_code": "SYDE 575", "course_name": "SYDE575 - Image Processing (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Image Processing Fall 2024", "10:00AM - 11:20AM EV3 4408", "10:00AM - 11:20AM E5 6008", "Beginning with a discussion of quantitative models of imaging systems, this course moves on to apply methods of linear systems theory and signal processing to image processing.", "Simple spatial domain techniques as well as spatial frequency domain methods, and digital filter design for image enhancement and restoration are discussed.", "Applications to machine vision, remote sensing, and medical imaging will be emphasized.", "Apply basic image processing algorithms and tools to digital imagery (2)", "2. Utilize Matlab effectively for fundamental image processing applications (5)", "Understand mathematics for image processing based on signal processing concepts (1)", "4. Develop a basic understanding of the human visual system and its relationships to digital image processing (1)", "Understand the nature of spatial-frequency domain in the context of digital image processing (2)", "Work in a team to complete applied lab design based solutions to problems and prepare a technical report responding to clear instructions (4, 7)", "7. Demonstrate an enhanced understanding of linear systems with application to image processing (1)", "Graduate Attribute Definition", "Knowledge Base Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "2. Problem Analysis An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "7. Communication Skills An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "10-15 Spatial-frequency filter 2,3,4,5,6,7", "18 Color image processing 4,6", "The grade of each lab will be reduced by 20% for each full/partial day late submission.", "I make a sincere effort to provide a course to benefit students and I hope students make the same effort in return for their own positive experience.", "Prof. Clausi"]}, {"course_id": 97, "course_code": "CS 492", "course_name": "CS492 - The Social Implications of Computing (0.50)", "term_name": "List 4", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["The Social Implications of Computing Winter 2025", "08:30AM - 11:20AM AL 124", "Students learn how to make informed judgements about the social and ethical consequences of deploying computer technologies and how to foster critical thought and professional responsibility.", "Identify important social implications of computerization;", "Combine their opinions with information from existing research in both written and oral formats;", "Identify where their knowledge of computer science provides a valuable contribution to the overall dialogue about the social and ethical implications of computing.", "Proactively identify potential ethical issues related to data and new technologies and applications;", "Evaluate the potential risks and benefits of different courses of action that could be taken with respect to data and new technologies and applications;", "Succinctly and confidently articulate and justify your views on ethical issues related to data and new technologies and applications;", "for CS 492 Section 003 in particular", "That said, please do not attend class if you are sick and should be in self-isolation; just let your instructor and TAs know you are ill and unable to attend class.", "A link to join the Slack channel may be found here: https://join.slack.com/t/cs492section003w25/shared_invite/zt-2wl26b5p3-pxMv5Z6mRjbOoNybeKXSwA.", "Evaluation in this course will be comprised of the following three components:", "A note on the use of large language models (“LLMs”) and generative AI systems: While it is my strong preference that students not use these systems and prepare their journal entries entirely on their own, students are permitted to use such systems to improve the technical quality of their writing, but they may not use them to do their writing for them.", "If you do use one of these systems, you must inform us that you have done so and how you used it.", "Unlike the weekly commentaries or position papers, students are encouraged to experiment with LLMs and generative AI systems and to incorporate them as part of their small-group projects!", "A five-minute video tour of the project and its findings.", "This should be rare since overall grades can easily be improved by submitting an additional written assignment.", "EMPOWER ME in China", "In particular:", "IP includes items such as:", "In particular, in this Ethics Workshop, we will discuss bias and discrimination in data and algorithms, and how new technologies and applications can contribute to and ameliorate these problems."]}, {"course_id": 98, "course_code": "HIST 212", "course_name": "HIST212 - The Computing Society (0.50)", "term_name": "List 4", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["The Computing Society Fall 2024", "S. Campbell", "If that’s not a good time for you, just get in touch and let me know when you’re free and I’ll do my best to find time.", "It explores the impact and consequences of computing from a societal perspective, but also considers various nontechnical factors and values that have shaped computing technology and practice.", "Material artifacts will form a core element of the course.", "STV 210: View requirements for STV 210", "It’s a combination of STV-like concepts and historical concepts.", "The goal for this course is to appreciate how the history of computing can be used to better understand the interaction between technology and society today and in the future.", "*", "*", "*", "*", "*", "*", "*", "*", "You don’t need to buy it!", "An electronic version is available though the library, and we’re only reading some of the chapters.", "The activities allow you to practice with concepts and prepare you for assignments.", "Each group submits a summary of their discussion before leaving for the night, and each student in the group will share the grade.", "Self-Assessments", "There’s no shame!", "I know it can feel embarrassing to ask for help, but I seriously don’t mind helping everyone.", "Extensions", "Gender-inclusive language", "Gender-inclusive and fair language should be used in the interests of precision and politeness.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 99, "course_code": "MSE 442", "course_name": "MSE442 - Impact of Information Systems on Organizations and Society (0.50)", "term_name": "List 4", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Notice of Recording", "Impact of Information Systems on Organizations and Society Winter 2025", "MSE 442", "This course is designed to familiarize the student with issues related to the impact of computer-based technologies on individual jobs, organizations, and broader societal level.", "View requirements for MSE 442", "Identify the role(s) of information technology in society in a number of different fields.", "Identify and explain the advantages and drawbacks of a particular information technology case in society.", "Synthesize ‘for’ and ‘against’ cases and highlight the strengths and weaknesses of these beliefs.", "Present well-constructed arguments using sound knowledge and evidence supporting the case.", "Describe the impact of information technology in society with reference to potential future occupations.", "The survey can be accessed with the following link: https://www.surveymonkey.com/r/HMGHBKF", "Each team will create 5 questions for the opposing team and post these by Wednesday at noon of the debate week.", "A maximum of 100 words is allowed for each question.", "A maximum of 200 words is allowed for the response to each question received.", "Do the questions effectively challenge the opposing team?", "Do the answers to the questions received reflect good understanding of the case that the team is presenting?", "Are the arguments presented in the answers well constructed and is the evidence presented relevant and convincing?", "Inclusion of the main issues in the public debate on the topic", "Each review should be a maximum of 1000 words.", "Each review should be a maximum of 1000 words.", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 100, "course_code": "SOC 324", "course_name": "SOC324 - Digital Cultures (0.50)", "term_name": "List 4", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Notice of Recording", "Digital Cultures: Technology & Society Fall 2022", "I am an Associate Professor in the Department of Sociology & Legal Studies and at the Stratford School of Interaction Design and Business.", "Questions of a personal nature", "This course examines how digital play represents and structures social interaction and how games develop social norms, influence social consensus, and respond to deviance.", "Apply sociological theories and concepts to understand, examine, and critically evaluate how technology shapes, and is shaped by, social phenomena.", "Identify some of the complex ethical choices and moral codes embedded in digital tools, such as game consoles and smart phones.", "Identify how digital technologies shape our interpersonal relationships and communities, in both positive and negative ways.", "Identify and develop personal research interests relating to digital culture and technology.", "Synthesize complex written arguments, summarize core ideas effectively, and pull out key concepts.", "Develop creative ways to communicate and teach core concepts to others.", "Introduction to the Course No assigned readings.", "The Technological Society", "Theories to make sense of our digital lives.", "In The Design of Everyday Things: Revised and Expanded Edition, Revised, Expanded ed. edition, 1–36.", "Techno-social Designing.", "Tragic Design: The Impact of Bad Product Design and How to Fix It (1st edition).", "-oreilly- com.proxy.lib.uwaterloo.ca/library /view/tragic-design /9781491923603/ch05.html", "Addressing Human Bias in Technology Design", "Confronting the Absence of Women in Technology Innovation.", "Community in the Network Society", "Computer Love: Replicating Social Order Through Early Computer Dating Systems.", "Ethical Dimensions of Technology", "TBD", "Assigned readings and playlists may change through the term.", "Summative Activites take a similar structure to your Module Reflections.", "In a few short classes, we can’t cover everything.", "Your precis should directly provide the following:", "Make an argument for why your is topic sociologically relevant, and should it be covered in a third-year sociology course.", "Be creative!", "Schedule permitting, all projects will be shared and presented in class in celebratory teaching/viewing sessions", "Late Policies and Extension Requests", "Extensions longer than 1 week require:", "Notice of Recording", "However, if Health & Safety protocols demand a shift away from in-person teaching and towards online teaching, some activities for this course may involve recording, in partial fulfillment of the course learning outcomes.", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Do you want professors and interviewers to call you by a different first name?", "Intellectual property includes items such as:"]}, {"course_id": 101, "course_code": "STV 205", "course_name": "STV205 - Cybernetics and Society (0.50)", "term_name": "List 4", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Cybernetics and Society Spring 2024", "This course will present an overview of cybernetics from automation and robotics to prosthetics and wearable computing.", "The roles of men and women in a post-human era will be discussed along with related themes dealing with gender, cyberspace, politics, and popular culture.", "Apply analogical thinking to examine technologies from a functional as well as a social and cultural perspective.", "Assess the kinds of problems addressed by different kinds of technologies and reflect upon your own problem-solving experiences.", "Understand the basic concepts of cybernetics from a historical perspective and discuss issues concerning the development of technologies with someone from an academic discipline different from your own.", "On Thursday at 9:00pm ET, a multiple-choice quiz will be published that you must complete by Friday at 11:59pm ET.", "The study materials are a mix of book chapters and articles as well as video and audio clips.", "Each week, except the first week, in STV 205 will follow this pattern:", "Module 1.1 First-Order Cybernetics: Norbert Wiener, Margaret Mead, Feedback, Information and Analogy - May 9", "Module 2.1 Second-Order Cybernetics: Heinz von Foerster, the Observer and the Observed, Determinism versus Constructivism, and the Attention Economy - June 6", "Module 2.3: Big Data Algorithms, Surveillance Capitalism, and the Smart City - June 20", "Module 3.2: Utopia, Dystopia and Anti-Utopia? - July 11", "Systems Thinkers by Magnus Ramage/Karen Shipp Yes", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 102, "course_code": "STV 208", "course_name": "STV208 - Artificial Intelligence and Society: Impact, Ethics, and Equity (0.50)", "term_name": "List 4", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Artificial Intelligence and Society: Impact, Ethics, and Equity Winter 2025", "The objective of this course is to introduce students to ethical and social concerns relating to Artificial Intelligence (AI).", "By understanding the basic principles of AI and its evolution, to engaging with complex issues like algorithmic bias and privacy concerns, this course offers a comprehensive look at both the promise and challenges AI brings to society.", "Through real-world case studies, students will analyze how AI systems influence industries, economies, and governance while learning to apply ethical frameworks that ensure fairness and accountability in AI deployment.", "The course is designed to not only equip students with the tools to evaluate the societal impacts of AI critically but also to empower them to actively engage in discussions about the future of technology and society.", "By the end of the course, students will be prepared to make informed contributions to the ongoing debates about the role of AI in shaping the future.", "Identify and explain key concepts related to the societal impacts of AI technologies, including ethical considerations, biases, and privacy concerns, and classify real-world examples where these issues arise.", "Compare different ethical frameworks and governance models for AI, and critically test their effectiveness in addressing issues such as fairness, accountability, transparency, and human rights.", "Evaluate the broader implications of AI on democracy, human rights, and socioeconomic systems, and assess how AI-driven innovations can either support or challenge social equity, ethical standards, and global governance structures.", "8 Socioeconomic Impacts of AI and Automation Mar 5 Mar 11", "12 The Future of AI: Ethical Design and Responsible Innovation Apr 2", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 103, "course_code": "STV 210", "course_name": "STV210 - The Computing Society (0.50)", "term_name": "List 4", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["The Computing Society Fall 2024", "S. Campbell", "If that’s not a good time for you, just get in touch and let me know when you’re free and I’ll do my best to find time.", "It explores the impact and consequences of computing from a societal perspective, but also considers various nontechnical factors and values that have shaped computing technology and practice.", "Material artifacts will form a core element of the course.", "STV 210: View requirements for STV 210", "It’s a combination of STV-like concepts and historical concepts.", "The goal for this course is to appreciate how the history of computing can be used to better understand the interaction between technology and society today and in the future.", "*", "*", "*", "*", "*", "*", "*", "*", "You don’t need to buy it!", "An electronic version is available though the library, and we’re only reading some of the chapters.", "The activities allow you to practice with concepts and prepare you for assignments.", "Each group submits a summary of their discussion before leaving for the night, and each student in the group will share the grade.", "Self-Assessments", "There’s no shame!", "I know it can feel embarrassing to ask for help, but I seriously don’t mind helping everyone.", "Extensions", "Gender-inclusive language", "Gender-inclusive and fair language should be used in the interests of precision and politeness.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 104, "course_code": "STV 302", "course_name": "STV302 - Information Technology and Society (0.50)", "term_name": "List 4", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Information Technology and Society Spring 2024", "S. Campbell", "But is this just a misplaced perception?", "Ultimately, what sort of technological values underpin the actions of IT creators and users?", "Identify, classify and analyze concepts and perspectives related to the interaction between information technology and society.", "Identify and analyze technological values of creators and users, and those embedded within information technology.", "Develop independent research questions, and communicate findings in written and verbal formats.", "Also, for any engineering undergraduates, the course provides instruction in fulfilment of CEAB graduate attributes 10, b, and c", "May 29 1.3 Is everything online?", "June 12 2.1 Disinformation Yes", "June 26 2.3 IT & Fairness Yes", "Further instructions for each self-assessment and a rubric will be provided on LEARN in the Module 1.4, 2.4, and 3.4 folders.", "I know it can feel embarrassing to ask for help, but I seriously don’t mind helping everyone.", "That’s when I can best help, not a month later.", "Gender-inclusive language", "Gender-inclusive and fair language should be used in the interests of precision and politeness.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 0, "course_code": "CS 114", "course_name": "CS114 - Principles of Computing for Science (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Principles of Computing for Science Winter 2025", "08:30AM - 09:50AM MC 4059", "Monday -", "Monday", "07:00PM - 08:50PM", "10:30AM - 11:20AM MC 4063", "Coordinator", "Student who make use of office hours usually get better grades; use them!", "Introduction to basic imperative programming principles; programming concepts including functions, flow control, lists, arrays; numerical accuracy and efficiency; data analysis and general-purpose algorithms.", "Introduction to object-oriented programming concepts.", "Describe the basic memory model for mutation of basic types, lists, and objects in Python.", "Identify situations where recursion is an appropriate tool, and use it.", "6 Feb 6-11 M4: Strings and Lists", "7 Feb 13-25 M5: Sorting and Dictionaries", "If both exams are held in person", "If in-person exams cannot be held then they will be held online (if possible).", "Students have the option of self-declaring a short-term absence, as described here: https://uwaterloo.ca/registrar/current-students/undergraduate-student-short-term-absences", "Students should check their basic tests email to ensure that the code meets the specification exactly.", "If ill, please complete a complete a Verification of Illness Form and contact the course coordinator to discuss alternate arrangements.", "Generative AI: This course includes the independent development and practice of specific skills, such as writing and reading code, tracing, and algorithm design.", "Library for research-based assignments"]}, {"course_id": 1, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 2, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 3, "course_code": "MATH 227", "course_name": "MATH227 - Calculus 3 for Honours Physics (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Email: pmcgrath@uwaterloo.ca", "Directional derivative and the chain rule for multivariable functions.", "Double and triple integrals on simple domains; transformations and Jacobians; change of variable in multiple integrals.", "Vector fields, divergence and curl.", "Vector integral calculus: Line and surface integrals, Green's Theorem, Stokes' Theorem, Gauss' Theorem, conservative vector fields.", "Work in and convert between Cartesian and polar coordinates in two-dimensions or Cartesian, cylindrical, and spherical coordinates in three-dimensions.", "Plot and describe the behaviour of a vector field.", "Determine using a variety of tests if a vector field is conservative.", "Understand the fundamental differences between conservative and non-conservative vector fields.", "Determine the extreme values of a function of multiple variables.", "This course covers a selection of topics from multivariable vector calculus.", "In particular, we will aim to cover one item per week from the following list:", "Arc length and line integrals.", "Quadric surfaces and coordinate systems.", "Extrema of multivariable functions and Lagrange multipliers.", "A previous course in linear algebra is strongly recommended.", "I will also share short videos each week in which I work through examples and/or discuss particularly important concepts.", "I will also post problem sets with full solutions each week so that you have plenty of practice problems to work through.", "Discussion", "You can join our Piazza forum at", "To be clear - such websites are not allowed to be used for the completion of any assessment in MATH 227."]}, {"course_id": 4, "course_code": "MATH 228", "course_name": "MATH228 - Differential Equations for Physics and Chemistry (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Differential Equations for Physics and Chemistry Winter 2025", "First-order equations, second-order linear equations with constant coefficients, series solutions and special functions, the Laplace transform method.", "Applications in physics and chemistry are emphasized.", "Differential equations capture how some variable of interest, such as the position of a planet, changes as a function of some independent variable, such as time.", "Differential equations are very widely used in the sciences because of the broad range of real-world phenomena they can describe in a mathematical framework.", "In this course, students will be introduced to the universe of differential equations, including first-order equations, second-order linear equations, series solutions, the Laplace transform method, and both exact and numerical methods for solving differential equations.", "Applications in physics and chemistry will be emphasized.", "understand how differential equations can be used to model physical systems,", "know how to classify differential equations,", "know how to solve various classes of differential equations using numerical methods and exact methods, and", "Unit 2 - First-Order Differential Equations (Weeks 2 - 3)", "Unit 3 - Second-Order Linear Equations (Weeks 4 - 5)", "Unit 4 - Mechanical and Electrical Vibrations (Week 6)", "Unit 5 - Series Solutions of Second-Order Linear Equations (Weeks 7 - 8)", "Unit 8 - Systems of Differential Equations (Weeks 11 - 12)", "In particular, it includes lots of helpful practice problems.", "To be clear - such websites are not allowed to be used for the completion of any assessment in MATH 228.", "Email a scanned copy of the Verification of Illness Form to your instructor."]}, {"course_id": 5, "course_code": "PHYS 121", "course_name": "PHYS121 - Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["An introductory course in physics for students intending to concentrate their future studies in the physical sciences, optometry, or mathematics; includes vectors (dot and cross products), particle kinematics and dynamics, forces in nature, work and energy, conservation of energy and linear momentum, rotational kinematics and dynamics, and conservation of angular momentum.", "Doing Physics - quantities, dimensions, units", "Point Dynamics - force, motion, Newton's laws", "Conservation of Energy - work and energy, conservative systems", "Conservation of linear Momentum - momentum and systems of particles", "Understand the following concepts:", "- Linear kinematics: the relationship between distance, velocity and acceleration.", "- Linear dynamics: a consequence of forces and momentum, and how they interrelate.", "- Kinetic energy, potential energy, work, and their interrelationships.", "We will also re-examine these concepts in a rotating coordinate frame using angular kinematic variables along with torque and angular momentum.", "6 Module 06:  Kinetic and Potential Energy", "7 Module 06:  Kinetic and Potential Energy", "8 Module 07:  Linear Momentum", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- eText + Student Access Code", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- Print Format + Student Access Code"]}, {"course_id": 6, "course_code": "PHYS 121L", "course_name": "PHYS121L - Mechanics Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Mechanics Laboratory Fall 2024", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "Julian Meunier", "Soorna Choheili", "Reza Asadi", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "complete introductory surveys", "complete introductory surveys,", "Complete end-of-term surveys", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 7, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 8, "course_code": "PHYS 122L", "course_name": "PHYS122L - Waves, Electricity and Magnetism Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 2 - Circuits", "Experiment 5 - Magnetic Fields of a Coil", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 9, "course_code": "PHYS 124", "course_name": "PHYS124 - Modern Physics (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Songmin Xu s83xu@uwaterloo.ca", "Mastering Physics technical support: https://support.pearson.com/getsupport/s/", "This is a fast-paced survey course (covering about one textbook chapter per week) introducing a wide range of topics in modern physics.", "The intention is four-fold: (1) to make first-year physics more interesting; (2) to provide important, intuitive understanding of key modern physics concepts before your more mathematically rigorous courses in second year; (3) to help you decide which areas of physics you may wish to explore in more depth in upper-year electives; and (4) to have at least a brief introduction to important branches of physics you may not explore further in your degree.", "Apply Newton's second law and Newton's law of universal gravitation to solve basic problems in gravitational physics.", "Understand, distinguish between and correctly use the concepts of weight, weightlessness, and apparent weight.", "Solve simple problems in orbital motion and apply Kepler's three laws.", "Properly understand Einstein's two postulates and logically derive from them, and apply, the concepts of time dilation, length contraction, Doppler shift, velocity composition, relativity of simultaneity, and understand why special relativity works for both wave-in-ether and particle-in-vacuum models of light..", "Articulate the basic, intuitive ideas of how Einstein's geometrical model of gravity works (equivalence principle and curved spacetime).", "Appreciate that classical physics cannot explain the single or double slit experiments.", "Understand and predict basic properties of the quantum hydrogen atom based on only the de Broglie relation and classical properties of electron orbits.", "Understand the basic idea of a complex number, and in particular, a complex exponential wave, and use it to \"derive\" the Schrodinger equation.", "Use classical and quantum physics to understand/calculate ionic bonds, covalent bonds, van der Waals bonds, and basic molecular spectra.", "Use classical and quantum physics to understand/calculate the basic features of atomic nuclei, including nuclear binding energy, nuclear models, nuclear stability and radioactivity, nuclear reactions, nuclear fission, and nuclear fusion.", "Use classical and quantum physics to understand/calculate some basic aspects of collider physics, including the concept of available energy, and an introduction to the Standard Model of particle physics.", "Feb 24 Wave Functions Wave Functions", "Mar 17 Nuclear Nuclear", "Mastering Physics:", "Every student in PHYS 124 is expected to treat their peers and their instructor with kindness, fairness, tolerance, and respect.", "This extends to welcoming the opinions of others and being considerate of their lived experiences.", "Library for research-based assignments"]}, {"course_id": 10, "course_code": "PHYS 160L", "course_name": "PHYS160L - Introductory Measurement Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["To gain experience with handling data and interpreting graphical outcomes, estimating experimental error and calculation of uncertainty", "This course includes the independent development and practice of specific skills, such as lab report preparation.", "Library for research-based assignments"]}, {"course_id": 11, "course_code": "PHYS 234", "course_name": "PHYS234 - Quantum Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["11:30AM - 12:20PM DC 1351", "K. Islam", "Introduction to formalism of quantum physics.", "Introduction to operators.", "Background: understanding why we need a quantum theory", "Learning the building blocks of a quantum theory: state vectors and operator", "Jan 06, 08, 10 Introduction to Quantum Physics, Stern-Gerlach experiments 1", "Jan 20, 22, 24 Matrix notation, general quantum systems, operators 2", "Mar 10, 12, 14 Continuous quantum systems – formalism, infinite potential well,", "Mar 17, 19, 21 Continuous quantum systems – infinite potential well (continued), finite potential well 5", "Mar 24, 26, 28 Continuous quantum systems – quantum harmonic oscillator 9", "Mar 31, Apr 02, 04 Continuous quantum systems (continued), Review", "Students should start checking for posted exam dates:", "Everyone needs a support system.", "Every student in PHYS 234 is expected to treat their peers and their instructor with kindness, fairness, tolerance, and respect.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 12, "course_code": "PHYS 242", "course_name": "PHYS242 - Electricity and Magnetism 1 (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["10:30AM - 11:20AM RCH 301", "calculate electric fields and potentials for charged systems such as a collection of point charges and charge-carrying rods/surfaces/spheres.", "calculate the interactions between a charge and a conductor and understand the electric properties of conductors.", "calculate electric potentials by solving Laplace's equations for various geometries.", "calculate magnetic fields of current-carrying wires/planes and other geometries.", "calculate the magnetic vector potentials of current-carrying wires and solenoids.", "•Electromagnetic induction: Chapter 7", "Introduction to Electrodynamics, 4th or 5th Etd.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 13, "course_code": "PHYS 249", "course_name": "PHYS249 - Computational Physics and Linear Algebra (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Computational Physics and Linear Algebra Fall 2024", "10:30AM - 12:20PM DC 1350", "Email: brenda.lee@uwaterloo.ca", "Computational techniques; numerical accuracy and speed; Python libraries and implementation; algorithms for numerical integration; matrix operations.", "Computational approach to vectors in 2- and 3-space; linear equations, matrices, determinants; eigenvalues and diagonalization.", "Resource Details", "These will not be recorded and consist primarily of board work.", "Understand and apply the basic concepts of vectors, matrices and linear transformations", "Interpret the geometric meaning of vector spaces, subspaces, linear independence, basis and dimension", "Perform matrix operations including addition, multiplication, transposition and inversion both manually and using Python libraries such as NumPy", "Solve systems of linear equations manually and computationally using LU decomposition and Gaussian elimination", "Calculate eigenvalues and eigenvectors of matrices manually and computationally; and interpret their significance in physics applications", "Apply diagonalization techniques to solve differential equations relevant to physics problems", "Understand inner product spaces and concepts of length and orthogonality in both theoretical and computational settings", "Describe and represent linear transformations using matrices; and their contribution to geometric objects and physical systems", "Develop iterative and computational skillsets through Python to model and simulate physical systems with the help of linear algebra concepts", "Identify and articulate transferable skills from their science courses and connect these to the Future Ready Talent Framework", "Create accomplishment statements that effectively communicate these skills on their resumes", "Thursdays Tutorial and Skills Identification & Articulation Workshop @ 10:30am - 12:20pm", "Not all topics may be covered in their entirety, but the core topics from the course calendar description will.", "Topic 1: Intro to Course, Linear Algebra & Python Programming", "2 Sep 9-13 Topic 3: Spanning and Linear Independence", "Topic 5: Projections and Applications", "Skills Identification & Articulation Worksheet 0", "Topic 6: Visualization and Solving of Vector Operations using Python", "Topic 7: Systems of Linear Equations, Gaussian Elimination and Back-Substitution", "Topic 9: Applications of Systems of Linear Equations with Computational Methods and Visualization with Python", "Topic 10: Matrix Addition and Multiplication", "Topic 11: Transpose, Identity and Inverse of a Matrix", "Skills Identification & Articulation Worksheet 1", "Topic 12: Matrix Factorizations", "Topic 13: Computational Methods in Matrix Algebra", "Topic 14: Vector Spaces and Subspaces", "Topic 16: Visualization of Vector Spaces through Computational Methods Skills Identification & Articulation Worksheet 2", "Topic 18: Computational Methods using Determinants", "Topic 19: Eigenvalues and Eigenvectors with Matrix Diagonalization", "Topic 22: Least Squares Approximations Skills Identification & Articulation Worksheet 3", "Topic 23: Numerical Approximation Methods", "UNIT 8 | COMPLEX VALUES & COMPUTATIONAL APPLICATIONS", "Topic 24: Complex Numbers & Computational Applications", "Jan 21: Standing decisions and official grades available in Quest", "Instructions and installation guidance will be provided at the beginning of the term on LEARN Yes", "An Introduction to Linear Algebra for Science and Engineering Excellent book that we will be using in this course; highly recommend getting this if you can No", "Linear Algebra: A Modern Introduction, 4th Edition, David Poole Good elementary book which has suitable problems for scientists No", "Computational Physics, 2nd Edition, Mark Newman Great for beginners to computational physics with Python No", "Introduction to Linear Algebra, 6th Edition, Gilbert Strange (MIT) Excellent mixture of linear algebra and optimization / data science but no physics applications No", "You are encouraged to explore the topics of linear algebra and computational physics / numerical methods of analysis through these recommended textbooks and materials above for your own benefit and enhanced learning experience.", "HOMEWORK (15% Completion Grade): I'm giving you free marks to practice, practice, practice and show you've put in the time to do some linear algebra!", "Level of Collaboration Allowed: Not Monitored", "Do them by the end of the next week to get grades.", "Level of Collaboration Allowed: None - Screening for Plagiarism Active - Debugging Support on Discord is Allowed", "Frequency: Once in the Middle of the Term", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Level of Collaboration Allowed: Groupwork Allowed", "Grading: Based on completion and suitability of responses", "The written content will primarily be code and Jupyter Notebook files.", "Code plagiarism includes moderate to significant reproduction of other's work (source code from available resources, code from classmate submissions, fragments of original code, etc.)", "Notice of Recording", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 14, "course_code": "PHYS 256", "course_name": "PHYS256 - Geometrical and Physical Optics (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Geometrical and Physical Optics Fall 2024", "09:30AM - 10:20AM DC 1350", "Email: kfelefel@uwaterloo.ca", "Email: jspodek@uwaterloo.ca", "Email: tlismer@uwaterloo.ca", "Geometrical optics: image formation, ray tracing through multiple optical components, dispersion by prisms, optical fibers, optical instruments - eyes, telescopes, microscopes, and cameras, introduction to aberrations; physical optics: interference and interferometers, diffraction, imaging resolution, diffraction gratings and their use in spectroscopy; wave-particle duality; introduction to the electromagnetic nature of light and polarization.", "Have a clear understanding of physics behind imaging (such as mirrors and lens)", "Visualize and draw diagrams demonstrating the optical properties of light and interactions with materials and optical components", "Be familiar with common optical instruments", "Distinguish and explain the optic and photonic concepts of reflection, refraction, diffraction, interference etc.", "Understand the wave-particle duality of light and link it to the theories and equations related to electromagnetism", "Solve optics problems", "Introduction to optics, Reflection and refraction, Fermat’s Principle", "No tutorial in the first week", "Dispersion through prism", "Introduction to the physical properties of light", "Scattering and adsorption", "Diffraction", "You may work with other people, but should specify the names of your collaborators in your submissions, and your write-up should be yours alone.", "Exams", "In particular, in case of sickness, a VIF must be filled in."]}, {"course_id": 17, "course_code": "PHYS 263", "course_name": "PHYS263 - Classical Mechanics and Special Relativity (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Classical Mechanics and Special Relativity Winter 2025", "08:30AM - 09:20AM", "Newtonian dynamics of particles and systems of particles.", "You will be expected to become fluent in solving the problems covered in this course using a variety of approaches (e.g. forces, torques, and energy conservation).", "Classical Dynamics of Particles and Systems (5th edition)", "Notice of Recording"]}, {"course_id": 18, "course_code": "PHYS 267", "course_name": "PHYS267 - Probability, Statistics, and Data Analysis for Physics and Astronomy (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["The True Logic for this World (aka Probability, Statistics and Data Analysis for Physics and Astronomy)", "I love this material and I hope that my interest and enthusiasm will be contagious!", "\"We shall not cease from exploration And the end of all our exploring Will be to arrive where we started And know the place for the first time.\"", "Rationale behind selection of book by Spiegel: This book does not have any information specific to physics, nor is it particularly interesting, but it does cover the basic mechanics of probability and statistics quite well.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 19, "course_code": "PHYS 334", "course_name": "PHYS334 - Quantum Physics 2 (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "04:30PM - 05:20PM", "Formalism of quantum mechanics.", "Identical particles.", "Applications in atomic and molecular physics.", "Physically predict, and mathematically model, the outcome(s) after measuring a quantum system", "Understand and model the difference between a single measurement outcome and an ensemble average", "Predict the time dependence of a quantum system, given its initial state and Hamiltonian", "Use commutator identities to check commutation relations for operators", "Write the position and momentum operators in terms of the harmonic oscillator ladder operators, and vice versa", "State the commutation relations that define a set of angular momentum operators", "State the spectrum (allowed eigenvalues) of the angular momentum operators 𝐽^2 and 𝐽_𝑧, in terms of quantum numbers 𝑗 and 𝑚", "State the restrictions on the 𝐽^2 and 𝐽_𝑧 eigenvalues, in terms of restrictions on their associated quantum numbers 𝑗 and 𝑚", "State the effect of all angular momentum operators on the joint eigenstates of 𝐽^2 and 𝐽_𝑧", "Compute the matrix representations of the angular momentum operators for a given 𝑗, in the joint eigenbasis of 𝐽^2 and 𝐽_𝑧", "Describe the eigenfunctions of orbital angular momentum (spherical harmonics) in the position basis", "For systems with “central” potentials (those that depend only on a radial coordinate), describe the decomposition of the energy eigenfunctions into their angular and radial components", "Describe the energies and eigenstates of the hydrogen atom", "Describe the degeneracy of different energy eigenstates of the hydrogen atom", "State two possible complete sets of mutually commuting operators (CSCOs) whose eigenstates can be used as bases to describe a set of two angular momenta", "State the eigenvalues of the CSCOs used to describe a set of two angular momenta", "State the selection rules for the Clebsch-Gordan coefficients that relate the coupled and uncoupled bases of a system with two angular momenta", "Calculate perturbative energy shifts and wavefunction changes for nondegenerate systems", "Calculate perturbative energy shifts for degenerate systems, selecting an appropriate basis for the calculation", "Use the variational method to estimate the ground-state energies of simple one-dimensional problems, given a suitable trial function", "State the definition of a boson and a fermion, in terms of the spin of the particles", "State the symmetry properties of bosonic and fermionic wavefunctions", "Exams", "There will be two in-class exams given during the lecture period in our usual classroom.", "Exam 2: Wed. Mar 19 (covers material up through and including nondegenerate perturbation theory)", "HW1 - formalism and postulates - due Jan 24", "HW2 - quantum harmonic oscillator and angular momentum - due Feb 7", "HW3 - spherical harmonics and hydrogen atom - due Feb 28", "HW4 - addition of angular momentum and nondegenerate perturbation theory - due Mar 12", "Week 1 - Intro to class and mathematical formalism of quantum mechanics", "Week 4 - Angular momentum", "Week 5 - Spherical harmonics and central potentials", "Week 8 - Nondegenerate perturbation theory", "Week 9 - Degenerate perturbation theory, fine structure, Zeeman effect", "Quantum Mechanics: A Paradigms Approach, David H. McIntyre", "Introduction to Quantum Mechanics, David Griffiths", "Zettili shines in its extensive collection of worked examples and practice problems.", "Some assignment problems may be graded on a multiple choice basis.", "Notice of Recording"]}, {"course_id": 20, "course_code": "PHYS 342", "course_name": "PHYS342 - Electricity and Magnetism 2 (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM QNC 2502", "Electric and magnetic fields in media, auxiliary fields, Maxwell's equations, electromagnetic waves, electric and magnetic properties of matter.", "Electrodynamics", "Review of Vector Analysis", "Ability to calculate electrostatic fields in vacuum with various geometries.", "Ability to calculate potential fields in vacuum with various geometries", "Ability to calculate electrostatic fields in matter with various geometries using auxiliary fields", "Ability to calculate magnetostatic fields in vacuum with various geometries.", "Ability to calculate magnetostatic fields in matter with various geometries using auxiliary fields", "Understanding of the coupling of time-dependant magnetic and electric fields, Maxwell's equations", "Ability to calculate wave solutions to Maxwell's equations in media.", "3 Electric Potential 2.3-5", "5 Electric Fields in Matter 4", "7 Magnetic Fields in Matter 6  midterm", "8 Electrodynamics 7.1-2", "9 Maxwell's Equations 7.3", "11 Absorption & Dispersion 9.3-4", "Introduction to Electrodynamics, David J. Griffiths any edition Yes", "Completing this book report should prepare you for the final and most interesting topics of this course: Maxwell's equations and their wave solutions.", "Each consists of reading the textbook material covering the upcoming week's material.", "Each of these are meant to be formative.", "Library for research-based assignments", "Notice of Recording", "In the event of a longer-term cancellation of in-person meetings, whether for this particular course or University-wide, class will be held synchronously at the usual time using WebEx, Teams, or Zoom."]}, {"course_id": 21, "course_code": "PHYS 358", "course_name": "PHYS358 - Thermal Physics (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Monday, Friday -", "08:30AM - 09:20AM", "08:30AM - 09:20AM", "Name E-mail", "Name E-mail", "Dyuman Bhattacharya", "Kinetic theory of gases.", "Basic probability theory.", "Thermodynamic Functions and Maxwell's relations.", "Kinetic theory of gases.", "Basic probability theory.", "Thermodynamic Functions and Maxwell's relations.", "Describe the role of energy in thermal physics.", "Explain the Second Law of Thermodynamics and how it affects simple systems.", "Describe heat engines and refrigerators as types of thermodynamic systems.", "Calculate the free energy of simple systems and describe the relationship between free energy and other thermodynamic quantities.", "Parts of Blundell and Blundell's Concepts in Thermal Physics will complement Schroeder.", "The relevant sections of Blundell and Blundell will be announced on LEARN before class.", "1.1 Thermal Equilibrium", "Microscopic Model of an Ideal Gas", "1.4 Heat and Work", "1.3 & 1.6", "1.3 Equipartition of Energy", "1.7 & 2.1 – 2.3", "2.1 Two-State Systems", "The Two-State Paramagnet", "2.2 The Einstein Model of a Solid", "2.3 Interacting Systems", "2.4 – 2.6", "2.4 Large Systems", "Multiplicity of a Large Einstein Solid;", "Sharpness of the Multiplicity Function", "2.6 Entropy", "Reversible and Irreversible Processes", "A Silly Analogy; Real-World Examples", "3.2 Entropy and Heat", "4.1 Heat Engines", "4.2 Refrigerators", "Notation and Microscopic Physics; Numerical Solution; Analytic Solution", "3.4 Mechanical Equilibrium and Pressure", "3.5 Diffusive Equilibrium and Chemical Potential", "3.6 Summary and a Look Ahead", "Internal Combustion Engines; The Steam Engine", "5.1 Free Energy as Available Work", "5.2 Free Energy as a Force toward Equilibrium", "Extensive and Intensive Quantities; Gibbs Free Energy and Chemical Potential", "5.3 Phase Transformations of Pure Substances", "5.4 Phase Transformations of Mixtures", "Free Energy of a Mixture; Phase Changes of a Miscible Mixture;", "Phase Changes of a Eutectic System", "I will consider more real-life examples of thermodynamics applications in some sessions.", "Daniel V. Schroeder, An Introduction to Thermal Physics An online version of the textbook can be freely accessed through the University of Waterloo library.", "Stephen J. Blundell and Katherine M. Blundell, Concepts in Thermal Physics An online version of the textbook can be freely accessed through the University of Waterloo library.", "Yunus Cengel and Michael Boles, Thermodynamics An Engineering Approach No", "Here are the sections which are from references No2 (Blundell & Blundell) that will be covered in this course:", "1 Introduction                                                                       2", "2.1 A definition of heat                                                           13", "4 Temperature and the Boltzmann factor                          32", "4.1 Thermal equilibrium                                                         32", "4.2 Thermometers                                                                   33", "4.3 The microstates and macrostates                                      35", "4.4 A statistical definition of temperature                              36", "6.1 Molecular distributions                                                    57", "9.2 Thermal conductivity                                                       81", "9.3 Diffusion                                                                           83", "11 Energy                                                                               108", "11.1 Some definitions                                                            108", "11.2 The first law of thermodynamics                                   110", "13.6 Heat engines running backwards                                    133"]}, {"course_id": 22, "course_code": "PHYS 359", "course_name": "PHYS359 - Statistical Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Statistical Mechanics Winter 2025", "10:00AM - 11:20AM MC 4020", "04:30PM - 05:20PM", "02:30PM - 03:20PM", "Prof. Alan Jamison", "Wed 3:30-4:30pm in QNC 4114", "Friday 10:00-11:00am in QNC 4114", "Addison Okell", "Applications to specific heat of solids, classical and quantum gases, electrons in metals, Planck's law of radiation, and Bose-Einstein condensation.", "Make meaningful approximations and justify their validity", "Use statistical ideas to derive probability distributions for observables of large systems", "Apply statistical mechanics to problems from a variety of fields", "Understand how quantum mechanics modifies statistical mechanics and when this is relevant", "Find properties of interacting systems using mean-field theory", "2024-01-20 Continuous degrees of freedom and the Maxwell-Boltzmann distribution (6.3, 6.4) PS2", "2024-02-03 Quantum theory of bosons and fermions (6.7, 7.2) PS4", "2024-03-17 The Debye model and massive bosons (7.5, 7.6) PS8", "Study period", "An Introduction to Thermal Physics by Daniel V. Schroeder Same text as you used for PHYS 358 Yes 58.00", "If you fail to turn in a problem set for any reason, its weight will be shifted to the final exam.", "This course includes the independent development and practice of specific perspectives and methods of rigorous thought.", "Library for research-based assignments"]}, {"course_id": 23, "course_code": "PHYS 360A", "course_name": "PHYS360A - Modern Physics Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["01:30PM - 05:20PM", "View requirements for PHYS 360A", "Continuation of PHYS360A.", "View requirements for PHYS 360B", "A continuation of PHYS460A.", "Gain direct experience with measurements and analysis of physical phenomena across a broad range of topics in modern physics.", "Use systematic methods of data collection and analysis and the clear and accurate reporting of results in their work.", "Develop knowledge on the function and use of a wide variety of the physical instruments used to obtain measurements", "Lab Notebook For making record of your activities and data in the lab Yes 12", "This course includes the independent development and practice of specific skills, such as writing the lab reports.", "Library for research-based assignments"]}, {"course_id": 24, "course_code": "PHYS 363", "course_name": "PHYS363 - Intermediate Classical Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Intermediate Classical Mechanics Fall 2024", "Rigid body mechanics", "Set up Lagrangians and Hamiltonians for a wide range of physical systems", "Find and solve equations of motion using Lagrangian and Hamiltonian mechanics", "Work in noninertial reference frames to solve problems and recognize the consequences of fictitious forces", "Find equations of motion for coupled oscillators and solve linearized equations", "Calculate the inertia tensor of objects and understand the physics of rotating rigid bodies", "Identify conserved quantities using cyclic coordinates, Noether's theorem, and Poisson brackets", "Lagrangian formulation of mechanics and applications (TM Ch 7)", "Hamiltonian formulation of mechanics and applications (TM Ch 7)", "Classical Dynamics of Particles and Systems 5th edition, Thornton and Marion Same text as PHYS 263 Yes", "Python, including several common packages Yes", "A good all round upper-year undergraduate mechanics text.", "Widely used as a graduate level classical mechanics text.", "Introduction to Classical Mechanics: Morin.", "Assignment marks: The mark for each assignment will be based on answers to a subset, possibly all, of the Marked Problems.", "The lowest assignment grade will be removed for calculating the assignment mark.", "Those that require numerical calculations must be worked out using Python.", "These programs are not a substitute for thinking; they should be used sparingly and judiciously as they can become a crutch and will not be available on the midterm or final exams, which account for most of the marks in the course.", "Electronic distractions:  If you can't refrain from using electronics in a distracting way, please show consideration to your peers and sit at the back of the room.", "The assignment weight for the final grade will be reduced and the final exam weight will be increased commensurately for the course grade."]}, {"course_id": 25, "course_code": "PHYS 364", "course_name": "PHYS364 - Mathematical Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Fourier series and introduction to Fourier transforms.", "Lectures (live + pdf slides) + textbook readings to introduce & explain theory", "Assignments to practice solving problems and test learning", "solve second-order differential equations of the Sturm-Liouville type", "understand the role of initial/boundary conditions, and recognize well-posed problems", "recognize other common families of orthogonal functions, and understand their mathermatical and physical applications", "understand the definition, properties and use of common special functions", "Overview of PDEs, separation of variables, Legendre functions, Bessel functions, the Hermite equation, Sturm-Liouville theory", "Mathematical Methods in the Physical Sciences 3rd edition, Mary Boas, ISBN-13 978-0-471-19826-0 Yes", "It is often used in Mathematical Physics II, and has been used for several years, so second-hand copies may be available.", "ASSIGNMENTS & TESTS:", "The instructor will consider these requests and make a decision, which may include no action, an adjustment to the mark on a single question, or a full remarking of the entire test."]}, {"course_id": 26, "course_code": "PHYS 365", "course_name": "PHYS365 - Mathematical Physics 2 (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Additional information regarding submission procedures can be found below.", "Complex variables, Cauchy-Riemann conditions, Cauchy integral formula, Taylor and Laurent expansions, residue theorem, contour integrals and applications.", "perform contour integrals", "employ Green functions to solve differential equations", "construct and manipulate complex power series expansions+", "Complex Variables and Cauchy-Riemann Condition Week 1 - 2 Chapter 18", "Contour integration  Week 3 - 4 Chapter 18", "Alec J. Schramm, Mathematical Methods and Physical Insights No $69", "David and Hannah Yevick, Fundamental Math and Physics for Scientists and Engineers No $40 - $70", "The course and homework problems will generally follow the first of the two textbooks."]}, {"course_id": 28, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 29, "course_code": "PHYS 360B", "course_name": "PHYS360B - Modern Physics Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["01:30PM - 05:20PM", "View requirements for PHYS 360A", "Continuation of PHYS360A.", "View requirements for PHYS 360B", "A continuation of PHYS460A.", "Gain direct experience with measurements and analysis of physical phenomena across a broad range of topics in modern physics.", "Use systematic methods of data collection and analysis and the clear and accurate reporting of results in their work.", "Develop knowledge on the function and use of a wide variety of the physical instruments used to obtain measurements", "Lab Notebook For making record of your activities and data in the lab Yes 12", "This course includes the independent development and practice of specific skills, such as writing the lab reports.", "Library for research-based assignments"]}, {"course_id": 30, "course_code": "PHYS 370L", "course_name": "PHYS370L - Astronomy Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["PHYS 370L", "07:00PM - 09:50PM", "More details can be found in the first post, so please sign up ASAP so you can start asking/answering questions.", "View requirements for PHYS 370L", "create a detailed observing plan for an astronomical experiment", "collect observational data using modern equipment, such as CCDs and robotic telescopes", "scientifically analyze observational data using research-grade software packages", "describe an astronomical experiment and communicate the results in a format suitable for a peer-reviewed publication", "Set A", "Set B", "Experiment C2: Find the faintest stars that can be detected from our observatory!", "Since clear skies are uncommon this time of year, please collect your data at the earliest opportunity; we will attempt to make every clear night during the term (Monday – Friday, and likely including weekends and reading week) available for observation.", "Collaboration Rules:", "you are encouraged to discuss and critically analyze ideas with your colleagues in order to better understand the principles and concepts in these labs, but you may not share partially or fully completed work or your electronic files with anyone", "late reports will be penalized at a rate of 2 marks per day out of 100 total (weekends and holidays/study days/reading week do not count)", "late reports will be accepted for a maximum of 10 working days; please contact the instructor to make arrangements if your report might be later than this", "Report of minor typos is appreciated but will be worth less than something that could result in a real misunderstanding of some part of an experiment (you are welcome to make your case for how important the typo is).", "We understand that these circumstances can be troubling, and you may need to speak with someone for emotional support.", "This extends to welcoming the opinions of others and being considerate of their lived experiences.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 31, "course_code": "PHYS 391L", "course_name": "PHYS391L - Electronics Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["PHYS 391L", "01:30PM - 05:20PM", "View requirements for PHYS 391L", "This lab course is designed to provide direct experience with the components and concepts studied in the PHYS 391 course.", "You will learn basic and advanced features of an oscilloscope, as it will your primary tool when investigating the circuits.", "This laboratory course covers experiments on diodes, oscillators, power supplies, junction and FET transistors, transistor amplifiers, transistor equivalent circuits and operational amplifiers.", "The hands-on experience in this course will deepen your understanding of these components and more.", "Connect, calibrate and use standard and specialized lab equipment, particularly an oscilloscope", "Wire up circuits, and correctly identify and use of a variety of electrical devices", "Apply methods of careful data collection and reasonable data analysis", "Interpret the physical meaning of experimental results, and validate their integrity, using related theory", "Identify and explain the concepts that are critically relevant to the experimental methods employed", "2. Diodes and Basic Power Supply Feb 5 @ 1:30pm Feb 7 @ 8:00am", "3. Bipolar Transistor Characteristics and Amplifier Feb 26 @ 1:30pm Feb 28 @ 8:00am", "4. Field Effect Transistor Characteristics and Amplifier Mar 12 @ 1:30pm Mar 14 @ 8:00am", "5. Operational Amplifiers Mar 26 @ 1:30pm Mar 28 @ 8:00am", "The intro videos must be watched before attending the scheduled lab period as they will be replacing the usual in-person introduction to the experiment and equipment.", "Please only submit your forms to the Absence Database, do not email them to your Instructor.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Late reports will be penalized at a rate of 1 mark per day (weekends and holidays do not count towards late penalties) to a maximum of 8 late marks.", "DESIGN PROJECT:", "We understand that these circumstances can be troubling, and you may need to speak with someone for emotional support.", "Generative AI: This course includes the independent development and practice of specific skills, such as analysis and discussion of experimental results.", "Library for research-based assignments"]}, {"course_id": 32, "course_code": "PHYS 460A", "course_name": "PHYS460A - Advanced Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["01:30PM - 05:20PM", "View requirements for PHYS 360A", "Continuation of PHYS360A.", "View requirements for PHYS 360B", "A continuation of PHYS460A.", "Gain direct experience with measurements and analysis of physical phenomena across a broad range of topics in modern physics.", "Use systematic methods of data collection and analysis and the clear and accurate reporting of results in their work.", "Develop knowledge on the function and use of a wide variety of the physical instruments used to obtain measurements", "Lab Notebook For making record of your activities and data in the lab Yes 12", "This course includes the independent development and practice of specific skills, such as writing the lab reports.", "Library for research-based assignments"]}, {"course_id": 33, "course_code": "PHYS 460B", "course_name": "PHYS460B - Advanced Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["01:30PM - 05:20PM", "View requirements for PHYS 360A", "Continuation of PHYS360A.", "View requirements for PHYS 360B", "A continuation of PHYS460A.", "Gain direct experience with measurements and analysis of physical phenomena across a broad range of topics in modern physics.", "Use systematic methods of data collection and analysis and the clear and accurate reporting of results in their work.", "Develop knowledge on the function and use of a wide variety of the physical instruments used to obtain measurements", "Lab Notebook For making record of your activities and data in the lab Yes 12", "This course includes the independent development and practice of specific skills, such as writing the lab reports.", "Library for research-based assignments"]}, {"course_id": 34, "course_code": "BIOL 110", "course_name": "BIOL110 - Biodiversity, Biomes, and Evolution (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Labs begin the week of **Sept. 9**", "(Any issues in laboratory should contact Dr. Wolff)", "Monitor LEARN for important information", "A survey of organisms that inhabit a range of aquatic and terrestrial ecosystems (e.g., coral reefs, lakes, forests).", "Evolutionary and ecological frameworks will be used to explore how organisms diversify and are considered distinct species.", "The laboratory for this course is integrated with the lecture (unlike some of your other first year courses) - you will need to be sure to read the lab exercises before attending, and come prepared for our outdoor labs where appropriate shoes and clothing are necessary for the weather.", "I teach courses in ecology, evolution and genetics.", "I have been teaching evolution and ecology at the University of Waterloo for 7 years, and I hope to share with students my enthusiasm for phylogenetics.", "List themes and characteristics that differentiate the major groups of eukaryotes.", "Identify specific animals that facilitate and/or endanger human society.", "Construct and evaluate phylogenetic trees using parsimony", "Introduction", "Phylogeny and the modern view of biological relatedness", "Ecosystems and Resource Flux", "**Oct. 28  Midterm**", "Concepts in Diversity", "Activities will include using microscopes and drawing what you see, dissections of preserved animals, and collecting benthic invertebrates from the local stream and identifying them using pictoral keys.", "Note: You can also choose to do neither and forego the bonus mark altogether, as this is voluntary.", "Participation in Research Study", "Reminder, as participation in this study is voluntary, and it is a bonus mark, students may also decide to not do either activity and forego the bonus mark altogether.", "Notice of Recording", "In the case of an unwritten final exam, your course mark will be entered as DNW (32% for calculation of overall average)."]}, {"course_id": 35, "course_code": "BIOL 130", "course_name": "BIOL130 - Introductory Cell Biology (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "An introduction to the concepts of cell biology with emphasis on (1) the structural organization of the cell and (2) the function of critical molecular processes that are characteristic of living organisms.", "Explain the fundamental elements of cells, the chemistry of life, and the major classes of biological macromolecules.", "Describe metabolism, the role of enzymes in chemical reactions, and how cells can capture, and utilize, energy.", "Explain how cells respond to signals and form cellular communities.", "Module 1 - Introduction to Cell Biology & The Cell Theory", "Module 2 - Molecules of Life", "2 Module 3 - Cells and Membranes  In-class case study", "3 Module 4 - Nucleic Acids & Information Flow", "4 Module 5 - Protein Structure, Function & Synthesis  In-class case study", "6 Module 7 - Cellular Respiration In-class case study", "In-class case study", "9 Module 9 - Cell Signalling", "10 Module 10 - Cell & Tissue Form", "and In-class case study", "11 Module 11 - DNA Replication & Cell Division Case study due", "12 Module 11 - DNA Replication & Cell Division  Term Test 1", "Official Grades and Course Access", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each module for the achieve assignments and term tests.", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines", "Library for research-based assignments"]}, {"course_id": 36, "course_code": "BIOL 130L", "course_name": "BIOL130L - Cell Biology Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "STC 4018", "02:30PM - 05:20PM", "STC 4018", "However, we do run multiple labs at the same time which means we may not always be in the office.", "Situation", "Please email Dr. Gurska directly at jola.gurska@uwaterloo.ca", "What does it mean to be a cell biologist?", "One group of scientists might explore growing tissues in a laboratory to one day produce artificial skin or organs.", "No matter what their question, cell biologists use a similar set of laboratory skills that allow them to peek inside the tiniest of biological units that make up the diversity of organisms we see around us.", "Although fundamental techniques like microscopy have hugely advanced since the invention of the light microscope, every cell biologist needs to learn how to properly use a microscope to see cells reliably.", "These can be very tricky to use properly but doing so could be the difference between a world-changing discovery and an experiment that no one can replicate.", "These and other methods that are integral to working in the cell biology field will be introduced in this laboratory and it is my hope that you will leave confident in these fundamental techniques.", "Maintain a well-organized and comprehensive lab book.", "Identify elements of a well-structured laboratory report and write some elements of a lab report.", "Assignment 3 Model Organisms and Experimental Design 3%", "I welcome any inquiries regarding AccessAbility accommodations.", "Some examples of what will be noted includes the following:", "did you complete the bioskills exercises during the first lab?", "did you behave in a respectful and professional manner in the lab?", "Using a micropipette without a tip,", "Holding a micropipette upside down with liquid in the micropipette tip,", "Setting a micropipette precariously close to the edge of the bench so that it may fall on the floor,", "Forcing the pipettes past their minimum and maximum calibrated ranges", "Keeping a thorough lab book is a critical skill learned in a biology laboratory to document key observations and procedures.", "Some reagents will already be set up to use at your bench, while others will be in dispensing bottles on the side bench or in the fume hoods, in which case the liquid must be dispensed directly from the bottles.", "These can be purchased at the W Store Essentials in the STC.", "Since many standard laboratory reagents are volatile, please consider not wearing contact lenses in the laboratory.", "When not in use, stools should be tucked away under-bench and personal items stowed underneath in cupboards.", "Finally, please remember that safety should be a collective concern.", "They will be reviewed at the end of the term for statistical purposes only.", "The goal of the draft submissions is to teach you the capabilities of Turn-it-in analysis and to encourage you to use the software to improve your paraphrasing and referencing.", "Details on how to interpret Turn-it-in reports and use the draft Dropboxes can be found under Content on LEARN.", "As outlined under Quizzes section above, please note that the BIOL 130L online multiple-choice quizzes are designed to be completed in half the time you are given.", "Expectation of Academic Integrity", "This course includes the independent development and practice of specific skills, such as scientific writing and communication.", "Poorly paraphrased information without in-text citation 5 marks off for each", "Poorly paraphrased information with in-text citation 3 marks off for each", "Well paraphrased information without in-text citation 3 marks off for each", "Lab Manual is cited in Results and/or Discussion 1 mark off for each citation", "A reference in the reference list does not have corresponding in-text citations 5 marks off for each", "An in-text citation is not in the reference list 5 marks off for each", "Misconduct; student’s name will be sent to the Associate Dean to check if this is the first misconduct"]}, {"course_id": 37, "course_code": "BIOL 150", "course_name": "BIOL150 - Organismal and Evolutionary Ecology (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Organismal and Evolutionary Ecology Fall 2023", "11:30AM - 12:20PM RCH 101", "Learn Discussion Board", "Email and Appointment Requests", "Coverage includes hypothesis testing and the nature of scientific inquiry, basic population genetics, physiological ecology, life histories, dispersal, basic population and community ecology, macroevolution, systematics and classification, as well as functional morphology.", "The theory of evolution unites the whole of biology and all living organisms into a coherent body of knowledge, allowing comparisons across all forms of life.", "Ecology describes how organisms interact with their environment and each other to create interdependent systems from microscopic to global scales.", "These disciplines are fundamentally tied together: evolution is the primary mechanism by which species adapt to their environment; ecological interactions and environmental variability drive natural selection.", "You will also carry out simulated lab assignments to test the principles of evolution, design ecological experiments to test alternate hypotheses about the conservation of species and manipulate demographic parameters to test their influence on population growth.", "Understand the principles of scientific methodology", "Define ecological and evolutionary terms, such as the niche, adaptation, and altruism", "Illustrate these mechanisms in the context of course examples", "Explain how ecological interactions and evolution are interconnected", "Sign code of conduct and upload to LEARN.", "2) Sept 8 Evolution for Ecology Section 1: Evolution and Ecology are Intertwined", "4) Sept 13 Evolution for Ecology", "5) Sept 15 Evolution for Ecology Section 3: Genetics and Evolution", "6) Sept 18 Evolution for Ecology Section 4: Managing the Evolution of Resistance", "9) Sep 25 Physiological Ecology Section 1: Trade-offs and Species Distributions", "15) Oct 9-13 Holiday – No classes Understanding Experimental Design Simulation due by Oct 16, 11:59 pm", "16) Oct 16 Empiricism in Ecology Understanding Experimental Design Simulation due by 11:59 pm (best 2/3 for 10%)", "It is important that you review the information below before you subscribe to the SimUText for Organismal Ecology and Evolution - Chapters at University of Waterloo.", "SimUText Application Installers", "SimUText Application Installers", "At the end of every unit, you will work individually to develop a concept map using Cmap Cloud to visually display the relationships among what you consider the key concepts in the unit.", "These should represent your personal comprehension of how the concepts relate to each other, and no two should be identical.", "Also, class will entail a lot of discussion that won’t be represented in PPT slides.", "The simulations include one on Evolution in Ecology, one on Experimental Design in Ecology and one on Population Growth.", "The learning outcome for the unit tests is to demonstrate your recall and comprehension of the material covered in the units and to incentivize keeping up with the readings and attending lectures and reviewing for the final exam.", "The learning outcome is to demonstrate recall, synthesis and integration of material learned during the course.", "The final exam will consist of multiple-choice, T/F, solve the equation type of questions and integration questions that are designed to test your basic and deeper understanding of the course concepts.", "Important note regarding tests and exams", "Unit tests will be completed for the first 4 units of the course.", "Ensure you have a reliable internet connection and functional computer to complete them – technical challenges encountered during remote completion are not an excuse for missed tests.", "I will have a limited number of printed back-ups for students in class who experience technical difficulties.", "You will need to have a reliable internet connection and functional computer to complete the exams.", "Emails can be received 24 hours per day.", "If you miss a make-up exam for any reason, you will be given a DNW, and must petition the Associate Dean of Science if you feel you missed it for a valid reason.", "At the discretion of the instructor, you may be permitted to write a make-up exam.", "The timing will be conveyed to you via e-mail if you are eligible for a make-up.", "If you follow these steps,", "I will consider granting an extension", "Students are responsible for their own behavior and should be mindful of the impact that their actions have on the wellbeing of others.", "Act in a respectful and open manner when listening to the views and ideas of others.", "Participate fully in the discussion boards: make sure your answers are to the best of your ability and that you respond to others’ posts.", "Signature"]}]