[{"course_id": 36, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 37, "course_code": "MATH 106", "course_name": "MATH106 - Applied Linear Algebra 1 (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Applied Linear Algebra 1 Winter 2025", "Systems of linear equations.", "Introduction to vector spaces.", "We will see how to solve systems of linear equations using matrix methods before studying matrices as algebraic objects in their own right.", "Next, we will learn about the fundamental concepts of span, linear independence, and basis and learn how to determine whether a set is a subspace of Rn.", "After studying subspaces, we will study linear mappings, which map subspaces to subspaces.", "We will discuss the geometric interpretation of these mappings and study their fundamental subspaces.", "Finally, we will learn how to calculate the determinant of a matrix and use this knowledge to diagonalize square matrices.", "Provide a graphical and algebraic description of vectors, lines, and planes in R^n", "Model and solve mathematical and discipline-specific problems using systems of linear equations", "Perform basic algebraic operations on matrices", "Given a set of vectors in R^n, determine whether it is linearly independent, a spanning set of R^n, or a basis of R^n", "Given a basis and a vector in standard coordinates, use matrix methods to calculate its coordinate vectors", "Given a set in R^n, determine whether it is a subspace of R^n", "Given a mapping L: R^n --> R^m, determine whether it is linear", "Given a linear mapping, choose the appropriate algorithm find a basis for each of its fundamental subspaces", "Given a square matrix, calculate its determinant and provide a geometric interpretation of this value", "Communicate ideas and concepts relating to linear algebra using accurate mathematical language and notation", "Calculators", "Avoiding Academic Offences", "I am committed to creating a learning environment where diverse perspectives are recognized and valued as a source of strength.", "School-Life Conflict"]}, {"course_id": 38, "course_code": "MATH 114", "course_name": "MATH114 - Linear Algebra for Science (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Linear Algebra for Science Winter 2025", "09:30AM - 10:20AM MC 4041", "Vectors in 2- and 3-space and their geometry.", "Linear equations, matrices, and determinants.", "Introduction to vector spaces.", "Eigenvalues and diagonalization.", "Provide a graphical and algebraic description of vectors, lines, and planes in Rn", "Model and solve mathematical and discipline-specific problems using systems of linear equations", "Perform basic algebraic operations on matrices", "Given a set of vectors in Rn, determine whether it is linearly independent, a spanning set of Rn, or a basis of Rn", "Given a basis and a vector in standard coordinates, use matrix methods to calculate its coordinate vectors", "Given a set in Rn, determine whether it is a subspace of Rn", "Given a mapping L: Rn --> Rm, determine whether it is linear", "Given a linear mapping, choose the appropriate algorithm find a basis for each of its fundamental subspaces", "Given a square matrix, calculate its determinant and provide a geometric interpretation of this value", "Perform arithmetics with complex numbers", "Use properties of modulus and conjugate of a number to perform arithmetics with complex numbers", "Calculate the product of complex numbers using the polar form", "Use quadratic formula to solve quadratic equations with complex roots", "Communicate ideas and concepts relating to linear algebra using accurate mathematical language and notation", "Unit 1: Vectors in Rn", "Jan 13 - 17 Unit 2: Systems of Linear Equations Möbius Quiz 1 In-person, during", "Mar 3 - 7 Unit 6: Linear Mappings Möbius Quiz 6 In-person, during", "Notice of Recording"]}, {"course_id": 39, "course_code": "EARTH 436B", "course_name": "EARTH436B - Honours Thesis (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["All students will be encouraged to consider formatting their research report as a journal paper with the potential to be submitted for publication consideration to a journal at the end of the course.", "OPTION A - Journal Paper Manuscript", "OPTION B - Conventional Thesis", "Obtain a past BSc thesis similar in scope to the research topic to be used as a guide document.", "The advisor can assist in selecting and providing an appropriate example.", "Plan and conduct independent and original research under the guidance of a research manager", "Learn discipline-specific protocols and procedures for addressing scientific questions and procedures and formats for reporting technical information according to discipline or sub-discipline standards", "Acquire an appreciation for and basic skill level to organize, interpret, and identify relevance of new information and results", "Understand how to organize, communicate effectively and disseminate clearly new information to peers and other professionals, both written and orally", "ACTIVITIES & DUE DATES", "No meeting", "No meeting", "Poster Session EIT Foyer in Museum", "Examples of past posters and final reports will also be provided as reference materials.", "Progress Report (15%): Progress reports should contain an updated clear statement of goal(s) and objectives of the research, a brief description of methods, an analysis of progress and problems, and a realistic timetable for completion of the remaining stages of the research project.", "This will be followed by a question-and-answer period.", "The letter of explanation and a revised timetable for completion must also be sent to the course instructor (drudolph@uwaterloo.ca).", "These electronic theses will be stored by the library and accessible online.", "The instructions for binding can be found at:", "Plagiarism is a very serious charge and can ruin promising careers.", "While generative AI technologies can provide general background information, you are responsible for demonstrating your application of knowledge by reporting, interpreting, and explaining your experimental findings in the context of the primary literature.", "Library for research-based assignments"]}, {"course_id": 40, "course_code": "PHYS 111", "course_name": "PHYS111 - Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["An introduction to physics for students intending to concentrate their further studies in biology, dentistry, medicine and paramedicine; includes particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.", "The main physics principles and laws covered in PHYS 111 include: “Particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.”", "PHYS 111 focuses on basic physics principles and laws, on conceptual understanding and problem-solving skills, and an appreciation for the power of physics in explaining how nature works, in the contexts of both the physical and life sciences.", "Physics Principles and Laws: By the end of the course, students will be able to construct scientifically sound explanations of a variety of basic physical phenomena by applying basic physics principles/laws.", "define linear momentum, and calculate and compare momenta of various real-life objects;", "define and calculate impulse, and establish the conditions for conservation of linear momentum; and", "apply the laws of conservation of momentum and energy to collisions.", "Problem-Solving Skills and Strategies: By the end of the course, students will be able to creatively apply a variety of structured problem-solving strategies:", "interpret, visualize and convert the problem into a physical model (e.g., draw a free body diagram);", "evaluate the result — does it make sense?", "These problem-solving skills are useful in the students’ own disciplines and beyond.", "More detailed information about the course elements which contribute to the final grade will be given in the learn sight and in future outline updates", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 41, "course_code": "PHYS 111L", "course_name": "PHYS111L - Physics 1 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "Derin Erisoglu-Akyildiz", "Saba Karimi", "Do Yun Park", "jbschrie@uwaterloo.ca", "s38karim@uwaterloo.ca", "first for minor issues", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "12 & 13", "Complete end-of-term surveys before Dec. 3", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 42, "course_code": "PHYS 121", "course_name": "PHYS121 - Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["An introductory course in physics for students intending to concentrate their future studies in the physical sciences, optometry, or mathematics; includes vectors (dot and cross products), particle kinematics and dynamics, forces in nature, work and energy, conservation of energy and linear momentum, rotational kinematics and dynamics, and conservation of angular momentum.", "Doing Physics - quantities, dimensions, units", "Point Dynamics - force, motion, Newton's laws", "Conservation of Energy - work and energy, conservative systems", "Conservation of linear Momentum - momentum and systems of particles", "Understand the following concepts:", "- Linear kinematics: the relationship between distance, velocity and acceleration.", "- Linear dynamics: a consequence of forces and momentum, and how they interrelate.", "- Kinetic energy, potential energy, work, and their interrelationships.", "We will also re-examine these concepts in a rotating coordinate frame using angular kinematic variables along with torque and angular momentum.", "6 Module 06:  Kinetic and Potential Energy", "7 Module 06:  Kinetic and Potential Energy", "8 Module 07:  Linear Momentum", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- eText + Student Access Code", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- Print Format + Student Access Code"]}, {"course_id": 43, "course_code": "PHYS 121L", "course_name": "PHYS121L - Mechanics Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Mechanics Laboratory Fall 2024", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "Julian Meunier", "Soorna Choheili", "Reza Asadi", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "complete introductory surveys", "complete introductory surveys,", "Complete end-of-term surveys", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 44, "course_code": "PHYS 112", "course_name": "PHYS112 - Physics 2 (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:30AM - 11:20AM DC 1350", "S. Idziak", "08:30AM - 09:20AM", "Email: idziak@uwaterloo.ca", "Email: james.forrest@uwaterloo.ca", "A continuation of PHYS111; includes simple harmonic motion, electrostatic force and potential, electric current and power, DC circuits, magnetic field and induction, wave motion, sound, and optics.", "To develop the ability to solve problems in areas related to oscillations and waves, electricity and magnetism, and optics", "Understand physical concepts associated with oscillations, waves, sound, electricity and magnetism, and optics", "Apply concepts of force and energy and recognize when acceleration is not constant", "Solve simple physical systems using physical concepts", "Draw relevant sketches from information given in word problems", "Develop physically relevant equations from information given in word problems", "Convert complex problems into a series of sub-problems and solve", "Topic Textbook Chapters                                                                            Number of lectures", "Electric Forces & Fields (Serway) Chapter 15: 1-5", "Electric Potential & Energy (Serway) Chapter 16", "Current and Resistance (Serway) Chapter 17: 1-6", "Magnetic Flux & Induction   1", "College Physics: A Strategic Approach by Jones, Knight, and Field This was suggested for 111.", "I do not find that these books are great but they are available for no cost.", "Please help to create a welcoming and inclusive environment.", "An exam-like problem will be posted each week on LEARN.", "2 points will be given for each clicker response with an additional 1 point for each correct response.", "What happens if I join the course late:", "Missed a regular assignment:", "Emails can be received 24 hours per day.", "Remember that falsely claiming you are ill can result in academic polices per Policy 71.", "Email communications:", "Notice of Recording"]}, {"course_id": 45, "course_code": "PHYS 112L", "course_name": "PHYS112L - Physics 2 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Sean Dougherty", "Aney Kapadia", "Kayra Erisoglu-Akyildiz", "jbschrie@uwaterloo.ca", "s2doughe@uwaterloo.ca", "Course Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"'", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 3 - Circuits", "Experiment 4 - Circuits", "Experiment 5 - Circuits", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 46, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 47, "course_code": "PHYS 122L", "course_name": "PHYS122L - Waves, Electricity and Magnetism Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 2 - Circuits", "Experiment 5 - Magnetic Fields of a Coil", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 48, "course_code": "CS 100", "course_name": "CS100 - Introduction to Computing Through Applications (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Computing Through Applications Winter 2025", "Friday -", "Friday", "10:30AM - 12:20PM MC 3005", "10:30AM - 12:20PM MC 3027", "Dave Tompkins", "E-mail: dtompkins@uwaterloo.ca", "E-mail: cs100@uwaterloo.ca", "Introduction to the Internet, World Wide Web, HTML, and XML.", "Algorithms underlying the functional components of web search engines and their influence on data access.", "CS 100: Introduction to Digital Information, Computers, the Internet and Applications", "Explain the emerging computing technologies introduced in the course.", "Digital Information", "Computer + Network organization", "Dynamic web pages and web applications", "Privacy and security", "Emerging Topics", "Distributed networking and \"big data\"", "Artificial intelligence", "ChatGPT and large language models", "Social media and monetization", "A1 released", "Laptops, Devices and Software", "Library for research-based assignments"]}, {"course_id": 49, "course_code": "MATH 103", "course_name": "MATH103 - Introductory Algebra for Arts and Social Science (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introductory Algebra for Arts and Social Science Winter 2025", "Email: jen.nelson@uwaterloo.ca", "Topics will be chosen from linear equations, systems of linear equations, linear inequalities, functions, set theory, permutations and combinations, binomial theorem, probability theory.", "The course begins with a review of operations with real numbers and fundamental algebra skills.", "The solutions of polynomial equations, both linear and quadratic, in one and two variables and their graphical representation are studied.", "An extension is made to linear systems with their solutions being expressed both algebraically and graphically.", "To solve linear systems, matrices and the associated row reduction strategies are used.", "The relationship between exponential functions and logarithmic functions is examined.", "The basic properties of logarithms are introduced and used to solve logarithmic and exponential equations.", "Various applications involving exponential growth and decay and logarithmic scales are presented.", "Concepts in set theory and counting theory support the study of probability theory.", "Perform operations with real numbers and algebraic expressions.", "Solve linear equations and inequalities in one variable, including those involving absolute value, and represent the solutions algebraically and graphically.", "Solve a system of linear equations using matrix operations, introducing a free variable, or parameter as appropriate.", "Solve quadratic equations in one variable.", "Recognize that the solutions to a quadratic equation in two variables lie on a curve known as a parabola and analyze the properties of a parabola.", "Describe the relationship between an exponential function and a logarithmic function.", "Use the properties of logarithms to solve logarithmic and exponential equations, and to solve problems involving exponential growth and decay, and logarithmic scales.", "Use the appropriate symbols and language in set theory to perform set operations, represent sets and subsets using Venn diagrams, and apply the counting principles for sets in real-life situations.", "1.1 Real Numbers", "1.2 Order of Operations", "1.3 Fundamental Algebraic Skills", "Unit 2: Equations and Inequalities", "2.1 Equations in One Variable", "Unit 2: Equations and Inequalities Continued", "2.3 Multivariate Equations", "Unit 3: Systems of Linear Equations and Matrices", "3.1 Systems of Linear Equations", "3.2 Introduction to Matrices and Elementary Row Operations", "Unit 3: Systems of Linear Equations and Matrices Continued", "3.3 Applications", "3.4 Systems With No Solutions and Systems With an Infinite Number of Solutions", "Unit 4: Quadratic Equations and Functions", "4.1 Quadratic Equations in One Variable", "4.2 Quadratic Equations in Two Variables and the Parabola", "4.3 Quadratic Functions", "4.4 Applications", "Unit 5: Exponential and Logarithmic Functions", "5.1 Exponential Functions and Equations", "5.2 Exponential Functions and Logarithmic Functions", "Unit 5: Exponential and Logarithmic Functions Continued", "5.4 Solving Logarithmic and Exponential Equations", "5.5 Applications", "6.1 Introduction to Sets", "6.2 Set Operations", "6.3 Counting Principles for Sets", "7.2 Combinations of Simple Events — Compound Events", "7.4 An Introduction to Random Variables and Probability Functions", "8.1 Counting Principles and Probability", "8.3 Combinations — Unordered Selections", "8.4 Binomial Models", "A non-programmable, non-graphing scientific calculator.", "Assignments may be screened by a human for evidence of plagiarism or the inappropriate use of resources.", "Notice of Recording", "instructor in advance in order to facilitate class participation.)"]}, {"course_id": 50, "course_code": "MATH 104", "course_name": "MATH104 - Introductory Calculus for Arts and Social Science (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Calculus for Arts and Social Science Winter 2025", "The major concepts introduced to solve problems are rate of change, optimization, growth and decay, and integration.", "This course provides an introduction to the applications of differential and integral calculus in business, the behavioural sciences, and the social sciences.", "A special type of limit will give rise to the derivative, the central idea in differential calculus.", "The interpretation of the derivative in applications such as rates of change and optimization, where the situations can be modelled by algebraic, exponential, or logarithmic functions, will be examined.", "The concepts of the antiderivative and the indefinite integral will be studied.", "The Fundamental Theorem of Calculus will relate the integral to the derivative.", "The problem of calculating the area under a curve will lead to the definite integral, a basic concept of integral calculus.", "The interpretation of the integral in various applications will be studied.", "be able to interpret a limit, given the graph of a function;", "evaluate the limit of a function using appropriate techniques;", "determine the derivative of polynomial functions using the definition of a derivative;", "determine the derivative of algebraic, exponential, and logarithmic functions using the techniques of differentiation;", "apply the derivative to determining equations of tangents, graphing functions, solving rate problems, and solving optimization problems;", "determine general and unique antiderivatives;", "determine the indefinite integral of a function using the techniques of integration;", "determine definite integrals; and", "Note there is a 24-hour cool-down period.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical tool-building and function sketching.", "Library for research-based assignments"]}, {"course_id": 51, "course_code": "MATH 124", "course_name": "MATH124 - Calculus and Vector Algebra for Kinesiology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 3, "major_name": "Earth Sciences - Geophysics Specialization (Bachelor of Science - Honours)", "topics": ["Calculus and Vector Algebra for Kinesiology Fall 2024", "ipayne@uwaterloo.ca", "ipayne@uwaterloo.ca", "Email address ipayne@uwaterloo.ca", "Review of trigonometry and basic algebra.", "Introduction to vectors in 2- and 3-space: sums, addition, dot products, cross products and angles between vectors.", "Solving linear systems in two and three variables.", "Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties.", "Intuitive discussion of limits and continuity.", "Derivatives of elementary functions, derivative rules; applications to curve sketching, optimization.", "3 September 16 - September 20 exponential and trig functions, limits", "6 October 7 - October 11 derivatives of trig functions, implicit differentiation, first derivative test", "11 November 18 - November 22 dot product, projections, cross product, scalar equations", "12 November 25 - November 29 solving and interpreting systems of equations", "No specific Text will be followed for this course No", "The quizzes are mean to be written in under an hour, but you will be given the entire 110 minutes.", "Final Exam: The final exam will be scheduled be written during the exam period in December."]}, {"course_id": 0, "course_code": "CHEM 120", "course_name": "CHEM120 - General Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry 1 Winter 2025", "RCH 101", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "The second part of this course is concerned with explaining periodicity and trends in chemical reactivity in terms of the electronic structure of atoms and molecules.", "Topics covered in this part of the course include the quantum theory of the hydrogen atom; electron configurations in multi-electron atoms; ionic and covalent bonding; Lewis structures, valence shell electron repulsion theory and molecular geometry; quantum mechanical bonding theories, including valence bond theory and molecular orbital theory.", "Additional topics may include an introduction to electron-transfer reactions, including the assignment of oxidation states and the balancing of oxidation-reduction reactions.", "assess the greenness of a chemical reaction using Atom Economy and E-Factor metrics.", "describe the electronic structure of atoms in terms of quantum theory using atomic orbitals and quantum numbers.", "justify the organization of the periodic table and predict trends in the properties of the elements.", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and explain molecular shape and stability in terms of electron count.", "describe the interactions of molecules in solids, liquids, and gases to compare physical and reactive properties.", "Course Structure and Continuity Plans", "No extensions will be granted for Participation Challenges, but each student can drop one participation challenge from their overall grade.", "Printed spiral bound copies of the course notes can be purchased online from the UW bookstore https://wstore.uwaterloo.ca/", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare pandemic-related illnesses on Quest (Information at this link)", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 1, "course_code": "CHEM 120L", "course_name": "CHEM120L - General Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 1 Fall 2024", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Be sure to record their name and contact information in your lab manual.", "Skillfully perform basic procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "1,3,5,7,9,11", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Sept 19 - 24", "1,3,5,7,9,11", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "1,3,5,7,9,11", "- studying cis and trans isomers", "Oct 24-29", "1,3,5,7,9,11", "Titration as an Analysis Tool", "- identify an unknown solid acid", "1,3,5,7,9,11", "Introduction to Chromatography", "- quantify a cation using ion exchange", "1,3,5,7,9,11", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 2, "course_code": "CHEM 123", "course_name": "CHEM123 - General Chemistry 2 (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry 2 Winter 2025", "09:30AM - 10:20AM STC 1012", "Introduction to chemical equilibria.", "Describe the energy and entropy changes that accompany physical and chemical changes.", "Calculate the equilibrium constant for a reaction using the standard thermodynamic properties of reactants and products.", "Predict the direction of spontaneous change for a given set of initial conditions for a variety of chemical systems.", "Apply equilibrium principles to a variety of chemical reaction types including gas-phase reactions, acid-base reactions, precipitation reactions, complexation reactions and redox reactions.", "Analyze oxidation-reduction reactions and identify species being oxidized and reduced.", "Explain the basic construction of, uses of, and the differences between galvanic and electrolytic cells.", "CHEM 120 and CHEM 123 comprise a full-year course in introductory chemistry.", "Course Structure and Continuity Plans", "Chemistry Study Hall:  Starting the 2nd week of classes, there will be a first-year study hall on Tuesdays and Thursdays at 5:30 pm - 6:50 pm in STC 1012.", "You can attend as many Study Hall Sessions as you would like - grab your friends and connect with your TAs!", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 3, "course_code": "CHEM 123L", "course_name": "CHEM123L - General Chemistry Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 2 Winter 2025", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- a real life analysis", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 4, "course_code": "EARTH 121", "course_name": "EARTH121 - Introductory Earth Sciences (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Earth Sciences Fall 2024", "Students will learn to think like a geoscientist by adopting four ways of thinking that take into account a systems approach, a variety of spatial and temporal scales, and field thinking.", "Recognize the dynamic nature of Earth through an examination of the interactive components of the Rock Cycle.", "Extrapolate meaning from everyday geologic material and predict occurrence and origin.", "Week 1: Introduction and Four Ways of Thinking 1a and 1b Discussion: Introduce Yourself", "Week 2: Introduction to Rocks 2a Field Notes Journal 2: Are minerals important?", "Week 3: Introduction to the Rock Cycle 2b Field Notes Journal 3: What do you see in the video?", "Week 4: Introduction to the Rock Classification 2c Field Notes Journal 4: Is this depiction of the Rock Cycle complete and accurate?", "Week 5: Geologic Time and Geologic Time Scale 3a and 3b Field Notes Journal 5: How do I create a simplified Geologic Time Scale?", "Please note emails can be received 24 hours per day", "Short-term Absence", "Covid-19-related Absence", "Intellectual property includes items such as:"]}, {"course_id": 5, "course_code": "EARTH 121L", "course_name": "EARTH121L - Introductory Earth Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Earth Sciences Laboratory Fall 2024", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Email: keith.delaney@uwaterloo.ca", "Sahar Soltani - sahar.soltani@uwaterloo.ca / LABS 001 & 003", "By far, the majority of people qualified as geologists spend their time using their knowledge working 'in the field', or in exploration, putting principles learned in theory and in the laboratory, into practice.", "Identify common mineral and rocks based on their identification properties", "Understand the rock cycle and how minerals and rocks are formed", "Understand the theory of plate tectonics and how it has shaped the Earth's surface over time", "Qualitatively and Quantitatively describe earthquakes and some of their processes", "Read and interpret data from both topographic and geologic maps", "Understand the immense history and geologic record of our planet", "Understand the factors influencing climate change and quantify how the planet is changing", "Will assess Mineral and Rock Identification knowledge with real samples.", "Lab 8 Earth Structures", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "Situation where VIFs are not Appropriate"]}, {"course_id": 6, "course_code": "EARTH 122", "course_name": "EARTH122 - Introductory Environmental Sciences (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Environmental Sciences Winter 2025", "08:30AM - 09:50AM STC 1012", "I hold a PhD in Earth & Environmental Sciences from the University of Waterloo (2014) and an HBSc in Earth & Environmental Sciences from McMaster University (2006).", "You might notice I'm looking pretty pregnant!", "I'm conveniently due on April 27 BUT in the unlikely even that I have a baby really early, the excellent Dr. Keith Delaney (who has taught this class for many years) will step in at the end.", "Discussions", "Questions of a personal nature", "Office: EIT 2051D (very back of Earth & Environmental Sciences main office)", "Email: msrosamo@uwaterloo.ca", "Grad TA contact info can be found in the EARTH 122L syllabus.", "Course topics include sustainable development and the availability and use of natural resources, principles of ecology and environmental science, biogeochemical cycles, climate and climate change, soils and food supply, energy systems, surface water and groundwater, waste generation and management, pollution, and catastrophic natural processes.", "Describe common global environmental issues and the role of environmental science in identifying, understanding, and solving these issues.", "Interpret and manipulate simple box models of environmental systems", "Interpret scientific diagrams and graphs pertaining to environmental science", "1 January 06 - 10 Intro to Environmental Science & Matter, Energy and Physical Environment Chps 1 & 2", "2 January 13 - 17 Earth Systems/Ecosystems & Evolution, Biodiversity, Population Ecology Chps 3 & 4", "3 January 20 - 24 Species Interactions/Community Ecology & Human Population Chps 5 & 6", "Soils & Soil Resources*", "8 February 24 - 28 Freshwater Systems/Water Resources & Marine, Coastal Systems, Fisheries Chps 11 & 12 Quiz 6 - Chapters 11 & 12 Content Mon. Mar 3  5:00PM 3", "10 March 10 - 14 Global Climate Change & Fossil Fuels: Energy Use/Impacts Chps 14 & 15", "Energy Alternatives & Mineral Resources & Mining", "Quiz 8 - Chapters 15 & 16 & 17 Content*", "12 March 24 - 28 Managing our Waste & Environmental Health Hazards Chps 18 & 19 Quiz 9 - Chapters 18 & 19 Content Mon. Mar 31 5:00PM 3", "A Look at Environmental Science and Natural Hazards & Final Exam Study Guide / Discussion", "following these guidelines: https://uwaterloo.ca/science-undergraduate-office/academic-policies-and-procedures/accommodation-illness-or-other-extenuating-circumstances."]}, {"course_id": 7, "course_code": "EARTH 122L", "course_name": "EARTH122L - Introductory Environmental Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introductory Environmental Sciences Laboratory Winter 2025", "EARTH 122L", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Sana Ahmad has a BSc degree in Honours Co-op Environmental Science with a Geoscience Specialization from the University of Waterloo.", "Discussions", "Questions of a personal nature", "Office: EIT 2046 (within the Earth & Environmental Sciences main office)", "Email: s76ahmad@uwaterloo.ca", "Please put EARTH 122L in your email subject line so I don't miss it!", "Please do not send them personal emails!", "View requirements for EARTH 122L", "Use GPS devices and GIS software to locate points of interest and create a map", "ALL LABS ARE HELD IN ROOM: EIT 1013 (ground floor of EIT  - same building as Earth Sciences Museum)", "8 February 24 - 28 Coastal Processes and Problems: Loving Our Coasts to Death?", "10 March 10 - 14 On-Campus Water Sampling and GPS Data Collection Field Sampling and Data Collection Lab around UW Campus", "13 March 31 - April 03 Landscape Geology: Glaciers and Deserts & Climate Change: Pleistocene Records, Milankovitch Cycles Lab 8: Landscape Geology and Climate Change End of Lab 7%", "Note used copies are also fine!", "The format of the final exam will be run digitally through the LEARN Quiz system in the last week of the course, not during the formal exam period.", "Notice of Recording", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "These can be completed digitally now!", "This official verification is necessary before any action can be taken and can be downloaded from the Health Services website.", "Situation where VIFs are not Appropriate", "Example citations:", "\"References"]}, {"course_id": 8, "course_code": "EARTH 123", "course_name": "EARTH123 - Introductory Hydrology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Dr. Rosamond is the International Lecturer for Water Sciences in the Department of Earth & Environmental Sciences at the University of Waterloo.", "She loves learning about water, especially nutrients and greenhouse gases in streams in rivers.", "Email: msrosamo@uwaterloo.ca", "Education", "2014 - PhD, Earth & Environmental Sciences, University of Waterloo, Waterloo, ON, Canada", "2006 - Honours BSc, Earth & Environmental Science (Sedimentology Specialization), McMaster University, Hamilton ON, Canada", "Philosophy of Teaching", "Dr. Rosamond's teaching philosophy focuses on (a) active learning techniques, including field and laboratory experience, and practical demonstrations in class, (b) building on the mathematical and chemical fundamentals in Earth Sciences.", "She is interested in adapting curricula to include experiential learning, focus on students' analytical skills, and to scaffold skills and concepts across courses in Earth & Environmental Sciences.", "Yizhi is a graduate student in Earth & Environmental Sciences at University of Waterloo, looking at groundwater contamination.", "Email: y278yuan@uwaterloo.ca", "The material is both qualitative and quantitative in nature and focuses on the circulation of water through the atmosphere, soil, groundwater aquifers, as well as looking at both the global fresh and marine water systems.", "Emphasis is placed on the physical aspects of hydrology, and the geologic and environmental factors that control the occurrence and cycling of water on Earth, as well as the impacts caused by population growth, contamination, urbanization or land use management, and climate change.", "View requirements for EARTH 123", "Describe the complexity and inter-connections of the global hydrological cycle;", "Apply basic qualitative techniques for describing earth systems processes related to water and water movements;", "Create and critique a simple water balance equation for a lake, river, or groundwater system;", "Introduce Yourself &", "All times are in China Standard Time.", "December", "Can be purchased through e-book sellers.", "These are a mix of multiple choice, matching, and mathematical questions.", "Surveys", "Discussions", "Notice of Recording", "We will assess what to do on a case-by-case basis."]}, {"course_id": 9, "course_code": "EARTH 221", "course_name": "EARTH221 - Introductory Geochemistry (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "EARTH 221", "EARTH 221 001", "EARTH 221 101", "RCH 306", "My PhD was completed in 2014 in nitrogen cycling and use of stable isotopes to understand N cycling in the Grand River, Ontario.", "EARTH 221:", "Introduction to environmental isotope geochemistry and radiometric dating.", "Basic aqueous geochemistry: pH, carbonate equilibrium, and common ions in natural waters.", "View requirements for EARTH 221", "Calculate basic geochemical parameters and create associated diagrams", "Identify applications of geochemistry for environmental problems/studies", "Present and discuss geochemical scientific literature", "Please read slides for Intro, element abundances, isotopes, chart of the nuclides, nucleosynthetic processes", "Highlights of Origin of Elements", "Periodic Table/Earth Formation", "Solar System geochemistry and planetary formation, composition of meteorites", "Chemistry of bulk Earth, atmosphere, oceans, crust, mantle, and core   A2 Misra p. 296 – 313, 326-344, 354-362", "Equilibrium constants, introduction to phase diagrams, basics of kinetics", "Basic concepts, laws of thermodynamics, Gibb's free energy.", "Igneous rock geochemistry", "A4 Misra p. 226 –  240, 310-313", "Introduction to Geochemistry.", "This grade includes:", "In groups of 4, you will present the findings of a recent scientific paper that includes some geochemistry.", "It is a closed book test.", "Typical question types may be multiple choice, interpreting diagrams, explaining concepts, and doing calculations (equations provided).", "Equations are provided and you should definitely bring a calculator.", "Notice of Recording", "Extensions and Accommodations", "Extensions and other accommodations will only be considered on a case-by-case basis.", "You are taking full responsibility for AI-generated materials as if you had produced them yourself: ideas must be attributed and facts must be true.", "In reference list:", "URL of the platform where the conversation took place]."]}, {"course_id": 10, "course_code": "EARTH 223", "course_name": "EARTH223 - Field Methods in Hydrology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrology Fall 2024", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "This course consists of field exercises and lectures designed to provide students with practical hands-on experience conducting a variety of hydrological monitoring techniques.", "This course is designed to provide hands-on field experience in the use of standard hydrologic monitoring techniques.", "The main objectives of this course are to use a variety of hydrologic data collection techniques in practical settings to answer hydrologic questions, identify the difficulty and importance of collecting good field data, and determine the accuracy/error of different measurement methods quantitatively and qualitatively.", "A Module will consist of two elements: (1) an activity in the field and (2) lecture and tutorial to review the fundamental concepts and discuss the data collected in the field.", "During each activity you will be working in groups of ~4.", "Assessment for each Module will consist of a pre-activity quiz administered on LEARN and an assignment that must be completed individually and uploaded to LEARN.", "Interpret the data in a hydrological context to explain groundwater/surface-water interactions, quantify water balances, and understand sources of contaminants found in water.", "Explain how drinking water in the Region of Waterloo is obtained, managed, and treated to ensure a safe and adequate supply.", "A Module will consist of two elements: (1) an activity in the field and (2) lecture and tutorial to review the fundamental concepts and discuss the data collected in the field.", "During each activity you will be working in groups of ~4.", "Assessment for each Module will consist of a pre-activity quiz administered on LEARN and an assignment that must be completed individually and uploaded to LEARN.", "Field Class Field Class Field Class Field Class", "Introduction (complete online)", "Sept 23**", "Sept 23**", "Sept 25**", "Sept 25**", "Oct 14**", "Oct 14**", "Oct 16**", "Oct 16**", "Oct 28**", "Oct 28**", "Oct 30**", "Oct 30**", "-", "Nov 25**", "-", "Nov 25**", "-", "-", "* complete virtually on your own", "***If possible", "These videos are designed to prepare you for the upcoming field activity and must be completed prior to the scheduled field activity time.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Must be uploaded as a single file", "Notice of Recording", "The field work is a critical part of this course and often you will be working in teams and so your lack of attendance may also result in some hardship for your group.", "You must be present for each field activity in order to get full credit for that activity  – unexcused absences will result in a 20% penalty for each missed field activity.", "For this reason, all students must complete WHMIS (Workplace Hazardous Materials Information System training) module before their first field activity session and provide proof of their training by uploading a picture of their form to DROPBOX.", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline).", "The policy can be found at: http://www.adm.uwaterloo.ca/infosec/Policies/policy33.htm", "Note on Avoidance of Academic Offences: Studying and working in groups to learn material can be a very valuable practice and is encouraged.", "Library for research-based assignments", "Strategies for learning online", "6 strategies for effective learning"]}, {"course_id": 11, "course_code": "EARTH 231", "course_name": "EARTH231 - Mineralogy (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "EIT 1013", "This course provides a systematic study of the physical and chemical properties of the major rock-forming silicate minerals.", "Study of mineral chemistry, the internal geometry of crystalline solids and the interrelationship of crystal structure to the physical and chemical properties of minerals.", "Laboratory work focuses on observing and evaluating the physical properties of minerals and rocks in hand sample in order to identity them.", "This course includes a weekend field trip to Bancroft, Ontario.", "During lectures you will develop a theoretical understanding of the physical and chemical properties of minerals, both as discrete solid phases and as members of mineral assemblages.", "The field trip will be a two day trip stopping at various field sites to look at rocks and minerals in and around the Bancroft area.", "Develop a theoretical understanding of the physical and chemical properties of minerals, both as discrete solid phases and as members of mineral assemblages", "During labs you will get hands-on experience observing, describing, and identifying rock and mineral specimens", "EIT 1013", "Course introduction/ Introduction to minerals", "Introduction to minerals: Con’t", "Lab 3 – Group meet up/contracts and Metamorphic Minerals", "Mineral chemistry", "Structure part 3: Classification of silicate structures", "Oct. 21", "Bancroft sample ID lab", "***midterm in class Thurs Oct 24***", "Digital Submission: Preliminary Group Report and sample ID chart", "Amphiboles", "Micas", "Students can find the Illness Self-declaration form in the Personal Information section of Quest.", "If the midterm is missed, a make-up midterm will be scheduled when appropriate by the instructor.", "Re-creating test questions and answers without the express permission of the course instructor", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "Everyone needs a support system.", "This resource lists includes general campus resources, as well as those focused on EDI-R and mental health.", "Sexual Violence Prevention & Response Office: https://uwaterloo.ca/sexual-violence-prevention-response-office", "An extensive list of campus resources can be found here: https://uwaterloo.ca/graduate-studies-postdoctoral-affairs/current-students/campus-resources-and-services", "Non-emergency Waterloo Regional Police Services - 519-653-7700"]}, {"course_id": 12, "course_code": "EARTH 232", "course_name": "EARTH232 - Introductory Petrography (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["EARTH 232", "DWE 1515", "B. Kendall", "08:30AM - 11:20AM EIT 1009", "EARTH 232 102", "08:30AM - 11:20AM EIT 1009", "Introduction to silicate phase equilibria and the use of mineral stability diagrams to understand petrogenetic processes.", "Laboratory work focuses on using a transmitted light microscope to study the optic properties of minerals in order to identify them as well as observe rock textures and interpret geological histories.", "View requirements for EARTH 232", "Describe how magmas form and evolve to produce a variety of common igneous rocks", "Show how the different agents and types of metamorphism lead to the formation of common metamorphic rocks", "Understand how to use simple phase diagrams to interpret the geological history of a rock", "Use mineralogy and texture to interpret the geological history of a rock", "Identify and describe minerals and textures using a petrographic microscope", "Classify igneous, sedimentary, and metamorphic rocks", "Relate common rock associations to plate tectonic settings", "Introduction", "Igneous: Magma Differentiation", "Igneous: Binary Solid Solution Phase Diagrams", "Igneous: Binary Eutectic & Peritectic Phase Diagrams", "Igneous: Ternary Phase Diagrams", "Igneous: Classification & Occurrence", "Igneous: Classification & Occurrence", "Metamorphic: Zones and Facies", "Metamorphic: Phase Diagrams", "Metamorphic: Classification and Occurrence", "Sedimentary: Classification & Occurrence", "Sedimentary: Classification & Occurrence", "Textbook: Earth Materials - Introduction to Mineralogy and Petrology, 2nd Edition.", "Cornelius Klein and Anthony Philpotts.", "Textbook: Introduction to Optical Mineralogy, 4th Edition.", "On reserve in Davis Library - 3 hour loan.", "Textbook: Principles of Igneous and Metamorphic Petrology, 2nd Edition.", "Each rock type can only be claimed by one student.", "Final Exam: The closed-book final exam will be in-person and scheduled by the registrar.", "This course includes the independent development and practice of specific skills, such as synthesis and poster presentation of information on a student's chosen rock type, and laboratory mineral and rock descriptions.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office: https://uwaterloo.ca/sexual-violence-prevention-response-office", "An extensive list of campus resources can be found here: https://uwaterloo.ca/graduate-studies-postdoctoral-affairs/current-students/campus-resources-and-services", "Non-emergency Waterloo Regional Police Services - 519-653-7700", "St. Mary's Hospital - 519-744-3311", "Kitchener-Waterloo Sexual Assault Support Centre - 519-741-8633", "Stratford General Hospital - 519-272-8210", "EDI-R STATEMENT"]}, {"course_id": 13, "course_code": "EARTH 235", "course_name": "EARTH235 - Stratigraphic Approaches to Understanding Earth's History (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["08:30AM - 09:50AM EV2 2002", "jwjohnston@uwaterloo.ca", "10:00AM -", "jwjohnston@uwaterloo.ca", "10:00AM -", "jwjohnston@uwaterloo.ca", "Department of Earth and Environmental Sciences in the Faculty of Science @UWaterloo.", "At the University of Waterloo, Dr. Johnston teaches numerous classes such as Earth 121 - Introductory Earth Sciences, Earth 235 - Stratigraphic Approaches to Understanding Earth's History, Earth 390 - Methods in Geological Field Mapping, and occasional graduate classes such as Earth 691 Special Studies for MSc Students (i.e. Coastal Geology).", "He is a board member for the University of Waterloo Earth Science Museum and representative for the Geological Association of Canada on the North American Commission on Stratigraphic Nomenclature (former chair and vice chair).", "Discussions", "Email", "But please indicate the course name and number and reason for the email in the subject line.", "An introduction to stratigraphic principles and methods used in deciphering geological history.", "Techniques of collecting surface and subsurface geologic data and representation of stratigraphic data.", "Procedures applicable to the classification and nomenclature of stratigraphic units using the North American Stratigraphic Code.", "The development of stratigraphic sequences as controlled by global and regional tectonics and sea level fluctuations.", "Laboratory work will include construction and interpretation of various types of learning media such as traditional maps, cross sections, new physical and digital models, as well as extended reality.", "Describe and illustrate perspectives and applications of stratigraphy.", "Understand and apply the classification and nomenclature of stratigraphic units.", "Debate preservation potential though space and time.", "Professional Geoscientists Ontario - Student Member", "The level of geoscience education in a bachelor of science degree is considered to meet the minimum knowledge requirements recommended by Geoscientists Canada for admission to practice professional geoscience and for interprovincial (and international) mobility.", "Readings", "Week 1: Introduction and Collecting Geologic Data", "Module 1: Introduction Earth 235 Course Outline", "Introduce Yourself Discussion", "1c Field Techniques", "1d Field Notebook", "Module 4: Facies and Correlation 3a Facies", "3b Correlation", "Module 5: Introduction to the Stratigraphic Code (and Lithostratigraphic Chart for southern Ontario page) 4a", "Week 7: Canada's Structures and Introduction to Sequence Stratigraphy", "Module 10: Introduction to Sequence Stratigraphy 7a Sequence Stratigraphy", "Week 8: Relative Time and Absolute Dating and Age of the Earth", "Module 12: Absolute Dating and Age of the Earth", "Therefore, Dr. Johnston has compiled a unique set of readings from a variety textbooks and online sources.", "Instructions", "A complete set of labs is provided in Learn for each student to complete and then submit to the Learn Dropbox.", "Please follow these steps for each lab:", "Note: Labs are expected to be submitted in a well-organized, neat and legible fashion.", "Deliverables", "Your lab assignment must be submitted in the following file type:", "Most word processing software applications will allow you to save your file as a PDF; however, if you require software to create PDFs, some free options are listed below:", "Email subject line must include the course number and code and name of the assessment.", "Please email the entire EARTH 235 Team, including the TAs and your instructor to inform the entire Team and receive a prompt response.", "Please make sure you are registered with AAS first", "Intellectual property includes items such as:"]}, {"course_id": 14, "course_code": "EARTH 238", "course_name": "EARTH238 - Introductory Structural Geology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Structural Geology Winter 2024", "EARTH 238", "03:30PM - 04:20PM", "EARTH 238 201", "changcheng.li@uwaterloo.ca", "EIT 1013", "changcheng.li@uwaterloo.ca", "EARTH 238 102", "EIT 1013", "changcheng.li@uwaterloo.ca", "*", "Discussions", "To the teaching team: This is a discussion topic for you to give suggestions to the teaching team and for them to know the questions you have.", "Concepts of stress and strain; elementary rock mechanics; description and classification of folds, faults, foliations, lineations and joints; use of primary structures; introduction to geometrical analysis.", "Labs will emphasize geometrical problems, including geological maps and cross sections, and stereographic projection.", "Understand the process in which various geological structures develop", "Perform kinematic analysis from some simple structures", "Record orientation data in the right format according geological convention", "Read a geological map and draw cross sections base on the map", "Use an equal-area net to conduct geometrical analysis", "iClicker Students can use either iClicker student App or iClicker remote Yes", "Basic Methods of Structural Geology.", "Students have to answer a question in a quiz correctly to get the mark.", "Examination regulations as outlined in the current UW undergraduate calendar are to be followed."]}, {"course_id": 15, "course_code": "EARTH 260", "course_name": "EARTH260 - Introductory Applied Geophysics (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrogeology Fall 2024", "08:30AM - 09:50AM DWE 3519", "An introduction to the principles and theories of mineral deposit genesis.", "Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered.", "View requirements for EARTH 458L", "Applied geophysics provides geoscientists with a wide-range of non-invasive methods for characterizing the Earth's interior.", "This course is an introduction to the physical principles underlying field acquisition, processing, and data interpretation for commonly used applied geophysical techniques (seismic, electrical, electromagnetic induction, gravity, and magnetic methods).", "This course is not only pertinent for geoscientists but also for engineers and others interested in learning how physics can be used to explore the Earth's interior or perform non-destructive testing.", "Near-surface geophysics is used to characterize the shallow subsurface for a wide-spectrum of applications.", "This application-oriented course covers current methodology in near-surface geophysics, including electrical, electromagnetic, ground penetrating radar, seismic refraction, and well-logging methods.", "Techniques for geophysical data acquisition and interpretation are studied and applied to field data.", "Examples of the application of geophysical techniques to archeological, forensics, geotechnical, glaciology, and hydrogeological problems are examined.", "View requirements for EARTH 461", "A field-oriented course on current methodology in the general area of geotechnical or engineering geophysics as applied to environmental problems.", "Typical topics covered: well logging and time domain electromagnetic surveys for groundwater supply; magnetic and terrain conductivity surveys for waste materials; ground penetrating radar applications to stratigraphy and contamination; streaming potential surveys of dam leakage.", "A pre-lab quiz must be completed before attending each field lab.", "Labs will be completed in groups with field data recorded in field books or datasheets.", "These data will be used to a complete individual lab assignment.", "This site contains over 100 groundwater monitoring wells.", "Field lab activities involve:", "(3) Measurement of in-situ hydraulic conductivity using single-well response tests", "Each lab will provide you with a unique dataset that you will use to develop a conceptual site model of the local groundwater flow system.", "• Properly construct and interpret soil core logs using United Soil Classification System, and make lithostratigraphic interpretations using geophysical logs", "• Assess and interpret water level measurements through the construction of water table maps and flownets", "• Interpret single-well response tests including falling and rising head (slug) tests to determine in-situ hydraulic conductivity", "• Interpret hydraulic pumping tests to determine aquifer transmissivity and storage parameters and assess water resource vulnerability", "Each module will contain a series of recorded lecture slides and video demonstrations reviewing core concepts and guidelines for the upcoming field lab.", "Please include “Earth 458L” in the subject line of all e-mail communications as well as your Full Name and Student ID# in the text of the email.", "Hydrogeological equipment to make measurements and collect data (temporary use)", "Specialized hydrogeological software to complete certain assignments", "Datasheet to record field data", "Other data should be recorded in your field books and distributed to your group members as needed.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Notice of Recording", "Participation in Field Labs:", "These quizzes are designed to keep you on schedule and prepare you for the in-person field lab and assigned activities.", "There will be a 48-hour grace period to finalize the submission of your assigned activities without incurring any late penalty."]}, {"course_id": 16, "course_code": "EARTH 333", "course_name": "EARTH333 - Introductory Sedimentology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["04:00PM - 05:20PM", "RCH 204", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Students can expect a response within 48 hours from Monday to Friday.", "TAs will also be available during in-person laboratory sessions.", "An introduction to sediment properties, sedimentation processes, and sedimentary deposits in a variety of depositional environments and climatic conditions.", "View requirements for EARTH 333", "Know the main principles, concepts and approaches pertaining to the study of sediments and sedimentary rocks", "Know the main modern sedimentary environments", "Interpret past sedimentary environments from the sedimentary record", "Appreciate societal relevance of sedimentology and know some of the possible applications", "Sedimentology and Stratigraphy, 2nd edition / Gary Nichols Electronic course reserve.", "Principles of Sedimentology and Stratigraphy, 5th edition / Sam Boggs Course reserve.", "A team rep must inform their TA of the team members and team name.", "Dropbox folders with limited access will be created for each team and linked to the gradebook.", "Penalties for late submissions:", "Weekends and holidays will not count when determining a late submission penalty"]}, {"course_id": 17, "course_code": "EARTH 342", "course_name": "EARTH342 - Geomorphology and GIS Applications (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Geomorphology and GIS Applications Fall 2024", "changcheng.li@uwaterloo.ca", "04:00PM - 05:20PM", "changcheng.li@uwaterloo.ca", "Characteristics and development of various landforms (e.g. mountain belts, volcanoes, impact craters, and those created by erosion/deposition of rivers/glaciers) are introduced.", "Application of Geographic Information Systems (GIS) to Earth Sciences.", "Basic concepts of GIS and GIS applications in mineral exploration industry and in fieldwork are introduced.", "View requirements for EARTH 342", "Introduction to Geomorphology", "Various landforms and their development processes", "Introduction to ArcGIS", "Vector data model and raster data model", "Map projection and coordinate system", "Data input", "Basic applications of ArcGIS in mineral exploration and mining industry", "Spatial data analysis", "Interpretation of satellite image and air photos", "Introduction to ArcGIS", "GIS for Assessment report for a mineral exploration company", "Make a geological map", "Enhance contrast in colour between different rock units in Landsat satellite images", "One example of natural hazard assessment using spatial data analysis in ArcGIS", "Input and organize geographic data in ArcGIS and present them using maps", "Prepare base maps needed for geological field mapping", "Set up a web map for digital mapping in a group and collect data using mobile devices", "Make a geological map in ArcGIS based on field mapping data and interpretations", "Make drill hole location maps for assessment reports for a mineral exploration company", "Carry out basic spatial analysis to assess a natural hazard in a given scientific model and make maps to present spatial analysis results", "Examination regulations as outlined in the current UW undergraduate calendar are to be followed.", "In this course, the following will be considered as academic misconduct and unacceptable:", "Re-creating exam questions and answers without the express permission of the course instructor"]}, {"course_id": 18, "course_code": "EARTH 390", "course_name": "EARTH390 - Methods in Geological Mapping (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Methods in Geological Mapping Winter 2025", "jwjohnston@uwaterloo.ca", "These instructors co-teach this field-focused course and combine expertise to enrich this learning experience for all students.", "EMAIL", "But please indicate the course name and number and reason for the email in the subject line.", "Field study in Sudbury and Whitefish Falls areas.", "Geological and geotechnical field techniques, map construction, and report writing.", "View requirements for EARTH 390", "All online modules and quizzes and mapping exercise must be completed and submitted before leaving for the field portion of EARTH 390.", "This is to help prepare students for the field trip/work, establishing a common knowledge and skill base and field safety and etiquette.", "Students will also find that a Sedimentology course (Earth 333) will come in very useful, as we will be mapping in a metamorphosed sedimentary terrain.", "Part of this field experience is very special because students are given permission to map on Whitefish River First Nations (WRFN) land, an area of cultural significance to Indigenous Peoples and world-class exposure of rock.", "Observe and record a variety of different types of geological information in the field.", "Make decisions based on field observations.", "Construct a geological map using student collected field observations and measurement.", "Interpret geological maps.", "Professional Geoscientists Ontario - Student Member", "The level of geoscience education in a bachelor of science degree is considered to meet the minimum knowledge requirements recommended by Geoscientists Canada for admission to practice professional geoscience and for interprovincial (and international) mobility.", "An essential part of preparing for a fun and prosperous time in the field is learning and testing your knowledge before leaving for the field portion of Earth 390 in northern Ontario.", "This will help keep everybody safe and maximize learning in this unique field experience.", "Any student not completing these cannot attend the field portion of EARTH 390.", "The majority of student grades in EARTH 390 are assigned to the FIELD portion of this course.", "Let's have some fun combining and applying previously learned and new student knowledge and skills in EARTH 390!", "Igneous Rocks Quiz", "Structural Geology", "Structural Geology Quiz", "Geological Cross Sections", "Geological Cross Sections", "Health and Safety/Field Etiquette", "Health and Safety/Field Etiquette", "Emergency Situations and Mitigation Quiz", "Mapping Exercise", "Mapping Exercise", "Digital Geological Mapping Introduction to Digital Geological Mapping Technologies Monday, February 10, 2025 at 8:00 AM Thursday, March 27, 2025 at 4:00 PM Ungraded", "Online quizzes and mapping exercise are completed before the field trip/work.", "Regional geology exercises, local geology report and map, individual assessment and field notebook are completed during the field trip/work.", "Satisfactory completion of ALL ASPECTS of the course is required.", "Whitefish River First Nation", "Our active work toward reconciliation has involved deepening our relationship in Whitefish River First Nation community talks, visits in the field, a summary report describing land-based learning, student research, and University of Waterloo’s Earth Science Museum outreach programs in the WRFN Shawanosowe School.", "Equity and Inclusion", "This course includes the independent development and practice of specific skills in the geosciences.", "Library for research-based assignments"]}, {"course_id": 19, "course_code": "EARTH 421", "course_name": "EARTH421 - Advanced Geochemistry (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Advanced Geochemistry Fall 2024", "08:30AM - 09:50AM MC 4064", "01:00PM - 03:20PM", "08:30AM - 10:50AM EIT 1009", "Development of the three laws of thermodynamics; Gibbs free energy and equilibria constants.", "Introduction to various topics in aqueous geochemistry such as mineral equilibria, ion exchange, and redox equilibria.", "View requirements for EARTH 421", "Development of the three Laws of Thermodynamics; Gibbs free energy and equilibrium constants.", "Introduction to various topics in aqueous geochemistry, such as mineral equilibrium, ion exchange and redox equilibrium.", "Laboratory sessions will involve various activities related to acid-base equilibrium, redox reactions, chemical modeling, and analytical instrumentation methods.", "Thermodynamics offers Geoscientists a powerful tool to aid in the interpretation of near surface processes.", "It can be used to delineate the physicochemical conditions that led to a particular mineral assemblage; to discern whether a mineral assemblage could have resulted from equilibrium or disequilibrium (kinetic-controlled) conditions; to aid in decision-making in exploration geochemistry; and to design geochemical barriers and containment systems at waste disposal sites.", "Applications include geothermal systems, acid-mine drainage, carbon sequestration, and other near surface environmental systems.", "Develop thermodynamic principles most relevant to geochemical systems", "Understand the concepts of chemical equilibrium and metastability in the context of Earth systems", "Develop conceptual and empirical models to describe natural geochemical systems", "Apply geochemical principles toward achieving a sustainable use of Earth’s resources, including predicting the impacts of resource development and developing strategies for mitigation of impacts", "Communicate geochemical concepts to various audiences", "Introduction and review", "Thermodynamics of Pure Substances", "Examples: Steam separation in geothermal systems, CO2 compressibility for sequestration.", "Thermodynamics of Simple Mixtures", "Free Energy (G)", "Determining mineral phase transitions.", "The derivation of the equilibrium constant (K) from the first and second laws.", "The need for the third law and evidence; where thermodynamic data originates and its limitations", "Free energy calculations", "Aqueous Solutions", "Applications of acid-base and redox reactions in natural and perturbed systems.", "Aqueous geochemistry", "Solubility products and saturation indices; the influence of ion hydrolysis on mineral and gas solubilities.", "The Carbonate System", "An examination of carbonate gas-water-solid equilibrium and the factors that influence it.", "A look at analogous geochemical systems.", "Recommended reading for those pursuing advanced degrees in geochemistry."]}, {"course_id": 20, "course_code": "EARTH 436A", "course_name": "EARTH436A - Thesis Proposal (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["EARTH 436A", "EARTH 436A 001", "11:30AM -", "View requirements for EARTH 436A", "Thesis Course (Earth 436) provides an opportunity for students to design and conduct independent research under the supervision of a faculty member in the Department of Earth & Environmental Sciences.", "In the past years, a number of excellent research projects have been completed leading in some cases to award winning presentations at conferences and publications in peer-reviewed journals.", "Students must normally obtain a minimum mark of 75% in Earth 436A to be allowed to register in Earth 436B. For students who enroll in Earth 436A only, the scope of work will involve the selection of a scientific topic of interest, detailed review of several published papers on the subject and the development of a potential research project that would fill a gap in current knowledge on the subject.", "In Earth 436B, the remaining activities required to complete the research project are carried out based on the experimental design formulated in Earth 436A. The format and structure of the Final Research Report can be either a conventional thesis document or a journal manuscript.", "It involves oral communication either one on one or before groups both large and small and written communication, which involves preparation of maps, charts and 6 narrative reports with personal observations, analyses and reviews of your own new work and that of previous workers.", "While most of your work will be technical and reflect scientific rigor, you may be called upon to prepare shorter status and policy briefs for decision-makers, legal summaries and commentaries, mine stakes and resource claim descriptions, and other items, all of which require organized and well-reasoned clear writing.", "Students should familiar with and able to do the following at the end of this course: • plan and conduct independent and original research under the guidance of a research advisor • learn how to explore, organize, execute, share and disseminate the results of your own scientific questions and thoughts • acquire new practical research and analytical skills using data either collected by yourself in the field or assembled in the laboratory or information/data collected by someone else (often the faculty advisor) in a research environment that you would not have had a chance to do elsewhere in your program • learn discipline-specific protocols and procedures for addressing scientific questions and procedures and formats for reporting technical information according to discipline or sub\u0002discipline standards • acquire an appreciation for and basic skill level to organize, interpret, and identify relevance of new information and research results • understand how to organize, communicate effectively and clearly disseminate new information to peers and other professionals, both written and orally • know how to undertake self-assessment, and learn how to give and receive constructive review and critique by your peers", "DATE ACTIVITIES & DUE DATES  ATTENDANCE & GRADING", "No meeting", "23 September", "Applying for graduate school and applying for NSERC & other scholarships.", "Work on research design proposal", "No meeting", "Farvolden Day and Job Fair", "No meeting", "No meeting", "No meeting", "No Meeting", "Presentation Abstract:", "2 December No meeting Work on your project and final thesis design; Finish writing & Edit No meeting", "9 December", "No meeting", "No meeting", "FINAL RESEARCH DESIGN PROPOSAL 50%", "Many professors have a number of possible projects in mind.", "Topics involving co-advisors outside of the Dept. of Earth & Environmental Sciences must be approved by the Earth 436A instructor.", "Write a short summary of the project and include the objectives, context, methods and major findings in sentence form (~250 words max.)", "and then give a critique of the thesis in sentence form (~150 words max.).", "Maximum length for the summary and critique is one page single spaced (~400 words max.", "FINAL RESEARCH DESIGN PROPOSAL (50%): The final research design proposal contains an Introduction, comprehensive Literature Review, Overall Goal(s) and (specific) Objectives, Experimental Design and Methods (including anticipated results and potential data presentation)."]}, {"course_id": 21, "course_code": "EARTH 440", "course_name": "EARTH440 - Quaternary Geology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "02:30PM - 05:20PM", "Students can expect a response within 48 hours from Monday to Friday.", "The TA will also be available during in-person laboratory sessions.", "Glacial-interglacial cycles and sub-Milankovitch oscillations from ocean sediments and ice cores.", "Glacial sediment-land systems.", "Local field trips.", "View requirements for EARTH 440", "Local field trips focusing on the regional Quaternary geology and sedimentology of glacial sediments.", "Know the main principles, concepts and approaches pertaining to the study of Quaternary sediments and landforms (especially glacial sediments in Canada);", "Knowledge of the Quaternary geology of southern Ontario;", "Knowledge of the main applications of glacial geology;", "Gain experience recognising and investigating landforms and glaciogenic sediments using tools such as Google Earth and a GIS;", "Gain experience searching for and using public spatial datasets from various government agencies and other sources;", "Experiment and learn to create engaging and accurate stories about Quaternary geology features and maps", "Appreciation and basic knowledge of the complexity of changes that have occurred throughout the Quaternary Period", "The following textbooks have also been used in the development of this course:", "Field trips: Four field trips will occur during lecture and lab session hours in September and early October.", "The field trips are intended to give an overview of the glacial stratigraphy and sediment-landform assemblages in the region as well as some hands-on experience.", "You will be given the opportunity to learn some basic field description/measurement procedures.", "Important note: Field trip fees may be charged to cover direct costs of travel (essentially the cost of school bus transportation service).", "In-class quizzes: There will be a series of short in-class quizzes (~10-15 min each) throughout the term.", "Each team will have to prepare a StoryMap summarizing the field trips and with one particular aspect of the trips highlighted and explained in greater details.", "The second StoryMap will be about a specific map sheet area selected from a short list of available surficial geology maps produced by a government geological survey in recent years.", "The StoryMap will provide an overview of the main geological and geomorphological features of the map, and will also put the map into the broader regional context based on the available scientific literature.", "Notice of Recording", "Weekends and holidays will not count when determining a late submission penalty"]}, {"course_id": 22, "course_code": "EARTH 456", "course_name": "EARTH456 - Numerical Methods in Hydrogeology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Numerical Methods in Hydrogeology Winter 2025", "An introduction to the theory and practice of groundwater flow and contaminant transport modeling.", "Topics related to variably-saturated flow will focus on derivation of Richard's equation, a control volume finite difference discretization, assembly and solution of the flow equation, material balance error, truncation error analysis, stability and monotonicity.", "Explain the fundamental theory behind groundwater flow and contaminant transport modeling", "Apply numerical techniques, including control volume finite difference discretization, to solve groundwater flow and contaminant transport equations.", "Analyze numerical model accuracy, including material balance error, truncation error, stability, and monotonicity in variably-saturated flow and contaminant transport problems.", "Use a modeling software to model variably-saturated flow and contaminant transport.", "Interpret and visualize groundwater flow and contaminant transport model results and communicate findings effectively.", "Identify the concepts of groundwater and solute transport modeling and their real-world applications.", "Section 1.1 Derivation of Richards' Equation", "Section 1.2 Derivation of Richards 'Equation – Pressure Head Formulation", "Section 1.3 Three-Dimensional Groundwater Flow", "Derive and interpret three-dimensional groundwater flow dynamics and their mathematical representation.", "Section 1.4 Control Volume Finite Difference Discretization for Flow", "Section 1.5 A Rigorous Derivation of the Control Volume Finite Difference Discretization", "Develop, apply, and justify control volume finite difference discretization techniques for groundwater flow problems, demonstrating a rigorous understanding of mathematical principles.", "Assemble and implement saturated groundwater flow equations in numerical models using discretized formulations.", "Assemble the saturated groundwater flow equation using control volume discretization.", "Analyze groundwater flow material balance errors and their implications for numerical model accuracy.", "Section 1.8 Truncation Error Analysis", "Section 1.8 Truncation Error Analysis", "Section 1.9 Stability and Monotonicity", "Section 2.1 Derivation of the Contaminant Transport Equation", "Analyze the stability and monotonicity of numerical methods for groundwater flow models.", "Derive the contaminant transport equation and articulate its role in modeling solute movement through porous media.", "Section 2.1 Derivation of the Contaminant Transport Equation", "Section 2.2 Control Volume Finite Difference Discretization of the Contaminant Transport Equation", "Section 2.3 Central Spatial Weighting of Advective Flux", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Apply control volume finite difference discretization to the contaminant transport equation for numerical modeling.", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Section 2.4 Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.5 Upstream Spatial Weighting of Advective Flux", "Section 2.5.1 Truncation Error of Upstream Spatial Weighting", "Section 2.6 Crank-Nicolson Temporal Weighting with Upstream Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.7 Assembly of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.7.1 Monotonicity of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.8 Assembly of Fully-Implicit Temporal Weighting with Upstream Spatial Weighting", "Section 2.8.1 Monotonicity of Upstream Spatial Weighting with Fully-Implicit Temporal Weighting", "Section 2.9 Boundary Conditions for Transport Coupled to Flow", "Analyze the accuracy of various contaminant transport weighting schemes and their impact on numerical model performance.", "Apply boundary conditions for contaminant transport coupled with groundwater flow and assess material balance errors to ensure reliable numerical simulations.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "The total maximum bonus points that can be earned across all five assignments is five.", "Students can earn bonus points by actively participating in discussions or helping their peers understand the course material and assignments.", "Explaining a challenging concept to peers in a collaborative study session.", "A maximum of five contributions will be allowed per assignment."]}, {"course_id": 23, "course_code": "EARTH 458", "course_name": "EARTH458 - Physical Hydrogeology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrogeology Fall 2024", "08:30AM - 09:50AM DWE 3519", "An introduction to the principles and theories of mineral deposit genesis.", "Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered.", "View requirements for EARTH 458L", "Applied geophysics provides geoscientists with a wide-range of non-invasive methods for characterizing the Earth's interior.", "This course is an introduction to the physical principles underlying field acquisition, processing, and data interpretation for commonly used applied geophysical techniques (seismic, electrical, electromagnetic induction, gravity, and magnetic methods).", "This course is not only pertinent for geoscientists but also for engineers and others interested in learning how physics can be used to explore the Earth's interior or perform non-destructive testing.", "Near-surface geophysics is used to characterize the shallow subsurface for a wide-spectrum of applications.", "This application-oriented course covers current methodology in near-surface geophysics, including electrical, electromagnetic, ground penetrating radar, seismic refraction, and well-logging methods.", "Techniques for geophysical data acquisition and interpretation are studied and applied to field data.", "Examples of the application of geophysical techniques to archeological, forensics, geotechnical, glaciology, and hydrogeological problems are examined.", "View requirements for EARTH 461", "A field-oriented course on current methodology in the general area of geotechnical or engineering geophysics as applied to environmental problems.", "Typical topics covered: well logging and time domain electromagnetic surveys for groundwater supply; magnetic and terrain conductivity surveys for waste materials; ground penetrating radar applications to stratigraphy and contamination; streaming potential surveys of dam leakage.", "A pre-lab quiz must be completed before attending each field lab.", "Labs will be completed in groups with field data recorded in field books or datasheets.", "These data will be used to a complete individual lab assignment.", "This site contains over 100 groundwater monitoring wells.", "Field lab activities involve:", "(3) Measurement of in-situ hydraulic conductivity using single-well response tests", "Each lab will provide you with a unique dataset that you will use to develop a conceptual site model of the local groundwater flow system.", "• Properly construct and interpret soil core logs using United Soil Classification System, and make lithostratigraphic interpretations using geophysical logs", "• Assess and interpret water level measurements through the construction of water table maps and flownets", "• Interpret single-well response tests including falling and rising head (slug) tests to determine in-situ hydraulic conductivity", "• Interpret hydraulic pumping tests to determine aquifer transmissivity and storage parameters and assess water resource vulnerability", "Each module will contain a series of recorded lecture slides and video demonstrations reviewing core concepts and guidelines for the upcoming field lab.", "Please include “Earth 458L” in the subject line of all e-mail communications as well as your Full Name and Student ID# in the text of the email.", "Hydrogeological equipment to make measurements and collect data (temporary use)", "Specialized hydrogeological software to complete certain assignments", "Datasheet to record field data", "Other data should be recorded in your field books and distributed to your group members as needed.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Notice of Recording", "Participation in Field Labs:", "These quizzes are designed to keep you on schedule and prepare you for the in-person field lab and assigned activities.", "There will be a 48-hour grace period to finalize the submission of your assigned activities without incurring any late penalty."]}, {"course_id": 24, "course_code": "EARTH 458L", "course_name": "EARTH458L - Field Methods in Hydrogeology (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrogeology Fall 2024", "08:30AM - 09:50AM DWE 3519", "An introduction to the principles and theories of mineral deposit genesis.", "Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered.", "View requirements for EARTH 458L", "Applied geophysics provides geoscientists with a wide-range of non-invasive methods for characterizing the Earth's interior.", "This course is an introduction to the physical principles underlying field acquisition, processing, and data interpretation for commonly used applied geophysical techniques (seismic, electrical, electromagnetic induction, gravity, and magnetic methods).", "This course is not only pertinent for geoscientists but also for engineers and others interested in learning how physics can be used to explore the Earth's interior or perform non-destructive testing.", "Near-surface geophysics is used to characterize the shallow subsurface for a wide-spectrum of applications.", "This application-oriented course covers current methodology in near-surface geophysics, including electrical, electromagnetic, ground penetrating radar, seismic refraction, and well-logging methods.", "Techniques for geophysical data acquisition and interpretation are studied and applied to field data.", "Examples of the application of geophysical techniques to archeological, forensics, geotechnical, glaciology, and hydrogeological problems are examined.", "View requirements for EARTH 461", "A field-oriented course on current methodology in the general area of geotechnical or engineering geophysics as applied to environmental problems.", "Typical topics covered: well logging and time domain electromagnetic surveys for groundwater supply; magnetic and terrain conductivity surveys for waste materials; ground penetrating radar applications to stratigraphy and contamination; streaming potential surveys of dam leakage.", "A pre-lab quiz must be completed before attending each field lab.", "Labs will be completed in groups with field data recorded in field books or datasheets.", "These data will be used to a complete individual lab assignment.", "This site contains over 100 groundwater monitoring wells.", "Field lab activities involve:", "(3) Measurement of in-situ hydraulic conductivity using single-well response tests", "Each lab will provide you with a unique dataset that you will use to develop a conceptual site model of the local groundwater flow system.", "• Properly construct and interpret soil core logs using United Soil Classification System, and make lithostratigraphic interpretations using geophysical logs", "• Assess and interpret water level measurements through the construction of water table maps and flownets", "• Interpret single-well response tests including falling and rising head (slug) tests to determine in-situ hydraulic conductivity", "• Interpret hydraulic pumping tests to determine aquifer transmissivity and storage parameters and assess water resource vulnerability", "Each module will contain a series of recorded lecture slides and video demonstrations reviewing core concepts and guidelines for the upcoming field lab.", "Please include “Earth 458L” in the subject line of all e-mail communications as well as your Full Name and Student ID# in the text of the email.", "Hydrogeological equipment to make measurements and collect data (temporary use)", "Specialized hydrogeological software to complete certain assignments", "Datasheet to record field data", "Other data should be recorded in your field books and distributed to your group members as needed.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Notice of Recording", "Participation in Field Labs:", "These quizzes are designed to keep you on schedule and prepare you for the in-person field lab and assigned activities.", "There will be a 48-hour grace period to finalize the submission of your assigned activities without incurring any late penalty."]}, {"course_id": 25, "course_code": "EARTH 459", "course_name": "EARTH459 - Chemical Hydrogeology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["10:00AM - 11:20AM PHY 150", "10:30AM - 11:20AM MC 4042", "View requirements for EARTH 459", "Overall learning objective: To provide an understanding of the basic principles of chemical hydrogeology as they relate to problem solving in various applications of geochemistry.", "Develop the skills to collect accurate and reliable physical, geochemical and microbiological measurements from groundwater flow systems", "Analyze geochemical and hydrogeological data to identify the processes that affect groundwater quality and cause groundwater contamination", "Develop management and remediation systems to protect groundwater quality and protect human and ecosystem health", "Part 1: Chemical principles and processes of water-rock interaction", "Introduction to chemical hydrogeology:", "Mineral-water interaction:", "Mineral-water interaction:", "Development of natural groundwater chemical sequences in flow systems:", "Redox reactions, redox sequences in groundwater flow systems", "Development of natural groundwater chemical sequences in flow systems:", "Introduction to chemical modelling:", "Case studies of groundwater contamination and remediation.", "Introduction to common scenarios of groundwater contamination and classes of contaminants considered in this course.", "Non-Aqueous Phase Liquids – dissolution and contamination patterns, vapour transport, implications for clean-up.", "Acid generating mine wastes and inorganic contaminants:", "Selected topics in chemical hydrogeology:", "Natural attenuation and in-situ remediation: Inorganic contaminants and radionuclides, approaches and case studies.", "Emerging contaminants in groundwater: Fate of pharmaceutical compounds and other emerging compounds in septic system and landfill plumes.", "Environmental Isotopes in Hydrogeology Authors: I.D. Clark and P. Fritz No 250", "This course includes the independent development and practice of specific skills, such as geochemical calculations.", "Library for research-based assignments"]}, {"course_id": 26, "course_code": "MATH 127", "course_name": "MATH127 - Calculus 1 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses.", "Intuitive discussion of limits and continuity.", "Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications.", "Fundamental theorems and antiderivatives; change of variable.", "have extensive familiarity with a number of basic but fundamental models that showcase the role of calculus in their respective disciplines.", "have experience describing and interpreting mathematical procedures in precise language (i.e., in complete sentences) within the context of short but formal project reports.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids."]}, {"course_id": 27, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 28, "course_code": "STAT 202", "course_name": "STAT202 - Introductory Statistics for Scientists (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Statistics for Scientists Winter 2025", "R. Metzger", "R. Metzger", "jenny.tieu@uwaterloo.ca", "02:30PM - 03:20PM", "jenny.tieu@uwaterloo.ca", "R. Metzger", "02:30PM - 03:20PM", "PHY 313", "jenny.tieu@uwaterloo.ca", "R. Metzger", "Methods for data summary and presentation.", "Estimation, hypothesis testing, two-sample techniques and paired comparisons, regression, correlation.", "Evaluate the strengths and weaknesses of a simple sampling technique.", "Given a set of data:", "Build a simple linear model for a dataset.", "Perform simple statistical test to determine whether:", "A population mean and proportion differs from a particular value.", "A simple linear regression model parameter is significant.", "Probability Functions (PF) and Cumulative Distribution Functions (CDF):", "Differentiate between a Binomial and Poisson experiment.", "Define simple sample spaces and calculate simple probabilities.", "Calculate the sample mean and sample variance of a linear combination.", "Linear Relationships (Covariance and Correlation), Time Series, Scatterplots, Linear Regression", "Instructor(s) will go over a problem set.", "Regression analysis", "Sample design", "Poisson Distribution, Normal Distribution", "Instructor(s) will go over a problem set.", "Inference", "Instructor(s) will go over a problem set.", "Inference", "Inference", "- location TBD", "≥50", "No considerations are given for individual technical issues.", "This is a cumulative test that will cover the entire course.", "Late Tests will be given a zero mark.", "Note for your circumstance to be deemed valid you must have been incapacitated for a significant portion of the assessment window.", "A circumstance that incapacitates a student for a month or longer is unlikely to be accommodated – in such a case we ask that you please speak to your academic advisor and consider dropping the course.", "In the past some of the issues below have cropped up in my courses:", "Make sure you start online quizzes early, hand in assignments early, etc in case of unforeseen technical issues!", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 29, "course_code": "CIVE 222", "course_name": "CIVE222 - Differential Equations (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Differential Equations Spring 2024", "10:00AM - 11:20AM STC 0010", "An introduction to linear and partial differential equations.", "Standard methods of solution, applications to physical and engineering problems, linear equations with constant coefficients, basic systems of differential equations, partial differential equations.", "2. Problem Analysis: Formulate problem statement; Rehearse Problem Solving skills; Solve moderately complex problems", "Introduction, p.1", "1.2         General Concepts and Definitions, p.6", "First-Order and Simple Higher-Order Differential Equations, p.16", "2.3         Exact Differential Equations and Integrating Factors, p.31", "2.3.1      Exact Differential Equations, p.32", "2.4         Linear First-Order Equation, p.55", "2.4.1      Linear First-Order Equations, p.55", "2.6         Simple Higher-Order Differential Equations, p.68", "Applications of First-Order Differential Equations, p.87", "3.2         Motion of a Particle in a Resisting Medium, p.91", "3.3.2      Cable under Self-Weight, p.102", "Linear Differential Equations, p.140", "4.1         General Linear Ordinary Differential Equations, p.140", "4.2         Complementary Solutions, p.143", "Applications of Linear Differential Equations, p.188", "5.1         Vibration of a Single Degree-of-Freedom System, p.188", "5.1.2       Response of a Single Degree-of-Freedom System, p.193", "Systems of Linear Differential Equations, p.300", "Applications of Systems of Linear Differential Equations, p.357", "Partial Differential Equations, p.457", "11.1       Simple Partial Differential Equations, p.457", "Wei-Chau Xie, 2010, Differential Equations for Engineers, Cambridge University Press, ISBN 978-0-521-19424-2, TA347.D45X54 2010"]}, {"course_id": 30, "course_code": "ENVE 223", "course_name": "ENVE223 - Differential Equations and Balance Laws (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Differential Equations and Balance Laws Winter 2025", "10:00AM - 11:20AM RCH 309", "08:30AM - 09:20AM", "An introduction to ordinary differential equations with applications to mass and energy balance problems in engineering.", "Standard methods of solution of first and second order linear equations with constant coefficients.", "Numerical methods for solving ordinary differential equations.", "Many practical physical and engineering problems can be analyzed using mathematical models formulated in terms of ordinary differential equations; these often arise from the application of mass, momentum, or energy balance laws.", "The objective of this course is to equip engineering students with a working knowledge of the methods which are used to solve these equations.", "Differential equations are introduced, along with standard methods of solution for first and second order linear equations with constant coefficients.", "identify and differentiate between the various types of differential equations; with this knowledge, be able to identify the most appropriate method of solution", "pose appropriate boundary or initial conditions and solve that equation using standard methods for given a mathematical problem statement expressed in terms of a linear differential equation", "check whether a solution to a differential equation is correct", "think critically about a mathematical problem and evaluate the validity of results from mathematical methods", "appreciate the utility and value of having an education in mathematics as part of their training as an engineer", "Canadian Engineering Accreditation Board", "Piazza – Wiki-style Q&A; primary way to get & give text-based help in ENVE/GEOE 223", "Drop-in Hours", "Students are very welcome and encouraged to meet with the teaching team in scheduled drop-in hours.", "1 Jan 6-10 CH1: Introductory concepts and definitions, simply integrable and separable solutions", "2 Jan 13-17 CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties, substitution", "3 Jan 20-24 CH3: Applications of linear first-order ODEs", "4 Jan 27-31 CH4: Solving homogeneous linear higher-order ODEs with constant coefficients A1, Jan 28", "6 Feb 10-14 CH6: Applications of linear higher-order linear ODEs", "Reading Week & Family Day", "7 Feb 24-28 CH7: Slope fields and numerical solution of first-order ODEs A2, Feb 25", "Notes of Diffy Qs, Differential Equations for Engineers, Jiří Lebl, Creative Commons, 2024.", "Calculus for Engineers (4e), Donald Trim, Pearson, 2007.", "Common first-year calculus text.", "CH1: Introductory concepts & definitions, simply integrable & separable solutions 0.2,3; 1.1,3 15.1,2", "CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties; substitution 1.4", "CH3: Applications of linear first-order ODEs 1.4 15.2,3,5", "CH4: Solving homogeneous linear higher-order ODEs with constant coefficients 2.1-3 15.6-8", "CH5: Solving non-homogeneous linear higher-order ODEs with constant coefficients using the method of undetermined coefficients 2.5 15.9", "CH6: Applications of linear higher-order linear ODEs  2.4 15.10", "CH7: Slope fields and numerical solution of first-order ODEs 1.2,7", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "extenuating circumstance", "This course includes the independent development and practice of engineering specific skills.", "Campus Supports", "Library for research-based assignments"]}, {"course_id": 31, "course_code": "GEOE 223", "course_name": "GEOE223 - Differential Equations and Balance Laws (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Differential Equations and Balance Laws Winter 2025", "10:00AM - 11:20AM RCH 309", "08:30AM - 09:20AM", "An introduction to ordinary differential equations with applications to mass and energy balance problems in engineering.", "Standard methods of solution of first and second order linear equations with constant coefficients.", "Numerical methods for solving ordinary differential equations.", "Many practical physical and engineering problems can be analyzed using mathematical models formulated in terms of ordinary differential equations; these often arise from the application of mass, momentum, or energy balance laws.", "The objective of this course is to equip engineering students with a working knowledge of the methods which are used to solve these equations.", "Differential equations are introduced, along with standard methods of solution for first and second order linear equations with constant coefficients.", "identify and differentiate between the various types of differential equations; with this knowledge, be able to identify the most appropriate method of solution", "pose appropriate boundary or initial conditions and solve that equation using standard methods for given a mathematical problem statement expressed in terms of a linear differential equation", "check whether a solution to a differential equation is correct", "think critically about a mathematical problem and evaluate the validity of results from mathematical methods", "appreciate the utility and value of having an education in mathematics as part of their training as an engineer", "Canadian Engineering Accreditation Board", "Piazza – Wiki-style Q&A; primary way to get & give text-based help in ENVE/GEOE 223", "Drop-in Hours", "Students are very welcome and encouraged to meet with the teaching team in scheduled drop-in hours.", "1 Jan 6-10 CH1: Introductory concepts and definitions, simply integrable and separable solutions", "2 Jan 13-17 CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties, substitution", "3 Jan 20-24 CH3: Applications of linear first-order ODEs", "4 Jan 27-31 CH4: Solving homogeneous linear higher-order ODEs with constant coefficients A1, Jan 28", "6 Feb 10-14 CH6: Applications of linear higher-order linear ODEs", "Reading Week & Family Day", "7 Feb 24-28 CH7: Slope fields and numerical solution of first-order ODEs A2, Feb 25", "Notes of Diffy Qs, Differential Equations for Engineers, Jiří Lebl, Creative Commons, 2024.", "Calculus for Engineers (4e), Donald Trim, Pearson, 2007.", "Common first-year calculus text.", "CH1: Introductory concepts & definitions, simply integrable & separable solutions 0.2,3; 1.1,3 15.1,2", "CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties; substitution 1.4", "CH3: Applications of linear first-order ODEs 1.4 15.2,3,5", "CH4: Solving homogeneous linear higher-order ODEs with constant coefficients 2.1-3 15.6-8", "CH5: Solving non-homogeneous linear higher-order ODEs with constant coefficients using the method of undetermined coefficients 2.5 15.9", "CH6: Applications of linear higher-order linear ODEs  2.4 15.10", "CH7: Slope fields and numerical solution of first-order ODEs 1.2,7", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "extenuating circumstance", "This course includes the independent development and practice of engineering specific skills.", "Campus Supports", "Library for research-based assignments"]}, {"course_id": 32, "course_code": "MATH 228", "course_name": "MATH228 - Differential Equations for Physics and Chemistry (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Differential Equations for Physics and Chemistry Winter 2025", "First-order equations, second-order linear equations with constant coefficients, series solutions and special functions, the Laplace transform method.", "Applications in physics and chemistry are emphasized.", "Differential equations capture how some variable of interest, such as the position of a planet, changes as a function of some independent variable, such as time.", "Differential equations are very widely used in the sciences because of the broad range of real-world phenomena they can describe in a mathematical framework.", "In this course, students will be introduced to the universe of differential equations, including first-order equations, second-order linear equations, series solutions, the Laplace transform method, and both exact and numerical methods for solving differential equations.", "Applications in physics and chemistry will be emphasized.", "understand how differential equations can be used to model physical systems,", "know how to classify differential equations,", "know how to solve various classes of differential equations using numerical methods and exact methods, and", "Unit 2 - First-Order Differential Equations (Weeks 2 - 3)", "Unit 3 - Second-Order Linear Equations (Weeks 4 - 5)", "Unit 4 - Mechanical and Electrical Vibrations (Week 6)", "Unit 5 - Series Solutions of Second-Order Linear Equations (Weeks 7 - 8)", "Unit 8 - Systems of Differential Equations (Weeks 11 - 12)", "In particular, it includes lots of helpful practice problems.", "To be clear - such websites are not allowed to be used for the completion of any assessment in MATH 228.", "Email a scanned copy of the Verification of Illness Form to your instructor."]}, {"course_id": 33, "course_code": "CIVE 353", "course_name": "CIVE353 - Geotechnical Engineering 1 (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["10:00AM - 11:20AM STC 0010", "An introduction to geologic processes.", "Weight-volume relationships.", "Apply the knowledge of soil mechanics in geotechnical designs of foundations, slopes, and retaining structures.", "Stress and Strain", "3. Seepage in Soil", "4. Effective Stress in Soil", "5.Consolidation of Soil", "Shear Strength of Soil"]}, {"course_id": 36, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 37, "course_code": "MATH 106", "course_name": "MATH106 - Applied Linear Algebra 1 (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Applied Linear Algebra 1 Winter 2025", "Systems of linear equations.", "Introduction to vector spaces.", "We will see how to solve systems of linear equations using matrix methods before studying matrices as algebraic objects in their own right.", "Next, we will learn about the fundamental concepts of span, linear independence, and basis and learn how to determine whether a set is a subspace of Rn.", "After studying subspaces, we will study linear mappings, which map subspaces to subspaces.", "We will discuss the geometric interpretation of these mappings and study their fundamental subspaces.", "Finally, we will learn how to calculate the determinant of a matrix and use this knowledge to diagonalize square matrices.", "Provide a graphical and algebraic description of vectors, lines, and planes in R^n", "Model and solve mathematical and discipline-specific problems using systems of linear equations", "Perform basic algebraic operations on matrices", "Given a set of vectors in R^n, determine whether it is linearly independent, a spanning set of R^n, or a basis of R^n", "Given a basis and a vector in standard coordinates, use matrix methods to calculate its coordinate vectors", "Given a set in R^n, determine whether it is a subspace of R^n", "Given a mapping L: R^n --> R^m, determine whether it is linear", "Given a linear mapping, choose the appropriate algorithm find a basis for each of its fundamental subspaces", "Given a square matrix, calculate its determinant and provide a geometric interpretation of this value", "Communicate ideas and concepts relating to linear algebra using accurate mathematical language and notation", "Calculators", "Avoiding Academic Offences", "I am committed to creating a learning environment where diverse perspectives are recognized and valued as a source of strength.", "School-Life Conflict"]}, {"course_id": 38, "course_code": "MATH 114", "course_name": "MATH114 - Linear Algebra for Science (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Linear Algebra for Science Winter 2025", "09:30AM - 10:20AM MC 4041", "Vectors in 2- and 3-space and their geometry.", "Linear equations, matrices, and determinants.", "Introduction to vector spaces.", "Eigenvalues and diagonalization.", "Provide a graphical and algebraic description of vectors, lines, and planes in Rn", "Model and solve mathematical and discipline-specific problems using systems of linear equations", "Perform basic algebraic operations on matrices", "Given a set of vectors in Rn, determine whether it is linearly independent, a spanning set of Rn, or a basis of Rn", "Given a basis and a vector in standard coordinates, use matrix methods to calculate its coordinate vectors", "Given a set in Rn, determine whether it is a subspace of Rn", "Given a mapping L: Rn --> Rm, determine whether it is linear", "Given a linear mapping, choose the appropriate algorithm find a basis for each of its fundamental subspaces", "Given a square matrix, calculate its determinant and provide a geometric interpretation of this value", "Perform arithmetics with complex numbers", "Use properties of modulus and conjugate of a number to perform arithmetics with complex numbers", "Calculate the product of complex numbers using the polar form", "Use quadratic formula to solve quadratic equations with complex roots", "Communicate ideas and concepts relating to linear algebra using accurate mathematical language and notation", "Unit 1: Vectors in Rn", "Jan 13 - 17 Unit 2: Systems of Linear Equations Möbius Quiz 1 In-person, during", "Mar 3 - 7 Unit 6: Linear Mappings Möbius Quiz 6 In-person, during", "Notice of Recording"]}, {"course_id": 39, "course_code": "EARTH 436B", "course_name": "EARTH436B - Honours Thesis (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["All students will be encouraged to consider formatting their research report as a journal paper with the potential to be submitted for publication consideration to a journal at the end of the course.", "OPTION A - Journal Paper Manuscript", "OPTION B - Conventional Thesis", "Obtain a past BSc thesis similar in scope to the research topic to be used as a guide document.", "The advisor can assist in selecting and providing an appropriate example.", "Plan and conduct independent and original research under the guidance of a research manager", "Learn discipline-specific protocols and procedures for addressing scientific questions and procedures and formats for reporting technical information according to discipline or sub-discipline standards", "Acquire an appreciation for and basic skill level to organize, interpret, and identify relevance of new information and results", "Understand how to organize, communicate effectively and disseminate clearly new information to peers and other professionals, both written and orally", "ACTIVITIES & DUE DATES", "No meeting", "No meeting", "Poster Session EIT Foyer in Museum", "Examples of past posters and final reports will also be provided as reference materials.", "Progress Report (15%): Progress reports should contain an updated clear statement of goal(s) and objectives of the research, a brief description of methods, an analysis of progress and problems, and a realistic timetable for completion of the remaining stages of the research project.", "This will be followed by a question-and-answer period.", "The letter of explanation and a revised timetable for completion must also be sent to the course instructor (drudolph@uwaterloo.ca).", "These electronic theses will be stored by the library and accessible online.", "The instructions for binding can be found at:", "Plagiarism is a very serious charge and can ruin promising careers.", "While generative AI technologies can provide general background information, you are responsible for demonstrating your application of knowledge by reporting, interpreting, and explaining your experimental findings in the context of the primary literature.", "Library for research-based assignments"]}, {"course_id": 40, "course_code": "PHYS 111", "course_name": "PHYS111 - Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["An introduction to physics for students intending to concentrate their further studies in biology, dentistry, medicine and paramedicine; includes particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.", "The main physics principles and laws covered in PHYS 111 include: “Particle kinematics and dynamics, energy and momentum conservation, and rotational mechanics.”", "PHYS 111 focuses on basic physics principles and laws, on conceptual understanding and problem-solving skills, and an appreciation for the power of physics in explaining how nature works, in the contexts of both the physical and life sciences.", "Physics Principles and Laws: By the end of the course, students will be able to construct scientifically sound explanations of a variety of basic physical phenomena by applying basic physics principles/laws.", "define linear momentum, and calculate and compare momenta of various real-life objects;", "define and calculate impulse, and establish the conditions for conservation of linear momentum; and", "apply the laws of conservation of momentum and energy to collisions.", "Problem-Solving Skills and Strategies: By the end of the course, students will be able to creatively apply a variety of structured problem-solving strategies:", "interpret, visualize and convert the problem into a physical model (e.g., draw a free body diagram);", "evaluate the result — does it make sense?", "These problem-solving skills are useful in the students’ own disciplines and beyond.", "More detailed information about the course elements which contribute to the final grade will be given in the learn sight and in future outline updates", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 41, "course_code": "PHYS 111L", "course_name": "PHYS111L - Physics 1 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "09:30AM -", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "Derin Erisoglu-Akyildiz", "Saba Karimi", "Do Yun Park", "jbschrie@uwaterloo.ca", "s38karim@uwaterloo.ca", "first for minor issues", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "12 & 13", "Complete end-of-term surveys before Dec. 3", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 42, "course_code": "PHYS 121", "course_name": "PHYS121 - Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["An introductory course in physics for students intending to concentrate their future studies in the physical sciences, optometry, or mathematics; includes vectors (dot and cross products), particle kinematics and dynamics, forces in nature, work and energy, conservation of energy and linear momentum, rotational kinematics and dynamics, and conservation of angular momentum.", "Doing Physics - quantities, dimensions, units", "Point Dynamics - force, motion, Newton's laws", "Conservation of Energy - work and energy, conservative systems", "Conservation of linear Momentum - momentum and systems of particles", "Understand the following concepts:", "- Linear kinematics: the relationship between distance, velocity and acceleration.", "- Linear dynamics: a consequence of forces and momentum, and how they interrelate.", "- Kinetic energy, potential energy, work, and their interrelationships.", "We will also re-examine these concepts in a rotating coordinate frame using angular kinematic variables along with torque and angular momentum.", "6 Module 06:  Kinetic and Potential Energy", "7 Module 06:  Kinetic and Potential Energy", "8 Module 07:  Linear Momentum", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- eText + Student Access Code", "University Physics 15th ed w/ Modern Physics & MasteringPhysics Access -- Print Format + Student Access Code"]}, {"course_id": 43, "course_code": "PHYS 121L", "course_name": "PHYS121L - Mechanics Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Mechanics Laboratory Fall 2024", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "03:30PM - 05:20PM", "STC 3018", "STC 3018", "Julian Meunier", "Soorna Choheili", "Reza Asadi", "Do note that emails sent outside of regular business hours may not receive a response until the next business day.", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "complete introductory surveys", "complete introductory surveys,", "Complete end-of-term surveys", "For some of these reasons there is procedure in order to qualify for some kind of accommodation.", "Throughout the term, primarily at the beginning and the end of the term there will be a number of surveys to be completed to gather information about your experience in the course.", "Prior to each experiment you will be given access to the Pre-Lab Reading Quizzes which are intended to give you a introduction and a refresher of the content that will be covered during the experiment.", "Library for research-based assignments"]}, {"course_id": 44, "course_code": "PHYS 112", "course_name": "PHYS112 - Physics 2 (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:30AM - 11:20AM DC 1350", "S. Idziak", "08:30AM - 09:20AM", "Email: idziak@uwaterloo.ca", "Email: james.forrest@uwaterloo.ca", "A continuation of PHYS111; includes simple harmonic motion, electrostatic force and potential, electric current and power, DC circuits, magnetic field and induction, wave motion, sound, and optics.", "To develop the ability to solve problems in areas related to oscillations and waves, electricity and magnetism, and optics", "Understand physical concepts associated with oscillations, waves, sound, electricity and magnetism, and optics", "Apply concepts of force and energy and recognize when acceleration is not constant", "Solve simple physical systems using physical concepts", "Draw relevant sketches from information given in word problems", "Develop physically relevant equations from information given in word problems", "Convert complex problems into a series of sub-problems and solve", "Topic Textbook Chapters                                                                            Number of lectures", "Electric Forces & Fields (Serway) Chapter 15: 1-5", "Electric Potential & Energy (Serway) Chapter 16", "Current and Resistance (Serway) Chapter 17: 1-6", "Magnetic Flux & Induction   1", "College Physics: A Strategic Approach by Jones, Knight, and Field This was suggested for 111.", "I do not find that these books are great but they are available for no cost.", "Please help to create a welcoming and inclusive environment.", "An exam-like problem will be posted each week on LEARN.", "2 points will be given for each clicker response with an additional 1 point for each correct response.", "What happens if I join the course late:", "Missed a regular assignment:", "Emails can be received 24 hours per day.", "Remember that falsely claiming you are ill can result in academic polices per Policy 71.", "Email communications:", "Notice of Recording"]}, {"course_id": 45, "course_code": "PHYS 112L", "course_name": "PHYS112L - Physics 2 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Sean Dougherty", "Aney Kapadia", "Kayra Erisoglu-Akyildiz", "jbschrie@uwaterloo.ca", "s2doughe@uwaterloo.ca", "Course Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"'", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 3 - Circuits", "Experiment 4 - Circuits", "Experiment 5 - Circuits", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 46, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 47, "course_code": "PHYS 122L", "course_name": "PHYS122L - Waves, Electricity and Magnetism Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 2 - Circuits", "Experiment 5 - Magnetic Fields of a Coil", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 48, "course_code": "CS 100", "course_name": "CS100 - Introduction to Computing Through Applications (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Computing Through Applications Winter 2025", "Friday -", "Friday", "10:30AM - 12:20PM MC 3005", "10:30AM - 12:20PM MC 3027", "Dave Tompkins", "E-mail: dtompkins@uwaterloo.ca", "E-mail: cs100@uwaterloo.ca", "Introduction to the Internet, World Wide Web, HTML, and XML.", "Algorithms underlying the functional components of web search engines and their influence on data access.", "CS 100: Introduction to Digital Information, Computers, the Internet and Applications", "Explain the emerging computing technologies introduced in the course.", "Digital Information", "Computer + Network organization", "Dynamic web pages and web applications", "Privacy and security", "Emerging Topics", "Distributed networking and \"big data\"", "Artificial intelligence", "ChatGPT and large language models", "Social media and monetization", "A1 released", "Laptops, Devices and Software", "Library for research-based assignments"]}, {"course_id": 49, "course_code": "MATH 103", "course_name": "MATH103 - Introductory Algebra for Arts and Social Science (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introductory Algebra for Arts and Social Science Winter 2025", "Email: jen.nelson@uwaterloo.ca", "Topics will be chosen from linear equations, systems of linear equations, linear inequalities, functions, set theory, permutations and combinations, binomial theorem, probability theory.", "The course begins with a review of operations with real numbers and fundamental algebra skills.", "The solutions of polynomial equations, both linear and quadratic, in one and two variables and their graphical representation are studied.", "An extension is made to linear systems with their solutions being expressed both algebraically and graphically.", "To solve linear systems, matrices and the associated row reduction strategies are used.", "The relationship between exponential functions and logarithmic functions is examined.", "The basic properties of logarithms are introduced and used to solve logarithmic and exponential equations.", "Various applications involving exponential growth and decay and logarithmic scales are presented.", "Concepts in set theory and counting theory support the study of probability theory.", "Perform operations with real numbers and algebraic expressions.", "Solve linear equations and inequalities in one variable, including those involving absolute value, and represent the solutions algebraically and graphically.", "Solve a system of linear equations using matrix operations, introducing a free variable, or parameter as appropriate.", "Solve quadratic equations in one variable.", "Recognize that the solutions to a quadratic equation in two variables lie on a curve known as a parabola and analyze the properties of a parabola.", "Describe the relationship between an exponential function and a logarithmic function.", "Use the properties of logarithms to solve logarithmic and exponential equations, and to solve problems involving exponential growth and decay, and logarithmic scales.", "Use the appropriate symbols and language in set theory to perform set operations, represent sets and subsets using Venn diagrams, and apply the counting principles for sets in real-life situations.", "1.1 Real Numbers", "1.2 Order of Operations", "1.3 Fundamental Algebraic Skills", "Unit 2: Equations and Inequalities", "2.1 Equations in One Variable", "Unit 2: Equations and Inequalities Continued", "2.3 Multivariate Equations", "Unit 3: Systems of Linear Equations and Matrices", "3.1 Systems of Linear Equations", "3.2 Introduction to Matrices and Elementary Row Operations", "Unit 3: Systems of Linear Equations and Matrices Continued", "3.3 Applications", "3.4 Systems With No Solutions and Systems With an Infinite Number of Solutions", "Unit 4: Quadratic Equations and Functions", "4.1 Quadratic Equations in One Variable", "4.2 Quadratic Equations in Two Variables and the Parabola", "4.3 Quadratic Functions", "4.4 Applications", "Unit 5: Exponential and Logarithmic Functions", "5.1 Exponential Functions and Equations", "5.2 Exponential Functions and Logarithmic Functions", "Unit 5: Exponential and Logarithmic Functions Continued", "5.4 Solving Logarithmic and Exponential Equations", "5.5 Applications", "6.1 Introduction to Sets", "6.2 Set Operations", "6.3 Counting Principles for Sets", "7.2 Combinations of Simple Events — Compound Events", "7.4 An Introduction to Random Variables and Probability Functions", "8.1 Counting Principles and Probability", "8.3 Combinations — Unordered Selections", "8.4 Binomial Models", "A non-programmable, non-graphing scientific calculator.", "Assignments may be screened by a human for evidence of plagiarism or the inappropriate use of resources.", "Notice of Recording", "instructor in advance in order to facilitate class participation.)"]}, {"course_id": 50, "course_code": "MATH 104", "course_name": "MATH104 - Introductory Calculus for Arts and Social Science (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Calculus for Arts and Social Science Winter 2025", "The major concepts introduced to solve problems are rate of change, optimization, growth and decay, and integration.", "This course provides an introduction to the applications of differential and integral calculus in business, the behavioural sciences, and the social sciences.", "A special type of limit will give rise to the derivative, the central idea in differential calculus.", "The interpretation of the derivative in applications such as rates of change and optimization, where the situations can be modelled by algebraic, exponential, or logarithmic functions, will be examined.", "The concepts of the antiderivative and the indefinite integral will be studied.", "The Fundamental Theorem of Calculus will relate the integral to the derivative.", "The problem of calculating the area under a curve will lead to the definite integral, a basic concept of integral calculus.", "The interpretation of the integral in various applications will be studied.", "be able to interpret a limit, given the graph of a function;", "evaluate the limit of a function using appropriate techniques;", "determine the derivative of polynomial functions using the definition of a derivative;", "determine the derivative of algebraic, exponential, and logarithmic functions using the techniques of differentiation;", "apply the derivative to determining equations of tangents, graphing functions, solving rate problems, and solving optimization problems;", "determine general and unique antiderivatives;", "determine the indefinite integral of a function using the techniques of integration;", "determine definite integrals; and", "Note there is a 24-hour cool-down period.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical tool-building and function sketching.", "Library for research-based assignments"]}, {"course_id": 51, "course_code": "MATH 124", "course_name": "MATH124 - Calculus and Vector Algebra for Kinesiology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Calculus and Vector Algebra for Kinesiology Fall 2024", "ipayne@uwaterloo.ca", "ipayne@uwaterloo.ca", "Email address ipayne@uwaterloo.ca", "Review of trigonometry and basic algebra.", "Introduction to vectors in 2- and 3-space: sums, addition, dot products, cross products and angles between vectors.", "Solving linear systems in two and three variables.", "Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties.", "Intuitive discussion of limits and continuity.", "Derivatives of elementary functions, derivative rules; applications to curve sketching, optimization.", "3 September 16 - September 20 exponential and trig functions, limits", "6 October 7 - October 11 derivatives of trig functions, implicit differentiation, first derivative test", "11 November 18 - November 22 dot product, projections, cross product, scalar equations", "12 November 25 - November 29 solving and interpreting systems of equations", "No specific Text will be followed for this course No", "The quizzes are mean to be written in under an hour, but you will be given the entire 110 minutes.", "Final Exam: The final exam will be scheduled be written during the exam period in December."]}, {"course_id": 0, "course_code": "ECE 105", "course_name": "ECE105 - Classical Mechanics (0.50)", "term_name": "1A Term", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Classical Mechanics Fall 2024", "ECE 105", "ECE 105 001", "Forces in nature and Newton's laws, dynamics and circular motion, work, energy, and conservation of energy.", "Linear momentum and linear impulse, rotational dynamics.", "View requirements for ECE 105", "identify the underlying physical principles relevant to a given physics problem", "develop a strategy how to solve the probelm", "employ the appropriate mathematical knowledge to do so", "Kinematics in 1D", "Free Fall, Kinematics in 2D and", "Relative motion", "Forces:", "Normal force and Tension", "Conservation of energy", "Linear momentum, Impulse", "Conservation of Linear momentum", "(1D, 2D & Relative Motion, Forces, Work, Energy conservation)", "Rot. kinetic energy, Moment of inertia, Torque", "Angular momentum conservation", "Rolling motion", "Static equilibrium", "SMH, Mass – spring systems", "SMH Energy", "December", "“Physics for Scientists and Engineers”, 2nd edition by Hawkes et.al.", "Mastering Physics online tool Yes", "The purpose of the assignments is for you to practice the fundamental techniques in a low-pressure environment.", "The total duration of each quiz is 60 min (50 min for writing the solutions and 10 min grace period for uploading pictures of the hand-written solutions).", "Make sure that where you write has a stable internet connection.", "Inability to submit because of your internet connection will require evidence of completion by the deadline.", "In case you cannot attend the FE due to illness of family emergency, contact the 1st", "Notice of Recording", "No parts of this course will be recorded"]}, {"course_id": 1, "course_code": "ECE 150", "course_name": "ECE150 - Fundamentals of Programming (0.50)", "term_name": "1A Term", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "ECE 150", "04:30PM - 05:20PM", "10:30AM - 11:20AM E7 5353", "08:30AM - 10:20AM", "Monday, Friday -", "11:30AM - 12:20PM E7 5353", "08:30AM - 10:20AM", "03:30PM - 04:20PM E7 5343", "02:30PM - 03:20PM", "08:30AM - 09:20AM", "08:30AM - 10:20AM", "Software design process in a high-level programming environment.", "Programming fundamentals, language syntax, simple data types, control constructs, functions, parameter passing, recursion, classes, arrays and lists, list traversals, introduction to searching and sorting algorithms, basic object-oriented design, polymorphism and inheritance, simple testing and debugging strategies, pointers and references, basic memory management.", "View requirements for ECE 150", "Instruct computers to carry out operational tasks using the C++ language.", "Demonstrate the ability to perform both procedural programming and object-oriented programming.", "Demonstrate the ability to test and debug programs.", "Also, the Department of Electrical and Computer Engineering cancels classes during mid-term week and, instead, offers make-up lectures.", "Libraries and function calls; writing functions; assertions; code-development strategies; writing tests and comments; and logging.", "Debugging; binary and hexadecimal numbers; integer data types; bitwise and bit-shift operators; floating-point data types; constant variables; and the default value of parameters.", "Addresses and pointers; dynamic memory allocation including that of arrays; lifetime of dynamically allocated memory; problems with pointers; and protecting pointers with const.", "Searching of arrays; sorted arrays; binary search; selection and insertion sort; and introduction to recursive algorithms and recursive mathematical functions.", "Solving problems recursively; the class data structure; namespaces; and functions on objects.", "Operator overloading; issues with member variables; using member functions; throwing and catching exceptions; classes; encapsulation; and constructors.", "Copies of objects; assignment of objects; the destructor; dynamic memory allocation in classes; weaknesses with arrays; linked lists; and a linked list with dynamic memory allocation.", "Adding a size list member variable and a tail pointer member variable; concatenating two linked lists; inheritance; a base linked list class; a window class for graphical user interfaces; exception classes and polymorphism; and a widget class for graphical user interfaces.", "Source code for Projects be submitted through the Marmoset.", "MOSS is used to verify that all source code in projects is not plagiarized from peers either from this offering or previous offerings of this course.", "Notice of Recording", "Generative artificial intelligence: This course includes the independent development and practice of specific skills, such as software design and development.", "Library for research-based assignments", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 2, "course_code": "ECE 190", "course_name": "ECE190 - Engineering Profession and Practice (0.25)", "term_name": "1A Term", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Profession and Practice Fall 2024", "08:30AM - 09:20AM E7 5353", "D. Davison", "11:30AM - 12:20PM E7 5353", "02:30PM - 03:20PM", "D. Davison", "04:30PM - 05:20PM", "03:30PM - 04:20PM E7 5343", "D. Davison", "Instructor Dan Davison", "o  Tuesdays 10:30am - 12:30pm in EIT 3114 and", "First-Year Engineering Tutors Noah Witzke", "TBD", "tbd@uwaterloo.ca Provide support during in-person activities", "Also see the contact information in the CFE Information folder on LEARN.", "Introduction to electrical and computer engineering with an emphasis on the profession of engineering, and engineering design.", "Additional topics include co-op fundamentals for engineering students, professional development, and diversity training with a goal of understanding the roles and responsibilities of the professional engineer in society.", "View requirements for ECE 190", "(4) Describe the steps of the engineering design process and apply them to a small design project", "(5) Define sustainable development and describe ways in which environmental sustainability and engineering are related", "(6) Explain the central ethical duties in engineering, and make justifiable decisions to solve simple ethical problems", "(7) Analyze and control risks in simple engineering and workplace settings", "(8) Explain the three design-team traps of ignorance, staleness, and social loafing and identify techniques to help avoid them", "(9) Define professional development and explain the role of professional development in engineering", "(11) Describe the three components of project management, construct a PERT chart, and identify a project's critical path", "\"Knowledge base for engineering\"", "\"Investigation\"", "\"Design\"", "6a", "\"Impact of engineering on society and the environment\" [", "\"Economics and project management\" [", "- Introduction to ECE190", "- Introduction to CFE and co-op Spare", "- Engineering profession", "- Working in teams  Spare Groups 1-40 attend in person", "- ECE190 groups meet and sign the Group Agreement Form", "- Engineering design process Groups 1-20 attend in person", "- Design activity Part 1 Groups 21-40 attend in person (group activity)", "- Design activity Part 1", "- Sustainability Groups 1-20 attend in person", "- Design activity Part 2 Groups 21-40 attend in person (group activity)", "- Design activity Part 2", "- Design-team traps Spare Spare", "- Professional development", "- Entrepreneurship Spare Spare", "- Measurement and", "Course materials on LEARN Must have a reliable internet connection.", "Textbook: \"Engineering Design:", "Textbook: \"Designing Engineers: An Introductory Text\", by Susan McCahan, Philip Anderson, Mark Kortschot, Peter E. Weiss, and Kimberly A. Woodhouse, 2015.", "Summary of marked components", "To increase lecture engagement, you should write down key points in your own words – I provide lecture summary sheets on LEARN that can be used for this purpose.", "The midterm test and final exam are closed-book, written individually, and consist of randomized multiple-choice questions based on the slide decks covered in the course lectures.", "Question format:  43 randomized multiple-choice questions", "Any reason for missing the midterm, other than those listed above, results in a score of zero on the midterm.", "Question format:  68 randomized multiple-choice questions", "Students who miss the final exam for one of these reasons will be eligible to write a deferred exam.", "Students who miss any final exam should contact the First-Year Engineering Office as soon as possible."]}, {"course_id": 3, "course_code": "ECE 198", "course_name": "ECE198 - Project Studio (0.25)", "term_name": "1A Term", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 198", "ECE 198 001", "08:30AM - 10:20AM E2 1792", "08:30AM - 09:20AM E7 5353", "10:30AM - 12:20PM E2 1792", "08:30AM - 10:20AM E2 1792", "08:30AM - 09:20AM", "The Course Instructor is responsible for overseeing the instructional design and coordinating the delivery of the course, including managing the Teaching Assistants.", "Amirhossein Akbarian", "Mohammadamin Hosseini", "Eric Yu", "sa7hosse@uwaterloo.ca", "View requirements for ECE 198", "The intention of this course is to provide students with an opportunity to apply engineering concepts in a small multidisciplinary design project to solve a specific problem.", "Apply critical thinking skills to specify, design, and verify an engineering solution.", "Quantify a series of specifications to define the project stakeholder’s design and performance requirements.", "Apply mathematical and scientific principles within quantitative technical analysis in order to design a solution that meets the specifications.", "Specify and demonstrate test methods to evaluate the design’s performance.", "Implement a prototype to test and verify the design.", "Develop and deploy basic software on a microcontroller, with the use of an Integrated Development Environment.", "Both partners must attend each meeting.", "It is highly recommended that students prepare to submit in advance of the deadline with enough time in advance just in case of unexpected submission difficulties.", "In addition, students may choose to make a submission that they know does not have a possibility of earning a perfect grade.", "It may be preferable to make a submission for partial grade than to incur a late penalty.", "It specifies key quantified requirements that the system is intended to fulfil.", "Design Document", "Implementation Demo", "The Implementation Demo is a live presentation and demonstration of the implementation of the system or a prototype of the system, designed by the project group.", "STM32 Nucleo development board https://wstore.uwaterloo.ca/ece-198-kit.html Yes", "STM32 Nucleo development board", "While for capital-intensive equipment such as lab instrumentation it makes sense to amortize the cost of the equipment across many students, in cases where materials are considered \"consumable\" or more individual in nature, it makes more sense for students to each own their own materials.", "In addition, this same development board will be used in the ECE 298 course in second year.", "At the end of term, be sure to retain your Nucleo-F401RE development board for future courses.", "Initial technical information about the Nucleo-F401RE board can be found here:", "The UW Engineering Society provides an electronics and components shop called RidgidWare in E7:", "4-core processor", "USB-A port", "If a project partner proceeds to make submission despite raised concerns, a complaint can be submitted to the Teaching Assistant, who will investigate.", "Style for References and Citations", "As a research tool it can be helpful in generating leads or avenues of research to investigate.", "As an editing tool, it can be helpful in exploring alternate ways to communicate that may be more effective.", "However, it can be easy to over-use this technology.", "There are some key risks to over-using AI.", "Second, you will not come to an understanding of the key purposes and functions of an engineering design process.", "These records must include details of the AI system used and details of the inputs submitted to the system.", "Some AI systems may have been trained on data sets without appropriate permission from the owners of the data.", "Verification"]}, {"course_id": 4, "course_code": "MATH 115", "course_name": "MATH115 - Linear Algebra for Engineering (0.50)", "term_name": "1A Term", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Linear Algebra for Engineering Fall 2024", "02:30PM - 03:20PM", "RCH 301", "RCH 301", "10:30AM - 11:20AM E7 5353", "02:30PM - 03:20PM", "E. Dupont", "03:30PM - 04:20PM E7 5343", "10:30AM - 12:20PM RCH 301", "10:30AM - 12:20PM", "PHY 313", "E. Dupont", "08:30AM - 09:20AM", "08:30AM - 10:20AM PHY 313", "08:30AM - 10:20AM RCH 309", "10:30AM - 11:20AM RCH 103", "11:30AM - 12:20PM RCH 103", "RCH 204", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "08:30AM - 10:20AM EV3 4412", "08:30AM - 10:20AM MC 4058", "02:30PM - 03:20PM", "09:30AM - 10:20AM RCH 302", "F. Al-Faisal", "10:30AM - 12:20PM MC 4063", "10:30AM - 12:20PM MC 4060", "10:30AM - 11:20AM RCH 110", "F. Al-Faisal", "03:30PM - 04:20PM", "02:30PM - 04:20PM MC 4060", "DWE 3522", "Tuesday -", "07:00PM - 08:50PM", "Linear equations, matrices, and determinants.", "Introduction to vector spaces.", "Eigenvalues and diagonalization.", "Present solutions to problems in a clear and logical manner with all steps being fully justified.", "Understand the basic operations of addition and scalar multiplication as they apply to vectors, matrices and linear transformations.", "Find the solution to a system of linear equations using matrices and elementary row operations.", "Understand matrix algebra and its connection to systems of equations.", "Have both a geometric and an algebraic understanding of span, linear independence, bases and subspaces.", "Recognize the link between matrices and linear transformations, and understand that many common geometric operations such as projections, reflections and rotations are linear transformations.", "Develop a basic algebraic and geometric understanding of complex numbers and complex polynomials.", "Determine the eigenvalues and eigenvectors of a matrix and diagonalize a matrix.", "1.1 Vectors in Rn", "1.2 Linear Combinations", "1.3 The Norm and the Dot Product", "1.4 Vector Equations of Lines and Planes", "1.5 The Cross Product in R3", "1.6 The Scalar Equation of Planes in R3", "1.7 Projections", "Chapter 2 Systems of Linear Equations", "2.1 Introduction and Terminology", "2.2 Solving Systems of Linear Equations", "2.3 Rank", "2.4 Homogeneous Systems of Linear Equations", "3.1 Matrix Algebra", "3.2 The Matrix-Vector Product", "3.3 The Matrix Equation Ax=b", "3.4 Matrix Multiplication", "3.5 Matrix Inverses", "4.1 Spanning Sets", "4.2 Geometry of Spanning Sets", "4.3 Linear Dependence and Linear Independence", "4.4 Subspaces of Rn", "4.5 Bases and Dimension", "4.6 Fundamental Subspaces of a Matrix", "Chapter 5 Linear Transformations", "5.1 Matrix Transformations and Linear Transformations", "5.2 Examples of Linear Transformations", "5.3 Operations on Linear Transformations", "5.4 Inverses of Linear Transformations", "5.5 The Kernel and the Range", "Chapter 6 Determinants", "6.1 Determinants and Invertibility", "6.2 Elementary Row and Column Operations", "6.3 Properties of Determinants", "7.1 Basic Operations", "7.2 Conjugate and Modulus", "7.3 Polar Form", "7.4 Complex Polynomials", "7.5 Complex nth Roots", "Chapter 8 Eigenvalues and Eigenvectors", "8.1 Introduction", "8.2 Computing Eigenvalues and Eigenvectors", "8.3 Eigenspaces", "8.4 Diagonalization", "8.5 Powers of Matrices", "Linear Algebra for Engineering Fall 2024 Course Notes Required text provided on LEARN Yes", "Linear Algebra with Applications by Keith Nicholson Optional text provided on LEARN No", "The Linear Algebra for Engineering Fall 2024 Course Notes is the required text for this course, and is available on LEARN.", "The text Linear Algebra with Applications is an optional text also available on LEARN for those students looking for an alternate exposition of the material and/or additional problems to work on.", "Students looking for extra practice beyond the course notes are welcome to attempt problems in the corresponding sections of the optional textbook.", "Python Assignments: Throughout the term, there will be 5 equally weighted assignments where students will use python to execute some prewritten code in an effort to explore some larger-scale applications of linear algebra.", "If you find yourself in a situation where you are missing multiple assessments, then you are advised to contact both your instructor and the First Year Engineering Office to make sure you have the proper supports in place to succeed in this courses.", "To be clear - such websites are not allowed to be used for the completion of any part of the course MATH 115, and students are not permitted to share questions from the course anywhere.", "Generative AI: This course includes the independent development and practice of specific skills, such as computations, problem solving and proof writing.", "Library for research-based assignments"]}, {"course_id": 5, "course_code": "MATH 117", "course_name": "MATH117 - Calculus 1 for Engineering (0.50)", "term_name": "1A Term", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Monday, Friday -", "11:30AM - 12:20PM E7 5353", "S. D'Alessio", "Friday -", "Friday", "04:30PM - 05:20PM E7 4053", "03:30PM - 04:20PM E7 5353", "Friday -", "Friday", "04:30PM - 05:20PM", "03:30PM - 04:20PM E7 5343", "02:30PM - 03:20PM", "08:30AM - 09:20AM", "S. D'Alessio", "09:30AM - 10:20AM STC 0060", "S. D'Alessio", "03:30PM - 04:20PM", "02:30PM - 04:20PM QNC 1506", "DWE 3522A", "DWE 3517", "08:30AM - 10:20AM DWE 1515", "08:30AM - 10:20AM DWE 3522A", "08:30AM - 10:20AM QNC 1506", "10:30AM - 12:20PM DWE 3522A", "10:30AM - 12:20PM MC 4058", "10:30AM -", "Functions of engineering importance; review of polynomial, exponential, and logarithmic functions; trigonometric functions and identities.", "Inverse functions (logarithmic and trigonometric).", "Limits and continuity.", "Applications of the derivative, max-min problems, Mean Value Theorem.", "Demonstrate skill in manipulating functions and performing calculations such as partial fraction decompositions and expressing piecewise defined functions in terms of Heaviside functions", "Read and use mathematical definitions", "Demonstrate skill in evaluation of limits, derivatives and integrals", "Use integration to calculate areas between and lengths of curves, find average values of functions, and calculating volumes of solids of revolution", "Sketch curves described in polar coordinates", "Use limits and derivatives to sketch graphs of functions or solve optimization problems", "Use integration to calculate areas enclosed by segments of curves in polar coordinates, and lengths of such curve segments", "Conic Sections", "Composition of Functions, Inverses and Symmetry", "Piecewise-Defined and Heaviside Functions", "Inequalities", "Partial Fractions", "Trigonometric, Hyperbolic and Inverse Trig Functions", "Sequences", "Limits and Proving Limits", "Continuity", "IVT/EVT", "Differentiation Rules, Implicit / Logarithmic Differentiation, Derivatives on Inverse Functions", "MVT, Constant/Increasing/Decreasing Functions", "Week 7: October 14 - 18 No classes and no tutorials   Thanksgiving & Reading Week", "Local/Global Extreme & Optimization Problems", "Curve Sketching", "The Definite Integral", "FTC1 & FTC2", "Indefinite Integrals", "Method of Substitution", "Integration by Parts (IBP)", "Areas between Curves, Average Values", "Trig Substitutions", "Integration of Rational Functions", "Arc Length, Surface Area and Volume of Revolution", "Improper Integrals", "Polar Coordinates, Areas and Arc Length in Polar Coordinates", "If working in a group, each group member must write and submit their own solutions in their own words.", "Exams", "Notice of Recording"]}, {"course_id": 6, "course_code": "COMMST 192", "course_name": "COMMST192 - Communication in the Engineering Profession (COMPE, ELE, MGTE) (0.50)", "term_name": "1A Term", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["D. Shakespeare", "In this course students in Computer, Electrical, and Management Engineering will enhance oral and written communication competencies in contexts relevant to the engineering profession.", "By participating in classes and completing course assignments, you will practice genres of communication crafted for audiences that might include employers, clients, peer groups, technical staff, public audiences, and regulatory and policy-focused stakeholders.", "By focusing on genre, design, and audience, you will come to better understand concepts including meaning-making, perception, and responsibility.", "More generally, in this course, students can and should learn professional norms of technical communication and dominant forms of sharing knowledge within the fields of engineering.", "Yet this course also attempts to teach students how these communicative forms are matters of social context and sites of negotiation and contestation.", "We also hope students will find their place and voice in the conversations in their fields of study and reflect on the meaning and shape of available forums for technical communication.", "describe and apply conventions, genres, and norms, and values of communication in an engineering discipline", "compose persuasive, audience-specific technical arguments", "analyze and summarize technical content in a clear and concise way", "You (students) will understand the complexity of communication as a human process of shared meaning-making in the context of power, history, and culture.", "You will increase your capacity to recognize and enhance yours and others’ agency – the ability to make a difference in the world for yourself and others – and understand the implications of your communication behaviours for yourself and others.", "You will recognize diverse linguistic practices and modes of communication as resources for writers and speakers.", "You will understand communication as a practice, and improve your critical and creative communication competencies by developing your ability to use writing, speaking, and other media of communication to create effective and engaging artifacts.", "You will reflect on your role in fostering the public good (the multifaceted well-being of individuals and groups), begin to imagine a better future, and make decisions in your communication that can transform the communities to which you belong.", "4 September Introduction to the Course \"The Art of Communicating Science\" (TED) acquire course text", "9 September Introduction to Rhetoric; Facts, Evidence, and Opinions Crowley & Hawhee; McBrayer read assigned texts", "18 November Ethics for Engineers in-class texts", "27 November Discourse and Power", "Late assignments will be penalized at a rate of 3% per day, including weekends and holidays.", "To record your efforts, you will be given a participation sheet that you will complete at the end of each session: you'll rate yourself for your performance and describe your in-class activities.", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website"]}, {"course_id": 7, "course_code": "ENGL 192", "course_name": "ENGL192 - Communication in the Engineering Profession (COMPE, ELE, MGTE) (0.50)", "term_name": "1A Term", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["In this course students in Computer, Electrical, and Management Engineering will enhance oral and written communication competencies in contexts relevant to the engineering profession.", "Students will enhance their critical-thinking skills and creative competencies to better understand meaning-making, perception, and responsibility.", "Explain the role of reports, the press, advertising, video and other communication media in engineering", "Demonstrate the command of appropriate writing skills and style", "Construct a persuasive technical argument", "Organize and deliver a persuasive oral presentation", "• Audience, Purpose, & Genre", "Thursday, January 9 • Show & Tell: Controversial Tech", "• Choose team members and case study for assignments 1 & 2", "• Familiarize yourself with IEEE citation standards", "• Technical Reports", "• Show & Tell: Useless Tech", "Due in class: Draft of Op-Ed", "• Relax!", "You’re done!!!", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "A held-with course will also only count towards program and breadth requirements of the subject code under which it is taken, unless it is cross-listed with the subject code of its’ held-with course.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 8, "course_code": "ECE 106", "course_name": "ECE106 - Electricity and Magnetism (0.50)", "term_name": "1B Term", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electricity and Magnetism Winter 2025", "ECE 106", "02:30PM - 03:20PM", "10:30AM - 12:20PM", "03:30PM - 04:20PM E7 5343", "08:30AM - 10:20AM E7 5343", "08:30AM - 10:20AM E7 5343", "08:30AM - 10:20AM E7 5343", "Amirhossein Akbarian, ahakbari@uwaterloo.ca", "Capacitors: dielectric, capacitance, electric energy storage.", "Inductors: magnetic flux, inductance, magnetic materials, magnetic energy storage.", "View requirements for ECE 106", "You should discuss your problems regarding concepts with the instructor and the tutorial TA.", "Electric Charges & Forces", "Electric Field (1)", "Chapter 23: 23.1-23.3", "Electric Field & Capacitors", "23.1-23.7", "Electrostatic Potential", "Electric Field & Potential", "Current & Resistance", "Magnetic Field", "Electromagnetic Induction", "Inductors", "Electromagnetic Fields & Waves", "1- R.D. Knight, “Physics for Scientists & Engineers,” 5th edition, Pearson, 2023 No"]}, {"course_id": 9, "course_code": "ECE 108", "course_name": "ECE108 - Discrete Mathematics and Logic 1 (0.50)", "term_name": "1B Term", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Discrete Mathematics and Logic 1 Winter 2025", "ECE 108", "ECE 108 001", "03:30PM - 04:20PM E7 5343", "Office hours: Monday 11:30am-12:30pm E7-5438", "ECE 108:", "Introduction to discrete mathematics, including propositional/Boolean logic, syntax and semantics, proof theory, and model theory; set theory, relations and functions, combinatorics (counting techniques, permutations, and combinations), graph theory.", "Applications in electrical, computing, and software engineering.", "View requirements for ECE 108", "Apply logic, sets and graphs to model and solve practical problems in Electrical and Computer Engineering", "Solve introductory problems in combinatorics and discrete probability.", "wk02   Propositional logic: formalization and proof", "wk03   Predicate logic: syntax and semantics", "wk04   Predicate logic: formalization and proof", "wk05   Proofs with case splits and Induction", "wk06   Formalization and proofs about lists and sets", "wk08   Functions and relations", "The grade in the course should reflect overall knowledge of the course material.", "Absences and Assessments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 10, "course_code": "ECE 124", "course_name": "ECE124 - Digital Circuits and Systems (0.50)", "term_name": "1B Term", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Digital Circuits and Systems Winter 2025", "Monday -", "Monday", "08:30AM - 10:20AM", "03:30PM - 04:20PM E7 5343", "Monday -", "Monday", "08:30AM - 10:20AM", "08:30AM - 09:50AM RCH 302", "11:30AM - 12:20PM RCH 302", "Number systems and Boolean arithmetic.", "Boolean algebra and simplification of Boolean functions.", "View requirements for ECE 124", "understand Boolean algebra and manipulate Boolean operations to simplify related functions,", "comprehend logic gates, and design, optimize and implement combinational logic circuits,", "gain knowledge of digital storage elements and finite state machines, and design and analyze synchronous sequential circuits,", "grasp the essential principles of analyzing and designing asynchronous sequential circuits,", "understand common number systems for signed numbers and design basic arithmetic circuits", "Boolean logic and algebra", "Algebraic simplification and applications", "Optimized implementations", "Introduction to sequential circuits", "Design of synchronous sequential circuits", "Asynchronous sequential circuit analysis and design", "Number representations and simple arithmetic circuits", "Number conversion (review & self-study).", "Binary logic and circuits.", "Don’t cares and multiple outputs.", "Flip-flop choices.", "Analysis of ASC.", "Hazards free circuits.", "Number systems (octal and hex).", "Presentations in E2-2364 by lab instructor", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "The time and room number for the tutorial sessions where some of the practice problems will be solved/discussed are", "Tut 101, 102 & 103:   3:30-4:20M in E7-5343", "Labs are integral part of the course and must be completed in a satisfactory manner.", "The weights on these remote exams will remain the same as those stated earlier for the case of in-person (see weight distribution tables under Student Assessment).", "This course includes the independent development and practice of specific skills, such as FPGA design coding with VHDL or Verilog Hardware description languages.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca"]}]