[{"course_id": 6, "course_code": "CS 135", "course_name": "CS135 - Designing Functional Programs (0.50)", "term_name": "List 1", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Designing Functional Programs Winter 2025", "Monday -", "Monday", "07:00PM - 08:50PM", "08:30AM - 09:20AM", "10:30AM - 11:20AM MC 2034", "Charlie Clarke", "Email: claclark@uwaterloo.ca", "Karen Anderson", "Email: kaanders@uwaterloo.ca", "Email: dbwolff@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "Sara Nayar", "Email: cs135@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "CS135 Problem-solving FAQ", "Assignment Marking Error: Submit a re-mark request, due within one week of release of marks.", "Read Me First", "We hope to guide you through a carefully designed curriculum that introduces you to core concepts in computer science.", "In a typical week, you will move through the following activities:", "You should get a feel for what information is where so you can find it quickly in the future.", "An introduction to the fundamentals of computer science through the application of elementary programming patterns in the functional style of programming.", "Syntax and semantics of a functional programming language.", "Linear and nonlinear data structures.", "Abstraction and encapsulation.", "CS 135 Designing Functional Programs", "CS 135 is for students who would prefer a more conceptual treatment of introductory computer science in a simple language that is educationally effective but not commercially relevant.", "Hardware and Software", "Student labs are equipped with the DrRacket integrated development environment running on networked personal computers.", "References", "How To Design Programs by Felleisen, Findler, Flatt, and Krishnamurthi, MIT Press, 2003.", "Definition of lists, designing functions to process and produce lists, recursive definition of natural numbers, recursive data definitions.", "Non-Linear Structures (6 hours)", "Multi-clausal recursive data definitions, trees, mutually referential data definitions, design methods for complex data, iterative refinement, multiplexing.", "Early development of electronic computers and programming languages.", "History of concepts covered in this course.", "have understanding and experience with the topics in the course outline above", "Drop deadline 25", "Reading Week Starts", "Slides Description", "L01 Values and expressions Prefix notation, exact numbers, Boolean expressions, constants", "L04 Lists List values and expressions, composite data, data definitions", "iClicker pilot", "2024-08-26: CS135 is participating in a pilot comparison of iClicker and Vevox.", "The iClicker subscription should be free.", "iClicker Account", "Racket and DrRacket", "It is also simple and clean enough that we cover computer science content many CS students do not see until later in their CS careers.", "If you submit code written under some other system and it does not work in our currently-supported version of DrRacket, then we consider that code incorrect even if it works for you at home.", "Your work in CS135 will be assessed in a variety of ways.", "Coverage", "Using such off-limits material generally results in a significant loss of marks.", "In general, the basic tests will try to warn you if inappropriate functions and special forms are used.", "Submitting a partially completed solution is a good idea, just in case you don’t get back to it before the due date and to serve as a backup in case your computer breaks or is stolen.", "Email Karen Anderson .", "Email the ISAs and ask them to “mark it for feedback”.", "Testing", "We do several kinds of testing on your submissions:", "Basic tests", "Each time you submit before the due date, we run a set of “basic tests” on your submission.", "It’s amazing how many fatal errors can appear during last-minute tidying up!", "Do not make your last submission immediately before the deadline – it gives you no time to check the Basic Test results and respond, if needed.", "The numeric mark appearing on the basic test marksheet is only for guidance.", "After the submission deadline we run a second set of tests to assess your code, including:", "These post-deadline tests and hand-marking form your mark for the assignment.", "If you procrastinate long enough, this rule can easily cause you to fail the course.", "We won’t rehash the above policies, but we do want to make them concrete for CS135.", "A specific assignment may give exceptions to the above.", "You are welcome to use these tools to help you understand the course material, but you should not:", "cut-and-paste your assignment code into them for debugging assistance.", "Also, these tools will not be available when you write the exam, so you need to understand how to solve these problems yourself in order to pass the course.", "attempting to run malicious code during the submission or marking process."]}, {"course_id": 12, "course_code": "MSE 121", "course_name": "MSE121 - Introduction to Computer Programming (0.50)", "term_name": "List 1", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Introduction to Computer Programming Winter 2025", "11:30AM - 12:20PM DWE 3519", "10:30AM - 11:20AM DWE 3522A", "Friday -", "Friday", "02:30PM - 05:20PM", "An introduction to computer programming using a high level programming language.", "Concepts and topics covered include the basic components of algorithms (primitive operations, variables, sequencing operations, conditionals/branching, repetition/loops, subroutines/functions), problem decomposition, abstraction, testing and debugging, pseudo-code, file based input and output, use of a modern development environment including a symbolic debugger, good coding style, pointers/references, and basic data structures (arrays, records, objects).", "Identify syntax errors in Python code.", "Design and implement functions to solve small problems.", "Design]", "Design and implement programs to solve complex problems by decomposition.", "Design]", "Critique their own and other's code and use that feedback to refactor and improve the code.", "Design]", "Understand the basics of objects and their implementation.", "Understand how computers store numbers and text in a binary representations.", "Introduction to programming.", "Basic operations: arithmetic, expressions, simple I/O.", "Boolean logic and operators.", "An online copy can be rented for the duration of the course from VitalSource ( https://www.vitalsource.com/en-ca/products/python-programming-an-introduction-to-computer-john-m-zelle-v9781590282984 )/", "Projects may have multiple components with multiple deadlines.", "An excused absence for the final exam will be handled on a case by case basis.", "Plagiarism software and alternatives: Plagiarism detection software will be used to screen assignments in this course.", "UW-Learn and Campuswire", "Failure to follow these classroom rules will result in a 3 stage escalation process:", "Do not contact the instructor by phone except in the case of emergency.", "Do not “drop in for a quick question”.", "No material may be copied from any source except when you must copy something as part of your answer, and in these cases, you must quote the copied material and cite the source.", "As much as possible, discussions of computer programs should be at the level of pseudo-code and not at the level of real computer code.", "Working in groups can be a great way to learn material better and faster.", "Examples", "Copying even one line source code.", "Bob sends her his code which shows him using a while loop and Aarti copies the lines of code that implement the loop.", "Roberto: providing code]", "Sally helps Harish step through his code and find the bug.", "Harish and Sally acknowledge their collaboration.", "Unacceptable Behavior: Mary asks ChatGPT to solve the homework and then submits portions of code from ChatGPT as her own.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 15, "course_code": "SYDE 121", "course_name": "SYDE121 - Digital Computation (0.50)", "term_name": "List 1", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["08:30AM - 10:20AM E5 6008", "RCH 301", "RCH 301", "Fatima Syeda: f2syeda@uwaterloo.ca", "Use structured and object-oriented programming techniques to solve engineering problems (2)", "Apply software debugging tools and techniques during software development (5)", "Introduction, Basics of Computer Systems Sections 1.1 (Computer Systems) and 1.2 (Programming and Problem Solving)", "Variables and Data Types, Control Flow Basics, Testing and Debugging Sections 1.3-1.4 (Introduction to C++, Testing and Debugging), 2.1-2.3 (Variables and Assignments, Input and Output, Data Types and Expressions), Sections 2.4-2.5 (Flow of Control, Program Styling) and 3.1-3.2 (Boolean Expressions, Multiway Branches)", "Designing Loops, Top-Down Design, Function Declaration and Definition (Revisit) Sections 3.3-3.4 (Designing Loops), Sections 4.1-4.3 (Top-Down Design, Designing Functions), Sections 4.4-4.6 (Procedural Abstraction, Scope Rules, Overloading)", "Procedural Abstraction, Overloading Functions, Call by Reference Sections 5.1-5.3 (More on void Functions, Call by Reference Parameters, Functions Calling Other Functions), Sections 5.4-5.5 (Stubs and Drivers, Debugging Functions), Sections 7.1-7.4 (Introduction to Arrays, Arrays in Functions, Multidimensional Arrays)", "Debugging Functions, Arrays in functions   Quiz#2 (Oct 9)", "Vectors and STL Types, C-Style Strings, C++ String Class Sections 8.1-8.3 (An Array for Strings, String Class, Vectors)", "Structures and Classes, Abstract Data Types, Object Oriented Design Sections 10.1-10.3 (Structures, Classes, Abstract Data Types)", "Pointers and Dynamic Memory Basics, Smart Pointers Sections Sections 9.1 & 9.2 (Pointers, Dynamic Memory) LabAssignment #3 due", "G. J. Bronson: “C++for Engineers and Scientists”.", "Send a note via email to the course instructor clearly stating the grading item that you want remarked Attach supporting evidence for your case including screenshots of the pages that need to be regraded.", "A student must save a copy of the submitted work on his or her personal computer or personal file system in case of any website problem.", "Sign your email with your first and last name and your student number.", "While we will do our best to respond to your emails as soon as possible, allow a couple of hours (excluding weekends) for a response to your email.", "When in doubt please be", "Workshops will be delayed or transitioned to an online session on a case-by-case basis.", "To facilitate a delay, a workshop session may be replaced with a lecture delivered in an online format.", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows UW’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 18, "course_code": "CS 138", "course_name": "CS138 - Introduction to Data Abstraction and Implementation (0.50)", "term_name": "List 2", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Introduction to Data Abstraction and Implementation Winter 2025", "10:30AM - 12:20PM", "10:00AM - 11:20AM RCH 302", "11:30AM - 12:20PM RCH 302", "11:30AM - 12:20PM MC 2034", "Email: migod@uwaterloo.ca", "Alireza Shaeri", "Email: cs138@uwaterloo.ca", "Email: w352chen@uwaterloo.ca", "Aniruddhan Murali", "Email: a25mural@uwaterloo.ca", "Email: w2ren@uwaterloo.ca", "Hanna Derets", "Email: sfking@uwaterloo.ca", "Office Hours: Scheduled by email and held through Microsoft Teams", "Software abstractions via elementary data structures and their implementation; encapsulation and modularity; class and interface definitions; object instantiation; recursion; elementary abstract data types, including sequences, stacks, queues, and trees; implementation using linked structures and arrays; vectors and strings; memory models; automatic vs. dynamic memory management.", "Understand and apply object-oriented programming concepts.", "Write object-oriented code that manipulates linked data structures.", "Write code without memory errors in a memory-unsafe programming language.", "Operating system and Unix concepts, programming language concepts", "Introduction to C++ concepts (3 hours)", "ADT and their implementations as linked structures (12 hours)", "The C/C++ memory model: pointers vs references, stack vs freestore", "Implementing and travesing linked structures", "Space and time complexity of solutions", "Simple testing and debugging strategies", "Object-based computing (9 hours)", "Class definitions, instantiation, object construction and destruction", "Objects vs pointers to objects", "Interface design and abstraction, responsibility allocation", "The adapter design pattern", "Introduction to object-oriented programming (9 hours)", "Introduction to inheritance and its implementation in C++", "Introduction to generics, type parameterization, and C++ templates", "The template method design pattern", "Use of generic data containers and the Standard Template Library", "Design heuristics and strategies for object-oriented programming", "-marking is intended for situations where minor changes result in major mark boosts (i.e. a forgotten semicolon failed 4/5 secret cases).", "A better title would be something like \"Iterating Over a Vector\" or \"Question About Maps.\"", "This course includes the independent development and practice of specific skills, such as as writing and reading code, tracing, and algorithm design.", "Library for research-based assignments"]}, {"course_id": 19, "course_code": "CS 146", "course_name": "CS146 - Elementary Algorithm Design and Data Abstraction (Advanced Level) (0.50)", "term_name": "List 2", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Elementary Algorithm Design and Data Abstraction (Advanced Level)", "Monday -", "Monday", "07:00PM - 08:50PM", "02:30PM - 03:20PM", "Brad In-person MC 6427", "On-line Consulting Hours: Microsoft Teams", "CS 146: Elementary Algorithm Design and Data Abstraction (advanced version)", "To familiarize students with key concepts in introductory computer science from an imperative perspective and to contrast this with the functional perspective taken in CS 145;", "To allow students to complete the CS portion of their Math core requirements and, if desired, to continue on to second-year core courses in CS;", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "Introduction to C and elementary mutation in Scheme", "The memory model.", "Variable declaration, assignment and infix expressions in C. Basic I/O in C. Compilation.", "Algorithm analysis in C. File I/O in C and Scheme.", "Program organization and testing methods.", "Space analysis in C and Scheme.", "Mutable lists, queues, deques, and trees in C. Time-space tradeoffs among mutable and immutable ADT implementations.", "Low-level abstractions", "Pointer arithmetic in C. Arrays in C and vectors in Scheme.", "Strings in C. Elementary hashing.", "Libraries in C and Scheme.", "Implementing high-level abstractions", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "The provided slides are not a substitute for attendance in any first-year CS course, but in CS 146, there are no slides, and the lecture summaries made available after lecture are an even worse substitute for attendance.", "Lectures will involve the development of ideas summarized very tersely in the handouts, as well as on-the-fly development of code, analyses, and proofs.", "CS145 and CS146 were originally designed as a year-long unit of curriculum, but eventually the individual courses drifted in their own directions.", "1.1 A note on logistics", "1.2 Review of forms of recursion and associated proof techniques", "1.3 In preparation for side effects", "1.4 Output", "1.5 Input", "1.6 First Introduction to C", "1.8 Memoization", "1.9 Mutation in C", "1.11 Boxes in C", "1.12 Advanced mutation", "1.13 Aliasing in C", "1.14 Memory and vectors", "1.15 Vectors in Racket", "1.16 Arrays in C", "1.18 ADTs in C; Amortized Analysis", "2 SIMPL: a simple imperative language", "2.1 Syntax and informal semantics", "2.2 Examples in several languages", "2.3 Formal semantics", "2.5 Proving imperative programs correct", "A primitive imperative language", "3.1 A primitive imperative language", "3.2 The PRIMPL simulator", "3.4 The SIMPL to A-PRIMPL compiler", "3.6 Strings in C", "3.7 Adding functions to SIMPL", "3.8 Adding both arrays and functions to SIMPL", "3.9 Implementing lists in PRIMPL", "4 MMIX: a realistic instruction set", "4.1 A more realistic processor", "4.2 The MMIX architecture", "4.2.1 Branches and Jumps", "4.2.2 Example", "4.2.3 Software Interrupts", "4.2.5 A Problem with Branches and Jumps", "4.4 Towards a SIMPL to MMIX compiler", "5.1 Storing primitive values", "5.3 Managing memory", "5.4 Structural and pointer equality", "5.5 Function application in a Racket interpreter", "5.7 Justifying the cost of Racket primitives", "5.8 Moving towards implementation in an imperative language", "6.2 Zippers", "6.3 A continuation-passing interpreter", "6.6.2 Mark-and-sweep", "6.6.3 Copying garbage collection", "6.7 Heterogeneous Data in C", "6.8 Multidimensional Arrays in C", "6.10 Variable-length Argument Lists", "7.1 Continuation-passing style", "7.2 Exception handling", "7.3 Undelimited continuations", "7.4 Delimited continuations", "7.5 Racket’s implementation of continuations", "In CS 146, we will examine the imperative paradigm, and compare and contrast the way that efficient algorithms and data structures are designed in imperative and functional languages.", "Racket is a laboratory for current research on aspects of functional programming languages, and we will continue to look at interesting topics in this area, perhaps at the cost of some coherency in the flow of material.", "They will not be due each week on the same day, as is common in the other first-year CS courses and the first-year Math courses.", "Assignment questions are the main way to reinforce and deepen your understanding of the concepts and skills discussed in lecture.", "You will submit program files electronically to the Marmoset system , which runs tests on your code and informs you of the results fairly rapidly.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "(Please also note that we may use the trends in a student's submission history to estimate the likelihood of other forms of cheating as well.)", "Library for research-based assignments"]}, {"course_id": 26, "course_code": "BME 393", "course_name": "BME393 - Digital Systems (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Digital Systems Winter 2025", "11:00AM - 12:20PM E7 4417", "omar.alburaiki@uwaterloo.ca", "Email omar.alburaiki@uwaterloo.ca", "Topics will be reinforced in the context of biomedical microcontrollers and sensors used in physiological monitoring and clinical support systems.", "Topics will be reinforced in the context of biomedical microcontrollers and sensors used in physiological monitoring and clinical support systems.", "Analyze internal components of digital systems and their technical details", "2. Explain the importance of digital systems and computer architecture for biomedical applications", "4. Use biomedical controllers and sensors to design digital systems", "5. Design digital systems that are reliable (observed behavior matches specifications), safe (avoid putting human lives in danger even in presence of errors and failures), and robust (ability to handle unspecified inputs and state)", "Week6# Sequential Circuits and Sequential Logic Design", "Week7# More on Sequential Circuits and Sequential Logic Design", "Week8# Microcontroller Architecture and Interfacing, Timers/Counters", "Week10# Microprocessor Architecture, Datapath Design", "Week12# Microprocessor Pipelined Design", "Week13# More on Microprocessor Pipelined Design", "Harris and Harris: “Digital Design and Computer Architecture”.", "Each of these assignments may include analytical, numerical (using Falstad) and explanatory components exploring fundamental aspects of the material covered in the course."]}, {"course_id": 30, "course_code": "EARTH 456", "course_name": "EARTH456 - Numerical Methods in Hydrogeology (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Numerical Methods in Hydrogeology Winter 2025", "An introduction to the theory and practice of groundwater flow and contaminant transport modeling.", "Topics related to variably-saturated flow will focus on derivation of Richard's equation, a control volume finite difference discretization, assembly and solution of the flow equation, material balance error, truncation error analysis, stability and monotonicity.", "Explain the fundamental theory behind groundwater flow and contaminant transport modeling", "Apply numerical techniques, including control volume finite difference discretization, to solve groundwater flow and contaminant transport equations.", "Analyze numerical model accuracy, including material balance error, truncation error, stability, and monotonicity in variably-saturated flow and contaminant transport problems.", "Use a modeling software to model variably-saturated flow and contaminant transport.", "Interpret and visualize groundwater flow and contaminant transport model results and communicate findings effectively.", "Identify the concepts of groundwater and solute transport modeling and their real-world applications.", "Section 1.1 Derivation of Richards' Equation", "Section 1.2 Derivation of Richards 'Equation – Pressure Head Formulation", "Section 1.3 Three-Dimensional Groundwater Flow", "Derive and interpret three-dimensional groundwater flow dynamics and their mathematical representation.", "Section 1.4 Control Volume Finite Difference Discretization for Flow", "Section 1.5 A Rigorous Derivation of the Control Volume Finite Difference Discretization", "Develop, apply, and justify control volume finite difference discretization techniques for groundwater flow problems, demonstrating a rigorous understanding of mathematical principles.", "Assemble and implement saturated groundwater flow equations in numerical models using discretized formulations.", "Assemble the saturated groundwater flow equation using control volume discretization.", "Analyze groundwater flow material balance errors and their implications for numerical model accuracy.", "Section 1.8 Truncation Error Analysis", "Section 1.8 Truncation Error Analysis", "Section 1.9 Stability and Monotonicity", "Section 2.1 Derivation of the Contaminant Transport Equation", "Analyze the stability and monotonicity of numerical methods for groundwater flow models.", "Derive the contaminant transport equation and articulate its role in modeling solute movement through porous media.", "Section 2.1 Derivation of the Contaminant Transport Equation", "Section 2.2 Control Volume Finite Difference Discretization of the Contaminant Transport Equation", "Section 2.3 Central Spatial Weighting of Advective Flux", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Apply control volume finite difference discretization to the contaminant transport equation for numerical modeling.", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Section 2.4 Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.5 Upstream Spatial Weighting of Advective Flux", "Section 2.5.1 Truncation Error of Upstream Spatial Weighting", "Section 2.6 Crank-Nicolson Temporal Weighting with Upstream Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.7 Assembly of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.7.1 Monotonicity of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.8 Assembly of Fully-Implicit Temporal Weighting with Upstream Spatial Weighting", "Section 2.8.1 Monotonicity of Upstream Spatial Weighting with Fully-Implicit Temporal Weighting", "Section 2.9 Boundary Conditions for Transport Coupled to Flow", "Analyze the accuracy of various contaminant transport weighting schemes and their impact on numerical model performance.", "Apply boundary conditions for contaminant transport coupled with groundwater flow and assess material balance errors to ensure reliable numerical simulations.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "The total maximum bonus points that can be earned across all five assignments is five.", "Students can earn bonus points by actively participating in discussions or helping their peers understand the course material and assignments.", "Explaining a challenging concept to peers in a collaborative study session.", "A maximum of five contributions will be allowed per assignment."]}, {"course_id": 33, "course_code": "CS 234", "course_name": "CS234 - Data Types and Structures (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Notice of Recording", "Data Types and Structures Fall 2024", "MarkUs problems Email IAs at the course account", "Microsoft Teams problems Email ISG Coordinator Scott King", "Missed assignment or quiz Email ISG Coordinator Scott King", "Extenuating circumstances Email ISG Coordinator Scott King", "Error in mark entry Email IAs at the course account", "ISG Coordinator", "Introduction to commonly used data types, including lists, sets, mappings, and trees.", "This course introduces widely used and effective methods of data organization, focusing on data structures, their algorithms, and the performance of these algorithms.", "Students who successfully complete the course can use these tools to design and develop efficient programs for a wide variety of applications.", "Audience", "Students wishing to understand how choices made in program design can significantly affect performance and how to make these choices", "Highly recommended for students in Information Management and similar fields and for those in the Mathematics/Teaching plan", "The initial topics in CS 234 will present some material new to those coming out of CS 116 (but covered in CS 136) and some material new to those coming out of CS 136 (but covered in CS 116).", "Co-requisites: None", "Rance D. Neśaise, Data Structures and Algorithms Using Python, Wiley, 2010", "Describe basic quadratic sorting algorithms, such as Selection Sort or Insertion Sort.", "Given a simple, well-specified computational task, write a program in a high-level imperative language (e.g., Python, C, or Java) and generate appropriate test cases.", "Use as appropriate simple types, built-in compound types and control idioms, such as selection, iteration, and recursion.", "Explain the benefits of using abstract data types (ADTs) and data structures, and more generally, the concepts of modularity and data hiding, in solving problems in a wide variety of application areas.", "Understand the differing points of view of the user and provider of an ADT and the use of an interface to communicate between views.", "Explain and use the concepts of asymptotic running time, order notation, worst-case, average-case, and best-case complexity, and lower and upper bounds.", "Given a simple algorithm written in pseudocode, determine and informally justify its asymptotic running time, as expressed in order notation.", "Explain the basic structure of memory, including the distinction between external and internal memory and the concept of paging.", "Explain the complexity of some common implementations of these ADTs.", "Given a well-specified computational problem, determine which (if any) ADTs would be suitable.", "Explain how specialized data structures can lead to efficient solutions to specific real-world problems.", "Topics: User and provider viewpoints, planning and coding stages, abstract data types, modularity and data hiding, ADT Multiset, pseudocode, memory model", "Topics: Best, worst, and average-case running times, order notation, algorithm analysis", "Topics: Graph terminology, ADT Undirected Graph, ADT Directed Graph, implementations, depth-first search, breadth-first search", "Topics: Average-case analysis, interpolation search, heuristics, hashing, bucket sort, radix sort", "Notice of Recording", "Should problems occur, your early drafts serve as backups in case of computer problems, and provide evidence of your having attempted to submit work before the deadline.", "Re-mark requests", "The subject should be \"Ax re-mark request\" for x the number of the assignment.", "In the body of the email, include the rationale for the re-mark and the parts of the question that need atttention.", "Exam policies and missed examinations", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 36, "course_code": "CS 445", "course_name": "CS445 - Software Requirements Specification and Analysis (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Software Requirements Specification and Analysis Winter 2025", "10:00AM - 11:20AM MC 2035", "Email:x784chen@uwaterloo.ca", "Email: ar2elsha@uwaterloo.ca", "Email: d3pang@uwaterloo.ca", "Models, notations, and processes for software requirements identification, representation, analysis, and validation.", "ECE 451: View requirements for ECE 451", "The week of", "Deliverables", "1 Introduction", "3 RE Reference Model", "Jan 13 4 Domain Model 4 Domain Model D0 – Group members & Project idea", "Jan 27 7 Functional Modelling 8 OCL D1 – Domain Model & Stakeholders", "Feb 10 10 Quality Requirements 10 Quality Requirements D2 -  Use case Diagram & Description", "Feb 24 11 Requirements Conflict management 12 Prioritizing Requirements D3 – Functional Model & OCL", "Mar 3 13 Cost Estimation 14 Risk Analysis D4 – State Diagram", "Mar 17 15 Temporal Logic 16 Validation and Verification D5 – Cost Estimation & Risk Analysis", "Mar 31 17 Software Project Management 18 Requirement Engineering for AI Systems D6 - Quality Attributes and Temporal Logic", "Ability to separate requirements from specifications from domain assumptions and argue that a specification + domain assumptions satisfy requirements", "Ability to model requirements in a variety of modelling paradigms", "Ability to elicit and document non-functional requirements such that the to-be-developed software can be objectively tested for their satisfaction", "Ability to use tools to manage a Software Development Team.", "Why is requirements analysis complex?", "Functions as a modelling notation.  Pre- and post-conditions.", "Use-case diagrams.", "Functions over a class diagram.", "Modelling dynamic behaviour of a software system.", "UML State Machines.", "Specification patterns.", "7: Model Integration (1 hour)", "The expected contents and organization of a Software Requirements Specification (SRS).", "AI vs non-AI Systems based on what we covered in this course.", "Braek and Haugen, Engineering real-time systems: an object-oriented methodology using SDL, Prentice-Hall, 1993.", "Larman, Applying UML and Patterns, Prentice Hall, 2004.", "Maciaszek, Requirements Analysis and System Design, Addison Wesley, 2001.", "Bray, An Introduction to Requirements Engineering, Addison-Wesley, 2002.", "Nuseibeh and Zave, Software Requirements and Design:", "van Lamsweerde, Requirements Engineering: From System Goals to UML Models to Software Specifications, Wiley, 2009.", "Brooks, The Design of Design, Addison Wesley, 2010.", "Alan Davis, Just Enough Requirements Management: Where Software Development Meets Marketing, Dorset House Publishing, 2005.", "The project can be related to requirements engineering or a more general software engineering topic.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 38, "course_code": "CS 447", "course_name": "CS447 - Software Testing, Quality Assurance, and Maintenance (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Notice of Recording", "04:00PM - 05:20PM", "Weiyi Shang <wshang@uwaterloo.ca>", "Introduces students to systematic testing of software systems.", "ECE 453: View requirements for ECE 453", "Organized testing can help identify problems in software systems, enabling developers to fix these problems.", "And easier-to-test software is better software.", "• You will be able to create and evaluate test suites for reasonably-sized software systems.", "• You will learn how to effectively test during the software engineering process.", "Creating tests", "Test minimization", "Week 12 March 27th Field testing", "Late policy: every person can have a late (max 24 hours) deliverable once", "Notice of Recording"]}, {"course_id": 39, "course_code": "ECE 124", "course_name": "ECE124 - Digital Circuits and Systems (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Digital Circuits and Systems Winter 2025", "Monday -", "Monday", "08:30AM - 10:20AM", "03:30PM - 04:20PM E7 5343", "Monday -", "Monday", "08:30AM - 10:20AM", "08:30AM - 09:50AM RCH 302", "11:30AM - 12:20PM RCH 302", "Number systems and Boolean arithmetic.", "Boolean algebra and simplification of Boolean functions.", "View requirements for ECE 124", "understand Boolean algebra and manipulate Boolean operations to simplify related functions,", "comprehend logic gates, and design, optimize and implement combinational logic circuits,", "gain knowledge of digital storage elements and finite state machines, and design and analyze synchronous sequential circuits,", "grasp the essential principles of analyzing and designing asynchronous sequential circuits,", "understand common number systems for signed numbers and design basic arithmetic circuits", "Boolean logic and algebra", "Algebraic simplification and applications", "Optimized implementations", "Introduction to sequential circuits", "Design of synchronous sequential circuits", "Asynchronous sequential circuit analysis and design", "Number representations and simple arithmetic circuits", "Number conversion (review & self-study).", "Binary logic and circuits.", "Don’t cares and multiple outputs.", "Flip-flop choices.", "Analysis of ASC.", "Hazards free circuits.", "Number systems (octal and hex).", "Presentations in E2-2364 by lab instructor", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "The time and room number for the tutorial sessions where some of the practice problems will be solved/discussed are", "Tut 101, 102 & 103:   3:30-4:20M in E7-5343", "Labs are integral part of the course and must be completed in a satisfactory manner.", "The weights on these remote exams will remain the same as those stated earlier for the case of in-person (see weight distribution tables under Student Assessment).", "This course includes the independent development and practice of specific skills, such as FPGA design coding with VHDL or Verilog Hardware description languages.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca"]}, {"course_id": 40, "course_code": "ECE 204", "course_name": "ECE204 - Numerical Methods (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Notice of Recording", "Numerical Methods Winter 2025", "ECE 204", "ECE 204 002", "03:30PM - 04:20PM E7 4043", "02:30PM - 03:20PM", "E7 4043", "03:30PM - 04:20PM E7 4043", "ECE 204 001", "08:30AM - 09:20AM E7 4043", "10:30AM - 11:20AM E7 4043", "09:30AM - 10:20AM E7 4043", "ECE 204:", "Application of computational methods to engineering problems.", "Number systems, errors and error propagation.", "Introduction to numerical linear algebra.", "Interpolation and numerical integration.", "Introduction to numerical solutions of ordinary differential equations, optimization.", "View requirements for ECE 204", "As an overview, this course will introduce the application of computational methods for modeling and simulating real-world physical systems.", "By comprehending the limitations of such arithmetic, we can develop computational methods that enable us to mitigate these effects allowing us to, in turn, to attain sufficiently accurate approximations or simulations within a practical timeframe.", "To describe, examine, design and develop tools that can be used to approximate solutions to both linear and nonlinear algebraic equations and systems of such equations.", "To describe, examine, design and develop tools that can be used to approximate solutions to analytic equations (initial- and boundary-value problems) and systems of such equations.", "Also, the Department of Electrical and Computer Engineering cancels classes during mid-term week and, instead, offers make-up lectures.", "2 Representation of real numbers", "3 Tools for finding numerical algorithms", "3.2 Iteration and fixed-point iteration", "3.3 Linear algebra", "3.4 Interpolation", "3.6 Bracketing", "3.7 Intermediate-value theorem", "3.8 Summary of tools and looking ahead", "5 Introduction to approximating the value of expressions", "5.1 Evaluating a polynomial at a point and Horner's rule", "5.2.1 Approximating values using interpolating polynomials", "5.3 Least-squares best-fitting polynomials", "5.3.1 Approximating a point using least-squares best-fitting polynomials", "5.3.2 Approximating the derivative using least-squares best-fitting polynomials", "5.3.3 Approximating an integral using least-squares best-fitting polynomials", "6 Approximating solutions to algebraic equations", "6.1 Approximating the solution to the quadratic equation", "6.2 Approximating solutions to non-linear algebraic equations", "6.2.3 The bracketed secant method", "6.2.4 The secant method", "6.3 Approximating solutions to systems of linear equations", "6.3.1 The Gauss-Seidel method", "6.3.2 The method of successive over-relaxation", "6.4 Approximating solutions to systems of non-linear equations", "6.4.1 Newton's method in n dimensions", "7.1.1 Approximating solutions to initial-value problems (IVPs)", "7.1.1.1 Approximating solutions to first-order IVPs", "7.1.1.1.1 Euler's method", "The 4th-order Runge-Kutta method", "7.1.1.1.4 Error analysis of these methods", "7.1.1.2 Adaptive techniques for 1st-order initial-value problems (IVPs)", "7.1.1.2.1 Adaptive Euler-Heun method", "7.1.1.2.2 Adaptive Dormand-Prince method", "7.1.1.3 Approximating solutions to systems of 1st-order IVPs", "7.1.1.4 Approximating solutions to higher-order IVPs", "7.1.1.5 Approximating solutions to systems of higher-order IVPs", "7.1.2 Approximating solutions to boundary-value problems", "7.1.2.1 The shooting method", "7.1.2.2 The finite-difference method", "7.1.2.3 Neumann and insulated boundary conditions", "7.2 Approximating solutions to partial differential equations", "7.2.1 The heat equation in one dimension", "7.2.2 The wave equation in one dimension", "8 Optimization", "8.1 Optimizing functions of a real variable", "8.1.1 Step-by-step optimization", "8.1.2 Newton's method for finding extrema", "8.1.3 The golden-ratio search", "8.2 Optimizing functions of a vector variable", "8.2.1 Hooke-Jeeves method", "8.2.2 Newton's method for finding extrema in n dimensions", "The University of Waterloo also has a site licence for Matlab., which you may choose to use other than Octave.", "The laboratory sessions are help sessions where you can speak to a teaching assistant.", "MOSS is used to verify that all source code in projects is not plagiarized from peers either from this offering or previous offerings of this course.", "Notice of Recording", "Generative artificial intelligence: This course includes the independent development and practice of specific skills, such as software design and development.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at uWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 43, "course_code": "ECE 224", "course_name": "ECE224 - Embedded Microprocessor Systems (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Embedded Microprocessor Systems Fall 2024", "ECE 224", "ECE 224 001", "Monday, Friday -", "E7 4043", "ECE 224 002", "Monday, Friday -", "08:30AM - 09:50AM E7 4043", "11:30AM - 12:20PM E7 4043", "Rabiul Islam r25islam@uwaterloo.ca", "Emon Sarkar esarkar@uwaterloo.ca", "View requirements for ECE 224", "Course introduction: In this course, you will explore the design of embedded systems and computer interfaces.", "How should data be organized?", "When should data be exchanged?", "What conditions must be satisfied to reliably exchange data?", "Identify system realities (such as noise, jitter, metastability, and transmission line effects) and select suitable approaches for managing these realities in an embedded computer system.", "Compare and critically assess design tradeoffs in an embedded computer system.", "Analyze the effects of synchronization mechanisms on the operational characteristics of an embedded computer system.", "Design hardware and software components to reliably connect devices to an embedded computer system.", "Course Introduction", "An introduction to the teaching team, course expectations, deliverables, marking scheme, and a very brief introduction to interfacing concepts.", "Embedded Systems", "A review of the fundamentals of embedded systems and the terminology associated with embedded systems.", "Interfacing Software, Device Drivers and Synchronization", "A review of embedded software design concepts, followed by a discussion of synchronization concepts and analysis.", "A detailed examination of the design and behavior of drivers for shared and transmission lines, including considerations of signal integrity.", "Buses and Interconnections", "A comparison of the functional behavior and timing behavior of synchronous, asynchronous, partially interlocked asynchronous, semi-synchronous, and split cycle bus systems.", "Arbitration", "A detailed examination of alternatives for interconnection arbitration including both centralized and distributed arbitration techniques.", "Parallel Interfacing", "This includes an examination of the role of the interface in matching bus timing and signaling characteristics with a device's timing and signaling characteristics.", "Serial Interfacing", "This includes a comparison of asynchronous communication techniques and synchronous techniques as well as the protocols for serial communication.", "Error Detection and Correction", "An introduction to error detection and error correction including a discussion of error types, differences in detection and correction, and one example of an error correcting code (the Hamming code).", "Analog Interfacing", "An introduction to digital-to-analog interfacing, analog-to-digital interfacing, and sample-and-hold circuitry.", "This includes a discussion of static and dynamic errors.", "Examples", "You may use these exams to assess your preparation for the exams in the course.", "Assessment Estimated Completion Time Completion Date", "Lab studies: Lab studies are to be completed in groups of two.", "Students then write C software using the Intel Nios II Software Build Tools to control their embedded system to achieve a specified design goal.", "Lab Study 0: This is an introductory lab study that examines the design of a system-on-a-programmable chip (SOPC) design.", "In this lab, students design, build, and test a 32-bit microprocessor system based on the Nios II processor core.", "The hardware design and the board support package serve as a starting point for both Lab Study 1 and Lab Study 2.", "In this lab study, students design a software system that uses pushbuttons, LEDs, 7-segment displays, timers, polling loops, and multiple interrupt handlers to conduct an experiment into servicing a device.", "In this lab study, students design a software system to read a pre-recorded audio file from an SD card, process the audio data, and play it back on a speaker using a DAC.", "Students are given broad latitude to design the system.", "When a lab study builds upon previous submissions, comments such as \"In the previous submission, concerns were expressed related to the number of sample points in the experiment.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm and those who support others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 44, "course_code": "ECE 252", "course_name": "ECE252 - Systems Programming and Concurrency (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Systems Programming and Concurrency Fall 2024", "ECE 252", "ECE 252 001", "Monday, Friday -", "11:30AM -", "E7 4043", "Monday, Friday -", "10:00AM - 11:20AM E7 4043", "M. Cooper-Stachowsky", "11:30AM - 12:20PM E7 4043", "ECE 252 101", "E7 4043", "ECE 252 102", "04:30PM - 05:20PM", "ECE 252 201", "08:30AM - 11:20AM E2 3346", "ECE 252 202", "ECE 252 204", "08:30AM - 11:20AM E2 3346", "Mike Cooper-Stachowsky (Section 2): Mike came to the university of Waterloo in 2014 where he worked in the first year office helping new students transition into university.", "He is particularly interested in operating systems and systems programming, and learned a lot by writing his own kernel for the x86.", "Manavjit Singh Dhindsa -- ms2dhind@uwaterloo.ca", "Sheikh Abrar Tahmid -- sa2tahmi@uwaterloo.ca", "ECE 252:", "Performance and correctness of concurrent systems.", "Deadlock detection and recovery; file systems.", "View requirements for ECE 252", "This course assumes you are comfortable programming in a low level programming language (likely C++ from your Algorithms and Data Structures course).", "Apply standard concurrency scenarios such as producer-consumer, readers-writers, dining philosophers, as well as deadlock and starvation.", "Interact with the Linux operating system through the command-line interface and the C language API.", "Use inter-process communication such as shared memory and message queues.", "Do you need a textbook?", "To request that a question be re-marked, you will need to submit your request in writing via e-mail to the instructor.", "Collaboration and Group Work.", "Please bring this situation to the attention of the course staff as soon as possible so that can be resolved quickly.", "However, each group must submit their own, independently-developed code for each lab.", "Similarly, each person must submit their own, independently-developed code for each assignment.", "I suggest you avoid looking at other people’s code entirely, but if you do, then you should not be doing that anywhere you might be writing your own code.", "The temptation to write your code just like what you see is simply too high.", "However, penalties may be more severe for repeat offenders (see below for information on Academic Integrity).", "All of the above applies to multiple instances — a student caught in several incidents of academic dishonesty will be subject to the above penalties for each of the incidents.", "Laptop and Device Policy: The human visual system has evolved to perceive saber-toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text-mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "Piazza is a great tool for collaboration and it allows rapid but asynchronous exchange of infor mation.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be difficult to interpret on a discussion forum.", "In either case, we will cancel all the in-person lectures and in-class exercises during the relevant period and try to have some online synchronous video lectures during that period.", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, Chat- GPT) and how such tools can be used to write and test code.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 46, "course_code": "ECE 327", "course_name": "ECE327 - Digital Hardware Systems (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Digital Hardware Systems Winter 2025", "ECE 327 / ECE 627", "10:00AM - 11:20AM E7 4053", "11:30AM -", "ECE 327 101", "ECE 327 201", "04:30PM - 05:20PM E7 4053", "04:30PM - 05:20PM", "04:30PM - 05:20PM E7 4053", "Maran Ma: E2-3354A Wednesday 1:30-2:30pm", "Design and modelling of digital hardware systems using a hardware description language.", "Power analysis and optimization.", "View requirements for ECE 327", "ECE 627:", "Introduction to power analysis and optimization.", "Introduction to faults and testing.", "View requirements for ECE 627", "The design and engineering of computing chips is an exciting, and valuable skill that spans multiple engineering disciplines including software engineering, parallel programming, verification and reasoning, compilation techniques, down to physical/analog/electrical effects.", "This course will help open the door to careers in the richly-rewarding chip design industry in a variety of roles such as RTL developers, verification engineers, system-level developers, and future leaders and managers.", "ECE327 will be vital to navigate these exciting times.", "We must think about and understand concurrent operations at a cycle-by-cycle level of abstraction.", "There are commonly used paradigms, and design patterns that we must known when organizing the RTL code.", "We will learn how to break down a complex design into these components, and learn how to reason about correctness, and understand their translation to hardware primitives.", "Most digital design are constrained to fit specific cost targets, and the analysis tools help guide the design process with appropriate feedback.", "These compilation iterations are fundamental to digital design and a good designer knows how to direct the tools, rewrite Verilog code, and generate the desired hardware.", "A class project will be used to tie together all the key design lessons we learn in this course.", "We will be developing a large-language model (LLM) solution involving a matrix multiplier as part of the project.", "Describe hardware components at the RTL-level in Verilog, verify these designs through simulation, and map these design to an FPGA fabric.", "Introduction - Introduction to hardware design, quick look at concurrency, debugging, synthesis and entire hardware design flow.", "Reasoning about parallelism in Verilog and drawing timing waveforms/diagrams from the code and vice versa.", "State Machines - Sequential logic design in the form of controllers (or state machines).", "Retiming - Automating pipelining of feed-forward datapaths.", "Strategies and ideas for retiming steps.", "Static Scheduling - Time-shared reuse of hardware resources.", "Construction of static scheduling tables based on resource constraints.", "Design of state machine controllers, and datapaths building blocks.", "Dynamic Scheduling - Dynamic scheduling of resource shared datapaths.", "Timing Analysis - Understanding clock frequency and algorithms for timing analysis.", "Elmore Delay - Simplified high-level model of wire delays.", "Power - Power/energy analysis of hardware components.", "Analytical expressions for power and energy.", "ECE627-only] FPGAs - FPGA Logic, Interconnect, and Architecture, Introduction to reconfigurable hardware/FPGAs, understanding logic design, interconnect and overall composition.", "For relevant labs, the course uses the AMD/Xilinx Pynq FPGA boards available in E2-2356A.", "FPGA board deployment will be done as part of some of the labs, and you will get a chance to rectify errors should this fail.", "Remember, the final exam covers the entire course!", "Precise determination will be done on a case-by-case basis.", "- For any missed graded item, we offer the option of taking a final if you miss it for a legitimate reason as per university guidelines.", "Plagiarism in ECE327 will likely manifest in the form of copying RTL code, scripts, bitstreams as-is or recast with minor modifications.", "We have a MOSS configuration to check code plagiarism and we take this seriously.", "We understand that these circumstances can be troubling, and you may need to speak with someone for emotional support."]}, {"course_id": 47, "course_code": "ECE 350", "course_name": "ECE350 - Real-Time Operating Systems (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Real-Time Operating Systems Winter 2025", "ECE 350", "ECE 350 001", "08:30AM - 09:50AM E7 4053", "11:30AM -", "ECE 350 201", "01:30PM - 04:20PM E2 2356A", "ECE 350 202", "01:30PM - 04:20PM E2 2356A", "01:30PM - 04:20PM E2 2356A", "ECE 350 101", "10:00AM - 11:20AM E7 4053", "About Prof. Zarnett", "8 years industry engineering experience in display & imaging", "Research specialization brain-machine interfacing", "Ahmed Elbaroudy - ammaelba@uwaterloo.ca", "Neeraj Nagar - nnagar@uwaterloo.ca", "Memory and virtual memory and caching; I/O devices, drivers, and permanent storage management; process scheduling; queue management in the kernel; real-time kernel development.", "Aspects of multi-core operating systems.", "View requirements for ECE 350", "Understand the differences between non-real-time and real-time operating system.", "The course notes should be pretty much everything you need for this course.", "I read them so you don’t have to!", "They are neither required nor recommended, but I'll list them here in case you truly wish to look at them.", "Operating Systems Internals and Design Principles (9th Edition).", "Please bring this situation to the attention of the course staff as soon as possible so that can be resolved quickly.", "However, each group must submit their own, independently-developed code for each lab.", "Similarly, each person must submit their own, independently-developed code for each assignment.", "I suggest you avoid looking at other people’s code entirely, but if you do, then you should not be doing that anywhere you might be writing your own code.", "The temptation to write your code just like what you see is simply too high.", "However, penalties may be more severe for repeat offenders (see below for information on Academic Integrity).", "All of the above applies to multiple instances — a student caught in several incidents of academic dishonesty will be subject to the above penalties for each of the incidents.", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, ChatGPT) and how such tools can be used to write and test code.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be diﬃcult to interpret on a discussion forum.", "The human visual system has evolved to perceive saber‐toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text‐mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions."]}, {"course_id": 49, "course_code": "ECE 356", "course_name": "ECE356 - Database Systems (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Notice of Recording", "Database Systems Fall 2024", "ECE 356", "ECE 356 001", "11:30AM -", "08:30AM - 09:50AM E7 4417", "Data models, file systems, database system architectures, query languages, integrity and security, database design.", "View requirements for ECE 356", "Relational databases empower the vast majority of dynamic websites as well as a variety of information management systems in private and public sector organizations.", "ECE356 explores the concepts and techniques that make such databases convenient, efficient, and reliable.", "The course additionally includes an introduction to data mining and NoSQL.", "model data using entity-relationship (ER) diagrams", "understand the relational model and design a relational schema for a data set", "execute SQL commands against a remote database using Java Database Connectivity (JDBC)", "identify integrity constraints and functional dependencies in data", "apply the theory of database normalization to optimize the design of a relational schema", "understand the basics of transaction execution, concurrency control, and recovery in databases", "understand SQL injection attacks, as well as password hashing and salting", "perform simple data mining and analytics operations on real data sets", "design a denormalized schema for a NoSQL database", "September 4-10 intro, relational model SSH, mysql command line tool     first week of classes", "September 11-17 relational algebra, SQL relational algebra", "October 2-8 normalization normal forms and normalization", "Exams", "A make-up final exam, if offered by the instructor, may be scheduled in a future academic term.", "The instructor will not offer a make-up midterm, and will instead consider shifting the weight of a missed midterm towards the final exam.", "Members of the teaching team may also evaluate students' proficiency in the use of software in connection with lab work.", "If a student's solution differs substantially from the solution recognized by the teaching team, the student may be asked to provide sample inputs and outputs to evaluate the correctness of their solution.", "Collaboration", "Exams may cover both theory and practice, including your ability to read and write SQL code.", "Notice of Recording"]}, {"course_id": 51, "course_code": "ECE 406", "course_name": "ECE406 - Algorithm Design and Analysis (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Notice of Recording", "Algorithm Design and Analysis Winter 2025", "ECE 406", "ECE 406 001", "11:30AM -", "E. Creager", "04:00PM - 05:20PM", "E. Creager", "04:00PM - 05:20PM", "• Rushabh Solanki", "ECE 406:", "Design and analysis of efficient, correct algorithms.", "Advanced data structures, divide-and-conquer algorithms, recurrences, greedy algorithms, dynamic programming, graph algorithms, search and backtrack, inherently hard and unsolvable problems, approximation and randomized algorithms, and amortized analysis.", "View requirements for ECE 406", "How to design efficient algorithms using divide and conquer, greedy algorithms, and dynamic programming.", "The kinds of problems that can be solved with linear programming, and why they can be solved efficiently.", "What it means to reduce one problem to another, and how it used in complexity analysis", "Introduction to algorithms Chapter 0 0.5 hours", "Divide and conquer algorithms Chapter 2 5 hours", "Graphs, decompositions and depth-first search Chapter 3 3 hours", "Linear Programming: Simplex algorithm, duality theorem Chapter 7 4 hours", "No lectures during ECE midterms week (Feb 24--28)", "LEC001] Tue 2:30--3:30pm in E7-5353", "Assignments Information and Guidelines: Assignments are given roughly every other week, and their primary goal is to give you practice in designing and analyzing algorithms.", "You must list these collaborators at the top of the first page of your assignment (there is no penalty for listing collaborators, but it ensures we do not falsely identify plagiarism).", "In submitting an assignment, you are “signing off on your work” as described in the academic integrity form at https://uwaterloo.ca/academic-integrity/. The penalty for a first plagiarism offence is -100% for the assignment.", "* Each student must turn in a signed academic integrity form to confirm their understanding of the above policies.", "Notice of Recording"]}, {"course_id": 52, "course_code": "ECE 409", "course_name": "ECE409 - Cryptography and System Security (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Cryptography and System Security Winter 2025", "04:00PM - 05:20PM", "08:30AM - 09:50AM E7 5353", "Introduction to cryptology and computer security, theory of secure communications, points of attack, conventional cryptographic systems, public key cryptographic systems, standards, firewalls, wireless system security, applications.", "View requirements for ECE 409", "This course will provide introduction to  cryptography and system security.", "It covers  basic concepts in cryptography and system security,   types of attacks, trust and threat models,  pseudorandomness, computational security,  symmetric-key  cryptography,  public-key cryptography,   attacks on cryptographic operations,   network security protocols,   wireless system security and privacy,  applications in IoT systems,   special topics on  privacy preserving  AI,   quantum key  distribution and post-quantum cryptography.", "Explain the principles of cryptography and system security.", "Explain how practical schemes of symmetric-key cryptography and public-key cryptography are designed and implemented.", "Analyze the security and privacy protections in wireless systems and their applications in IoT.", "Apply security principles to solve problems in concrete applications.", "Introduction  to Cryptography  and System Security", "Cryptography and cryptanalysis", "Basic protections: encryption and authentication", "Classification of cryptosystems", "Basic  concepts of secure systems.", "Types of attacks,  trust and threat model", "Computational security and one-way functions", "Chapter 3. Symmetric-key Cryptographic Systems", "Arithmetics of binary finite fields", "Secure hash functions: SHA1, SHA2 and SHA3", "MAC and forgery attack", "Time-memory trade-off attacks and attacks by AI", "Public-key Cryptographic Systems", "Arithmetic operations", "Security of public-key cryptography (factorization, DL, LWE)", "Practical public-key systems (DH, RSA, DSA, ECC)", "Fault side-channel attacks", "Network Security Protocols", "Implementing secure systems:  PKI  and  X.509 certificates", "Hop-by-hop versus end-to-end protections and VPN", "Chapter 6. Wireless System Security", "5G security architecture for IoT security and privacy", "Privacy preserving machine learning: secret sharing; securing federate learning", "Basic concepts for quantum cryptography", "Quantum key distribution", "Post-quantum cryptography", "Communication System Security L.L. Chen and G. Gong", "R. Anderson, Security Engineering A Guide to Building Dependable Distributed Systems, Wiley, 2014 (Anderson14).", "Schneier on Security, http://www.schneier.com/blog/. A blog covering current computer security and privacy issues.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 55, "course_code": "ECE 451", "course_name": "ECE451 - Software Requirements Specification and Analysis (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Software Requirements Specification and Analysis Winter 2025", "10:00AM - 11:20AM MC 2035", "Email:x784chen@uwaterloo.ca", "Email: ar2elsha@uwaterloo.ca", "Email: d3pang@uwaterloo.ca", "Models, notations, and processes for software requirements identification, representation, analysis, and validation.", "ECE 451: View requirements for ECE 451", "The week of", "Deliverables", "1 Introduction", "3 RE Reference Model", "Jan 13 4 Domain Model 4 Domain Model D0 – Group members & Project idea", "Jan 27 7 Functional Modelling 8 OCL D1 – Domain Model & Stakeholders", "Feb 10 10 Quality Requirements 10 Quality Requirements D2 -  Use case Diagram & Description", "Feb 24 11 Requirements Conflict management 12 Prioritizing Requirements D3 – Functional Model & OCL", "Mar 3 13 Cost Estimation 14 Risk Analysis D4 – State Diagram", "Mar 17 15 Temporal Logic 16 Validation and Verification D5 – Cost Estimation & Risk Analysis", "Mar 31 17 Software Project Management 18 Requirement Engineering for AI Systems D6 - Quality Attributes and Temporal Logic", "Ability to separate requirements from specifications from domain assumptions and argue that a specification + domain assumptions satisfy requirements", "Ability to model requirements in a variety of modelling paradigms", "Ability to elicit and document non-functional requirements such that the to-be-developed software can be objectively tested for their satisfaction", "Ability to use tools to manage a Software Development Team.", "Why is requirements analysis complex?", "Functions as a modelling notation.  Pre- and post-conditions.", "Use-case diagrams.", "Functions over a class diagram.", "Modelling dynamic behaviour of a software system.", "UML State Machines.", "Specification patterns.", "7: Model Integration (1 hour)", "The expected contents and organization of a Software Requirements Specification (SRS).", "AI vs non-AI Systems based on what we covered in this course.", "Braek and Haugen, Engineering real-time systems: an object-oriented methodology using SDL, Prentice-Hall, 1993.", "Larman, Applying UML and Patterns, Prentice Hall, 2004.", "Maciaszek, Requirements Analysis and System Design, Addison Wesley, 2001.", "Bray, An Introduction to Requirements Engineering, Addison-Wesley, 2002.", "Nuseibeh and Zave, Software Requirements and Design:", "van Lamsweerde, Requirements Engineering: From System Goals to UML Models to Software Specifications, Wiley, 2009.", "Brooks, The Design of Design, Addison Wesley, 2010.", "Alan Davis, Just Enough Requirements Management: Where Software Development Meets Marketing, Dorset House Publishing, 2005.", "The project can be related to requirements engineering or a more general software engineering topic.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 60, "course_code": "ECE 457A", "course_name": "ECE457A - Co-operative and Adaptive Algorithms (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Co-operative and Adaptive Algorithms Fall 2024", "ECE 457A", "E7 3343", "• Huda Diab Abdulgalil: Email hdiababd@uwaterloo.ca", "The course starts by addressing the ill-structured problems and need for computational intelligence methods.", "It introduces the concepts of heuristics and their use in conjunction with search methods, solving problems using heuristics and metaheuristics, constraints satisfaction.", "The course also introduces the concepts of co-operation and adaptations and how they are influencing new methods for solving complex problems.", "The course starts by illustrating how the concepts of co-operation and adaptation are manifested in nature and how such models are inspiring new types of solutions methods.", "Topics to be covered include search algorithms, game playing, constraints satisfaction, meta-heuristics, evolutionary computing methods, swarm intelligence, ant-colony algorithms, particle swarm methods, adaptive and learning algorithms and the use of these algorithms in solving continuous and discrete problems that arise in engineering applications.", "View requirements for ECE 457A", "Motivate the need for algorithms that exhibit a degree of intelligence: logical, computational, and biologically inspired.", "Introduce the concepts of cooperation and adaptations and how they are influencing new methods for solving complex problems.", "Illustrate the use of these algorithms in solving continuous and discrete, and machine learning problems", "Introduction: About this course, AI, Adaptation, Cooperation, goals and definitions of artificial intelligence;", "ill-structured problems and need for approximate algorithms, cooperation and adaptation in nature.", "Search: state space problem formulation and representation;", "use of heuristic search methods and meta-heuristic algorithms", "Trajectory Methods: Tabu search", "Engineering use cases", "Engineering use cases", "Mathematical Models of Genetic Algorithms", "Introduction to Swarm Intelligence: cooperation and adaptation methods inspired by nature.", "Engineering use cases", "Engineering use cases", "Evolutionary Programming: Continuous and Discrete EP", "Finite State Machine Optimization", "Evolutionary Strategies", "Self-Adaptive Evolution Strategies", "Introduction to evolutionary computing Introduction to evolutionary computing, by Eiben and A, Smith, J.E, Springer, Berlin, 2003.", "Search and Optimization by Metaheuristics Techniques and Algorithms Inspired by Nature Search and Optimization by Metaheuristics Techniques and Algorithms Inspired by Nature Ke-Lin Du, M. N. S. Swamy No", "Search Algorithms Types: Breadth and Depth First Search Algorithm Search Algorithms Types: Breadth and Depth First Search Algorithm Merium Hazem Anwar Labib Bishara, Merihan Hazem Anwar Labib Bishara No", "**The lecture notes are copy-right protected material.", "Such behaviour includes:", "Adhering to the principles of academic integrity when conducting and reporting research.”"]}, {"course_id": 61, "course_code": "ECE 457B", "course_name": "ECE457B - Fundamentals of Computational Intelligence (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Fundamentals of Computational Intelligence Winter 2025", "ECE 457B", "Monday, Friday -", "10:00AM - 11:20AM E7 5353", "04:00PM - 05:20PM", "Da Saem Lee : ds3lee@uwaterloo.ca", "Communication and Discussion", "If you really have a critical time issue, or you don't want the TA's to see the message (for any reason at all), then you should send Prof. Crowley a direct message on Teams chat in addition to email.", "Model-based prediction and classification.", "Multiple examples and case studies such as autonomous driving, intelligent manufacturing, natural language understanding, speech recognition, computer vision, stock market prediction, disease early detection and diagnosis.", "View requirements for ECE 457B", "It encompasses a broad spectrum of supervised learning topics, including nonparametric and parametric models, linear and nonlinear approaches, deep learning paradigms, and probabilistic models.", "Theoretical knowledge is translated into practice through tutorials on industry-standard tools such as PyTorch and Keras.", "Interactive classroom discussions will pivot around both the practical trade- offs inherent in real-world applications and the theoretical underpinnings that provide an intuitive grasp of the field.", "These topics are an outline, and each year some subset of non-core topics will be skipped due to time constraints and in order to benefit students through deeper focus.", "Classification I", "Distance based - k-Nearest Neighbours (kNN)", "Fundamentals of Parameter Estimation and Learning", "MAP Implementation as Classification: Naive Bayes Algorithm", "Dimensionality Reduction and Manifold Learning", "Vector Embeddings : TF-IDF, Word2Vec, BERT", "Kernel Methods and Latent Models", "k-Means Algorithm, DBScan Algorithm", "Anomaly Detection: Classification, Outlier, Density, and Isolation based", "Classification III : Data, Image and Time-series classification using Deep Learning", "Representation Learning II: Auto-encoders and Variational Auto-Encoders", "Attention and Transformer Networks", "Some additional information and links might be here for older courses.", "A visual grading tool for pdfs submissions of tests and assignments, allows limited online test with mark-down text entry and multiple choice questions.", "Some assignments and tests might be made available online for submission using this tool as well.", "Arxiv Tutorials - pdfs will be posted to hypothes.is and others links will be provided to a number of detailed tutorials on some course topics.", "The first half covers many of basics of this course, while the second half focusses on Deep Learning only.", "Exams", "Completing the assignments will require multiple skills:", "familiarity with statistical, probabilistic analysis of data and results", "logical design and clear description of a expeirmental methodology", "programming various algorithms for processing, training and analysis of data to achieve given tasks (programming will be in Python using libraries such as sci-kit learn and tensorflow, pytorch, pandas)", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 62, "course_code": "ECE 457C", "course_name": "ECE457C - Reinforcement Learning (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["04:00PM - 05:20PM E7 4043", "Introduction to reinforcement learning (RL) theory and algorithms for learning decision-making policies in situations with uncertainty and limited information.", "Suggested Background", "The course will use some concepts from ECE 203 and ECE 307 on Bayesian Probability and Statistics, these will be reviewed but familiarity will help significantly.", "All other concepts needed for the course will be introduced directly.", "Identify and Explain the component theoretical concepts of Reinforcement Learning systems.", "Evaluate the performance of a particular RL system on a given domain through proper experimental design, statistical analysis and visualization", "Assess and critique the applicability of general RL concepts and specific RL algorithms to various problem tasks in Data Science, Artificial Intelligence, Planning, Control, and Machine Learning.", "Motivation and Context", "Importance of reasoning and decision making about uncertainty.", "Decision making under uncertainty:", "Theory, Bellman equations", "Value Iteration, Policy Iteration", "Other variants of these", "Value Function Approximation", "supervised training, back-propagation", "Experience replay buffers, mini-batch training and other methods of training and architecture", "Actor-Critic methods", "Decision Transformers", "Other Uses of RL Concepts", "Human Preference Elicitation - especially for Foundation Models and Large Language Models", "Moral Psychology - theories on human moral reasoning rely heavily on RL concept", "Wrap-up and Review", "Dimitrakakis2019", "Once you get through the first half of our course, many of the concepts on this site will be familiar to you.", "Family Tree of Algorithms - Here, a list of algorithms at the cuttingedge of RL as of 1 year ago to so, so it'sa good place to find out more.", "But in a fast growing field, it may be a bit out of date about the latest now. https://spinningup.openai.com/en/latest/spinningup/rl_intro2.html", "Piazza : ECE457C Discussions - TBD", "A visual grading tool for pdfs submissions of tests and assignments, allows limited online test with mark-down text entry and multiple choice questions.", "Some assignments and tests might be made available online for submission using this tool as well.", "Assignment will involve a mixture of short answers, mathematical solutions, programming in python and reporting of results of performance and outcomes of trained RL policies on provided simulated environments.", "Recipe for success:", "University can be a challenging environment and it is normal to need support from time-to-time.", "see these slides on university policy for COVID-19 safety once in-person classes begin again.", "If the student has a medical reason why they cannot wear a mask they should contact the professor electronically and provide proof of this.", "Whena student asks or answersa question it may be difficult for them to be heard while wearing a mask.", "Students can find the Illness Self-declaration form in the  Personal Information section of Quest.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 64, "course_code": "ECE 459", "course_name": "ECE459 - Programming for Performance (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["ECE 459", "Monday, Friday -", "08:30AM - 09:50AM E7 5353", "04:00PM - 05:20PM", "Monday, Friday -", "04:00PM - 05:20PM", "11:30AM -", "07:00PM - 07:50PM E7 5353", "07:00PM - 07:50PM E7 5353", "About Prof. Zarnett", "Then I got the AIF in the mail and decided I didn't want to study Computer Engineering after all.", "I'm an Associate Professor of Electrical and Computer Engineering.", "Some of you will know me as the previous Director of Software Engineering from back when you were in 1A. I studied math/CS yet convinced PEO to license me as a P.Eng.", "My research interests focus on using compiler and static analysis techniques to ensure program correctness.", "The LI is responsible for technical matters related to the assignments: git.uwaterloo.ca, git in general, administering the systems where you need to run your labs.", "And I enjoy engaging in discussions about these fields.", "Thanushon Sivakaran <tsivakar@uwaterloo.ca>", "Profiling computer systems; bottlenecks, Amdahl's law.", "View requirements for ECE 459", "Many modern software systems must process large amounts of data, either in the form of huge data sets or vast numbers of (concurrent) transactions.", "This course introduces students to techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs.", "These techniques will enable you to design and build critical software infrastructure, especially in an age of Big Data.", "While you may have seen some of these ideas in the context of operating systems (ECE350/SE350/CS350/MTE241) and concurrency (ECE252/CS343), this course gives you tools to make code run faster.", "Design and apply techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs.", "We intend to use these slots until we reach the end of the course material.", "The notes cite a number of sources, some of which are useful books.", "Rust familiarization and use of nonblocking I/O;", "Auto‐grading and auto‐feedback systems, including marmoset, may be used for the evaluation of some of your assignments.", "Acceptable collaboration includes discussing ideas and structures with others, as well as helping others debug their code.", "If your code is too close in structure to someone else's code, you are going to have a problem.", "Or, let's sum this up in two short instructions:", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, ChatGPT) and how such tools can be used to write and test code.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be diﬃcult to interpret on a discussion forum.", "The human visual system has evolved to perceive saber‐toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text‐mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 70, "course_code": "MSE 343", "course_name": "MSE343 - Human-Computer Interaction (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Human-Computer Interaction Fall 2024", "10:00AM - 11:20AM QNC 2502", "10:00AM - 11:20AM QNC 2502", "11:30AM - 12:20PM QNC 2502", "This course is designed to provide in-depth exposure to the concepts of human-computer interaction and methods of interactive information system design.", "The course will focus on techniques for building information systems that meet human needs and capabilities by following a system development lifecycle: user requirements analysis, information and interaction design, prototyping and evaluation.", "View requirements for MSE 343", "Explain and justify the benefits and drawbacks of user-centred design", "Describe guidelines and models that can be applied to interface design", "Apply a variety of methods to involve the people who use an application in the design process", "Evaluate the usability of an interface", "Explain and justify the benefits and drawbacks of user-centred design 1 KB c) Demonstrate understanding of engineering fundamentals.", "Describe guidelines and models that can be applied to interface design 1 KB d) Demonstrate understanding of specialized engineering knowledge", "Apply a variety of methods to involve the people who use an application in the design process 4 Des b) Generate and implement solutions to complex open-ended problems", "Evaluate the usability of an interface 4 Des c) Evaluate/test solutions and refine designs to better meet requirements", "Process and Requirements", "Introduction to HCI Chapters 1 & 9", "User-centred design Course Notes", "Gathering Requirements and Task-centred design Chapter 10", "Designing Alternatives + Prototyping", "Interface Types & Graphical screen design Chapter 6", "Evaluate", "Evaluating Interfaces with Users: Qualitative Methods Chapters 13 & 7", "Analytical Evaluation: Heuristic Evaluation & Fitts’ Law Chapter 15", "Social & Emotional Interaction Chapter 4 & 5", "Psychology of everyday things & Cognition Chapter 3 & Notes", "Interaction Design: Beyond human computer interaction, 4th edition.", "You will be working in a team of three to five for all these milestones.", "There will be a set of online and in-person activities taking the place of the lab session in this course.", "You can complete these by simply attending class and participating in the activities; there will be a time limit to submit your materials.", "Up until the date of the final exam, you may submit any submitted material for regrading under the following conditions:", "(Ask them first!)", "Extensions", "No extensions will be given after a submission date.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}]