[{"course_id": 27, "course_code": "MATH 249", "course_name": "MATH249 - Introduction to Combinatorics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics (Advanced Level)", "09:30AM - 10:20AM MC 2017", "For graph theory, while we will focus on the same topics covered in MATH 239 (planarity and bipartite matching), our coverage of those topics will differ substantially in depth and in the techniques that we employ; in particular, we will see striking applications of algebra.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 31, "course_code": "PMATH 340", "course_name": "PMATH340 - Elementary Number Theory (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "09:30AM - 10:20AM MC 4060", "Office hour: Wednesday, 1:00pm - 2:00pm", "Solve linear diophantine equations", "Compute continued fraction expansions of rational numbers", "Convince their friends and family that number theory is excellent", "A Friendly Introduction to Number Theory (by Silverman)", "Scheme 2 - Available if you sit all 3 quizzes and score above 75% in each of them.", "A1 - 24th", "A2 - 7th Feb", "A4 - 14th Mar", "Q1 - 31st", "Q2 - 7th Mar", "There will be no midterms!", "In case of a missed assessment, you should notify your instructor via email within 24 hours of the assessment's completion/due date in order to receive an accommodation.", "Notice of Recording"]}, {"course_id": 32, "course_code": "PMATH 432", "course_name": "PMATH432 - Mathematical Logic (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Mathematical Logic Fall 2024", "Pending approval, I hope to teach a graduate topics course in model theory (PMATH 930) in the Fall of 2025.", "Topics: The completeness and compactness theorems of first order logic.", "Zermelo-Fraenkel set theory and ordinals/cardinals.", "First-order languages and structures, syntactic provability and semantic truth, the soundness and completeness theorems, compactness and its consequences, elementary equivalence, the ZFC axioms of set theory, ordinals, cardinals, computability, and Gödel's incompleteness theorem."]}, {"course_id": 38, "course_code": "PSYCH 101", "course_name": "PSYCH101 - Introductory Psychology (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Email: nhwegenschimmel@uwaterloo.ca", "One challenge of online course work can be the absence of a social network.", "There are two discussion boards set up for you to communicate with your classmates to facilitate your success in the course.", "Please be generous in your participation on these discussion boards, returning occasionally to read and respond to your classmates.", "The goal here is to facilitate communication between students and to reduce redundancies in correspondence, which can be overwhelming in online formats.", "A general survey course designed to provide the student with an understanding of the basic concepts and techniques of modern psychology as a behavioural science.", "Introductory Psychology will introduce students to the fundamental theories, concepts, methods, and issues encountered in the field of psychology.", "In addition to learning the core concepts of the field, this course is also meant to instruct the student in the scientific method (as it is used in the social sciences), to give students insight into themselves and their relationships with others, and to develop skills that will help students be successful in university and beyond.", "Explain and apply the core concepts of psychology.", "This will provide a foundation of knowledge upon which you can build in upper year psychology courses.", "Gain greater insight into yourself, others, and the human condition: Apply core concepts to yourself and others; recognize and value human diversity.", "Module 10: Behaviour in Groups", "Introduction to psychology.", "Introduce Yourself Non-completion -2%", "Extensions for extenuating circumstances may be granted at the discretion of the instructor.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 43, "course_code": "STAT 331", "course_name": "STAT331 - Applied Linear Models (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Applied Linear Models Winter 2025", "08:30AM - 09:50AM MC 4020", "02:30PM - 03:20PM", "RCH 101", "Thursdays from 3:00-4:00pm in M3 3021", "Modelling the relationship between a response variable and several explanatory variables (an output-input system) via regression models.", "Model diagnostics and improvement.", "Algorithms for variable selection.", "Review of basic Normal theory, t, chi-squared, and F distributions.", "Simple linear regression.", "Analysis of variance.", "Multiple linear regression, variable selection techniques, indicator variables, diagnostics.", "Brief introduction to non-linear regression, factorial experimentation.", "Registered students can enroll in the class discussion board through Piazza.", "Search for your question first before posting.", "Do not expect a full solution to your question.", "To help maintain a safe, respectful, and productive community in which we – students and teaching team alike – can take risks in our learning/teaching, tackle challenging concepts, and ultimately grow as learners, we should endeavor to follow these mutual expectations:", "Explain the main concepts of linear regression models.", "Understand the methods of least squares and maximum likelihood estimation for model parameters.", "Interpret the model and its parameters (e.g., regression coefficients) in the context of any application.", "Draw inferences from a fitted model about the parameters of interest and make predictions.", "Apply the previous two outcomes when fitting linear models to real data using R.", "Assess model quality by diagnosing violations in underlying model assumptions (and identify strategies for improvement).", "Evaluate competing fitted models built using various model selection methods (and choose between them).", "Introduction", "The Straight Line Model", "Model formulation and interpretation", "Least squares estimation", "Mean response and residual variance estimation", "Introduction to R/RStudio", "Maximum likelihood estimation", "Estimators and their properties", "Important distributions", "Distributions of estimators", "Confidence intervals", "O - Ch. 2-4", "Straight Line Model in R", "Prediction intervals", "Intervals in R", "Hypothesis testing", "O - Ch. 4-5", "ANOVA and F test", "Model limits", "Data transformations", "O - Ch. 4-6", "O - Ch. 7", "A1 and Q1 Solutions", "Multivariate normal distribution", "The Linear Model", "Examples", "O - Ch. 8-9", "Estimation", "Estimators and their properties", "Distributions of estimators", "O - Ch. 9, 11, 12", "ANOVA and F test", "Significance tests", "General linear hypothesis", "O - Ch. 9, 11, 12", "A2 and Midterm Solutions", "Case Study: South African heart disease", "Nested models", "Additional sum of squares", "O - Ch. 12", "Outliers", "O - Ch. 13-14", "Influence", "O - Ch. 14-15", "A3 and Q2 Solutions", "One-variable-at-a-time selection methods", "Criteria-based selection methods", "O - Ch. 16", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solve exercises from the textbook on your own.", "Introduction to Regression Modeling by Abraham and Ledolter This textbook is an optional reference book (available for free on LEARN).", "R and R-Studio Free software.", "To serve as an opportunity to demonstrate your understanding, application, and integration of the course material, including practical application of the skills/concepts with the statistical software, R.", "Missed Assignment: The time window to complete these assessments are generous and, in general, a sickness lasting a couple of days will not be enough of a reason to ask for alternative accommodations and/or extension.", "Tips for Success", "Students should critically compare their work with available solutions and against the solutions of fellow classmates.", "Notice of Recording", "To help you decide if you should isolate, you can use the provincial self-assessment tool.", "In the scenario where we must transition back online the following contingencies will be used:", "These materials are made available for the personal use of students registered in the current offering of this course.", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical proofs and the fitting, interpretation, and assessment of linear models in real applications.", "Library for research-based assignments"]}, {"course_id": 45, "course_code": "STAT 333", "course_name": "STAT333 - Stochastic Processes 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM DC 1350", "04:00PM - 05:20PM", "Erik Hintz: Fridays, 2:00pm - 3:00pm, in M3-2106", "Requests must be emailed to: sasugradadv@uwaterloo.ca", "Topics cover generating functions, conditional probability distributions and conditional expectation, discrete-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, applications including the random walk, the gambler's ruin problem, and the Galton-Watson branching process, an introduction to counting processes, connections between the exponential distribution and Poisson process, and non-homogeneous and compound Poisson processes.", "use moment generating functions as a tool to determine expected values and identify probability distributions of random variables;", "use the law of total expectation to calculate expected values and probabilities through the principle of conditioning;", "specify a discrete-time Markov chain (DTMC), in terms of its transition probability matrix and initial conditions, and calculate various transition probabilities;", "classify the states of a DTMC;", "define fundamental DTMC concepts including irreducibility, periodicity, and recurrence/transience;", "find limiting/stationary probability distributions for certain DTMCs through the use of the Basic Limit Theorem;", "calculate absorption probabilities and expected absorption times for DTMCs using the principle of conditioning with respect to the first transition;", "Week 11 March 24 - March 28 Chap 4: Exponential Distribution & Poisson Processes Tutorial Assignment 2", "Week 12 March 31 - April 4 Chap 4: Exponential Distribution & Poisson Processes Tutorial Test 3", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solving exercises from the Course Notes on your own.", "Introduction to Probability Models by Sheldon M. Ross (2019)"]}, {"course_id": 9, "course_code": "AFM 321", "course_name": "AFM321 - Personal Financial Planning and Taxation (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Chartered Professional Accountancy", "program_id": 111, "major_id": 3, "major_name": "Mathematics/Chartered Professional Accountancy (Bachelor of Mathematics - Honours)", "topics": ["Personal Financial Planning and Taxation Winter 2025", "AFM 321", "AFM 321 001", "Email: kaishu.wu@uwaterloo.ca", "AFM 321:", "This course integrates financial planning and taxes for individuals.", "It connects elements of planning, saving, spending, and reporting to budgeting and tax implications, as they evolve over an individual's lifetime.", "View requirements for AFM 321", "AFM 321 helps students develop a do-it-yourself (DIY) individual financial planning and tax mindset.", "Students will learn how to prepare and assess a basic financial plan for themselves, centered around the budget, across various life stages.", "Within each area of planning, saving, spending, and reporting, students will develop appreciation of important financial and tax considerations that will set them up for financial success.", "Prepare a financial plan and budget for various life stages using fore core elements (planning, saving, spending, and reporting)", "2. Analyze and recommend a financial plan/budget for various life stages", "3. Integrate tax implications and analysis within your plan/budget and each life stage", "4. Use data and analytical techniques to evaluate comparable investments", "3 individual budget and financial planning assignments 37%", "TopHat knowledge and reflection questions & Module practice problems 13%", "Individually or in groups, students will complete mini-cases requiring them to prepare a budget and all related documentation, including tax implications, related to planning, saving, spending, and reporting.", "Students will write a comprehensive final exam that builds on the previous budget and financial planning assignments and will require them to prepare or analyze a budget/financial plan, related schedules, and consider tax calculations and implications.", "The assignment will require a written report detailing the comparison and conclusions reached, as well as collection and analysis of data and a visualization of certain findings.", "To be awarded a grade for these components, you must enroll in TopHat using your UW username-specific email (no alias UW email address, or non-UW email address).", "GenAI use is not permitted for these problems.", "The instructor is a facilitator of the knowledge and discussion.", "9-10 if you attended classes throughout the term, and participated meaningfully in the discussion several times each week consistently throughout the term.", "Although rare, we will always make corrections for clear inconsistencies in your grade (i.e., specific feedback says you achieved one ranking, but assessment was checked for a lower ranking).", "Submission Times", "Due to the highly structured nature of the study plans and the fact that many SAF courses are offered on a limited basis, students should be aware that a penalty imposed as a result of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 15, "course_code": "AFM 433", "course_name": "AFM433 - Business Strategy (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Chartered Professional Accountancy", "program_id": 111, "major_id": 3, "major_name": "Mathematics/Chartered Professional Accountancy (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "AFM433 Business Strategy Winter 2025", "AFM 433", "AFM 433 001", "AFM 433 002", "02:30PM - 05:20PM", "AFM 433 003", "AFM 433 101", "07:00PM - 08:50PM", "AFM 433:", "Managers contribute to the organization through their analytical and leadership capabilities as well as their technical expertise.", "The course provides a framework for developing and implementing strategy that fits the firm's environment, managerial values, and organization.", "View requirements for AFM 433", "Assess the alignment of an organization’s mission, vision, and values with its business strategy and its organizational accountability system", "Describe an organization’s governance structure and the specific roles of the board in strategic management", "Strengthen thinking and problem-solving skills by learning when, why, and how to apply strategy analysis concepts/tools and design thinking skills", "AFM433 Voice over PPT online lectures available on LEARN to be lsitened to in advance each week according to the detailed course schedule Yes free", "You will submit a one page writeup for five of these cases to count towards your individual case submission grade.", "Details will be provided on LEARN for the requirements for the submissions, but in general they will be one page in length and will be graded on a full credit or half-credit basis.", "Teams", "All members of a team normally receive the team’s grade for each component of the team assignments because strategy development and implementation are team efforts, not an individual activity.", "Your team will pick a company of interest and present a 10-minute overview of the company’s strategy and an assessment of their competitive advantage.", "Details of the assignment and criteria for choosing the company are posted in a separate document on LEARN.", "Your teams will be given a specific timeslot for your presentation closer to the date.", "The Midterm Exam is a case exam.", "You are expected to select and apply appropriate analytical models and communication skills to address the case role and requirement.", "The Final Exam is a 2.5-hour in person case exam and will cover all 11 modules of the course.", "Both the midterm and the final exam will require you to have a working laptop to complete.", "A separate Instruction sheet will be issued prior to the exam providing further details.", "A written request must be submitted that indicates your reasons for believing that the case solution was improperly graded.", "Notice of Recording", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 28, "course_code": "STAT 371", "course_name": "STAT371 - Applied Linear Models and Process Improvement for Business (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Chartered Professional Accountancy", "program_id": 111, "major_id": 3, "major_name": "Mathematics/Chartered Professional Accountancy (Bachelor of Mathematics - Honours)", "topics": ["Applied Linear Models and Process Improvement for Business Winter 2025", "08:30AM - 09:50AM RCH 307", "Practical and theoretical aspects of simple and multiple linear regression models.", "Strategies for variation reduction such as control charting.", "Applications to problems in business.", "View requirements for STAT 371", "Develop appropriate and meaningful linear regression models to fit to data from business, finance, and other fields for the purpose of answering relevant questions about relationships between the response and explanatory variables in a population or process of interest.", "Use the programming language, R, to fit regression models and to explore course concepts.", "Interpret regression results from R output, draw conclusions from these results in the context of the study, and effectively communicate these results and conclusions to disparate audiences and interest groups.", "Use graphical and numerical analyses to determine whether the fitted model is appropriate with respect to its underlying model assumptions.", "Employ model selection methods and model improvement techniques to improve the fit of the model.", "Explain the mathematical theory behind the results and output from a regression analysis, including the derivation of the distributions of model parameter estimators.", "To understand and apply the statistical concepts, theory and techniques necessary to monitor and assess process performance.", "Simple linear regression review:", "Graphical and numerical summaries of bivariate data", "The simple linear regression model", "Assumptions of the normal model", "Least squares estimation of β0 and β1", "Least squares estimation of σ2", "Interpretation of parameter estimates", "Distribution of", "Confidence intervals and hypothesis tests for β1", "Multiple linear regression:", "The normal model", "Least squares estimation of β", "The hat matrix", "Least squares estimation of σ2", "Distribution of", "Confidence intervals and hypothesis tests for β", "Confidence intervals for µnew and prediction intervals for Ynew", "Modelling categorical variables", "Inference for model parameters", "Analysis of Variance (ANOVA)", "Introduction", "ANOVA table and the F-test", "Additional sum of squares", "Analysis of Variance (ANOVA) (cont'd)", "Indicator variates and additional sum of squares", "General linear hypothesis", "Model Assumptions", "Addressing model inadequacies", "Distribution of residual vector, e", "Leverage and influential observations", "Model selection", "Sequential methods of model selection", "Interaction", "Waterloo Faculty Salary case study", "Fitting linear models to time series data", "Introduction", "Modelling seasonal and trend components", "Mar. 24 - 28", "Introduction to Process Performance", "Introduction", "Control charts", "Average run length", "3-sigma control limits and other signals of process instability", "Control charts for count data", "CUSUM and EWMA control charts", "Housing bubble article example", "Introduction to Regression Modelling, by B. Abraham and J. Ledolter (Brooks/Cole pub.)", "compassionate grounds", "Answers to questions requiring verbal explanations must be in your own words.", "Please be sure to read the posted Assignment Information and Guidelines document for important assignment and submission information (in particular, be sure you understand the 72-hour grace period policy for each assignment).", "In-person concept quizzes will be replaced with online quizzes", "Instructor INC Policy for STAT 371: In the case of a missed final exam with supporting documentation, an INC grade will only be awarded if both the following conditions are satisfied:"]}, {"course_id": 37, "course_code": "CS 135", "course_name": "CS135 - Designing Functional Programs (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Chartered Professional Accountancy", "program_id": 111, "major_id": 3, "major_name": "Mathematics/Chartered Professional Accountancy (Bachelor of Mathematics - Honours)", "topics": ["Designing Functional Programs Winter 2025", "Monday -", "Monday", "07:00PM - 08:50PM", "08:30AM - 09:20AM", "10:30AM - 11:20AM MC 2034", "Charlie Clarke", "Email: claclark@uwaterloo.ca", "Karen Anderson", "Email: kaanders@uwaterloo.ca", "Email: dbwolff@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "Sara Nayar", "Email: cs135@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "Email: cs135@uwaterloo.ca", "CS135 Problem-solving FAQ", "Assignment Marking Error: Submit a re-mark request, due within one week of release of marks.", "Read Me First", "We hope to guide you through a carefully designed curriculum that introduces you to core concepts in computer science.", "In a typical week, you will move through the following activities:", "You should get a feel for what information is where so you can find it quickly in the future.", "An introduction to the fundamentals of computer science through the application of elementary programming patterns in the functional style of programming.", "Syntax and semantics of a functional programming language.", "Linear and nonlinear data structures.", "Abstraction and encapsulation.", "CS 135 Designing Functional Programs", "CS 135 is for students who would prefer a more conceptual treatment of introductory computer science in a simple language that is educationally effective but not commercially relevant.", "Hardware and Software", "Student labs are equipped with the DrRacket integrated development environment running on networked personal computers.", "References", "How To Design Programs by Felleisen, Findler, Flatt, and Krishnamurthi, MIT Press, 2003.", "Definition of lists, designing functions to process and produce lists, recursive definition of natural numbers, recursive data definitions.", "Non-Linear Structures (6 hours)", "Multi-clausal recursive data definitions, trees, mutually referential data definitions, design methods for complex data, iterative refinement, multiplexing.", "Early development of electronic computers and programming languages.", "History of concepts covered in this course.", "have understanding and experience with the topics in the course outline above", "Drop deadline 25", "Reading Week Starts", "Slides Description", "L01 Values and expressions Prefix notation, exact numbers, Boolean expressions, constants", "L04 Lists List values and expressions, composite data, data definitions", "iClicker pilot", "2024-08-26: CS135 is participating in a pilot comparison of iClicker and Vevox.", "The iClicker subscription should be free.", "iClicker Account", "Racket and DrRacket", "It is also simple and clean enough that we cover computer science content many CS students do not see until later in their CS careers.", "If you submit code written under some other system and it does not work in our currently-supported version of DrRacket, then we consider that code incorrect even if it works for you at home.", "Your work in CS135 will be assessed in a variety of ways.", "Coverage", "Using such off-limits material generally results in a significant loss of marks.", "In general, the basic tests will try to warn you if inappropriate functions and special forms are used.", "Submitting a partially completed solution is a good idea, just in case you don’t get back to it before the due date and to serve as a backup in case your computer breaks or is stolen.", "Email Karen Anderson .", "Email the ISAs and ask them to “mark it for feedback”.", "Testing", "We do several kinds of testing on your submissions:", "Basic tests", "Each time you submit before the due date, we run a set of “basic tests” on your submission.", "It’s amazing how many fatal errors can appear during last-minute tidying up!", "Do not make your last submission immediately before the deadline – it gives you no time to check the Basic Test results and respond, if needed.", "The numeric mark appearing on the basic test marksheet is only for guidance.", "After the submission deadline we run a second set of tests to assess your code, including:", "These post-deadline tests and hand-marking form your mark for the assignment.", "If you procrastinate long enough, this rule can easily cause you to fail the course.", "We won’t rehash the above policies, but we do want to make them concrete for CS135.", "A specific assignment may give exceptions to the above.", "You are welcome to use these tools to help you understand the course material, but you should not:", "cut-and-paste your assignment code into them for debugging assistance.", "Also, these tools will not be available when you write the exam, so you need to understand how to solve these problems yourself in order to pass the course.", "attempting to run malicious code during the submission or marking process."]}, {"course_id": 39, "course_code": "CS 116", "course_name": "CS116 - Introduction to Computer Science 2 (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Chartered Professional Accountancy", "program_id": 111, "major_id": 3, "major_name": "Mathematics/Chartered Professional Accountancy (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computer Science 2 Winter 2025", "Monday -", "Monday", "07:00PM - 08:50PM", "E. Dupont", "E. Dupont", "E. Dupont", "10:00AM - 11:20AM MC 4045", "02:30PM - 03:20PM", "08:30AM - 09:20AM", "09:30AM - 10:20AM MC 4042", "10:30AM - 11:20AM MC 4060", "11:30AM - 12:20PM MC 4060", "02:30PM - 03:20PM", "This course builds on the techniques and patterns learned in CS115 while making the transition to use of an imperative language.", "Use higher-order functions to improve the readability and efficiency of programs", "Describe the basic memory model for mutation of basic types, lists, and objects in Python", "Distinguish between constant, linear, quadratic, and exponential running times of algorithms", "Write useful Python programs using console and file input and output for practical tasks", "All times are given in Eastern Time.", "Important!", "In order to maintain a level of success in the course, students should not miss the completion of any modules.", "Students should check their basic tests email to ensure that the code meets the specification exactly.", "Please make sure you do this often!", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 41, "course_code": "CS 146", "course_name": "CS146 - Elementary Algorithm Design and Data Abstraction (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Chartered Professional Accountancy", "program_id": 111, "major_id": 3, "major_name": "Mathematics/Chartered Professional Accountancy (Bachelor of Mathematics - Honours)", "topics": ["Elementary Algorithm Design and Data Abstraction (Advanced Level)", "Monday -", "Monday", "07:00PM - 08:50PM", "02:30PM - 03:20PM", "Brad In-person MC 6427", "On-line Consulting Hours: Microsoft Teams", "CS 146: Elementary Algorithm Design and Data Abstraction (advanced version)", "To familiarize students with key concepts in introductory computer science from an imperative perspective and to contrast this with the functional perspective taken in CS 145;", "To allow students to complete the CS portion of their Math core requirements and, if desired, to continue on to second-year core courses in CS;", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "Introduction to C and elementary mutation in Scheme", "The memory model.", "Variable declaration, assignment and infix expressions in C. Basic I/O in C. Compilation.", "Algorithm analysis in C. File I/O in C and Scheme.", "Program organization and testing methods.", "Space analysis in C and Scheme.", "Mutable lists, queues, deques, and trees in C. Time-space tradeoffs among mutable and immutable ADT implementations.", "Low-level abstractions", "Pointer arithmetic in C. Arrays in C and vectors in Scheme.", "Strings in C. Elementary hashing.", "Libraries in C and Scheme.", "Implementing high-level abstractions", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "The provided slides are not a substitute for attendance in any first-year CS course, but in CS 146, there are no slides, and the lecture summaries made available after lecture are an even worse substitute for attendance.", "Lectures will involve the development of ideas summarized very tersely in the handouts, as well as on-the-fly development of code, analyses, and proofs.", "CS145 and CS146 were originally designed as a year-long unit of curriculum, but eventually the individual courses drifted in their own directions.", "1.1 A note on logistics", "1.2 Review of forms of recursion and associated proof techniques", "1.3 In preparation for side effects", "1.4 Output", "1.5 Input", "1.6 First Introduction to C", "1.8 Memoization", "1.9 Mutation in C", "1.11 Boxes in C", "1.12 Advanced mutation", "1.13 Aliasing in C", "1.14 Memory and vectors", "1.15 Vectors in Racket", "1.16 Arrays in C", "1.18 ADTs in C; Amortized Analysis", "2 SIMPL: a simple imperative language", "2.1 Syntax and informal semantics", "2.2 Examples in several languages", "2.3 Formal semantics", "2.5 Proving imperative programs correct", "A primitive imperative language", "3.1 A primitive imperative language", "3.2 The PRIMPL simulator", "3.4 The SIMPL to A-PRIMPL compiler", "3.6 Strings in C", "3.7 Adding functions to SIMPL", "3.8 Adding both arrays and functions to SIMPL", "3.9 Implementing lists in PRIMPL", "4 MMIX: a realistic instruction set", "4.1 A more realistic processor", "4.2 The MMIX architecture", "4.2.1 Branches and Jumps", "4.2.2 Example", "4.2.3 Software Interrupts", "4.2.5 A Problem with Branches and Jumps", "4.4 Towards a SIMPL to MMIX compiler", "5.1 Storing primitive values", "5.3 Managing memory", "5.4 Structural and pointer equality", "5.5 Function application in a Racket interpreter", "5.7 Justifying the cost of Racket primitives", "5.8 Moving towards implementation in an imperative language", "6.2 Zippers", "6.3 A continuation-passing interpreter", "6.6.2 Mark-and-sweep", "6.6.3 Copying garbage collection", "6.7 Heterogeneous Data in C", "6.8 Multidimensional Arrays in C", "6.10 Variable-length Argument Lists", "7.1 Continuation-passing style", "7.2 Exception handling", "7.3 Undelimited continuations", "7.4 Delimited continuations", "7.5 Racket’s implementation of continuations", "In CS 146, we will examine the imperative paradigm, and compare and contrast the way that efficient algorithms and data structures are designed in imperative and functional languages.", "Racket is a laboratory for current research on aspects of functional programming languages, and we will continue to look at interesting topics in this area, perhaps at the cost of some coherency in the flow of material.", "They will not be due each week on the same day, as is common in the other first-year CS courses and the first-year Math courses.", "Assignment questions are the main way to reinforce and deepen your understanding of the concepts and skills discussed in lecture.", "You will submit program files electronically to the Marmoset system , which runs tests on your code and informs you of the results fairly rapidly.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "(Please also note that we may use the trends in a student's submission history to estimate the likelihood of other forms of cheating as well.)", "Library for research-based assignments"]}, {"course_id": 45, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Chartered Professional Accountancy", "program_id": 111, "major_id": 3, "major_name": "Mathematics/Chartered Professional Accountancy (Bachelor of Mathematics - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 46, "course_code": "MATH 138", "course_name": "MATH138 - Calculus 2 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Chartered Professional Accountancy", "program_id": 111, "major_id": 3, "major_name": "Mathematics/Chartered Professional Accountancy (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:20AM", "09:30AM - 10:20AM MC 4059", "10:30AM - 11:20AM MC 4061", "E. Bembenek", "11:30AM - 12:20PM MC 4021", "cpthowel@uwaterloo.ca", "E. Yalcin", "02:30PM - 03:20PM", "08:30AM - 09:20AM QNC 2502", "Introduction to the Riemann integral and approximations.", "Antiderivatives and the fundamental theorem of calculus.", "Applications of the integral.", "Improper integrals.", "Linear and separable differential equations and applications.", "Binomial series, functions defined as power series and Taylor series.", "The goal of this course is to further expand your knowledge of calculus and its applications for one-variable functions.", "First, we will explore areas under curves and the Fundamental Theorem of Calculus, integration techniques, and applications of integration including finding the area between two curves, volumes of solids of revolution, and the average value of a function.", "We will study how to solve separable differential equations and linear differential equations as well as their applications to population growth and Newton's Law of Cooling.", "Write clear and well-organized mathematical solutions and proofs.", "Solve problems in Calculus through logical thinking and careful analysis.", "Set up and evaluate Riemann integrals for simple functions", "Apply various integration techniques including change of variable, integration by parts, trigonometric substitution, and partial fractions.", "Solve separable and first-order linear differential equations.", "Compute the radius and interval of convergence for power series.", "Compute Taylor Polynomials and Taylor series for many elementary functions.", "1: Jan 6 - 10 1.1 - 1.3 Riemann Sums, Definite Integrals, Average Value", "5: Feb 3 - 7 2.1 - 2.2.2, 2.3 Intro to DEs, Direction Fields, Separable and First-Order Linear DEs Quiz 4", "8: Mar 10 - 14 4.1 - 4.3 Intro to Power Series, Differentiation & Integration of Power Series Quiz 7", "FE: Mar 31 - Apr 4 4.8 Big-O Notation Quiz 10", "Notice of Recording", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 47, "course_code": "MATH 148", "course_name": "MATH148 - Calculus 2 (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Chartered Professional Accountancy", "program_id": 111, "major_id": 3, "major_name": "Mathematics/Chartered Professional Accountancy (Bachelor of Mathematics - Honours)", "topics": ["08:30AM - 09:20AM", "Instructor: Michael Brannan", "E-mail: michael.brannan@uwaterloo.ca", "Week of", "3 Jan. 20 Fundamental Theorem of Calculus  A1", "4 Jan. 27 Techniques of Integration  A2", "5 Feb. 3 More Techniques and Improper Integration", "6 Feb. 10 Applications of Integration A3", "8 Mar. 3 Convergence Tests A4", "10 Mar 17 Sequences and Series of Functions A5", "11 Mar. 24 Power Series", "12 Mar. 31 Differential Equations A6", "Principles of Mathematical Analysis."]}, {"course_id": 52, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Chartered Professional Accountancy", "program_id": 111, "major_id": 3, "major_name": "Mathematics/Chartered Professional Accountancy (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 54, "course_code": "STAT 230", "course_name": "STAT230 - Probability (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Chartered Professional Accountancy", "program_id": 111, "major_id": 3, "major_name": "Mathematics/Chartered Professional Accountancy (Bachelor of Mathematics - Honours)", "topics": ["03:30PM - 04:20PM MC 4045", "09:30AM - 10:20AM MC 4045", "02:30PM - 03:20PM", "03:30PM - 04:20PM MC 2017", "08:30AM - 09:20AM", "Pavel Shuldiner; E-mail: pavel.shuldiner@uwaterloo.ca; M3 4108", "Come with well-organized questions to make the best use of your time.", "Requests must be emailed to sasugradadv@uwaterloo.ca", "Joint probability functions, marginal probability functions, and conditional probability functions of two or more discrete random variables and functions of random variables are also discussed.", "Post-requisite:", "Define a probability model and determine probabilities of events using counting techniques.", "Define and use probability mass functions, probability density functions, and cumulative distribution functions to determine probabilities of events.", "Use moment generating functions as a tool to determine expected values.", "This learning consists of taking the time to carefully read the lecture notes on your own, ensuring you understand the concepts and steps demonstrated in the lectures to tackle examples, and then solving the end-of-section problems.", "Definitions of Probability", "Mathematical Probability Models", "1.1", "1.2", "Counting in Uniform Probability Models", "Addition and Multiplication Rules for Counting", "Permutations and Combinations", "Counting in Uniform Probability Models", "Addition and Multiplication Rules for Counting", "Permutations and Combinations", "Addition Rules for Unions of Events", "1.3", "2.1", "2.2", "2.3", "Conditional Probability and Product Rules for Intersections of Events", "Probability Mass Functions, Cumulative Distribution Functions", "Functions of Random Variables", "3.2", "Expectation of a Random Variable", "Expectation of a Function of a Random Variable, Properties of Expectation", "Moment Generating Functions", "3.3", "3.4", "3.5", "Basic Terminology and Techniques", "Joint Probability Mass Functions, Marginal Probability Mass Functions", "3.5", "4.1", "Multinomial Distribution", "Linear Combinations of Random Variables", "4.2", "4.4", "Linear Combinations of Random Variables", "Law of Total Expectation", "4.4", "4.5", "4.6", "Law of Total Expectation", "Cumulative Distribution Function, Probability Density Function", "Functions of Random Variables", "4.6", "Expectation of a Random Variable", "Moments of a Distribution, Moment Generating Functions, Mean, Variance, Standard Deviation", "Exponential Distribution", "Normal Distribution", "Exponential Distribution", "Normal Distribution", "Use of the Normal Distribution in Approximations", "Therefore, you should plan to spend between 3 and 6 hours each week in out-of-class learning.", "This learning consists mainly of ensuring you understand the concepts and steps used in class to solve problems and then solving exercises from the Course Notes on your own.", "A 2.5-hour final cumulative examination will be held during the final exam period in April.", "In the case of extenuating circumstances, you must provide sufficient documentation via e-mail to Divya Lala at divya.lala@uwaterloo.ca as soon as possible to verify your absence's circumstances.", "Re-mark Requests:", "Cancellation of In-Person Classes:", "Intellectual property includes items such as:", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "This course includes the independent development and practice of specific skills for solving real-life problems using introductory probability rules.", "Library for research-based assignments"]}, {"course_id": 56, "course_code": "STAT 231", "course_name": "STAT231 - Statistics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Chartered Professional Accountancy", "program_id": 111, "major_id": 3, "major_name": "Mathematics/Chartered Professional Accountancy (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "03:30PM - 04:20PM DC 1350", "02:30PM - 03:20PM", "11:30AM - 12:20PM MC 1085", "03:30PM - 04:20PM", "10:30AM - 11:20AM EIT 1015", "09:30AM - 10:20AM EIT 1015", "Email: aslynko@uwaterloo.ca", "Email: liqun.diao@uwaterloo.ca", "Email: yangjc@uwaterloo.ca", "Email: henan.xu@uwaterloo.ca", "Funmilayo Adeku", "Email: fadeku@uwaterloo.ca", "This course provides a systematic approach to empirical problem solving which will enable students to critically assess the sampling protocol and conclusions of an empirical study including the possible sources of error in the study and whether evidence of a causal relationship can be reasonably concluded.", "The connection between the attributes of a population and the parameters in the named distributions covered in STAT230 will be emphasized.", "Numerical and graphical techniques for summarizing data and checking the fit of a statistical model will be discussed.", "The method of maximum likelihood will be used to obtain point and interval estimates for the parameters of interest as well as testing hypotheses.", "The interpretation of confidence intervals and p-values will be emphasized.", "The Chi-squared and t distributions will be introduced and used to construct confidence intervals and tests of hypotheses including likelihood ratio tests.", "Contingency tables and Gaussian response models including the two sample Gaussian and simple linear regression will be used as examples.", "Course Information Webpage", "Please do not send these questions via email.", "I expect everyone to be respectful to each other, any posts that do not meet the principles in Policy 33: Ethical Behaviour will be removed.", "Email", "Please send emails from uwaterloo.ca email address and include the session number and student ID number.", "Continuity Plans", "Use numerical and graphical summaries of a data set to describe the characteristics of a variate and to check the fit of a statistical model to the data.", "Use the steps of PPDAC to identify both the objectives and possible sources of error in an empirical study, and to critically evaluate the conclusions.", "Identify the connection between attributes of a population and the parameters in the named distributions (Binomial, Poisson, Multinomial, Exponential, Normal).", "Define and use the likelihood function to obtain point estimates of the unknown parameters in a model particularly for the Binomial, Poisson, Multinomial, Exponential and Gaussian (Normal) models.", "Use a pivotal quantity to construct a confidence interval for a parameter in some specific cases, and interpret the confidence interval.", "Use the likelihood function to construct and conduct a test of hypothesis for an unknown parameter in a model.", "Interpret p-values and describe the connection with confidence intervals.", "Define the properties of the Chi-squared and t distribution.", "Define a Gaussian response model including simple linear regression; determine point and interval estimates and conduct tests of hypotheses for the parameters in a Gaussian model.", "Use a Goodness of Fit test to test the fit of a model, independence in a two-way table and equality of proportions for two or more groups", "Describe the importance of randomization and pairing in experimental design and be able to recognize whether a study design allows the researcher to conclude cause and effect.", "This learning consists of taking the time to carefully read the course notes on your own, making sure you understand the concepts and steps demonstrated in the lectures to tackle examples, and then solving the end-of-chapter problems.", "Monday", "Friday", "Welcome", "1.1 Introduction to Statistical Sciences", "1.3 Numerical Data Summaries", "1.3 Graphical Summaries", "1.4 Probability Distributions and Statistical Models", "1.5 Data Analysis and Statistical Inference", "1.6 Introduction to R and RStudio", "2.1 Choosing a Statistical Model", "2.2 Estimation of Parameters", "2.3 Method of Maximum Likelihood", "2.4 Likelihood Functions for Multinomial Models", "2.5 Invariance Property of MLE", "2.6 Checking the Model", "3.1 Planing and Conducting Empirical Studies", "3.2 Steps of PPDAC", "3.3 Case Study", "4.1 Statistical Models and Estimation", "4.2 Estimators and Sampling Distributions", "4.4 Confidence Intervals and Pivotal Quantities", "4.5 The Chi-Squared and t Distributions", "4.6 Likelihood-Based Confidence Intervals", "4.7 Confidence Intervals for Parameters in the Gaussian model", "4.7 Confidence Intervals for Parameters in the Gaussian model (Continued)", "5.1 Introduction to Hypothesis Testing", "5.2 Test of Hypotheses for Parameters in the Gaussian Model", "Relationship Between Hypothesis Testing and Confidence Intervals", "5.3 Likelihood Ratio Test of Hypothesis - One parameter", "6.1 Gaussian Response Models", "6.2 Simple Linear Regression: Maximum Likelihood and Least Squares Estimates", "Confidence Interval for Parameters in the Model", "6.3 Checking Model Assumptions and Residual Plots", "Randomization, Paring, and Experimental Design", "7.1 Likelihood Ratio Test for the Multinomial Model", "7.2 Goodness of Fit Tests", "This learning consists mostly of making sure you understand the concepts and steps that were introduced and used in class to solve examples and then solving problems from the Course Notes on your own.", "R Statistical Software", "R and the RStudio development environment can be downloaded from here.", "All assessments are proctored, in-person, and closed-book exams.", "A 2.5-hour cumulative final examination will be held during the final exam period (April 9 - 25, 2025).", "If you have a question regarding the marking of an assessment, you should first check the posted solutions on LEARN.", "First and last name", "Session number", "Please be specific and explain your rationale for a remark.", "Notice of Recording", "Short-term absence", "COVID-19-related absence", "No limits on number of submissions per term and only available during the formal lecture period", "In particular:", "Please inform us of these at the start of the course.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 5, "course_code": "AMATH 350", "course_name": "AMATH350 - Differential Equations for Business and Economics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 1, "major_name": "Mathematics/Financial Analysis and Risk Management - Chartered Financial Analyst Specialization (Bachelor of Mathematics - Honours)", "topics": ["Differential Equations for Business and Economics Winter 2025", "11:30AM - 12:20PM MC 4045", "First order ordinary differential equations.", "Applications to continuous compounding and the dynamics of supply and demand.", "Higher order linear ordinary differential equations.", "Systems of linear ordinary differential equations.", "Introduction to linear partial differential equations.", "Ordinary differential equations and their applications", "Systems of linear ordinary differential equations", "Linear partial differential equations and Fourier transform", "Black-Scholes equation and solution", "(Jan 6-10) Introduction to Differential Equations (DEs), Separable Equations, Initial-Value Problems, Applications from Finance", "Dimensional Homogeneity, First-Order Linear Ordinary DEs, Use of Substitutions, Applications from Finance Chapter 2 Posting Assignment 1", "Introduction to Higher-Order Linear Equations: Theoretical Background", "Introduction to Systems of Ordinary Differential Equations, Method of Solution for Homogeneous Systems (Second Order)", "(Mar 3-7) Introduction to Partial Differential Equations, First-order Equations (Partial Integration, Method of Characteristics) Chapter 5", "Second-Order Linear PDEs: Classification, Solution by Partial Integration or Method of Characteristics Chapter 5", "Please submit your assignments early in case of unexpected technical difficulties."]}, {"course_id": 10, "course_code": "STAT 371", "course_name": "STAT371 - Applied Linear Models and Process Improvement for Business (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 1, "major_name": "Mathematics/Financial Analysis and Risk Management - Chartered Financial Analyst Specialization (Bachelor of Mathematics - Honours)", "topics": ["Applied Linear Models and Process Improvement for Business Winter 2025", "08:30AM - 09:50AM RCH 307", "Practical and theoretical aspects of simple and multiple linear regression models.", "Strategies for variation reduction such as control charting.", "Applications to problems in business.", "View requirements for STAT 371", "Develop appropriate and meaningful linear regression models to fit to data from business, finance, and other fields for the purpose of answering relevant questions about relationships between the response and explanatory variables in a population or process of interest.", "Use the programming language, R, to fit regression models and to explore course concepts.", "Interpret regression results from R output, draw conclusions from these results in the context of the study, and effectively communicate these results and conclusions to disparate audiences and interest groups.", "Use graphical and numerical analyses to determine whether the fitted model is appropriate with respect to its underlying model assumptions.", "Employ model selection methods and model improvement techniques to improve the fit of the model.", "Explain the mathematical theory behind the results and output from a regression analysis, including the derivation of the distributions of model parameter estimators.", "To understand and apply the statistical concepts, theory and techniques necessary to monitor and assess process performance.", "Simple linear regression review:", "Graphical and numerical summaries of bivariate data", "The simple linear regression model", "Assumptions of the normal model", "Least squares estimation of β0 and β1", "Least squares estimation of σ2", "Interpretation of parameter estimates", "Distribution of", "Confidence intervals and hypothesis tests for β1", "Multiple linear regression:", "The normal model", "Least squares estimation of β", "The hat matrix", "Least squares estimation of σ2", "Distribution of", "Confidence intervals and hypothesis tests for β", "Confidence intervals for µnew and prediction intervals for Ynew", "Modelling categorical variables", "Inference for model parameters", "Analysis of Variance (ANOVA)", "Introduction", "ANOVA table and the F-test", "Additional sum of squares", "Analysis of Variance (ANOVA) (cont'd)", "Indicator variates and additional sum of squares", "General linear hypothesis", "Model Assumptions", "Addressing model inadequacies", "Distribution of residual vector, e", "Leverage and influential observations", "Model selection", "Sequential methods of model selection", "Interaction", "Waterloo Faculty Salary case study", "Fitting linear models to time series data", "Introduction", "Modelling seasonal and trend components", "Mar. 24 - 28", "Introduction to Process Performance", "Introduction", "Control charts", "Average run length", "3-sigma control limits and other signals of process instability", "Control charts for count data", "CUSUM and EWMA control charts", "Housing bubble article example", "Introduction to Regression Modelling, by B. Abraham and J. Ledolter (Brooks/Cole pub.)", "compassionate grounds", "Answers to questions requiring verbal explanations must be in your own words.", "Please be sure to read the posted Assignment Information and Guidelines document for important assignment and submission information (in particular, be sure you understand the 72-hour grace period policy for each assignment).", "In-person concept quizzes will be replaced with online quizzes", "Instructor INC Policy for STAT 371: In the case of a missed final exam with supporting documentation, an INC grade will only be awarded if both the following conditions are satisfied:"]}, {"course_id": 13, "course_code": "AFM 231", "course_name": "AFM231 - Business Law (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 1, "major_name": "Mathematics/Financial Analysis and Risk Management - Chartered Financial Analyst Specialization (Bachelor of Mathematics - Honours)", "topics": ["07:00PM - 09:50PM", "Students can contact the course instructor via email at rhussein@uwaterloo.ca.", "Particular attention is given to the law relating to contracts and business organizations.", "AFM 231: View requirements for AFM 231", "While the course introduces you to basic concepts in law, it is designed for, and particularly emphasizes topics that will be of specific relevance to you as future business managers, owners, or even practicing professionals.", "This includes understanding the basics of legal risk so you can make more effective business decisions.", "Business managers/owners often must engage in risk management exercises.", "Appreciate the complexity of integrating multiple private law concepts into the analysis of a business situation.", "Utilize a basic framework for legal risk management assessments and generate an inventory of possible legal risk management tools.", "Describe the common as well as contrasting relationship between legal compliance and ethical conduct.", "March 24-28", "Wrap-up", "Accordingly, if students do opt to use an older edition it would be advisable to use an edition that is as close to the 8th edition as possible and consider cross-referencing it to the current edition and noting any differences.", "Completion", "The response demonstrates a clear understanding of the relevant course concepts and effectively applies these concepts to the hypothetical scenario.", "Application to Real-World Example", "The response includes an appropriate real-world example that relates to the course material, illustrating how the concept can be applied outside the context of the hypothetical.", "Students may also include a revised answer based on a similar but different set of hypothetical facts.", "For example, a student may propose one solution based on the given facts but suggest a different solution if the facts were altered.", "Students are expected to demonstrate critical thinking and clearly articulate their reasoning.", "Each quiz covers content that relates to the current course content (the current chapters and occasionally a prior chapter as well if it has not yet been part of a quiz).", "Submission Times", "Reevaluation Request", "Requests for re-evaluation of submitted material can be done via email.", "Also, students should detail what their concern as specifically as possible.", "Artificial Intelligence Tools", "Also, some evaluation elements are structured such that it may be even quicker to do it yourself than to utilize an AI tool and then further edit/revise before submission.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 16, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 1, "major_name": "Mathematics/Financial Analysis and Risk Management - Chartered Financial Analyst Specialization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 20, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 1, "major_name": "Mathematics/Financial Analysis and Risk Management - Chartered Financial Analyst Specialization (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 24, "course_code": "STAT 333", "course_name": "STAT333 - Stochastic Processes 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 1, "major_name": "Mathematics/Financial Analysis and Risk Management - Chartered Financial Analyst Specialization (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM DC 1350", "04:00PM - 05:20PM", "Erik Hintz: Fridays, 2:00pm - 3:00pm, in M3-2106", "Requests must be emailed to: sasugradadv@uwaterloo.ca", "Topics cover generating functions, conditional probability distributions and conditional expectation, discrete-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, applications including the random walk, the gambler's ruin problem, and the Galton-Watson branching process, an introduction to counting processes, connections between the exponential distribution and Poisson process, and non-homogeneous and compound Poisson processes.", "use moment generating functions as a tool to determine expected values and identify probability distributions of random variables;", "use the law of total expectation to calculate expected values and probabilities through the principle of conditioning;", "specify a discrete-time Markov chain (DTMC), in terms of its transition probability matrix and initial conditions, and calculate various transition probabilities;", "classify the states of a DTMC;", "define fundamental DTMC concepts including irreducibility, periodicity, and recurrence/transience;", "find limiting/stationary probability distributions for certain DTMCs through the use of the Basic Limit Theorem;", "calculate absorption probabilities and expected absorption times for DTMCs using the principle of conditioning with respect to the first transition;", "Week 11 March 24 - March 28 Chap 4: Exponential Distribution & Poisson Processes Tutorial Assignment 2", "Week 12 March 31 - April 4 Chap 4: Exponential Distribution & Poisson Processes Tutorial Test 3", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solving exercises from the Course Notes on your own.", "Introduction to Probability Models by Sheldon M. Ross (2019)"]}, {"course_id": 26, "course_code": "COMM 321", "course_name": "COMM321 - Intermediate Accounting for Finance (0.50)", "term_name": "Required Courses", "program_name": "Mathematics/Financial Analysis and Risk Management", "program_id": 112, "major_id": 1, "major_name": "Mathematics/Financial Analysis and Risk Management - Chartered Financial Analyst Specialization (Bachelor of Mathematics - Honours)", "topics": ["Intermediate Accounting for Finance Winter 2025", "COMM 321", "10:00AM - 11:20AM RCH 211", "View requirements for COMM 321", "The objectives of this course are for students to: become more familiar with the structure and content of financial statements, understand the environment in which financial reporting choices are made, know the options available under the current reporting models, develop skills in applying complex accounting standards, and understand how to use accounting information to make informed decisions.", "The course continues the study started in AFM 101 but treats subjects in considerably more depth", "Topics covered include each of the 4 financial statements, most individual items commonly found in a typical set of financial statements, as well as some supplementary information generally contained in the notes to the financial statements.", "This course will emphasize not only accounting knowledge but also skills and attitudes necessary for the success of financial professionals, such as problem-solving skills, communication skills, and professional and ethical conduct.", "Know the North American format of, and be able to prepare any of the four financial statements from a given list of accounts and balances", "Explain the objective of financial reporting, the conceptual framework, warning signs that financial statements might be fraudulent and the agency problem", "Prepare background journal entries for the major balance sheet items and understand reporting issues associated with each", "Calculate basic and diluted earnings per share from a given data set", "Know disclosure requirements for segmented reporting, subsequent events and related party transactions, as well as where to locate typical analyst data requirements in a typical annual report", "Canadian Financial Reporting Environment", "Balance Sheet", "Cash & Accounts Receivable", "Property, Plant & Equipment", "Intangible Assets", "Current Liabilities", "Income Taxes", "17 & 23"]}]