[{"course_id": 100, "course_code": "GEOG 209", "course_name": "GEOG209 - Hydroclimatology (0.50)", "term_name": "List 2", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 10:20AM EV2 2002", "Dr. Richard Petrone                                                                                       Winter 2025", "Lab Co-ordinator:", "TBA", "An introduction to the fundamental processes governing climate and hydrological systems and the links between them.", "It starts with a discussion of basic atmospheric and hydrological processes and traces the flow of energy and water between the earth's surface and the atmosphere.", "This course provides students with a thorough background of the fundamental processes governing the climate and hydrological systems, and the links between them.", "The course first reviews fundamental atmospheric and hydrologic processes, and traces the flow of energy and water between the Earth’s surface and the atmosphere.", "Through the use of group activities students will be given the opportunity to gain experience manipulating real hydrological and meteorological data and instrumentation.", "This course will serve as an introduction to near-surface hydroclimatic processes, their feedbacks and climate change, forming essential background for upper level courses in climate change, hydroclimatology and environmental sciences and studies in general.", "The fundamental knowledge and skills developed in this course will provide students with the basis to appreciate and understand the natural hydrologic and climate systems.", "It also provides the required foundation for advanced courses in climatology and hydrology.", "The objective of this course is to provide students with the background to further their interests in weather and climate, and provide the theoretical foundations for upper level science and management courses.", "To identify the key boundary layer processes that drive the hydroclimate system.", "To identify and evaluate the characteristics of different land-use types and ecosystems that drive their hydroclimatic regimes.", "Introduction to Hydroclimatology", "Evapotranspiration", "Climates of Natural Surfaces and Vegetation Effects", "Floods and Drought", "Ecology – Hydroclimate Linkages – Water and Carbon Exchange", "Landuse Change and Hydroclimatic Effects", "SVAT modelling", "Tutorial rooms and groups will be determined in the first week of lectures.", "Feb. 3              Lab #2 – Streamflow & Climate assignment introduced & Lab #1 handed in", "March 10         Lab #3 – Energy Balance & Evapotranspiration assignment introduced and Lab #2 handed in", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 101, "course_code": "GEOG 305", "course_name": "GEOG305 - Fluvial Geomorphology (0.50)", "term_name": "List 2", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["RCH 211", "Emphasis on concepts related to fluvial processes, river mechanics, the relationship between environmental change and river regime.", "Fluvial geomorphology is the scientific study of river landforms and the processes that create them.", "A working knowledge of fluvial processes has important practical environmental science, watershed management and engineering applications and is relevant to many other fields of environmental enquiry such as environmental engineering, watershed planning, source water protection, forestry, and risk management.", "This course will examine a range of physical and chemical processes that create micro and macro-scale landforms over a range of spatial and temporal scales.", "Implications of these processes for environmental management in the context of environmental change will be considered.", "To understand basic fluvial geomorphic processes and their role in landform development and change", "Why study rivers?", "Sept 16              Landscapes and Rivers", "Inputs, outputs and storage", "Types of systems", "Fluvial system variables", "Spatial and temporal scales", "Concept of equilibrium", "Feedback, thresholds and equilibrium – Southern Rockies case study", "Flow generation and hydrological pathways", "Storm hydrograph and drainage basin response", "Discharge Measurement and Streamflow Analysis", "Floods", "Bankfull discharge", "Flood magnitude and frequency", "Regional flood frequency curves", "Rills and gullying", "Soil erosion models", "Modes of sediment transport in rivers", "Sediment storage and delivery ratio", "Flow in river channels", "Driving and resisting forces", "Channel parameters", "Concept of flow continuity", "Flow, channel and boundary resistance", "Subcritical, critical and supercritical flow", "Boundary layer", "Concept of stream power", "Work, energy and stream power", "Erosion in bedrock channels", "Erosion in alluvial channels", "Sediment supply and transport rates", "Driving variables", "Boundary conditions", "Nature of change", "System response", "https://uwaterloo.kanopy.com/video/return-river-0", "Dec 2                  Impact of climate change on river systems", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 103, "course_code": "GEOG 381", "course_name": "GEOG381 - Advanced Geographic Information Systems (0.50)", "term_name": "List 2", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Advanced Geographic Information Systems Winter 2025", "08:30AM - 10:20AM AL 124", "Email:                     dtrobins@uwaterloo.ca", "Email:                     hayden.lam@uwaterloo.ca", "Students learn theoretical and operational approaches to advanced spatial analysis using geographical information systems.", "Emphasis is placed on the use of automation procedures using models and programming to address a variety of topics that may include but are not limited to digital terrain modeling, suitability analysis, network analysis, and cell-based models.", "Understand the components of multi-criteria analysis and how to operationalize them using spatial data and software or computer code", "Interpret and create methods for automation of spatial data management, manipulation, and analysis", "Recognize and critique ways to analyse results from multiple outcomes (e.g., sensitivity analysis)", "Communicate when statistical and non-statistical techniques can be used to aid human decision-making about location suitability or susceptibility", "The lecture will be used to introduce the theory and concepts behind advanced GIS methods as well as to demonstrate techniques that will aid the completion of lab assignments.", "Feb 13 Visual Scripting and Model Builder", "7  Feb 27 Sensitivity Analysis", "Notice of Recording", "Community of Learners", "A goal for this course is that we shall all contribute to a climate that promotes a Community of Learners.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "This course includes the independent development and practice of specific skills, such as analyzing spatial data, summarizing data for reporting results, or putting together statistical models.", "Library for research-based assignments", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 110, "course_code": "PLAN 478", "course_name": "PLAN478 - Transit Planning and Operations (0.50)", "term_name": "List 2", "program_name": "Civil Engineering", "program_id": 29, "major_id": 2, "major_name": "Civil Engineering (Bachelor of Applied Science - Honours)", "topics": ["Transit Planning and Operations Winter 2025", "08:30AM - 09:50AM RCH 103", "02:30PM - 03:20PM", "The historical evolution of transit in cities; the technological innovations which made transit possible; and transit mode definitions.", "System operational characteristics are defined and quantitative measures of effectiveness are introduced.", "Methods for selecting appropriate transit modes are covered.", "The focus of this course is on the use of quantitative techniques to analyse and solve problems arising in the planning, design, operation and management of urban public transportation systems.", "Topics include an introduction to public transportation modes, transit performance analysis, fleet sizing and route design; control of transit operations, and paratransit planning, scheduling and dispatching.", "The course also covers various transit modelling issues arising in the Advanced Public Transportation Systems that aim at maximising transit system efficiency and reliability using emerging technologies such as global positioning systems (GPS), electronic fare payment, and automatic passenger counters and pre-trip/en-route passenger information systems.", "The historical evolution of transit in cities; the technological innovations which made transit possible; and transit mode definitions.", "System operational characteristics are defined and quantitative measures of effectiveness are introduced.", "Methods for selecting appropriate transit modes are covered.*eligible for MES", "Classify urban transportation modes by right of way, technology, and service types", "Compute and graph quantitative relationships, including vehicle dynamics and time-space diagrams", "Determine fleet size requirements and schedules for a given route/line or a set of routes/lines", "Understand the range of approaches for estimating transit ridership", "Select the optimal mode for a transportation route based on vehicle characteristics, planning contexts, travel forecasts, and economic factors", "Design a basic transit network with efficient transfers and schedules", "Introduction and History of Public Transit", "Transportation and Transit Planning", "Travel Demand Modeling", "Transit System Characteristics and Performance", "Scheduling", "Network Structures", "Transit System Financing", "The Future of Public Transit", "Submission requirements will be specified for each assignment.", "This course includes the independent development and practice of specific skills, such as evaluating transit data, planning transit routes, and estimating transit ridership.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 0, "course_code": "PHIL 256", "course_name": "PHIL256 - Introduction to Cognitive Science (0.50)", "term_name": "Required Courses", "program_name": "Cognitive Science", "program_id": 34, "major_id": 1, "major_name": "Cognitive Science Minor", "topics": ["Introduction to Cognitive Science Winter 2025", "samuel.johnson@uwaterloo.ca", "Explain key theories and models concerning mind and intelligence", "These include computation (mental representations and processes), the substrates that perform those computations (brains and silicon), the processes that led to those computations (evolution and development), and the broader environment in which those processes are embedded.", "Ingredients III", "Perceptual Intelligence II", "Linguistic Intelligence III", "Conceptual Intelligence I  How we we use processes such as categorization and reasoning to make sense of the world and guide our decisions.", "Conceptual Intelligence III", "Social Intelligence I  Aspects of human intelligence, such as cooperation and culture, that reside in our doing things in groups.", "Social Intelligence II", "Social Intelligence III", "Submission method", "Cross-listed courses", "Intellectual property includes items such as:", "Sona Participation and Research Experience Marks", "Students may complete any combination of these options to earn research experience grades Credits will be permitted to be earned with a maximum of half from online, and the other half (2.0) from In-lab or Remote Access studies (In Lab studies can however go over the limit up to the total of 4.0)", "Participation enables students to learn first-hand about psychology research and related concepts.", "• You can schedule your In-Person studies through SONA as well but please note the time and location", "Educational focus of participation in research", "To maximize the educational benefits of participating in research, students will receive feedback information following their participation in each study detailing the following elements:", "• Provisions to ensure confidentiality of data", "**", "• Identify the psychological concepts in the article and indicate the pages in the textbook that are applicable.", "• Clearly evaluate the application or treatment of those concepts in the article.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 5, "course_code": "ECE 457A", "course_name": "ECE457A - Co-operative and Adaptive Algorithms (0.50)", "term_name": "List 1", "program_name": "Cognitive Science", "program_id": 34, "major_id": 1, "major_name": "Cognitive Science Minor", "topics": ["Co-operative and Adaptive Algorithms Fall 2024", "ECE 457A", "E7 3343", "• Huda Diab Abdulgalil: Email hdiababd@uwaterloo.ca", "The course starts by addressing the ill-structured problems and need for computational intelligence methods.", "It introduces the concepts of heuristics and their use in conjunction with search methods, solving problems using heuristics and metaheuristics, constraints satisfaction.", "The course also introduces the concepts of co-operation and adaptations and how they are influencing new methods for solving complex problems.", "The course starts by illustrating how the concepts of co-operation and adaptation are manifested in nature and how such models are inspiring new types of solutions methods.", "Topics to be covered include search algorithms, game playing, constraints satisfaction, meta-heuristics, evolutionary computing methods, swarm intelligence, ant-colony algorithms, particle swarm methods, adaptive and learning algorithms and the use of these algorithms in solving continuous and discrete problems that arise in engineering applications.", "View requirements for ECE 457A", "Motivate the need for algorithms that exhibit a degree of intelligence: logical, computational, and biologically inspired.", "Introduce the concepts of cooperation and adaptations and how they are influencing new methods for solving complex problems.", "Illustrate the use of these algorithms in solving continuous and discrete, and machine learning problems", "Introduction: About this course, AI, Adaptation, Cooperation, goals and definitions of artificial intelligence;", "ill-structured problems and need for approximate algorithms, cooperation and adaptation in nature.", "Search: state space problem formulation and representation;", "use of heuristic search methods and meta-heuristic algorithms", "Trajectory Methods: Tabu search", "Engineering use cases", "Engineering use cases", "Mathematical Models of Genetic Algorithms", "Introduction to Swarm Intelligence: cooperation and adaptation methods inspired by nature.", "Engineering use cases", "Engineering use cases", "Evolutionary Programming: Continuous and Discrete EP", "Finite State Machine Optimization", "Evolutionary Strategies", "Self-Adaptive Evolution Strategies", "Introduction to evolutionary computing Introduction to evolutionary computing, by Eiben and A, Smith, J.E, Springer, Berlin, 2003.", "Search and Optimization by Metaheuristics Techniques and Algorithms Inspired by Nature Search and Optimization by Metaheuristics Techniques and Algorithms Inspired by Nature Ke-Lin Du, M. N. S. Swamy No", "Search Algorithms Types: Breadth and Depth First Search Algorithm Search Algorithms Types: Breadth and Depth First Search Algorithm Merium Hazem Anwar Labib Bishara, Merihan Hazem Anwar Labib Bishara No", "**The lecture notes are copy-right protected material.", "Such behaviour includes:", "Adhering to the principles of academic integrity when conducting and reporting research.”"]}, {"course_id": 18, "course_code": "CS 349", "course_name": "CS349 - User Interfaces (0.50)", "term_name": "List 2", "program_name": "Cognitive Science", "program_id": 34, "major_id": 1, "major_name": "Cognitive Science Minor", "topics": ["04:00PM - 05:20PM", "Please contact her in regards to any accommodations, including those for illness and short-term absences.", "Bella Chen", "Zitao Wang", "Beginning in the second week, we hold regular weekday office hours in-person and online within the CS 349 team (via Microsoft Teams).", "An introduction to contemporary user interface implementation concepts, including event abstraction, graphical components, layout, feedback, testing, accessibility, and architectures to develop user interfaces.", "Explain architectural and algorithmic details underlying current user interfaces and user interface toolkits.", "Implement user interfaces in a browser using Typescript: (1) using the HTML Canvas; (2) using HTML elements and DOM manipulation, and (3) using a modern UI web development framework", "5 Feb 3 - Feb 7 Dispatch, Layout A1", "11 Mar 24 - Mar 29 Direct Manipulation, Accessibility", "Exams", "Final, in-person tbd tbd", "It has code relating to lectures and a git submodule with the SimpleKit UI toolkit.", "See the README for details for cloning and keeping everything up to date.", "A1-A4 4 x 13% = 52%", "You should conform to the tools and versions specified in the assignment description.", "Out-of-scope Language Features", "Please review policies for Academic Integrity, Using Code from Other Sources, and Using Advanced AI Systems under Course Policies.", "You may use code examples provided in-class (i.e., in the CS349 public repo).", "You may directly use or include portions of these in-class samples in your assignments.", "You may discuss how you accomplished something in general terms with other students, but you may not directly share code.", "Self-Declared Short-term Absence", "There are no extensions beyond the maximum 48-hour late period after the original deadline.", "You can use any code from this term's offering of CS 349 without documenting it as a source.", "This includes starter code for assignments, code shown in lectures, and code from the course code repo.", "Using Advanced AI Systems", "Use of advanced AI systems to generate code (ie.", "Intellectual property includes items such as:", "All source code written by the instructor and provided in lecture, as starter code for an assignment, or in a sample code repository.", "Inclusiveness", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 19, "course_code": "CS 449", "course_name": "CS449 - Human-Computer Interaction (0.50)", "term_name": "List 2", "program_name": "Cognitive Science", "program_id": 34, "major_id": 1, "major_name": "Cognitive Science Minor", "topics": ["Human-Computer Interaction Fall 2024", "11:30AM -", "10:00AM - 11:20AM B2 350", "11:30AM -", "10:00AM - 11:20AM B2 350", "10:00AM - 11:20AM DC 1350", "LEC - Monday 10-11:30am DC 1350", "An introduction to the fundamental theories, methods, and research in the design and evaluation of novel computational artifacts designed to meet real-world human needs.", "Through lectures and design activities, students work in teams of 5 to design a solution for a real-world problem.", "The end result of the team project is a high-fidelity interactive prototype of a mobile application, targeted at solving a particular real-world problem.", "Identify the primary luminaries in Interactive Design and HCI", "Identify your target users", "Design studies to understand your users and their needs within a sociocultural context", "Create user data-driven designs and prototypes of different levels of fidelity", "Design studies to evaluate designs during different stages of the project", "Properly gather and analyze qualitative and quantitative data from semi-structured interviews, paper prototype evaluation, heuristic evaluations and cognitive walkthrough", "Discover a variety of HCI research methodologies", "Add a high-quality design of an interesting product to your design portfolio", "The success of a team project depends critically on each student being a responsible member of the team, i.e., showing up and participating.", "Special consideration can be made for a few exceptions (e.g., academic travel, illnesses and family emergencies).", "Deliverables and Late Penalties", "Intellectual property includes items such as:"]}, {"course_id": 20, "course_code": "CS 479", "course_name": "CS479 - Neural Networks (0.50)", "term_name": "List 2", "program_name": "Cognitive Science", "program_id": 34, "major_id": 1, "major_name": "Cognitive Science Minor", "topics": ["04:00PM - 05:20PM", "04:00PM - 05:20PM", "Mohamed Hibat-Allah", "Xinyu Crystina Zhang", "Andy Zheng", "Junteng Zheng", "Simple neuron models and networks of neurons.", "Advanced topics, including adversarial inputs and biologically plausible learning methods.", "Formulate a neural learning method as gradient-based optimization", "Derive a neural learning method based on energy minimization", "Design neural-network solutions for different learning scenarios", "Identify some commonalities between artificial neural networks and the brain", "-", "Introduction, Neuron Models", "Hodgkin-Huxley", "Leaky Integrate-and-Fire", "-", "Synapses", "Formulation of Learning", "Loss functions", "-", "Error Backpropagation", "-", "Automatic Differentiation", "-", "Overfitting", "Optimization Considerations", "SGD", "Momentum", "-", "Vision", "-", "No classes", "-", "-", "Autoencoders", "Vector Embeddings", "-", "Advanced Autoencoders", "Diffusion Networks", "-", "-", "Population Coding", "Optimal linear decoding", "Transformations", "Dynamics", "-", "Biological backprop", "Instructions will be given for each programming assignment.", "A1 Jan 22 Neuron and synapse models", "A4 Mar 19 Recurrent networks", "The projects will be done in groups of 2 students, and will involve implementing a method from a paper, and reproducing some of its results.", "Continuity of In-Person Course Components", "The assignment procedures will not be affected by a cancellation of in-person classes since they are distributed and submitted online.", "Students will be given a 24-hour period during which the exam must be written.", "What you can do: GenAI can be used as a smart substitute for Google search, e.g., code debugging, finding plotting commands.", "What you can't do: GenAI must not be used to code up the logic of a solution, or part of a solution."]}, {"course_id": 24, "course_code": "ECE 457B", "course_name": "ECE457B - Fundamentals of Computational Intelligence (0.50)", "term_name": "List 2", "program_name": "Cognitive Science", "program_id": 34, "major_id": 1, "major_name": "Cognitive Science Minor", "topics": ["Fundamentals of Computational Intelligence Winter 2025", "ECE 457B", "Monday, Friday -", "10:00AM - 11:20AM E7 5353", "04:00PM - 05:20PM", "Da Saem Lee : ds3lee@uwaterloo.ca", "Communication and Discussion", "If you really have a critical time issue, or you don't want the TA's to see the message (for any reason at all), then you should send Prof. Crowley a direct message on Teams chat in addition to email.", "Model-based prediction and classification.", "Multiple examples and case studies such as autonomous driving, intelligent manufacturing, natural language understanding, speech recognition, computer vision, stock market prediction, disease early detection and diagnosis.", "View requirements for ECE 457B", "It encompasses a broad spectrum of supervised learning topics, including nonparametric and parametric models, linear and nonlinear approaches, deep learning paradigms, and probabilistic models.", "Theoretical knowledge is translated into practice through tutorials on industry-standard tools such as PyTorch and Keras.", "Interactive classroom discussions will pivot around both the practical trade- offs inherent in real-world applications and the theoretical underpinnings that provide an intuitive grasp of the field.", "These topics are an outline, and each year some subset of non-core topics will be skipped due to time constraints and in order to benefit students through deeper focus.", "Classification I", "Distance based - k-Nearest Neighbours (kNN)", "Fundamentals of Parameter Estimation and Learning", "MAP Implementation as Classification: Naive Bayes Algorithm", "Dimensionality Reduction and Manifold Learning", "Vector Embeddings : TF-IDF, Word2Vec, BERT", "Kernel Methods and Latent Models", "k-Means Algorithm, DBScan Algorithm", "Anomaly Detection: Classification, Outlier, Density, and Isolation based", "Classification III : Data, Image and Time-series classification using Deep Learning", "Representation Learning II: Auto-encoders and Variational Auto-Encoders", "Attention and Transformer Networks", "Some additional information and links might be here for older courses.", "A visual grading tool for pdfs submissions of tests and assignments, allows limited online test with mark-down text entry and multiple choice questions.", "Some assignments and tests might be made available online for submission using this tool as well.", "Arxiv Tutorials - pdfs will be posted to hypothes.is and others links will be provided to a number of detailed tutorials on some course topics.", "The first half covers many of basics of this course, while the second half focusses on Deep Learning only.", "Exams", "Completing the assignments will require multiple skills:", "familiarity with statistical, probabilistic analysis of data and results", "logical design and clear description of a expeirmental methodology", "programming various algorithms for processing, training and analysis of data to achieve given tasks (programming will be in Python using libraries such as sci-kit learn and tensorflow, pytorch, pandas)", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 25, "course_code": "ECE 486", "course_name": "ECE486 - Robot Dynamics and Control (0.50)", "term_name": "List 2", "program_name": "Cognitive Science", "program_id": 34, "major_id": 1, "major_name": "Cognitive Science Minor", "topics": ["Robot Dynamics and Control Spring 2024", "ECE 486 / ECE 780", "ECE 486 001", "ECE 486 101", "08:00PM -", "ECE 486 201", "ECE 780 001", "ECE 486:", "Introduction to the study of robotics focusing on the mechanics and control of serial manipulators.", "Topics include rigid body motion, forward and inverse kinematics, differential kinematics, forward and inverse dynamics, trajectory generation, motion planning, and feedback control.", "This course will introduce students to dynamic modeling and control techniques for robotic systems, and expose them to some cutting-edge research.", "Dynamics of manipulators", "Optimization-based robot control", "May 7 Introduction to robot dynamics and control", "May 23 Dynamic model of manipulators 6 [", "CONTROL OF MANIPULATORS", "Jun 27 Control of driftless systems 14", "Jul 4 Control of differentially flat systems 14", "OPTIMIZATION-BASED ROBOT CONTROL", "Jul 18 Invariance and control barrier functions 4 [", "The lecturing deliverable will consist in a 15-minute presentation of a topic not covered in class and independently studied.", "Magnus Egerstedt, Robot Ecology: Constraint-Based Design for Long-Duration Autonomy, Princeton University Press, 2021 No", "ECE 486", "The project will consist of a mobile manipulation task using the DJI RoboMaster EP programmed in", "The code developed to complete the project", "The reports must be formatted using", "The project will consist of the solution to a problem in the student’s research area using the techniques", "– Section II: Novelty and/or impact", "– Section III: How robot dynamics and control techniques play a key role", "– Section V: Metric for success", "– Section I: Introduction", "– Section III: Materials and methods", "The code developed to complete the project"]}, {"course_id": 37, "course_code": "MSE 343", "course_name": "MSE343 - Human-Computer Interaction (0.50)", "term_name": "List 2", "program_name": "Cognitive Science", "program_id": 34, "major_id": 1, "major_name": "Cognitive Science Minor", "topics": ["Human-Computer Interaction Fall 2024", "10:00AM - 11:20AM QNC 2502", "10:00AM - 11:20AM QNC 2502", "11:30AM - 12:20PM QNC 2502", "This course is designed to provide in-depth exposure to the concepts of human-computer interaction and methods of interactive information system design.", "The course will focus on techniques for building information systems that meet human needs and capabilities by following a system development lifecycle: user requirements analysis, information and interaction design, prototyping and evaluation.", "View requirements for MSE 343", "Explain and justify the benefits and drawbacks of user-centred design", "Describe guidelines and models that can be applied to interface design", "Apply a variety of methods to involve the people who use an application in the design process", "Evaluate the usability of an interface", "Explain and justify the benefits and drawbacks of user-centred design 1 KB c) Demonstrate understanding of engineering fundamentals.", "Describe guidelines and models that can be applied to interface design 1 KB d) Demonstrate understanding of specialized engineering knowledge", "Apply a variety of methods to involve the people who use an application in the design process 4 Des b) Generate and implement solutions to complex open-ended problems", "Evaluate the usability of an interface 4 Des c) Evaluate/test solutions and refine designs to better meet requirements", "Process and Requirements", "Introduction to HCI Chapters 1 & 9", "User-centred design Course Notes", "Gathering Requirements and Task-centred design Chapter 10", "Designing Alternatives + Prototyping", "Interface Types & Graphical screen design Chapter 6", "Evaluate", "Evaluating Interfaces with Users: Qualitative Methods Chapters 13 & 7", "Analytical Evaluation: Heuristic Evaluation & Fitts’ Law Chapter 15", "Social & Emotional Interaction Chapter 4 & 5", "Psychology of everyday things & Cognition Chapter 3 & Notes", "Interaction Design: Beyond human computer interaction, 4th edition.", "You will be working in a team of three to five for all these milestones.", "There will be a set of online and in-person activities taking the place of the lab session in this course.", "You can complete these by simply attending class and participating in the activities; there will be a time limit to submit your materials.", "Up until the date of the final exam, you may submit any submitted material for regrading under the following conditions:", "(Ask them first!)", "Extensions", "No extensions will be given after a submission date.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 43, "course_code": "PSYCH 101", "course_name": "PSYCH101 - Introductory Psychology (0.50)", "term_name": "List 2", "program_name": "Cognitive Science", "program_id": 34, "major_id": 1, "major_name": "Cognitive Science Minor", "topics": ["Email: nhwegenschimmel@uwaterloo.ca", "One challenge of online course work can be the absence of a social network.", "There are two discussion boards set up for you to communicate with your classmates to facilitate your success in the course.", "Please be generous in your participation on these discussion boards, returning occasionally to read and respond to your classmates.", "The goal here is to facilitate communication between students and to reduce redundancies in correspondence, which can be overwhelming in online formats.", "A general survey course designed to provide the student with an understanding of the basic concepts and techniques of modern psychology as a behavioural science.", "Introductory Psychology will introduce students to the fundamental theories, concepts, methods, and issues encountered in the field of psychology.", "In addition to learning the core concepts of the field, this course is also meant to instruct the student in the scientific method (as it is used in the social sciences), to give students insight into themselves and their relationships with others, and to develop skills that will help students be successful in university and beyond.", "Explain and apply the core concepts of psychology.", "This will provide a foundation of knowledge upon which you can build in upper year psychology courses.", "Gain greater insight into yourself, others, and the human condition: Apply core concepts to yourself and others; recognize and value human diversity.", "Module 10: Behaviour in Groups", "Introduction to psychology.", "Introduce Yourself Non-completion -2%", "Extensions for extenuating circumstances may be granted at the discretion of the instructor.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 55, "course_code": "SYDE 548", "course_name": "SYDE548 - User Centred Design Methods (0.50)", "term_name": "List 2", "program_name": "Cognitive Science", "program_id": 34, "major_id": 1, "major_name": "Cognitive Science Minor", "topics": ["User Centred Design Methods Winter 2025", "UCD Mentors Pronouns Email Office Extra Help", "This course approaches the design of tasks, tools, products, and systems from a user-centered design perspective.", "Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process.", "Major topics include user research methods for usability and user experience, inspection methods, user testing, applied statistical analysis.", "SYDE 548 (UCD Methods) approaches the design of tasks, tools, products, and systems from a user-centered design perspective.", "Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process.", "Major topics include user research methods for usability and user experience, inspection methods, user testing, and applied statistical analysis.", "SYDE 548 User-Centred Design Methods is a technical elective.", "It builds from earlier SYDE core courses in design (SYDE-BME 161 Introduction to Design, SYDE-BME 162 Human Factors in Design, and SYDE-BME 361 Engineering Design).", "Motivated students willing to become familiar with basic human factors engineering can participate and contribute to course activities.", "Whether you are interested in becoming a UCD specialist, a certified ergonomist, or just want to be a wise designer or consumer, this course will supply you with a range of practical tools (methods).", "Our “In-class” sessions are used as workshops for interactions and hands-on skill development with different UR methods.", "Engineering Graduate Attribute]", "(A) Describe ethical UCD methods used for formal and informal design assessments with human participants.", "(B) Investigate & select appropriate ethical & equitable UCD methods for specific design situations.[2a, 3b, 10b]", "(C) Apply UCD method protocols to instructor-defined design situations.", "(D) Modify UCD method protocols to collect data for a student-defined design project.", "(E) Select and apply appropriate statistical analysis for given UCD data.", "(F) Design ethical UCD test plans for instructor-defined design situations.", "(G) Create User Research Portfolios describing ethical UCD methods, protocols, and lessons learned.", "CEAB Engineering Graduate Attribute", "Knowledge Base for Engineering", "2. Problem Analysis", "Data Analysis Quizzes,", "4. Design", "-", "Impact of Engineering on Society and the Environment", "Ethics & Equity", "Economics & Project Management", "-", "2. Situations of Concern, Design Impacts & Personas Quantifying Usability; Standard UX Questionnaires;", "SUS Scoring (standard and positive versions)", "3. Design Ethnography: UR Safaris & Secondary Research.", "Interviews & Distress Protocols.", "5. Thematic Analysis Methods - Part 1 Thematic Analysis Methods - Part 2", "Formative Design Walkthroughs & Estimating Formative Sample Sizes.", "UR Methods & GenAI Revisited.", "Quantifying the User Experience: Practical statistics for user research.", "An e-copy of the 1st edition can be accessed through UW Library Reserves.", "The User Experience Team of One: A Research and Design Survival Guide. 2nd edition.", "Hanington, B. & Martin, B (2019) Universal Methods of Design (Expanded & Revised): 125 Ways to research complex problems, develop innovative ideas, and design effective solutions.", "An e-copy of the 1st edition can be accessed through UW Library Reserves No", "Design Materials (for workshops, data collection, and analysis).", "The number of students who can access an e-copy at a given time may be limited.", "Since user-centred design and user research skills are valued by industry, it is important that each student submits original work and demonstrates their own value-added UR skills to earn credit for the course.", "Intellectual property includes items such as:"]}, {"course_id": 0, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 2, "course_code": "MATH 239", "course_name": "MATH239 - Introduction to Combinatorics (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics Winter 2025", "11:30AM - 12:20PM MC 4059", "09:30AM - 10:20AM MC 4021", "P. Nelson", "08:30AM - 09:20AM QNC 1502", "S. Pfannerer-Mittas", "10:30AM - 11:20AM MC 4058", "11:30AM - 12:20PM MC 4058", "09:30AM - 10:20AM MC 4042", "02:30PM - 03:20PM", "10:30AM - 11:20AM PHY 150", "04:30PM - 05:20PM", "You should have no reason to contact them directly, but you can find their email addresses through Learn.", "First name Last name", "Guilherme Zeus Dantas E Moura", "Theodore Morrison", "Matthew Kroeker", "Introduction to graph theory: colourings, matchings, connectivity, planarity.", "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.", "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 3, "course_code": "MATH 249", "course_name": "MATH249 - Introduction to Combinatorics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics (Advanced Level)", "09:30AM - 10:20AM MC 2017", "For graph theory, while we will focus on the same topics covered in MATH 239 (planarity and bipartite matching), our coverage of those topics will differ substantially in depth and in the techniques that we employ; in particular, we will see striking applications of algebra.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 32, "course_code": "CO 487", "course_name": "CO487 - Applied Cryptography (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Instructor: Samuel Jaques", "Email: sejaques@uwaterloo.ca", "Timothy Miller", "Nicolas Swanson", "A broad introduction to modern cryptography, highlighting the tools and techniques used to secure internet and messaging applications.", "It is one of the core technologies for securing the emerging information infrastructure.", "This course is a comprehensive introduction to modern cryptography that is aimed primarily at those interested in applications.", "In the area of public-key cryptography, topics will include an overview of specific systems (Diffie–Hellman, RSA, DSA, etc.) and a few advanced protocols.", "The security of these schemes and the use of public-key techniques for generating digital signatures will be described.", "Linear and differential cryptanalysis of ciphers.", "Define the main information security goals of confidentiality, integrity, authentication, and availability", "Explain the intended security properties of each cryptographic primitive and analyze relationships between security properties", "Explain mathematical techniques underlying standardized cryptographic algorithms", "Identify flaws in uses of cryptographic algorithms", "Determine which cryptographic algorithms can be used and combined to build systems with desired functionality and security", "Understand and contextualize the cryptography and security around them in daily life", "0 1 (Jan 6-8) Introduction", "Symmetric Encryption", "3.6 9 Elliptic Curve Cryptography 4 Yes", "4   Applications", "Understanding Cryptography: From Established Symmetric and Asymmetric Ciphers to Post-Quantum Algorithms, 2nd edition, Springer, 2024 Primary reference.", "A1: January 23", "A4: March 20", "This will be clearly indicated for each such question.", "In that case you are required to work independently.", "These questions will test your ability to identify the important concepts introduced in lectures, and your understanding of them.", "In particular:", "Please inform us of these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 33, "course_code": "CS 467", "course_name": "CS467 - Introduction to Quantum Information Processing (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Quantum Information Processing Winter 2024", "Basics of computational complexity; basics of quantum information; quantum phenomena; quantum circuits and universality; relationship between quantum and classical complexity classes; simple quantum algorithms; quantum Fourier transform; Shor factoring algorithm; Grover search algorithm; physical realization of quantum computation; error-correction and fault-tolerance; quantum key distribution.", "This course aims to give a basic foundation in the field of quantum information processing (often just called \"quantum computing\").", "QIP is a multidisciplinary subject and therefore this course will introduce fundamental concepts in theoretical computer science and physics that will enable students to pursue further study in various aspects of QIP.", "Prerequisites: A solid background in basic linear algebra (e.g. a good performance in MATH 235 or MATH 114) is necessary.", "Explain the logical level functioning of quantum computers.", "Describe and analyze several elementary quantum algorithms.", "Introduction to Quantum Mechanics (6 hrs)", "Bloch sphere.", "Introduction to Computation and Computational Complexity (6 hrs)", "Quantum circuits.", "Basic complexity classes.", "Quantum Algorithms (9 hrs)", "Basic algorithms.", "Implementations of quantum information processors.", "An Introduction to Quantum Computing, by Kaye et al.", "Students may assist each other in working through assignment problems, as"]}, {"course_id": 36, "course_code": "CS 466", "course_name": "CS466 - Algorithm Design and Analysis (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Algorithm Design and Analysis Fall 2024", "Monday -", "Monday", "Sepehr Assadi - sassadi@uwaterloo.ca", "MohammadHossein Ebtehaj - mhebtehaj@uwaterloo.ca", "General information", "Mathematical maturity, and a strong background in probability, data structures, and algorithm design.", "I invite you to let me know about what I can stop, start, or continue doing to make sure every one of my students feels valued and can engage actively in our learning community.", "This is an advanced algorithm design and analysis course, aimed at undergraduate students interested in a deep dive in theoretical computer science (TCS), as well as graduate students doing research in TCS.", "Probabilistic analysis: Randomized algorithms, Concentration inequalities, Balls-and-bins", "Linear programming: Basics, Duality, Center-of-gravity algorithm, Rounding", "Multiplicative weight update (MWU): Expert problem, Fast packing/covering linear programs", "Random walks: Connectivity in RL, Perfect matchings in regular bipartite graphs, Sampling", "Dynamic graph algorithms: Connectivity, Approximate matching", "Parallel algorithms: Matching in RNC, Isolation lemma", "design and analyze algorithms for a wide range of canonical problems studied in this course, and even more importantly, for new problems that you may have not encountered directly yet,", "know a wide range of algorithmic and mathematical tools commonly used in design and analysis of algorithms, and", "have a basic familiarity with various algorithmic models of computation studied in TCS.", "Probabilistic Background and Concentration inequalities", "Streaming distinct elements, Limited independence hash functions", "Balls-and-bins experiments: Power of two choices via random graph theory", "MSTs: Basics, Fredman-Tarjan algorithm", "MSTs: Karger-Klein-Tarjan algorithm", "Linear programming (LP): Basics and Applications", "Linear Programming (LP): Duality and Integrality gaps", "Linear Programming (LP): More on Integrality gaps, Dual fitting for set cover", "Linear Programming (LP): Primal-dual for bipartite matching", "Online matching with a primal-dual analysis", "Graph sketches: Connectivity and L0-samplers", "Random walks: fundamental theorem of Markov chains, connectivity in RL", "Random walks: Perfect matching in regular bipartite graphs", "DP09 Devdatt P. Dubhashi and Alessandro Panconesi, Concentration of Measure for the Analysis of Randomised Algorithms.", "V20 Nisheeth K. Vishnoi, Algorithms for Convex Optimization.", "AHK12", "Please refer to the Course Webpage for a list of papers related to the topics discussed in the lectures.", "This is a list of some other closely related courses taught elsewhere:", "Randomised and Advanced Algorithms, Winter 2024 by Clément Canonne @ University of Sydney.", "Advanced Algorithms, Spring 2023 by Anupam Gupta @ CMU.", "Advanced Algorithms, Fall 2021 by Mohsen Ghaffari @ ETH.", "Advanced Algorithm Design, Fall 2022 by Matt Weinberg and Huacheng Yu @ Princeton.", "Advanced Topics in Algorithms, Fall 2021 by Kent Quanrud @ Purdue.", "Advanced Algorithms, Winter 2020 by Aleksandar Nikolov @ University of Toronto.", "CS466/666: Algorithm Design and Analysis, Spring 2024 by Rafael Oliveira", "CS466/666: Algorithm Design and Analysis, Fall 2024 by Sepehr Assadi", "CS466/666: Algorithm Design and Analysis, Fall 2022 by Therese Biedl", "CS466/666: Algorithm Design and Analysis, Spring 2022 by Lap Chi Lau", "Course Project (only for graduate students in CS 666) 15%", "15% Course Project (only for graduate students in CS 666)", "The solutions should be turned in as a single pdf file containing the answers to the assignment questions in order.", "For students: LaTeX tremendously helps you in writing clean and well-structured proofs (a necessity for a rigorous proof ) as well as editing an already written proof further.", "For submissions, only one member of the group submits the full solutions on Crowdmark and lists the name of their partners in the group.", "In this case, all members of the group lose one of their extensions.", "However, you can bring in a one-page cheat sheet with you to the exam.", "The final exam follows the same policies as the mid-term exam for blank solutions, one-page cheat sheet, and missed exams.", "Course Project (only for graduate students registered in CS 666)", "Policies and Statements", "Email is fast and tends to give the illusion of constant and immediate access.", "Also, please use email only to communicate specific concerns, questions, or comments regarding your experience in the course, or setting up appointments for in-person meetings outside office hours in case necessary.", "I am using bunch of different email filters to manage my (unmanageable) inbox and I may not get to see emails without this format at all...", "Please let us know ways to improv", "Please inform us of these at the start of the course.", "Your Health & Well-Being", "This is a challenging course with various advanced topics and not-so-easy assignments and exams.", "All of these are going to be time and energy consuming.", "I expect that any assignment or exam you submit in this course will be your own product and follows the collaboration and external resources policies specified earlier in this course outline.", "Intellectual property includes items such as:"]}, {"course_id": 43, "course_code": "PMATH 332", "course_name": "PMATH332 - Applied Complex Analysis (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Applied Complex Analysis Winter 2025", "02:30PM - 03:20PM", "Complex numbers, Cauchy-Riemann equations, analytic functions, conformal maps and applications to the solution of Laplace's equation, contour integrals, Cauchy integral formula, Taylor and Laurent expansions, residue calculus and applications.", "In the case of illness, a VIF will be required.", "If the midterm is missed, after your instructor has verified you have valid reasons for it, and has received a VIF in case of illness, the weight will be shifted to the final exam.", "If the final exam is missed, and valid reasons are found for it, together with a VIF in case of illness, a grade of INC will be given to the student as long as assignments and midterms have seen a good performance.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 45, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 49, "course_code": "PMATH 340", "course_name": "PMATH340 - Elementary Number Theory (0.50)", "term_name": "Required Courses", "program_name": "Combinatorics and Optimization", "program_id": 35, "major_id": 1, "major_name": "Combinatorics and Optimization (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "09:30AM - 10:20AM MC 4060", "Office hour: Wednesday, 1:00pm - 2:00pm", "Solve linear diophantine equations", "Compute continued fraction expansions of rational numbers", "Convince their friends and family that number theory is excellent", "A Friendly Introduction to Number Theory (by Silverman)", "Scheme 2 - Available if you sit all 3 quizzes and score above 75% in each of them.", "A1 - 24th", "A2 - 7th Feb", "A4 - 14th Mar", "Q1 - 31st", "Q2 - 7th Mar", "There will be no midterms!", "In case of a missed assessment, you should notify your instructor via email within 24 hours of the assessment's completion/due date in order to receive an accommodation.", "Notice of Recording"]}, {"course_id": 1, "course_code": "CS 234", "course_name": "CS234 - Data Types and Structures (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Data Types and Structures Fall 2024", "MarkUs problems Email IAs at the course account", "Microsoft Teams problems Email ISG Coordinator Scott King", "Missed assignment or quiz Email ISG Coordinator Scott King", "Extenuating circumstances Email ISG Coordinator Scott King", "Error in mark entry Email IAs at the course account", "ISG Coordinator", "Introduction to commonly used data types, including lists, sets, mappings, and trees.", "This course introduces widely used and effective methods of data organization, focusing on data structures, their algorithms, and the performance of these algorithms.", "Students who successfully complete the course can use these tools to design and develop efficient programs for a wide variety of applications.", "Audience", "Students wishing to understand how choices made in program design can significantly affect performance and how to make these choices", "Highly recommended for students in Information Management and similar fields and for those in the Mathematics/Teaching plan", "The initial topics in CS 234 will present some material new to those coming out of CS 116 (but covered in CS 136) and some material new to those coming out of CS 136 (but covered in CS 116).", "Co-requisites: None", "Rance D. Neśaise, Data Structures and Algorithms Using Python, Wiley, 2010", "Describe basic quadratic sorting algorithms, such as Selection Sort or Insertion Sort.", "Given a simple, well-specified computational task, write a program in a high-level imperative language (e.g., Python, C, or Java) and generate appropriate test cases.", "Use as appropriate simple types, built-in compound types and control idioms, such as selection, iteration, and recursion.", "Explain the benefits of using abstract data types (ADTs) and data structures, and more generally, the concepts of modularity and data hiding, in solving problems in a wide variety of application areas.", "Understand the differing points of view of the user and provider of an ADT and the use of an interface to communicate between views.", "Explain and use the concepts of asymptotic running time, order notation, worst-case, average-case, and best-case complexity, and lower and upper bounds.", "Given a simple algorithm written in pseudocode, determine and informally justify its asymptotic running time, as expressed in order notation.", "Explain the basic structure of memory, including the distinction between external and internal memory and the concept of paging.", "Explain the complexity of some common implementations of these ADTs.", "Given a well-specified computational problem, determine which (if any) ADTs would be suitable.", "Explain how specialized data structures can lead to efficient solutions to specific real-world problems.", "Topics: User and provider viewpoints, planning and coding stages, abstract data types, modularity and data hiding, ADT Multiset, pseudocode, memory model", "Topics: Best, worst, and average-case running times, order notation, algorithm analysis", "Topics: Graph terminology, ADT Undirected Graph, ADT Directed Graph, implementations, depth-first search, breadth-first search", "Topics: Average-case analysis, interpolation search, heuristics, hashing, bucket sort, radix sort", "Notice of Recording", "Should problems occur, your early drafts serve as backups in case of computer problems, and provide evidence of your having attempted to submit work before the deadline.", "Re-mark requests", "The subject should be \"Ax re-mark request\" for x the number of the assignment.", "In the body of the email, include the rationale for the re-mark and the parts of the question that need atttention.", "Exam policies and missed examinations", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 2, "course_code": "AMATH 242", "course_name": "AMATH242 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 1, "major_name": "Computational Mathematics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}]