[{"course_id": 21, "course_code": "STAT 333", "course_name": "STAT333 - Stochastic Processes 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM DC 1350", "04:00PM - 05:20PM", "Erik Hintz: Fridays, 2:00pm - 3:00pm, in M3-2106", "Requests must be emailed to: sasugradadv@uwaterloo.ca", "Topics cover generating functions, conditional probability distributions and conditional expectation, discrete-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, applications including the random walk, the gambler's ruin problem, and the Galton-Watson branching process, an introduction to counting processes, connections between the exponential distribution and Poisson process, and non-homogeneous and compound Poisson processes.", "use moment generating functions as a tool to determine expected values and identify probability distributions of random variables;", "use the law of total expectation to calculate expected values and probabilities through the principle of conditioning;", "specify a discrete-time Markov chain (DTMC), in terms of its transition probability matrix and initial conditions, and calculate various transition probabilities;", "classify the states of a DTMC;", "define fundamental DTMC concepts including irreducibility, periodicity, and recurrence/transience;", "find limiting/stationary probability distributions for certain DTMCs through the use of the Basic Limit Theorem;", "calculate absorption probabilities and expected absorption times for DTMCs using the principle of conditioning with respect to the first transition;", "Week 11 March 24 - March 28 Chap 4: Exponential Distribution & Poisson Processes Tutorial Assignment 2", "Week 12 March 31 - April 4 Chap 4: Exponential Distribution & Poisson Processes Tutorial Test 3", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solving exercises from the Course Notes on your own.", "Introduction to Probability Models by Sheldon M. Ross (2019)"]}, {"course_id": 28, "course_code": "CO 487", "course_name": "CO487 - Applied Cryptography (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Optimization", "program_id": 105, "major_id": 2, "major_name": "Mathematical Optimization - Operations Research Specialization (Bachelor of Mathematics - Honours)", "topics": ["Instructor: Samuel Jaques", "Email: sejaques@uwaterloo.ca", "Timothy Miller", "Nicolas Swanson", "A broad introduction to modern cryptography, highlighting the tools and techniques used to secure internet and messaging applications.", "It is one of the core technologies for securing the emerging information infrastructure.", "This course is a comprehensive introduction to modern cryptography that is aimed primarily at those interested in applications.", "In the area of public-key cryptography, topics will include an overview of specific systems (Diffie–Hellman, RSA, DSA, etc.) and a few advanced protocols.", "The security of these schemes and the use of public-key techniques for generating digital signatures will be described.", "Linear and differential cryptanalysis of ciphers.", "Define the main information security goals of confidentiality, integrity, authentication, and availability", "Explain the intended security properties of each cryptographic primitive and analyze relationships between security properties", "Explain mathematical techniques underlying standardized cryptographic algorithms", "Identify flaws in uses of cryptographic algorithms", "Determine which cryptographic algorithms can be used and combined to build systems with desired functionality and security", "Understand and contextualize the cryptography and security around them in daily life", "0 1 (Jan 6-8) Introduction", "Symmetric Encryption", "3.6 9 Elliptic Curve Cryptography 4 Yes", "4   Applications", "Understanding Cryptography: From Established Symmetric and Asymmetric Ciphers to Post-Quantum Algorithms, 2nd edition, Springer, 2024 Primary reference.", "A1: January 23", "A4: March 20", "This will be clearly indicated for each such question.", "In that case you are required to work independently.", "These questions will test your ability to identify the important concepts introduced in lectures, and your understanding of them.", "In particular:", "Please inform us of these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 7, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 8, "course_code": "PHYS 234", "course_name": "PHYS234 - Quantum Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM DC 1351", "K. Islam", "Introduction to formalism of quantum physics.", "Introduction to operators.", "Background: understanding why we need a quantum theory", "Learning the building blocks of a quantum theory: state vectors and operator", "Jan 06, 08, 10 Introduction to Quantum Physics, Stern-Gerlach experiments 1", "Jan 20, 22, 24 Matrix notation, general quantum systems, operators 2", "Mar 10, 12, 14 Continuous quantum systems – formalism, infinite potential well,", "Mar 17, 19, 21 Continuous quantum systems – infinite potential well (continued), finite potential well 5", "Mar 24, 26, 28 Continuous quantum systems – quantum harmonic oscillator 9", "Mar 31, Apr 02, 04 Continuous quantum systems (continued), Review", "Students should start checking for posted exam dates:", "Everyone needs a support system.", "Every student in PHYS 234 is expected to treat their peers and their instructor with kindness, fairness, tolerance, and respect.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 10, "course_code": "AMATH 242", "course_name": "AMATH242 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 19, "course_code": "PMATH 332", "course_name": "PMATH332 - Applied Complex Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Applied Complex Analysis Winter 2025", "02:30PM - 03:20PM", "Complex numbers, Cauchy-Riemann equations, analytic functions, conformal maps and applications to the solution of Laplace's equation, contour integrals, Cauchy integral formula, Taylor and Laurent expansions, residue calculus and applications.", "In the case of illness, a VIF will be required.", "If the midterm is missed, after your instructor has verified you have valid reasons for it, and has received a VIF in case of illness, the weight will be shifted to the final exam.", "If the final exam is missed, and valid reasons are found for it, together with a VIF in case of illness, a grade of INC will be given to the student as long as assignments and midterms have seen a good performance.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 25, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 31, "course_code": "PHYS 363", "course_name": "PHYS363 - Intermediate Classical Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 1, "major_name": "Mathematical Physics (Bachelor of Mathematics - Honours)", "topics": ["Intermediate Classical Mechanics Fall 2024", "Rigid body mechanics", "Set up Lagrangians and Hamiltonians for a wide range of physical systems", "Find and solve equations of motion using Lagrangian and Hamiltonian mechanics", "Work in noninertial reference frames to solve problems and recognize the consequences of fictitious forces", "Find equations of motion for coupled oscillators and solve linearized equations", "Calculate the inertia tensor of objects and understand the physics of rotating rigid bodies", "Identify conserved quantities using cyclic coordinates, Noether's theorem, and Poisson brackets", "Lagrangian formulation of mechanics and applications (TM Ch 7)", "Hamiltonian formulation of mechanics and applications (TM Ch 7)", "Classical Dynamics of Particles and Systems 5th edition, Thornton and Marion Same text as PHYS 263 Yes", "Python, including several common packages Yes", "A good all round upper-year undergraduate mechanics text.", "Widely used as a graduate level classical mechanics text.", "Introduction to Classical Mechanics: Morin.", "Assignment marks: The mark for each assignment will be based on answers to a subset, possibly all, of the Marked Problems.", "The lowest assignment grade will be removed for calculating the assignment mark.", "Those that require numerical calculations must be worked out using Python.", "These programs are not a substitute for thinking; they should be used sparingly and judiciously as they can become a crutch and will not be available on the midterm or final exams, which account for most of the marks in the course.", "Electronic distractions:  If you can't refrain from using electronics in a distracting way, please show consideration to your peers and sit at the back of the room.", "The assignment weight for the final grade will be reduced and the final exam weight will be increased commensurately for the course grade."]}, {"course_id": 4, "course_code": "CS 114", "course_name": "CS114 - Principles of Computing for Science (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Principles of Computing for Science Winter 2025", "08:30AM - 09:50AM MC 4059", "Monday -", "Monday", "07:00PM - 08:50PM", "10:30AM - 11:20AM MC 4063", "Coordinator", "Student who make use of office hours usually get better grades; use them!", "Introduction to basic imperative programming principles; programming concepts including functions, flow control, lists, arrays; numerical accuracy and efficiency; data analysis and general-purpose algorithms.", "Introduction to object-oriented programming concepts.", "Describe the basic memory model for mutation of basic types, lists, and objects in Python.", "Identify situations where recursion is an appropriate tool, and use it.", "6 Feb 6-11 M4: Strings and Lists", "7 Feb 13-25 M5: Sorting and Dictionaries", "If both exams are held in person", "If in-person exams cannot be held then they will be held online (if possible).", "Students have the option of self-declaring a short-term absence, as described here: https://uwaterloo.ca/registrar/current-students/undergraduate-student-short-term-absences", "Students should check their basic tests email to ensure that the code meets the specification exactly.", "If ill, please complete a complete a Verification of Illness Form and contact the course coordinator to discuss alternate arrangements.", "Generative AI: This course includes the independent development and practice of specific skills, such as writing and reading code, tracing, and algorithm design.", "Library for research-based assignments"]}, {"course_id": 7, "course_code": "MATH 138", "course_name": "MATH138 - Calculus 2 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:20AM", "09:30AM - 10:20AM MC 4059", "10:30AM - 11:20AM MC 4061", "E. Bembenek", "11:30AM - 12:20PM MC 4021", "cpthowel@uwaterloo.ca", "E. Yalcin", "02:30PM - 03:20PM", "08:30AM - 09:20AM QNC 2502", "Introduction to the Riemann integral and approximations.", "Antiderivatives and the fundamental theorem of calculus.", "Applications of the integral.", "Improper integrals.", "Linear and separable differential equations and applications.", "Binomial series, functions defined as power series and Taylor series.", "The goal of this course is to further expand your knowledge of calculus and its applications for one-variable functions.", "First, we will explore areas under curves and the Fundamental Theorem of Calculus, integration techniques, and applications of integration including finding the area between two curves, volumes of solids of revolution, and the average value of a function.", "We will study how to solve separable differential equations and linear differential equations as well as their applications to population growth and Newton's Law of Cooling.", "Write clear and well-organized mathematical solutions and proofs.", "Solve problems in Calculus through logical thinking and careful analysis.", "Set up and evaluate Riemann integrals for simple functions", "Apply various integration techniques including change of variable, integration by parts, trigonometric substitution, and partial fractions.", "Solve separable and first-order linear differential equations.", "Compute the radius and interval of convergence for power series.", "Compute Taylor Polynomials and Taylor series for many elementary functions.", "1: Jan 6 - 10 1.1 - 1.3 Riemann Sums, Definite Integrals, Average Value", "5: Feb 3 - 7 2.1 - 2.2.2, 2.3 Intro to DEs, Direction Fields, Separable and First-Order Linear DEs Quiz 4", "8: Mar 10 - 14 4.1 - 4.3 Intro to Power Series, Differentiation & Integration of Power Series Quiz 7", "FE: Mar 31 - Apr 4 4.8 Big-O Notation Quiz 10", "Notice of Recording", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 9, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 12, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 13, "course_code": "PHYS 122L", "course_name": "PHYS122L - Waves, Electricity and Magnetism Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 2 - Circuits", "Experiment 5 - Magnetic Fields of a Coil", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 15, "course_code": "PHYS 234", "course_name": "PHYS234 - Quantum Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["11:30AM - 12:20PM DC 1351", "K. Islam", "Introduction to formalism of quantum physics.", "Introduction to operators.", "Background: understanding why we need a quantum theory", "Learning the building blocks of a quantum theory: state vectors and operator", "Jan 06, 08, 10 Introduction to Quantum Physics, Stern-Gerlach experiments 1", "Jan 20, 22, 24 Matrix notation, general quantum systems, operators 2", "Mar 10, 12, 14 Continuous quantum systems – formalism, infinite potential well,", "Mar 17, 19, 21 Continuous quantum systems – infinite potential well (continued), finite potential well 5", "Mar 24, 26, 28 Continuous quantum systems – quantum harmonic oscillator 9", "Mar 31, Apr 02, 04 Continuous quantum systems (continued), Review", "Students should start checking for posted exam dates:", "Everyone needs a support system.", "Every student in PHYS 234 is expected to treat their peers and their instructor with kindness, fairness, tolerance, and respect.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 17, "course_code": "PHYS 249", "course_name": "PHYS249 - Computational Physics and Linear Algebra (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Computational Physics and Linear Algebra Fall 2024", "10:30AM - 12:20PM DC 1350", "Email: brenda.lee@uwaterloo.ca", "Computational techniques; numerical accuracy and speed; Python libraries and implementation; algorithms for numerical integration; matrix operations.", "Computational approach to vectors in 2- and 3-space; linear equations, matrices, determinants; eigenvalues and diagonalization.", "Resource Details", "These will not be recorded and consist primarily of board work.", "Understand and apply the basic concepts of vectors, matrices and linear transformations", "Interpret the geometric meaning of vector spaces, subspaces, linear independence, basis and dimension", "Perform matrix operations including addition, multiplication, transposition and inversion both manually and using Python libraries such as NumPy", "Solve systems of linear equations manually and computationally using LU decomposition and Gaussian elimination", "Calculate eigenvalues and eigenvectors of matrices manually and computationally; and interpret their significance in physics applications", "Apply diagonalization techniques to solve differential equations relevant to physics problems", "Understand inner product spaces and concepts of length and orthogonality in both theoretical and computational settings", "Describe and represent linear transformations using matrices; and their contribution to geometric objects and physical systems", "Develop iterative and computational skillsets through Python to model and simulate physical systems with the help of linear algebra concepts", "Identify and articulate transferable skills from their science courses and connect these to the Future Ready Talent Framework", "Create accomplishment statements that effectively communicate these skills on their resumes", "Thursdays Tutorial and Skills Identification & Articulation Workshop @ 10:30am - 12:20pm", "Not all topics may be covered in their entirety, but the core topics from the course calendar description will.", "Topic 1: Intro to Course, Linear Algebra & Python Programming", "2 Sep 9-13 Topic 3: Spanning and Linear Independence", "Topic 5: Projections and Applications", "Skills Identification & Articulation Worksheet 0", "Topic 6: Visualization and Solving of Vector Operations using Python", "Topic 7: Systems of Linear Equations, Gaussian Elimination and Back-Substitution", "Topic 9: Applications of Systems of Linear Equations with Computational Methods and Visualization with Python", "Topic 10: Matrix Addition and Multiplication", "Topic 11: Transpose, Identity and Inverse of a Matrix", "Skills Identification & Articulation Worksheet 1", "Topic 12: Matrix Factorizations", "Topic 13: Computational Methods in Matrix Algebra", "Topic 14: Vector Spaces and Subspaces", "Topic 16: Visualization of Vector Spaces through Computational Methods Skills Identification & Articulation Worksheet 2", "Topic 18: Computational Methods using Determinants", "Topic 19: Eigenvalues and Eigenvectors with Matrix Diagonalization", "Topic 22: Least Squares Approximations Skills Identification & Articulation Worksheet 3", "Topic 23: Numerical Approximation Methods", "UNIT 8 | COMPLEX VALUES & COMPUTATIONAL APPLICATIONS", "Topic 24: Complex Numbers & Computational Applications", "Jan 21: Standing decisions and official grades available in Quest", "Instructions and installation guidance will be provided at the beginning of the term on LEARN Yes", "An Introduction to Linear Algebra for Science and Engineering Excellent book that we will be using in this course; highly recommend getting this if you can No", "Linear Algebra: A Modern Introduction, 4th Edition, David Poole Good elementary book which has suitable problems for scientists No", "Computational Physics, 2nd Edition, Mark Newman Great for beginners to computational physics with Python No", "Introduction to Linear Algebra, 6th Edition, Gilbert Strange (MIT) Excellent mixture of linear algebra and optimization / data science but no physics applications No", "You are encouraged to explore the topics of linear algebra and computational physics / numerical methods of analysis through these recommended textbooks and materials above for your own benefit and enhanced learning experience.", "HOMEWORK (15% Completion Grade): I'm giving you free marks to practice, practice, practice and show you've put in the time to do some linear algebra!", "Level of Collaboration Allowed: Not Monitored", "Do them by the end of the next week to get grades.", "Level of Collaboration Allowed: None - Screening for Plagiarism Active - Debugging Support on Discord is Allowed", "Frequency: Once in the Middle of the Term", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Level of Collaboration Allowed: Groupwork Allowed", "Grading: Based on completion and suitability of responses", "The written content will primarily be code and Jupyter Notebook files.", "Code plagiarism includes moderate to significant reproduction of other's work (source code from available resources, code from classmate submissions, fragments of original code, etc.)", "Notice of Recording", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 18, "course_code": "PHYS 263", "course_name": "PHYS263 - Classical Mechanics and Special Relativity (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Classical Mechanics and Special Relativity Winter 2025", "08:30AM - 09:20AM", "Newtonian dynamics of particles and systems of particles.", "You will be expected to become fluent in solving the problems covered in this course using a variety of approaches (e.g. forces, torques, and energy conservation).", "Classical Dynamics of Particles and Systems (5th edition)", "Notice of Recording"]}, {"course_id": 22, "course_code": "PHYS 363", "course_name": "PHYS363 - Intermediate Classical Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Intermediate Classical Mechanics Fall 2024", "Rigid body mechanics", "Set up Lagrangians and Hamiltonians for a wide range of physical systems", "Find and solve equations of motion using Lagrangian and Hamiltonian mechanics", "Work in noninertial reference frames to solve problems and recognize the consequences of fictitious forces", "Find equations of motion for coupled oscillators and solve linearized equations", "Calculate the inertia tensor of objects and understand the physics of rotating rigid bodies", "Identify conserved quantities using cyclic coordinates, Noether's theorem, and Poisson brackets", "Lagrangian formulation of mechanics and applications (TM Ch 7)", "Hamiltonian formulation of mechanics and applications (TM Ch 7)", "Classical Dynamics of Particles and Systems 5th edition, Thornton and Marion Same text as PHYS 263 Yes", "Python, including several common packages Yes", "A good all round upper-year undergraduate mechanics text.", "Widely used as a graduate level classical mechanics text.", "Introduction to Classical Mechanics: Morin.", "Assignment marks: The mark for each assignment will be based on answers to a subset, possibly all, of the Marked Problems.", "The lowest assignment grade will be removed for calculating the assignment mark.", "Those that require numerical calculations must be worked out using Python.", "These programs are not a substitute for thinking; they should be used sparingly and judiciously as they can become a crutch and will not be available on the midterm or final exams, which account for most of the marks in the course.", "Electronic distractions:  If you can't refrain from using electronics in a distracting way, please show consideration to your peers and sit at the back of the room.", "The assignment weight for the final grade will be reduced and the final exam weight will be increased commensurately for the course grade."]}, {"course_id": 25, "course_code": "STAT 230", "course_name": "STAT230 - Probability (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["03:30PM - 04:20PM MC 4045", "09:30AM - 10:20AM MC 4045", "02:30PM - 03:20PM", "03:30PM - 04:20PM MC 2017", "08:30AM - 09:20AM", "Pavel Shuldiner; E-mail: pavel.shuldiner@uwaterloo.ca; M3 4108", "Come with well-organized questions to make the best use of your time.", "Requests must be emailed to sasugradadv@uwaterloo.ca", "Joint probability functions, marginal probability functions, and conditional probability functions of two or more discrete random variables and functions of random variables are also discussed.", "Post-requisite:", "Define a probability model and determine probabilities of events using counting techniques.", "Define and use probability mass functions, probability density functions, and cumulative distribution functions to determine probabilities of events.", "Use moment generating functions as a tool to determine expected values.", "This learning consists of taking the time to carefully read the lecture notes on your own, ensuring you understand the concepts and steps demonstrated in the lectures to tackle examples, and then solving the end-of-section problems.", "Definitions of Probability", "Mathematical Probability Models", "1.1", "1.2", "Counting in Uniform Probability Models", "Addition and Multiplication Rules for Counting", "Permutations and Combinations", "Counting in Uniform Probability Models", "Addition and Multiplication Rules for Counting", "Permutations and Combinations", "Addition Rules for Unions of Events", "1.3", "2.1", "2.2", "2.3", "Conditional Probability and Product Rules for Intersections of Events", "Probability Mass Functions, Cumulative Distribution Functions", "Functions of Random Variables", "3.2", "Expectation of a Random Variable", "Expectation of a Function of a Random Variable, Properties of Expectation", "Moment Generating Functions", "3.3", "3.4", "3.5", "Basic Terminology and Techniques", "Joint Probability Mass Functions, Marginal Probability Mass Functions", "3.5", "4.1", "Multinomial Distribution", "Linear Combinations of Random Variables", "4.2", "4.4", "Linear Combinations of Random Variables", "Law of Total Expectation", "4.4", "4.5", "4.6", "Law of Total Expectation", "Cumulative Distribution Function, Probability Density Function", "Functions of Random Variables", "4.6", "Expectation of a Random Variable", "Moments of a Distribution, Moment Generating Functions, Mean, Variance, Standard Deviation", "Exponential Distribution", "Normal Distribution", "Exponential Distribution", "Normal Distribution", "Use of the Normal Distribution in Approximations", "Therefore, you should plan to spend between 3 and 6 hours each week in out-of-class learning.", "This learning consists mainly of ensuring you understand the concepts and steps used in class to solve problems and then solving exercises from the Course Notes on your own.", "A 2.5-hour final cumulative examination will be held during the final exam period in April.", "In the case of extenuating circumstances, you must provide sufficient documentation via e-mail to Divya Lala at divya.lala@uwaterloo.ca as soon as possible to verify your absence's circumstances.", "Re-mark Requests:", "Cancellation of In-Person Classes:", "Intellectual property includes items such as:", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "This course includes the independent development and practice of specific skills for solving real-life problems using introductory probability rules.", "Library for research-based assignments"]}, {"course_id": 26, "course_code": "STAT 231", "course_name": "STAT231 - Statistics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "03:30PM - 04:20PM DC 1350", "02:30PM - 03:20PM", "11:30AM - 12:20PM MC 1085", "03:30PM - 04:20PM", "10:30AM - 11:20AM EIT 1015", "09:30AM - 10:20AM EIT 1015", "Email: aslynko@uwaterloo.ca", "Email: liqun.diao@uwaterloo.ca", "Email: yangjc@uwaterloo.ca", "Email: henan.xu@uwaterloo.ca", "Funmilayo Adeku", "Email: fadeku@uwaterloo.ca", "This course provides a systematic approach to empirical problem solving which will enable students to critically assess the sampling protocol and conclusions of an empirical study including the possible sources of error in the study and whether evidence of a causal relationship can be reasonably concluded.", "The connection between the attributes of a population and the parameters in the named distributions covered in STAT230 will be emphasized.", "Numerical and graphical techniques for summarizing data and checking the fit of a statistical model will be discussed.", "The method of maximum likelihood will be used to obtain point and interval estimates for the parameters of interest as well as testing hypotheses.", "The interpretation of confidence intervals and p-values will be emphasized.", "The Chi-squared and t distributions will be introduced and used to construct confidence intervals and tests of hypotheses including likelihood ratio tests.", "Contingency tables and Gaussian response models including the two sample Gaussian and simple linear regression will be used as examples.", "Course Information Webpage", "Please do not send these questions via email.", "I expect everyone to be respectful to each other, any posts that do not meet the principles in Policy 33: Ethical Behaviour will be removed.", "Email", "Please send emails from uwaterloo.ca email address and include the session number and student ID number.", "Continuity Plans", "Use numerical and graphical summaries of a data set to describe the characteristics of a variate and to check the fit of a statistical model to the data.", "Use the steps of PPDAC to identify both the objectives and possible sources of error in an empirical study, and to critically evaluate the conclusions.", "Identify the connection between attributes of a population and the parameters in the named distributions (Binomial, Poisson, Multinomial, Exponential, Normal).", "Define and use the likelihood function to obtain point estimates of the unknown parameters in a model particularly for the Binomial, Poisson, Multinomial, Exponential and Gaussian (Normal) models.", "Use a pivotal quantity to construct a confidence interval for a parameter in some specific cases, and interpret the confidence interval.", "Use the likelihood function to construct and conduct a test of hypothesis for an unknown parameter in a model.", "Interpret p-values and describe the connection with confidence intervals.", "Define the properties of the Chi-squared and t distribution.", "Define a Gaussian response model including simple linear regression; determine point and interval estimates and conduct tests of hypotheses for the parameters in a Gaussian model.", "Use a Goodness of Fit test to test the fit of a model, independence in a two-way table and equality of proportions for two or more groups", "Describe the importance of randomization and pairing in experimental design and be able to recognize whether a study design allows the researcher to conclude cause and effect.", "This learning consists of taking the time to carefully read the course notes on your own, making sure you understand the concepts and steps demonstrated in the lectures to tackle examples, and then solving the end-of-chapter problems.", "Monday", "Friday", "Welcome", "1.1 Introduction to Statistical Sciences", "1.3 Numerical Data Summaries", "1.3 Graphical Summaries", "1.4 Probability Distributions and Statistical Models", "1.5 Data Analysis and Statistical Inference", "1.6 Introduction to R and RStudio", "2.1 Choosing a Statistical Model", "2.2 Estimation of Parameters", "2.3 Method of Maximum Likelihood", "2.4 Likelihood Functions for Multinomial Models", "2.5 Invariance Property of MLE", "2.6 Checking the Model", "3.1 Planing and Conducting Empirical Studies", "3.2 Steps of PPDAC", "3.3 Case Study", "4.1 Statistical Models and Estimation", "4.2 Estimators and Sampling Distributions", "4.4 Confidence Intervals and Pivotal Quantities", "4.5 The Chi-Squared and t Distributions", "4.6 Likelihood-Based Confidence Intervals", "4.7 Confidence Intervals for Parameters in the Gaussian model", "4.7 Confidence Intervals for Parameters in the Gaussian model (Continued)", "5.1 Introduction to Hypothesis Testing", "5.2 Test of Hypotheses for Parameters in the Gaussian Model", "Relationship Between Hypothesis Testing and Confidence Intervals", "5.3 Likelihood Ratio Test of Hypothesis - One parameter", "6.1 Gaussian Response Models", "6.2 Simple Linear Regression: Maximum Likelihood and Least Squares Estimates", "Confidence Interval for Parameters in the Model", "6.3 Checking Model Assumptions and Residual Plots", "Randomization, Paring, and Experimental Design", "7.1 Likelihood Ratio Test for the Multinomial Model", "7.2 Goodness of Fit Tests", "This learning consists mostly of making sure you understand the concepts and steps that were introduced and used in class to solve examples and then solving problems from the Course Notes on your own.", "R Statistical Software", "R and the RStudio development environment can be downloaded from here.", "All assessments are proctored, in-person, and closed-book exams.", "A 2.5-hour cumulative final examination will be held during the final exam period (April 9 - 25, 2025).", "If you have a question regarding the marking of an assessment, you should first check the posted solutions on LEARN.", "First and last name", "Session number", "Please be specific and explain your rationale for a remark.", "Notice of Recording", "Short-term absence", "COVID-19-related absence", "No limits on number of submissions per term and only available during the formal lecture period", "In particular:", "Please inform us of these at the start of the course.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 28, "course_code": "PMATH 332", "course_name": "PMATH332 - Applied Complex Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Applied Complex Analysis Winter 2025", "02:30PM - 03:20PM", "Complex numbers, Cauchy-Riemann equations, analytic functions, conformal maps and applications to the solution of Laplace's equation, contour integrals, Cauchy integral formula, Taylor and Laurent expansions, residue calculus and applications.", "In the case of illness, a VIF will be required.", "If the midterm is missed, after your instructor has verified you have valid reasons for it, and has received a VIF in case of illness, the weight will be shifted to the final exam.", "If the final exam is missed, and valid reasons are found for it, together with a VIF in case of illness, a grade of INC will be given to the student as long as assignments and midterms have seen a good performance.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 38, "course_code": "PHYS 334", "course_name": "PHYS334 - Quantum Physics 2 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "04:30PM - 05:20PM", "Formalism of quantum mechanics.", "Identical particles.", "Applications in atomic and molecular physics.", "Physically predict, and mathematically model, the outcome(s) after measuring a quantum system", "Understand and model the difference between a single measurement outcome and an ensemble average", "Predict the time dependence of a quantum system, given its initial state and Hamiltonian", "Use commutator identities to check commutation relations for operators", "Write the position and momentum operators in terms of the harmonic oscillator ladder operators, and vice versa", "State the commutation relations that define a set of angular momentum operators", "State the spectrum (allowed eigenvalues) of the angular momentum operators 𝐽^2 and 𝐽_𝑧, in terms of quantum numbers 𝑗 and 𝑚", "State the restrictions on the 𝐽^2 and 𝐽_𝑧 eigenvalues, in terms of restrictions on their associated quantum numbers 𝑗 and 𝑚", "State the effect of all angular momentum operators on the joint eigenstates of 𝐽^2 and 𝐽_𝑧", "Compute the matrix representations of the angular momentum operators for a given 𝑗, in the joint eigenbasis of 𝐽^2 and 𝐽_𝑧", "Describe the eigenfunctions of orbital angular momentum (spherical harmonics) in the position basis", "For systems with “central” potentials (those that depend only on a radial coordinate), describe the decomposition of the energy eigenfunctions into their angular and radial components", "Describe the energies and eigenstates of the hydrogen atom", "Describe the degeneracy of different energy eigenstates of the hydrogen atom", "State two possible complete sets of mutually commuting operators (CSCOs) whose eigenstates can be used as bases to describe a set of two angular momenta", "State the eigenvalues of the CSCOs used to describe a set of two angular momenta", "State the selection rules for the Clebsch-Gordan coefficients that relate the coupled and uncoupled bases of a system with two angular momenta", "Calculate perturbative energy shifts and wavefunction changes for nondegenerate systems", "Calculate perturbative energy shifts for degenerate systems, selecting an appropriate basis for the calculation", "Use the variational method to estimate the ground-state energies of simple one-dimensional problems, given a suitable trial function", "State the definition of a boson and a fermion, in terms of the spin of the particles", "State the symmetry properties of bosonic and fermionic wavefunctions", "Exams", "There will be two in-class exams given during the lecture period in our usual classroom.", "Exam 2: Wed. Mar 19 (covers material up through and including nondegenerate perturbation theory)", "HW1 - formalism and postulates - due Jan 24", "HW2 - quantum harmonic oscillator and angular momentum - due Feb 7", "HW3 - spherical harmonics and hydrogen atom - due Feb 28", "HW4 - addition of angular momentum and nondegenerate perturbation theory - due Mar 12", "Week 1 - Intro to class and mathematical formalism of quantum mechanics", "Week 4 - Angular momentum", "Week 5 - Spherical harmonics and central potentials", "Week 8 - Nondegenerate perturbation theory", "Week 9 - Degenerate perturbation theory, fine structure, Zeeman effect", "Quantum Mechanics: A Paradigms Approach, David H. McIntyre", "Introduction to Quantum Mechanics, David Griffiths", "Zettili shines in its extensive collection of worked examples and practice problems.", "Some assignment problems may be graded on a multiple choice basis.", "Notice of Recording"]}, {"course_id": 39, "course_code": "BIOL 110", "course_name": "BIOL110 - Biodiversity, Biomes, and Evolution (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Labs begin the week of **Sept. 9**", "(Any issues in laboratory should contact Dr. Wolff)", "Monitor LEARN for important information", "A survey of organisms that inhabit a range of aquatic and terrestrial ecosystems (e.g., coral reefs, lakes, forests).", "Evolutionary and ecological frameworks will be used to explore how organisms diversify and are considered distinct species.", "The laboratory for this course is integrated with the lecture (unlike some of your other first year courses) - you will need to be sure to read the lab exercises before attending, and come prepared for our outdoor labs where appropriate shoes and clothing are necessary for the weather.", "I teach courses in ecology, evolution and genetics.", "I have been teaching evolution and ecology at the University of Waterloo for 7 years, and I hope to share with students my enthusiasm for phylogenetics.", "List themes and characteristics that differentiate the major groups of eukaryotes.", "Identify specific animals that facilitate and/or endanger human society.", "Construct and evaluate phylogenetic trees using parsimony", "Introduction", "Phylogeny and the modern view of biological relatedness", "Ecosystems and Resource Flux", "**Oct. 28  Midterm**", "Concepts in Diversity", "Activities will include using microscopes and drawing what you see, dissections of preserved animals, and collecting benthic invertebrates from the local stream and identifying them using pictoral keys.", "Note: You can also choose to do neither and forego the bonus mark altogether, as this is voluntary.", "Participation in Research Study", "Reminder, as participation in this study is voluntary, and it is a bonus mark, students may also decide to not do either activity and forego the bonus mark altogether.", "Notice of Recording", "In the case of an unwritten final exam, your course mark will be entered as DNW (32% for calculation of overall average)."]}, {"course_id": 40, "course_code": "BIOL 130", "course_name": "BIOL130 - Introductory Cell Biology (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "An introduction to the concepts of cell biology with emphasis on (1) the structural organization of the cell and (2) the function of critical molecular processes that are characteristic of living organisms.", "Explain the fundamental elements of cells, the chemistry of life, and the major classes of biological macromolecules.", "Describe metabolism, the role of enzymes in chemical reactions, and how cells can capture, and utilize, energy.", "Explain how cells respond to signals and form cellular communities.", "Module 1 - Introduction to Cell Biology & The Cell Theory", "Module 2 - Molecules of Life", "2 Module 3 - Cells and Membranes  In-class case study", "3 Module 4 - Nucleic Acids & Information Flow", "4 Module 5 - Protein Structure, Function & Synthesis  In-class case study", "6 Module 7 - Cellular Respiration In-class case study", "In-class case study", "9 Module 9 - Cell Signalling", "10 Module 10 - Cell & Tissue Form", "and In-class case study", "11 Module 11 - DNA Replication & Cell Division Case study due", "12 Module 11 - DNA Replication & Cell Division  Term Test 1", "Official Grades and Course Access", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each module for the achieve assignments and term tests.", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines", "Library for research-based assignments"]}, {"course_id": 41, "course_code": "BIOL 130L", "course_name": "BIOL130L - Cell Biology Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "STC 4018", "02:30PM - 05:20PM", "STC 4018", "However, we do run multiple labs at the same time which means we may not always be in the office.", "Situation", "Please email Dr. Gurska directly at jola.gurska@uwaterloo.ca", "What does it mean to be a cell biologist?", "One group of scientists might explore growing tissues in a laboratory to one day produce artificial skin or organs.", "No matter what their question, cell biologists use a similar set of laboratory skills that allow them to peek inside the tiniest of biological units that make up the diversity of organisms we see around us.", "Although fundamental techniques like microscopy have hugely advanced since the invention of the light microscope, every cell biologist needs to learn how to properly use a microscope to see cells reliably.", "These can be very tricky to use properly but doing so could be the difference between a world-changing discovery and an experiment that no one can replicate.", "These and other methods that are integral to working in the cell biology field will be introduced in this laboratory and it is my hope that you will leave confident in these fundamental techniques.", "Maintain a well-organized and comprehensive lab book.", "Identify elements of a well-structured laboratory report and write some elements of a lab report.", "Assignment 3 Model Organisms and Experimental Design 3%", "I welcome any inquiries regarding AccessAbility accommodations.", "Some examples of what will be noted includes the following:", "did you complete the bioskills exercises during the first lab?", "did you behave in a respectful and professional manner in the lab?", "Using a micropipette without a tip,", "Holding a micropipette upside down with liquid in the micropipette tip,", "Setting a micropipette precariously close to the edge of the bench so that it may fall on the floor,", "Forcing the pipettes past their minimum and maximum calibrated ranges", "Keeping a thorough lab book is a critical skill learned in a biology laboratory to document key observations and procedures.", "Some reagents will already be set up to use at your bench, while others will be in dispensing bottles on the side bench or in the fume hoods, in which case the liquid must be dispensed directly from the bottles.", "These can be purchased at the W Store Essentials in the STC.", "Since many standard laboratory reagents are volatile, please consider not wearing contact lenses in the laboratory.", "When not in use, stools should be tucked away under-bench and personal items stowed underneath in cupboards.", "Finally, please remember that safety should be a collective concern.", "They will be reviewed at the end of the term for statistical purposes only.", "The goal of the draft submissions is to teach you the capabilities of Turn-it-in analysis and to encourage you to use the software to improve your paraphrasing and referencing.", "Details on how to interpret Turn-it-in reports and use the draft Dropboxes can be found under Content on LEARN.", "As outlined under Quizzes section above, please note that the BIOL 130L online multiple-choice quizzes are designed to be completed in half the time you are given.", "Expectation of Academic Integrity", "This course includes the independent development and practice of specific skills, such as scientific writing and communication.", "Poorly paraphrased information without in-text citation 5 marks off for each", "Poorly paraphrased information with in-text citation 3 marks off for each", "Well paraphrased information without in-text citation 3 marks off for each", "Lab Manual is cited in Results and/or Discussion 1 mark off for each citation", "A reference in the reference list does not have corresponding in-text citations 5 marks off for each", "An in-text citation is not in the reference list 5 marks off for each", "Misconduct; student’s name will be sent to the Associate Dean to check if this is the first misconduct"]}, {"course_id": 42, "course_code": "BIOL 150", "course_name": "BIOL150 - Organismal and Evolutionary Ecology (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Physics", "program_id": 106, "major_id": 2, "major_name": "Mathematical Physics (Bachelor of Science - Honours)", "topics": ["Organismal and Evolutionary Ecology Fall 2023", "11:30AM - 12:20PM RCH 101", "Learn Discussion Board", "Email and Appointment Requests", "Coverage includes hypothesis testing and the nature of scientific inquiry, basic population genetics, physiological ecology, life histories, dispersal, basic population and community ecology, macroevolution, systematics and classification, as well as functional morphology.", "The theory of evolution unites the whole of biology and all living organisms into a coherent body of knowledge, allowing comparisons across all forms of life.", "Ecology describes how organisms interact with their environment and each other to create interdependent systems from microscopic to global scales.", "These disciplines are fundamentally tied together: evolution is the primary mechanism by which species adapt to their environment; ecological interactions and environmental variability drive natural selection.", "You will also carry out simulated lab assignments to test the principles of evolution, design ecological experiments to test alternate hypotheses about the conservation of species and manipulate demographic parameters to test their influence on population growth.", "Understand the principles of scientific methodology", "Define ecological and evolutionary terms, such as the niche, adaptation, and altruism", "Illustrate these mechanisms in the context of course examples", "Explain how ecological interactions and evolution are interconnected", "Sign code of conduct and upload to LEARN.", "2) Sept 8 Evolution for Ecology Section 1: Evolution and Ecology are Intertwined", "4) Sept 13 Evolution for Ecology", "5) Sept 15 Evolution for Ecology Section 3: Genetics and Evolution", "6) Sept 18 Evolution for Ecology Section 4: Managing the Evolution of Resistance", "9) Sep 25 Physiological Ecology Section 1: Trade-offs and Species Distributions", "15) Oct 9-13 Holiday – No classes Understanding Experimental Design Simulation due by Oct 16, 11:59 pm", "16) Oct 16 Empiricism in Ecology Understanding Experimental Design Simulation due by 11:59 pm (best 2/3 for 10%)", "It is important that you review the information below before you subscribe to the SimUText for Organismal Ecology and Evolution - Chapters at University of Waterloo.", "SimUText Application Installers", "SimUText Application Installers", "At the end of every unit, you will work individually to develop a concept map using Cmap Cloud to visually display the relationships among what you consider the key concepts in the unit.", "These should represent your personal comprehension of how the concepts relate to each other, and no two should be identical.", "Also, class will entail a lot of discussion that won’t be represented in PPT slides.", "The simulations include one on Evolution in Ecology, one on Experimental Design in Ecology and one on Population Growth.", "The learning outcome for the unit tests is to demonstrate your recall and comprehension of the material covered in the units and to incentivize keeping up with the readings and attending lectures and reviewing for the final exam.", "The learning outcome is to demonstrate recall, synthesis and integration of material learned during the course.", "The final exam will consist of multiple-choice, T/F, solve the equation type of questions and integration questions that are designed to test your basic and deeper understanding of the course concepts.", "Important note regarding tests and exams", "Unit tests will be completed for the first 4 units of the course.", "Ensure you have a reliable internet connection and functional computer to complete them – technical challenges encountered during remote completion are not an excuse for missed tests.", "I will have a limited number of printed back-ups for students in class who experience technical difficulties.", "You will need to have a reliable internet connection and functional computer to complete the exams.", "Emails can be received 24 hours per day.", "If you miss a make-up exam for any reason, you will be given a DNW, and must petition the Associate Dean of Science if you feel you missed it for a valid reason.", "At the discretion of the instructor, you may be permitted to write a make-up exam.", "The timing will be conveyed to you via e-mail if you are eligible for a make-up.", "If you follow these steps,", "I will consider granting an extension", "Students are responsible for their own behavior and should be mindful of the impact that their actions have on the wellbeing of others.", "Act in a respectful and open manner when listening to the views and ideas of others.", "Participate fully in the discussion boards: make sure your answers are to the best of your ability and that you respond to others’ posts.", "Signature"]}]