[{"course_id": 34, "course_code": "SYDE 461", "course_name": "SYDE461 - Systems Design Capstone Project 1 (0.50)", "term_name": "4A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Systems Design Capstone Project 1 Fall 2024", "08:30AM - 10:20AM E5 6008", "10:30AM -", "E-mail: rroufail@uwaterloo.ca", "Open door policy & upon request.", "Technical Engineering Suport", "Office Location: E7-6402", "E-mail: orion.bruckman@uwaterloo.ca", "E-mail: jerrin.bright@uwaterloo.ca", "The first half of a two-term engineering design project continuing the systems design project sequence.", "Students work in small groups applying the principles of systems design engineering to a situation of concern of their own choosing.", "Prof. Roufail should be your first point of contact for all questions.", "*Panel exams will be booked in coordination with the groups and project supervisor and advisors.", "Identify, formulate, analyze, and solve complex engineering problems utilizing university level mathematics and applied engineering fundamentals.", "Investigate complex open ended engineering problems using appropriate methods and design solutions that will meet preidentified needs using proper engineering standards, while paying attention to health and safety risks, environmental and societal sustainability.", "Effectively communicate complex engineering concepts to different stakeholders both orally and written.", "Recognize their role and responsibility towards society as professional engineers, especially their primary role to protect the public.", "Analyze the impact of the project on society and the environment at all stages of the project life cycle along with the ethical impact.", "Identify and address their own educational need to maintain their competency in the fields necessary for the success of the project.", "Demonstrate understanding of concepts in mathematics", "Demonstrate understanding of concepts in natural science", "Demonstrate understanding of engineering fundamentals", "Demonstrate understanding of specialized engineering knowledge", "2b", "Develop models to solve engineering problems including identifying", "Design experiments1 to investigate complex engineering problems", "Gather information from relevant sources to address complex engineering", "3c", "Synthesize information from multiple sources to reach valid conclusions", "Design (Des)", "Define design requirements and specifications for complex, open-ended", "Generate and refine potential solutions to complex, open-ended design", "Critically evaluate and compare design choices", "Select appropriate engineering toolsbehavior, considering their limitations", "Create and/or modify appropriate engineering tools, identifying their", "6a", "Generate appropriate documentation to communicate within the profession and to society at large", "7b", "7c", "Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest", "Describe the importance of codes, standards, best practices, laws, and regulations within engineering", "Impact of engineering(Impacts)", "project, incorporating sustainability considerations in making decisions", "Identify ethical and unethical behaviour in professional situations", "Identify how an engineer is accountable to multiple stakeholders in engineering practice", "Economics and project management (Econ)", "Apply project management techniques in engineering projects, with attention to risk, and change", "Identify gaps in their knowledge, skills and abilities", "W3", "Proposal Summary & Individual Prospect Contribution", "Follow up with Prof.Roufail &Teaching Team(A)", "Team Contract & signed supervisor agreement", "Follow up with Prof.Roufail &Teaching Team(B)", "Follow up with Prof.Roufail &Teaching Team(A)", "Follow up with Prof.Roufail &Teaching Team(B)", "Design Project Safety Disclosure", "Milestones", "Technical Development Modules (TDM):", "There will be a sign-up form for the modules.", "TDM2: Reverse Engineering 1 Sign Up**", "TDM3: Workshop and prototyping Sign Up**", "TDM4: Sustainability in Design At least one member per group +", "TDM5: Electronic Fabrication Sing Up**", "TDM6: Mechanical Fabrication Sign Up**", "Power Supply Design Sign Up**", "Technical Communication At least one member per group +", "TBD", "TDM9: Muli-Physics modeling & simulation  Sign Up**", "TBD", "TDM10: Engineering Economics & Design Optimization At least one member per group", "TBD", "Material Selection for Design Sign Up", "TBD", "TBD", "TBD", "TBD", "TDM15: Battery & Energy Storage Sign Up", "TBD", "TDM16: Fabrication Basics Sign Up", "TBD", "Design Infographic Peer Evaluation (D3) 5%", "Design Analysis Report (D6) 30%", "An ideal number of team members working on a complex engineering project would be 4 students.", "A robust product does not mean a “consumer-ready” product.", "Your competence in the execution of the engineering design process and in the application of engineering knowledge, skills, and tools.", "Marking of Team-Based Deliverables:", "A Team Health Assessment/Peer Review type of milestone will be assigned towards the end of term in which team members will be given the opportunity to evaluate the contributions of themselves and their team members.", "It is the responsibility of ALL team members to ensure the accuracy and quality of all aspects of submitted team-based deliverables.", "Sanctioned Collaboration vs. Individual Work", "Instructions will clearly identify individual and team components.", "Accurate and Honest Reporting", "The same applies if fraudulent reporting is uncovered as part of the questioning during any of the Panel Exams and Design Reviews.", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.", "Compassionate and respectful communication: Most online communication between", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows the University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "They will review your case and coordinate a reasonable and fair plan in"]}, {"course_id": 37, "course_code": "BME 544", "course_name": "BME544 - Biomedical Measurement and Signal Processing (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Biomedical Measurement and Signal Processing Winter 2025", "Signal processing techniques will be discussed in the context of extraction and application of useful biomedical signals.", "(3) Understand and apply digital signal processing concepts and techniques to biomedical signals", "(4) Develop a signal processing system to reliably extract features from biomedical signals for a particular application and justify the approaches/choices made", "1 Knowledge Base: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "4b Critically evaluate and compare design choices 4", "17-Jan Power Spectra and Spectrograms 3", "31-Jan Sampling in Embedded Systems 2", "14-Feb Correlation Analysis 2,3", "24-Feb Parametric Signal Processing 3", "28-Feb Speech Processing and Applications 2,3", "07-Mar Electrodes and coupling to the environment 2", "21-Mar Brain Anatomy and EEG 1", "24-Mar EEG Processing 2,3", "Biomedical Signal Analysis, 3rd Edition.", "A total of 6 assignments will be given during the term.", "Data Collection", "One is for students to gain experience in recording measurements of different biomedical signals.", "The second is to provide a set of recordings for students to use to test and evaluate signal processing approaches.", "It is anticipated the four sets of data collection will be conducted during the term.", "The project is an individual Students will identify an application involving a biomedical signal.", "Based on the application, they will develop and evaluate a signal processing system to reliably extract features from biomedical signals for that application and justify the approaches/choices made.", "Notice of Recording", "Course and Departmental expectations", "Compassionate and respectful communication", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "SYDE-BME Compassionate Accommodation", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 45, "course_code": "CIVE 460", "course_name": "CIVE460 - Engineering Biomechanics (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Biomechanics Winter 2025", "02:30PM - 05:20PM", "RCH 301", "Introduction to engineering technologies applicable to the field of biomechanics.", "Specific topics covered may include biological growth, form and function; biomaterials; kinematics and neurology of gait; biotribology; joint anatomy, function and repair; occupational biomechanics; trauma prevention.", "The course will provide a general overview of engineering biomechanics for civil, mechanical and biomedical engineering students.", "2. Conduct gait analysis and calculate forces applied at joints and foot reactions", "Introduction", "Evolution of Biomechanics", "Applications (medical and engineering)", "Musculoskeletal System", "Introduction,", "Anatomical positions & movements,", "System components,", "Gait Biomechanics", "Introduction;", "Muscles forces,", "Bone & Cartilage Biomechanics", "Introduction (highlights & progress),", "Bone mechanical properties & applications;", "Cartilage structure and mechanics", "Tendon & Ligament biomechanics", "Mechanical behaviour", "Biotribology & Joint Replacement", "Biotribology subfields,", "Cancer Biomechanics", "Introduction: cancer stages,", "Mechanical characteristics of cancer cells,", "Biomechanics and cancer treatment,", "Cardiovascular biomechanics, and", "Biomechanics in Radiotherapy", "“Orthopaedic Biomechanics: Mechanics and Design in Musculoskeletal Systems,” Pearson Prentice Hall.", "Biomechanics and motor control of human movement.", "Biomechanics and motor contAl-Mayah, A. (Ed.)"]}, {"course_id": 46, "course_code": "ECE 356", "course_name": "ECE356 - Database Systems (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Database Systems Fall 2024", "ECE 356", "ECE 356 001", "11:30AM -", "08:30AM - 09:50AM E7 4417", "Data models, file systems, database system architectures, query languages, integrity and security, database design.", "View requirements for ECE 356", "Relational databases empower the vast majority of dynamic websites as well as a variety of information management systems in private and public sector organizations.", "ECE356 explores the concepts and techniques that make such databases convenient, efficient, and reliable.", "The course additionally includes an introduction to data mining and NoSQL.", "model data using entity-relationship (ER) diagrams", "understand the relational model and design a relational schema for a data set", "execute SQL commands against a remote database using Java Database Connectivity (JDBC)", "identify integrity constraints and functional dependencies in data", "apply the theory of database normalization to optimize the design of a relational schema", "understand the basics of transaction execution, concurrency control, and recovery in databases", "understand SQL injection attacks, as well as password hashing and salting", "perform simple data mining and analytics operations on real data sets", "design a denormalized schema for a NoSQL database", "September 4-10 intro, relational model SSH, mysql command line tool     first week of classes", "September 11-17 relational algebra, SQL relational algebra", "October 2-8 normalization normal forms and normalization", "Exams", "A make-up final exam, if offered by the instructor, may be scheduled in a future academic term.", "The instructor will not offer a make-up midterm, and will instead consider shifting the weight of a missed midterm towards the final exam.", "Members of the teaching team may also evaluate students' proficiency in the use of software in connection with lab work.", "If a student's solution differs substantially from the solution recognized by the teaching team, the student may be asked to provide sample inputs and outputs to evaluate the correctness of their solution.", "Collaboration", "Exams may cover both theory and practice, including your ability to read and write SQL code.", "Notice of Recording"]}, {"course_id": 48, "course_code": "ECE 406", "course_name": "ECE406 - Algorithm Design and Analysis (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Algorithm Design and Analysis Winter 2025", "ECE 406", "ECE 406 001", "11:30AM -", "E. Creager", "04:00PM - 05:20PM", "E. Creager", "04:00PM - 05:20PM", "• Rushabh Solanki", "ECE 406:", "Design and analysis of efficient, correct algorithms.", "Advanced data structures, divide-and-conquer algorithms, recurrences, greedy algorithms, dynamic programming, graph algorithms, search and backtrack, inherently hard and unsolvable problems, approximation and randomized algorithms, and amortized analysis.", "View requirements for ECE 406", "How to design efficient algorithms using divide and conquer, greedy algorithms, and dynamic programming.", "The kinds of problems that can be solved with linear programming, and why they can be solved efficiently.", "What it means to reduce one problem to another, and how it used in complexity analysis", "Introduction to algorithms Chapter 0 0.5 hours", "Divide and conquer algorithms Chapter 2 5 hours", "Graphs, decompositions and depth-first search Chapter 3 3 hours", "Linear Programming: Simplex algorithm, duality theorem Chapter 7 4 hours", "No lectures during ECE midterms week (Feb 24--28)", "LEC001] Tue 2:30--3:30pm in E7-5353", "Assignments Information and Guidelines: Assignments are given roughly every other week, and their primary goal is to give you practice in designing and analyzing algorithms.", "You must list these collaborators at the top of the first page of your assignment (there is no penalty for listing collaborators, but it ensures we do not falsely identify plagiarism).", "In submitting an assignment, you are “signing off on your work” as described in the academic integrity form at https://uwaterloo.ca/academic-integrity/. The penalty for a first plagiarism offence is -100% for the assignment.", "* Each student must turn in a signed academic integrity form to confirm their understanding of the above policies.", "Notice of Recording"]}, {"course_id": 49, "course_code": "ECE 457B", "course_name": "ECE457B - Fundamentals of Computational Intelligence (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Fundamentals of Computational Intelligence Winter 2025", "ECE 457B", "Monday, Friday -", "10:00AM - 11:20AM E7 5353", "04:00PM - 05:20PM", "Da Saem Lee : ds3lee@uwaterloo.ca", "Communication and Discussion", "If you really have a critical time issue, or you don't want the TA's to see the message (for any reason at all), then you should send Prof. Crowley a direct message on Teams chat in addition to email.", "Model-based prediction and classification.", "Multiple examples and case studies such as autonomous driving, intelligent manufacturing, natural language understanding, speech recognition, computer vision, stock market prediction, disease early detection and diagnosis.", "View requirements for ECE 457B", "It encompasses a broad spectrum of supervised learning topics, including nonparametric and parametric models, linear and nonlinear approaches, deep learning paradigms, and probabilistic models.", "Theoretical knowledge is translated into practice through tutorials on industry-standard tools such as PyTorch and Keras.", "Interactive classroom discussions will pivot around both the practical trade- offs inherent in real-world applications and the theoretical underpinnings that provide an intuitive grasp of the field.", "These topics are an outline, and each year some subset of non-core topics will be skipped due to time constraints and in order to benefit students through deeper focus.", "Classification I", "Distance based - k-Nearest Neighbours (kNN)", "Fundamentals of Parameter Estimation and Learning", "MAP Implementation as Classification: Naive Bayes Algorithm", "Dimensionality Reduction and Manifold Learning", "Vector Embeddings : TF-IDF, Word2Vec, BERT", "Kernel Methods and Latent Models", "k-Means Algorithm, DBScan Algorithm", "Anomaly Detection: Classification, Outlier, Density, and Isolation based", "Classification III : Data, Image and Time-series classification using Deep Learning", "Representation Learning II: Auto-encoders and Variational Auto-Encoders", "Attention and Transformer Networks", "Some additional information and links might be here for older courses.", "A visual grading tool for pdfs submissions of tests and assignments, allows limited online test with mark-down text entry and multiple choice questions.", "Some assignments and tests might be made available online for submission using this tool as well.", "Arxiv Tutorials - pdfs will be posted to hypothes.is and others links will be provided to a number of detailed tutorials on some course topics.", "The first half covers many of basics of this course, while the second half focusses on Deep Learning only.", "Exams", "Completing the assignments will require multiple skills:", "familiarity with statistical, probabilistic analysis of data and results", "logical design and clear description of a expeirmental methodology", "programming various algorithms for processing, training and analysis of data to achieve given tasks (programming will be in Python using libraries such as sci-kit learn and tensorflow, pytorch, pandas)", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 50, "course_code": "ECE 459", "course_name": "ECE459 - Programming for Performance (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["ECE 459", "Monday, Friday -", "08:30AM - 09:50AM E7 5353", "04:00PM - 05:20PM", "Monday, Friday -", "04:00PM - 05:20PM", "11:30AM -", "07:00PM - 07:50PM E7 5353", "07:00PM - 07:50PM E7 5353", "About Prof. Zarnett", "Then I got the AIF in the mail and decided I didn't want to study Computer Engineering after all.", "I'm an Associate Professor of Electrical and Computer Engineering.", "Some of you will know me as the previous Director of Software Engineering from back when you were in 1A. I studied math/CS yet convinced PEO to license me as a P.Eng.", "My research interests focus on using compiler and static analysis techniques to ensure program correctness.", "The LI is responsible for technical matters related to the assignments: git.uwaterloo.ca, git in general, administering the systems where you need to run your labs.", "And I enjoy engaging in discussions about these fields.", "Thanushon Sivakaran <tsivakar@uwaterloo.ca>", "Profiling computer systems; bottlenecks, Amdahl's law.", "View requirements for ECE 459", "Many modern software systems must process large amounts of data, either in the form of huge data sets or vast numbers of (concurrent) transactions.", "This course introduces students to techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs.", "These techniques will enable you to design and build critical software infrastructure, especially in an age of Big Data.", "While you may have seen some of these ideas in the context of operating systems (ECE350/SE350/CS350/MTE241) and concurrency (ECE252/CS343), this course gives you tools to make code run faster.", "Design and apply techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs.", "We intend to use these slots until we reach the end of the course material.", "The notes cite a number of sources, some of which are useful books.", "Rust familiarization and use of nonblocking I/O;", "Auto‐grading and auto‐feedback systems, including marmoset, may be used for the evaluation of some of your assignments.", "Acceptable collaboration includes discussing ideas and structures with others, as well as helping others debug their code.", "If your code is too close in structure to someone else's code, you are going to have a problem.", "Or, let's sum this up in two short instructions:", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, ChatGPT) and how such tools can be used to write and test code.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be diﬃcult to interpret on a discussion forum.", "The human visual system has evolved to perceive saber‐toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text‐mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 52, "course_code": "PLAN 478", "course_name": "PLAN478 - Transit Planning and Operations (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Transit Planning and Operations Winter 2025", "08:30AM - 09:50AM RCH 103", "02:30PM - 03:20PM", "The historical evolution of transit in cities; the technological innovations which made transit possible; and transit mode definitions.", "System operational characteristics are defined and quantitative measures of effectiveness are introduced.", "Methods for selecting appropriate transit modes are covered.", "The focus of this course is on the use of quantitative techniques to analyse and solve problems arising in the planning, design, operation and management of urban public transportation systems.", "Topics include an introduction to public transportation modes, transit performance analysis, fleet sizing and route design; control of transit operations, and paratransit planning, scheduling and dispatching.", "The course also covers various transit modelling issues arising in the Advanced Public Transportation Systems that aim at maximising transit system efficiency and reliability using emerging technologies such as global positioning systems (GPS), electronic fare payment, and automatic passenger counters and pre-trip/en-route passenger information systems.", "The historical evolution of transit in cities; the technological innovations which made transit possible; and transit mode definitions.", "System operational characteristics are defined and quantitative measures of effectiveness are introduced.", "Methods for selecting appropriate transit modes are covered.*eligible for MES", "Classify urban transportation modes by right of way, technology, and service types", "Compute and graph quantitative relationships, including vehicle dynamics and time-space diagrams", "Determine fleet size requirements and schedules for a given route/line or a set of routes/lines", "Understand the range of approaches for estimating transit ridership", "Select the optimal mode for a transportation route based on vehicle characteristics, planning contexts, travel forecasts, and economic factors", "Design a basic transit network with efficient transfers and schedules", "Introduction and History of Public Transit", "Transportation and Transit Planning", "Travel Demand Modeling", "Transit System Characteristics and Performance", "Scheduling", "Network Structures", "Transit System Financing", "The Future of Public Transit", "Submission requirements will be specified for each assignment.", "This course includes the independent development and practice of specific skills, such as evaluating transit data, planning transit routes, and estimating transit ridership.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 53, "course_code": "ME 321", "course_name": "ME321 - Dynamics of Machines and Mechanical Vibrations (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Dynamics of Machines and Mechanical Vibrations Winter 2025", "10:00AM - 11:20AM E7 3343", "E5 3102", "I highly encourage the students to meet with Farid first for their questions.", "Principles of the geometry of motion, uniform and non-uniform motion, linkage, and analysis of mechanisms.", "Consideration of the static and dynamic forces in machines.", "We will study single-degree-of-freedom systems, multiple-degree-of-freedom (lumped mass) systems, and modal analysis for vibration problems in the first part of the course.", "The first part of the course heavily depends on your previous courses in Dynamics, Differential Equations and Linear Algebra.", "You are expected to know/learn MATLAB and Linear Algebra very well.", "This course is very mathematical, but we also discuss some real-life examples of dynamic systems.", "Concepts of degrees of freedom and inversion mechanisms will be discussed.", "Finally, different kinds of gears and the fundamental law of toothed gearing will be discussed.", "Identify different types of mechanisms and their degrees of freedom", "Develop Equations of Motion for linkage mechanisms", "Quantify kinematics and kinetics parameters such as position, velocity, acceleration, force, and momentum for the points in linkage mechanisms", "Identify the geometry of different types of gears", "Formulate the eigenvalue problems and obtain solutions for eigenvalues and eigenvectors for the coupled 2-degree-of-freedom mechanisms", "Obtain solutions to the Ordinary Differential Equations subject to Initial Conditions (I.C.) and harmonic force excitations", "Understand and analyze the concepts of stability in a vibrating system", "Chapters 1.1, 1.2", "Introduction to Vibrations", "Free Response of a Single Degree of Freedom System (SDOF)", "Chapters 1.2 Natural Frequency and Oscillation Period", "Chapters 1.3 Viscous Damping", "- Stability", "Chapters 2.1, 2.2 Forced Response of a SDOF (Harmonic Excitation) Frequency Response Function (FRF)", "Chapters 2.1 Beat Phenomenon", "Chapters 4.1 Vibrations Equations of Motion for Multiple Degree of Freedom Systems (MDOF), 2-DOF", "Chapters 4.1 Modeshapes and Natural Frequencies of MDOF", "Chapters 4.2", "Introduction to Matrix Theory", "Stability of MDOF Systems", "- Singularity and Rigid Body Mode", "-", "Orthogonality of EigenVectors", "Examples", "Makeup lecture #2 at 8:30-9:20 AM in E7 3343", "Chapters 4.3", "Modal Analysis of MDOF", "Decoupled Coordinate Systems", "Chapters 4.5 Viscous Damping in MDOF", "Chapters 4.5, 4.6", "- Frequency Response Functions for MDOF", "- Frequency Response Functions for MDOF", "Makeup lecture #3 at 9:30-10:20 AM in E7 3343", "Introduction to Machines and Mechanisms", "Chapters 1.6", "Introduction to Machines and Mechanisms (Cont’d.)", "Inversion", "Chapters 1.7.1 Grashof condition", "Chapters 4.1, 4.2", "Analytical Kinematic Analysis of Planar Mechanisms", "Chapters 4.3", "Analytical Kinematic Analysis of Mechanisms (Cont’d.)", "One-loop mechanisms", "Chapters 9.1, 9.2, 9.3", "Analytical Kinetic Analysis of Mechanisms", "Chapters 9.1, 9.2, 9.3", "Analytical Kinetic Analysis of Mechanisms (Cont’d.)", "Chapters 5.1, 5.2", "Chapters 5.3, 5.4", "January 17th: Makeup lecture #1 at 9:30-10:20 AM to be held in E7 3343", "February 7th: Makeup lecture #2 at 8:30-9:20 AM to be held in E5 3343", "March 7th: Makeup lecture #3 at 9:30-10:20 AM to be held in E5 3343", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 55, "course_code": "MSE 343", "course_name": "MSE343 - Human-Computer Interaction (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Human-Computer Interaction Fall 2024", "10:00AM - 11:20AM QNC 2502", "10:00AM - 11:20AM QNC 2502", "11:30AM - 12:20PM QNC 2502", "This course is designed to provide in-depth exposure to the concepts of human-computer interaction and methods of interactive information system design.", "The course will focus on techniques for building information systems that meet human needs and capabilities by following a system development lifecycle: user requirements analysis, information and interaction design, prototyping and evaluation.", "View requirements for MSE 343", "Explain and justify the benefits and drawbacks of user-centred design", "Describe guidelines and models that can be applied to interface design", "Apply a variety of methods to involve the people who use an application in the design process", "Evaluate the usability of an interface", "Explain and justify the benefits and drawbacks of user-centred design 1 KB c) Demonstrate understanding of engineering fundamentals.", "Describe guidelines and models that can be applied to interface design 1 KB d) Demonstrate understanding of specialized engineering knowledge", "Apply a variety of methods to involve the people who use an application in the design process 4 Des b) Generate and implement solutions to complex open-ended problems", "Evaluate the usability of an interface 4 Des c) Evaluate/test solutions and refine designs to better meet requirements", "Process and Requirements", "Introduction to HCI Chapters 1 & 9", "User-centred design Course Notes", "Gathering Requirements and Task-centred design Chapter 10", "Designing Alternatives + Prototyping", "Interface Types & Graphical screen design Chapter 6", "Evaluate", "Evaluating Interfaces with Users: Qualitative Methods Chapters 13 & 7", "Analytical Evaluation: Heuristic Evaluation & Fitts’ Law Chapter 15", "Social & Emotional Interaction Chapter 4 & 5", "Psychology of everyday things & Cognition Chapter 3 & Notes", "Interaction Design: Beyond human computer interaction, 4th edition.", "You will be working in a team of three to five for all these milestones.", "There will be a set of online and in-person activities taking the place of the lab session in this course.", "You can complete these by simply attending class and participating in the activities; there will be a time limit to submit your materials.", "Up until the date of the final exam, you may submit any submitted material for regrading under the following conditions:", "(Ask them first!)", "Extensions", "No extensions will be given after a submission date.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 59, "course_code": "MTE 241", "course_name": "MTE241 - Introduction to Computer Structures and Real-Time Systems (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Computer Structures and Real-Time Systems Fall 2024", "08:30AM - 09:20AM E7 3343", "08:30AM - 10:20AM E7 3343", "M. Cooper-Stachowsky", "MTE 241 202", "M. Cooper-Stachowsky", "M. Cooper-Stachowsky", "11:30AM -", "12:20PM E7 3343", "All software and also the law and ethics course one time -- let's discuss contract law if you're up for it?", "Mike Cooper-Stachowsky -- mstachowsky@uwaterloo.ca", "Introduction to computer organization, basic real-time concepts, process management, interprocess communication and synchronization, memory management, resource management, interrupt handling, concurrent programming, file systems.", "View requirements for MTE 241", "Describe the basic components of a computer system [KB(I)]*", "Perform Memory-Mapped I/O [KB(D)]", "Program a real-time application with multiple coordinated tasks [Des(D),Tools(D)]", "STM32F401RE Nucleo Board A microcontroller board for the labs.", "A Practical Introduction to Real-Time Systems For Undergraduate Engineering It's the textbook, available free in PDF form: https://ece.uwaterloo.ca/~dwharder/icsrts/Lecture_materials/A_practical_introduction_to_real-time_systems_for_undergraduate_engineering.pdf No", "Available for free in PDF form: https://github.com/jzarnett/mte241/ Yes", "You should purchase this board well in advance of the first lab and install the STM32CubeIDE software to test that it works.", "A small number of lab computers will have the software installed for your use.", "You will use the STM32F401RE microcontroller board and the STM32CubeIDE to write a real-time operating system in the C language.", "The questions are designed to test your understanding of the concepts you should have learned in the lab.", "Exams are in-person, closed-book.", "This paper must be a standard letter size.", "Laptop and Device Policy: The human visual system has evolved to perceive saber-toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text-mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "In either case, we will cancel all the in-person lectures and in-class exercises during the relevant period and try to have some online synchronous video lectures during that period.", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, Chat- GPT) and how such tools can be used to write and test code.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 63, "course_code": "SYDE 334", "course_name": "SYDE334 - Applied Statistics (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Applied Linear Models Winter 2025", "08:30AM - 09:50AM MC 4020", "02:30PM - 03:20PM", "RCH 101", "Thursdays from 3:00-4:00pm in M3 3021", "Modelling the relationship between a response variable and several explanatory variables (an output-input system) via regression models.", "Model diagnostics and improvement.", "Algorithms for variable selection.", "Review of basic Normal theory, t, chi-squared, and F distributions.", "Simple linear regression.", "Analysis of variance.", "Multiple linear regression, variable selection techniques, indicator variables, diagnostics.", "Brief introduction to non-linear regression, factorial experimentation.", "Registered students can enroll in the class discussion board through Piazza.", "Search for your question first before posting.", "Do not expect a full solution to your question.", "To help maintain a safe, respectful, and productive community in which we – students and teaching team alike – can take risks in our learning/teaching, tackle challenging concepts, and ultimately grow as learners, we should endeavor to follow these mutual expectations:", "Explain the main concepts of linear regression models.", "Understand the methods of least squares and maximum likelihood estimation for model parameters.", "Interpret the model and its parameters (e.g., regression coefficients) in the context of any application.", "Draw inferences from a fitted model about the parameters of interest and make predictions.", "Apply the previous two outcomes when fitting linear models to real data using R.", "Assess model quality by diagnosing violations in underlying model assumptions (and identify strategies for improvement).", "Evaluate competing fitted models built using various model selection methods (and choose between them).", "Introduction", "The Straight Line Model", "Model formulation and interpretation", "Least squares estimation", "Mean response and residual variance estimation", "Introduction to R/RStudio", "Maximum likelihood estimation", "Estimators and their properties", "Important distributions", "Distributions of estimators", "Confidence intervals", "O - Ch. 2-4", "Straight Line Model in R", "Prediction intervals", "Intervals in R", "Hypothesis testing", "O - Ch. 4-5", "ANOVA and F test", "Model limits", "Data transformations", "O - Ch. 4-6", "O - Ch. 7", "A1 and Q1 Solutions", "Multivariate normal distribution", "The Linear Model", "Examples", "O - Ch. 8-9", "Estimation", "Estimators and their properties", "Distributions of estimators", "O - Ch. 9, 11, 12", "ANOVA and F test", "Significance tests", "General linear hypothesis", "O - Ch. 9, 11, 12", "A2 and Midterm Solutions", "Case Study: South African heart disease", "Nested models", "Additional sum of squares", "O - Ch. 12", "Outliers", "O - Ch. 13-14", "Influence", "O - Ch. 14-15", "A3 and Q2 Solutions", "One-variable-at-a-time selection methods", "Criteria-based selection methods", "O - Ch. 16", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solve exercises from the textbook on your own.", "Introduction to Regression Modeling by Abraham and Ledolter This textbook is an optional reference book (available for free on LEARN).", "R and R-Studio Free software.", "To serve as an opportunity to demonstrate your understanding, application, and integration of the course material, including practical application of the skills/concepts with the statistical software, R.", "Missed Assignment: The time window to complete these assessments are generous and, in general, a sickness lasting a couple of days will not be enough of a reason to ask for alternative accommodations and/or extension.", "Tips for Success", "Students should critically compare their work with available solutions and against the solutions of fellow classmates.", "Notice of Recording", "To help you decide if you should isolate, you can use the provincial self-assessment tool.", "In the scenario where we must transition back online the following contingencies will be used:", "These materials are made available for the personal use of students registered in the current offering of this course.", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical proofs and the fitting, interpretation, and assessment of linear models in real applications.", "Library for research-based assignments"]}, {"course_id": 70, "course_code": "SYDE 544", "course_name": "SYDE544 - Biomedical Measurement and Signal Processing (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Biomedical Measurement and Signal Processing Winter 2024", "01:30PM - 03:20PM", "steven.pretty@uwaterloo.ca", "Email: spretty@uwaterloo.ca", "Signal processing techniques will be discussed in the context of extraction and application of useful biomedical signals.", "Prereq: One of BIOL 273, BME 284, SYDE 384/584; Level at least 3A Biomedical Engineering or Level at least 3B Systems Design Engineering or Level at least 3B Honours Life Physics (Biophysics Specialization)", "Understand and describe theoretical concepts underlying biomedical signal acquisition and analysis (CEAB 1)", "Solve problems and perform investigations utilizing biomedical signal measurement and analysis approaches (CEAB 2 & 3)", "Work in a team to effectively communicate biomedical signal concepts and applications in both verbal presentations and written reports (CEAB 6 & 7)", "Knowledge Base Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "2. Problem Analysis An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "7. Communication Skills An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Three hours of lectures per week, which will cover the pertinent theoretical concepts and provide solutions to relevant exercises:", "N/A Jan 11th Introduction & Overview", "4 Jan 18th Mathematical Model of a Spiking Neuron", "7 Jan 25th Electrode-Electrolyte Interfaces & Half-Cell Potentials", "8 Jan 25th Electrode-Electrolyte Interfaces & Half-Cell Potentials", "Electrode Model & Electrode-Skin Interface", "Op-Amps & Bio-Potential Amplifier Design", "Op-Amps & Bio-Potential Amplifier Design", "Coupling to the Environment & Electrical Safety", "20 Mar 1st EMG Introduction", "23 Mar 8th EMG Decomposition", "25 Mar 14th Myoelectric Control & Pattern Recognition", "26 Mar 15th EMG Driven Musculoskeletal Modelling", "27 Mar 21st Heart Anatomy and Function", "28 Mar 21st Heart Conduction System and ECG", "Apr 8th Reserved for Make-Up Presentations", "Dayan & Abbott (2001)", "Theoretical Neuroscience", "Clifford (2006) Advanced Methods and Tools for ECG Data Analysis", "Rowan & Tolunsky (2003) Primer of EEG with a Mini-Atlas", "An Introduction to the Event-Related Potential Technique", "These tests will be non-cumulative and assess the following content:", "A help session for each assignment will be scheduled during the tutorial time most closely corresponding with the conclusion of a module.", "Presentations should be ~15 minutes in length followed by up to 5 minutes of discussion.", "Include ‘SYDE544’ and a description of the email in the subject line", "Include your first and last name as well as student number in your signature", "This course includes the independent development and practice of specific skills, such as generating summaries of scientific literature.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 71, "course_code": "SYDE 548", "course_name": "SYDE548 - User Centred Design Methods (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["User Centred Design Methods Winter 2025", "UCD Mentors Pronouns Email Office Extra Help", "This course approaches the design of tasks, tools, products, and systems from a user-centered design perspective.", "Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process.", "Major topics include user research methods for usability and user experience, inspection methods, user testing, applied statistical analysis.", "SYDE 548 (UCD Methods) approaches the design of tasks, tools, products, and systems from a user-centered design perspective.", "Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process.", "Major topics include user research methods for usability and user experience, inspection methods, user testing, and applied statistical analysis.", "SYDE 548 User-Centred Design Methods is a technical elective.", "It builds from earlier SYDE core courses in design (SYDE-BME 161 Introduction to Design, SYDE-BME 162 Human Factors in Design, and SYDE-BME 361 Engineering Design).", "Motivated students willing to become familiar with basic human factors engineering can participate and contribute to course activities.", "Whether you are interested in becoming a UCD specialist, a certified ergonomist, or just want to be a wise designer or consumer, this course will supply you with a range of practical tools (methods).", "Our “In-class” sessions are used as workshops for interactions and hands-on skill development with different UR methods.", "Engineering Graduate Attribute]", "(A) Describe ethical UCD methods used for formal and informal design assessments with human participants.", "(B) Investigate & select appropriate ethical & equitable UCD methods for specific design situations.[2a, 3b, 10b]", "(C) Apply UCD method protocols to instructor-defined design situations.", "(D) Modify UCD method protocols to collect data for a student-defined design project.", "(E) Select and apply appropriate statistical analysis for given UCD data.", "(F) Design ethical UCD test plans for instructor-defined design situations.", "(G) Create User Research Portfolios describing ethical UCD methods, protocols, and lessons learned.", "CEAB Engineering Graduate Attribute", "Knowledge Base for Engineering", "2. Problem Analysis", "Data Analysis Quizzes,", "4. Design", "-", "Impact of Engineering on Society and the Environment", "Ethics & Equity", "Economics & Project Management", "-", "2. Situations of Concern, Design Impacts & Personas Quantifying Usability; Standard UX Questionnaires;", "SUS Scoring (standard and positive versions)", "3. Design Ethnography: UR Safaris & Secondary Research.", "Interviews & Distress Protocols.", "5. Thematic Analysis Methods - Part 1 Thematic Analysis Methods - Part 2", "Formative Design Walkthroughs & Estimating Formative Sample Sizes.", "UR Methods & GenAI Revisited.", "Quantifying the User Experience: Practical statistics for user research.", "An e-copy of the 1st edition can be accessed through UW Library Reserves.", "The User Experience Team of One: A Research and Design Survival Guide. 2nd edition.", "Hanington, B. & Martin, B (2019) Universal Methods of Design (Expanded & Revised): 125 Ways to research complex problems, develop innovative ideas, and design effective solutions.", "An e-copy of the 1st edition can be accessed through UW Library Reserves No", "Design Materials (for workshops, data collection, and analysis).", "The number of students who can access an e-copy at a given time may be limited.", "Since user-centred design and user research skills are valued by industry, it is important that each student submits original work and demonstrates their own value-added UR skills to earn credit for the course.", "Intellectual property includes items such as:"]}, {"course_id": 77, "course_code": "SYDE 584", "course_name": "SYDE584 - Physiological Systems and Biomedical Design (0.50)", "term_name": "Technical Electives List", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Physiological Systems and Biomedical Design Winter 2025", "04:30PM - 05:20PM", "04:30PM - 05:20PM", "Email: maud.gorbet@uwaterloo.ca", "Email: gganjikho@uwaterloo.ca", "The structure, functions, and properties of major physiological systems (e.g., musculoskeletal, nervous, cardiovascular, and respiratory) will be presented in relation to modelling physiological systems and the design of biomedical devices (imaging, assistive, and diagnostic).", "The structure, functions and properties of some of the major physiological systems (musculoskeletal, nervous, and cardiovascular) will be presented with an engineering science perspective.", "Strong emphasis will be given to mechanical, electrical, chemical and biological properties of tissues and their relation to measurements, modeling human systems, and the design of biomedical devices (assistive, orthopedic and diagnostic).", "Various aspects of physiological system dysfunctions and how they influence measurements and design of medical devices will be discussed.", "Learn and integrate basics of human physiology", "Develop an engineering perspective toward understanding biological functions", "Develop critical thinking skills for solving biomedical problems and designing sound biomedical technologies", "Describe the components/structures of the studied physiological systems (1d)", "Identify the relationship between structure and functions in physiological systems (1d, 3b, 3c)", "Interpret experimental results (graphs, tables, raw data) to evaluate the effects of disease, aging or a medical device on structure and/or function of physiological systems (3c)", "Evaluate biomedical engineering solutions by applying your knowledge of physiology and the scientific methods (2c)", "Develop reasoned solutions to address biomedical problems by applying your knowledge of physiology and engineering principles while considering social-economical-ethical impacts (4b, 4c, 9a, 9b)", "1 Knowledge Base 1d - Demonstrate understanding of specialized engineering knowledge", "2 Problem Analysis 2c - Critically evaluate solutions of engineering problems", "3 Investigation 3b - Gather information from relevant sources to address complex engineering problems", "3c - Synthesize information from multiple sources to reach valid conclusions", "4 Design 4b - Generate and refine potential solutions to complex, open-ended design problems", "4c - Critically evaluate and compare design choices", "9b - Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations in making decisions", "Week  Date  Topics (physiology & biomedical applications) Learning assessment", "Membrane potential, membrane transport and biological system communications.", "Implications in disease and diagnostics.", "Applications to biomedical engineering.", "Biomedical applications in bone and connective tissues", "7 Feb 24 & Feb 26", "Electrodes for Brain-computer Interface", "9 March 10 & March 12", "Engineering a heart and heart valves", "10  March 17 & March 19", "March 19: LEC & TUT Cancelled (symposium week)", "March 24 & March 26", "Muscle tissue 1: structure and functions", "These will be short and will contain up to 20 multiple choice questions.", "No late submission and no make-up quiz will be organized.", "There will be some opportunities to complete some of these activities remotely in case you were unable to attend.", "These will be also used by Prof Gorbet to evaluate comprehension of concepts and common misunderstandings.", "0 - Submission missing", "1.5 - Good submission: submission demonstrates a clear effort in applying course concepts and/or critical thinking", "Research and design project outline proposals", "The research & design outline proposals are expected to be done in pairs, and will relate to the study of a disease or aging and proposing a novel biomedical solution to characterize, support or replace the affected physiological structure or function.", "Library for research-based assignments", "Email Communication", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Visit them at www.uwaterloo.ca/wcc.", "Course and Departmental Expectations in SYDE", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}]