[{"course_id": 27, "course_code": "GEOG 305", "course_name": "GEOG305 - Fluvial Geomorphology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["RCH 211", "Emphasis on concepts related to fluvial processes, river mechanics, the relationship between environmental change and river regime.", "Fluvial geomorphology is the scientific study of river landforms and the processes that create them.", "A working knowledge of fluvial processes has important practical environmental science, watershed management and engineering applications and is relevant to many other fields of environmental enquiry such as environmental engineering, watershed planning, source water protection, forestry, and risk management.", "This course will examine a range of physical and chemical processes that create micro and macro-scale landforms over a range of spatial and temporal scales.", "Implications of these processes for environmental management in the context of environmental change will be considered.", "To understand basic fluvial geomorphic processes and their role in landform development and change", "Why study rivers?", "Sept 16              Landscapes and Rivers", "Inputs, outputs and storage", "Types of systems", "Fluvial system variables", "Spatial and temporal scales", "Concept of equilibrium", "Feedback, thresholds and equilibrium – Southern Rockies case study", "Flow generation and hydrological pathways", "Storm hydrograph and drainage basin response", "Discharge Measurement and Streamflow Analysis", "Floods", "Bankfull discharge", "Flood magnitude and frequency", "Regional flood frequency curves", "Rills and gullying", "Soil erosion models", "Modes of sediment transport in rivers", "Sediment storage and delivery ratio", "Flow in river channels", "Driving and resisting forces", "Channel parameters", "Concept of flow continuity", "Flow, channel and boundary resistance", "Subcritical, critical and supercritical flow", "Boundary layer", "Concept of stream power", "Work, energy and stream power", "Erosion in bedrock channels", "Erosion in alluvial channels", "Sediment supply and transport rates", "Driving variables", "Boundary conditions", "Nature of change", "System response", "https://uwaterloo.kanopy.com/video/return-river-0", "Dec 2                  Impact of climate change on river systems", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 35, "course_code": "BIOL 450", "course_name": "BIOL450 - Marine Biology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Know and describe the ecology and evolution of marine organisms in the context of the habitat that they occupy and the selection pressures that have led to these adaptations.", "The textbook provides extra material that will enhance the student learning experience and understanding as it will expand on key concepts that we cover in class.", "Exams Format- The format for both the midterm and final exam may be multiple choice, true/false, matching, and short answer questions.", "I will first post the questions and give you a few days to go over them, and then post the answers.", "These recap sessions will be during class time and are an opportunity for us to go again together over concepts that require further clarification.", "Note that these recap sessions ARE NOT intended to go over again entire lecture topics so please be specific with what you are asking (you can point to specific slide numbers if easier).", "If I don’t get a lot of questions for these recap sessions, then we will move over to new material so please make sure to attend those sessions.", "Notice of Recording", "Do not share these with any third-party sites or on social media.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 38, "course_code": "EARTH 456", "course_name": "EARTH456 - Numerical Methods in Hydrogeology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Numerical Methods in Hydrogeology Winter 2025", "An introduction to the theory and practice of groundwater flow and contaminant transport modeling.", "Topics related to variably-saturated flow will focus on derivation of Richard's equation, a control volume finite difference discretization, assembly and solution of the flow equation, material balance error, truncation error analysis, stability and monotonicity.", "Explain the fundamental theory behind groundwater flow and contaminant transport modeling", "Apply numerical techniques, including control volume finite difference discretization, to solve groundwater flow and contaminant transport equations.", "Analyze numerical model accuracy, including material balance error, truncation error, stability, and monotonicity in variably-saturated flow and contaminant transport problems.", "Use a modeling software to model variably-saturated flow and contaminant transport.", "Interpret and visualize groundwater flow and contaminant transport model results and communicate findings effectively.", "Identify the concepts of groundwater and solute transport modeling and their real-world applications.", "Section 1.1 Derivation of Richards' Equation", "Section 1.2 Derivation of Richards 'Equation – Pressure Head Formulation", "Section 1.3 Three-Dimensional Groundwater Flow", "Derive and interpret three-dimensional groundwater flow dynamics and their mathematical representation.", "Section 1.4 Control Volume Finite Difference Discretization for Flow", "Section 1.5 A Rigorous Derivation of the Control Volume Finite Difference Discretization", "Develop, apply, and justify control volume finite difference discretization techniques for groundwater flow problems, demonstrating a rigorous understanding of mathematical principles.", "Assemble and implement saturated groundwater flow equations in numerical models using discretized formulations.", "Assemble the saturated groundwater flow equation using control volume discretization.", "Analyze groundwater flow material balance errors and their implications for numerical model accuracy.", "Section 1.8 Truncation Error Analysis", "Section 1.8 Truncation Error Analysis", "Section 1.9 Stability and Monotonicity", "Section 2.1 Derivation of the Contaminant Transport Equation", "Analyze the stability and monotonicity of numerical methods for groundwater flow models.", "Derive the contaminant transport equation and articulate its role in modeling solute movement through porous media.", "Section 2.1 Derivation of the Contaminant Transport Equation", "Section 2.2 Control Volume Finite Difference Discretization of the Contaminant Transport Equation", "Section 2.3 Central Spatial Weighting of Advective Flux", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Apply control volume finite difference discretization to the contaminant transport equation for numerical modeling.", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Section 2.4 Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.5 Upstream Spatial Weighting of Advective Flux", "Section 2.5.1 Truncation Error of Upstream Spatial Weighting", "Section 2.6 Crank-Nicolson Temporal Weighting with Upstream Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.7 Assembly of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.7.1 Monotonicity of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.8 Assembly of Fully-Implicit Temporal Weighting with Upstream Spatial Weighting", "Section 2.8.1 Monotonicity of Upstream Spatial Weighting with Fully-Implicit Temporal Weighting", "Section 2.9 Boundary Conditions for Transport Coupled to Flow", "Analyze the accuracy of various contaminant transport weighting schemes and their impact on numerical model performance.", "Apply boundary conditions for contaminant transport coupled with groundwater flow and assess material balance errors to ensure reliable numerical simulations.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "The total maximum bonus points that can be earned across all five assignments is five.", "Students can earn bonus points by actively participating in discussions or helping their peers understand the course material and assignments.", "Explaining a challenging concept to peers in a collaborative study session.", "A maximum of five contributions will be allowed per assignment."]}, {"course_id": 43, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 3, "major_name": "Environmental Sciences - Water Science Specialization (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 0, "course_code": "ENVS 200", "course_name": "ENVS200 - Field Ecology (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["Field Ecology Winter 2025", "**We aim to respond to forum posts and necessary emails within general workday hours (8:30 AM – 4:30 PM) and within 24hrs, except over weekends and holidays.", "Introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "View requirements for ENVS 200", "Such knowledge, called ecoliteracy, will provide a critical basis for your engagement in the 21st century, the “century of the environment”—not least because so many of the environmental issues we face derive in part from a limited understanding of how we are embedded within and dependent upon ecological systems.", "Field ecology necessarily harbours an ethical component both because of our natural affinity for life (or ‘biophilia’) and because questions of ecological ‘impact’ and 'quality’ are necessarily value-laden.", "In summary, this course introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "By the end of this course, you should be on a path to life-long learning as an ecologically-literate citizen.", "Demonstrate how these principles apply to real-world situations (in context of lab activities, assignments, and labs), including human interactions with the natural world.", "Articulate the elements of scientific inquiry as they apply to ecology/", "These course learning outcomes will not only prepare you to be an informed citizen and member of the community of life on earth, but also provide the basis for knowledge, humility, and wisdom in your dealings with ecological problems in your daily life and eventual career.", "Week Number", "Introduction and indicator species: Bird identification Lab 1:  Survey completed and submitted in lab (2%)", "3. Jan 21 *Conditions and Resources; Climate and Biomes", "You should review the course “reading guide” in LEARN before reading because you are not responsible for all textbook sections and vocabulary.", "demonstrate how these principles apply to real-world situations, including human interactions with the natural world Readings, Labs, Discussion board Weekly lecture quizzes and activities, exams, lab activities, discussion forums", "These experiences are intended to help you apply ecological concepts in real-world contexts while building valuable field skills.", "Simply missing a deadline and later mentioning registration with Accessibility Services will not be considered sufficient.", "Appeals and grievance", "Availability for exams", "These slides are meant to be a template for your note-taking: they will not replace careful attention, note-taking and participation.", "Along with the University of Waterloo and the Faculty of Environment and its Departments, I consider your well-being to be extremely important.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "However, there may be instances during lectures where AI usage is allowed after receiving clear verbal permission from the professor.", "Students are responsible for following these guidelines and seeking clarification when needed.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 2, "course_code": "GEOG 209", "course_name": "GEOG209 - Hydroclimatology (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["08:30AM - 10:20AM EV2 2002", "Dr. Richard Petrone                                                                                       Winter 2025", "Lab Co-ordinator:", "TBA", "An introduction to the fundamental processes governing climate and hydrological systems and the links between them.", "It starts with a discussion of basic atmospheric and hydrological processes and traces the flow of energy and water between the earth's surface and the atmosphere.", "This course provides students with a thorough background of the fundamental processes governing the climate and hydrological systems, and the links between them.", "The course first reviews fundamental atmospheric and hydrologic processes, and traces the flow of energy and water between the Earth’s surface and the atmosphere.", "Through the use of group activities students will be given the opportunity to gain experience manipulating real hydrological and meteorological data and instrumentation.", "This course will serve as an introduction to near-surface hydroclimatic processes, their feedbacks and climate change, forming essential background for upper level courses in climate change, hydroclimatology and environmental sciences and studies in general.", "The fundamental knowledge and skills developed in this course will provide students with the basis to appreciate and understand the natural hydrologic and climate systems.", "It also provides the required foundation for advanced courses in climatology and hydrology.", "The objective of this course is to provide students with the background to further their interests in weather and climate, and provide the theoretical foundations for upper level science and management courses.", "To identify the key boundary layer processes that drive the hydroclimate system.", "To identify and evaluate the characteristics of different land-use types and ecosystems that drive their hydroclimatic regimes.", "Introduction to Hydroclimatology", "Evapotranspiration", "Climates of Natural Surfaces and Vegetation Effects", "Floods and Drought", "Ecology – Hydroclimate Linkages – Water and Carbon Exchange", "Landuse Change and Hydroclimatic Effects", "SVAT modelling", "Tutorial rooms and groups will be determined in the first week of lectures.", "Feb. 3              Lab #2 – Streamflow & Climate assignment introduced & Lab #1 handed in", "March 10         Lab #3 – Energy Balance & Evapotranspiration assignment introduced and Lab #2 handed in", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 6, "course_code": "GEOG 368", "course_name": "GEOG368 - Ecology and Conservation for Planning (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["Ecology and Conservation for Planning Winter 2025", "02:30PM - 05:20PM", "This course provides students with a critical understanding of the relationship between human development and natural environments.", "Students will develop an understanding of core ecological principles and how these can be taken up in plans and policies to promote nature conservation in urban and rural environments.", "The course will include examples of how planners mitigate the environmental impacts of development of land, allotment of open space and parks, and conservation of sensitive areas and species in both urban and rural contexts.", "understand biophysical and ecological processes in urban areas", "plan for biophysical and ecological process when developing and managing the built environment", "Overview of syllabus and foundational concepts", "Get into groups and choose case study for weekly activities and final project", "Spatial patterns and mosaics", "Urban water systems and water bodies", "Urban habitat and vegetation", "Urban features", "Readings", "The ecological and evolutionary consequences of systemic racism in urban environments.", "ECOLOGICAL URBANISM: A FRAMEWORK FOR THE DESIGN OF RESILIENT CITIES Yes 0", "Each quiz corresponds to the theme for each week.", "The first will critically engage with a recent and important contribution from Schell et al.", "Each Reflection Paper should be approximately 500 to 1,000 words and should answer the following questions:", "The case study should describe each of the focal ecological components of the city and develop a plan to improve or enhance the sustainability of these components.", "These will vary week to week, but are designed to prepare students to complete their case study assignment.", "The complete style outline can be found in the Publication Manual of the American Psychological Association, located in the reference section in Dana Porter Library, or on sale in the Book Store.", "APA Frequently Asked Questions - http://www.apastyle.org/learn/faqs/", "University of Wisconsin-Madison Writing Centre: http://www.writing.wisc.edu", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 8, "course_code": "PLAN 341", "course_name": "PLAN341 - Ecology and Conservation for Planning (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["Ecology and Conservation for Planning Winter 2025", "02:30PM - 05:20PM", "This course provides students with a critical understanding of the relationship between human development and natural environments.", "Students will develop an understanding of core ecological principles and how these can be taken up in plans and policies to promote nature conservation in urban and rural environments.", "The course will include examples of how planners mitigate the environmental impacts of development of land, allotment of open space and parks, and conservation of sensitive areas and species in both urban and rural contexts.", "understand biophysical and ecological processes in urban areas", "plan for biophysical and ecological process when developing and managing the built environment", "Overview of syllabus and foundational concepts", "Get into groups and choose case study for weekly activities and final project", "Spatial patterns and mosaics", "Urban water systems and water bodies", "Urban habitat and vegetation", "Urban features", "Readings", "The ecological and evolutionary consequences of systemic racism in urban environments.", "ECOLOGICAL URBANISM: A FRAMEWORK FOR THE DESIGN OF RESILIENT CITIES Yes 0", "Each quiz corresponds to the theme for each week.", "The first will critically engage with a recent and important contribution from Schell et al.", "Each Reflection Paper should be approximately 500 to 1,000 words and should answer the following questions:", "The case study should describe each of the focal ecological components of the city and develop a plan to improve or enhance the sustainability of these components.", "These will vary week to week, but are designed to prepare students to complete their case study assignment.", "The complete style outline can be found in the Publication Manual of the American Psychological Association, located in the reference section in Dana Porter Library, or on sale in the Book Store.", "APA Frequently Asked Questions - http://www.apastyle.org/learn/faqs/", "University of Wisconsin-Madison Writing Centre: http://www.writing.wisc.edu", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 10, "course_code": "PLAN 353", "course_name": "PLAN353 - Spatial Analysis (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["Notice of Recording", "Spatial Analysis Winter 2025", "Email:                     dtrobins@uwaterloo.ca", "Email:                      lqzhao@uwaterloo.ca", "Advanced quantitative analysis in a spatial context.", "Today, spatial analysis is mainly based on statistical techniques and geoprocessing using geographic information systems (GIS).", "The spatial character of data implies several methodological challenges in spatial data analysis especially related to the spatial dependence of the data, which often invalidates non-spatial modeling and evaluation approaches and leads to special techniques for spatial sampling and spatial regression modeling.", "In addition, selected topics such as spatial data mining and spatial analysis software may be addressed, depending upon the progress of the course.", "Several real-world applications of spatial analysis techniques will be discussed and provide context for course assignments.", "develop a general understanding of a variety of spatial modelling techniques", "interpret and critically discuss spatial models and their results", "The lecture will be used to introduce the theory and concepts behind spatial analysis methods as well as to demonstrate techniques that will aid the completion of lab assignments.", "1  Jan 8 Introduction to Spatial Analysis 1, 2", "Feb 12 Describing and Analyzing Fields 9", "7  Feb 26 Describing and Analyzing Fields  9, 10", "10  Mar 19 Landscape Metrics and Applications of Spatial Analysis", "Spatial Data Analysis: an Introduction for GIS Users.", "Principles of Geographical Information Systems.", "Assignments commence in the second week of the course but the first week will require students to setup a workflow for using Jupyter Notebooks on the Math Faculty Jupyter Hub, which can be found here: https://jupyter.math.uwaterloo.ca/hub/login", "There are no serious programming requirements or extensive prior knowledge of geographic information systems to complete the assignments in this course.", "The notebooks will guide you through the technical steps and students will adjust notebook content/code to improve their understanding about the statistical and spatial analysis concepts discussed in the course.", "Notice of Recording", "Community of Learners", "A goal for this course is that we shall all contribute to a climate that promotes a Community of Learners.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "This course includes the independent development and practice of specific skills, such as analyzing spatial data, summarizing data for reporting results, or putting together statistical models.", "Library for research-based assignments", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 16, "course_code": "GEOG 305", "course_name": "GEOG305 - Fluvial Geomorphology (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["RCH 211", "Emphasis on concepts related to fluvial processes, river mechanics, the relationship between environmental change and river regime.", "Fluvial geomorphology is the scientific study of river landforms and the processes that create them.", "A working knowledge of fluvial processes has important practical environmental science, watershed management and engineering applications and is relevant to many other fields of environmental enquiry such as environmental engineering, watershed planning, source water protection, forestry, and risk management.", "This course will examine a range of physical and chemical processes that create micro and macro-scale landforms over a range of spatial and temporal scales.", "Implications of these processes for environmental management in the context of environmental change will be considered.", "To understand basic fluvial geomorphic processes and their role in landform development and change", "Why study rivers?", "Sept 16              Landscapes and Rivers", "Inputs, outputs and storage", "Types of systems", "Fluvial system variables", "Spatial and temporal scales", "Concept of equilibrium", "Feedback, thresholds and equilibrium – Southern Rockies case study", "Flow generation and hydrological pathways", "Storm hydrograph and drainage basin response", "Discharge Measurement and Streamflow Analysis", "Floods", "Bankfull discharge", "Flood magnitude and frequency", "Regional flood frequency curves", "Rills and gullying", "Soil erosion models", "Modes of sediment transport in rivers", "Sediment storage and delivery ratio", "Flow in river channels", "Driving and resisting forces", "Channel parameters", "Concept of flow continuity", "Flow, channel and boundary resistance", "Subcritical, critical and supercritical flow", "Boundary layer", "Concept of stream power", "Work, energy and stream power", "Erosion in bedrock channels", "Erosion in alluvial channels", "Sediment supply and transport rates", "Driving variables", "Boundary conditions", "Nature of change", "System response", "https://uwaterloo.kanopy.com/video/return-river-0", "Dec 2                  Impact of climate change on river systems", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 17, "course_code": "GEOG 309", "course_name": "GEOG309 - Physical Climatology (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["Office Hours and email communications: TBA (each TA will be responsible for particular assignment)", "Topics include radiation and energy balances, general circulation patterns, synoptic development and micro-climatology.", "Climate change and climate variability", "Fundamentals of global warming", "The concepts of feedbacks", "Climate change and human dimensions", "How to explain the issues of climate change and variability ideas to others with confidence and persuasion", "Climate Change and Variability", "Human Dimension", "Weather Systems and Synoptic Development (Part 1) 273-295 299-325 262-285 287-313 Ch. 9,10", "Weather Systems and Synoptic Development (Part 2)", "Any earlier edition is good but the page numbers in the outline will not be correct for other editions than the fifth and seventh.", "Understand physical processes of climate and weather Lectures and Text readings", "Analysis of Weather events during the course", "Analysis of Sequence of Weather Maps", "(Working as groups of 6-8 and explain the sequence and processes of weather in Southern Ontario)", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "This course includes the independent development and practice of specific skills, such as Assess public debate on Climate Change and Variability.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 18, "course_code": "GEOG 320", "course_name": "GEOG320 - The Cryosphere (0.50)", "term_name": "Required Courses", "program_name": "Geography and Aviation", "program_id": 70, "major_id": 2, "major_name": "Earth Systems Science Specialization", "topics": ["04:30PM - 05:20PM", "EV2 1002A", "This course provides a comprehensive overview of the cryosphere and cryosphere-atmosphere interactions.", "Topics covered include the material and thermodynamic properties of snow and ice, the role of the cryosphere in weather and climate, and the response of the cryosphere to climate change (past, present, and future).", "Describe the fundamental material properties of snow and ice, including crystal structures, phase transitions, and thermodynamic behavior, and relate these properties to cryospheric processes.", "Explain the role of the various elements of the cryosphere in weather and climate.", "Explain the response of the various elements of the cryosphere to changing weather and climate.", "Explain the impacts of climate change on the cryosphere, both in terms of observed trends and projected future changes, considering the implications for sea level rise, freshwater resources, and polar ecosystems.", "Identify historical and state-of-the-art datasets, including field observations and remote sensing data, needed to document the current state of the cryosphere.", "Identify field instruments for measuring cryospheric parameters, such as snow depth, ice thickness, and permafrost temperature.", "Conduct basic simulations with cryosphere process models, such as snow and lake ice models.", "Synthesize complex cryospheric data and model outputs to assess the broader implications for climate science, global carbon cycling, and human societies.", "Communicate research findings and insights related to the cryosphere effectively through written reports and oral presentations.", "Introduction to the Cryosphere", "Material Properties of Snow and Ice", "Analysis and interpretation of field-based measurements", "Snow and Ice Thermodynamics", "Analysis and interpretation of field-based measurements", "Glaciers and Ice Sheets", "Deadlines for each deliverable can be found in the course schedule above.", "The term paper involves the completion of an extensive survey of the scientific literature on a relevant topic (e.g. remote sensing, numerical modeling or in-situ studies of any element of the cryosphere; cryosphere-climate interactions on a variety of space and time scales; the representation of elements of the cryosphere in climate or weather prediction models; the impact of changes in any element or a group of elements of the cryosphere on Society).", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 0, "course_code": "ENVS 200", "course_name": "ENVS200 - Field Ecology (0.50)", "term_name": "Required Courses", "program_name": "Geography and Environmental Management", "program_id": 71, "major_id": 3, "major_name": "Earth Systems Science Specialization", "topics": ["Field Ecology Winter 2025", "**We aim to respond to forum posts and necessary emails within general workday hours (8:30 AM – 4:30 PM) and within 24hrs, except over weekends and holidays.", "Introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "View requirements for ENVS 200", "Such knowledge, called ecoliteracy, will provide a critical basis for your engagement in the 21st century, the “century of the environment”—not least because so many of the environmental issues we face derive in part from a limited understanding of how we are embedded within and dependent upon ecological systems.", "Field ecology necessarily harbours an ethical component both because of our natural affinity for life (or ‘biophilia’) and because questions of ecological ‘impact’ and 'quality’ are necessarily value-laden.", "In summary, this course introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "By the end of this course, you should be on a path to life-long learning as an ecologically-literate citizen.", "Demonstrate how these principles apply to real-world situations (in context of lab activities, assignments, and labs), including human interactions with the natural world.", "Articulate the elements of scientific inquiry as they apply to ecology/", "These course learning outcomes will not only prepare you to be an informed citizen and member of the community of life on earth, but also provide the basis for knowledge, humility, and wisdom in your dealings with ecological problems in your daily life and eventual career.", "Week Number", "Introduction and indicator species: Bird identification Lab 1:  Survey completed and submitted in lab (2%)", "3. Jan 21 *Conditions and Resources; Climate and Biomes", "You should review the course “reading guide” in LEARN before reading because you are not responsible for all textbook sections and vocabulary.", "demonstrate how these principles apply to real-world situations, including human interactions with the natural world Readings, Labs, Discussion board Weekly lecture quizzes and activities, exams, lab activities, discussion forums", "These experiences are intended to help you apply ecological concepts in real-world contexts while building valuable field skills.", "Simply missing a deadline and later mentioning registration with Accessibility Services will not be considered sufficient.", "Appeals and grievance", "Availability for exams", "These slides are meant to be a template for your note-taking: they will not replace careful attention, note-taking and participation.", "Along with the University of Waterloo and the Faculty of Environment and its Departments, I consider your well-being to be extremely important.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "However, there may be instances during lectures where AI usage is allowed after receiving clear verbal permission from the professor.", "Students are responsible for following these guidelines and seeking clarification when needed.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 2, "course_code": "GEOG 209", "course_name": "GEOG209 - Hydroclimatology (0.50)", "term_name": "Required Courses", "program_name": "Geography and Environmental Management", "program_id": 71, "major_id": 3, "major_name": "Earth Systems Science Specialization", "topics": ["08:30AM - 10:20AM EV2 2002", "Dr. Richard Petrone                                                                                       Winter 2025", "Lab Co-ordinator:", "TBA", "An introduction to the fundamental processes governing climate and hydrological systems and the links between them.", "It starts with a discussion of basic atmospheric and hydrological processes and traces the flow of energy and water between the earth's surface and the atmosphere.", "This course provides students with a thorough background of the fundamental processes governing the climate and hydrological systems, and the links between them.", "The course first reviews fundamental atmospheric and hydrologic processes, and traces the flow of energy and water between the Earth’s surface and the atmosphere.", "Through the use of group activities students will be given the opportunity to gain experience manipulating real hydrological and meteorological data and instrumentation.", "This course will serve as an introduction to near-surface hydroclimatic processes, their feedbacks and climate change, forming essential background for upper level courses in climate change, hydroclimatology and environmental sciences and studies in general.", "The fundamental knowledge and skills developed in this course will provide students with the basis to appreciate and understand the natural hydrologic and climate systems.", "It also provides the required foundation for advanced courses in climatology and hydrology.", "The objective of this course is to provide students with the background to further their interests in weather and climate, and provide the theoretical foundations for upper level science and management courses.", "To identify the key boundary layer processes that drive the hydroclimate system.", "To identify and evaluate the characteristics of different land-use types and ecosystems that drive their hydroclimatic regimes.", "Introduction to Hydroclimatology", "Evapotranspiration", "Climates of Natural Surfaces and Vegetation Effects", "Floods and Drought", "Ecology – Hydroclimate Linkages – Water and Carbon Exchange", "Landuse Change and Hydroclimatic Effects", "SVAT modelling", "Tutorial rooms and groups will be determined in the first week of lectures.", "Feb. 3              Lab #2 – Streamflow & Climate assignment introduced & Lab #1 handed in", "March 10         Lab #3 – Energy Balance & Evapotranspiration assignment introduced and Lab #2 handed in", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 6, "course_code": "GEOG 368", "course_name": "GEOG368 - Ecology and Conservation for Planning (0.50)", "term_name": "Required Courses", "program_name": "Geography and Environmental Management", "program_id": 71, "major_id": 3, "major_name": "Earth Systems Science Specialization", "topics": ["Ecology and Conservation for Planning Winter 2025", "02:30PM - 05:20PM", "This course provides students with a critical understanding of the relationship between human development and natural environments.", "Students will develop an understanding of core ecological principles and how these can be taken up in plans and policies to promote nature conservation in urban and rural environments.", "The course will include examples of how planners mitigate the environmental impacts of development of land, allotment of open space and parks, and conservation of sensitive areas and species in both urban and rural contexts.", "understand biophysical and ecological processes in urban areas", "plan for biophysical and ecological process when developing and managing the built environment", "Overview of syllabus and foundational concepts", "Get into groups and choose case study for weekly activities and final project", "Spatial patterns and mosaics", "Urban water systems and water bodies", "Urban habitat and vegetation", "Urban features", "Readings", "The ecological and evolutionary consequences of systemic racism in urban environments.", "ECOLOGICAL URBANISM: A FRAMEWORK FOR THE DESIGN OF RESILIENT CITIES Yes 0", "Each quiz corresponds to the theme for each week.", "The first will critically engage with a recent and important contribution from Schell et al.", "Each Reflection Paper should be approximately 500 to 1,000 words and should answer the following questions:", "The case study should describe each of the focal ecological components of the city and develop a plan to improve or enhance the sustainability of these components.", "These will vary week to week, but are designed to prepare students to complete their case study assignment.", "The complete style outline can be found in the Publication Manual of the American Psychological Association, located in the reference section in Dana Porter Library, or on sale in the Book Store.", "APA Frequently Asked Questions - http://www.apastyle.org/learn/faqs/", "University of Wisconsin-Madison Writing Centre: http://www.writing.wisc.edu", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 8, "course_code": "PLAN 341", "course_name": "PLAN341 - Ecology and Conservation for Planning (0.50)", "term_name": "Required Courses", "program_name": "Geography and Environmental Management", "program_id": 71, "major_id": 3, "major_name": "Earth Systems Science Specialization", "topics": ["Ecology and Conservation for Planning Winter 2025", "02:30PM - 05:20PM", "This course provides students with a critical understanding of the relationship between human development and natural environments.", "Students will develop an understanding of core ecological principles and how these can be taken up in plans and policies to promote nature conservation in urban and rural environments.", "The course will include examples of how planners mitigate the environmental impacts of development of land, allotment of open space and parks, and conservation of sensitive areas and species in both urban and rural contexts.", "understand biophysical and ecological processes in urban areas", "plan for biophysical and ecological process when developing and managing the built environment", "Overview of syllabus and foundational concepts", "Get into groups and choose case study for weekly activities and final project", "Spatial patterns and mosaics", "Urban water systems and water bodies", "Urban habitat and vegetation", "Urban features", "Readings", "The ecological and evolutionary consequences of systemic racism in urban environments.", "ECOLOGICAL URBANISM: A FRAMEWORK FOR THE DESIGN OF RESILIENT CITIES Yes 0", "Each quiz corresponds to the theme for each week.", "The first will critically engage with a recent and important contribution from Schell et al.", "Each Reflection Paper should be approximately 500 to 1,000 words and should answer the following questions:", "The case study should describe each of the focal ecological components of the city and develop a plan to improve or enhance the sustainability of these components.", "These will vary week to week, but are designed to prepare students to complete their case study assignment.", "The complete style outline can be found in the Publication Manual of the American Psychological Association, located in the reference section in Dana Porter Library, or on sale in the Book Store.", "APA Frequently Asked Questions - http://www.apastyle.org/learn/faqs/", "University of Wisconsin-Madison Writing Centre: http://www.writing.wisc.edu", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 10, "course_code": "PLAN 353", "course_name": "PLAN353 - Spatial Analysis (0.50)", "term_name": "Required Courses", "program_name": "Geography and Environmental Management", "program_id": 71, "major_id": 3, "major_name": "Earth Systems Science Specialization", "topics": ["Notice of Recording", "Spatial Analysis Winter 2025", "Email:                     dtrobins@uwaterloo.ca", "Email:                      lqzhao@uwaterloo.ca", "Advanced quantitative analysis in a spatial context.", "Today, spatial analysis is mainly based on statistical techniques and geoprocessing using geographic information systems (GIS).", "The spatial character of data implies several methodological challenges in spatial data analysis especially related to the spatial dependence of the data, which often invalidates non-spatial modeling and evaluation approaches and leads to special techniques for spatial sampling and spatial regression modeling.", "In addition, selected topics such as spatial data mining and spatial analysis software may be addressed, depending upon the progress of the course.", "Several real-world applications of spatial analysis techniques will be discussed and provide context for course assignments.", "develop a general understanding of a variety of spatial modelling techniques", "interpret and critically discuss spatial models and their results", "The lecture will be used to introduce the theory and concepts behind spatial analysis methods as well as to demonstrate techniques that will aid the completion of lab assignments.", "1  Jan 8 Introduction to Spatial Analysis 1, 2", "Feb 12 Describing and Analyzing Fields 9", "7  Feb 26 Describing and Analyzing Fields  9, 10", "10  Mar 19 Landscape Metrics and Applications of Spatial Analysis", "Spatial Data Analysis: an Introduction for GIS Users.", "Principles of Geographical Information Systems.", "Assignments commence in the second week of the course but the first week will require students to setup a workflow for using Jupyter Notebooks on the Math Faculty Jupyter Hub, which can be found here: https://jupyter.math.uwaterloo.ca/hub/login", "There are no serious programming requirements or extensive prior knowledge of geographic information systems to complete the assignments in this course.", "The notebooks will guide you through the technical steps and students will adjust notebook content/code to improve their understanding about the statistical and spatial analysis concepts discussed in the course.", "Notice of Recording", "Community of Learners", "A goal for this course is that we shall all contribute to a climate that promotes a Community of Learners.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "This course includes the independent development and practice of specific skills, such as analyzing spatial data, summarizing data for reporting results, or putting together statistical models.", "Library for research-based assignments", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 16, "course_code": "GEOG 305", "course_name": "GEOG305 - Fluvial Geomorphology (0.50)", "term_name": "Required Courses", "program_name": "Geography and Environmental Management", "program_id": 71, "major_id": 3, "major_name": "Earth Systems Science Specialization", "topics": ["RCH 211", "Emphasis on concepts related to fluvial processes, river mechanics, the relationship between environmental change and river regime.", "Fluvial geomorphology is the scientific study of river landforms and the processes that create them.", "A working knowledge of fluvial processes has important practical environmental science, watershed management and engineering applications and is relevant to many other fields of environmental enquiry such as environmental engineering, watershed planning, source water protection, forestry, and risk management.", "This course will examine a range of physical and chemical processes that create micro and macro-scale landforms over a range of spatial and temporal scales.", "Implications of these processes for environmental management in the context of environmental change will be considered.", "To understand basic fluvial geomorphic processes and their role in landform development and change", "Why study rivers?", "Sept 16              Landscapes and Rivers", "Inputs, outputs and storage", "Types of systems", "Fluvial system variables", "Spatial and temporal scales", "Concept of equilibrium", "Feedback, thresholds and equilibrium – Southern Rockies case study", "Flow generation and hydrological pathways", "Storm hydrograph and drainage basin response", "Discharge Measurement and Streamflow Analysis", "Floods", "Bankfull discharge", "Flood magnitude and frequency", "Regional flood frequency curves", "Rills and gullying", "Soil erosion models", "Modes of sediment transport in rivers", "Sediment storage and delivery ratio", "Flow in river channels", "Driving and resisting forces", "Channel parameters", "Concept of flow continuity", "Flow, channel and boundary resistance", "Subcritical, critical and supercritical flow", "Boundary layer", "Concept of stream power", "Work, energy and stream power", "Erosion in bedrock channels", "Erosion in alluvial channels", "Sediment supply and transport rates", "Driving variables", "Boundary conditions", "Nature of change", "System response", "https://uwaterloo.kanopy.com/video/return-river-0", "Dec 2                  Impact of climate change on river systems", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 17, "course_code": "GEOG 309", "course_name": "GEOG309 - Physical Climatology (0.50)", "term_name": "Required Courses", "program_name": "Geography and Environmental Management", "program_id": 71, "major_id": 3, "major_name": "Earth Systems Science Specialization", "topics": ["Office Hours and email communications: TBA (each TA will be responsible for particular assignment)", "Topics include radiation and energy balances, general circulation patterns, synoptic development and micro-climatology.", "Climate change and climate variability", "Fundamentals of global warming", "The concepts of feedbacks", "Climate change and human dimensions", "How to explain the issues of climate change and variability ideas to others with confidence and persuasion", "Climate Change and Variability", "Human Dimension", "Weather Systems and Synoptic Development (Part 1) 273-295 299-325 262-285 287-313 Ch. 9,10", "Weather Systems and Synoptic Development (Part 2)", "Any earlier edition is good but the page numbers in the outline will not be correct for other editions than the fifth and seventh.", "Understand physical processes of climate and weather Lectures and Text readings", "Analysis of Weather events during the course", "Analysis of Sequence of Weather Maps", "(Working as groups of 6-8 and explain the sequence and processes of weather in Southern Ontario)", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "This course includes the independent development and practice of specific skills, such as Assess public debate on Climate Change and Variability.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 18, "course_code": "GEOG 320", "course_name": "GEOG320 - The Cryosphere (0.50)", "term_name": "Required Courses", "program_name": "Geography and Environmental Management", "program_id": 71, "major_id": 3, "major_name": "Earth Systems Science Specialization", "topics": ["04:30PM - 05:20PM", "EV2 1002A", "This course provides a comprehensive overview of the cryosphere and cryosphere-atmosphere interactions.", "Topics covered include the material and thermodynamic properties of snow and ice, the role of the cryosphere in weather and climate, and the response of the cryosphere to climate change (past, present, and future).", "Describe the fundamental material properties of snow and ice, including crystal structures, phase transitions, and thermodynamic behavior, and relate these properties to cryospheric processes.", "Explain the role of the various elements of the cryosphere in weather and climate.", "Explain the response of the various elements of the cryosphere to changing weather and climate.", "Explain the impacts of climate change on the cryosphere, both in terms of observed trends and projected future changes, considering the implications for sea level rise, freshwater resources, and polar ecosystems.", "Identify historical and state-of-the-art datasets, including field observations and remote sensing data, needed to document the current state of the cryosphere.", "Identify field instruments for measuring cryospheric parameters, such as snow depth, ice thickness, and permafrost temperature.", "Conduct basic simulations with cryosphere process models, such as snow and lake ice models.", "Synthesize complex cryospheric data and model outputs to assess the broader implications for climate science, global carbon cycling, and human societies.", "Communicate research findings and insights related to the cryosphere effectively through written reports and oral presentations.", "Introduction to the Cryosphere", "Material Properties of Snow and Ice", "Analysis and interpretation of field-based measurements", "Snow and Ice Thermodynamics", "Analysis and interpretation of field-based measurements", "Glaciers and Ice Sheets", "Deadlines for each deliverable can be found in the course schedule above.", "The term paper involves the completion of an extensive survey of the scientific literature on a relevant topic (e.g. remote sensing, numerical modeling or in-situ studies of any element of the cryosphere; cryosphere-climate interactions on a variety of space and time scales; the representation of elements of the cryosphere in climate or weather prediction models; the impact of changes in any element or a group of elements of the cryosphere on Society).", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 3, "course_code": "COMMST 191", "course_name": "COMMST191 - Communication in the Engineering Profession (AE, CIVE, ENVE, GEOE) (0.50)", "term_name": "1A Term", "program_name": "Geological Engineering", "program_id": 72, "major_id": 1, "major_name": "Geological Engineering (Bachelor of Applied Science - Honours)", "topics": ["jclausen@uwaterloo.ca (please do not use the D2L email system)", "I monitor my email M-F, 9:00 am - 5:00 pm.", "I am teaching multiple communication courses, and especially early in the sememster, I cannot always quickly know whch course you are referring to just from your email.", "In this course students in Architectural, Civil, Environmental, and Geological Engineering will enhance oral and written communication competencies in contexts relevant to the engineering profession.", "In this course, you will work to enhance your written and oral technical communication competencies in contexts relevant to the engineering profession as well as to your future career.", "More generally, in this course, you should anticipate learning what professional norms of technical communication and dominant forms of sharing knowledge prevail within and across the fields of engineering.", "Yet this course also attempts to impart awareness and appreciation for how these communicative forms are matters of social context and sites of negotiation and contestation.", "By extension, this progression also encourages you to find a place and voice in the conversations within your fields of study and to reflect upon the meaning and shape of available forums for technical communication.", "I perceive our classroom as a co-constructed space, in which readings and discussions may frequently challenge your attitudes, your unconsciously held beliefs, or your positions on current issues.", "To ensure a safe and open space in which all can converse and learn productively, it is vital that we conduct our relationships with respect and an ethic of care.", "Describe and apply conventions, genres, norms, and values of communication in an engineering discipline;", "Compose persuasive, audience-specific technical arguments;", "Analyze and summarice technical content in clear and concise ways;", "Deliver effective oral presentations; and", "Appraise and reflect on their own compositions, and those of their peers, to strategically revise and edit documents and presentations", "Objectives for Students of Communication Studies", "You (students) will understand the complexity of communication as a human process of shared meaning-making in the context of power, history, and culture.", "You will increase your capacity to recognize and enhance yours and others’ agency – the ability to make a difference in the world for yourself and others – and understand the implications of your communication behaviors for yourself and others.", "Recognize diverse linguistic practices and modes of communication as resources for writers and speakers.", "You will understand communication as a practice, and improve your critical and creative communication competencies by developing your ability to use writing, speaking, and other media of communication to create effective and engaging artifacts.", "Your will reflect on your role in fostering the public good (the multifaceted well-being of individuals and groups), begin to imagine a better future, and make decisions in your communication that can transform the communities to which you belong.", "Introduction to Communication/What is this course about?", "Audience Analysis", "Demographics and Professional Audiences", "Researching and Describing Technical Subjects", "Chapter 11: Technical Definitions and Descriptions", "In-class Oral Proposals", "Document Design and Models of Communication", "Feb 15-21  R    E    A    D    I    N    G      W    E    E    K", "March 4: Research Abstract", "Stakeholder Analysis and Persuasion", "“Identifying and Analyzing Stakeholders and Their Interests” (Online)", "Nov. 14:  Stakeholder Analysis In-class Activity", "Ethics", "Joy Buolamwini, “How I’m Fighting Bias in Algorithms,” TED (Video)", "Engagement and contribution is demonstrated in a number of ways.", "At the end of the term you will have a chance to make the case for what grade you believe you should receive with a self-assessment.", "Did I contribute something for each of the activities (if any) listed for that week?", "Did I make my contributions available to my peers in a timely manner that they can respond and engage with it?", "In this assignment, you will choose a specific topic related to civil engineering and identify an overarching problem to produce a project proposal.", "In this assignment you will creating a proposal in response to an imagined request for proposals (RFP) from a contractor in the industry, and presenting that proposal in a short three-minute pitch for your classmates, who will consider the persuasiveness of your proposal.", "Failures of retaining walls", "Failures of suspension bridges", "Importance and justification of arches", "Role of surveying in engineering", "In groups of 2 or 3, you will provide a technical summary of that element for a public, non-specialist audience.", "You will present a summary of the project element as a poster presentation on a standard 24x36 inch poster board using a combination of written and graphic communication.", "We may be involved in a public displaying of the posters we create, alongside students from other sections of Engineering Communication on evening in February over in one of the Engineering buildings.", "Part 2: Research Abstract", "The abstract should provide information relevant to solutions to the problem you articulated in your proposal and continue to advocate for a particular solution/recommendations.", "For the final project you will create a policy brief aimed at a clear stakeholder audience.", "Instructions", "A formal policy brief includes the following sections:", "Executive summary", "Explanation of results", "identify and address a specific policy-making audience", "explain the current research on this topic in clear, non-technical language", "highlight the features of the research most relevant for policy makers and stakeholders", "make one or two recommendations based on your synthesis of the research", "Natural Resource Development", "Climate Change Impact", "Mass Transportation Design", "Communicative competencies will play a significant role in distinguishing the most successful engineers from others who are equally skilled technicians but who lack the ability to communicate effectively.", "You will hand-in a 200 word individual reflection on the process of translating engineering concepts for a public non-expert audience.", "You should reflect on what skills, competencies and concepts you used in creating your final project.", "What do you think are your strengths and weaknesses in communicative competencies?", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 8, "course_code": "MATH 118", "course_name": "MATH118 - Calculus 2 for Engineering (0.50)", "term_name": "1B Term", "program_name": "Geological Engineering", "program_id": 72, "major_id": 1, "major_name": "Geological Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:30AM - 11:20AM RCH 110", "02:30PM - 03:20PM", "RCH 306", "09:30AM - 10:20AM RCH 105", "RCH 306", "10:30AM - 11:20AM RCH 103", "RCH 204", "02:30PM - 03:20PM", "02:30PM - 04:20PM MC 4060", "Monday -", "Monday", "Linear and separable first order differential equations, applications.", "Parametric curves and polar coordinates, arc length and area.", "Get experience in writing well-organized and readable mathematical solutions, so that you will be able to communicate mathematical or technical ideas.", "Select an appropriate integration technique and apply it to solve indefinite or definite integrals.", "Find a power series representation of a function and find a closed form for a function represented by a power series.", "Understand the formal definition of the limit of a sequence and use it to prove basic limits.", "Understand the principle of mathematical induction and use it to prove some mathematical statements.", "Integration by substitution (review)", "Integration by parts (review)", "Trigonometric integrals", "Trigonometric substitution and completing the square", "Partial fractions", "Numerical integration", "Error bounds for numerical integration", "Improper integrals", "First make up lecture occurs", "Separable DEs, linear first-order DEs", "Applications of DEs", "Sequences, limits of sequences", "Recursively-defined sequences, mathematical induction", "Appendix A", "Integral test, p-series", "Comparison tests", "Second make up lecture occurs", "-", "Winter reading week", "-", "Absolute vs. conditional convergence", "Ratio and root tests", "Estimating sums", "Power series", "Taylor and Maclaurin series", "Sums of power series", "Applications of series", "Parametric equations", "Polar coordinates, polar curves", "Area and arc length of polar curves", "In particular:"]}, {"course_id": 10, "course_code": "CIVE 123", "course_name": "CIVE123 - Electrical Circuits and Instrumentation (0.50)", "term_name": "1B Term", "program_name": "Geological Engineering", "program_id": 72, "major_id": 1, "major_name": "Geological Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electrical Circuits and Instrumentation Winter 2025", "Monday, Friday -", "10:00AM - 11:20AM RCH 302", "Duty", "E-mail", "Function and characteristics of basic electrical transducers.", "Basics of data acquisition.", "Demos for circuit basics: https://youtube.com/playlist?list=PLDkq31epwdjxzg5AHIOsDk0dry4lAW5Sl", "3 1&2 Current, Voltage, Power and Energy,", "4 2&3 Basic resistive circuit techniques", "9 6 Operational Amplifiers", "10 7 Capacitors and inductors", "12 9 AC Circuit Analysis - I"]}, {"course_id": 13, "course_code": "CIVE 121", "course_name": "CIVE121 - Computational Methods (0.50)", "term_name": "1B Term", "program_name": "Geological Engineering", "program_id": 72, "major_id": 1, "major_name": "Geological Engineering (Bachelor of Applied Science - Honours)", "topics": ["Computational Methods Winter 2025", "08:30AM - 09:50AM RCH 302", "Introduction to computer programming, examples of efficient numerical algorithms for basic scientific computations.", "Programming and problem solving concepts introduced in the course will be incorporated into group projects involving civil, environmental, or geological engineering applications.", "MATLAB is an easy and readable programming language and is an excellent choice for those who are learning programming for the first time.", "Students who complete this course will gain a fundamental understanding of computer programming techniques and be able to operate, analyze, and visualize all types of data for future engineering studies.", "It is an introductory programming course that utilizes MATLAB to illustrate general concepts in computer programming.", "Compose working, efficient, and readable MATLAB scripts in various ways.", "Debug your code to identify and fix programming errors.", "Identify suitable keywords to search for code snippets on the web."]}, {"course_id": 19, "course_code": "EARTH 238", "course_name": "EARTH238 - Introductory Structural Geology (0.50)", "term_name": "2A Term", "program_name": "Geological Engineering", "program_id": 72, "major_id": 1, "major_name": "Geological Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introductory Structural Geology Winter 2024", "EARTH 238", "03:30PM - 04:20PM", "EARTH 238 201", "changcheng.li@uwaterloo.ca", "EIT 1013", "changcheng.li@uwaterloo.ca", "EARTH 238 102", "EIT 1013", "changcheng.li@uwaterloo.ca", "*", "Discussions", "To the teaching team: This is a discussion topic for you to give suggestions to the teaching team and for them to know the questions you have.", "Concepts of stress and strain; elementary rock mechanics; description and classification of folds, faults, foliations, lineations and joints; use of primary structures; introduction to geometrical analysis.", "Labs will emphasize geometrical problems, including geological maps and cross sections, and stereographic projection.", "Understand the process in which various geological structures develop", "Perform kinematic analysis from some simple structures", "Record orientation data in the right format according geological convention", "Read a geological map and draw cross sections base on the map", "Use an equal-area net to conduct geometrical analysis", "iClicker Students can use either iClicker student App or iClicker remote Yes", "Basic Methods of Structural Geology.", "Students have to answer a question in a quiz correctly to get the mark.", "Examination regulations as outlined in the current UW undergraduate calendar are to be followed."]}]