[{"course_id": 167, "course_code": "MSE 343", "course_name": "MSE343 - Human-Computer Interaction (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Human-Computer Interaction Fall 2024", "10:00AM - 11:20AM QNC 2502", "10:00AM - 11:20AM QNC 2502", "11:30AM - 12:20PM QNC 2502", "This course is designed to provide in-depth exposure to the concepts of human-computer interaction and methods of interactive information system design.", "The course will focus on techniques for building information systems that meet human needs and capabilities by following a system development lifecycle: user requirements analysis, information and interaction design, prototyping and evaluation.", "View requirements for MSE 343", "Explain and justify the benefits and drawbacks of user-centred design", "Describe guidelines and models that can be applied to interface design", "Apply a variety of methods to involve the people who use an application in the design process", "Evaluate the usability of an interface", "Explain and justify the benefits and drawbacks of user-centred design 1 KB c) Demonstrate understanding of engineering fundamentals.", "Describe guidelines and models that can be applied to interface design 1 KB d) Demonstrate understanding of specialized engineering knowledge", "Apply a variety of methods to involve the people who use an application in the design process 4 Des b) Generate and implement solutions to complex open-ended problems", "Evaluate the usability of an interface 4 Des c) Evaluate/test solutions and refine designs to better meet requirements", "Process and Requirements", "Introduction to HCI Chapters 1 & 9", "User-centred design Course Notes", "Gathering Requirements and Task-centred design Chapter 10", "Designing Alternatives + Prototyping", "Interface Types & Graphical screen design Chapter 6", "Evaluate", "Evaluating Interfaces with Users: Qualitative Methods Chapters 13 & 7", "Analytical Evaluation: Heuristic Evaluation & Fitts’ Law Chapter 15", "Social & Emotional Interaction Chapter 4 & 5", "Psychology of everyday things & Cognition Chapter 3 & Notes", "Interaction Design: Beyond human computer interaction, 4th edition.", "You will be working in a team of three to five for all these milestones.", "There will be a set of online and in-person activities taking the place of the lab session in this course.", "You can complete these by simply attending class and participating in the activities; there will be a time limit to submit your materials.", "Up until the date of the final exam, you may submit any submitted material for regrading under the following conditions:", "(Ask them first!)", "Extensions", "No extensions will be given after a submission date.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 175, "course_code": "STAT 441", "course_name": "STAT441 - Statistical Learning - Classification (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["10:00AM - 11:20AM B1 271", "Email: mlysy@uwaterloo.ca", "STAT 841: View requirements for STAT 841", "Describe the basic principles and methods of statistical classification.", "Know when to use each of these methods on a given dataset.", "Evaluate and compare the output of various classifiers.", "An Introduction to Statistical Learning with Applications in R, by James, Witten, Hastie & Tibshirani https://www.statlearning.com", "There will be two closed-book midterms worth 15% each on the following dates:", "There are no make-up midterms in this course.", "Discussion Board", "Please self-enroll at https://piazza.com/uwaterloo.ca/winter2025/stat441841cm763.", "You can generally expect a response from TAs within two business days.", "Software", "Material and assignments will require the use of R and Python programming languages, as well as the technical document writing programs for these languages: R Markdown and Quarto.", "Regrades", "Email", "Emails which do not adhere to this standard will generally be ignored.", "Intellectual property includes items such as:", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 176, "course_code": "STAT 442", "course_name": "STAT442 - Data Visualization (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "Data Visualization Winter 2025", "11:30AM - 12:20PM B1 271", "Discussion Board", "Email", "Response time", "Both human perception and statistical properties inform the methods used to display and visually explore categorical, continuous, time-ordered, map, and high dimensional data.", "Statistical concepts visually presented include variability, densities, quantiles, conditioning, and hypothesis testing.", "Interactive graphics include linking, brushing, motion, and the navigation of high dimensional spaces guided via projection indices.", "Interpret and critique the most commonly used kinds of visualizations today.", "Create a variety of univariate, bivariate, and multivariate graphs using base R and the tidyverse.", "Look up the necessary code to complete additional graphs not covered here.", "Book - Data Science - A First Introduction.", "Book - The Chicago Guide to Multivariate Analysis, Jane E. Miller", "Book - Cool Infographics - Effective Communication with Data Visualization and Design, Randy Krum.", "Industry Paper - Making Data Meaningful, United Nations Economic Commission for Europe.", "Notice of Recording", "No waiving of this penalty will occur for technical issues.", "Details can be found here: https://uwaterloo.ca/math/accommodations", "Phone: 519-884-0000 extension 213", "Lots of people look like they have it together in public and online when they're a mess inside too.", "They got you into university, so they've already done most of the work, but at this point, the most they can really do for you decide if you can get into graduate school before doing industry experience.", "Don't let that be your reason for thinking this is as good as it gets.", "In particular:", "Please inform me of these at the start of the course."]}, {"course_id": 180, "course_code": "SYDE 548", "course_name": "SYDE548 - User Centred Design Methods (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["User Centred Design Methods Winter 2025", "UCD Mentors Pronouns Email Office Extra Help", "This course approaches the design of tasks, tools, products, and systems from a user-centered design perspective.", "Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process.", "Major topics include user research methods for usability and user experience, inspection methods, user testing, applied statistical analysis.", "SYDE 548 (UCD Methods) approaches the design of tasks, tools, products, and systems from a user-centered design perspective.", "Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process.", "Major topics include user research methods for usability and user experience, inspection methods, user testing, and applied statistical analysis.", "SYDE 548 User-Centred Design Methods is a technical elective.", "It builds from earlier SYDE core courses in design (SYDE-BME 161 Introduction to Design, SYDE-BME 162 Human Factors in Design, and SYDE-BME 361 Engineering Design).", "Motivated students willing to become familiar with basic human factors engineering can participate and contribute to course activities.", "Whether you are interested in becoming a UCD specialist, a certified ergonomist, or just want to be a wise designer or consumer, this course will supply you with a range of practical tools (methods).", "Our “In-class” sessions are used as workshops for interactions and hands-on skill development with different UR methods.", "Engineering Graduate Attribute]", "(A) Describe ethical UCD methods used for formal and informal design assessments with human participants.", "(B) Investigate & select appropriate ethical & equitable UCD methods for specific design situations.[2a, 3b, 10b]", "(C) Apply UCD method protocols to instructor-defined design situations.", "(D) Modify UCD method protocols to collect data for a student-defined design project.", "(E) Select and apply appropriate statistical analysis for given UCD data.", "(F) Design ethical UCD test plans for instructor-defined design situations.", "(G) Create User Research Portfolios describing ethical UCD methods, protocols, and lessons learned.", "CEAB Engineering Graduate Attribute", "Knowledge Base for Engineering", "2. Problem Analysis", "Data Analysis Quizzes,", "4. Design", "-", "Impact of Engineering on Society and the Environment", "Ethics & Equity", "Economics & Project Management", "-", "2. Situations of Concern, Design Impacts & Personas Quantifying Usability; Standard UX Questionnaires;", "SUS Scoring (standard and positive versions)", "3. Design Ethnography: UR Safaris & Secondary Research.", "Interviews & Distress Protocols.", "5. Thematic Analysis Methods - Part 1 Thematic Analysis Methods - Part 2", "Formative Design Walkthroughs & Estimating Formative Sample Sizes.", "UR Methods & GenAI Revisited.", "Quantifying the User Experience: Practical statistics for user research.", "An e-copy of the 1st edition can be accessed through UW Library Reserves.", "The User Experience Team of One: A Research and Design Survival Guide. 2nd edition.", "Hanington, B. & Martin, B (2019) Universal Methods of Design (Expanded & Revised): 125 Ways to research complex problems, develop innovative ideas, and design effective solutions.", "An e-copy of the 1st edition can be accessed through UW Library Reserves No", "Design Materials (for workshops, data collection, and analysis).", "The number of students who can access an e-copy at a given time may be limited.", "Since user-centred design and user research skills are valued by industry, it is important that each student submits original work and demonstrates their own value-added UR skills to earn credit for the course.", "Intellectual property includes items such as:"]}, {"course_id": 186, "course_code": "ENBUS 102", "course_name": "ENBUS102 - Introduction to Environment and Business (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Introduction to Environment and Business Fall 2024", "Come by and introduce yourself :)", "Introduction of ways in which business has and is responding to environmental and business issues; business and sustainable development; issues of corporate/business greening.", "The central objective of this course is to explore the genesis of sustainability through a survey of the history and development of the ever-changing interface between business, society, and the environment.", "2. Understand why firms have sought to look beyond shareholders in how they understand and build value", "3. Discuss the practices firms engage in and how those practices have changed over time", "Sep 24 Linear to Systems Thinking", "Westley, F. What is a system?", "Systems thinking - The new approach for sustainable and profitable businesses.", "Weak versus Strong Sustainability", "Environmental Economics versus Ecological Economics", "UN Sustainable Development", "Oct 1 Evolution of Business Sustainability", "Oct 3 From Shareholders to Stakeholders to Social License", "Network for Business Sustainability", "Oct 8 Regulations and Command and Control", "Li, S. The business case for ESG: Why Companies Adopt Environmental Value Beyond Social Responsibility.", "Thriving at Waterloo Avoiding Plagiarism: Citations and Referencing", "Graber-Stiehl, I. How bogus 'eco-friendly' products trick you.", "Thriving at Waterloo Avoiding Unauthorized Collaboration", "Sustainable Finance", "Weber, O., & Feltmate, B.  Introduction to Sustainable Finance (pp 3-24), In Sustainable Banking and Finance: Managing the Social and Environmental Impact of Financial Institutions.", "Li, S. The business case for ESG: Why Companies Adopt Environmental Value Beyond Social Responsibility.", "The exam will include a combination of multiple-choice and short-answer questions.", "You must specify the sections you want addressed and a rationale for why it deserves consideration, with specific reference to the rubric and assessment criteria.", "Only in exceptional cases will this penalty be waived!", "Intellectual property includes items such as:", "Anti-racism Statement", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 190, "course_code": "ENVS 200", "course_name": "ENVS200 - Field Ecology (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Field Ecology Winter 2025", "**We aim to respond to forum posts and necessary emails within general workday hours (8:30 AM – 4:30 PM) and within 24hrs, except over weekends and holidays.", "Introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "View requirements for ENVS 200", "Such knowledge, called ecoliteracy, will provide a critical basis for your engagement in the 21st century, the “century of the environment”—not least because so many of the environmental issues we face derive in part from a limited understanding of how we are embedded within and dependent upon ecological systems.", "Field ecology necessarily harbours an ethical component both because of our natural affinity for life (or ‘biophilia’) and because questions of ecological ‘impact’ and 'quality’ are necessarily value-laden.", "In summary, this course introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "By the end of this course, you should be on a path to life-long learning as an ecologically-literate citizen.", "Demonstrate how these principles apply to real-world situations (in context of lab activities, assignments, and labs), including human interactions with the natural world.", "Articulate the elements of scientific inquiry as they apply to ecology/", "These course learning outcomes will not only prepare you to be an informed citizen and member of the community of life on earth, but also provide the basis for knowledge, humility, and wisdom in your dealings with ecological problems in your daily life and eventual career.", "Week Number", "Introduction and indicator species: Bird identification Lab 1:  Survey completed and submitted in lab (2%)", "3. Jan 21 *Conditions and Resources; Climate and Biomes", "You should review the course “reading guide” in LEARN before reading because you are not responsible for all textbook sections and vocabulary.", "demonstrate how these principles apply to real-world situations, including human interactions with the natural world Readings, Labs, Discussion board Weekly lecture quizzes and activities, exams, lab activities, discussion forums", "These experiences are intended to help you apply ecological concepts in real-world contexts while building valuable field skills.", "Simply missing a deadline and later mentioning registration with Accessibility Services will not be considered sufficient.", "Appeals and grievance", "Availability for exams", "These slides are meant to be a template for your note-taking: they will not replace careful attention, note-taking and participation.", "Along with the University of Waterloo and the Faculty of Environment and its Departments, I consider your well-being to be extremely important.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "However, there may be instances during lectures where AI usage is allowed after receiving clear verbal permission from the professor.", "Students are responsible for following these guidelines and seeking clarification when needed.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 198, "course_code": "ERS 316", "course_name": "ERS316 - Urban Water and Wastewater Systems: Integrated Planning and Management (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "Urban Water and Wastewater Systems: Integrated Planning and Management Fall 2024", "ERS 316", "Dr. Felicitas Egunyu", "Emily Rorison          Email: erorison@uwaterloo.ca", "Development and maintenance of urban water and wastewater systems, along with demand and supply management planning, efficiency mechanisms, development and equity concerns, will be examined.", "View requirements for ERS 316", "This course is designed for senior students interested in urban environmental issues, with a focus on water services.", "This course extends concepts learned in ERS 265 (Water History), complements ERS 365 (Water Governance), and is a useful foundation for a senior thesis (ERS 411) or interdisciplinary graduate studies on water issues.", "For those students who have a strong interest in the topic, but do not have the background knowledge, this course will offer a comprehensive understanding of urban water and wastewater systems.", "Lectures, participating in tutorials, and groups provide an overview of key concepts and highlight important ideas from the readings.", "Describe frameworks for understanding and explaining urban water use.", "3. Identify and describe municipal water and wastewater systems and their subcomponents.", "The Aqueducts and Water Supply of Ancient Rome", "Yudelson", "Yudelson", "Yudelson", "Yudelson Chapters 7 – 8", "Yudelson Chapters 11 – 13", "Exposing the myths of household water insecurity in the global north: A critical review", "Yudelson", "Notice of Recording", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 199, "course_code": "ERS 320", "course_name": "ERS320 - Economics and Sustainability (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "Economics and Sustainability Winter 2025", "DWE 1515", "03:30PM - 04:20PM", "In the case of inclement weather, course lectures may shift online.", "View requirements for ERS 320", "We cover multiple perspectives in economics and trace the evolution of key drivers, debates, and policy approaches before turning to new frontiers of research and practice.", "The course format combines interactive lectures with exercises to build skills in economic and policy analysis, technical writing (policy briefings) for specialized audiences, and data analysis and visualization.", "The term will culminate in a poster session on sustainable economic futures with a focus on water, climate, and biodiversity - three areas where economists have prepared major reviews in the last 15 years.", "Describe and compare different economic perspectives on sustainability and development", "Identify trends and debates on the economics of sustainability from a systems perspective;", "Evaluate the strengths and weaknesses of economic methodologies for policy analysis;", "Integrate economic ideas and methods with other disciplinary perspectives in the humanities, natural sciences, engineering sciences and social sciences", "Introduction", "Why economics matters for sustainability", "The evolution of economic ideas about sustainability", "Sustainability economics", "Markets and the commons", "Why and how markets fail; coordination problems; property rights", "Valuing nature", "Frameworks and methods for valuing the environment", "How institutions and incentives shape behaviour and policy", "Defining and applying key concepts", "The Economics of Safe Drinking Water", "Atlas of Water Markets: East Africa and Latin America", "Natural Monopolies & Negative Externalities", "Atlas of Water Markets: South Asia, Southern Europe & North Africa", "The Economics of Biodiversity and Climate Adaptation", "Atlas of Water Markets: Western USA and Australia", "New frontiers of economic thinking about sustainability", "Summit", "Students are expected to attend each class and participate in three ways: critical reading; active engagement in class discussions and debates; and completion of practical exercises during tutorials.", "The mid-term exam, held Feb 26th, will be an in-class exam assessing understanding of core concepts and debates.", "The format will include multiple choice and short essays.", "Each student will be tasked with completing a policy briefing that applies economic concepts and methods to identify the causes of a water sustainability challenge and outline potential solutions.", "Notice of Recording", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 212, "course_code": "PSCI 432", "course_name": "PSCI432 - Global Environmental Governance (0.50)", "term_name": "Additional Requirements", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["02:30PM - 05:20PM", "Email Address: andrea.collins@uwaterloo.ca", "The history of international environmental politics will be reviewed, specific organizations and other actors involved in global environmental governance will be examined and the management of particular global environmental challenges investigated.", "ERS 404: View requirements for ERS 404", "Though efforts are made at all levels of society to address environmental issues, many of the challenges we face require transboundary coordination and governance.", "Students will learn about conventional sites of state-based governance, international organizations and agencies as well as emerging forms of governance, including private governance and the role of non-state actors.", "Students will develop a sense of the various political interests that influence global environmental governance and the challenges to enacting effective governance.", "Define and apply key concepts in contemporary global governance", "Describe the different kinds of global governance actors and their roles", "Understand global environmental issues and the presence or absence of appropriate governance mechanisms", "Analyze different forms of global environmental governance and assess their effectiveness", "Communicate key political challenges through both writing and public presentation", "+ A Short History of Grappling with Global Environmental Problems", "This week will introduce students to the overarching theme of the course – specifically that ‘governance’ is a flexible and contested term – and introduce some core ideas about global governance.", "“Responsibilities in Transition: Emerging Powers in the Climate Change Negotiations.”", "China as a ‘Partial’ Environmental Great Power.", "“Big Brand Sustainability: Governance Prospects and Environmental Limits.”", "Week 5 – Feb. 5 – Non-Governmental Organizations, Social Movements, Experts, and Civil Society & Modes of Non-state Governance", "“Is the Power of Brand-Focused Activism Rising?", "The Convention on International Trade in Endangered Species of Wild Fauna and Flora (CITES)", "Thematic Focus: North-South relations in global environmental governance", "Week 9 – March 12 – Ecosystems & Change: Deforestation and Land Degradation", "Thematic Focus: Role of non-state actors in global environmental governance.", "“Agency Shifts in Agricultural Land Governance and Their Implications for Land Degradation Neutrality.”", "muse.jhu.edu/article/168279", "Thematic Focus: Environmental justice and/or North-South relations", "Thematic Focus: fragmentation of environmental governance", "Morin, Jean-Frédéric & Orsini, Amandine.", "It contains short descriptions of key concepts that you may refer to in your reading for further clarification.", "Mid-term Test - Held in-person 25%", "Write a short 300-word original reflection of your thoughts about ideas/concepts in the weekly readings and emailing it to me before the next week begins (i.e. by Monday morning at 9 a.m.).", "Peer- Evaluation and Self-Assessment:", "I will provide resources to help you and your research partner(s) to communicate and collaborate, but you are ultimately responsible for resolving issues and solving problems.", "In addition, this document must also include a 100–150 word peer-evaluation of each research partner(s)’s performance and the nature of your collaboration this term.", "A clear description of your research topic: the issue and/or global agreements you have been assigned.", "Be well-organized and memorable with a clear learning outcome (i.e. what is the one thing you want the class to remember from your lesson).", "Each lesson should be 30 - 40 minutes in length.", "Additional time will be allotted for follow-up questions from the class and the instructor, so your entire time in front of the class may be up to 75 minutes.", "Instead, your analysis will demonstrate your understanding of the various actors and dynamics in global environmental governance.", "Please include a separate references page.", "Your references pages do not count towards the overall word count.", "Be sure that your research encompasses the study of global politics and governance and not just the scientific literature about your research area.", "The whole team will also need to attend an in-person meeting with me to discuss your research findings and contributions to the paper in the week before the end of the term.", "The exam will be held in-person during the exam period.", "Please be sure to refer to these when you are preparing your Team's lectures and when participating in class discussions.", "Engage in healthy debate:", "Don't interrupt when someone is speaking", "An engaged facilitator", "Prompts for discussion", "Opportunity to write ideas first", "Space for people to explore/explain ideas using their own experience and knowledge", "Organized slides", "clear headings", "summaries", "Late take-home exams will not be accepted after the grace period ends and will earn a grade of zero.", "Life happens and often interrupts our best laid plans for the term.", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Cross-listed courses", "This course includes the independent development and practice of specific skills, such as reading and analysis.", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 1, "course_code": "STAT 331", "course_name": "STAT331 - Applied Linear Models (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Applied Linear Models Winter 2025", "08:30AM - 09:50AM MC 4020", "02:30PM - 03:20PM", "RCH 101", "Thursdays from 3:00-4:00pm in M3 3021", "Modelling the relationship between a response variable and several explanatory variables (an output-input system) via regression models.", "Model diagnostics and improvement.", "Algorithms for variable selection.", "Review of basic Normal theory, t, chi-squared, and F distributions.", "Simple linear regression.", "Analysis of variance.", "Multiple linear regression, variable selection techniques, indicator variables, diagnostics.", "Brief introduction to non-linear regression, factorial experimentation.", "Registered students can enroll in the class discussion board through Piazza.", "Search for your question first before posting.", "Do not expect a full solution to your question.", "To help maintain a safe, respectful, and productive community in which we – students and teaching team alike – can take risks in our learning/teaching, tackle challenging concepts, and ultimately grow as learners, we should endeavor to follow these mutual expectations:", "Explain the main concepts of linear regression models.", "Understand the methods of least squares and maximum likelihood estimation for model parameters.", "Interpret the model and its parameters (e.g., regression coefficients) in the context of any application.", "Draw inferences from a fitted model about the parameters of interest and make predictions.", "Apply the previous two outcomes when fitting linear models to real data using R.", "Assess model quality by diagnosing violations in underlying model assumptions (and identify strategies for improvement).", "Evaluate competing fitted models built using various model selection methods (and choose between them).", "Introduction", "The Straight Line Model", "Model formulation and interpretation", "Least squares estimation", "Mean response and residual variance estimation", "Introduction to R/RStudio", "Maximum likelihood estimation", "Estimators and their properties", "Important distributions", "Distributions of estimators", "Confidence intervals", "O - Ch. 2-4", "Straight Line Model in R", "Prediction intervals", "Intervals in R", "Hypothesis testing", "O - Ch. 4-5", "ANOVA and F test", "Model limits", "Data transformations", "O - Ch. 4-6", "O - Ch. 7", "A1 and Q1 Solutions", "Multivariate normal distribution", "The Linear Model", "Examples", "O - Ch. 8-9", "Estimation", "Estimators and their properties", "Distributions of estimators", "O - Ch. 9, 11, 12", "ANOVA and F test", "Significance tests", "General linear hypothesis", "O - Ch. 9, 11, 12", "A2 and Midterm Solutions", "Case Study: South African heart disease", "Nested models", "Additional sum of squares", "O - Ch. 12", "Outliers", "O - Ch. 13-14", "Influence", "O - Ch. 14-15", "A3 and Q2 Solutions", "One-variable-at-a-time selection methods", "Criteria-based selection methods", "O - Ch. 16", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solve exercises from the textbook on your own.", "Introduction to Regression Modeling by Abraham and Ledolter This textbook is an optional reference book (available for free on LEARN).", "R and R-Studio Free software.", "To serve as an opportunity to demonstrate your understanding, application, and integration of the course material, including practical application of the skills/concepts with the statistical software, R.", "Missed Assignment: The time window to complete these assessments are generous and, in general, a sickness lasting a couple of days will not be enough of a reason to ask for alternative accommodations and/or extension.", "Tips for Success", "Students should critically compare their work with available solutions and against the solutions of fellow classmates.", "Notice of Recording", "To help you decide if you should isolate, you can use the provincial self-assessment tool.", "In the scenario where we must transition back online the following contingencies will be used:", "These materials are made available for the personal use of students registered in the current offering of this course.", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical proofs and the fitting, interpretation, and assessment of linear models in real applications.", "Library for research-based assignments"]}, {"course_id": 3, "course_code": "STAT 333", "course_name": "STAT333 - Stochastic Processes 1 (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM DC 1350", "04:00PM - 05:20PM", "Erik Hintz: Fridays, 2:00pm - 3:00pm, in M3-2106", "Requests must be emailed to: sasugradadv@uwaterloo.ca", "Topics cover generating functions, conditional probability distributions and conditional expectation, discrete-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, applications including the random walk, the gambler's ruin problem, and the Galton-Watson branching process, an introduction to counting processes, connections between the exponential distribution and Poisson process, and non-homogeneous and compound Poisson processes.", "use moment generating functions as a tool to determine expected values and identify probability distributions of random variables;", "use the law of total expectation to calculate expected values and probabilities through the principle of conditioning;", "specify a discrete-time Markov chain (DTMC), in terms of its transition probability matrix and initial conditions, and calculate various transition probabilities;", "classify the states of a DTMC;", "define fundamental DTMC concepts including irreducibility, periodicity, and recurrence/transience;", "find limiting/stationary probability distributions for certain DTMCs through the use of the Basic Limit Theorem;", "calculate absorption probabilities and expected absorption times for DTMCs using the principle of conditioning with respect to the first transition;", "Week 11 March 24 - March 28 Chap 4: Exponential Distribution & Poisson Processes Tutorial Assignment 2", "Week 12 March 31 - April 4 Chap 4: Exponential Distribution & Poisson Processes Tutorial Test 3", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solving exercises from the Course Notes on your own.", "Introduction to Probability Models by Sheldon M. Ross (2019)"]}, {"course_id": 6, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 9, "course_code": "AMATH 242", "course_name": "AMATH242 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 12, "course_code": "AMATH 350", "course_name": "AMATH350 - Differential Equations for Business and Economics (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["Differential Equations for Business and Economics Winter 2025", "11:30AM - 12:20PM MC 4045", "First order ordinary differential equations.", "Applications to continuous compounding and the dynamics of supply and demand.", "Higher order linear ordinary differential equations.", "Systems of linear ordinary differential equations.", "Introduction to linear partial differential equations.", "Ordinary differential equations and their applications", "Systems of linear ordinary differential equations", "Linear partial differential equations and Fourier transform", "Black-Scholes equation and solution", "(Jan 6-10) Introduction to Differential Equations (DEs), Separable Equations, Initial-Value Problems, Applications from Finance", "Dimensional Homogeneity, First-Order Linear Ordinary DEs, Use of Substitutions, Applications from Finance Chapter 2 Posting Assignment 1", "Introduction to Higher-Order Linear Equations: Theoretical Background", "Introduction to Systems of Ordinary Differential Equations, Method of Solution for Homogeneous Systems (Second Order)", "(Mar 3-7) Introduction to Partial Differential Equations, First-order Equations (Partial Integration, Method of Characteristics) Chapter 5", "Second-Order Linear PDEs: Classification, Solution by Partial Integration or Method of Characteristics Chapter 5", "Please submit your assignments early in case of unexpected technical difficulties."]}, {"course_id": 14, "course_code": "MATH 239", "course_name": "MATH239 - Introduction to Combinatorics (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics Winter 2025", "11:30AM - 12:20PM MC 4059", "09:30AM - 10:20AM MC 4021", "P. Nelson", "08:30AM - 09:20AM QNC 1502", "S. Pfannerer-Mittas", "10:30AM - 11:20AM MC 4058", "11:30AM - 12:20PM MC 4058", "09:30AM - 10:20AM MC 4042", "02:30PM - 03:20PM", "10:30AM - 11:20AM PHY 150", "04:30PM - 05:20PM", "You should have no reason to contact them directly, but you can find their email addresses through Learn.", "First name Last name", "Guilherme Zeus Dantas E Moura", "Theodore Morrison", "Matthew Kroeker", "Introduction to graph theory: colourings, matchings, connectivity, planarity.", "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.", "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 15, "course_code": "MATH 249", "course_name": "MATH249 - Introduction to Combinatorics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Statistics", "program_id": 154, "major_id": 1, "major_name": "Statistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics (Advanced Level)", "09:30AM - 10:20AM MC 2017", "For graph theory, while we will focus on the same topics covered in MATH 239 (planarity and bipartite matching), our coverage of those topics will differ substantially in depth and in the techniques that we employ; in particular, we will see striking applications of algebra.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 0, "course_code": "SYDE 101", "course_name": "SYDE101 - Communications in Systems Design Engineering-Written and Oral (0.25)", "term_name": "1A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Communications in Systems Design Engineering-Written and Oral Fall 2024", "10:30AM - 11:20AM RCH 211", "08:30AM - 10:20AM E5 6008", "08:30AM - 10:20AM RCH 301", "Dr. Andrew Atkinson - Andrew.Atkinson@uwaterloo.ca", "Fatima Zohra - Fatima.Zohra@uwaterloo.ca", "Jamie Zettle - Jamie.Zettle@uwaterloo.ca", "This course introduces first-year students to systems design engineering with a focus on the engineering profession, and technical communication skills.", "Through in-class and independent activities leading to formative and summative assessments, students will consider and reflect on communication intention, audience, content, medium, format, and tone to demonstrate and improve upon their listening, written and oral communication skills for academic, engineering, and professional context.", "Use reliable sources of information and use it to fill in knowledge gaps (1,12)", "Distinguish ethical and equitable vs. unethical and inequitable situations applied in the engineering profession (10)", "Recognize the importance of codes and standards as best practice in engineering profession.", "The numbers in the brackets next to learning outcome are associated C.E.A.B Graduate Attributes", "ILO", "Professionalism and Communication in Engineering", "Google Technical Writing for Engineers", "Describe the design decisions that were made.", "Instructions", "Web and Intranet Communication", "Engineering Ethics", "Prof. Howcroft", "Partnering with our colleagues in the Centre for Career Action and the department of Co-operative Education, Co-op Fundamentals for Engineering (CFE) has been designed as a suite of co-op supports just for Engineering students.", "Your active participation in CFE activities has the potential to make a real impact on your first co-op experience.", "This is a degree milestone", "Sign your email with your first and last name and your student number.", "Any in-person deliverables (e.g., design presentations) will be delayed on a case-by-case basis.", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.", "A.A.S. also offers learning strategy supports to all students that can be accessed through:", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 3, "course_code": "SYDE 113", "course_name": "SYDE113 - Elementary Engineering Mathematics (0.25)", "term_name": "1A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Elementary Engineering Mathematics Fall 2024", "01:30PM - 03:20PM", "08:30AM - 10:20AM DWE 3522", "Email: chrystopher.nehaniv@uwaterloo.ca", "Mathematical notation and proof techniques.", "Introduction to numerical computation: binary and floating point numbers and arithmetic, accuracy and sources of error.", "Use mathematical notation and proof techniques (including logic and mathematical induction, proof by contradiction, recursion, etc.)", "2. Understand and use basic set-theoretic operations, various finite and infinite number systems, and their notations (1a)", "Work with vectors and basic vector operations, linear mappings, lines, planes, and hyperplanes in finite-dimensional spaces, as well as with conic sections (1a, 2)", "Understand the geometry and algebra of complex numbers and carry out basic manipulations using them.", "Assignment 1 - Numbers and Sets    Sept 6", "Coordinate systems & Number systems.", "Notation: Summation & Products.", "Complex Numbers I.", "Mathematical Induction & Recursion", "Algebra & Geometry of Complex Numbers II: Roots and Factors of Polynomials.", "Fundamental Theorem of Algebra", "Lectures 12 & 13", "Operations in Vector Spaces.", "Geometry of the Dot Product.", "A Little Bit of Linear Algebra", "Lectures 18 & 19", "Lectures 20 & 21", "Fixed- and Floating-Point Number Systems Arithmetic", "Note: 10th edition includes metric spaces.)", "Students are expected to read the sections of the textbooks and supplementary readings assigned in each week before the corresponding lectures and tutorials.", "Although no grade is assigned to these problem sets,students are expected to solve these problems as part of their study habits and exam preparation.", "The MatLab exercises introduce a widespread numerical computational programming environment supporting the application of numerical computation techniques.", "**", "In that case, these will be recorded.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "Compassionate Accommodation:", "They will review your case and coordinate a reasonable and fair plan in consultationwith appropriate others (for example: instructors, Department Undergraduate Studies Committee, Chair, AccessAbility Services, Engineering Counselling services, Registrar's Office)."]}, {"course_id": 4, "course_code": "SYDE 121", "course_name": "SYDE121 - Digital Computation (0.50)", "term_name": "1A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 10:20AM E5 6008", "RCH 301", "RCH 301", "Fatima Syeda: f2syeda@uwaterloo.ca", "Use structured and object-oriented programming techniques to solve engineering problems (2)", "Apply software debugging tools and techniques during software development (5)", "Introduction, Basics of Computer Systems Sections 1.1 (Computer Systems) and 1.2 (Programming and Problem Solving)", "Variables and Data Types, Control Flow Basics, Testing and Debugging Sections 1.3-1.4 (Introduction to C++, Testing and Debugging), 2.1-2.3 (Variables and Assignments, Input and Output, Data Types and Expressions), Sections 2.4-2.5 (Flow of Control, Program Styling) and 3.1-3.2 (Boolean Expressions, Multiway Branches)", "Designing Loops, Top-Down Design, Function Declaration and Definition (Revisit) Sections 3.3-3.4 (Designing Loops), Sections 4.1-4.3 (Top-Down Design, Designing Functions), Sections 4.4-4.6 (Procedural Abstraction, Scope Rules, Overloading)", "Procedural Abstraction, Overloading Functions, Call by Reference Sections 5.1-5.3 (More on void Functions, Call by Reference Parameters, Functions Calling Other Functions), Sections 5.4-5.5 (Stubs and Drivers, Debugging Functions), Sections 7.1-7.4 (Introduction to Arrays, Arrays in Functions, Multidimensional Arrays)", "Debugging Functions, Arrays in functions   Quiz#2 (Oct 9)", "Vectors and STL Types, C-Style Strings, C++ String Class Sections 8.1-8.3 (An Array for Strings, String Class, Vectors)", "Structures and Classes, Abstract Data Types, Object Oriented Design Sections 10.1-10.3 (Structures, Classes, Abstract Data Types)", "Pointers and Dynamic Memory Basics, Smart Pointers Sections Sections 9.1 & 9.2 (Pointers, Dynamic Memory) LabAssignment #3 due", "G. J. Bronson: “C++for Engineers and Scientists”.", "Send a note via email to the course instructor clearly stating the grading item that you want remarked Attach supporting evidence for your case including screenshots of the pages that need to be regraded.", "A student must save a copy of the submitted work on his or her personal computer or personal file system in case of any website problem.", "Sign your email with your first and last name and your student number.", "While we will do our best to respond to your emails as soon as possible, allow a couple of hours (excluding weekends) for a response to your email.", "When in doubt please be", "Workshops will be delayed or transitioned to an online session on a case-by-case basis.", "To facilitate a delay, a workshop session may be replaced with a lecture delivered in an online format.", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows UW’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 8, "course_code": "SYDE 114", "course_name": "SYDE114 - Matrices and Linear Systems (0.25)", "term_name": "1B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Matrices and Linear Systems Winter 2025", "09:00AM - 10:50AM E5 6004", "Email: victoria.ann.kerr@uwaterloo.ca", "Shene Abdalla - smabdalla@uwaterloo.ca", "Matrix algebra, inverses, solution of linear systems, determinants, eigenvalues and eigenvectors, lower-upper (LU) factorization.", "This course covers the important and routine aspects of elementary linear algebra.", "The focus is on linear systems and their solution.", "The basics of matrix and vector algebra are also covered.", "Together, these topics provide a foundation for more advanced engineering math and applications.", "In addition to analytical techniques, you will learn about numerical methods for solving linear systems and predicting the accuracy of solutions obtained.", "1: Apply appropriate analytical and computational methods for manipulating matrices and solving linear systems (1a)", "2: Assess accuracy and precision for numerical solution of a linear system (1a)", "Solution of linear equations by row reduction.", "Vectors in Rn", "Solution sets of linear systems", "Linear Transformations", "Introduction to eigenvalues and eigenvectors.", "Linear Algebra, Fourth Edition by Jim Hefferson Available free: https://leanpub.com/linalgebra", "No extensions will be given after a submission date.", "Extensions will only be given for very serious issues, and will only be considered for the following circumstances:", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as critical thinking and mathematical reasoning.", "Library for research-based assignments"]}, {"course_id": 9, "course_code": "SYDE 162", "course_name": "SYDE162 - Human Factors in Design (0.50)", "term_name": "1B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Human Factors in Design Spring 2024", "01:30PM - 03:20PM", "02:30PM - 03:20PM", "Wendy Ding", "Email: wendy.ding@uwaterloo.ca", "Email: ali.karim@uwaterloo.ca", "Design of human-machine environments, design to reduce human error.", "Analytical methods of determining user needs in systems with humans.", "Information processing and human sensory processes and consideration of these elements in the design of systems with humans.", "Human physical capabilities and consideration of these in ergonomic design.", "Prereq: 1B Systems Design Engineering.", "SYDE 162, Human Factors in Design, is the second course in the SYDE Design course sequence.", "We will extend learning from SYDE 161 Introduction to Design by focusing on user/workplace requirements as they apply to the design of human-machine systems.", "In Human Factors in Design, we will introduce students to the discipline of human factors engineering and how it informs design decisions to improve design outcomes from the perspective of overall safety and human performance.", "Students will be exposed to human factors engineering concepts and analytical techniques relating to user experience and usability design, physical workplace design, and complex system design through lectures, assignments, case studies, and tests.", "Outline and illustrate a basic understanding of human physical and psychological capabilities and how these affect a person's ability to work and interact with technology.", "Appreciate the ethical responsibilities when conducting Human Factors/User Research (GAs 8a and 10a,b,c)", "Apply risk analysis techniques to develop a complete and holistic understanding of incidents involving human error.", "Apply human factors engineering concepts to analyze case studies and real-world design problems.", "Investigate stakeholder requirements in the context of user, task, and environmental characteristics.", "Critique and recommend redesign solutions for case studies and real-world problems based on human factors analytical methods.", "Knowledge Base - Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "Problem Analysis - An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "Investigation - An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "Design - An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, and economic, environmental, cultural and societal considerations.", "Communication Skills - An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Professionalism - An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Impact of Engineering - An ability to analyze social and environmental aspects of engineering activities.", "Such ability includes an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society, the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Lifelong Learning - An ability to identify and to address their own educational needs in a changing world in ways sufficient to maintain their competence and to allow them to contribute to the advancement of knowledge.", "Week Tuesdays Thursdays Readings Deliverables and", "Course Introduction", "HF Engineering and Design", "Interviews and Questionnaires", "Set Phasers on Stun", "Business in Bhopal", "Casey Business in Bhopal", "Double Vision", "Attention and Vigilance", "Perception and Memory", "Casey Double Vision", "Decision Making", "Rental Car", "Heuristic Evaluation and Design Principles", "Automation", "Fatigue and Circadian Rhythms", "Sound & Noise", "Vision", "Energy Usage", "Tigershark & Return from Salyut", "Tigershark & Return from Salyut", "Physical Demands Analysis", "Macroergonomics", "“Designing for people: an introduction to human factors engineering.”3rd", "Students must email the instructor before the assignment deadline to use these grace days.", "Deliverable Formatting", "Grade penalties for not following formatting expectations may be applied at the discretion of the course instructor.", "Notice of Recording", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows UW’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 18, "course_code": "SYDE 285", "course_name": "SYDE285 - Materials Chemistry (0.50)", "term_name": "2A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["09:00AM - 10:50AM E5 6006", "10:00AM - 10:50AM E5 6006", "09:00AM - 09:50AM E5 6006", "Email: rroufail@uwaterloo.ca", "Office Hours: Monday 02:00 pm - 03:00 pm; Open door policy & upon request.", "Email: ahajiahm@uwaterloo.ca", "Email: alireza.ahmadi@uwaterloo.ca", "Concepts such as chemical bonding, crystal structure, phase diagram, redox reaction, and electrochemistry will be introduced in the context of materials science.", " Describe chemical, crystal structure and bond types of metals, polymers, and ceramics.", " Explain defects in material crystal structure.", " Select material & mechanical property assessment to guarantee material performance in service.", "Demonstrate understanding of concepts in natural science", "Demonstrate understanding of engineering fundamentals", "Investigation", "Gather information from relevant sources2 to address complex engineering problems", "3c", "Synthesize information from multiple sources to reach valid conclusions", "6a", "Reading Textbook Chapters", "Monday, Jan 06 Introduction to Materials Ch 1", "Monday, Jan 13 Mechanical Properties & Types of Failure Ch 6, 8", "Wednesday, Jan 15 Atomic Structure & Crystal Structure Ch 2, 3", "Monday, Jan 27 Imperfection in solids Ch 4", "Wednesday, Jan 29 Introduction to FEA and chair testing ---", "Monday, Feb 10 Material Selection Approach Slides", "9:00 am – 10:30 am at E5-6004 & E5-6006", "Wednesday, Mar 12 Project Presentation / Corrosion & Degradation!", "Monday, Jan 20 Sunday, Jan 26 Introduction to Materials, Mechanical Properties & Failure", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm and those who support others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 20, "course_code": "SYDE 252", "course_name": "SYDE252 - Linear Systems and Signals (0.50)", "term_name": "2B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Linear Systems and Signals Fall 2024", "04:30PM - 05:20PM", "Email: nmaftoon@uwaterloo.ca", "Models and analysis of linear systems.", "Discrete time systems, continuous time systems; difference and differential equations; impulse and frequency response.", "Complex frequency, functions of complex variables, transform domain techniques: Z transforms; Fourier analysis, Laplace transform.", "Transfer functions and frequency response, frequency domain analysis of linear systems; sampling theory, stability, and linear filters.", "Through these interactions we can identify systems, manipulate them or design systems that help us in one way or another.", "Sometimes we do this the other way around: we are interested in a signal (e.g., a clinical image) and we design a system to give us the useful signal to extract specific useful information.", "Perform time domain and frequency domain analysis of continuous-time and discrete- time signals and systems using convolution, Laplace transform, z-transform and Fourier analysis [", "Design filters and perform signal processing and filtering [", "Numbers in brackets refer to their Associated C.E.A.B Graduate attributes", "Week of", "----", "----", "----", "MID-TERM WEEK", "3rd Edition", "2nd Edition", "Week of", "Book sections to read", "Book sections to skim", "Book sections to read", "Book sections to skim", "Convolution sum & Convolution integral 3.8; 2.4;   3.8; 2.4", "MID-TERM WEEK", "Lathi & Green, Linear Systems and Signals, 3rd edition, Oxford University Press (or its 2nd edition)", "Matlab Access", "Remote access:https://uwaterloo.ca/engineering-computing/remote-desktop-connection", "Each of these assignments may include analytical, numerical (using Matlab, or a language of your choice) and explanatory components exploring fundamental aspects of the material covered in the course.", "Students will work in teams of 4 to create a signal-processing program for cochlear implants.", "Late project submission rules", "If your team misses a phase submission deadline, your team can still submit the deliverables of the phase for a maximum half of the grade for that phase.", "This course includes the independent development and practice of specific skills, such as system design, filter design and signal processing.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 21, "course_code": "SYDE 262", "course_name": "SYDE262 - Engineering Economics of Design (0.50)", "term_name": "2B Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Engineering Economics of Design Fall 2024", "jessie.ma@uwaterloo.ca", "11:30AM - 12:20PM E7 4433", "jessie.ma@uwaterloo.ca", "Jessie Ma | jessie.ma@uwaterloo.ca | E7-6304", "Topics include microeconomics, supply, demand and external costs in the context of systems design.", "Evaluate and compare alternatives for an engineering firm's financial decisions (GA 11a, 11b)", "Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)", "Create a business plan for an engineering firm, accounting for uncertainty in economic and environmental aspects (GA 9a, 9b)", "Identify external costs in the context of systems design, including the use of sustainability indicators (GA 9a, 9b)", "1 Sep 2 Introduction Introduction", "3 Sep 16   Decision Making - Cash Flow Series Patters Assignment 1 posted Evaluate and compare alternatives for an engineering firm's financial decisions (GA 11a, 11b) Excel", "4 Sep 23   Decision Making 2 - Basic Evaluation Methods   Evaluate and compare alternatives for an engineering firm's financial decisions (GA 11a, 11b) Excel", "5 Sep 30   Decision Making 3 - Analysis Period & Project Lives; Risk Analysis Assignment 1 due Oct 4 Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)  Excel", "6 Oct 7 2. Context - Looking Outside Entrepreneurship   Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)", "9 Oct 28   Intrapreneurship; Evaluation of Complex Projects (Replacement Analysis, Life Cycle Costs, Benefit-Cost Analysis) Group Project posted Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)", "Identify external costs in the context of systems design, including the us of sustainability indicators (GA 9a, 9b)", "Identify external costs in the context of systems design, including the us of sustainability indicators (GA 9a, 9b)", "12 Nov 18   Business Plans; Markets   Create a business plan for an engineering firm, accounting for uncertainty in economic and environmental aspects (GA 9a, 9b) Excel", "Notice of Recording", "Sign your email with your first and last name and your student number.", "There could be a need to make alternate arrangements for in-person course activities.", "This alternate arrangement could be for a short period of time (e.g., one week) or a more sustained disruption to in-person course activities.", "Impacted in-person deliverables will be handled on a case-by-case basis with notification provided as soon as possible (see COVID-19-Related Absences and Short-Term Absences below).", "They will review your case and coordinate a reasonable and fair plan in consultation with appropriate others.", "Laptops, Tablets, and Electronic Devices", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.", "A.A.S. also offers learning strategy supports to all students that can be accessed through:", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 27, "course_code": "SYDE 361", "course_name": "SYDE361 - Systems Design Methods 1: Needs Analysis and Prototyping (0.50)", "term_name": "3A Term", "program_name": "Systems Design Engineering", "program_id": 158, "major_id": 5, "major_name": "Systems Design Engineering (Bachelor of Applied Science - Honours)", "topics": ["Systems Design Methods 1: Needs Analysis and Prototyping Spring 2024", "10:00AM - 11:20AM E7 4417", "01:30PM - 03:20PM", "01:30PM - 03:20PM", "Email: rroufail@uwaterloo.ca", "Email: cyoung@uwaterloo.ca", "Email: jerrin.bright@uwaterloo.ca", "Email: aria.hajiahmadi@uwaterloo.ca", "Office: E7-6303", "The methodology of design, situation of concern; needs analysis and problem definition, engineering analysis and generation of alternative solutions, design prototyping, and design documentation.", "Prereq: 3A Systems Design Engineering.", "Reinforce the iterative, user-centered design process taught in the SYDE program", "Provide experience with mathematical modelling and analysis to support the design process", "Provide experience with physical design prototyping", "Advance use of applied science in the design, prototyping, and testing of complex projects", "2) Carry out systematic design methods for complex systems.", "3) Conduct an appropriate engineering model of an electromechanical system.", "5) Evaluate the sustainability of the selected design considering economic, environmental, and social impact.", "6) Communicate technical design effectively through both oral reports and written reports.", "The alpha numeral in brackets refers to CEAB graduate attributes.", "Introduction & Planning", "User Needs", "Welcome and Safety + User Needs Brainstorming and Test Planning", "Design Process:", "Specs and Standards", "Morphology Design", "Group A: Electrical Device Characterization (User Needs) Group B: Generator Output Characterization - Brainstorming and Test Planning", "Literature Review on Energy Harvesting Technology Group B: Electrical Device Characterization (Generator Output) Group A: Power Supply Circuit Design and Planning", "Midterm at 9:30 AM Room E5 6004 & 6006", "Group A/B: Power Supply Test Days", "7 June 18/20 Systems Design Integration & Design an Experiment Group A: Fluid Flow Device Characterization (Flow) Group B: Fluid Flow Device Characterization (Mechanical)", "8 June 25/27 Project Work Period (Design Experimental Plan) Group A/B: Design Session", "Fundamentals and Applications of Renewable Energy. 2nd", "Engineering Design Methods, Strategies for Product Design, Cross, N, 5th ed.", "The Engineering Design of Systems, Models and Methods, Buede, D., Miller, W., 4th ed.", "Deliverables and Milestones", "SYDE 361 - S2024", "Design Plan Report", "THA", "TBD", "Late or Missed Course Deliverables & Milestones:", "A fraction of the day i.e. hour(s) after deadline of submission counts as a day.", "If you encounter technical difficulties that limit your ability to submit deliverables, keep a clear record and communicate the issues with the instructor and the SYDE Undergraduate Administrative Coordinator as soon as possible.", "Extensions will NOT be given after a submission date.", "Extensions will be given for very serious issues, and will ONLY be considered for the following circumstances:", "Marking of Team-Based Deliverables:", "Sanctioned Collaboration vs. Individual Work", "Collaboration is allowed for in-class exercises and the team components of design projects.", "Accurate and Honest Reporting", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}]