[{"course_id": 4, "course_code": "CS 116", "course_name": "CS116 - Introduction to Computer Science 2 (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Introduction to Computer Science 2 Winter 2025", "Monday -", "Monday", "07:00PM - 08:50PM", "E. Dupont", "E. Dupont", "E. Dupont", "10:00AM - 11:20AM MC 4045", "02:30PM - 03:20PM", "08:30AM - 09:20AM", "09:30AM - 10:20AM MC 4042", "10:30AM - 11:20AM MC 4060", "11:30AM - 12:20PM MC 4060", "02:30PM - 03:20PM", "This course builds on the techniques and patterns learned in CS115 while making the transition to use of an imperative language.", "Use higher-order functions to improve the readability and efficiency of programs", "Describe the basic memory model for mutation of basic types, lists, and objects in Python", "Distinguish between constant, linear, quadratic, and exponential running times of algorithms", "Write useful Python programs using console and file input and output for practical tasks", "All times are given in Eastern Time.", "Important!", "In order to maintain a level of success in the course, students should not miss the completion of any modules.", "Students should check their basic tests email to ensure that the code meets the specification exactly.", "Please make sure you do this often!", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 6, "course_code": "CS 146", "course_name": "CS146 - Elementary Algorithm Design and Data Abstraction (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Elementary Algorithm Design and Data Abstraction (Advanced Level)", "Monday -", "Monday", "07:00PM - 08:50PM", "02:30PM - 03:20PM", "Brad In-person MC 6427", "On-line Consulting Hours: Microsoft Teams", "CS 146: Elementary Algorithm Design and Data Abstraction (advanced version)", "To familiarize students with key concepts in introductory computer science from an imperative perspective and to contrast this with the functional perspective taken in CS 145;", "To allow students to complete the CS portion of their Math core requirements and, if desired, to continue on to second-year core courses in CS;", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "Introduction to C and elementary mutation in Scheme", "The memory model.", "Variable declaration, assignment and infix expressions in C. Basic I/O in C. Compilation.", "Algorithm analysis in C. File I/O in C and Scheme.", "Program organization and testing methods.", "Space analysis in C and Scheme.", "Mutable lists, queues, deques, and trees in C. Time-space tradeoffs among mutable and immutable ADT implementations.", "Low-level abstractions", "Pointer arithmetic in C. Arrays in C and vectors in Scheme.", "Strings in C. Elementary hashing.", "Libraries in C and Scheme.", "Implementing high-level abstractions", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "The provided slides are not a substitute for attendance in any first-year CS course, but in CS 146, there are no slides, and the lecture summaries made available after lecture are an even worse substitute for attendance.", "Lectures will involve the development of ideas summarized very tersely in the handouts, as well as on-the-fly development of code, analyses, and proofs.", "CS145 and CS146 were originally designed as a year-long unit of curriculum, but eventually the individual courses drifted in their own directions.", "1.1 A note on logistics", "1.2 Review of forms of recursion and associated proof techniques", "1.3 In preparation for side effects", "1.4 Output", "1.5 Input", "1.6 First Introduction to C", "1.8 Memoization", "1.9 Mutation in C", "1.11 Boxes in C", "1.12 Advanced mutation", "1.13 Aliasing in C", "1.14 Memory and vectors", "1.15 Vectors in Racket", "1.16 Arrays in C", "1.18 ADTs in C; Amortized Analysis", "2 SIMPL: a simple imperative language", "2.1 Syntax and informal semantics", "2.2 Examples in several languages", "2.3 Formal semantics", "2.5 Proving imperative programs correct", "A primitive imperative language", "3.1 A primitive imperative language", "3.2 The PRIMPL simulator", "3.4 The SIMPL to A-PRIMPL compiler", "3.6 Strings in C", "3.7 Adding functions to SIMPL", "3.8 Adding both arrays and functions to SIMPL", "3.9 Implementing lists in PRIMPL", "4 MMIX: a realistic instruction set", "4.1 A more realistic processor", "4.2 The MMIX architecture", "4.2.1 Branches and Jumps", "4.2.2 Example", "4.2.3 Software Interrupts", "4.2.5 A Problem with Branches and Jumps", "4.4 Towards a SIMPL to MMIX compiler", "5.1 Storing primitive values", "5.3 Managing memory", "5.4 Structural and pointer equality", "5.5 Function application in a Racket interpreter", "5.7 Justifying the cost of Racket primitives", "5.8 Moving towards implementation in an imperative language", "6.2 Zippers", "6.3 A continuation-passing interpreter", "6.6.2 Mark-and-sweep", "6.6.3 Copying garbage collection", "6.7 Heterogeneous Data in C", "6.8 Multidimensional Arrays in C", "6.10 Variable-length Argument Lists", "7.1 Continuation-passing style", "7.2 Exception handling", "7.3 Undelimited continuations", "7.4 Delimited continuations", "7.5 Racket’s implementation of continuations", "In CS 146, we will examine the imperative paradigm, and compare and contrast the way that efficient algorithms and data structures are designed in imperative and functional languages.", "Racket is a laboratory for current research on aspects of functional programming languages, and we will continue to look at interesting topics in this area, perhaps at the cost of some coherency in the flow of material.", "They will not be due each week on the same day, as is common in the other first-year CS courses and the first-year Math courses.", "Assignment questions are the main way to reinforce and deepen your understanding of the concepts and skills discussed in lecture.", "You will submit program files electronically to the Marmoset system , which runs tests on your code and informs you of the results fairly rapidly.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "(Please also note that we may use the trends in a student's submission history to estimate the likelihood of other forms of cheating as well.)", "Library for research-based assignments"]}, {"course_id": 7, "course_code": "MATH 106", "course_name": "MATH106 - Applied Linear Algebra 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Applied Linear Algebra 1 Winter 2025", "Systems of linear equations.", "Introduction to vector spaces.", "We will see how to solve systems of linear equations using matrix methods before studying matrices as algebraic objects in their own right.", "Next, we will learn about the fundamental concepts of span, linear independence, and basis and learn how to determine whether a set is a subspace of Rn.", "After studying subspaces, we will study linear mappings, which map subspaces to subspaces.", "We will discuss the geometric interpretation of these mappings and study their fundamental subspaces.", "Finally, we will learn how to calculate the determinant of a matrix and use this knowledge to diagonalize square matrices.", "Provide a graphical and algebraic description of vectors, lines, and planes in R^n", "Model and solve mathematical and discipline-specific problems using systems of linear equations", "Perform basic algebraic operations on matrices", "Given a set of vectors in R^n, determine whether it is linearly independent, a spanning set of R^n, or a basis of R^n", "Given a basis and a vector in standard coordinates, use matrix methods to calculate its coordinate vectors", "Given a set in R^n, determine whether it is a subspace of R^n", "Given a mapping L: R^n --> R^m, determine whether it is linear", "Given a linear mapping, choose the appropriate algorithm find a basis for each of its fundamental subspaces", "Given a square matrix, calculate its determinant and provide a geometric interpretation of this value", "Communicate ideas and concepts relating to linear algebra using accurate mathematical language and notation", "Calculators", "Avoiding Academic Offences", "I am committed to creating a learning environment where diverse perspectives are recognized and valued as a source of strength.", "School-Life Conflict"]}, {"course_id": 9, "course_code": "MATH 115", "course_name": "MATH115 - Linear Algebra for Engineering (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Linear Algebra for Engineering Fall 2024", "02:30PM - 03:20PM", "RCH 301", "RCH 301", "10:30AM - 11:20AM E7 5353", "02:30PM - 03:20PM", "E. Dupont", "03:30PM - 04:20PM E7 5343", "10:30AM - 12:20PM RCH 301", "10:30AM - 12:20PM", "PHY 313", "E. Dupont", "08:30AM - 09:20AM", "08:30AM - 10:20AM PHY 313", "08:30AM - 10:20AM RCH 309", "10:30AM - 11:20AM RCH 103", "11:30AM - 12:20PM RCH 103", "RCH 204", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "08:30AM - 10:20AM EV3 4412", "08:30AM - 10:20AM MC 4058", "02:30PM - 03:20PM", "09:30AM - 10:20AM RCH 302", "F. Al-Faisal", "10:30AM - 12:20PM MC 4063", "10:30AM - 12:20PM MC 4060", "10:30AM - 11:20AM RCH 110", "F. Al-Faisal", "03:30PM - 04:20PM", "02:30PM - 04:20PM MC 4060", "DWE 3522", "Tuesday -", "07:00PM - 08:50PM", "Linear equations, matrices, and determinants.", "Introduction to vector spaces.", "Eigenvalues and diagonalization.", "Present solutions to problems in a clear and logical manner with all steps being fully justified.", "Understand the basic operations of addition and scalar multiplication as they apply to vectors, matrices and linear transformations.", "Find the solution to a system of linear equations using matrices and elementary row operations.", "Understand matrix algebra and its connection to systems of equations.", "Have both a geometric and an algebraic understanding of span, linear independence, bases and subspaces.", "Recognize the link between matrices and linear transformations, and understand that many common geometric operations such as projections, reflections and rotations are linear transformations.", "Develop a basic algebraic and geometric understanding of complex numbers and complex polynomials.", "Determine the eigenvalues and eigenvectors of a matrix and diagonalize a matrix.", "1.1 Vectors in Rn", "1.2 Linear Combinations", "1.3 The Norm and the Dot Product", "1.4 Vector Equations of Lines and Planes", "1.5 The Cross Product in R3", "1.6 The Scalar Equation of Planes in R3", "1.7 Projections", "Chapter 2 Systems of Linear Equations", "2.1 Introduction and Terminology", "2.2 Solving Systems of Linear Equations", "2.3 Rank", "2.4 Homogeneous Systems of Linear Equations", "3.1 Matrix Algebra", "3.2 The Matrix-Vector Product", "3.3 The Matrix Equation Ax=b", "3.4 Matrix Multiplication", "3.5 Matrix Inverses", "4.1 Spanning Sets", "4.2 Geometry of Spanning Sets", "4.3 Linear Dependence and Linear Independence", "4.4 Subspaces of Rn", "4.5 Bases and Dimension", "4.6 Fundamental Subspaces of a Matrix", "Chapter 5 Linear Transformations", "5.1 Matrix Transformations and Linear Transformations", "5.2 Examples of Linear Transformations", "5.3 Operations on Linear Transformations", "5.4 Inverses of Linear Transformations", "5.5 The Kernel and the Range", "Chapter 6 Determinants", "6.1 Determinants and Invertibility", "6.2 Elementary Row and Column Operations", "6.3 Properties of Determinants", "7.1 Basic Operations", "7.2 Conjugate and Modulus", "7.3 Polar Form", "7.4 Complex Polynomials", "7.5 Complex nth Roots", "Chapter 8 Eigenvalues and Eigenvectors", "8.1 Introduction", "8.2 Computing Eigenvalues and Eigenvectors", "8.3 Eigenspaces", "8.4 Diagonalization", "8.5 Powers of Matrices", "Linear Algebra for Engineering Fall 2024 Course Notes Required text provided on LEARN Yes", "Linear Algebra with Applications by Keith Nicholson Optional text provided on LEARN No", "The Linear Algebra for Engineering Fall 2024 Course Notes is the required text for this course, and is available on LEARN.", "The text Linear Algebra with Applications is an optional text also available on LEARN for those students looking for an alternate exposition of the material and/or additional problems to work on.", "Students looking for extra practice beyond the course notes are welcome to attempt problems in the corresponding sections of the optional textbook.", "Python Assignments: Throughout the term, there will be 5 equally weighted assignments where students will use python to execute some prewritten code in an effort to explore some larger-scale applications of linear algebra.", "If you find yourself in a situation where you are missing multiple assessments, then you are advised to contact both your instructor and the First Year Engineering Office to make sure you have the proper supports in place to succeed in this courses.", "To be clear - such websites are not allowed to be used for the completion of any part of the course MATH 115, and students are not permitted to share questions from the course anywhere.", "Generative AI: This course includes the independent development and practice of specific skills, such as computations, problem solving and proof writing.", "Library for research-based assignments"]}, {"course_id": 13, "course_code": "MATH 118", "course_name": "MATH118 - Calculus 2 for Engineering (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["10:30AM - 11:20AM RCH 110", "02:30PM - 03:20PM", "RCH 306", "09:30AM - 10:20AM RCH 105", "RCH 306", "10:30AM - 11:20AM RCH 103", "RCH 204", "02:30PM - 03:20PM", "02:30PM - 04:20PM MC 4060", "Monday -", "Monday", "Linear and separable first order differential equations, applications.", "Parametric curves and polar coordinates, arc length and area.", "Get experience in writing well-organized and readable mathematical solutions, so that you will be able to communicate mathematical or technical ideas.", "Select an appropriate integration technique and apply it to solve indefinite or definite integrals.", "Find a power series representation of a function and find a closed form for a function represented by a power series.", "Understand the formal definition of the limit of a sequence and use it to prove basic limits.", "Understand the principle of mathematical induction and use it to prove some mathematical statements.", "Integration by substitution (review)", "Integration by parts (review)", "Trigonometric integrals", "Trigonometric substitution and completing the square", "Partial fractions", "Numerical integration", "Error bounds for numerical integration", "Improper integrals", "First make up lecture occurs", "Separable DEs, linear first-order DEs", "Applications of DEs", "Sequences, limits of sequences", "Recursively-defined sequences, mathematical induction", "Appendix A", "Integral test, p-series", "Comparison tests", "Second make up lecture occurs", "-", "Winter reading week", "-", "Absolute vs. conditional convergence", "Ratio and root tests", "Estimating sums", "Power series", "Taylor and Maclaurin series", "Sums of power series", "Applications of series", "Parametric equations", "Polar coordinates, polar curves", "Area and arc length of polar curves", "In particular:"]}, {"course_id": 15, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 18, "course_code": "STAT 321", "course_name": "STAT321 - Regression and Forecasting (Non-Specialist Level) (0.50)", "term_name": "Required Courses", "program_name": "Mathematics", "program_id": 108, "major_id": 3, "major_name": "Mathematics Minor", "topics": ["Regression and Forecasting (Non-Specialist Level)", "10:00AM - 11:20AM E2 1732", "Modeling the relationship between a response variable and several explanatory variables via regression models.", "Model diagnostics and improvement.", "Identify situations and data for which a linear regression model might be an appropriate method of statistical analysis.", "Develop and fit linear models to datasets using the R programming language.", "Use graphical and numerical analyses to determine whether the fitted model is appropriate with respect to the underlying model assumptions.", "Interpret regression results and draw conclusions in the context of the study, and communicate these conclusions to disparate interest groups.", "Explain the mathematical theory behind the results and output from a regression analysis, including the derivation of the distributions of model parameter estimators.", "Apply linear regression models to time series data to model seasonal and trend components.", "Explain the mathematical theory behind the results and output from a regression analysis, including the derivation of the distributions of model parameter estimators.", "Apply linear regression models to time series data to model seasonal and trend components.", "Apply a first-order auto-regressive (AR(1)) model to stationary data, and interpret the results.", "Introduction/Overview", "Simple linear regression review:", "Graphical and numerical summaries of bivariate data", "The simple linear regression model", "Assumptions of the normal model", "Least squares estimation of β0 and β1", "Least squares estimation of σ2", "Interpretation of parameter estimates", "Distribution of", "Confidence intervals and hypothesis tests for β1", "Multiple linear regression:", "The normal model", "Least squares estimation of β", "The hat matrix", "Least squares estimation of σ2", "Distribution of", "Confidence intervals and hypothesis tests for β", "Confidence intervals for µnew and prediction intervals for Ynew", "Modelling categorical variables", "Inference for model parameters", "Analysis of Variance (ANOVA)", "ANOVA table and the F-test", "Additional sum of squares", "Analysis of Variance (ANOVA) (cont'd)", "Indicator variates and additional sum of squares", "General linear hypothesis", "Model Assumptions", "Addressing model inadequacies", "Distribution of e", "Leverage and influential observations", "Model selection", "Sequential methods of model selection", "Interaction", "Waterloo Faculty Salary case study", "Introduction to Forecasting:", "Introduction to time series", "Autocorrelation function (acf)", "Fitting linear models to time series data", "Stationary processes", "Forecasting with the AR(1) model", "Differencing", "Smoothing methods of forecasting", "Moving average smooth", "EWMA smooth", "Introduction to Regression Modelling, by B. Abraham and J. Ledolter (Brooks/Cole pub.)", "Answers to questions requiring verbal explanations must be in your own words.", "In-person concept quizzes will be replaced with online quizzes", "Instructor INC Policy for STAT 321: In the case of a missed final exam with supporting documentation, an INC grade will only be awarded if both the following conditions are satisfied:"]}, {"course_id": 1, "course_code": "CO 370", "course_name": "CO370 - Deterministic OR Models (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 1, "major_name": "Business Administration and Mathematics Double Degree (Bachelor of Business Administration and Bachelor of Mathematics - Honours)", "topics": ["Deterministic OR Models Winter 2025", "Mahtab Alghasi: Wednesdays from 11am-12pm in MC5488", "An applications-oriented course that illustrates how various mathematical models and methods of optimization can be used to solve problems arising in business, industry, and science.", "Formulate computational tasks as optimization problems of appropriate type", "Understand optimization concepts surrounding real world challenges (sensitivity analysis, robust optimization, stochastic optimization)", "Have some familiarity with algorithmic techniques and heuristics for solving optimization problems", "Part I: Formulations", "Flows", "Integer Programs that reduce to Linear Programs", "Part 2: Real World Challenges that can be addressed in Optimization", "Robust optimization", "Stochastic Optimization", "Part 3: Algorithms and Heuristics for Solving Optimization", "Branch and Bound", "Please sign yourself up at", "A missed test will be treated the same as a mark of zero.", "The answer to most common issues as well as how-to videos can be found at", "To avoid issues, only use your UWaterloo email, never use multiple email addresses.", "Illnesses and INC", "In case of a", "short period of illness and a strong performance in the course we should be able to simply", "Copyright Information"]}, {"course_id": 3, "course_code": "STAT 371", "course_name": "STAT371 - Applied Linear Models and Process Improvement for Business (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 1, "major_name": "Business Administration and Mathematics Double Degree (Bachelor of Business Administration and Bachelor of Mathematics - Honours)", "topics": ["Applied Linear Models and Process Improvement for Business Winter 2025", "08:30AM - 09:50AM RCH 307", "Practical and theoretical aspects of simple and multiple linear regression models.", "Strategies for variation reduction such as control charting.", "Applications to problems in business.", "View requirements for STAT 371", "Develop appropriate and meaningful linear regression models to fit to data from business, finance, and other fields for the purpose of answering relevant questions about relationships between the response and explanatory variables in a population or process of interest.", "Use the programming language, R, to fit regression models and to explore course concepts.", "Interpret regression results from R output, draw conclusions from these results in the context of the study, and effectively communicate these results and conclusions to disparate audiences and interest groups.", "Use graphical and numerical analyses to determine whether the fitted model is appropriate with respect to its underlying model assumptions.", "Employ model selection methods and model improvement techniques to improve the fit of the model.", "Explain the mathematical theory behind the results and output from a regression analysis, including the derivation of the distributions of model parameter estimators.", "To understand and apply the statistical concepts, theory and techniques necessary to monitor and assess process performance.", "Simple linear regression review:", "Graphical and numerical summaries of bivariate data", "The simple linear regression model", "Assumptions of the normal model", "Least squares estimation of β0 and β1", "Least squares estimation of σ2", "Interpretation of parameter estimates", "Distribution of", "Confidence intervals and hypothesis tests for β1", "Multiple linear regression:", "The normal model", "Least squares estimation of β", "The hat matrix", "Least squares estimation of σ2", "Distribution of", "Confidence intervals and hypothesis tests for β", "Confidence intervals for µnew and prediction intervals for Ynew", "Modelling categorical variables", "Inference for model parameters", "Analysis of Variance (ANOVA)", "Introduction", "ANOVA table and the F-test", "Additional sum of squares", "Analysis of Variance (ANOVA) (cont'd)", "Indicator variates and additional sum of squares", "General linear hypothesis", "Model Assumptions", "Addressing model inadequacies", "Distribution of residual vector, e", "Leverage and influential observations", "Model selection", "Sequential methods of model selection", "Interaction", "Waterloo Faculty Salary case study", "Fitting linear models to time series data", "Introduction", "Modelling seasonal and trend components", "Mar. 24 - 28", "Introduction to Process Performance", "Introduction", "Control charts", "Average run length", "3-sigma control limits and other signals of process instability", "Control charts for count data", "CUSUM and EWMA control charts", "Housing bubble article example", "Introduction to Regression Modelling, by B. Abraham and J. Ledolter (Brooks/Cole pub.)", "compassionate grounds", "Answers to questions requiring verbal explanations must be in your own words.", "Please be sure to read the posted Assignment Information and Guidelines document for important assignment and submission information (in particular, be sure you understand the 72-hour grace period policy for each assignment).", "In-person concept quizzes will be replaced with online quizzes", "Instructor INC Policy for STAT 371: In the case of a missed final exam with supporting documentation, an INC grade will only be awarded if both the following conditions are satisfied:"]}, {"course_id": 4, "course_code": "STAT 372", "course_name": "STAT372 - Survey Sampling and Experimental Design Techniques for Business (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 1, "major_name": "Business Administration and Mathematics Double Degree (Bachelor of Business Administration and Bachelor of Mathematics - Honours)", "topics": ["Survey Sampling and Experimental Design Techniques for Business Winter 2025", "04:00PM - 05:20PM", "E-mail: cboudreau@uwaterloo.ca", "Design and analysis of surveys.", "Management of sample and non-sample error.", "Analysis of variance, factorial experiments, and interaction.", "Basic quantities and definitions", "Inclusion probabilities", "Sampling design", "Horvitz-Thompson estimator", "Horvitz-Thompson estimator under SRS", "Estimating population means, totals and proportions under SRS", "Confidence intervals", "R survey package", "Horvitz-Thompson estimator under STSRS", "Estimating population means, totals and proportions under STSRS", "Confidence intervals", "Sample allocation under STSRS", "Estimating ratios", "Ratio estimator", "Introduction to Hájek estimator", "Chap 5: Clustering and two-stage sampling", "Horvitz-Thompson estimator under two-stage sampling", "SRS-SRS and STSRS-SRS sampling design", "Hájek estimator", "PPS sampling", "Part 2 – Experimental Design", "One-way ANOVA model", "Sum of squares and ANOVA table", "F test", "Estimating factor level means", "Multiple comparisons", "Diagnostic", "Sum of squares and ANOVA table", "F tests", "Analysis when no interaction", "Analysis with interactions", "Diagnostic", "Randomized block design model", "Sum of squares and ANOVA table", "F tests", "Analysis of treatment effects", "I will mostly use slides that I will post on the Stat 372 LEARN website.", "I’m planning to post the slides Monday and Wednesday evenings.", "There is a companion book, entitled R Companion for Sampling Design and Analysis, which can be downloaded for free (pdf format) here.", "Carl-Erik Särndal was my master thesis supervisor, and his book greatly influenced my Stat 372 slides and teaching.", "This is a truly excellent textbook, which explains concepts and theory extremely well and nicely."]}, {"course_id": 5, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 1, "major_name": "Business Administration and Mathematics Double Degree (Bachelor of Business Administration and Bachelor of Mathematics - Honours)", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 4, "course_code": "CO 370", "course_name": "CO370 - Deterministic OR Models (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Deterministic OR Models Winter 2025", "Mahtab Alghasi: Wednesdays from 11am-12pm in MC5488", "An applications-oriented course that illustrates how various mathematical models and methods of optimization can be used to solve problems arising in business, industry, and science.", "Formulate computational tasks as optimization problems of appropriate type", "Understand optimization concepts surrounding real world challenges (sensitivity analysis, robust optimization, stochastic optimization)", "Have some familiarity with algorithmic techniques and heuristics for solving optimization problems", "Part I: Formulations", "Flows", "Integer Programs that reduce to Linear Programs", "Part 2: Real World Challenges that can be addressed in Optimization", "Robust optimization", "Stochastic Optimization", "Part 3: Algorithms and Heuristics for Solving Optimization", "Branch and Bound", "Please sign yourself up at", "A missed test will be treated the same as a mark of zero.", "The answer to most common issues as well as how-to videos can be found at", "To avoid issues, only use your UWaterloo email, never use multiple email addresses.", "Illnesses and INC", "In case of a", "short period of illness and a strong performance in the course we should be able to simply", "Copyright Information"]}, {"course_id": 11, "course_code": "STAT 371", "course_name": "STAT371 - Applied Linear Models and Process Improvement for Business (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Applied Linear Models and Process Improvement for Business Winter 2025", "08:30AM - 09:50AM RCH 307", "Practical and theoretical aspects of simple and multiple linear regression models.", "Strategies for variation reduction such as control charting.", "Applications to problems in business.", "View requirements for STAT 371", "Develop appropriate and meaningful linear regression models to fit to data from business, finance, and other fields for the purpose of answering relevant questions about relationships between the response and explanatory variables in a population or process of interest.", "Use the programming language, R, to fit regression models and to explore course concepts.", "Interpret regression results from R output, draw conclusions from these results in the context of the study, and effectively communicate these results and conclusions to disparate audiences and interest groups.", "Use graphical and numerical analyses to determine whether the fitted model is appropriate with respect to its underlying model assumptions.", "Employ model selection methods and model improvement techniques to improve the fit of the model.", "Explain the mathematical theory behind the results and output from a regression analysis, including the derivation of the distributions of model parameter estimators.", "To understand and apply the statistical concepts, theory and techniques necessary to monitor and assess process performance.", "Simple linear regression review:", "Graphical and numerical summaries of bivariate data", "The simple linear regression model", "Assumptions of the normal model", "Least squares estimation of β0 and β1", "Least squares estimation of σ2", "Interpretation of parameter estimates", "Distribution of", "Confidence intervals and hypothesis tests for β1", "Multiple linear regression:", "The normal model", "Least squares estimation of β", "The hat matrix", "Least squares estimation of σ2", "Distribution of", "Confidence intervals and hypothesis tests for β", "Confidence intervals for µnew and prediction intervals for Ynew", "Modelling categorical variables", "Inference for model parameters", "Analysis of Variance (ANOVA)", "Introduction", "ANOVA table and the F-test", "Additional sum of squares", "Analysis of Variance (ANOVA) (cont'd)", "Indicator variates and additional sum of squares", "General linear hypothesis", "Model Assumptions", "Addressing model inadequacies", "Distribution of residual vector, e", "Leverage and influential observations", "Model selection", "Sequential methods of model selection", "Interaction", "Waterloo Faculty Salary case study", "Fitting linear models to time series data", "Introduction", "Modelling seasonal and trend components", "Mar. 24 - 28", "Introduction to Process Performance", "Introduction", "Control charts", "Average run length", "3-sigma control limits and other signals of process instability", "Control charts for count data", "CUSUM and EWMA control charts", "Housing bubble article example", "Introduction to Regression Modelling, by B. Abraham and J. Ledolter (Brooks/Cole pub.)", "compassionate grounds", "Answers to questions requiring verbal explanations must be in your own words.", "Please be sure to read the posted Assignment Information and Guidelines document for important assignment and submission information (in particular, be sure you understand the 72-hour grace period policy for each assignment).", "In-person concept quizzes will be replaced with online quizzes", "Instructor INC Policy for STAT 371: In the case of a missed final exam with supporting documentation, an INC grade will only be awarded if both the following conditions are satisfied:"]}, {"course_id": 12, "course_code": "STAT 372", "course_name": "STAT372 - Survey Sampling and Experimental Design Techniques for Business (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Survey Sampling and Experimental Design Techniques for Business Winter 2025", "04:00PM - 05:20PM", "E-mail: cboudreau@uwaterloo.ca", "Design and analysis of surveys.", "Management of sample and non-sample error.", "Analysis of variance, factorial experiments, and interaction.", "Basic quantities and definitions", "Inclusion probabilities", "Sampling design", "Horvitz-Thompson estimator", "Horvitz-Thompson estimator under SRS", "Estimating population means, totals and proportions under SRS", "Confidence intervals", "R survey package", "Horvitz-Thompson estimator under STSRS", "Estimating population means, totals and proportions under STSRS", "Confidence intervals", "Sample allocation under STSRS", "Estimating ratios", "Ratio estimator", "Introduction to Hájek estimator", "Chap 5: Clustering and two-stage sampling", "Horvitz-Thompson estimator under two-stage sampling", "SRS-SRS and STSRS-SRS sampling design", "Hájek estimator", "PPS sampling", "Part 2 – Experimental Design", "One-way ANOVA model", "Sum of squares and ANOVA table", "F test", "Estimating factor level means", "Multiple comparisons", "Diagnostic", "Sum of squares and ANOVA table", "F tests", "Analysis when no interaction", "Analysis with interactions", "Diagnostic", "Randomized block design model", "Sum of squares and ANOVA table", "F tests", "Analysis of treatment effects", "I will mostly use slides that I will post on the Stat 372 LEARN website.", "I’m planning to post the slides Monday and Wednesday evenings.", "There is a companion book, entitled R Companion for Sampling Design and Analysis, which can be downloaded for free (pdf format) here.", "Carl-Erik Särndal was my master thesis supervisor, and his book greatly influenced my Stat 372 slides and teaching.", "This is a truly excellent textbook, which explains concepts and theory extremely well and nicely."]}, {"course_id": 17, "course_code": "AFM 231", "course_name": "AFM231 - Business Law (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["07:00PM - 09:50PM", "Students can contact the course instructor via email at rhussein@uwaterloo.ca.", "Particular attention is given to the law relating to contracts and business organizations.", "AFM 231: View requirements for AFM 231", "While the course introduces you to basic concepts in law, it is designed for, and particularly emphasizes topics that will be of specific relevance to you as future business managers, owners, or even practicing professionals.", "This includes understanding the basics of legal risk so you can make more effective business decisions.", "Business managers/owners often must engage in risk management exercises.", "Appreciate the complexity of integrating multiple private law concepts into the analysis of a business situation.", "Utilize a basic framework for legal risk management assessments and generate an inventory of possible legal risk management tools.", "Describe the common as well as contrasting relationship between legal compliance and ethical conduct.", "March 24-28", "Wrap-up", "Accordingly, if students do opt to use an older edition it would be advisable to use an edition that is as close to the 8th edition as possible and consider cross-referencing it to the current edition and noting any differences.", "Completion", "The response demonstrates a clear understanding of the relevant course concepts and effectively applies these concepts to the hypothetical scenario.", "Application to Real-World Example", "The response includes an appropriate real-world example that relates to the course material, illustrating how the concept can be applied outside the context of the hypothetical.", "Students may also include a revised answer based on a similar but different set of hypothetical facts.", "For example, a student may propose one solution based on the given facts but suggest a different solution if the facts were altered.", "Students are expected to demonstrate critical thinking and clearly articulate their reasoning.", "Each quiz covers content that relates to the current course content (the current chapters and occasionally a prior chapter as well if it has not yet been part of a quiz).", "Submission Times", "Reevaluation Request", "Requests for re-evaluation of submitted material can be done via email.", "Also, students should detail what their concern as specifically as possible.", "Artificial Intelligence Tools", "Also, some evaluation elements are structured such that it may be even quicker to do it yourself than to utilize an AI tool and then further edit/revise before submission.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 23, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 25, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 27, "course_code": "MSE 211", "course_name": "MSE211 - Organizational Behaviour (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Sofiia Doroshenko <sdoroshenko@uwaterloo.ca>", "Introduction to the concepts of learning, person perception, attitudes, and motivation in an organization.", "Discussion of power, control, leadership, and management in light of the above concepts.", "The basic objective of the course is to help you to develop both theoretical and practical approaches for analyzing and making sense of individual and group behaviour in organizational situations.", "Demonstrate understanding of basic theories/concepts of organizational behaviour.", "2. Demonstrate understanding of factors that affect the behaviour of individuals and groups in organizations.", "3. Demonstrate understanding of factors affecting communication effectiveness in organizations.", "Introduction                                            Ch 1", "Personality & Intelligence                     Ch 3", "Lewin’s field theory                               Handouts", "Groups & Teams                                    Ch 11", "Communication                                      Ch 20", "This course includes the independent development and practice of specific skills, such as analyzing and writing about organizational situations.", "In cases where there is further clear evidence of plagiarism regardless of AI% score, the work will be submitted to the Associate Dean as a potential academic integrity offence.", "Keep copies of your pre- and post- grammar-corrected drafts in case we ask to see them.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 29, "course_code": "ARBUS 202", "course_name": "ARBUS202 - Professional and Business Ethics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["11:30AM -", "V. Fernandes", "Study of ethical and moral issues that typically arise in professional and business activity.", "In the context of this course we will look specifically at ethical issues and principles of conduct that are relevant to professionals and business people.", "Topics include: fundamentals of moral and political theory, ethical decision-making, professional responsibility, corporate social responsibility, and equality, among other things.", "Like many other courses in philosophy, this series of lectures, readings, and discussions will deal with a critical analysis of many and varied views regarding life, existence, values, religious belief, etc.", "Form an opinion on the importance of ethical reasoning in business and professional contexts.", "Identify ethical problems in complex professional and business related situations.", "Apply ethical concepts to particular business and professional situations.", "Explain the roles of professional codes of conduct and codes of ethics in real world contexts.", "1 Jan 6 - 10 Introduction", "Module 2 Check-in", "3 Jan 20 - 24 Ethical Decision Making", "Module 3 Check-in", "5 Feb 3 - 7 Equality & Discrimination", "Module 6 Check-in", "7 Feb 24 - 28 Markets & the Environment", "Module 7 Check-in", "Module 9 Check-in", "Module 10 Check-in", "11 Mar 24 - 28 Whistle-blowing and Codes of Ethics", "Module 11 Check-in", "Module 12 Check-in", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 33, "course_code": "PACS 202", "course_name": "PACS202 - Conflict Resolution (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Business", "program_id": 109, "major_id": 2, "major_name": "Mathematics/Business Administration (Bachelor of Mathematics - Honours)", "topics": ["Your instructor checks email and the Ask the Instructor discussion topic frequently and will make every effort to reply to your questions within 24–48 hours, Monday to Friday.", "Define terms, concepts, core values and phrases that are key to conflict resolution;", "Deconstruct conflict to identify underlying issues;", "Understand how collaborative and non-violent approaches to conflict undergird effective dispute resolution methods;", "Assess and re-evaluate one's own conflict style;", "Explain principles of negotiation, mediation, hybrids, arbitration and adjudication, and understand when each process is most appropriate to resolve a particular dispute;", "Recognize how conflict resolution processes are utilized in a peaceful civil society.", "Define terms, concepts, values, and phrases that are key to conflict resolution;", "Analyze a conflict to identify and describe contributing factors, roles played by the participants, how the conflict escalated, and what interests are important to the participants;", "Describe the range of conflict resolution processes, how they are connected to each other, and how the choice of a process affects the conflict;", "Explain the rights/interest/power paradigm and how it helps in classifying and choosing a method for resolving conflict;", "Identify ethical dilemmas for conflict practitioners, explain the nature of the dilemma, and identify an appropriate response;", "Distinguish between civil and criminal conflicts, and describe which conflict resolution methods are used for each class of conflicts;", "Although these three courses can be taken in any order, each builds on and adds to the foundation laid in the previous course.", "This course presents a basic overview of the concepts of peace, conflict, and violence.", "Speech Communication Option", "International Studies Option; and", "Spirituality and Personal Development Option.", "The word limits are hard limits.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "This course includes the independent development and practice of specific skills, such as mediation.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 1, "course_code": "CS 234", "course_name": "CS234 - Data Types and Structures (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Data Types and Structures Fall 2024", "MarkUs problems Email IAs at the course account", "Microsoft Teams problems Email ISG Coordinator Scott King", "Missed assignment or quiz Email ISG Coordinator Scott King", "Extenuating circumstances Email ISG Coordinator Scott King", "Error in mark entry Email IAs at the course account", "ISG Coordinator", "Introduction to commonly used data types, including lists, sets, mappings, and trees.", "This course introduces widely used and effective methods of data organization, focusing on data structures, their algorithms, and the performance of these algorithms.", "Students who successfully complete the course can use these tools to design and develop efficient programs for a wide variety of applications.", "Audience", "Students wishing to understand how choices made in program design can significantly affect performance and how to make these choices", "Highly recommended for students in Information Management and similar fields and for those in the Mathematics/Teaching plan", "The initial topics in CS 234 will present some material new to those coming out of CS 116 (but covered in CS 136) and some material new to those coming out of CS 136 (but covered in CS 116).", "Co-requisites: None", "Rance D. Neśaise, Data Structures and Algorithms Using Python, Wiley, 2010", "Describe basic quadratic sorting algorithms, such as Selection Sort or Insertion Sort.", "Given a simple, well-specified computational task, write a program in a high-level imperative language (e.g., Python, C, or Java) and generate appropriate test cases.", "Use as appropriate simple types, built-in compound types and control idioms, such as selection, iteration, and recursion.", "Explain the benefits of using abstract data types (ADTs) and data structures, and more generally, the concepts of modularity and data hiding, in solving problems in a wide variety of application areas.", "Understand the differing points of view of the user and provider of an ADT and the use of an interface to communicate between views.", "Explain and use the concepts of asymptotic running time, order notation, worst-case, average-case, and best-case complexity, and lower and upper bounds.", "Given a simple algorithm written in pseudocode, determine and informally justify its asymptotic running time, as expressed in order notation.", "Explain the basic structure of memory, including the distinction between external and internal memory and the concept of paging.", "Explain the complexity of some common implementations of these ADTs.", "Given a well-specified computational problem, determine which (if any) ADTs would be suitable.", "Explain how specialized data structures can lead to efficient solutions to specific real-world problems.", "Topics: User and provider viewpoints, planning and coding stages, abstract data types, modularity and data hiding, ADT Multiset, pseudocode, memory model", "Topics: Best, worst, and average-case running times, order notation, algorithm analysis", "Topics: Graph terminology, ADT Undirected Graph, ADT Directed Graph, implementations, depth-first search, breadth-first search", "Topics: Average-case analysis, interpolation search, heuristics, hashing, bucket sort, radix sort", "Notice of Recording", "Should problems occur, your early drafts serve as backups in case of computer problems, and provide evidence of your having attempted to submit work before the deadline.", "Re-mark requests", "The subject should be \"Ax re-mark request\" for x the number of the assignment.", "In the body of the email, include the rationale for the re-mark and the parts of the question that need atttention.", "Exam policies and missed examinations", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 9, "course_code": "PMATH 332", "course_name": "PMATH332 - Applied Complex Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Applied Complex Analysis Winter 2025", "02:30PM - 03:20PM", "Complex numbers, Cauchy-Riemann equations, analytic functions, conformal maps and applications to the solution of Laplace's equation, contour integrals, Cauchy integral formula, Taylor and Laurent expansions, residue calculus and applications.", "In the case of illness, a VIF will be required.", "If the midterm is missed, after your instructor has verified you have valid reasons for it, and has received a VIF in case of illness, the weight will be shifted to the final exam.", "If the final exam is missed, and valid reasons are found for it, together with a VIF in case of illness, a grade of INC will be given to the student as long as assignments and midterms have seen a good performance.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 13, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 24, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 26, "course_code": "MATH 239", "course_name": "MATH239 - Introduction to Combinatorics (0.50)", "term_name": "Required Courses", "program_name": "Mathematics and Teaching", "program_id": 110, "major_id": 1, "major_name": "Mathematics/Teaching (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics Winter 2025", "11:30AM - 12:20PM MC 4059", "09:30AM - 10:20AM MC 4021", "P. Nelson", "08:30AM - 09:20AM QNC 1502", "S. Pfannerer-Mittas", "10:30AM - 11:20AM MC 4058", "11:30AM - 12:20PM MC 4058", "09:30AM - 10:20AM MC 4042", "02:30PM - 03:20PM", "10:30AM - 11:20AM PHY 150", "04:30PM - 05:20PM", "You should have no reason to contact them directly, but you can find their email addresses through Learn.", "First name Last name", "Guilherme Zeus Dantas E Moura", "Theodore Morrison", "Matthew Kroeker", "Introduction to graph theory: colourings, matchings, connectivity, planarity.", "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.", "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}]