[{"course_id": 22, "course_code": "SE 465", "course_name": "SE465 - Software Testing and Quality Assurance (0.50)", "term_name": "3A Term", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Software Testing and Quality Assurance Winter 2025", "Introduces students to systematic testing of software systems.", "Engineering is about applying the appropriate amount of effort to make sure that systems work properly, especially systems that affect the public in some way.", "In this course, as software engineering students, you will learn about tools and techniques that you can use to make your software systems fit-for-purpose.", "write new test suites, improve existing test suites, and critique test suite quality using engineering judgment", "The week-by-week schedule might slip.", "I last taught SE 465 in Winter 2019 and the ECE 453 version in Winter 2023, but I think that you will benefit from the revamp I'm doing this term.", "Introduction", "Evaluating your tests: coverage, fuzzing, mutation-based fuzzing, mutation analysis", "Symbolic Execution", "Z3 SMT Solver", "Dynamic Symbolic Execution", "Semantics of Symbolic Execution", "Verification Condition Generation", "Bounded Model Checking", "Real-life Applications of Verification", "Metamorphic testing", "I anticipate that the final exam will be in-person, and that quizzes will be in-class in-person, though there are no guarantees.", "Acceptable collaboration includes discussing ideas and structures with others, as well as helping others debug their code.", "If your code is too close in structure to someone else's code, you are going to have a problem.", "Or, let's sum this up in two short instructions:", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, ChatGPT) and how such tools can be used to write and test code.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be diﬃcult to interpret on a discussion forum.", "The human visual system has evolved to perceive saber‐toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text‐mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 23, "course_code": "CS 349", "course_name": "CS349 - User Interfaces (0.50)", "term_name": "3A Term", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["04:00PM - 05:20PM", "Please contact her in regards to any accommodations, including those for illness and short-term absences.", "Bella Chen", "Zitao Wang", "Beginning in the second week, we hold regular weekday office hours in-person and online within the CS 349 team (via Microsoft Teams).", "An introduction to contemporary user interface implementation concepts, including event abstraction, graphical components, layout, feedback, testing, accessibility, and architectures to develop user interfaces.", "Explain architectural and algorithmic details underlying current user interfaces and user interface toolkits.", "Implement user interfaces in a browser using Typescript: (1) using the HTML Canvas; (2) using HTML elements and DOM manipulation, and (3) using a modern UI web development framework", "5 Feb 3 - Feb 7 Dispatch, Layout A1", "11 Mar 24 - Mar 29 Direct Manipulation, Accessibility", "Exams", "Final, in-person tbd tbd", "It has code relating to lectures and a git submodule with the SimpleKit UI toolkit.", "See the README for details for cloning and keeping everything up to date.", "A1-A4 4 x 13% = 52%", "You should conform to the tools and versions specified in the assignment description.", "Out-of-scope Language Features", "Please review policies for Academic Integrity, Using Code from Other Sources, and Using Advanced AI Systems under Course Policies.", "You may use code examples provided in-class (i.e., in the CS349 public repo).", "You may directly use or include portions of these in-class samples in your assignments.", "You may discuss how you accomplished something in general terms with other students, but you may not directly share code.", "Self-Declared Short-term Absence", "There are no extensions beyond the maximum 48-hour late period after the original deadline.", "You can use any code from this term's offering of CS 349 without documenting it as a source.", "This includes starter code for assignments, code shown in lectures, and code from the course code repo.", "Using Advanced AI Systems", "Use of advanced AI systems to generate code (ie.", "Intellectual property includes items such as:", "All source code written by the instructor and provided in lecture, as starter code for an assignment, or in a sample code repository.", "Inclusiveness", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 24, "course_code": "CS 343", "course_name": "CS343 - Concurrent and Parallel Programming (0.50)", "term_name": "3B Term", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["04:00PM - 05:20PM", "Email: pabuhr@uwaterloo.ca", "Email: pabuhr@uwaterloo.ca", "Email: dbwolff@uwaterloo.ca", "Email: e45lee@uwaterloo.ca", "Email: tbarnes@uwaterloo.ca", "A passing mark in the test portion of the final grade must be achieved to pass the course:", "else", "Inclusiveness", "In particular:", "Please inform us of these at the start of the course.", "Intellectual property includes items such as:", "Continuity Plan", "As part of the University’s Continuity of Education Plan, every course should be designed with a plan that considers alternate arrangements for cancellations of classes and/or exams.", "In the case of minor disruptions (e.g. one lecture), the lecture content will be re-organized to fit the remaining time."]}, {"course_id": 27, "course_code": "SE 390", "course_name": "SE390 - Design Project Planning (0.50)", "term_name": "3B Term", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Design Project Planning Fall 2024", "Students undertake a substantial customer-driven group project as part of the SE390/490/491 design-project sequence covering all major phases of the software-engineering lifecycle.", "Lectures describe expectations and project-planning fundamentals.", "Students form groups, decide on a project concept, complete a project-approval process, develop high-level requirements for the project, perform a risk assessment, develop a test plan, and complete a first-iteration prototype.", "The Capstone Design Project falls into one of the following categories:", "Develop, as a Consultant, some customer software for a specific external partner,", "Develop a New Product for a clearly identified user group,", "Create an Advanced Technology that combines knowledge from multiple technical elective courses and addresses an important and difficult problem (but does not necessarily have a business case component the way a new product does)", "Identify problems worth solving through software", "Make strategic decisions in problem definition (such as scoping and pivoting)", "Effectively plan and estimate project work", "Identify the strengths, weaknesses, and styles of co-workers", "Apply software requirements engineering, design, and implementation practices on a team project", "Effectively communicate the progress and results of team projects", "w1", "Brainstorm project risks and plan mitigation strategies (see §6.5)", "Sign-up for the check-in meeting with the instructor", "Be prepared to discuss your success metrics and the main risks for your project and how you plan to mitigate them", "Mini-Project 1 presentation slides preparation;", "Sign-up for the presentation", "Mini-project 2 presentation slides preparation;", "Prepare Mini-Project 2 presentation slides and recording, upload the recording as a private video to YouTube and practice the presentation for delivery", "Mini-project 2 presentation slides and presentation recording due by the end of this week", "Sign-up for teams to critique", "w10", "Sign-up for check-in meeting with the instructor (optional)", "Mini-Project 3 presentation slides preparation;", "Deliverables", "In order to accomplish the objectives, the course is structured into three iterations, allowing and encouraging switching topic and team compositions between the iterations.", "The results can have different forms, including a software prototype, an evaluation of a user interface mock-up, or a literature review.", "The main objective of the iteration is to start working on a problem as a team and learn what you can accomplish within the three weeks.", "During each of the four meetings with the instructor, be prepared to show", "your code repository,", "samples of development artifacts (e.g., user stories, mock-ups, issue tracker, code),", "A sign-up sheet will be provided.", "A sign-up sheet will be provided.", "Prepare a five-minute presentation of your Mini-Project 2 results.", "Be prepared to discuss your team contract and the project strategic positioning during the meeting with the instructor.", "Prepare a five-minute video with your slides and narration for on-demand viewing.", "A sign-up sheet will be provided.", "A sign-up sheet will be provided.", "A sign-up sheet will be provided.", "Prepare a five-minute presentation of your Mini-Project 3 results.", "A sign-up sheet will be provided.", "Submission logistics", "Add a subfolder of the respective mini-project directory and give it your team name.", "Keep the team name short and use it consistently in all sign-up sheets and deliverables throughout the mini-project.", "You can change the team name when switching between mini-projects, if you desire.", "Abstract", "Once you establish a team and start working on a mini-project, create a team subdirectory in the corresponding mini-project directory in course gitlab and put abstract.md into it.", "Please use a short team name and ensure that you spell it same way in the subdir name, when signing-up for review meetings with the instructor, and in the pull-request description.", "I reserve the right to subtract points for not following these instructions.", "There will be a sign-up sheet provided before the presentation day(s).", "Make sure to follow the sign-up instructions given in the sheet, or penalty points may be subtracted.", "For example, there I give precise instructions how to sign up each student with the eight-character UW ID, one per line.", "The videos should be posted to YouTube and the links provided in the sign-up sheets.", "The desired option is to upload it as a private video to YouTube, other publishing options often resulted in technical difficulties during the review meetings in the past.", "Put each of the reviews into the respective Mini-Project 2 team’s subdirectory under reviews and name the file using your UW id:", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 30, "course_code": "SE 490", "course_name": "SE490 - Design Project 1 (0.50)", "term_name": "4A Term", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Design Project 1 Fall 2024", "04:00PM - 05:20PM", "Per accreditation requirement 3.4.4.6, \"The engineering curriculum must culminate in a significant design experience conducted under the professional responsibility of faculty licensed to practise engineering in Canada.", "In addition to the skills necessary implied by doing a significant software engineering design project, students will develop and/or enhance their ability to:", "Present intermediate results of a significant software-engineering design project", "Justify their design project and the specific design choices within the project", "Identify an appopriate means of evaluating the success of their design project", "Identify potential problems they may encounter and lessons learned while working on their design project", "The course comprises four in-class design-team presentations.", "Grading will use the UW letter grade system, mapping to standard UW values for same, so as to create a weighted sum for the final grade."]}, {"course_id": 32, "course_code": "COMMST 100", "course_name": "COMMST100 - Interpersonal Communication (0.50)", "term_name": "Undergraduate Communication Requirement", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["jclausen@uwaterloo.ca (please do not use the D2L email system)", "I monitor my email M-F, 9:00 am - 5:00 pm.", "Focuses on the one-to-one, face-to-face communication in both the personal and professional realms.", "Such topics as verbal and non-verbal interactions, listening, and the better management of interpersonal communication will be studied.", "In this course, we will work to understand more fully how we communicate (and are communicated to) in the world we live in and to develop the tools to research, apply, and practice key interpersonal communication concepts in our everyday lives.", "Students will be encouraged to identify, negotiate, and challenge existing communicative norms as they explore a range of interpersonal and intrapersonal issues that include culture, identity, and power.", "Understand the complexity of communication as a human process of shared meaning- making in the context of power, history, and culture", "Increase your capacity to recognize and enhance yours and others’ agency – the ability to make a difference in the world for yourself and others – and understand the implications of your communication behaviours for yourself and others", "Understand communication as a practice and improve your critical and creative communication competencies by developing your ability to use writing and other media of communication to create meaning", "This entails opportunities for student-directed inquiry, challenge and risk-taking, and reflection on your roles and responsibilities", "Reflect on your role in fostering the public good (the multifaceted well-being of individuals and groups), begin to imagine a better future, and make decisions in your communication that can transform the communities to which you belong", "Recognize diverse linguistic practices and modes of expression as resources for writers and speakers", "Introduction", "Read: Meaning as Co-Created", "Read: “Cultural and Historical Influences: Communication Competence in Context”", "Exceeds assignment guidelines; strong and consistently applied definition of audience and purpose; thoughtful and innovative adaptation of the subject to the audience’s needs; subject developed and organized at every level for listener comprehension; speaker uses language appropriately, effectively and even inventively; maintains relaxed, inviting delivery free of verbal fillers and distractions; cites sources appropriately both in spoken and written work; submits well prepared required materials.", "Your entries should be roughly two typewritten, double- spaced pages each although they can go slightly over.", "While the amount you write under each heading may change week to week, this format allows you to address each area regularly.", "Decide how often you will communicate and in what manner.", "Decide how you will divide the workload and handle conflicts.", "Handing in a clear contract will earn 5%.", "Your job will be to engage the class and apply what we are reading to people’s own opinions, experience, etc. Sign up for this assignment is on a first-come/first-served basis starting during week two of classes.", "Group Presenation 2: Final Presenation You and your group will create a fifteen-minute videotaped presentation exploring a problem in interpersonal communication and proposing a solution for that problem.", "This presentation will involve research into a specific issue related to interpersonal communication and creating good reasons for following your proposed solution.", "This course includes the independent development and practice of specific skills, such as self reflection, critical thinking skills and interpersonal communication.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 34, "course_code": "EMLS 101R", "course_name": "EMLS101R - Oral Communications for Academic Purposes (0.50)", "term_name": "Undergraduate Communication Requirement", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["& Location:", "Email:                         christa.schuller@uwaterloo.ca", "Designed specifically for students for whom English is not the first language, this course introduces group discussion strategies and presentation skills.", "A focus on pronunciation and vocabulary assists learners to better engage in conversations and listen to and deliver English presentations.", "This is achieved with the focus on gambits, voice quality, and speech clarity, which assist learners in developing strategies to better engage in discussions, and listen to and deliver English presentations in both remote and face-to-face contexts.", "Create and organize discussions and presentations", "Use a clear and appropriate format", "Develop relevant and well formatted materials (PowerPoint slides and discussion notes)", "Select effective introductions and conclusions to engage the audience", "Clearly express their ideas verbally and non-verbally", "Use communication gambits and signpost language effectively during discussions as well as individual and team presentations", "Use body language and space on stage to enhance the expression of ideas", "Listen for main ideas and details of some selected TED talks to form opinions on current socio-cultural, educational, environmental, and technological issues", "Critically evaluate various sources of information and then incorporate these sources in oral communication to create strong, academic support for their ideas", "Topics & Activities In-class Activities & Assignments Home                 Assignments", "Nonverbal communication- Importance of body language", "Introduction to group discussion assignment", "Analysis of non-verbal communication of selected presenters", "Small talk & non-verbal communication practice", "Main ideas and brief summary of TED Talks", "Question types for semi-formal discussion", "Discussion facilitation and gambits", "Non-verbal communication during a discussion", "Discussion skills", "Introduction to informative presentation introductions and conclusions", "Introduction to individual  presentations: thesis statement and format", "Chunking, pausing and focus words", "Writing thesis statements", "Pausing and focus words", "Effective PowerPoint slide design & APA citations", "Opening and closing a presentation", "Practice designing a slide and presenting its content", "Sample presentation", "Submitting PPT and Outline", "Submitting PPT and Outline", "Introduction to product review", "Inventions and innovations; product features", "Brainstorming for main ideas", "March 24 - 28", "Product review development – outline and slides", "Sample product review slides & outline", "Search for support materials, content development & slide design", "Product review presentations", "You will also need to watch the presentations of the other students and actively participate in the Q & A sessions following these presentations.", "A self-reflection on your preparation for the presentation, its delivery, and the Q & A will follow.", "A brief Q & A session will then follow.", "You will also need to watch the presentations of the other students and actively participate in the Q & A sessions following these presentations.", "These quizzes will cover the concepts related to academic and professional presentations, both individual and co-delivered, as well as discussions.", "Electronic Device Policy", "This course includes the independent development and practice of specific skills, such as collecting, synthesizing, and analyzing information; developing and practicing oral skills; critically evaluating and elaborating on ideas.", "Library for research-based assignments", "You can earn an EMLS Diploma by completing four EMLS courses and earning a cumulative average of 65%.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 43, "course_code": "BIOL 110", "course_name": "BIOL110 - Biodiversity, Biomes, and Evolution (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "Labs begin the week of **Sept. 9**", "(Any issues in laboratory should contact Dr. Wolff)", "Monitor LEARN for important information", "A survey of organisms that inhabit a range of aquatic and terrestrial ecosystems (e.g., coral reefs, lakes, forests).", "Evolutionary and ecological frameworks will be used to explore how organisms diversify and are considered distinct species.", "The laboratory for this course is integrated with the lecture (unlike some of your other first year courses) - you will need to be sure to read the lab exercises before attending, and come prepared for our outdoor labs where appropriate shoes and clothing are necessary for the weather.", "I teach courses in ecology, evolution and genetics.", "I have been teaching evolution and ecology at the University of Waterloo for 7 years, and I hope to share with students my enthusiasm for phylogenetics.", "List themes and characteristics that differentiate the major groups of eukaryotes.", "Identify specific animals that facilitate and/or endanger human society.", "Construct and evaluate phylogenetic trees using parsimony", "Introduction", "Phylogeny and the modern view of biological relatedness", "Ecosystems and Resource Flux", "**Oct. 28  Midterm**", "Concepts in Diversity", "Activities will include using microscopes and drawing what you see, dissections of preserved animals, and collecting benthic invertebrates from the local stream and identifying them using pictoral keys.", "Note: You can also choose to do neither and forego the bonus mark altogether, as this is voluntary.", "Participation in Research Study", "Reminder, as participation in this study is voluntary, and it is a bonus mark, students may also decide to not do either activity and forego the bonus mark altogether.", "Notice of Recording", "In the case of an unwritten final exam, your course mark will be entered as DNW (32% for calculation of overall average)."]}, {"course_id": 44, "course_code": "BIOL 130", "course_name": "BIOL130 - Introductory Cell Biology (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["S. Ruffell", "An introduction to the concepts of cell biology with emphasis on (1) the structural organization of the cell and (2) the function of critical molecular processes that are characteristic of living organisms.", "Explain the fundamental elements of cells, the chemistry of life, and the major classes of biological macromolecules.", "Describe metabolism, the role of enzymes in chemical reactions, and how cells can capture, and utilize, energy.", "Explain how cells respond to signals and form cellular communities.", "Module 1 - Introduction to Cell Biology & The Cell Theory", "Module 2 - Molecules of Life", "2 Module 3 - Cells and Membranes  In-class case study", "3 Module 4 - Nucleic Acids & Information Flow", "4 Module 5 - Protein Structure, Function & Synthesis  In-class case study", "6 Module 7 - Cellular Respiration In-class case study", "In-class case study", "9 Module 9 - Cell Signalling", "10 Module 10 - Cell & Tissue Form", "and In-class case study", "11 Module 11 - DNA Replication & Cell Division Case study due", "12 Module 11 - DNA Replication & Cell Division  Term Test 1", "Official Grades and Course Access", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each module for the achieve assignments and term tests.", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines", "Library for research-based assignments"]}, {"course_id": 45, "course_code": "BIOL 130L", "course_name": "BIOL130L - Cell Biology Laboratory (0.25)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["02:30PM - 05:20PM", "STC 4018", "02:30PM - 05:20PM", "STC 4018", "However, we do run multiple labs at the same time which means we may not always be in the office.", "Situation", "Please email Dr. Gurska directly at jola.gurska@uwaterloo.ca", "What does it mean to be a cell biologist?", "One group of scientists might explore growing tissues in a laboratory to one day produce artificial skin or organs.", "No matter what their question, cell biologists use a similar set of laboratory skills that allow them to peek inside the tiniest of biological units that make up the diversity of organisms we see around us.", "Although fundamental techniques like microscopy have hugely advanced since the invention of the light microscope, every cell biologist needs to learn how to properly use a microscope to see cells reliably.", "These can be very tricky to use properly but doing so could be the difference between a world-changing discovery and an experiment that no one can replicate.", "These and other methods that are integral to working in the cell biology field will be introduced in this laboratory and it is my hope that you will leave confident in these fundamental techniques.", "Maintain a well-organized and comprehensive lab book.", "Identify elements of a well-structured laboratory report and write some elements of a lab report.", "Assignment 3 Model Organisms and Experimental Design 3%", "I welcome any inquiries regarding AccessAbility accommodations.", "Some examples of what will be noted includes the following:", "did you complete the bioskills exercises during the first lab?", "did you behave in a respectful and professional manner in the lab?", "Using a micropipette without a tip,", "Holding a micropipette upside down with liquid in the micropipette tip,", "Setting a micropipette precariously close to the edge of the bench so that it may fall on the floor,", "Forcing the pipettes past their minimum and maximum calibrated ranges", "Keeping a thorough lab book is a critical skill learned in a biology laboratory to document key observations and procedures.", "Some reagents will already be set up to use at your bench, while others will be in dispensing bottles on the side bench or in the fume hoods, in which case the liquid must be dispensed directly from the bottles.", "These can be purchased at the W Store Essentials in the STC.", "Since many standard laboratory reagents are volatile, please consider not wearing contact lenses in the laboratory.", "When not in use, stools should be tucked away under-bench and personal items stowed underneath in cupboards.", "Finally, please remember that safety should be a collective concern.", "They will be reviewed at the end of the term for statistical purposes only.", "The goal of the draft submissions is to teach you the capabilities of Turn-it-in analysis and to encourage you to use the software to improve your paraphrasing and referencing.", "Details on how to interpret Turn-it-in reports and use the draft Dropboxes can be found under Content on LEARN.", "As outlined under Quizzes section above, please note that the BIOL 130L online multiple-choice quizzes are designed to be completed in half the time you are given.", "Expectation of Academic Integrity", "This course includes the independent development and practice of specific skills, such as scientific writing and communication.", "Poorly paraphrased information without in-text citation 5 marks off for each", "Poorly paraphrased information with in-text citation 3 marks off for each", "Well paraphrased information without in-text citation 3 marks off for each", "Lab Manual is cited in Results and/or Discussion 1 mark off for each citation", "A reference in the reference list does not have corresponding in-text citations 5 marks off for each", "An in-text citation is not in the reference list 5 marks off for each", "Misconduct; student’s name will be sent to the Associate Dean to check if this is the first misconduct"]}, {"course_id": 46, "course_code": "BIOL 150", "course_name": "BIOL150 - Organismal and Evolutionary Ecology (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Organismal and Evolutionary Ecology Fall 2023", "11:30AM - 12:20PM RCH 101", "Learn Discussion Board", "Email and Appointment Requests", "Coverage includes hypothesis testing and the nature of scientific inquiry, basic population genetics, physiological ecology, life histories, dispersal, basic population and community ecology, macroevolution, systematics and classification, as well as functional morphology.", "The theory of evolution unites the whole of biology and all living organisms into a coherent body of knowledge, allowing comparisons across all forms of life.", "Ecology describes how organisms interact with their environment and each other to create interdependent systems from microscopic to global scales.", "These disciplines are fundamentally tied together: evolution is the primary mechanism by which species adapt to their environment; ecological interactions and environmental variability drive natural selection.", "You will also carry out simulated lab assignments to test the principles of evolution, design ecological experiments to test alternate hypotheses about the conservation of species and manipulate demographic parameters to test their influence on population growth.", "Understand the principles of scientific methodology", "Define ecological and evolutionary terms, such as the niche, adaptation, and altruism", "Illustrate these mechanisms in the context of course examples", "Explain how ecological interactions and evolution are interconnected", "Sign code of conduct and upload to LEARN.", "2) Sept 8 Evolution for Ecology Section 1: Evolution and Ecology are Intertwined", "4) Sept 13 Evolution for Ecology", "5) Sept 15 Evolution for Ecology Section 3: Genetics and Evolution", "6) Sept 18 Evolution for Ecology Section 4: Managing the Evolution of Resistance", "9) Sep 25 Physiological Ecology Section 1: Trade-offs and Species Distributions", "15) Oct 9-13 Holiday – No classes Understanding Experimental Design Simulation due by Oct 16, 11:59 pm", "16) Oct 16 Empiricism in Ecology Understanding Experimental Design Simulation due by 11:59 pm (best 2/3 for 10%)", "It is important that you review the information below before you subscribe to the SimUText for Organismal Ecology and Evolution - Chapters at University of Waterloo.", "SimUText Application Installers", "SimUText Application Installers", "At the end of every unit, you will work individually to develop a concept map using Cmap Cloud to visually display the relationships among what you consider the key concepts in the unit.", "These should represent your personal comprehension of how the concepts relate to each other, and no two should be identical.", "Also, class will entail a lot of discussion that won’t be represented in PPT slides.", "The simulations include one on Evolution in Ecology, one on Experimental Design in Ecology and one on Population Growth.", "The learning outcome for the unit tests is to demonstrate your recall and comprehension of the material covered in the units and to incentivize keeping up with the readings and attending lectures and reviewing for the final exam.", "The learning outcome is to demonstrate recall, synthesis and integration of material learned during the course.", "The final exam will consist of multiple-choice, T/F, solve the equation type of questions and integration questions that are designed to test your basic and deeper understanding of the course concepts.", "Important note regarding tests and exams", "Unit tests will be completed for the first 4 units of the course.", "Ensure you have a reliable internet connection and functional computer to complete them – technical challenges encountered during remote completion are not an excuse for missed tests.", "I will have a limited number of printed back-ups for students in class who experience technical difficulties.", "You will need to have a reliable internet connection and functional computer to complete the exams.", "Emails can be received 24 hours per day.", "If you miss a make-up exam for any reason, you will be given a DNW, and must petition the Associate Dean of Science if you feel you missed it for a valid reason.", "At the discretion of the instructor, you may be permitted to write a make-up exam.", "The timing will be conveyed to you via e-mail if you are eligible for a make-up.", "If you follow these steps,", "I will consider granting an extension", "Students are responsible for their own behavior and should be mindful of the impact that their actions have on the wellbeing of others.", "Act in a respectful and open manner when listening to the views and ideas of others.", "Participate fully in the discussion boards: make sure your answers are to the best of your ability and that you respond to others’ posts.", "Signature"]}, {"course_id": 49, "course_code": "BIOL 220", "course_name": "BIOL220 - Introduction to Plant Structure and Function (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Introduction to Plant Structure and Function Winter 2025", "11:30AM - 12:20PM RCH 101", "S. Schoor", "I will make my best effort to respond to emails within 24 hrs.", "An introduction to plant diversity, and the anatomy and physiology of vascular plants.", "Understand the importance of the relationship between plants and humans in the environment and appreciate the species richness and diversity of plants", "Recognize and identify various cell types and how they account for the structure and function of tissues and organs", "Plant Evolution: Structure and Reproduction", "Focus will be applied to the adaptive strategies employed by algae to move from water to land, the development of complex tissues and organs and the role of reproduction strategies in plant success.", "Cellular composition of plant tissues and what role they play in their function will be studied; with particular interest in the relationship between vascular tissue and water transport.", "Additionally, students will study how hormones and growth regulators regulate plant development, tropic movement and plant response to biotic and abiotic stressors, as well as learn of their many uses in agriculture.", "Week 1 Jan 6 (1) Introduction & The Plant Cell (Ch 1,3) No labs this week", "Laboratory Mark Distribution", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline)."]}, {"course_id": 50, "course_code": "BIOL 239", "course_name": "BIOL239 - Genetics (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["11:30AM - 12:20PM", "10:30AM - 11:20AM STC 1012", "You can!", "Chromosomal mechanisms in mitosis and meiosis.", "Natural selection and the evolution of genetic systems.", "Describe the fundamentals of gene structure, function and transmission in prokaryotic and eukaryotic cells and organisms.", "Describe the various ways mutations can arise and how mutations may affect gene expression and phenotypic outcomes.", "Describe recombinant DNA technology in bacteria and its role in biotechnology.", "Effectively work with others, discussing, evaluating, and communicating genetics concepts and synthesizing ideas in a group.", "Readings", "textbook 1.1-1.2", "Mendelian genetics and probability", "Modification of Mendelian ratios", "textbook 3.2-3.3, 4.2-4.4, 15.1", "Mitosis, meiosis, and chromosome numbers", "DNA and the genetic code", "textbook 9.2-9.3", "T4: Mitosis and meiosis", "DNA cloning", "T5: Testing genetic ratios", "Cancer genetics", "T9: Population genetics", "Exam period", "- write the final exam and achieve a grade of at least 50% on the cumulative test and exam section", "Online learning activities: These activities are designed to test your knowledge of several important concepts explained by the lecture presentations in this course, and should be completed after the portion of the course when they are covered in lecture.", "They are all due toward the end of the term but can be completed as many times as you like to help you work on these concepts.", "Read the instructions carefully before attempting these as a completion quiz (in the quiz section) must also be completed to obtain credit.", "In this case, the weight of the missed submission will be transferred to the final exam.", "The dates affected and degree of incapacitation will be used to determine follow-up action."]}, {"course_id": 51, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}, {"course_id": 52, "course_code": "BIOL 240L", "course_name": "BIOL240L - Microbiology Laboratory (0.25)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["BIOL 240L", "BIOL 240L 001", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 002", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 003", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 005", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 006", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 007", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 008", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 010", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 012", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 013", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 014", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 015", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 017", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 018", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 021", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "Email: cduxbury@uwaterloo.ca", "View requirements for BIOL 240L", "Main Objective Obtain a a good understanding of the basic techniques used in a microbiology lab to study and handle microorganisms safely.", "Apply staining techniques to differentiate and observe types of bacteria", "Appreciate proper aseptic technique while handling microorganisms in the lab and inoculating media", "Properly prepare slides for examination under the microscope", "Prepare and use dilutions to isolate pure cultures and to enumerate the number of organisms in a culture", "Exp 3: Basic Bacterial Shapes", "Exp 12: Pour-Plate Method", "Exp 14: Aseptic Technique in Pipette Handling", "Exp 15: Standard Plate Count Method", "Exp 17: Bacterial Flagella Stain", "Exp 19: Miniprep of Plasmid DNA", "Exp 20: Analysis of Plasmid and Genomic DNA", "Exp 21: Metabolic Activities of Bacteria", "Exp 30: Evaluation of Chemical Antimicrobial Agents", "Exp 31: Antibiotic Sensitivity Testing", "Exp 32: Isolation of Bacterial Mutants", "TBA", "Extra precautions must be taken to ensure the safety of yourself and those around us!", "Always be prepared for a quiz; they could be given at any time and they are cumulative!", "To make this happen, a flowchart for each experiment is required.", "The flowchart is similar to a \"map\" of your experiment and should be sufficiently detailed and include the most important information about the experimental steps and possible time management.", "The flowchart should NOT be a reiteration of the \"METHODS\" section in your manual.", "Please see Flowchart Help Sheet for a flowchart example.", "Your professionalism mark will be assigned by your TAs and will be assessed on the basis of your performance in the laboratory, attendance, and your degree of skill in microbiological techniques.", "More information will be given closer to date.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 54, "course_code": "BIOL 273", "course_name": "BIOL273 - Principles of Human Physiology 1 (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM M3 1006", "M. Bording-Jorgensen", "Dr. Vivian Dayeh - Tuesdays 11:30 am -12:30pm in B1-277.", "The physiology of major organ systems of the human body.", "Topics include neurophysiology and peripheral nervous system, muscle, the cardiovascular system, the components of blood, respiratory system, and immune system.", "The combination of BIOL273 and BIOL373 covers all of the major topics of human physiology.", "Identify the components/structures of the following organ systems: nervous, muscular, cardiovascular, respiratory, and immune.", "Describe how these five organ systems are organized in the human body.", "Explain the function of each of these five organ systems.", "Demonstrate the integration of these five organ systems in maintaining homeostasis.", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Official Grades and Course Access", "Corresponding Silverthorn textbook chapters in parentheses for each unit.", "This unit serves as an introduction to the study of the function of the five organ systems examined in this course (nervous, muscular, cardiovascular, respiratory, and immune).", "Unit 1 will introduce how the organ systems work together to maintain homeostasis within the body.", "The organization of the nervous system will be explored in this unit.", "The types of cells found in the central and peripheral nervous system serve as a starting point to discuss their function within the nervous system.", "Initially gross structure of skeletal muscle including the structure of a muscle fibre and myofibrils will be examined.", "An exploration into the muscle contraction mechanism via excitation-contraction coupling will be examined to explain how muscles work.", "This unit will start with an introduction into the heart and components of the cardiovascular system, which will be followed by cardiac muscle contraction mechanism.", "In this unit we will examine the structure and function of the respiratory system, incorporating gas laws and ventilation.", "Pulmonary function through lung compliance and elastance as well as the control of ventilation will be examined.", "This unit will start with the general function of immune system and introduction to the types of pathogens that infect the body.", "The anatomy of the immune system will be discussed returning to the role of haematopoiesis.", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each unit for the assignments and term tests.", "Required for the Mastering A&P Online Assignments and Dynamic Study Modules.", "Course website Waterloo Learn https://learn.uwaterloo.ca - includes general course information, language of physiology online assignment, review sheets for each unit, and links to the Mastering A&P Online Assignments.", "Emails can be received 24 hours per day.", "Students should carefully consider the wisdom of missing a test or assignment.", "Mastering A&P assignments handed in late will receive a deduction of 5%/day for the first five late days after which a grade of zero (0) will be recorded.", "Notice of Recording", "Don’t waste your time with these requests!", "Expectations for Change", "This course includes the independent development and practice of specific skills, such as multiple choice question creation.", "Library for research-based assignments", "Disability-related Policies"]}, {"course_id": 55, "course_code": "BIOL 280", "course_name": "BIOL280 - Introduction to Biophysics (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "Introduction to Biophysics Winter 2025", "08:30AM - 09:50AM RCH 301", "Email: brenda.lee@uwaterloo.ca", "Email: ibukhteeva@uwaterloo.ca", "Email: jglasier@uwaterloo.ca", "Introduction to a physical understanding of biological systems at macro and molecular scales.", "The course is intended for second-year science and engineering students and will cover a broad spectrum of topics in biophysics, as well as an introduction to neurobiology, nanotechnology, and biotechnology.", "Explain fundamental physical principles as they relate to biological systems at the macro and molecular scales", "Apply mathematical and physical models to describe and predict biological phenomena, including respiration, membrane transport, and energy transformation", "Demonstrate a systemic approach to problem-solving in applying physical concepts to solve questions related to biological systems", "Explore the structural and functional properties of biomolecules (proteins, nucleic acids, lipids, carbohydrates) and their role in cellular and molecular systems", "Evaluate the role of physical laws in physiological processes, such as neuronal signal propagation and blood flow dynamics", "Demonstrate knowledge of a wide range of biophysical and experimental methods (e.g. microscopy, spectroscopy, light scattering techniques) and their applications in research and medicine", "Critically assess biophysical methods used in research and medical applications and highlight their benefits, limitations, potential", "Develop scientific communication skills through the creation of written reports and problem-solving assignments related to biophysical concepts", "Not all topics may be covered in their entirety, but the core topics from the course calendar description will.", "1 Jan 6-10 Topic 1: Introduction to Biophysics", "Topic 7: Introduction to Cellular & Molecular Biophysics", "Topic 9: Biophysics of Nucleic Acid and DNA", "Topic 14: Introduction to Bionanotechnology", "Topic 16: Advanced Methods in Biophysics", "Topic 17: Methods in Medical Physics", "Apr 9: Final examination period begins", "May 20: Standing decisions and official grades available in Quest", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "A detailed set of instructions will be provided on LEARN, but the general grading scheme will follow these key requirements:", "Biological explanation of 1 application (e.g. medical disease, cellular/molecular mechanism or interactions, biological phenomena)", "Physical explanation of 2 methods that can be used to study this biological application", "Pros and cons of each method presented", "Comparison of methods to see which one is more suitable under certain conditions", "Grading: Based on accuracy and depth of information in paper, and organization of content; a grading rubric will be provided prior to submission", "Notice of Recording", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 58, "course_code": "BIOL 373L", "course_name": "BIOL373L - Human Physiology Laboratory (0.25)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Mohammad Moradi                      m5moradi@uwaterloo.ca", "Section 2- Monday Evening-630pm-920pm", "TBA", "Ally Miners                                     adminers@uwaterloo.ca", "Ally Miners                                     adminers@uwaterloo.ca", "Mohammad Moradi                      m5moradi@uwaterloo.ca", "Laboratory exercises to study the principles of human physiology.", "The laboratory exercises in this course are designed to illustrate the physiological principles described in Biology 273 and Biology 373 lecture courses.", "In this course, you will have the opportunity to gain first-hand experience conducting and creating experiments in human physiology.", "Lab 1: A) To investigate some properties of the special senses and the somatic senses B) To elicit some reflexes C) To illustrate fine motor control", "Lab 2: A) To record a human nerve reflex impulse, and to determine its speed", "Lab 3: A) To measure and investigate the activity of the medial and lateral rectus muscles during eye movement (saccades, pursuit, vestibular ocular reflex and vergence)", "The investigation of heart sounds and their correlation to cardiac cycle events B) The determination of blood pressure under resting and exercising conditions C) The observation of an electrocardiogram (ECG) under resting and exercising conditions D)", "The investigation of the induction of bradycardia by facial immersion E)", "The study of some aspects of circulation", "Lab 7: A) To begin the development of a physiology lab exercise with lab partners", "Lab #7:    Mar 3-7                Physiology Experimental Design I", "Lab #8:    Mar 10-14          Physiology Experimental Design II", "Mar 24-28          Reserved for make-up labs if needed", "The marking scheme for reports can be found at the end of the lab manual (see page 107).", "For a description of your responsibilities in preparing written reports and the rules concerning academic misconduct, please see p. 108", "There will be TWO Turnitin® Dropboxes: a DRAFT Dropbox and a FINAL SUBMISSION Dropbox for each of the lab reports required in this course.", "Lab reports can be submitted for a draft review for Turnitin® in the DRAFT Dropbox.", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as working in a lab and writing lab reports.", "Library for research-based assignments"]}, {"course_id": 63, "course_code": "CHE 161", "course_name": "CHE161 - Engineering Biology (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["09:30AM - 10:20AM RCH 110", "08:30AM - 09:20AM", "Friday -", "Friday", "10:30AM - 12:20PM", "•Chemical Engineering", "•Office hours: 2.30 pm-3.30 pm Mondays, can also be scheduled upon email request", "Introduction to basic concepts of biochemistry and cell biology.", "Properties and functions of biopolymers.", "Elements of cell structure and diversity, and relationship of biochemistry with cell metabolism.", "View requirements for CHE 161", "1) Demonstrate a basic understanding of biochemistry, cell biology and molecular biology (1b)", "2) Converse at a fundamental level with scientist and engineers that use biology and biotechnology (1b)", "5) Identify societal, safety and ethical concerns surrounding biotechnology.", "Biomolecules", "1.1 Sugar and Polysaccharides", "1.2 Fatty acids and derived polymers", "1.3 Amino acid and Proteins", "1.4 Nucleotides and Nucleic acids", "2.1 Life definition and classification", "2.2 Cell structure and reproduction", "2.3 Bioproduction", "3.2 Sugar metabolism", "3.3 Fatty acid metabolism", "3.4 Protein metabolism", "3.5 Enzyme kinetics", "4.1 Central Dogma"]}, {"course_id": 65, "course_code": "CHEM 123L", "course_name": "CHEM123L - General Chemistry Laboratory 2 (0.25)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["General Chemistry Laboratory 2 Winter 2025", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- a real life analysis", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 67, "course_code": "CHEM 237", "course_name": "CHEM237 - Introductory Biochemistry (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:20AM", "RCH 101", "10:30AM - 11:20AM RCH 101", "ESC 227", "Structure and properties of proteins and enzymes.", "develop a molecular level understanding of biological processes to achieve this the following learning outcomes will be", "in both qualitative and quantitative examples", "evaluate unknown thermodynamic parameters from given values of others.", "I equilibrium constants from standard free energy changes.", "qualitatively describe the composition of solutions of a weak acid or base as a function of pH.", "calculate the precise", "recognize the 20 amino acids that are commonly found in proteins and identify compounds derived from them", "calculate the charge on an amino acid side chain as a function of pH", "know the 4 levels of protein structure and the covalent and non covalent interactions that stabilize them", "explain how to purify proteins using the physical and chemical properties of the proteins", "determine the primary sequence of a protein given the appropriate data", "understand basic chemical kinetics and the application to biological systems", "determine the mechanism of inhibition of an enzyme using", "the structure of fatty acids and membrane lipids", "the structures of cell membranes and how the fatty acid composition of those membranes affects membrane structure and fluidity", "the structure of simple sugars and polysaccharides and the chemistry of the reactions in which they participate", "Suggested supplementary reading in \"Biochemistry Free for All\".", "Biochemistry free for all: Introduction Water and Buffers, pages 34-49", "VVP chapters 3 and 4.1", "Biochemistry free for all pages 53-70", "Appendix A.1 and A.2", "Chapter 4.2 and 4.3", "Biochemistry free for all.", "pp 74-108", "Week 6  Protein folding and Introduction to hemoglobin", "Chapter 4 - Biochemistry in focus", "Biochemistry free for all pages 128-141", "first kinetics Chapter 10 then mechanisms Chapter 9", "Biochemistry free for all pages 337-362", "Biochemistry free for all pp 190-217", "Biochemistry free for all pp 222-233", "Biochemistry free for all pp 287 - 312", "Notice of Recording"]}, {"course_id": 69, "course_code": "CHEM 254", "course_name": "CHEM254 - Introductory Chemical Thermodynamics (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["08:30AM - 09:20AM", "RCH 306", "B. Power", "Instructor: Bill Power", "An introduction to the first, second, and third laws of thermodynamics and the application of these laws to ideal systems, mixtures, and chemical reactions.", "Thermodynamic principles are used to study changes in state, including phase changes, and to establish the link between the equilibrium constant and the properties of the substances involved in a chemical reaction.", "This course is a basic introduction to thermodynamics with emphasis on applications in chemistry.", "The course provides the necessary background to study changes in state of many physical and chemical systems.", "Define and apply the four laws of thermodynamics", "Identify, describe and ultimately design a variety of physical and chemical systems through their internal changes and/or interactions with their surroundings", "Quantify internal energy U, heat q, work w, enthalpy H, entropy S and Gibbs energy G in that same variety of physical and chemical systems", "Predict spontaneous change in systems of varying complexity", "Explain and quantify transformations involving both pure substances and mixtures using thermodynamic concepts", "There will be online and in-class assignments, on a rotating interval of about two weeks.", "It will occur in a 2.5 hour time slot sometime between April 9 and April 25 (I have no control over this scheduling).", "I will have a copy on reserve in the library (https://www.reserves.uwaterloo.ca/ares/ares.dll?Action=10&Form=50&Value=222108) and the price listed here is for a one-year electronic subscription.", "In addition, I have prepared a number of narrated powerpoint lectures, which I hope you will find useful in learning the material.", "Each lecture also has notes that provide written transcripts of what I am speaking, in case that helps you to learn some of the terms.", "One will be tutorial assignments which you will complete the first half of the problem individually, then work on an extension of the problem in groups of 4.", "CHEM 254 - Winter 2025 | General | Microsoft Teams", "I will provide any materials there as well as on LEARN, just in case one or the other has access issues.", "Four of the assignments, involving both individual and group work in a team-based learning (TBL) format, should help you to be able to assess different thermodynamic systems and learn to use the appropriate thermodynamic tools.", "The other four assignments, to be completed individually and much broader in scope and effort required, will help you to apply those skills to more complex and realistic physical and chemical systems.", "These may cover several chapters at a time.", "This course includes the independent development and practice of specific skills, such as problem solving in a chemical and scientific context.", "Library for research-based assignments"]}, {"course_id": 71, "course_code": "CHEM 262L", "course_name": "CHEM262L - Organic Chemistry Laboratory for Engineering Students (0.25)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["08:30AM - 11:20AM ESC 104", "08:30AM - 11:20AM ESC 104", "Answers can be expected within 24 hours.", "Topics include acid-base chemistry, substitution reactions, liquid-liquid extraction, product isolation and purification.", "Be proficient with basic organic laboratory techniques including selecting proper glassware, measuring small and large quantities of solids and liquids, designing the setup required for simple synthetic reactions, filtration, and basic characterization.", "Understand and be able to design and execute a liquid-liquid extraction processes for the separation of ionizable acidic, ionizable basic, and non-ionizable (neutral) substances.", "Demonstrate independent thinking by answering questions in your own words, showing critical reflection beyond the initial description of observations and facts.", "Scheduling issues", "Fillable form online for Möbius support", "Laboratory performance marks will be given by the Teaching Assistants and Lab Instructor and averaged for each in-person lab period.", "This is not directly the case; we do expect students to need a lot of clarifications when working in the lab for the first time.", "Laboratory Worksheets and Reports", "Questions similar to the pre-laboratory quizzes and reports will be used, but may be modified to be multiple choice.", "General Policies", "Aside from LEARN, we will use various software to facilitate the delivery of the laboratory.", "Important note: Since the manual is printed months before delivery of the lab, we may need to make corrections during the term.", "All in-lab worksheets are completed individually but reports submitted on Crowdmark can be completed with your partner.", "Please be mindful of this and avoid missing your lab for unapproved reasons.", "Human rights must be centered in our pedagogical practice to ensure students feel safe and respected into our instructional spaces.", "We also acknowledge that speaking of underrepresented groups in Science is a misnomer and we should speak of historically excluded persons as Black, Indigenous, Queer and Persons of Colour have contributed to chemical research since the inception of the field."]}, {"course_id": 76, "course_code": "EARTH 122", "course_name": "EARTH122 - Introductory Environmental Sciences (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Introductory Environmental Sciences Winter 2025", "08:30AM - 09:50AM STC 1012", "I hold a PhD in Earth & Environmental Sciences from the University of Waterloo (2014) and an HBSc in Earth & Environmental Sciences from McMaster University (2006).", "You might notice I'm looking pretty pregnant!", "I'm conveniently due on April 27 BUT in the unlikely even that I have a baby really early, the excellent Dr. Keith Delaney (who has taught this class for many years) will step in at the end.", "Discussions", "Questions of a personal nature", "Office: EIT 2051D (very back of Earth & Environmental Sciences main office)", "Email: msrosamo@uwaterloo.ca", "Grad TA contact info can be found in the EARTH 122L syllabus.", "Course topics include sustainable development and the availability and use of natural resources, principles of ecology and environmental science, biogeochemical cycles, climate and climate change, soils and food supply, energy systems, surface water and groundwater, waste generation and management, pollution, and catastrophic natural processes.", "Describe common global environmental issues and the role of environmental science in identifying, understanding, and solving these issues.", "Interpret and manipulate simple box models of environmental systems", "Interpret scientific diagrams and graphs pertaining to environmental science", "1 January 06 - 10 Intro to Environmental Science & Matter, Energy and Physical Environment Chps 1 & 2", "2 January 13 - 17 Earth Systems/Ecosystems & Evolution, Biodiversity, Population Ecology Chps 3 & 4", "3 January 20 - 24 Species Interactions/Community Ecology & Human Population Chps 5 & 6", "Soils & Soil Resources*", "8 February 24 - 28 Freshwater Systems/Water Resources & Marine, Coastal Systems, Fisheries Chps 11 & 12 Quiz 6 - Chapters 11 & 12 Content Mon. Mar 3  5:00PM 3", "10 March 10 - 14 Global Climate Change & Fossil Fuels: Energy Use/Impacts Chps 14 & 15", "Energy Alternatives & Mineral Resources & Mining", "Quiz 8 - Chapters 15 & 16 & 17 Content*", "12 March 24 - 28 Managing our Waste & Environmental Health Hazards Chps 18 & 19 Quiz 9 - Chapters 18 & 19 Content Mon. Mar 31 5:00PM 3", "A Look at Environmental Science and Natural Hazards & Final Exam Study Guide / Discussion", "following these guidelines: https://uwaterloo.ca/science-undergraduate-office/academic-policies-and-procedures/accommodation-illness-or-other-extenuating-circumstances."]}, {"course_id": 77, "course_code": "EARTH 123", "course_name": "EARTH123 - Introductory Hydrology (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "Dr. Rosamond is the International Lecturer for Water Sciences in the Department of Earth & Environmental Sciences at the University of Waterloo.", "She loves learning about water, especially nutrients and greenhouse gases in streams in rivers.", "Email: msrosamo@uwaterloo.ca", "Education", "2014 - PhD, Earth & Environmental Sciences, University of Waterloo, Waterloo, ON, Canada", "2006 - Honours BSc, Earth & Environmental Science (Sedimentology Specialization), McMaster University, Hamilton ON, Canada", "Philosophy of Teaching", "Dr. Rosamond's teaching philosophy focuses on (a) active learning techniques, including field and laboratory experience, and practical demonstrations in class, (b) building on the mathematical and chemical fundamentals in Earth Sciences.", "She is interested in adapting curricula to include experiential learning, focus on students' analytical skills, and to scaffold skills and concepts across courses in Earth & Environmental Sciences.", "Yizhi is a graduate student in Earth & Environmental Sciences at University of Waterloo, looking at groundwater contamination.", "Email: y278yuan@uwaterloo.ca", "The material is both qualitative and quantitative in nature and focuses on the circulation of water through the atmosphere, soil, groundwater aquifers, as well as looking at both the global fresh and marine water systems.", "Emphasis is placed on the physical aspects of hydrology, and the geologic and environmental factors that control the occurrence and cycling of water on Earth, as well as the impacts caused by population growth, contamination, urbanization or land use management, and climate change.", "View requirements for EARTH 123", "Describe the complexity and inter-connections of the global hydrological cycle;", "Apply basic qualitative techniques for describing earth systems processes related to water and water movements;", "Create and critique a simple water balance equation for a lake, river, or groundwater system;", "Introduce Yourself &", "All times are in China Standard Time.", "December", "Can be purchased through e-book sellers.", "These are a mix of multiple choice, matching, and mathematical questions.", "Surveys", "Discussions", "Notice of Recording", "We will assess what to do on a case-by-case basis."]}]