[{"course_id": 8, "course_code": "EARTH 123", "course_name": "EARTH123 - Introductory Hydrology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Dr. Rosamond is the International Lecturer for Water Sciences in the Department of Earth & Environmental Sciences at the University of Waterloo.", "She loves learning about water, especially nutrients and greenhouse gases in streams in rivers.", "Email: msrosamo@uwaterloo.ca", "Education", "2014 - PhD, Earth & Environmental Sciences, University of Waterloo, Waterloo, ON, Canada", "2006 - Honours BSc, Earth & Environmental Science (Sedimentology Specialization), McMaster University, Hamilton ON, Canada", "Philosophy of Teaching", "Dr. Rosamond's teaching philosophy focuses on (a) active learning techniques, including field and laboratory experience, and practical demonstrations in class, (b) building on the mathematical and chemical fundamentals in Earth Sciences.", "She is interested in adapting curricula to include experiential learning, focus on students' analytical skills, and to scaffold skills and concepts across courses in Earth & Environmental Sciences.", "Yizhi is a graduate student in Earth & Environmental Sciences at University of Waterloo, looking at groundwater contamination.", "Email: y278yuan@uwaterloo.ca", "The material is both qualitative and quantitative in nature and focuses on the circulation of water through the atmosphere, soil, groundwater aquifers, as well as looking at both the global fresh and marine water systems.", "Emphasis is placed on the physical aspects of hydrology, and the geologic and environmental factors that control the occurrence and cycling of water on Earth, as well as the impacts caused by population growth, contamination, urbanization or land use management, and climate change.", "View requirements for EARTH 123", "Describe the complexity and inter-connections of the global hydrological cycle;", "Apply basic qualitative techniques for describing earth systems processes related to water and water movements;", "Create and critique a simple water balance equation for a lake, river, or groundwater system;", "Introduce Yourself &", "All times are in China Standard Time.", "December", "Can be purchased through e-book sellers.", "These are a mix of multiple choice, matching, and mathematical questions.", "Surveys", "Discussions", "Notice of Recording", "We will assess what to do on a case-by-case basis."]}, {"course_id": 10, "course_code": "EARTH 223", "course_name": "EARTH223 - Field Methods in Hydrology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrology Fall 2024", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "This course consists of field exercises and lectures designed to provide students with practical hands-on experience conducting a variety of hydrological monitoring techniques.", "This course is designed to provide hands-on field experience in the use of standard hydrologic monitoring techniques.", "The main objectives of this course are to use a variety of hydrologic data collection techniques in practical settings to answer hydrologic questions, identify the difficulty and importance of collecting good field data, and determine the accuracy/error of different measurement methods quantitatively and qualitatively.", "A Module will consist of two elements: (1) an activity in the field and (2) lecture and tutorial to review the fundamental concepts and discuss the data collected in the field.", "During each activity you will be working in groups of ~4.", "Assessment for each Module will consist of a pre-activity quiz administered on LEARN and an assignment that must be completed individually and uploaded to LEARN.", "Interpret the data in a hydrological context to explain groundwater/surface-water interactions, quantify water balances, and understand sources of contaminants found in water.", "Explain how drinking water in the Region of Waterloo is obtained, managed, and treated to ensure a safe and adequate supply.", "A Module will consist of two elements: (1) an activity in the field and (2) lecture and tutorial to review the fundamental concepts and discuss the data collected in the field.", "During each activity you will be working in groups of ~4.", "Assessment for each Module will consist of a pre-activity quiz administered on LEARN and an assignment that must be completed individually and uploaded to LEARN.", "Field Class Field Class Field Class Field Class", "Introduction (complete online)", "Sept 23**", "Sept 23**", "Sept 25**", "Sept 25**", "Oct 14**", "Oct 14**", "Oct 16**", "Oct 16**", "Oct 28**", "Oct 28**", "Oct 30**", "Oct 30**", "-", "Nov 25**", "-", "Nov 25**", "-", "-", "* complete virtually on your own", "***If possible", "These videos are designed to prepare you for the upcoming field activity and must be completed prior to the scheduled field activity time.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Must be uploaded as a single file", "Notice of Recording", "The field work is a critical part of this course and often you will be working in teams and so your lack of attendance may also result in some hardship for your group.", "You must be present for each field activity in order to get full credit for that activity  – unexcused absences will result in a 20% penalty for each missed field activity.", "For this reason, all students must complete WHMIS (Workplace Hazardous Materials Information System training) module before their first field activity session and provide proof of their training by uploading a picture of their form to DROPBOX.", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline).", "The policy can be found at: http://www.adm.uwaterloo.ca/infosec/Policies/policy33.htm", "Note on Avoidance of Academic Offences: Studying and working in groups to learn material can be a very valuable practice and is encouraged.", "Library for research-based assignments", "Strategies for learning online", "6 strategies for effective learning"]}, {"course_id": 13, "course_code": "EARTH 235", "course_name": "EARTH235 - Stratigraphic Approaches to Understanding Earth's History (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["08:30AM - 09:50AM EV2 2002", "jwjohnston@uwaterloo.ca", "10:00AM -", "jwjohnston@uwaterloo.ca", "10:00AM -", "jwjohnston@uwaterloo.ca", "Department of Earth and Environmental Sciences in the Faculty of Science @UWaterloo.", "At the University of Waterloo, Dr. Johnston teaches numerous classes such as Earth 121 - Introductory Earth Sciences, Earth 235 - Stratigraphic Approaches to Understanding Earth's History, Earth 390 - Methods in Geological Field Mapping, and occasional graduate classes such as Earth 691 Special Studies for MSc Students (i.e. Coastal Geology).", "He is a board member for the University of Waterloo Earth Science Museum and representative for the Geological Association of Canada on the North American Commission on Stratigraphic Nomenclature (former chair and vice chair).", "Discussions", "Email", "But please indicate the course name and number and reason for the email in the subject line.", "An introduction to stratigraphic principles and methods used in deciphering geological history.", "Techniques of collecting surface and subsurface geologic data and representation of stratigraphic data.", "Procedures applicable to the classification and nomenclature of stratigraphic units using the North American Stratigraphic Code.", "The development of stratigraphic sequences as controlled by global and regional tectonics and sea level fluctuations.", "Laboratory work will include construction and interpretation of various types of learning media such as traditional maps, cross sections, new physical and digital models, as well as extended reality.", "Describe and illustrate perspectives and applications of stratigraphy.", "Understand and apply the classification and nomenclature of stratigraphic units.", "Debate preservation potential though space and time.", "Professional Geoscientists Ontario - Student Member", "The level of geoscience education in a bachelor of science degree is considered to meet the minimum knowledge requirements recommended by Geoscientists Canada for admission to practice professional geoscience and for interprovincial (and international) mobility.", "Readings", "Week 1: Introduction and Collecting Geologic Data", "Module 1: Introduction Earth 235 Course Outline", "Introduce Yourself Discussion", "1c Field Techniques", "1d Field Notebook", "Module 4: Facies and Correlation 3a Facies", "3b Correlation", "Module 5: Introduction to the Stratigraphic Code (and Lithostratigraphic Chart for southern Ontario page) 4a", "Week 7: Canada's Structures and Introduction to Sequence Stratigraphy", "Module 10: Introduction to Sequence Stratigraphy 7a Sequence Stratigraphy", "Week 8: Relative Time and Absolute Dating and Age of the Earth", "Module 12: Absolute Dating and Age of the Earth", "Therefore, Dr. Johnston has compiled a unique set of readings from a variety textbooks and online sources.", "Instructions", "A complete set of labs is provided in Learn for each student to complete and then submit to the Learn Dropbox.", "Please follow these steps for each lab:", "Note: Labs are expected to be submitted in a well-organized, neat and legible fashion.", "Deliverables", "Your lab assignment must be submitted in the following file type:", "Most word processing software applications will allow you to save your file as a PDF; however, if you require software to create PDFs, some free options are listed below:", "Email subject line must include the course number and code and name of the assessment.", "Please email the entire EARTH 235 Team, including the TAs and your instructor to inform the entire Team and receive a prompt response.", "Please make sure you are registered with AAS first", "Intellectual property includes items such as:"]}, {"course_id": 14, "course_code": "EARTH 238", "course_name": "EARTH238 - Introductory Structural Geology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Introductory Structural Geology Winter 2024", "EARTH 238", "03:30PM - 04:20PM", "EARTH 238 201", "changcheng.li@uwaterloo.ca", "EIT 1013", "changcheng.li@uwaterloo.ca", "EARTH 238 102", "EIT 1013", "changcheng.li@uwaterloo.ca", "*", "Discussions", "To the teaching team: This is a discussion topic for you to give suggestions to the teaching team and for them to know the questions you have.", "Concepts of stress and strain; elementary rock mechanics; description and classification of folds, faults, foliations, lineations and joints; use of primary structures; introduction to geometrical analysis.", "Labs will emphasize geometrical problems, including geological maps and cross sections, and stereographic projection.", "Understand the process in which various geological structures develop", "Perform kinematic analysis from some simple structures", "Record orientation data in the right format according geological convention", "Read a geological map and draw cross sections base on the map", "Use an equal-area net to conduct geometrical analysis", "iClicker Students can use either iClicker student App or iClicker remote Yes", "Basic Methods of Structural Geology.", "Students have to answer a question in a quiz correctly to get the mark.", "Examination regulations as outlined in the current UW undergraduate calendar are to be followed."]}, {"course_id": 19, "course_code": "EARTH 421", "course_name": "EARTH421 - Advanced Geochemistry (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Advanced Geochemistry Fall 2024", "08:30AM - 09:50AM MC 4064", "01:00PM - 03:20PM", "08:30AM - 10:50AM EIT 1009", "Development of the three laws of thermodynamics; Gibbs free energy and equilibria constants.", "Introduction to various topics in aqueous geochemistry such as mineral equilibria, ion exchange, and redox equilibria.", "View requirements for EARTH 421", "Development of the three Laws of Thermodynamics; Gibbs free energy and equilibrium constants.", "Introduction to various topics in aqueous geochemistry, such as mineral equilibrium, ion exchange and redox equilibrium.", "Laboratory sessions will involve various activities related to acid-base equilibrium, redox reactions, chemical modeling, and analytical instrumentation methods.", "Thermodynamics offers Geoscientists a powerful tool to aid in the interpretation of near surface processes.", "It can be used to delineate the physicochemical conditions that led to a particular mineral assemblage; to discern whether a mineral assemblage could have resulted from equilibrium or disequilibrium (kinetic-controlled) conditions; to aid in decision-making in exploration geochemistry; and to design geochemical barriers and containment systems at waste disposal sites.", "Applications include geothermal systems, acid-mine drainage, carbon sequestration, and other near surface environmental systems.", "Develop thermodynamic principles most relevant to geochemical systems", "Understand the concepts of chemical equilibrium and metastability in the context of Earth systems", "Develop conceptual and empirical models to describe natural geochemical systems", "Apply geochemical principles toward achieving a sustainable use of Earth’s resources, including predicting the impacts of resource development and developing strategies for mitigation of impacts", "Communicate geochemical concepts to various audiences", "Introduction and review", "Thermodynamics of Pure Substances", "Examples: Steam separation in geothermal systems, CO2 compressibility for sequestration.", "Thermodynamics of Simple Mixtures", "Free Energy (G)", "Determining mineral phase transitions.", "The derivation of the equilibrium constant (K) from the first and second laws.", "The need for the third law and evidence; where thermodynamic data originates and its limitations", "Free energy calculations", "Aqueous Solutions", "Applications of acid-base and redox reactions in natural and perturbed systems.", "Aqueous geochemistry", "Solubility products and saturation indices; the influence of ion hydrolysis on mineral and gas solubilities.", "The Carbonate System", "An examination of carbonate gas-water-solid equilibrium and the factors that influence it.", "A look at analogous geochemical systems.", "Recommended reading for those pursuing advanced degrees in geochemistry."]}, {"course_id": 20, "course_code": "EARTH 436A", "course_name": "EARTH436A - Thesis Proposal (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["EARTH 436A", "EARTH 436A 001", "11:30AM -", "View requirements for EARTH 436A", "Thesis Course (Earth 436) provides an opportunity for students to design and conduct independent research under the supervision of a faculty member in the Department of Earth & Environmental Sciences.", "In the past years, a number of excellent research projects have been completed leading in some cases to award winning presentations at conferences and publications in peer-reviewed journals.", "Students must normally obtain a minimum mark of 75% in Earth 436A to be allowed to register in Earth 436B. For students who enroll in Earth 436A only, the scope of work will involve the selection of a scientific topic of interest, detailed review of several published papers on the subject and the development of a potential research project that would fill a gap in current knowledge on the subject.", "In Earth 436B, the remaining activities required to complete the research project are carried out based on the experimental design formulated in Earth 436A. The format and structure of the Final Research Report can be either a conventional thesis document or a journal manuscript.", "It involves oral communication either one on one or before groups both large and small and written communication, which involves preparation of maps, charts and 6 narrative reports with personal observations, analyses and reviews of your own new work and that of previous workers.", "While most of your work will be technical and reflect scientific rigor, you may be called upon to prepare shorter status and policy briefs for decision-makers, legal summaries and commentaries, mine stakes and resource claim descriptions, and other items, all of which require organized and well-reasoned clear writing.", "Students should familiar with and able to do the following at the end of this course: • plan and conduct independent and original research under the guidance of a research advisor • learn how to explore, organize, execute, share and disseminate the results of your own scientific questions and thoughts • acquire new practical research and analytical skills using data either collected by yourself in the field or assembled in the laboratory or information/data collected by someone else (often the faculty advisor) in a research environment that you would not have had a chance to do elsewhere in your program • learn discipline-specific protocols and procedures for addressing scientific questions and procedures and formats for reporting technical information according to discipline or sub\u0002discipline standards • acquire an appreciation for and basic skill level to organize, interpret, and identify relevance of new information and research results • understand how to organize, communicate effectively and clearly disseminate new information to peers and other professionals, both written and orally • know how to undertake self-assessment, and learn how to give and receive constructive review and critique by your peers", "DATE ACTIVITIES & DUE DATES  ATTENDANCE & GRADING", "No meeting", "23 September", "Applying for graduate school and applying for NSERC & other scholarships.", "Work on research design proposal", "No meeting", "Farvolden Day and Job Fair", "No meeting", "No meeting", "No meeting", "No Meeting", "Presentation Abstract:", "2 December No meeting Work on your project and final thesis design; Finish writing & Edit No meeting", "9 December", "No meeting", "No meeting", "FINAL RESEARCH DESIGN PROPOSAL 50%", "Many professors have a number of possible projects in mind.", "Topics involving co-advisors outside of the Dept. of Earth & Environmental Sciences must be approved by the Earth 436A instructor.", "Write a short summary of the project and include the objectives, context, methods and major findings in sentence form (~250 words max.)", "and then give a critique of the thesis in sentence form (~150 words max.).", "Maximum length for the summary and critique is one page single spaced (~400 words max.", "FINAL RESEARCH DESIGN PROPOSAL (50%): The final research design proposal contains an Introduction, comprehensive Literature Review, Overall Goal(s) and (specific) Objectives, Experimental Design and Methods (including anticipated results and potential data presentation)."]}, {"course_id": 21, "course_code": "EARTH 440", "course_name": "EARTH440 - Quaternary Geology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "02:30PM - 05:20PM", "Students can expect a response within 48 hours from Monday to Friday.", "The TA will also be available during in-person laboratory sessions.", "Glacial-interglacial cycles and sub-Milankovitch oscillations from ocean sediments and ice cores.", "Glacial sediment-land systems.", "Local field trips.", "View requirements for EARTH 440", "Local field trips focusing on the regional Quaternary geology and sedimentology of glacial sediments.", "Know the main principles, concepts and approaches pertaining to the study of Quaternary sediments and landforms (especially glacial sediments in Canada);", "Knowledge of the Quaternary geology of southern Ontario;", "Knowledge of the main applications of glacial geology;", "Gain experience recognising and investigating landforms and glaciogenic sediments using tools such as Google Earth and a GIS;", "Gain experience searching for and using public spatial datasets from various government agencies and other sources;", "Experiment and learn to create engaging and accurate stories about Quaternary geology features and maps", "Appreciation and basic knowledge of the complexity of changes that have occurred throughout the Quaternary Period", "The following textbooks have also been used in the development of this course:", "Field trips: Four field trips will occur during lecture and lab session hours in September and early October.", "The field trips are intended to give an overview of the glacial stratigraphy and sediment-landform assemblages in the region as well as some hands-on experience.", "You will be given the opportunity to learn some basic field description/measurement procedures.", "Important note: Field trip fees may be charged to cover direct costs of travel (essentially the cost of school bus transportation service).", "In-class quizzes: There will be a series of short in-class quizzes (~10-15 min each) throughout the term.", "Each team will have to prepare a StoryMap summarizing the field trips and with one particular aspect of the trips highlighted and explained in greater details.", "The second StoryMap will be about a specific map sheet area selected from a short list of available surficial geology maps produced by a government geological survey in recent years.", "The StoryMap will provide an overview of the main geological and geomorphological features of the map, and will also put the map into the broader regional context based on the available scientific literature.", "Notice of Recording", "Weekends and holidays will not count when determining a late submission penalty"]}, {"course_id": 22, "course_code": "EARTH 456", "course_name": "EARTH456 - Numerical Methods in Hydrogeology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Numerical Methods in Hydrogeology Winter 2025", "An introduction to the theory and practice of groundwater flow and contaminant transport modeling.", "Topics related to variably-saturated flow will focus on derivation of Richard's equation, a control volume finite difference discretization, assembly and solution of the flow equation, material balance error, truncation error analysis, stability and monotonicity.", "Explain the fundamental theory behind groundwater flow and contaminant transport modeling", "Apply numerical techniques, including control volume finite difference discretization, to solve groundwater flow and contaminant transport equations.", "Analyze numerical model accuracy, including material balance error, truncation error, stability, and monotonicity in variably-saturated flow and contaminant transport problems.", "Use a modeling software to model variably-saturated flow and contaminant transport.", "Interpret and visualize groundwater flow and contaminant transport model results and communicate findings effectively.", "Identify the concepts of groundwater and solute transport modeling and their real-world applications.", "Section 1.1 Derivation of Richards' Equation", "Section 1.2 Derivation of Richards 'Equation – Pressure Head Formulation", "Section 1.3 Three-Dimensional Groundwater Flow", "Derive and interpret three-dimensional groundwater flow dynamics and their mathematical representation.", "Section 1.4 Control Volume Finite Difference Discretization for Flow", "Section 1.5 A Rigorous Derivation of the Control Volume Finite Difference Discretization", "Develop, apply, and justify control volume finite difference discretization techniques for groundwater flow problems, demonstrating a rigorous understanding of mathematical principles.", "Assemble and implement saturated groundwater flow equations in numerical models using discretized formulations.", "Assemble the saturated groundwater flow equation using control volume discretization.", "Analyze groundwater flow material balance errors and their implications for numerical model accuracy.", "Section 1.8 Truncation Error Analysis", "Section 1.8 Truncation Error Analysis", "Section 1.9 Stability and Monotonicity", "Section 2.1 Derivation of the Contaminant Transport Equation", "Analyze the stability and monotonicity of numerical methods for groundwater flow models.", "Derive the contaminant transport equation and articulate its role in modeling solute movement through porous media.", "Section 2.1 Derivation of the Contaminant Transport Equation", "Section 2.2 Control Volume Finite Difference Discretization of the Contaminant Transport Equation", "Section 2.3 Central Spatial Weighting of Advective Flux", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Apply control volume finite difference discretization to the contaminant transport equation for numerical modeling.", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Section 2.4 Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.5 Upstream Spatial Weighting of Advective Flux", "Section 2.5.1 Truncation Error of Upstream Spatial Weighting", "Section 2.6 Crank-Nicolson Temporal Weighting with Upstream Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.7 Assembly of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.7.1 Monotonicity of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.8 Assembly of Fully-Implicit Temporal Weighting with Upstream Spatial Weighting", "Section 2.8.1 Monotonicity of Upstream Spatial Weighting with Fully-Implicit Temporal Weighting", "Section 2.9 Boundary Conditions for Transport Coupled to Flow", "Analyze the accuracy of various contaminant transport weighting schemes and their impact on numerical model performance.", "Apply boundary conditions for contaminant transport coupled with groundwater flow and assess material balance errors to ensure reliable numerical simulations.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "The total maximum bonus points that can be earned across all five assignments is five.", "Students can earn bonus points by actively participating in discussions or helping their peers understand the course material and assignments.", "Explaining a challenging concept to peers in a collaborative study session.", "A maximum of five contributions will be allowed per assignment."]}, {"course_id": 23, "course_code": "EARTH 458", "course_name": "EARTH458 - Physical Hydrogeology (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrogeology Fall 2024", "08:30AM - 09:50AM DWE 3519", "An introduction to the principles and theories of mineral deposit genesis.", "Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered.", "View requirements for EARTH 458L", "Applied geophysics provides geoscientists with a wide-range of non-invasive methods for characterizing the Earth's interior.", "This course is an introduction to the physical principles underlying field acquisition, processing, and data interpretation for commonly used applied geophysical techniques (seismic, electrical, electromagnetic induction, gravity, and magnetic methods).", "This course is not only pertinent for geoscientists but also for engineers and others interested in learning how physics can be used to explore the Earth's interior or perform non-destructive testing.", "Near-surface geophysics is used to characterize the shallow subsurface for a wide-spectrum of applications.", "This application-oriented course covers current methodology in near-surface geophysics, including electrical, electromagnetic, ground penetrating radar, seismic refraction, and well-logging methods.", "Techniques for geophysical data acquisition and interpretation are studied and applied to field data.", "Examples of the application of geophysical techniques to archeological, forensics, geotechnical, glaciology, and hydrogeological problems are examined.", "View requirements for EARTH 461", "A field-oriented course on current methodology in the general area of geotechnical or engineering geophysics as applied to environmental problems.", "Typical topics covered: well logging and time domain electromagnetic surveys for groundwater supply; magnetic and terrain conductivity surveys for waste materials; ground penetrating radar applications to stratigraphy and contamination; streaming potential surveys of dam leakage.", "A pre-lab quiz must be completed before attending each field lab.", "Labs will be completed in groups with field data recorded in field books or datasheets.", "These data will be used to a complete individual lab assignment.", "This site contains over 100 groundwater monitoring wells.", "Field lab activities involve:", "(3) Measurement of in-situ hydraulic conductivity using single-well response tests", "Each lab will provide you with a unique dataset that you will use to develop a conceptual site model of the local groundwater flow system.", "• Properly construct and interpret soil core logs using United Soil Classification System, and make lithostratigraphic interpretations using geophysical logs", "• Assess and interpret water level measurements through the construction of water table maps and flownets", "• Interpret single-well response tests including falling and rising head (slug) tests to determine in-situ hydraulic conductivity", "• Interpret hydraulic pumping tests to determine aquifer transmissivity and storage parameters and assess water resource vulnerability", "Each module will contain a series of recorded lecture slides and video demonstrations reviewing core concepts and guidelines for the upcoming field lab.", "Please include “Earth 458L” in the subject line of all e-mail communications as well as your Full Name and Student ID# in the text of the email.", "Hydrogeological equipment to make measurements and collect data (temporary use)", "Specialized hydrogeological software to complete certain assignments", "Datasheet to record field data", "Other data should be recorded in your field books and distributed to your group members as needed.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Notice of Recording", "Participation in Field Labs:", "These quizzes are designed to keep you on schedule and prepare you for the in-person field lab and assigned activities.", "There will be a 48-hour grace period to finalize the submission of your assigned activities without incurring any late penalty."]}, {"course_id": 27, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 31, "course_code": "GEOE 223", "course_name": "GEOE223 - Differential Equations and Balance Laws (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Differential Equations and Balance Laws Winter 2025", "10:00AM - 11:20AM RCH 309", "08:30AM - 09:20AM", "An introduction to ordinary differential equations with applications to mass and energy balance problems in engineering.", "Standard methods of solution of first and second order linear equations with constant coefficients.", "Numerical methods for solving ordinary differential equations.", "Many practical physical and engineering problems can be analyzed using mathematical models formulated in terms of ordinary differential equations; these often arise from the application of mass, momentum, or energy balance laws.", "The objective of this course is to equip engineering students with a working knowledge of the methods which are used to solve these equations.", "Differential equations are introduced, along with standard methods of solution for first and second order linear equations with constant coefficients.", "identify and differentiate between the various types of differential equations; with this knowledge, be able to identify the most appropriate method of solution", "pose appropriate boundary or initial conditions and solve that equation using standard methods for given a mathematical problem statement expressed in terms of a linear differential equation", "check whether a solution to a differential equation is correct", "think critically about a mathematical problem and evaluate the validity of results from mathematical methods", "appreciate the utility and value of having an education in mathematics as part of their training as an engineer", "Canadian Engineering Accreditation Board", "Piazza – Wiki-style Q&A; primary way to get & give text-based help in ENVE/GEOE 223", "Drop-in Hours", "Students are very welcome and encouraged to meet with the teaching team in scheduled drop-in hours.", "1 Jan 6-10 CH1: Introductory concepts and definitions, simply integrable and separable solutions", "2 Jan 13-17 CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties, substitution", "3 Jan 20-24 CH3: Applications of linear first-order ODEs", "4 Jan 27-31 CH4: Solving homogeneous linear higher-order ODEs with constant coefficients A1, Jan 28", "6 Feb 10-14 CH6: Applications of linear higher-order linear ODEs", "Reading Week & Family Day", "7 Feb 24-28 CH7: Slope fields and numerical solution of first-order ODEs A2, Feb 25", "Notes of Diffy Qs, Differential Equations for Engineers, Jiří Lebl, Creative Commons, 2024.", "Calculus for Engineers (4e), Donald Trim, Pearson, 2007.", "Common first-year calculus text.", "CH1: Introductory concepts & definitions, simply integrable & separable solutions 0.2,3; 1.1,3 15.1,2", "CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties; substitution 1.4", "CH3: Applications of linear first-order ODEs 1.4 15.2,3,5", "CH4: Solving homogeneous linear higher-order ODEs with constant coefficients 2.1-3 15.6-8", "CH5: Solving non-homogeneous linear higher-order ODEs with constant coefficients using the method of undetermined coefficients 2.5 15.9", "CH6: Applications of linear higher-order linear ODEs  2.4 15.10", "CH7: Slope fields and numerical solution of first-order ODEs 1.2,7", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "extenuating circumstance", "This course includes the independent development and practice of engineering specific skills.", "Campus Supports", "Library for research-based assignments"]}, {"course_id": 36, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 37, "course_code": "MATH 106", "course_name": "MATH106 - Applied Linear Algebra 1 (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Applied Linear Algebra 1 Winter 2025", "Systems of linear equations.", "Introduction to vector spaces.", "We will see how to solve systems of linear equations using matrix methods before studying matrices as algebraic objects in their own right.", "Next, we will learn about the fundamental concepts of span, linear independence, and basis and learn how to determine whether a set is a subspace of Rn.", "After studying subspaces, we will study linear mappings, which map subspaces to subspaces.", "We will discuss the geometric interpretation of these mappings and study their fundamental subspaces.", "Finally, we will learn how to calculate the determinant of a matrix and use this knowledge to diagonalize square matrices.", "Provide a graphical and algebraic description of vectors, lines, and planes in R^n", "Model and solve mathematical and discipline-specific problems using systems of linear equations", "Perform basic algebraic operations on matrices", "Given a set of vectors in R^n, determine whether it is linearly independent, a spanning set of R^n, or a basis of R^n", "Given a basis and a vector in standard coordinates, use matrix methods to calculate its coordinate vectors", "Given a set in R^n, determine whether it is a subspace of R^n", "Given a mapping L: R^n --> R^m, determine whether it is linear", "Given a linear mapping, choose the appropriate algorithm find a basis for each of its fundamental subspaces", "Given a square matrix, calculate its determinant and provide a geometric interpretation of this value", "Communicate ideas and concepts relating to linear algebra using accurate mathematical language and notation", "Calculators", "Avoiding Academic Offences", "I am committed to creating a learning environment where diverse perspectives are recognized and valued as a source of strength.", "School-Life Conflict"]}, {"course_id": 45, "course_code": "PHYS 112L", "course_name": "PHYS112L - Physics 2 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Sean Dougherty", "Aney Kapadia", "Kayra Erisoglu-Akyildiz", "jbschrie@uwaterloo.ca", "s2doughe@uwaterloo.ca", "Course Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"'", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 3 - Circuits", "Experiment 4 - Circuits", "Experiment 5 - Circuits", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 46, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 47, "course_code": "PHYS 122L", "course_name": "PHYS122L - Waves, Electricity and Magnetism Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 2 - Circuits", "Experiment 5 - Magnetic Fields of a Coil", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 48, "course_code": "CS 100", "course_name": "CS100 - Introduction to Computing Through Applications (0.50)", "term_name": "Required Courses", "program_name": "Earth Sciences", "program_id": 48, "major_id": 4, "major_name": "Earth Sciences - Hydrogeology Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Computing Through Applications Winter 2025", "Friday -", "Friday", "10:30AM - 12:20PM MC 3005", "10:30AM - 12:20PM MC 3027", "Dave Tompkins", "E-mail: dtompkins@uwaterloo.ca", "E-mail: cs100@uwaterloo.ca", "Introduction to the Internet, World Wide Web, HTML, and XML.", "Algorithms underlying the functional components of web search engines and their influence on data access.", "CS 100: Introduction to Digital Information, Computers, the Internet and Applications", "Explain the emerging computing technologies introduced in the course.", "Digital Information", "Computer + Network organization", "Dynamic web pages and web applications", "Privacy and security", "Emerging Topics", "Distributed networking and \"big data\"", "Artificial intelligence", "ChatGPT and large language models", "Social media and monetization", "A1 released", "Laptops, Devices and Software", "Library for research-based assignments"]}, {"course_id": 4, "course_code": "MATH 115", "course_name": "MATH115 - Linear Algebra for Engineering (0.50)", "term_name": "1A Term", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Linear Algebra for Engineering Fall 2024", "02:30PM - 03:20PM", "RCH 301", "RCH 301", "10:30AM - 11:20AM E7 5353", "02:30PM - 03:20PM", "E. Dupont", "03:30PM - 04:20PM E7 5343", "10:30AM - 12:20PM RCH 301", "10:30AM - 12:20PM", "PHY 313", "E. Dupont", "08:30AM - 09:20AM", "08:30AM - 10:20AM PHY 313", "08:30AM - 10:20AM RCH 309", "10:30AM - 11:20AM RCH 103", "11:30AM - 12:20PM RCH 103", "RCH 204", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "08:30AM - 10:20AM EV3 4412", "08:30AM - 10:20AM MC 4058", "02:30PM - 03:20PM", "09:30AM - 10:20AM RCH 302", "F. Al-Faisal", "10:30AM - 12:20PM MC 4063", "10:30AM - 12:20PM MC 4060", "10:30AM - 11:20AM RCH 110", "F. Al-Faisal", "03:30PM - 04:20PM", "02:30PM - 04:20PM MC 4060", "DWE 3522", "Tuesday -", "07:00PM - 08:50PM", "Linear equations, matrices, and determinants.", "Introduction to vector spaces.", "Eigenvalues and diagonalization.", "Present solutions to problems in a clear and logical manner with all steps being fully justified.", "Understand the basic operations of addition and scalar multiplication as they apply to vectors, matrices and linear transformations.", "Find the solution to a system of linear equations using matrices and elementary row operations.", "Understand matrix algebra and its connection to systems of equations.", "Have both a geometric and an algebraic understanding of span, linear independence, bases and subspaces.", "Recognize the link between matrices and linear transformations, and understand that many common geometric operations such as projections, reflections and rotations are linear transformations.", "Develop a basic algebraic and geometric understanding of complex numbers and complex polynomials.", "Determine the eigenvalues and eigenvectors of a matrix and diagonalize a matrix.", "1.1 Vectors in Rn", "1.2 Linear Combinations", "1.3 The Norm and the Dot Product", "1.4 Vector Equations of Lines and Planes", "1.5 The Cross Product in R3", "1.6 The Scalar Equation of Planes in R3", "1.7 Projections", "Chapter 2 Systems of Linear Equations", "2.1 Introduction and Terminology", "2.2 Solving Systems of Linear Equations", "2.3 Rank", "2.4 Homogeneous Systems of Linear Equations", "3.1 Matrix Algebra", "3.2 The Matrix-Vector Product", "3.3 The Matrix Equation Ax=b", "3.4 Matrix Multiplication", "3.5 Matrix Inverses", "4.1 Spanning Sets", "4.2 Geometry of Spanning Sets", "4.3 Linear Dependence and Linear Independence", "4.4 Subspaces of Rn", "4.5 Bases and Dimension", "4.6 Fundamental Subspaces of a Matrix", "Chapter 5 Linear Transformations", "5.1 Matrix Transformations and Linear Transformations", "5.2 Examples of Linear Transformations", "5.3 Operations on Linear Transformations", "5.4 Inverses of Linear Transformations", "5.5 The Kernel and the Range", "Chapter 6 Determinants", "6.1 Determinants and Invertibility", "6.2 Elementary Row and Column Operations", "6.3 Properties of Determinants", "7.1 Basic Operations", "7.2 Conjugate and Modulus", "7.3 Polar Form", "7.4 Complex Polynomials", "7.5 Complex nth Roots", "Chapter 8 Eigenvalues and Eigenvectors", "8.1 Introduction", "8.2 Computing Eigenvalues and Eigenvectors", "8.3 Eigenspaces", "8.4 Diagonalization", "8.5 Powers of Matrices", "Linear Algebra for Engineering Fall 2024 Course Notes Required text provided on LEARN Yes", "Linear Algebra with Applications by Keith Nicholson Optional text provided on LEARN No", "The Linear Algebra for Engineering Fall 2024 Course Notes is the required text for this course, and is available on LEARN.", "The text Linear Algebra with Applications is an optional text also available on LEARN for those students looking for an alternate exposition of the material and/or additional problems to work on.", "Students looking for extra practice beyond the course notes are welcome to attempt problems in the corresponding sections of the optional textbook.", "Python Assignments: Throughout the term, there will be 5 equally weighted assignments where students will use python to execute some prewritten code in an effort to explore some larger-scale applications of linear algebra.", "If you find yourself in a situation where you are missing multiple assessments, then you are advised to contact both your instructor and the First Year Engineering Office to make sure you have the proper supports in place to succeed in this courses.", "To be clear - such websites are not allowed to be used for the completion of any part of the course MATH 115, and students are not permitted to share questions from the course anywhere.", "Generative AI: This course includes the independent development and practice of specific skills, such as computations, problem solving and proof writing.", "Library for research-based assignments"]}, {"course_id": 6, "course_code": "COMMST 192", "course_name": "COMMST192 - Communication in the Engineering Profession (COMPE, ELE, MGTE) (0.50)", "term_name": "1A Term", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["D. Shakespeare", "In this course students in Computer, Electrical, and Management Engineering will enhance oral and written communication competencies in contexts relevant to the engineering profession.", "By participating in classes and completing course assignments, you will practice genres of communication crafted for audiences that might include employers, clients, peer groups, technical staff, public audiences, and regulatory and policy-focused stakeholders.", "By focusing on genre, design, and audience, you will come to better understand concepts including meaning-making, perception, and responsibility.", "More generally, in this course, students can and should learn professional norms of technical communication and dominant forms of sharing knowledge within the fields of engineering.", "Yet this course also attempts to teach students how these communicative forms are matters of social context and sites of negotiation and contestation.", "We also hope students will find their place and voice in the conversations in their fields of study and reflect on the meaning and shape of available forums for technical communication.", "describe and apply conventions, genres, and norms, and values of communication in an engineering discipline", "compose persuasive, audience-specific technical arguments", "analyze and summarize technical content in a clear and concise way", "You (students) will understand the complexity of communication as a human process of shared meaning-making in the context of power, history, and culture.", "You will increase your capacity to recognize and enhance yours and others’ agency – the ability to make a difference in the world for yourself and others – and understand the implications of your communication behaviours for yourself and others.", "You will recognize diverse linguistic practices and modes of communication as resources for writers and speakers.", "You will understand communication as a practice, and improve your critical and creative communication competencies by developing your ability to use writing, speaking, and other media of communication to create effective and engaging artifacts.", "You will reflect on your role in fostering the public good (the multifaceted well-being of individuals and groups), begin to imagine a better future, and make decisions in your communication that can transform the communities to which you belong.", "4 September Introduction to the Course \"The Art of Communicating Science\" (TED) acquire course text", "9 September Introduction to Rhetoric; Facts, Evidence, and Opinions Crowley & Hawhee; McBrayer read assigned texts", "18 November Ethics for Engineers in-class texts", "27 November Discourse and Power", "Late assignments will be penalized at a rate of 3% per day, including weekends and holidays.", "To record your efforts, you will be given a participation sheet that you will complete at the end of each session: you'll rate yourself for your performance and describe your in-class activities.", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website"]}, {"course_id": 10, "course_code": "ECE 124", "course_name": "ECE124 - Digital Circuits and Systems (0.50)", "term_name": "1B Term", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Digital Circuits and Systems Winter 2025", "Monday -", "Monday", "08:30AM - 10:20AM", "03:30PM - 04:20PM E7 5343", "Monday -", "Monday", "08:30AM - 10:20AM", "08:30AM - 09:50AM RCH 302", "11:30AM - 12:20PM RCH 302", "Number systems and Boolean arithmetic.", "Boolean algebra and simplification of Boolean functions.", "View requirements for ECE 124", "understand Boolean algebra and manipulate Boolean operations to simplify related functions,", "comprehend logic gates, and design, optimize and implement combinational logic circuits,", "gain knowledge of digital storage elements and finite state machines, and design and analyze synchronous sequential circuits,", "grasp the essential principles of analyzing and designing asynchronous sequential circuits,", "understand common number systems for signed numbers and design basic arithmetic circuits", "Boolean logic and algebra", "Algebraic simplification and applications", "Optimized implementations", "Introduction to sequential circuits", "Design of synchronous sequential circuits", "Asynchronous sequential circuit analysis and design", "Number representations and simple arithmetic circuits", "Number conversion (review & self-study).", "Binary logic and circuits.", "Don’t cares and multiple outputs.", "Flip-flop choices.", "Analysis of ASC.", "Hazards free circuits.", "Number systems (octal and hex).", "Presentations in E2-2364 by lab instructor", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "The time and room number for the tutorial sessions where some of the practice problems will be solved/discussed are", "Tut 101, 102 & 103:   3:30-4:20M in E7-5343", "Labs are integral part of the course and must be completed in a satisfactory manner.", "The weights on these remote exams will remain the same as those stated earlier for the case of in-person (see weight distribution tables under Student Assessment).", "This course includes the independent development and practice of specific skills, such as FPGA design coding with VHDL or Verilog Hardware description languages.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca"]}, {"course_id": 11, "course_code": "ECE 140", "course_name": "ECE140 - Linear Circuits (0.50)", "term_name": "1B Term", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Linear Circuits Winter 2025", "ECE 140", "ECE 140 001", "03:30PM - 04:20PM E7 5343", "Friday -", "Friday", "04:30PM - 05:20PM", "M. Cooper-Stachowsky", "04:30PM - 05:20PM", "Friday -", "Friday", "ECE 140 201", "08:30AM - 11:20AM E2 3344", "ECE 140 202", "08:30AM - 11:20AM E2 3344", "08:30AM - 11:20AM E2 3344", "ECE 140 204", "01:30PM - 04:20PM E2 3344", "01:30PM - 04:20PM E2 3344", "01:30PM - 04:20PM E2 3344", "ECE 140 101", "08:30AM - 11:20AM E5 4106", "ECE 140 102", "08:30AM - 11:20AM E5 4106", "ECE 140 103", "08:30AM - 11:20AM E5 4106", "02:30PM - 04:20PM DWE 3518", "ECE 140 105", "ECE 140 106", "Section 001 - Computer Engineering", "Email: derek.wright@uwaterloo.ca", "Office: E7-3324", "Bookings include a Teams link when in-person meetings are not possible.", "Section 002 - Software Engineering", "Email: mstachowsky@uwaterloo.ca", "Email:    m4alsaad@uwaterloo.ca", "Katherine Idzik", "Email:    kidzik@uwaterloo.ca", "TAs Name Duty Email", "Avraiem Iskandar Labs a2iskand@uwaterloo.ca", "Analysis of linear circuits.", "Preparing for, conducting, and reporting of laboratory experiments.", "View requirements for ECE 140", "Understand the characteristics and properties of linear electric circuit components", "Analyze intermediate linear circuits under DC, transient and AC operating conditions", "Use (apply) appropriate electronics lab tools for building and debugging intermediate linear circuits", "3.[1-4,6]", "12 Mar 23 Sinusoidal Steady-State Analysis 13.[1,2,4] Tutorial 5", "1 3 Voltage and Current", "3 9 Circuit Analysis Methods", "4 11 Operational Amplifiers", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 12, "course_code": "ECE 192", "course_name": "ECE192 - Engineering Economics and Impact on Society (0.25)", "term_name": "1B Term", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Economics and Impact on Society Winter 2025", "03:30PM - 04:20PM E7 5343", "Monday, Friday -", "This course teaches engineering economics and the impact of engineering on the society at large.", "Important concepts of engineering economics including cash flow diagrams, present worth, quantification of impact costs, and rate of return analysis are presented.", "Energy supply scenarios and the environment, global energy use and supply, and environmental impacts of engineering projects are discussed.", "View requirements for ECE 192", "Prepare a cash flow diagram and perform cash flow analysis", "Perform a rate-of-return analysis for an engineering problem", "Solve economic problems and evaluate engineering project alternatives", "Chapters 1: Economic Analysis and Cost Estimation", "Decision Making and Problem Classification", "Engineering Cost Estimation and Cash Flow Diagrams", "Chapters 2: Economic Analysis and Cost Estimation", "The Power of Compounding", "Compound InterestFactors", "Non-uniform CashFlows", "Depreciation", "Present Worth Analysis", "Future Worth Analysis", "Annual Worth Analysis", "Chapter 5: Internal Rate of Return Analysis", "Payback Period Analysis", "Chapter 6: Other Rate of Return Analysis", "Chapter 7: Cost-Benefit Analysis", "Benefit-Cost Ratio", "Incremental Benefit-Cost Analysis", "Sensitivity Analysis", "Break-even Analysis", "Basic Probability and Expected-Value Analysis", "Chapter 9: Decision Making", "Decision-Tree Analysis", "eTextbook: Engineering Economics: Financial Decision Making for Engineers (Canadian Edition) Yes TBD", "E.M., and Pirnia, M., Engineering Economics: Financial Decision Making for Engineers, 6th ed., Pearson Canada, 2016."]}, {"course_id": 15, "course_code": "ECE 204", "course_name": "ECE204 - Numerical Methods (0.50)", "term_name": "2A Term", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Numerical Methods Winter 2025", "ECE 204", "ECE 204 002", "03:30PM - 04:20PM E7 4043", "02:30PM - 03:20PM", "E7 4043", "03:30PM - 04:20PM E7 4043", "ECE 204 001", "08:30AM - 09:20AM E7 4043", "10:30AM - 11:20AM E7 4043", "09:30AM - 10:20AM E7 4043", "ECE 204:", "Application of computational methods to engineering problems.", "Number systems, errors and error propagation.", "Introduction to numerical linear algebra.", "Interpolation and numerical integration.", "Introduction to numerical solutions of ordinary differential equations, optimization.", "View requirements for ECE 204", "As an overview, this course will introduce the application of computational methods for modeling and simulating real-world physical systems.", "By comprehending the limitations of such arithmetic, we can develop computational methods that enable us to mitigate these effects allowing us to, in turn, to attain sufficiently accurate approximations or simulations within a practical timeframe.", "To describe, examine, design and develop tools that can be used to approximate solutions to both linear and nonlinear algebraic equations and systems of such equations.", "To describe, examine, design and develop tools that can be used to approximate solutions to analytic equations (initial- and boundary-value problems) and systems of such equations.", "Also, the Department of Electrical and Computer Engineering cancels classes during mid-term week and, instead, offers make-up lectures.", "2 Representation of real numbers", "3 Tools for finding numerical algorithms", "3.2 Iteration and fixed-point iteration", "3.3 Linear algebra", "3.4 Interpolation", "3.6 Bracketing", "3.7 Intermediate-value theorem", "3.8 Summary of tools and looking ahead", "5 Introduction to approximating the value of expressions", "5.1 Evaluating a polynomial at a point and Horner's rule", "5.2.1 Approximating values using interpolating polynomials", "5.3 Least-squares best-fitting polynomials", "5.3.1 Approximating a point using least-squares best-fitting polynomials", "5.3.2 Approximating the derivative using least-squares best-fitting polynomials", "5.3.3 Approximating an integral using least-squares best-fitting polynomials", "6 Approximating solutions to algebraic equations", "6.1 Approximating the solution to the quadratic equation", "6.2 Approximating solutions to non-linear algebraic equations", "6.2.3 The bracketed secant method", "6.2.4 The secant method", "6.3 Approximating solutions to systems of linear equations", "6.3.1 The Gauss-Seidel method", "6.3.2 The method of successive over-relaxation", "6.4 Approximating solutions to systems of non-linear equations", "6.4.1 Newton's method in n dimensions", "7.1.1 Approximating solutions to initial-value problems (IVPs)", "7.1.1.1 Approximating solutions to first-order IVPs", "7.1.1.1.1 Euler's method", "The 4th-order Runge-Kutta method", "7.1.1.1.4 Error analysis of these methods", "7.1.1.2 Adaptive techniques for 1st-order initial-value problems (IVPs)", "7.1.1.2.1 Adaptive Euler-Heun method", "7.1.1.2.2 Adaptive Dormand-Prince method", "7.1.1.3 Approximating solutions to systems of 1st-order IVPs", "7.1.1.4 Approximating solutions to higher-order IVPs", "7.1.1.5 Approximating solutions to systems of higher-order IVPs", "7.1.2 Approximating solutions to boundary-value problems", "7.1.2.1 The shooting method", "7.1.2.2 The finite-difference method", "7.1.2.3 Neumann and insulated boundary conditions", "7.2 Approximating solutions to partial differential equations", "7.2.1 The heat equation in one dimension", "7.2.2 The wave equation in one dimension", "8 Optimization", "8.1 Optimizing functions of a real variable", "8.1.1 Step-by-step optimization", "8.1.2 Newton's method for finding extrema", "8.1.3 The golden-ratio search", "8.2 Optimizing functions of a vector variable", "8.2.1 Hooke-Jeeves method", "8.2.2 Newton's method for finding extrema in n dimensions", "The University of Waterloo also has a site licence for Matlab., which you may choose to use other than Octave.", "The laboratory sessions are help sessions where you can speak to a teaching assistant.", "MOSS is used to verify that all source code in projects is not plagiarized from peers either from this offering or previous offerings of this course.", "Notice of Recording", "Generative artificial intelligence: This course includes the independent development and practice of specific skills, such as software design and development.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at uWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 25, "course_code": "ECE 298", "course_name": "ECE298 - Instrumentation and Prototyping Laboratory (0.25)", "term_name": "2B Term", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Instrumentation and Prototyping Laboratory Fall 2024", "08:30AM - 11:20AM E2 3353", "08:30AM - 11:20AM E2 3353", "08:30AM - 11:20AM E2 3353", "08:30AM - 11:20AM E2 3353", "08:30AM - 11:20AM E2 3353", "Prototyping such as printed circuit board design and manufacture.", "View requirements for ECE 298", "Getting any electronic design from a concept to a PCB assembly requires knowledge with practical engineering techniques,", "with design development software and with Lab instrumentation.", "expand their levels of experience in these areas.", "Each student will be purchasing a kit from the W Bookstore to build a PCB assembly of this non-embedded design.", "Students will work in teams of two to design a feasibility model of a solution and then", "prepare it for a prototype development cycle.", "3) GAIN FAMILIARITY WITH THE USE OF LAB EQUIPMENT in design debug", "4) DEVELOP AND PRESENT A PROTOTYPE DESIGN FOR A MINI-DESIGN REVIEW.", "5) PREPARE A PCB DESIGN AND DOCUMENTATION FOR A PROTOTYPE DESIGN SUBMISSION", "(5c) Apply the workflow for designing and assembling embedded systems", "(4a) Define requirements and specifications for an open-ended design problem", "Lab B2 –Embedded Project: Preparations for Final Feasibility Model Development and DEMO", "Develop the Project functions using a breadboard as a platform to interface kit components and the MCU Development board.", "Develop the MCU code to operate each component interface circuit individually first.", "Lab B3 –Embedded Project: Preparations for FINAL FEASIBILITY MODEL Schematic Design and FINAL Feasibility Model DEMO & DESIGN REVIEW VIDEO:", "Develop a schematic of the Final Feasibility Model design using Proteus tools.", "Create NET CLASSES in the schematic.", "Create a Video for a mini-Design Review of your Feasibility Model Schematic Design.", "Lab B4 –Embedded Project: Prototype Development and Report", "Cover all design details and organize them for a Prototype Report.", "PROTOTYPE MODEL Report Development Begins", "Prototype Model Development Report - Team Mark 15%", "LAB B1 starts SEPT 23", "EMBEDDED PROJECT: PROTOTYPE SCHEMATIC AND PCB DESIGN FILES."]}, {"course_id": 37, "course_code": "ARBUS 202", "course_name": "ARBUS202 - Professional and Business Ethics (0.50)", "term_name": "Ethics List", "program_name": "Electrical Engineering", "program_id": 53, "major_id": 2, "major_name": "Electrical Engineering (Bachelor of Applied Science - Honours)", "topics": ["11:30AM -", "V. Fernandes", "Study of ethical and moral issues that typically arise in professional and business activity.", "In the context of this course we will look specifically at ethical issues and principles of conduct that are relevant to professionals and business people.", "Topics include: fundamentals of moral and political theory, ethical decision-making, professional responsibility, corporate social responsibility, and equality, among other things.", "Like many other courses in philosophy, this series of lectures, readings, and discussions will deal with a critical analysis of many and varied views regarding life, existence, values, religious belief, etc.", "Form an opinion on the importance of ethical reasoning in business and professional contexts.", "Identify ethical problems in complex professional and business related situations.", "Apply ethical concepts to particular business and professional situations.", "Explain the roles of professional codes of conduct and codes of ethics in real world contexts.", "1 Jan 6 - 10 Introduction", "Module 2 Check-in", "3 Jan 20 - 24 Ethical Decision Making", "Module 3 Check-in", "5 Feb 3 - 7 Equality & Discrimination", "Module 6 Check-in", "7 Feb 24 - 28 Markets & the Environment", "Module 7 Check-in", "Module 9 Check-in", "Module 10 Check-in", "11 Mar 24 - 28 Whistle-blowing and Codes of Ethics", "Module 11 Check-in", "Module 12 Check-in", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}]