[{"course_id": 21, "course_code": "GEOE 223", "course_name": "GEOE223 - Differential Equations and Balance Laws (0.50)", "term_name": "2A Term", "program_name": "Geological Engineering", "program_id": 72, "major_id": 1, "major_name": "Geological Engineering (Bachelor of Applied Science - Honours)", "topics": ["Differential Equations and Balance Laws Winter 2025", "10:00AM - 11:20AM RCH 309", "08:30AM - 09:20AM", "An introduction to ordinary differential equations with applications to mass and energy balance problems in engineering.", "Standard methods of solution of first and second order linear equations with constant coefficients.", "Numerical methods for solving ordinary differential equations.", "Many practical physical and engineering problems can be analyzed using mathematical models formulated in terms of ordinary differential equations; these often arise from the application of mass, momentum, or energy balance laws.", "The objective of this course is to equip engineering students with a working knowledge of the methods which are used to solve these equations.", "Differential equations are introduced, along with standard methods of solution for first and second order linear equations with constant coefficients.", "identify and differentiate between the various types of differential equations; with this knowledge, be able to identify the most appropriate method of solution", "pose appropriate boundary or initial conditions and solve that equation using standard methods for given a mathematical problem statement expressed in terms of a linear differential equation", "check whether a solution to a differential equation is correct", "think critically about a mathematical problem and evaluate the validity of results from mathematical methods", "appreciate the utility and value of having an education in mathematics as part of their training as an engineer", "Canadian Engineering Accreditation Board", "Piazza – Wiki-style Q&A; primary way to get & give text-based help in ENVE/GEOE 223", "Drop-in Hours", "Students are very welcome and encouraged to meet with the teaching team in scheduled drop-in hours.", "1 Jan 6-10 CH1: Introductory concepts and definitions, simply integrable and separable solutions", "2 Jan 13-17 CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties, substitution", "3 Jan 20-24 CH3: Applications of linear first-order ODEs", "4 Jan 27-31 CH4: Solving homogeneous linear higher-order ODEs with constant coefficients A1, Jan 28", "6 Feb 10-14 CH6: Applications of linear higher-order linear ODEs", "Reading Week & Family Day", "7 Feb 24-28 CH7: Slope fields and numerical solution of first-order ODEs A2, Feb 25", "Notes of Diffy Qs, Differential Equations for Engineers, Jiří Lebl, Creative Commons, 2024.", "Calculus for Engineers (4e), Donald Trim, Pearson, 2007.", "Common first-year calculus text.", "CH1: Introductory concepts & definitions, simply integrable & separable solutions 0.2,3; 1.1,3 15.1,2", "CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties; substitution 1.4", "CH3: Applications of linear first-order ODEs 1.4 15.2,3,5", "CH4: Solving homogeneous linear higher-order ODEs with constant coefficients 2.1-3 15.6-8", "CH5: Solving non-homogeneous linear higher-order ODEs with constant coefficients using the method of undetermined coefficients 2.5 15.9", "CH6: Applications of linear higher-order linear ODEs  2.4 15.10", "CH7: Slope fields and numerical solution of first-order ODEs 1.2,7", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "extenuating circumstance", "This course includes the independent development and practice of engineering specific skills.", "Campus Supports", "Library for research-based assignments"]}, {"course_id": 23, "course_code": "GEOE 224", "course_name": "GEOE224 - Probability and Statistics (0.50)", "term_name": "2A Term", "program_name": "Geological Engineering", "program_id": 72, "major_id": 1, "major_name": "Geological Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Instructor (first-half)", "E2-3322", "TBD", "TBD", "TBD", "TBD", "TBD", "TBD", "TBD", "john.quilty", "spbuis", "Role of probability in engineering and decision-making under uncertainty.", "Basic probability concepts.", "Introduction to regression analysis.", "Introduction to design of experiments and statistical quality control.", "Probability concepts and statistics are used to quantify this “uncertainty” and hopefully reduce the “risk” in our design and decision-making.", "This course aims to introduce students to the basic concepts of probability and statistics.", "Mathematical Expectation", "Statistical Estimation", "Regression Analysis", "Mathematical Expectation", "Statistical Estimation", "Regression Analysis", "Probability and Statistics for Engineers and Scientists, 9th Ed.", "These problem sets are ungraded and meant for you to test and apply the concepts learned in the lectures.", "Notice of Recording"]}, {"course_id": 28, "course_code": "EARTH 235", "course_name": "EARTH235 - Stratigraphic Approaches to Understanding Earth's History (0.50)", "term_name": "2B Term", "program_name": "Geological Engineering", "program_id": 72, "major_id": 1, "major_name": "Geological Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 09:50AM EV2 2002", "jwjohnston@uwaterloo.ca", "10:00AM -", "jwjohnston@uwaterloo.ca", "10:00AM -", "jwjohnston@uwaterloo.ca", "Department of Earth and Environmental Sciences in the Faculty of Science @UWaterloo.", "At the University of Waterloo, Dr. Johnston teaches numerous classes such as Earth 121 - Introductory Earth Sciences, Earth 235 - Stratigraphic Approaches to Understanding Earth's History, Earth 390 - Methods in Geological Field Mapping, and occasional graduate classes such as Earth 691 Special Studies for MSc Students (i.e. Coastal Geology).", "He is a board member for the University of Waterloo Earth Science Museum and representative for the Geological Association of Canada on the North American Commission on Stratigraphic Nomenclature (former chair and vice chair).", "Discussions", "Email", "But please indicate the course name and number and reason for the email in the subject line.", "An introduction to stratigraphic principles and methods used in deciphering geological history.", "Techniques of collecting surface and subsurface geologic data and representation of stratigraphic data.", "Procedures applicable to the classification and nomenclature of stratigraphic units using the North American Stratigraphic Code.", "The development of stratigraphic sequences as controlled by global and regional tectonics and sea level fluctuations.", "Laboratory work will include construction and interpretation of various types of learning media such as traditional maps, cross sections, new physical and digital models, as well as extended reality.", "Describe and illustrate perspectives and applications of stratigraphy.", "Understand and apply the classification and nomenclature of stratigraphic units.", "Debate preservation potential though space and time.", "Professional Geoscientists Ontario - Student Member", "The level of geoscience education in a bachelor of science degree is considered to meet the minimum knowledge requirements recommended by Geoscientists Canada for admission to practice professional geoscience and for interprovincial (and international) mobility.", "Readings", "Week 1: Introduction and Collecting Geologic Data", "Module 1: Introduction Earth 235 Course Outline", "Introduce Yourself Discussion", "1c Field Techniques", "1d Field Notebook", "Module 4: Facies and Correlation 3a Facies", "3b Correlation", "Module 5: Introduction to the Stratigraphic Code (and Lithostratigraphic Chart for southern Ontario page) 4a", "Week 7: Canada's Structures and Introduction to Sequence Stratigraphy", "Module 10: Introduction to Sequence Stratigraphy 7a Sequence Stratigraphy", "Week 8: Relative Time and Absolute Dating and Age of the Earth", "Module 12: Absolute Dating and Age of the Earth", "Therefore, Dr. Johnston has compiled a unique set of readings from a variety textbooks and online sources.", "Instructions", "A complete set of labs is provided in Learn for each student to complete and then submit to the Learn Dropbox.", "Please follow these steps for each lab:", "Note: Labs are expected to be submitted in a well-organized, neat and legible fashion.", "Deliverables", "Your lab assignment must be submitted in the following file type:", "Most word processing software applications will allow you to save your file as a PDF; however, if you require software to create PDFs, some free options are listed below:", "Email subject line must include the course number and code and name of the assessment.", "Please email the entire EARTH 235 Team, including the TAs and your instructor to inform the entire Team and receive a prompt response.", "Please make sure you are registered with AAS first", "Intellectual property includes items such as:"]}, {"course_id": 30, "course_code": "CIVE 221", "course_name": "CIVE221 - Advanced Calculus (0.50)", "term_name": "2B Term", "program_name": "Geological Engineering", "program_id": 72, "major_id": 1, "major_name": "Geological Engineering (Bachelor of Applied Science - Honours)", "topics": ["Advanced Calculus Fall 2024", "10:00AM - 11:20AM STC 0020", "Email: spotapenko@uwaterloo.ca", "Differentiation; partial derivatives of implicit and explicit functions, applications including optimizations.", "Integration; multiple integrals in various co-ordinate systems with applications.", "Vector calculus; vector fields, line integrals, surface integrals, and applications.", "Numerical integration and differentiation.", "Differential Calculus of Multivariable Functions", "Multiple Integrals", "Introduction to Vector Calculus", "develop skills in differential and integral calculus of multivariable functions at the level sufficient to study upper level engineering courses", "analyze the behaviour of multivariable functions", "evaluate typical multiple and line integrals", "apply major theorems of vector calculus to physical problems", "Chapter 12: Differential calculus of multivariable functions", "Multivariable functions, 799 (D. Trim, Calculus for Engineers, 4th edition)", "Limits and continuity, 803", "Relative maxima and minima, 851", "Absolute maxima and minima, 860", "Fluid pressure, 911", "Centers of mass and moments of inertia, 916", "Surface area, 925", "Double iterated integrals in polar coordinates, 930", "Centers of mass and moments of inertia, 950", "Triple iterated integrals in cylindrical coordinates", "Triple iterated integrals in spherical coordinates, 959", "General transformations in multiple integrals, 965", "Vector fields, 983", "Line integrals involving vector functions, 998", "Energy and conservative force fields, 1012", "Surface integrals involving vector fields, 1027", "Relative and absolute maxima and minima", "Lagrange multipliers", "Double iterated integrals", "Applications of double integrals, polar coordinates", "Triple integrals and applications; cylindrical and spherical coordinates", "Vector fields, line integrals of vector functions, independence of integration path", "In case if students disagree with their mark, within one week after the date on which the tests had been returned to the students, they should send the instructor a written request in which they should mention specifically the parts of the test they want to be re-evaluated.", "Please note that the provisions of the marking scheme cannot be challenged and no verbal requests to re-evaluate test papers will be considered.", "Correct answers without clear and concise justification will be awarded minimal marks", "Covid‐19 Emergency Self‐Isolation", "They will review your case and coordinate a reasonable and fair plan in consultation with the instructors and appropriate others (e.g., Engineering Undergraduate Office, AccessAbility Services, Engineering Counselling services, Registrar's Office"]}, {"course_id": 33, "course_code": "EARTH 458", "course_name": "EARTH458 - Physical Hydrogeology (0.50)", "term_name": "3A Term", "program_name": "Geological Engineering", "program_id": 72, "major_id": 1, "major_name": "Geological Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrogeology Fall 2024", "08:30AM - 09:50AM DWE 3519", "An introduction to the principles and theories of mineral deposit genesis.", "Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered.", "View requirements for EARTH 458L", "Applied geophysics provides geoscientists with a wide-range of non-invasive methods for characterizing the Earth's interior.", "This course is an introduction to the physical principles underlying field acquisition, processing, and data interpretation for commonly used applied geophysical techniques (seismic, electrical, electromagnetic induction, gravity, and magnetic methods).", "This course is not only pertinent for geoscientists but also for engineers and others interested in learning how physics can be used to explore the Earth's interior or perform non-destructive testing.", "Near-surface geophysics is used to characterize the shallow subsurface for a wide-spectrum of applications.", "This application-oriented course covers current methodology in near-surface geophysics, including electrical, electromagnetic, ground penetrating radar, seismic refraction, and well-logging methods.", "Techniques for geophysical data acquisition and interpretation are studied and applied to field data.", "Examples of the application of geophysical techniques to archeological, forensics, geotechnical, glaciology, and hydrogeological problems are examined.", "View requirements for EARTH 461", "A field-oriented course on current methodology in the general area of geotechnical or engineering geophysics as applied to environmental problems.", "Typical topics covered: well logging and time domain electromagnetic surveys for groundwater supply; magnetic and terrain conductivity surveys for waste materials; ground penetrating radar applications to stratigraphy and contamination; streaming potential surveys of dam leakage.", "A pre-lab quiz must be completed before attending each field lab.", "Labs will be completed in groups with field data recorded in field books or datasheets.", "These data will be used to a complete individual lab assignment.", "This site contains over 100 groundwater monitoring wells.", "Field lab activities involve:", "(3) Measurement of in-situ hydraulic conductivity using single-well response tests", "Each lab will provide you with a unique dataset that you will use to develop a conceptual site model of the local groundwater flow system.", "• Properly construct and interpret soil core logs using United Soil Classification System, and make lithostratigraphic interpretations using geophysical logs", "• Assess and interpret water level measurements through the construction of water table maps and flownets", "• Interpret single-well response tests including falling and rising head (slug) tests to determine in-situ hydraulic conductivity", "• Interpret hydraulic pumping tests to determine aquifer transmissivity and storage parameters and assess water resource vulnerability", "Each module will contain a series of recorded lecture slides and video demonstrations reviewing core concepts and guidelines for the upcoming field lab.", "Please include “Earth 458L” in the subject line of all e-mail communications as well as your Full Name and Student ID# in the text of the email.", "Hydrogeological equipment to make measurements and collect data (temporary use)", "Specialized hydrogeological software to complete certain assignments", "Datasheet to record field data", "Other data should be recorded in your field books and distributed to your group members as needed.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Notice of Recording", "Participation in Field Labs:", "These quizzes are designed to keep you on schedule and prepare you for the in-person field lab and assigned activities.", "There will be a 48-hour grace period to finalize the submission of your assigned activities without incurring any late penalty."]}, {"course_id": 49, "course_code": "CIVE 554", "course_name": "CIVE554 - Geotechnical Engineering 3 (0.50)", "term_name": "4B Term", "program_name": "Geological Engineering", "program_id": 72, "major_id": 1, "major_name": "Geological Engineering (Bachelor of Applied Science - Honours)", "topics": ["Geotechnical Engineering 3 Winter 2025", "11:30AM -", "11:30AM - 12:20PM DWE 3518", "Email: n2elyasi@uwaterloo.ca", "This course focuses on the design of earth structures using geotechnical engineering concepts taught in CIVE/GEOE 353 and 354 and new engineering and design concepts.", "You will be exposed to all required engineering concepts through recorded lectures, in-class tutorials, assigned readings and the completion and submission of assignments and design projects.", "The assignments and design projects are structured to review key engineering concepts and to simulate the work of a practicing geotechnical consulting engineer.", "Understand the role of the geotechnical engineer and Engineer of Record in construction projects", "Evaluate geotechnical borehole records", "Evaluate geotechnical field and laboratory test data", "Design earth structures using soil mechanics principles", "Evaluate earth dam design components and potential failure modes", "Prepare geotechnical design reports", "Course concepts include:", "1) The role of the Design Engineer", "3) Design of Earth Dams, and", "The time date and location of the tutorial will be announced in advance via MSTEAMs and via email communication.", "Assignments will be assigned throughout the term, to enhance the understanding of key geotechnical engineering concepts and to advance the completion of your design project.", "Embankment Design Project 35", "This course includes the independent development and practice of specific skills, such as the application of soil mechanic principles for the design of earth structures.", "Library for research-based assignments"]}, {"course_id": 58, "course_code": "CIVE 332", "course_name": "CIVE332 - Civil Systems and Project Management (0.50)", "term_name": "Technical Electives List", "program_name": "Geological Engineering", "program_id": 72, "major_id": 1, "major_name": "Geological Engineering (Bachelor of Applied Science - Honours)", "topics": ["Civil Systems and Project Management Winter 2025", "10:00AM - 11:20AM MC 2066", "INSTRUCTOR:    Muhammad Bilal, E2-3328 m25bilal@uwaterloo.ca", "E2-3328", "E2-3321", "Introduction to conceptual planning, construction, management, optimization, and life-cycle performance assessment of civil engineering systems including capital projects.", "Fundamentals of decision theory including concepts of risk, uncertainty, utility, probability, value of information, and game theory.", "Tools for supporting decision-making process, including linear and integer programming, network models, optimization, and Monte Carlo simulation.", "Risk- and cost-benefit analysis of public projects and their impact on sustainability, and quality of life.", "Design, model and analyze some civil engineering systems and understand their complexity;", "Choose and effectively apply tools and methods to improve civil engineering systems performance;", "Apply fundamentals of decision analysis, utility and game theory to assess and quantify risk, uncertainty, and expected utility used in decision-support systems;", "Demonstrate the use of project management tools and methods to applications in planning, scheduling, and estimating on engineering projects; and", "Mathematically and numerically formulate, structure and solve optimization problems (single/multiple/linear/integer/non-linear) using multi-criteria decision-making methods, including assessing sensitivity of decisions.", "PART 1 – Systems Theory: Design Methodology", "PART 1 – Systems Theory: Complex Systems + Review", "Linear Programming Intro", "PART 4 – Optimization: Linear Programming", "Multi-objective programming", "Linear programming models of network flow", "Linear programming models of network flow", "Integer and Mixed Integer Programming"]}, {"course_id": 61, "course_code": "CIVE 460", "course_name": "CIVE460 - Engineering Biomechanics (0.50)", "term_name": "Technical Electives List", "program_name": "Geological Engineering", "program_id": 72, "major_id": 1, "major_name": "Geological Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Biomechanics Winter 2025", "02:30PM - 05:20PM", "RCH 301", "Introduction to engineering technologies applicable to the field of biomechanics.", "Specific topics covered may include biological growth, form and function; biomaterials; kinematics and neurology of gait; biotribology; joint anatomy, function and repair; occupational biomechanics; trauma prevention.", "The course will provide a general overview of engineering biomechanics for civil, mechanical and biomedical engineering students.", "2. Conduct gait analysis and calculate forces applied at joints and foot reactions", "Introduction", "Evolution of Biomechanics", "Applications (medical and engineering)", "Musculoskeletal System", "Introduction,", "Anatomical positions & movements,", "System components,", "Gait Biomechanics", "Introduction;", "Muscles forces,", "Bone & Cartilage Biomechanics", "Introduction (highlights & progress),", "Bone mechanical properties & applications;", "Cartilage structure and mechanics", "Tendon & Ligament biomechanics", "Mechanical behaviour", "Biotribology & Joint Replacement", "Biotribology subfields,", "Cancer Biomechanics", "Introduction: cancer stages,", "Mechanical characteristics of cancer cells,", "Biomechanics and cancer treatment,", "Cardiovascular biomechanics, and", "Biomechanics in Radiotherapy", "“Orthopaedic Biomechanics: Mechanics and Design in Musculoskeletal Systems,” Pearson Prentice Hall.", "Biomechanics and motor control of human movement.", "Biomechanics and motor contAl-Mayah, A. (Ed.)"]}, {"course_id": 63, "course_code": "CIVE 542", "course_name": "CIVE542 - Pavement Structural Design (0.50)", "term_name": "Technical Electives List", "program_name": "Geological Engineering", "program_id": 72, "major_id": 1, "major_name": "Geological Engineering (Bachelor of Applied Science - Honours)", "topics": ["Pavement Structural Design Winter 2025", "10:00AM - 11:20AM DWE 3516", "P. Tavassoti-Kheiry", "Office Hours Tuesdays from 13:00-14:00 held by Elaheh in E2-2346F", "In case you need to contact the teaching team, make sure to add CIVE542 to the beginning of the subject line!", "Be familiar with the general history of pavements and evolution of structural design methods", "Understand the basics of pavements mechanics and critical structural responses", "Understand the key concepts of pavement materials and their characterization", "Apply a variety of analytical, and numerical/mathematical methods to solve problems about stress, strain, and displacement distribution within pavement layers", "Be able to use RTAC and Asphalt Institute method to design flexible pavements", "Have a working knowledge of KENPAVE and AASHTOWare software packages", "Understand the major failure mechanisms for flexible and rigid pavements and distresses", "Have the means to think critically about a pavement engineering problem and evaluate the accuracy and validity of results from the design methods", "A1 Posted", "Pavement Management Systems – L#12", "Pavement distresses & Construction", "Optional Textbook Pavement Asset Design and Management Guide, Tighe S. (Editor), Publications of the Transportation Association of Canada, 460 p No 299", "As part of the course work, a case study focusing on pavement design using AASHTOWare software and other tools will be defined as the term project to be done individually.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as critical thinking, engineering judgment, engineering design, problem solving, and professional engineering practices.", "Library for research-based assignments"]}, {"course_id": 69, "course_code": "EARTH 421", "course_name": "EARTH421 - Advanced Geochemistry (0.50)", "term_name": "Technical Electives List", "program_name": "Geological Engineering", "program_id": 72, "major_id": 1, "major_name": "Geological Engineering (Bachelor of Applied Science - Honours)", "topics": ["Advanced Geochemistry Fall 2024", "08:30AM - 09:50AM MC 4064", "01:00PM - 03:20PM", "08:30AM - 10:50AM EIT 1009", "Development of the three laws of thermodynamics; Gibbs free energy and equilibria constants.", "Introduction to various topics in aqueous geochemistry such as mineral equilibria, ion exchange, and redox equilibria.", "View requirements for EARTH 421", "Development of the three Laws of Thermodynamics; Gibbs free energy and equilibrium constants.", "Introduction to various topics in aqueous geochemistry, such as mineral equilibrium, ion exchange and redox equilibrium.", "Laboratory sessions will involve various activities related to acid-base equilibrium, redox reactions, chemical modeling, and analytical instrumentation methods.", "Thermodynamics offers Geoscientists a powerful tool to aid in the interpretation of near surface processes.", "It can be used to delineate the physicochemical conditions that led to a particular mineral assemblage; to discern whether a mineral assemblage could have resulted from equilibrium or disequilibrium (kinetic-controlled) conditions; to aid in decision-making in exploration geochemistry; and to design geochemical barriers and containment systems at waste disposal sites.", "Applications include geothermal systems, acid-mine drainage, carbon sequestration, and other near surface environmental systems.", "Develop thermodynamic principles most relevant to geochemical systems", "Understand the concepts of chemical equilibrium and metastability in the context of Earth systems", "Develop conceptual and empirical models to describe natural geochemical systems", "Apply geochemical principles toward achieving a sustainable use of Earth’s resources, including predicting the impacts of resource development and developing strategies for mitigation of impacts", "Communicate geochemical concepts to various audiences", "Introduction and review", "Thermodynamics of Pure Substances", "Examples: Steam separation in geothermal systems, CO2 compressibility for sequestration.", "Thermodynamics of Simple Mixtures", "Free Energy (G)", "Determining mineral phase transitions.", "The derivation of the equilibrium constant (K) from the first and second laws.", "The need for the third law and evidence; where thermodynamic data originates and its limitations", "Free energy calculations", "Aqueous Solutions", "Applications of acid-base and redox reactions in natural and perturbed systems.", "Aqueous geochemistry", "Solubility products and saturation indices; the influence of ion hydrolysis on mineral and gas solubilities.", "The Carbonate System", "An examination of carbonate gas-water-solid equilibrium and the factors that influence it.", "A look at analogous geochemical systems.", "Recommended reading for those pursuing advanced degrees in geochemistry."]}, {"course_id": 72, "course_code": "EARTH 440", "course_name": "EARTH440 - Quaternary Geology (0.50)", "term_name": "Technical Electives List", "program_name": "Geological Engineering", "program_id": 72, "major_id": 1, "major_name": "Geological Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "02:30PM - 05:20PM", "Students can expect a response within 48 hours from Monday to Friday.", "The TA will also be available during in-person laboratory sessions.", "Glacial-interglacial cycles and sub-Milankovitch oscillations from ocean sediments and ice cores.", "Glacial sediment-land systems.", "Local field trips.", "View requirements for EARTH 440", "Local field trips focusing on the regional Quaternary geology and sedimentology of glacial sediments.", "Know the main principles, concepts and approaches pertaining to the study of Quaternary sediments and landforms (especially glacial sediments in Canada);", "Knowledge of the Quaternary geology of southern Ontario;", "Knowledge of the main applications of glacial geology;", "Gain experience recognising and investigating landforms and glaciogenic sediments using tools such as Google Earth and a GIS;", "Gain experience searching for and using public spatial datasets from various government agencies and other sources;", "Experiment and learn to create engaging and accurate stories about Quaternary geology features and maps", "Appreciation and basic knowledge of the complexity of changes that have occurred throughout the Quaternary Period", "The following textbooks have also been used in the development of this course:", "Field trips: Four field trips will occur during lecture and lab session hours in September and early October.", "The field trips are intended to give an overview of the glacial stratigraphy and sediment-landform assemblages in the region as well as some hands-on experience.", "You will be given the opportunity to learn some basic field description/measurement procedures.", "Important note: Field trip fees may be charged to cover direct costs of travel (essentially the cost of school bus transportation service).", "In-class quizzes: There will be a series of short in-class quizzes (~10-15 min each) throughout the term.", "Each team will have to prepare a StoryMap summarizing the field trips and with one particular aspect of the trips highlighted and explained in greater details.", "The second StoryMap will be about a specific map sheet area selected from a short list of available surficial geology maps produced by a government geological survey in recent years.", "The StoryMap will provide an overview of the main geological and geomorphological features of the map, and will also put the map into the broader regional context based on the available scientific literature.", "Notice of Recording", "Weekends and holidays will not count when determining a late submission penalty"]}, {"course_id": 74, "course_code": "EARTH 456", "course_name": "EARTH456 - Numerical Methods in Hydrogeology (0.50)", "term_name": "Technical Electives List", "program_name": "Geological Engineering", "program_id": 72, "major_id": 1, "major_name": "Geological Engineering (Bachelor of Applied Science - Honours)", "topics": ["Numerical Methods in Hydrogeology Winter 2025", "An introduction to the theory and practice of groundwater flow and contaminant transport modeling.", "Topics related to variably-saturated flow will focus on derivation of Richard's equation, a control volume finite difference discretization, assembly and solution of the flow equation, material balance error, truncation error analysis, stability and monotonicity.", "Explain the fundamental theory behind groundwater flow and contaminant transport modeling", "Apply numerical techniques, including control volume finite difference discretization, to solve groundwater flow and contaminant transport equations.", "Analyze numerical model accuracy, including material balance error, truncation error, stability, and monotonicity in variably-saturated flow and contaminant transport problems.", "Use a modeling software to model variably-saturated flow and contaminant transport.", "Interpret and visualize groundwater flow and contaminant transport model results and communicate findings effectively.", "Identify the concepts of groundwater and solute transport modeling and their real-world applications.", "Section 1.1 Derivation of Richards' Equation", "Section 1.2 Derivation of Richards 'Equation – Pressure Head Formulation", "Section 1.3 Three-Dimensional Groundwater Flow", "Derive and interpret three-dimensional groundwater flow dynamics and their mathematical representation.", "Section 1.4 Control Volume Finite Difference Discretization for Flow", "Section 1.5 A Rigorous Derivation of the Control Volume Finite Difference Discretization", "Develop, apply, and justify control volume finite difference discretization techniques for groundwater flow problems, demonstrating a rigorous understanding of mathematical principles.", "Assemble and implement saturated groundwater flow equations in numerical models using discretized formulations.", "Assemble the saturated groundwater flow equation using control volume discretization.", "Analyze groundwater flow material balance errors and their implications for numerical model accuracy.", "Section 1.8 Truncation Error Analysis", "Section 1.8 Truncation Error Analysis", "Section 1.9 Stability and Monotonicity", "Section 2.1 Derivation of the Contaminant Transport Equation", "Analyze the stability and monotonicity of numerical methods for groundwater flow models.", "Derive the contaminant transport equation and articulate its role in modeling solute movement through porous media.", "Section 2.1 Derivation of the Contaminant Transport Equation", "Section 2.2 Control Volume Finite Difference Discretization of the Contaminant Transport Equation", "Section 2.3 Central Spatial Weighting of Advective Flux", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Apply control volume finite difference discretization to the contaminant transport equation for numerical modeling.", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Section 2.4 Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.5 Upstream Spatial Weighting of Advective Flux", "Section 2.5.1 Truncation Error of Upstream Spatial Weighting", "Section 2.6 Crank-Nicolson Temporal Weighting with Upstream Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.7 Assembly of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.7.1 Monotonicity of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.8 Assembly of Fully-Implicit Temporal Weighting with Upstream Spatial Weighting", "Section 2.8.1 Monotonicity of Upstream Spatial Weighting with Fully-Implicit Temporal Weighting", "Section 2.9 Boundary Conditions for Transport Coupled to Flow", "Analyze the accuracy of various contaminant transport weighting schemes and their impact on numerical model performance.", "Apply boundary conditions for contaminant transport coupled with groundwater flow and assess material balance errors to ensure reliable numerical simulations.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "The total maximum bonus points that can be earned across all five assignments is five.", "Students can earn bonus points by actively participating in discussions or helping their peers understand the course material and assignments.", "Explaining a challenging concept to peers in a collaborative study session.", "A maximum of five contributions will be allowed per assignment."]}, {"course_id": 81, "course_code": "ENVE 577", "course_name": "ENVE577 - Engineering for Solid Waste Management (0.50)", "term_name": "Technical Electives List", "program_name": "Geological Engineering", "program_id": 72, "major_id": 1, "major_name": "Geological Engineering (Bachelor of Applied Science - Honours)", "topics": ["Attention is given to the engineering design and operational aspects of the control of generation, storage, collection, transfer and transport, processing and disposal of solid wastes in landfill site.", "Design of natural attenuation sites and system reliability features for landfill designs.", "Topics include waste characterization, collection systems, transportation, treatment technologies, landfill design, recycling, waste-to-energy systems, greenhouse gas impacts, and policy frameworks.", "Understand the composition and generation rates of solid waste", "Analyze waste collection, segregation, and treatment methods", "Design components of solid waste management systems (e.g., landfills, composting systems)", "Explore innovative technologies for resource recovery, recycling, and waste-to-energy processes", "Module 1: Introduction to Solid Waste Management", "Definition and types of solid waste", "Examples of waste management systems from different regions", "Calculate the waste generation rate (WGR) per capita for a given dataset and project future WGR trends using population growth models", "Jan 9 Waste Generation and Characteristics", "Physical, chemical, and biological characteristics", "Typical components and composition of waste", "Hazardous wastes and recycling streams", "Introduction to waste composition audits", "Calculate the environmental impact using simplified LCA metrics for waste scenarios", "Jan 16 Lifecycle Analysis and Waste Hierarchy", "Jan 21   Waste Collection Systems", "Door-to-door collection", "Community bins and transfer stations", "Equipment used in collection", "Estimate transportation costs for different modes of waste transfer (e.g., by truck, rail) based on distance, fuel costs, and waste tonnage", "Operations and routing strategies", "Design and function of transfer stations", "Jan 28   Temporary Storage Solutions", "Design of storage bins and containers", "Safety considerations", "Calculate the capacity needs of storage containers", "based on waste generation rates and collection frequency", "Role of public awareness", "Estimate biogas yield from anaerobic digestion of organic waste using stoichiometric calculations", "Process design and optimization", "Applications and challenges", "Incineration: principles and applications", "Pyrolysis and gasification", "Calculate energy recovery from the incineration of municipal solid waste using calorific values", "Design of Material Recovery Facilities (MRFs)", "Challenges in recycling", "Technical, environmental, and economic considerations", "Assess the efficiency of a WTE plant using energy balance equations", "Definitions and frameworks", "Composting and anaerobic digestion as mitigation techniques", "Site selection and design", "Leachate and gas management", "Design a landfill’s leachate collection system based on given permeability and rainfall data", "Operational strategies", "Post-closure monitoring and land reuse", "Environmental and health impacts", "Strategies for remediation", "*TBD", "Mar 13 Analysis and Design of Solid Waste Management Infrastructure", "Design and operation of materials recovery facilities", "Overview of thermal methods and biological processes", "Mar18                          Digital and Smart Solutions for SWM", "Data analytics for waste tracking", "*TBD", "Tools and methodologies", "Challenges and solutions", "Innovations in SWM policies", "** Note:", "Design Project 25%", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, such as practical analysis and critical thinking.", "Library for research-based assignments"]}, {"course_id": 0, "course_code": "ENVS 200", "course_name": "ENVS200 - Field Ecology (0.50)", "term_name": "Required Courses", "program_name": "Geomatics", "program_id": 73, "major_id": 3, "major_name": "Earth Systems Science Specialization", "topics": ["Field Ecology Winter 2025", "**We aim to respond to forum posts and necessary emails within general workday hours (8:30 AM – 4:30 PM) and within 24hrs, except over weekends and holidays.", "Introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "View requirements for ENVS 200", "Such knowledge, called ecoliteracy, will provide a critical basis for your engagement in the 21st century, the “century of the environment”—not least because so many of the environmental issues we face derive in part from a limited understanding of how we are embedded within and dependent upon ecological systems.", "Field ecology necessarily harbours an ethical component both because of our natural affinity for life (or ‘biophilia’) and because questions of ecological ‘impact’ and 'quality’ are necessarily value-laden.", "In summary, this course introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "By the end of this course, you should be on a path to life-long learning as an ecologically-literate citizen.", "Demonstrate how these principles apply to real-world situations (in context of lab activities, assignments, and labs), including human interactions with the natural world.", "Articulate the elements of scientific inquiry as they apply to ecology/", "These course learning outcomes will not only prepare you to be an informed citizen and member of the community of life on earth, but also provide the basis for knowledge, humility, and wisdom in your dealings with ecological problems in your daily life and eventual career.", "Week Number", "Introduction and indicator species: Bird identification Lab 1:  Survey completed and submitted in lab (2%)", "3. Jan 21 *Conditions and Resources; Climate and Biomes", "You should review the course “reading guide” in LEARN before reading because you are not responsible for all textbook sections and vocabulary.", "demonstrate how these principles apply to real-world situations, including human interactions with the natural world Readings, Labs, Discussion board Weekly lecture quizzes and activities, exams, lab activities, discussion forums", "These experiences are intended to help you apply ecological concepts in real-world contexts while building valuable field skills.", "Simply missing a deadline and later mentioning registration with Accessibility Services will not be considered sufficient.", "Appeals and grievance", "Availability for exams", "These slides are meant to be a template for your note-taking: they will not replace careful attention, note-taking and participation.", "Along with the University of Waterloo and the Faculty of Environment and its Departments, I consider your well-being to be extremely important.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "However, there may be instances during lectures where AI usage is allowed after receiving clear verbal permission from the professor.", "Students are responsible for following these guidelines and seeking clarification when needed.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 2, "course_code": "GEOG 209", "course_name": "GEOG209 - Hydroclimatology (0.50)", "term_name": "Required Courses", "program_name": "Geomatics", "program_id": 73, "major_id": 3, "major_name": "Earth Systems Science Specialization", "topics": ["08:30AM - 10:20AM EV2 2002", "Dr. Richard Petrone                                                                                       Winter 2025", "Lab Co-ordinator:", "TBA", "An introduction to the fundamental processes governing climate and hydrological systems and the links between them.", "It starts with a discussion of basic atmospheric and hydrological processes and traces the flow of energy and water between the earth's surface and the atmosphere.", "This course provides students with a thorough background of the fundamental processes governing the climate and hydrological systems, and the links between them.", "The course first reviews fundamental atmospheric and hydrologic processes, and traces the flow of energy and water between the Earth’s surface and the atmosphere.", "Through the use of group activities students will be given the opportunity to gain experience manipulating real hydrological and meteorological data and instrumentation.", "This course will serve as an introduction to near-surface hydroclimatic processes, their feedbacks and climate change, forming essential background for upper level courses in climate change, hydroclimatology and environmental sciences and studies in general.", "The fundamental knowledge and skills developed in this course will provide students with the basis to appreciate and understand the natural hydrologic and climate systems.", "It also provides the required foundation for advanced courses in climatology and hydrology.", "The objective of this course is to provide students with the background to further their interests in weather and climate, and provide the theoretical foundations for upper level science and management courses.", "To identify the key boundary layer processes that drive the hydroclimate system.", "To identify and evaluate the characteristics of different land-use types and ecosystems that drive their hydroclimatic regimes.", "Introduction to Hydroclimatology", "Evapotranspiration", "Climates of Natural Surfaces and Vegetation Effects", "Floods and Drought", "Ecology – Hydroclimate Linkages – Water and Carbon Exchange", "Landuse Change and Hydroclimatic Effects", "SVAT modelling", "Tutorial rooms and groups will be determined in the first week of lectures.", "Feb. 3              Lab #2 – Streamflow & Climate assignment introduced & Lab #1 handed in", "March 10         Lab #3 – Energy Balance & Evapotranspiration assignment introduced and Lab #2 handed in", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 6, "course_code": "GEOG 368", "course_name": "GEOG368 - Ecology and Conservation for Planning (0.50)", "term_name": "Required Courses", "program_name": "Geomatics", "program_id": 73, "major_id": 3, "major_name": "Earth Systems Science Specialization", "topics": ["Ecology and Conservation for Planning Winter 2025", "02:30PM - 05:20PM", "This course provides students with a critical understanding of the relationship between human development and natural environments.", "Students will develop an understanding of core ecological principles and how these can be taken up in plans and policies to promote nature conservation in urban and rural environments.", "The course will include examples of how planners mitigate the environmental impacts of development of land, allotment of open space and parks, and conservation of sensitive areas and species in both urban and rural contexts.", "understand biophysical and ecological processes in urban areas", "plan for biophysical and ecological process when developing and managing the built environment", "Overview of syllabus and foundational concepts", "Get into groups and choose case study for weekly activities and final project", "Spatial patterns and mosaics", "Urban water systems and water bodies", "Urban habitat and vegetation", "Urban features", "Readings", "The ecological and evolutionary consequences of systemic racism in urban environments.", "ECOLOGICAL URBANISM: A FRAMEWORK FOR THE DESIGN OF RESILIENT CITIES Yes 0", "Each quiz corresponds to the theme for each week.", "The first will critically engage with a recent and important contribution from Schell et al.", "Each Reflection Paper should be approximately 500 to 1,000 words and should answer the following questions:", "The case study should describe each of the focal ecological components of the city and develop a plan to improve or enhance the sustainability of these components.", "These will vary week to week, but are designed to prepare students to complete their case study assignment.", "The complete style outline can be found in the Publication Manual of the American Psychological Association, located in the reference section in Dana Porter Library, or on sale in the Book Store.", "APA Frequently Asked Questions - http://www.apastyle.org/learn/faqs/", "University of Wisconsin-Madison Writing Centre: http://www.writing.wisc.edu", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 8, "course_code": "PLAN 341", "course_name": "PLAN341 - Ecology and Conservation for Planning (0.50)", "term_name": "Required Courses", "program_name": "Geomatics", "program_id": 73, "major_id": 3, "major_name": "Earth Systems Science Specialization", "topics": ["Ecology and Conservation for Planning Winter 2025", "02:30PM - 05:20PM", "This course provides students with a critical understanding of the relationship between human development and natural environments.", "Students will develop an understanding of core ecological principles and how these can be taken up in plans and policies to promote nature conservation in urban and rural environments.", "The course will include examples of how planners mitigate the environmental impacts of development of land, allotment of open space and parks, and conservation of sensitive areas and species in both urban and rural contexts.", "understand biophysical and ecological processes in urban areas", "plan for biophysical and ecological process when developing and managing the built environment", "Overview of syllabus and foundational concepts", "Get into groups and choose case study for weekly activities and final project", "Spatial patterns and mosaics", "Urban water systems and water bodies", "Urban habitat and vegetation", "Urban features", "Readings", "The ecological and evolutionary consequences of systemic racism in urban environments.", "ECOLOGICAL URBANISM: A FRAMEWORK FOR THE DESIGN OF RESILIENT CITIES Yes 0", "Each quiz corresponds to the theme for each week.", "The first will critically engage with a recent and important contribution from Schell et al.", "Each Reflection Paper should be approximately 500 to 1,000 words and should answer the following questions:", "The case study should describe each of the focal ecological components of the city and develop a plan to improve or enhance the sustainability of these components.", "These will vary week to week, but are designed to prepare students to complete their case study assignment.", "The complete style outline can be found in the Publication Manual of the American Psychological Association, located in the reference section in Dana Porter Library, or on sale in the Book Store.", "APA Frequently Asked Questions - http://www.apastyle.org/learn/faqs/", "University of Wisconsin-Madison Writing Centre: http://www.writing.wisc.edu", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 10, "course_code": "PLAN 353", "course_name": "PLAN353 - Spatial Analysis (0.50)", "term_name": "Required Courses", "program_name": "Geomatics", "program_id": 73, "major_id": 3, "major_name": "Earth Systems Science Specialization", "topics": ["Notice of Recording", "Spatial Analysis Winter 2025", "Email:                     dtrobins@uwaterloo.ca", "Email:                      lqzhao@uwaterloo.ca", "Advanced quantitative analysis in a spatial context.", "Today, spatial analysis is mainly based on statistical techniques and geoprocessing using geographic information systems (GIS).", "The spatial character of data implies several methodological challenges in spatial data analysis especially related to the spatial dependence of the data, which often invalidates non-spatial modeling and evaluation approaches and leads to special techniques for spatial sampling and spatial regression modeling.", "In addition, selected topics such as spatial data mining and spatial analysis software may be addressed, depending upon the progress of the course.", "Several real-world applications of spatial analysis techniques will be discussed and provide context for course assignments.", "develop a general understanding of a variety of spatial modelling techniques", "interpret and critically discuss spatial models and their results", "The lecture will be used to introduce the theory and concepts behind spatial analysis methods as well as to demonstrate techniques that will aid the completion of lab assignments.", "1  Jan 8 Introduction to Spatial Analysis 1, 2", "Feb 12 Describing and Analyzing Fields 9", "7  Feb 26 Describing and Analyzing Fields  9, 10", "10  Mar 19 Landscape Metrics and Applications of Spatial Analysis", "Spatial Data Analysis: an Introduction for GIS Users.", "Principles of Geographical Information Systems.", "Assignments commence in the second week of the course but the first week will require students to setup a workflow for using Jupyter Notebooks on the Math Faculty Jupyter Hub, which can be found here: https://jupyter.math.uwaterloo.ca/hub/login", "There are no serious programming requirements or extensive prior knowledge of geographic information systems to complete the assignments in this course.", "The notebooks will guide you through the technical steps and students will adjust notebook content/code to improve their understanding about the statistical and spatial analysis concepts discussed in the course.", "Notice of Recording", "Community of Learners", "A goal for this course is that we shall all contribute to a climate that promotes a Community of Learners.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "This course includes the independent development and practice of specific skills, such as analyzing spatial data, summarizing data for reporting results, or putting together statistical models.", "Library for research-based assignments", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 16, "course_code": "GEOG 305", "course_name": "GEOG305 - Fluvial Geomorphology (0.50)", "term_name": "Required Courses", "program_name": "Geomatics", "program_id": 73, "major_id": 3, "major_name": "Earth Systems Science Specialization", "topics": ["RCH 211", "Emphasis on concepts related to fluvial processes, river mechanics, the relationship between environmental change and river regime.", "Fluvial geomorphology is the scientific study of river landforms and the processes that create them.", "A working knowledge of fluvial processes has important practical environmental science, watershed management and engineering applications and is relevant to many other fields of environmental enquiry such as environmental engineering, watershed planning, source water protection, forestry, and risk management.", "This course will examine a range of physical and chemical processes that create micro and macro-scale landforms over a range of spatial and temporal scales.", "Implications of these processes for environmental management in the context of environmental change will be considered.", "To understand basic fluvial geomorphic processes and their role in landform development and change", "Why study rivers?", "Sept 16              Landscapes and Rivers", "Inputs, outputs and storage", "Types of systems", "Fluvial system variables", "Spatial and temporal scales", "Concept of equilibrium", "Feedback, thresholds and equilibrium – Southern Rockies case study", "Flow generation and hydrological pathways", "Storm hydrograph and drainage basin response", "Discharge Measurement and Streamflow Analysis", "Floods", "Bankfull discharge", "Flood magnitude and frequency", "Regional flood frequency curves", "Rills and gullying", "Soil erosion models", "Modes of sediment transport in rivers", "Sediment storage and delivery ratio", "Flow in river channels", "Driving and resisting forces", "Channel parameters", "Concept of flow continuity", "Flow, channel and boundary resistance", "Subcritical, critical and supercritical flow", "Boundary layer", "Concept of stream power", "Work, energy and stream power", "Erosion in bedrock channels", "Erosion in alluvial channels", "Sediment supply and transport rates", "Driving variables", "Boundary conditions", "Nature of change", "System response", "https://uwaterloo.kanopy.com/video/return-river-0", "Dec 2                  Impact of climate change on river systems", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 17, "course_code": "GEOG 309", "course_name": "GEOG309 - Physical Climatology (0.50)", "term_name": "Required Courses", "program_name": "Geomatics", "program_id": 73, "major_id": 3, "major_name": "Earth Systems Science Specialization", "topics": ["Office Hours and email communications: TBA (each TA will be responsible for particular assignment)", "Topics include radiation and energy balances, general circulation patterns, synoptic development and micro-climatology.", "Climate change and climate variability", "Fundamentals of global warming", "The concepts of feedbacks", "Climate change and human dimensions", "How to explain the issues of climate change and variability ideas to others with confidence and persuasion", "Climate Change and Variability", "Human Dimension", "Weather Systems and Synoptic Development (Part 1) 273-295 299-325 262-285 287-313 Ch. 9,10", "Weather Systems and Synoptic Development (Part 2)", "Any earlier edition is good but the page numbers in the outline will not be correct for other editions than the fifth and seventh.", "Understand physical processes of climate and weather Lectures and Text readings", "Analysis of Weather events during the course", "Analysis of Sequence of Weather Maps", "(Working as groups of 6-8 and explain the sequence and processes of weather in Southern Ontario)", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "This course includes the independent development and practice of specific skills, such as Assess public debate on Climate Change and Variability.", "Library for research-based assignments", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 18, "course_code": "GEOG 320", "course_name": "GEOG320 - The Cryosphere (0.50)", "term_name": "Required Courses", "program_name": "Geomatics", "program_id": 73, "major_id": 3, "major_name": "Earth Systems Science Specialization", "topics": ["04:30PM - 05:20PM", "EV2 1002A", "This course provides a comprehensive overview of the cryosphere and cryosphere-atmosphere interactions.", "Topics covered include the material and thermodynamic properties of snow and ice, the role of the cryosphere in weather and climate, and the response of the cryosphere to climate change (past, present, and future).", "Describe the fundamental material properties of snow and ice, including crystal structures, phase transitions, and thermodynamic behavior, and relate these properties to cryospheric processes.", "Explain the role of the various elements of the cryosphere in weather and climate.", "Explain the response of the various elements of the cryosphere to changing weather and climate.", "Explain the impacts of climate change on the cryosphere, both in terms of observed trends and projected future changes, considering the implications for sea level rise, freshwater resources, and polar ecosystems.", "Identify historical and state-of-the-art datasets, including field observations and remote sensing data, needed to document the current state of the cryosphere.", "Identify field instruments for measuring cryospheric parameters, such as snow depth, ice thickness, and permafrost temperature.", "Conduct basic simulations with cryosphere process models, such as snow and lake ice models.", "Synthesize complex cryospheric data and model outputs to assess the broader implications for climate science, global carbon cycling, and human societies.", "Communicate research findings and insights related to the cryosphere effectively through written reports and oral presentations.", "Introduction to the Cryosphere", "Material Properties of Snow and Ice", "Analysis and interpretation of field-based measurements", "Snow and Ice Thermodynamics", "Analysis and interpretation of field-based measurements", "Glaciers and Ice Sheets", "Deadlines for each deliverable can be found in the course schedule above.", "The term paper involves the completion of an extensive survey of the scientific literature on a relevant topic (e.g. remote sensing, numerical modeling or in-situ studies of any element of the cryosphere; cryosphere-climate interactions on a variety of space and time scales; the representation of elements of the cryosphere in climate or weather prediction models; the impact of changes in any element or a group of elements of the cryosphere on Society).", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 0, "course_code": "BIOL 130", "course_name": "BIOL130 - Introductory Cell Biology (0.50)", "term_name": "Required Courses", "program_name": "Health Sciences", "program_id": 78, "major_id": 2, "major_name": "Health Sciences (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "An introduction to the concepts of cell biology with emphasis on (1) the structural organization of the cell and (2) the function of critical molecular processes that are characteristic of living organisms.", "Explain the fundamental elements of cells, the chemistry of life, and the major classes of biological macromolecules.", "Describe metabolism, the role of enzymes in chemical reactions, and how cells can capture, and utilize, energy.", "Explain how cells respond to signals and form cellular communities.", "Module 1 - Introduction to Cell Biology & The Cell Theory", "Module 2 - Molecules of Life", "2 Module 3 - Cells and Membranes  In-class case study", "3 Module 4 - Nucleic Acids & Information Flow", "4 Module 5 - Protein Structure, Function & Synthesis  In-class case study", "6 Module 7 - Cellular Respiration In-class case study", "In-class case study", "9 Module 9 - Cell Signalling", "10 Module 10 - Cell & Tissue Form", "and In-class case study", "11 Module 11 - DNA Replication & Cell Division Case study due", "12 Module 11 - DNA Replication & Cell Division  Term Test 1", "Official Grades and Course Access", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each module for the achieve assignments and term tests.", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines", "Library for research-based assignments"]}, {"course_id": 1, "course_code": "BIOL 130L", "course_name": "BIOL130L - Cell Biology Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Health Sciences", "program_id": 78, "major_id": 2, "major_name": "Health Sciences (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "STC 4018", "02:30PM - 05:20PM", "STC 4018", "However, we do run multiple labs at the same time which means we may not always be in the office.", "Situation", "Please email Dr. Gurska directly at jola.gurska@uwaterloo.ca", "What does it mean to be a cell biologist?", "One group of scientists might explore growing tissues in a laboratory to one day produce artificial skin or organs.", "No matter what their question, cell biologists use a similar set of laboratory skills that allow them to peek inside the tiniest of biological units that make up the diversity of organisms we see around us.", "Although fundamental techniques like microscopy have hugely advanced since the invention of the light microscope, every cell biologist needs to learn how to properly use a microscope to see cells reliably.", "These can be very tricky to use properly but doing so could be the difference between a world-changing discovery and an experiment that no one can replicate.", "These and other methods that are integral to working in the cell biology field will be introduced in this laboratory and it is my hope that you will leave confident in these fundamental techniques.", "Maintain a well-organized and comprehensive lab book.", "Identify elements of a well-structured laboratory report and write some elements of a lab report.", "Assignment 3 Model Organisms and Experimental Design 3%", "I welcome any inquiries regarding AccessAbility accommodations.", "Some examples of what will be noted includes the following:", "did you complete the bioskills exercises during the first lab?", "did you behave in a respectful and professional manner in the lab?", "Using a micropipette without a tip,", "Holding a micropipette upside down with liquid in the micropipette tip,", "Setting a micropipette precariously close to the edge of the bench so that it may fall on the floor,", "Forcing the pipettes past their minimum and maximum calibrated ranges", "Keeping a thorough lab book is a critical skill learned in a biology laboratory to document key observations and procedures.", "Some reagents will already be set up to use at your bench, while others will be in dispensing bottles on the side bench or in the fume hoods, in which case the liquid must be dispensed directly from the bottles.", "These can be purchased at the W Store Essentials in the STC.", "Since many standard laboratory reagents are volatile, please consider not wearing contact lenses in the laboratory.", "When not in use, stools should be tucked away under-bench and personal items stowed underneath in cupboards.", "Finally, please remember that safety should be a collective concern.", "They will be reviewed at the end of the term for statistical purposes only.", "The goal of the draft submissions is to teach you the capabilities of Turn-it-in analysis and to encourage you to use the software to improve your paraphrasing and referencing.", "Details on how to interpret Turn-it-in reports and use the draft Dropboxes can be found under Content on LEARN.", "As outlined under Quizzes section above, please note that the BIOL 130L online multiple-choice quizzes are designed to be completed in half the time you are given.", "Expectation of Academic Integrity", "This course includes the independent development and practice of specific skills, such as scientific writing and communication.", "Poorly paraphrased information without in-text citation 5 marks off for each", "Poorly paraphrased information with in-text citation 3 marks off for each", "Well paraphrased information without in-text citation 3 marks off for each", "Lab Manual is cited in Results and/or Discussion 1 mark off for each citation", "A reference in the reference list does not have corresponding in-text citations 5 marks off for each", "An in-text citation is not in the reference list 5 marks off for each", "Misconduct; student’s name will be sent to the Associate Dean to check if this is the first misconduct"]}, {"course_id": 2, "course_code": "BIOL 239", "course_name": "BIOL239 - Genetics (0.50)", "term_name": "Required Courses", "program_name": "Health Sciences", "program_id": 78, "major_id": 2, "major_name": "Health Sciences (Bachelor of Science - Honours)", "topics": ["11:30AM - 12:20PM", "10:30AM - 11:20AM STC 1012", "You can!", "Chromosomal mechanisms in mitosis and meiosis.", "Natural selection and the evolution of genetic systems.", "Describe the fundamentals of gene structure, function and transmission in prokaryotic and eukaryotic cells and organisms.", "Describe the various ways mutations can arise and how mutations may affect gene expression and phenotypic outcomes.", "Describe recombinant DNA technology in bacteria and its role in biotechnology.", "Effectively work with others, discussing, evaluating, and communicating genetics concepts and synthesizing ideas in a group.", "Readings", "textbook 1.1-1.2", "Mendelian genetics and probability", "Modification of Mendelian ratios", "textbook 3.2-3.3, 4.2-4.4, 15.1", "Mitosis, meiosis, and chromosome numbers", "DNA and the genetic code", "textbook 9.2-9.3", "T4: Mitosis and meiosis", "DNA cloning", "T5: Testing genetic ratios", "Cancer genetics", "T9: Population genetics", "Exam period", "- write the final exam and achieve a grade of at least 50% on the cumulative test and exam section", "Online learning activities: These activities are designed to test your knowledge of several important concepts explained by the lecture presentations in this course, and should be completed after the portion of the course when they are covered in lecture.", "They are all due toward the end of the term but can be completed as many times as you like to help you work on these concepts.", "Read the instructions carefully before attempting these as a completion quiz (in the quiz section) must also be completed to obtain credit.", "In this case, the weight of the missed submission will be transferred to the final exam.", "The dates affected and degree of incapacitation will be used to determine follow-up action."]}, {"course_id": 3, "course_code": "BIOL 273", "course_name": "BIOL273 - Principles of Human Physiology 1 (0.50)", "term_name": "Required Courses", "program_name": "Health Sciences", "program_id": 78, "major_id": 2, "major_name": "Health Sciences (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM M3 1006", "M. Bording-Jorgensen", "Dr. Vivian Dayeh - Tuesdays 11:30 am -12:30pm in B1-277.", "The physiology of major organ systems of the human body.", "Topics include neurophysiology and peripheral nervous system, muscle, the cardiovascular system, the components of blood, respiratory system, and immune system.", "The combination of BIOL273 and BIOL373 covers all of the major topics of human physiology.", "Identify the components/structures of the following organ systems: nervous, muscular, cardiovascular, respiratory, and immune.", "Describe how these five organ systems are organized in the human body.", "Explain the function of each of these five organ systems.", "Demonstrate the integration of these five organ systems in maintaining homeostasis.", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Official Grades and Course Access", "Corresponding Silverthorn textbook chapters in parentheses for each unit.", "This unit serves as an introduction to the study of the function of the five organ systems examined in this course (nervous, muscular, cardiovascular, respiratory, and immune).", "Unit 1 will introduce how the organ systems work together to maintain homeostasis within the body.", "The organization of the nervous system will be explored in this unit.", "The types of cells found in the central and peripheral nervous system serve as a starting point to discuss their function within the nervous system.", "Initially gross structure of skeletal muscle including the structure of a muscle fibre and myofibrils will be examined.", "An exploration into the muscle contraction mechanism via excitation-contraction coupling will be examined to explain how muscles work.", "This unit will start with an introduction into the heart and components of the cardiovascular system, which will be followed by cardiac muscle contraction mechanism.", "In this unit we will examine the structure and function of the respiratory system, incorporating gas laws and ventilation.", "Pulmonary function through lung compliance and elastance as well as the control of ventilation will be examined.", "This unit will start with the general function of immune system and introduction to the types of pathogens that infect the body.", "The anatomy of the immune system will be discussed returning to the role of haematopoiesis.", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each unit for the assignments and term tests.", "Required for the Mastering A&P Online Assignments and Dynamic Study Modules.", "Course website Waterloo Learn https://learn.uwaterloo.ca - includes general course information, language of physiology online assignment, review sheets for each unit, and links to the Mastering A&P Online Assignments.", "Emails can be received 24 hours per day.", "Students should carefully consider the wisdom of missing a test or assignment.", "Mastering A&P assignments handed in late will receive a deduction of 5%/day for the first five late days after which a grade of zero (0) will be recorded.", "Notice of Recording", "Don’t waste your time with these requests!", "Expectations for Change", "This course includes the independent development and practice of specific skills, such as multiple choice question creation.", "Library for research-based assignments", "Disability-related Policies"]}]