[{"course_id": 47, "course_code": "BIOL 273", "course_name": "BIOL273 - Principles of Human Physiology 1 (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM M3 1006", "M. Bording-Jorgensen", "Dr. Vivian Dayeh - Tuesdays 11:30 am -12:30pm in B1-277.", "The physiology of major organ systems of the human body.", "Topics include neurophysiology and peripheral nervous system, muscle, the cardiovascular system, the components of blood, respiratory system, and immune system.", "The combination of BIOL273 and BIOL373 covers all of the major topics of human physiology.", "Identify the components/structures of the following organ systems: nervous, muscular, cardiovascular, respiratory, and immune.", "Describe how these five organ systems are organized in the human body.", "Explain the function of each of these five organ systems.", "Demonstrate the integration of these five organ systems in maintaining homeostasis.", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Official Grades and Course Access", "Corresponding Silverthorn textbook chapters in parentheses for each unit.", "This unit serves as an introduction to the study of the function of the five organ systems examined in this course (nervous, muscular, cardiovascular, respiratory, and immune).", "Unit 1 will introduce how the organ systems work together to maintain homeostasis within the body.", "The organization of the nervous system will be explored in this unit.", "The types of cells found in the central and peripheral nervous system serve as a starting point to discuss their function within the nervous system.", "Initially gross structure of skeletal muscle including the structure of a muscle fibre and myofibrils will be examined.", "An exploration into the muscle contraction mechanism via excitation-contraction coupling will be examined to explain how muscles work.", "This unit will start with an introduction into the heart and components of the cardiovascular system, which will be followed by cardiac muscle contraction mechanism.", "In this unit we will examine the structure and function of the respiratory system, incorporating gas laws and ventilation.", "Pulmonary function through lung compliance and elastance as well as the control of ventilation will be examined.", "This unit will start with the general function of immune system and introduction to the types of pathogens that infect the body.", "The anatomy of the immune system will be discussed returning to the role of haematopoiesis.", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each unit for the assignments and term tests.", "Required for the Mastering A&P Online Assignments and Dynamic Study Modules.", "Course website Waterloo Learn https://learn.uwaterloo.ca - includes general course information, language of physiology online assignment, review sheets for each unit, and links to the Mastering A&P Online Assignments.", "Emails can be received 24 hours per day.", "Students should carefully consider the wisdom of missing a test or assignment.", "Mastering A&P assignments handed in late will receive a deduction of 5%/day for the first five late days after which a grade of zero (0) will be recorded.", "Notice of Recording", "Don’t waste your time with these requests!", "Expectations for Change", "This course includes the independent development and practice of specific skills, such as multiple choice question creation.", "Library for research-based assignments", "Disability-related Policies"]}, {"course_id": 48, "course_code": "CHEM 120", "course_name": "CHEM120 - General Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["General Chemistry 1 Winter 2025", "RCH 101", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "The second part of this course is concerned with explaining periodicity and trends in chemical reactivity in terms of the electronic structure of atoms and molecules.", "Topics covered in this part of the course include the quantum theory of the hydrogen atom; electron configurations in multi-electron atoms; ionic and covalent bonding; Lewis structures, valence shell electron repulsion theory and molecular geometry; quantum mechanical bonding theories, including valence bond theory and molecular orbital theory.", "Additional topics may include an introduction to electron-transfer reactions, including the assignment of oxidation states and the balancing of oxidation-reduction reactions.", "assess the greenness of a chemical reaction using Atom Economy and E-Factor metrics.", "describe the electronic structure of atoms in terms of quantum theory using atomic orbitals and quantum numbers.", "justify the organization of the periodic table and predict trends in the properties of the elements.", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and explain molecular shape and stability in terms of electron count.", "describe the interactions of molecules in solids, liquids, and gases to compare physical and reactive properties.", "Course Structure and Continuity Plans", "No extensions will be granted for Participation Challenges, but each student can drop one participation challenge from their overall grade.", "Printed spiral bound copies of the course notes can be purchased online from the UW bookstore https://wstore.uwaterloo.ca/", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare pandemic-related illnesses on Quest (Information at this link)", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 49, "course_code": "CHEM 120L", "course_name": "CHEM120L - General Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 1 Fall 2024", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Be sure to record their name and contact information in your lab manual.", "Skillfully perform basic procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "1,3,5,7,9,11", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Sept 19 - 24", "1,3,5,7,9,11", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "1,3,5,7,9,11", "- studying cis and trans isomers", "Oct 24-29", "1,3,5,7,9,11", "Titration as an Analysis Tool", "- identify an unknown solid acid", "1,3,5,7,9,11", "Introduction to Chromatography", "- quantify a cation using ion exchange", "1,3,5,7,9,11", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 51, "course_code": "CHEM 123L", "course_name": "CHEM123L - General Chemistry Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 2 Winter 2025", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- a real life analysis", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 54, "course_code": "EARTH 122", "course_name": "EARTH122 - Introductory Environmental Sciences (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Introductory Environmental Sciences Winter 2025", "08:30AM - 09:50AM STC 1012", "I hold a PhD in Earth & Environmental Sciences from the University of Waterloo (2014) and an HBSc in Earth & Environmental Sciences from McMaster University (2006).", "You might notice I'm looking pretty pregnant!", "I'm conveniently due on April 27 BUT in the unlikely even that I have a baby really early, the excellent Dr. Keith Delaney (who has taught this class for many years) will step in at the end.", "Discussions", "Questions of a personal nature", "Office: EIT 2051D (very back of Earth & Environmental Sciences main office)", "Email: msrosamo@uwaterloo.ca", "Grad TA contact info can be found in the EARTH 122L syllabus.", "Course topics include sustainable development and the availability and use of natural resources, principles of ecology and environmental science, biogeochemical cycles, climate and climate change, soils and food supply, energy systems, surface water and groundwater, waste generation and management, pollution, and catastrophic natural processes.", "Describe common global environmental issues and the role of environmental science in identifying, understanding, and solving these issues.", "Interpret and manipulate simple box models of environmental systems", "Interpret scientific diagrams and graphs pertaining to environmental science", "1 January 06 - 10 Intro to Environmental Science & Matter, Energy and Physical Environment Chps 1 & 2", "2 January 13 - 17 Earth Systems/Ecosystems & Evolution, Biodiversity, Population Ecology Chps 3 & 4", "3 January 20 - 24 Species Interactions/Community Ecology & Human Population Chps 5 & 6", "Soils & Soil Resources*", "8 February 24 - 28 Freshwater Systems/Water Resources & Marine, Coastal Systems, Fisheries Chps 11 & 12 Quiz 6 - Chapters 11 & 12 Content Mon. Mar 3  5:00PM 3", "10 March 10 - 14 Global Climate Change & Fossil Fuels: Energy Use/Impacts Chps 14 & 15", "Energy Alternatives & Mineral Resources & Mining", "Quiz 8 - Chapters 15 & 16 & 17 Content*", "12 March 24 - 28 Managing our Waste & Environmental Health Hazards Chps 18 & 19 Quiz 9 - Chapters 18 & 19 Content Mon. Mar 31 5:00PM 3", "A Look at Environmental Science and Natural Hazards & Final Exam Study Guide / Discussion", "following these guidelines: https://uwaterloo.ca/science-undergraduate-office/academic-policies-and-procedures/accommodation-illness-or-other-extenuating-circumstances."]}, {"course_id": 55, "course_code": "EARTH 122L", "course_name": "EARTH122L - Introductory Environmental Sciences Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 1, "major_name": "Physics (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introductory Environmental Sciences Laboratory Winter 2025", "EARTH 122L", "02:30PM - 05:20PM", "EIT 1013", "08:30AM - 11:20AM EIT 1013", "02:30PM - 05:20PM", "EIT 1013", "Sana Ahmad has a BSc degree in Honours Co-op Environmental Science with a Geoscience Specialization from the University of Waterloo.", "Discussions", "Questions of a personal nature", "Office: EIT 2046 (within the Earth & Environmental Sciences main office)", "Email: s76ahmad@uwaterloo.ca", "Please put EARTH 122L in your email subject line so I don't miss it!", "Please do not send them personal emails!", "View requirements for EARTH 122L", "Use GPS devices and GIS software to locate points of interest and create a map", "ALL LABS ARE HELD IN ROOM: EIT 1013 (ground floor of EIT  - same building as Earth Sciences Museum)", "8 February 24 - 28 Coastal Processes and Problems: Loving Our Coasts to Death?", "10 March 10 - 14 On-Campus Water Sampling and GPS Data Collection Field Sampling and Data Collection Lab around UW Campus", "13 March 31 - April 03 Landscape Geology: Glaciers and Deserts & Climate Change: Pleistocene Records, Milankovitch Cycles Lab 8: Landscape Geology and Climate Change End of Lab 7%", "Note used copies are also fine!", "The format of the final exam will be run digitally through the LEARN Quiz system in the last week of the course, not during the formal exam period.", "Notice of Recording", "Please note emails can be received 24 hours per day", "Email a copy of the documentation to the course instructor within one week.", "These can be completed digitally now!", "This official verification is necessary before any action can be taken and can be downloaded from the Health Services website.", "Situation where VIFs are not Appropriate", "Example citations:", "\"References"]}, {"course_id": 0, "course_code": "CS 114", "course_name": "CS114 - Principles of Computing for Science (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 2, "major_name": "Physics (Joint Honours)", "topics": ["Principles of Computing for Science Winter 2025", "08:30AM - 09:50AM MC 4059", "Monday -", "Monday", "07:00PM - 08:50PM", "10:30AM - 11:20AM MC 4063", "Coordinator", "Student who make use of office hours usually get better grades; use them!", "Introduction to basic imperative programming principles; programming concepts including functions, flow control, lists, arrays; numerical accuracy and efficiency; data analysis and general-purpose algorithms.", "Introduction to object-oriented programming concepts.", "Describe the basic memory model for mutation of basic types, lists, and objects in Python.", "Identify situations where recursion is an appropriate tool, and use it.", "6 Feb 6-11 M4: Strings and Lists", "7 Feb 13-25 M5: Sorting and Dictionaries", "If both exams are held in person", "If in-person exams cannot be held then they will be held online (if possible).", "Students have the option of self-declaring a short-term absence, as described here: https://uwaterloo.ca/registrar/current-students/undergraduate-student-short-term-absences", "Students should check their basic tests email to ensure that the code meets the specification exactly.", "If ill, please complete a complete a Verification of Illness Form and contact the course coordinator to discuss alternate arrangements.", "Generative AI: This course includes the independent development and practice of specific skills, such as writing and reading code, tracing, and algorithm design.", "Library for research-based assignments"]}, {"course_id": 2, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 2, "major_name": "Physics (Joint Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 3, "course_code": "MATH 227", "course_name": "MATH227 - Calculus 3 for Honours Physics (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 2, "major_name": "Physics (Joint Honours)", "topics": ["Email: pmcgrath@uwaterloo.ca", "Directional derivative and the chain rule for multivariable functions.", "Double and triple integrals on simple domains; transformations and Jacobians; change of variable in multiple integrals.", "Vector fields, divergence and curl.", "Vector integral calculus: Line and surface integrals, Green's Theorem, Stokes' Theorem, Gauss' Theorem, conservative vector fields.", "Work in and convert between Cartesian and polar coordinates in two-dimensions or Cartesian, cylindrical, and spherical coordinates in three-dimensions.", "Plot and describe the behaviour of a vector field.", "Determine using a variety of tests if a vector field is conservative.", "Understand the fundamental differences between conservative and non-conservative vector fields.", "Determine the extreme values of a function of multiple variables.", "This course covers a selection of topics from multivariable vector calculus.", "In particular, we will aim to cover one item per week from the following list:", "Arc length and line integrals.", "Quadric surfaces and coordinate systems.", "Extrema of multivariable functions and Lagrange multipliers.", "A previous course in linear algebra is strongly recommended.", "I will also share short videos each week in which I work through examples and/or discuss particularly important concepts.", "I will also post problem sets with full solutions each week so that you have plenty of practice problems to work through.", "Discussion", "You can join our Piazza forum at", "To be clear - such websites are not allowed to be used for the completion of any assessment in MATH 227."]}, {"course_id": 7, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 2, "major_name": "Physics (Joint Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 8, "course_code": "PHYS 122L", "course_name": "PHYS122L - Waves, Electricity and Magnetism Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 2, "major_name": "Physics (Joint Honours)", "topics": ["08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 2 - Circuits", "Experiment 5 - Magnetic Fields of a Coil", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 11, "course_code": "PHYS 234", "course_name": "PHYS234 - Quantum Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 2, "major_name": "Physics (Joint Honours)", "topics": ["11:30AM - 12:20PM DC 1351", "K. Islam", "Introduction to formalism of quantum physics.", "Introduction to operators.", "Background: understanding why we need a quantum theory", "Learning the building blocks of a quantum theory: state vectors and operator", "Jan 06, 08, 10 Introduction to Quantum Physics, Stern-Gerlach experiments 1", "Jan 20, 22, 24 Matrix notation, general quantum systems, operators 2", "Mar 10, 12, 14 Continuous quantum systems – formalism, infinite potential well,", "Mar 17, 19, 21 Continuous quantum systems – infinite potential well (continued), finite potential well 5", "Mar 24, 26, 28 Continuous quantum systems – quantum harmonic oscillator 9", "Mar 31, Apr 02, 04 Continuous quantum systems (continued), Review", "Students should start checking for posted exam dates:", "Everyone needs a support system.", "Every student in PHYS 234 is expected to treat their peers and their instructor with kindness, fairness, tolerance, and respect.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 13, "course_code": "PHYS 249", "course_name": "PHYS249 - Computational Physics and Linear Algebra (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 2, "major_name": "Physics (Joint Honours)", "topics": ["Notice of Recording", "Computational Physics and Linear Algebra Fall 2024", "10:30AM - 12:20PM DC 1350", "Email: brenda.lee@uwaterloo.ca", "Computational techniques; numerical accuracy and speed; Python libraries and implementation; algorithms for numerical integration; matrix operations.", "Computational approach to vectors in 2- and 3-space; linear equations, matrices, determinants; eigenvalues and diagonalization.", "Resource Details", "These will not be recorded and consist primarily of board work.", "Understand and apply the basic concepts of vectors, matrices and linear transformations", "Interpret the geometric meaning of vector spaces, subspaces, linear independence, basis and dimension", "Perform matrix operations including addition, multiplication, transposition and inversion both manually and using Python libraries such as NumPy", "Solve systems of linear equations manually and computationally using LU decomposition and Gaussian elimination", "Calculate eigenvalues and eigenvectors of matrices manually and computationally; and interpret their significance in physics applications", "Apply diagonalization techniques to solve differential equations relevant to physics problems", "Understand inner product spaces and concepts of length and orthogonality in both theoretical and computational settings", "Describe and represent linear transformations using matrices; and their contribution to geometric objects and physical systems", "Develop iterative and computational skillsets through Python to model and simulate physical systems with the help of linear algebra concepts", "Identify and articulate transferable skills from their science courses and connect these to the Future Ready Talent Framework", "Create accomplishment statements that effectively communicate these skills on their resumes", "Thursdays Tutorial and Skills Identification & Articulation Workshop @ 10:30am - 12:20pm", "Not all topics may be covered in their entirety, but the core topics from the course calendar description will.", "Topic 1: Intro to Course, Linear Algebra & Python Programming", "2 Sep 9-13 Topic 3: Spanning and Linear Independence", "Topic 5: Projections and Applications", "Skills Identification & Articulation Worksheet 0", "Topic 6: Visualization and Solving of Vector Operations using Python", "Topic 7: Systems of Linear Equations, Gaussian Elimination and Back-Substitution", "Topic 9: Applications of Systems of Linear Equations with Computational Methods and Visualization with Python", "Topic 10: Matrix Addition and Multiplication", "Topic 11: Transpose, Identity and Inverse of a Matrix", "Skills Identification & Articulation Worksheet 1", "Topic 12: Matrix Factorizations", "Topic 13: Computational Methods in Matrix Algebra", "Topic 14: Vector Spaces and Subspaces", "Topic 16: Visualization of Vector Spaces through Computational Methods Skills Identification & Articulation Worksheet 2", "Topic 18: Computational Methods using Determinants", "Topic 19: Eigenvalues and Eigenvectors with Matrix Diagonalization", "Topic 22: Least Squares Approximations Skills Identification & Articulation Worksheet 3", "Topic 23: Numerical Approximation Methods", "UNIT 8 | COMPLEX VALUES & COMPUTATIONAL APPLICATIONS", "Topic 24: Complex Numbers & Computational Applications", "Jan 21: Standing decisions and official grades available in Quest", "Instructions and installation guidance will be provided at the beginning of the term on LEARN Yes", "An Introduction to Linear Algebra for Science and Engineering Excellent book that we will be using in this course; highly recommend getting this if you can No", "Linear Algebra: A Modern Introduction, 4th Edition, David Poole Good elementary book which has suitable problems for scientists No", "Computational Physics, 2nd Edition, Mark Newman Great for beginners to computational physics with Python No", "Introduction to Linear Algebra, 6th Edition, Gilbert Strange (MIT) Excellent mixture of linear algebra and optimization / data science but no physics applications No", "You are encouraged to explore the topics of linear algebra and computational physics / numerical methods of analysis through these recommended textbooks and materials above for your own benefit and enhanced learning experience.", "HOMEWORK (15% Completion Grade): I'm giving you free marks to practice, practice, practice and show you've put in the time to do some linear algebra!", "Level of Collaboration Allowed: Not Monitored", "Do them by the end of the next week to get grades.", "Level of Collaboration Allowed: None - Screening for Plagiarism Active - Debugging Support on Discord is Allowed", "Frequency: Once in the Middle of the Term", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Level of Collaboration Allowed: Groupwork Allowed", "Grading: Based on completion and suitability of responses", "The written content will primarily be code and Jupyter Notebook files.", "Code plagiarism includes moderate to significant reproduction of other's work (source code from available resources, code from classmate submissions, fragments of original code, etc.)", "Notice of Recording", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 17, "course_code": "PHYS 263", "course_name": "PHYS263 - Classical Mechanics and Special Relativity (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 2, "major_name": "Physics (Joint Honours)", "topics": ["Notice of Recording", "Classical Mechanics and Special Relativity Winter 2025", "08:30AM - 09:20AM", "Newtonian dynamics of particles and systems of particles.", "You will be expected to become fluent in solving the problems covered in this course using a variety of approaches (e.g. forces, torques, and energy conservation).", "Classical Dynamics of Particles and Systems (5th edition)", "Notice of Recording"]}, {"course_id": 18, "course_code": "PHYS 334", "course_name": "PHYS334 - Quantum Physics 2 (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 2, "major_name": "Physics (Joint Honours)", "topics": ["Notice of Recording", "04:30PM - 05:20PM", "Formalism of quantum mechanics.", "Identical particles.", "Applications in atomic and molecular physics.", "Physically predict, and mathematically model, the outcome(s) after measuring a quantum system", "Understand and model the difference between a single measurement outcome and an ensemble average", "Predict the time dependence of a quantum system, given its initial state and Hamiltonian", "Use commutator identities to check commutation relations for operators", "Write the position and momentum operators in terms of the harmonic oscillator ladder operators, and vice versa", "State the commutation relations that define a set of angular momentum operators", "State the spectrum (allowed eigenvalues) of the angular momentum operators 𝐽^2 and 𝐽_𝑧, in terms of quantum numbers 𝑗 and 𝑚", "State the restrictions on the 𝐽^2 and 𝐽_𝑧 eigenvalues, in terms of restrictions on their associated quantum numbers 𝑗 and 𝑚", "State the effect of all angular momentum operators on the joint eigenstates of 𝐽^2 and 𝐽_𝑧", "Compute the matrix representations of the angular momentum operators for a given 𝑗, in the joint eigenbasis of 𝐽^2 and 𝐽_𝑧", "Describe the eigenfunctions of orbital angular momentum (spherical harmonics) in the position basis", "For systems with “central” potentials (those that depend only on a radial coordinate), describe the decomposition of the energy eigenfunctions into their angular and radial components", "Describe the energies and eigenstates of the hydrogen atom", "Describe the degeneracy of different energy eigenstates of the hydrogen atom", "State two possible complete sets of mutually commuting operators (CSCOs) whose eigenstates can be used as bases to describe a set of two angular momenta", "State the eigenvalues of the CSCOs used to describe a set of two angular momenta", "State the selection rules for the Clebsch-Gordan coefficients that relate the coupled and uncoupled bases of a system with two angular momenta", "Calculate perturbative energy shifts and wavefunction changes for nondegenerate systems", "Calculate perturbative energy shifts for degenerate systems, selecting an appropriate basis for the calculation", "Use the variational method to estimate the ground-state energies of simple one-dimensional problems, given a suitable trial function", "State the definition of a boson and a fermion, in terms of the spin of the particles", "State the symmetry properties of bosonic and fermionic wavefunctions", "Exams", "There will be two in-class exams given during the lecture period in our usual classroom.", "Exam 2: Wed. Mar 19 (covers material up through and including nondegenerate perturbation theory)", "HW1 - formalism and postulates - due Jan 24", "HW2 - quantum harmonic oscillator and angular momentum - due Feb 7", "HW3 - spherical harmonics and hydrogen atom - due Feb 28", "HW4 - addition of angular momentum and nondegenerate perturbation theory - due Mar 12", "Week 1 - Intro to class and mathematical formalism of quantum mechanics", "Week 4 - Angular momentum", "Week 5 - Spherical harmonics and central potentials", "Week 8 - Nondegenerate perturbation theory", "Week 9 - Degenerate perturbation theory, fine structure, Zeeman effect", "Quantum Mechanics: A Paradigms Approach, David H. McIntyre", "Introduction to Quantum Mechanics, David Griffiths", "Zettili shines in its extensive collection of worked examples and practice problems.", "Some assignment problems may be graded on a multiple choice basis.", "Notice of Recording"]}, {"course_id": 22, "course_code": "PHYS 363", "course_name": "PHYS363 - Intermediate Classical Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 2, "major_name": "Physics (Joint Honours)", "topics": ["Intermediate Classical Mechanics Fall 2024", "Rigid body mechanics", "Set up Lagrangians and Hamiltonians for a wide range of physical systems", "Find and solve equations of motion using Lagrangian and Hamiltonian mechanics", "Work in noninertial reference frames to solve problems and recognize the consequences of fictitious forces", "Find equations of motion for coupled oscillators and solve linearized equations", "Calculate the inertia tensor of objects and understand the physics of rotating rigid bodies", "Identify conserved quantities using cyclic coordinates, Noether's theorem, and Poisson brackets", "Lagrangian formulation of mechanics and applications (TM Ch 7)", "Hamiltonian formulation of mechanics and applications (TM Ch 7)", "Classical Dynamics of Particles and Systems 5th edition, Thornton and Marion Same text as PHYS 263 Yes", "Python, including several common packages Yes", "A good all round upper-year undergraduate mechanics text.", "Widely used as a graduate level classical mechanics text.", "Introduction to Classical Mechanics: Morin.", "Assignment marks: The mark for each assignment will be based on answers to a subset, possibly all, of the Marked Problems.", "The lowest assignment grade will be removed for calculating the assignment mark.", "Those that require numerical calculations must be worked out using Python.", "These programs are not a substitute for thinking; they should be used sparingly and judiciously as they can become a crutch and will not be available on the midterm or final exams, which account for most of the marks in the course.", "Electronic distractions:  If you can't refrain from using electronics in a distracting way, please show consideration to your peers and sit at the back of the room.", "The assignment weight for the final grade will be reduced and the final exam weight will be increased commensurately for the course grade."]}, {"course_id": 1, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 3, "major_name": "Physics Minor", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 3, "course_code": "PHYS 234", "course_name": "PHYS234 - Quantum Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 3, "major_name": "Physics Minor", "topics": ["11:30AM - 12:20PM DC 1351", "K. Islam", "Introduction to formalism of quantum physics.", "Introduction to operators.", "Background: understanding why we need a quantum theory", "Learning the building blocks of a quantum theory: state vectors and operator", "Jan 06, 08, 10 Introduction to Quantum Physics, Stern-Gerlach experiments 1", "Jan 20, 22, 24 Matrix notation, general quantum systems, operators 2", "Mar 10, 12, 14 Continuous quantum systems – formalism, infinite potential well,", "Mar 17, 19, 21 Continuous quantum systems – infinite potential well (continued), finite potential well 5", "Mar 24, 26, 28 Continuous quantum systems – quantum harmonic oscillator 9", "Mar 31, Apr 02, 04 Continuous quantum systems (continued), Review", "Students should start checking for posted exam dates:", "Everyone needs a support system.", "Every student in PHYS 234 is expected to treat their peers and their instructor with kindness, fairness, tolerance, and respect.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 5, "course_code": "PHYS 249", "course_name": "PHYS249 - Computational Physics and Linear Algebra (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 3, "major_name": "Physics Minor", "topics": ["Notice of Recording", "Computational Physics and Linear Algebra Fall 2024", "10:30AM - 12:20PM DC 1350", "Email: brenda.lee@uwaterloo.ca", "Computational techniques; numerical accuracy and speed; Python libraries and implementation; algorithms for numerical integration; matrix operations.", "Computational approach to vectors in 2- and 3-space; linear equations, matrices, determinants; eigenvalues and diagonalization.", "Resource Details", "These will not be recorded and consist primarily of board work.", "Understand and apply the basic concepts of vectors, matrices and linear transformations", "Interpret the geometric meaning of vector spaces, subspaces, linear independence, basis and dimension", "Perform matrix operations including addition, multiplication, transposition and inversion both manually and using Python libraries such as NumPy", "Solve systems of linear equations manually and computationally using LU decomposition and Gaussian elimination", "Calculate eigenvalues and eigenvectors of matrices manually and computationally; and interpret their significance in physics applications", "Apply diagonalization techniques to solve differential equations relevant to physics problems", "Understand inner product spaces and concepts of length and orthogonality in both theoretical and computational settings", "Describe and represent linear transformations using matrices; and their contribution to geometric objects and physical systems", "Develop iterative and computational skillsets through Python to model and simulate physical systems with the help of linear algebra concepts", "Identify and articulate transferable skills from their science courses and connect these to the Future Ready Talent Framework", "Create accomplishment statements that effectively communicate these skills on their resumes", "Thursdays Tutorial and Skills Identification & Articulation Workshop @ 10:30am - 12:20pm", "Not all topics may be covered in their entirety, but the core topics from the course calendar description will.", "Topic 1: Intro to Course, Linear Algebra & Python Programming", "2 Sep 9-13 Topic 3: Spanning and Linear Independence", "Topic 5: Projections and Applications", "Skills Identification & Articulation Worksheet 0", "Topic 6: Visualization and Solving of Vector Operations using Python", "Topic 7: Systems of Linear Equations, Gaussian Elimination and Back-Substitution", "Topic 9: Applications of Systems of Linear Equations with Computational Methods and Visualization with Python", "Topic 10: Matrix Addition and Multiplication", "Topic 11: Transpose, Identity and Inverse of a Matrix", "Skills Identification & Articulation Worksheet 1", "Topic 12: Matrix Factorizations", "Topic 13: Computational Methods in Matrix Algebra", "Topic 14: Vector Spaces and Subspaces", "Topic 16: Visualization of Vector Spaces through Computational Methods Skills Identification & Articulation Worksheet 2", "Topic 18: Computational Methods using Determinants", "Topic 19: Eigenvalues and Eigenvectors with Matrix Diagonalization", "Topic 22: Least Squares Approximations Skills Identification & Articulation Worksheet 3", "Topic 23: Numerical Approximation Methods", "UNIT 8 | COMPLEX VALUES & COMPUTATIONAL APPLICATIONS", "Topic 24: Complex Numbers & Computational Applications", "Jan 21: Standing decisions and official grades available in Quest", "Instructions and installation guidance will be provided at the beginning of the term on LEARN Yes", "An Introduction to Linear Algebra for Science and Engineering Excellent book that we will be using in this course; highly recommend getting this if you can No", "Linear Algebra: A Modern Introduction, 4th Edition, David Poole Good elementary book which has suitable problems for scientists No", "Computational Physics, 2nd Edition, Mark Newman Great for beginners to computational physics with Python No", "Introduction to Linear Algebra, 6th Edition, Gilbert Strange (MIT) Excellent mixture of linear algebra and optimization / data science but no physics applications No", "You are encouraged to explore the topics of linear algebra and computational physics / numerical methods of analysis through these recommended textbooks and materials above for your own benefit and enhanced learning experience.", "HOMEWORK (15% Completion Grade): I'm giving you free marks to practice, practice, practice and show you've put in the time to do some linear algebra!", "Level of Collaboration Allowed: Not Monitored", "Do them by the end of the next week to get grades.", "Level of Collaboration Allowed: None - Screening for Plagiarism Active - Debugging Support on Discord is Allowed", "Frequency: Once in the Middle of the Term", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Level of Collaboration Allowed: Groupwork Allowed", "Grading: Based on completion and suitability of responses", "The written content will primarily be code and Jupyter Notebook files.", "Code plagiarism includes moderate to significant reproduction of other's work (source code from available resources, code from classmate submissions, fragments of original code, etc.)", "Notice of Recording", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 7, "course_code": "PHYS 263", "course_name": "PHYS263 - Classical Mechanics and Special Relativity (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 3, "major_name": "Physics Minor", "topics": ["Notice of Recording", "Classical Mechanics and Special Relativity Winter 2025", "08:30AM - 09:20AM", "Newtonian dynamics of particles and systems of particles.", "You will be expected to become fluent in solving the problems covered in this course using a variety of approaches (e.g. forces, torques, and energy conservation).", "Classical Dynamics of Particles and Systems (5th edition)", "Notice of Recording"]}, {"course_id": 9, "course_code": "PHYS 334", "course_name": "PHYS334 - Quantum Physics 2 (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 3, "major_name": "Physics Minor", "topics": ["Notice of Recording", "04:30PM - 05:20PM", "Formalism of quantum mechanics.", "Identical particles.", "Applications in atomic and molecular physics.", "Physically predict, and mathematically model, the outcome(s) after measuring a quantum system", "Understand and model the difference between a single measurement outcome and an ensemble average", "Predict the time dependence of a quantum system, given its initial state and Hamiltonian", "Use commutator identities to check commutation relations for operators", "Write the position and momentum operators in terms of the harmonic oscillator ladder operators, and vice versa", "State the commutation relations that define a set of angular momentum operators", "State the spectrum (allowed eigenvalues) of the angular momentum operators 𝐽^2 and 𝐽_𝑧, in terms of quantum numbers 𝑗 and 𝑚", "State the restrictions on the 𝐽^2 and 𝐽_𝑧 eigenvalues, in terms of restrictions on their associated quantum numbers 𝑗 and 𝑚", "State the effect of all angular momentum operators on the joint eigenstates of 𝐽^2 and 𝐽_𝑧", "Compute the matrix representations of the angular momentum operators for a given 𝑗, in the joint eigenbasis of 𝐽^2 and 𝐽_𝑧", "Describe the eigenfunctions of orbital angular momentum (spherical harmonics) in the position basis", "For systems with “central” potentials (those that depend only on a radial coordinate), describe the decomposition of the energy eigenfunctions into their angular and radial components", "Describe the energies and eigenstates of the hydrogen atom", "Describe the degeneracy of different energy eigenstates of the hydrogen atom", "State two possible complete sets of mutually commuting operators (CSCOs) whose eigenstates can be used as bases to describe a set of two angular momenta", "State the eigenvalues of the CSCOs used to describe a set of two angular momenta", "State the selection rules for the Clebsch-Gordan coefficients that relate the coupled and uncoupled bases of a system with two angular momenta", "Calculate perturbative energy shifts and wavefunction changes for nondegenerate systems", "Calculate perturbative energy shifts for degenerate systems, selecting an appropriate basis for the calculation", "Use the variational method to estimate the ground-state energies of simple one-dimensional problems, given a suitable trial function", "State the definition of a boson and a fermion, in terms of the spin of the particles", "State the symmetry properties of bosonic and fermionic wavefunctions", "Exams", "There will be two in-class exams given during the lecture period in our usual classroom.", "Exam 2: Wed. Mar 19 (covers material up through and including nondegenerate perturbation theory)", "HW1 - formalism and postulates - due Jan 24", "HW2 - quantum harmonic oscillator and angular momentum - due Feb 7", "HW3 - spherical harmonics and hydrogen atom - due Feb 28", "HW4 - addition of angular momentum and nondegenerate perturbation theory - due Mar 12", "Week 1 - Intro to class and mathematical formalism of quantum mechanics", "Week 4 - Angular momentum", "Week 5 - Spherical harmonics and central potentials", "Week 8 - Nondegenerate perturbation theory", "Week 9 - Degenerate perturbation theory, fine structure, Zeeman effect", "Quantum Mechanics: A Paradigms Approach, David H. McIntyre", "Introduction to Quantum Mechanics, David Griffiths", "Zettili shines in its extensive collection of worked examples and practice problems.", "Some assignment problems may be graded on a multiple choice basis.", "Notice of Recording"]}, {"course_id": 13, "course_code": "PHYS 363", "course_name": "PHYS363 - Intermediate Classical Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Physics", "program_id": 131, "major_id": 3, "major_name": "Physics Minor", "topics": ["Intermediate Classical Mechanics Fall 2024", "Rigid body mechanics", "Set up Lagrangians and Hamiltonians for a wide range of physical systems", "Find and solve equations of motion using Lagrangian and Hamiltonian mechanics", "Work in noninertial reference frames to solve problems and recognize the consequences of fictitious forces", "Find equations of motion for coupled oscillators and solve linearized equations", "Calculate the inertia tensor of objects and understand the physics of rotating rigid bodies", "Identify conserved quantities using cyclic coordinates, Noether's theorem, and Poisson brackets", "Lagrangian formulation of mechanics and applications (TM Ch 7)", "Hamiltonian formulation of mechanics and applications (TM Ch 7)", "Classical Dynamics of Particles and Systems 5th edition, Thornton and Marion Same text as PHYS 263 Yes", "Python, including several common packages Yes", "A good all round upper-year undergraduate mechanics text.", "Widely used as a graduate level classical mechanics text.", "Introduction to Classical Mechanics: Morin.", "Assignment marks: The mark for each assignment will be based on answers to a subset, possibly all, of the Marked Problems.", "The lowest assignment grade will be removed for calculating the assignment mark.", "Those that require numerical calculations must be worked out using Python.", "These programs are not a substitute for thinking; they should be used sparingly and judiciously as they can become a crutch and will not be available on the midterm or final exams, which account for most of the marks in the course.", "Electronic distractions:  If you can't refrain from using electronics in a distracting way, please show consideration to your peers and sit at the back of the room.", "The assignment weight for the final grade will be reduced and the final exam weight will be increased commensurately for the course grade."]}, {"course_id": 0, "course_code": "CS 114", "course_name": "CS114 - Principles of Computing for Science (0.50)", "term_name": "Required Courses", "program_name": "Physics and Astronomy", "program_id": 132, "major_id": 1, "major_name": "Physics and Astronomy (Bachelor of Science - Honours)", "topics": ["Principles of Computing for Science Winter 2025", "08:30AM - 09:50AM MC 4059", "Monday -", "Monday", "07:00PM - 08:50PM", "10:30AM - 11:20AM MC 4063", "Coordinator", "Student who make use of office hours usually get better grades; use them!", "Introduction to basic imperative programming principles; programming concepts including functions, flow control, lists, arrays; numerical accuracy and efficiency; data analysis and general-purpose algorithms.", "Introduction to object-oriented programming concepts.", "Describe the basic memory model for mutation of basic types, lists, and objects in Python.", "Identify situations where recursion is an appropriate tool, and use it.", "6 Feb 6-11 M4: Strings and Lists", "7 Feb 13-25 M5: Sorting and Dictionaries", "If both exams are held in person", "If in-person exams cannot be held then they will be held online (if possible).", "Students have the option of self-declaring a short-term absence, as described here: https://uwaterloo.ca/registrar/current-students/undergraduate-student-short-term-absences", "Students should check their basic tests email to ensure that the code meets the specification exactly.", "If ill, please complete a complete a Verification of Illness Form and contact the course coordinator to discuss alternate arrangements.", "Generative AI: This course includes the independent development and practice of specific skills, such as writing and reading code, tracing, and algorithm design.", "Library for research-based assignments"]}, {"course_id": 2, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Physics and Astronomy", "program_id": 132, "major_id": 1, "major_name": "Physics and Astronomy (Bachelor of Science - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 3, "course_code": "MATH 227", "course_name": "MATH227 - Calculus 3 for Honours Physics (0.50)", "term_name": "Required Courses", "program_name": "Physics and Astronomy", "program_id": 132, "major_id": 1, "major_name": "Physics and Astronomy (Bachelor of Science - Honours)", "topics": ["Email: pmcgrath@uwaterloo.ca", "Directional derivative and the chain rule for multivariable functions.", "Double and triple integrals on simple domains; transformations and Jacobians; change of variable in multiple integrals.", "Vector fields, divergence and curl.", "Vector integral calculus: Line and surface integrals, Green's Theorem, Stokes' Theorem, Gauss' Theorem, conservative vector fields.", "Work in and convert between Cartesian and polar coordinates in two-dimensions or Cartesian, cylindrical, and spherical coordinates in three-dimensions.", "Plot and describe the behaviour of a vector field.", "Determine using a variety of tests if a vector field is conservative.", "Understand the fundamental differences between conservative and non-conservative vector fields.", "Determine the extreme values of a function of multiple variables.", "This course covers a selection of topics from multivariable vector calculus.", "In particular, we will aim to cover one item per week from the following list:", "Arc length and line integrals.", "Quadric surfaces and coordinate systems.", "Extrema of multivariable functions and Lagrange multipliers.", "A previous course in linear algebra is strongly recommended.", "I will also share short videos each week in which I work through examples and/or discuss particularly important concepts.", "I will also post problem sets with full solutions each week so that you have plenty of practice problems to work through.", "Discussion", "You can join our Piazza forum at", "To be clear - such websites are not allowed to be used for the completion of any assessment in MATH 227."]}]