[{"course_id": 12, "course_code": "CHEM 120", "course_name": "CHEM120 - General Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["General Chemistry 1 Winter 2025", "RCH 101", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "The second part of this course is concerned with explaining periodicity and trends in chemical reactivity in terms of the electronic structure of atoms and molecules.", "Topics covered in this part of the course include the quantum theory of the hydrogen atom; electron configurations in multi-electron atoms; ionic and covalent bonding; Lewis structures, valence shell electron repulsion theory and molecular geometry; quantum mechanical bonding theories, including valence bond theory and molecular orbital theory.", "Additional topics may include an introduction to electron-transfer reactions, including the assignment of oxidation states and the balancing of oxidation-reduction reactions.", "assess the greenness of a chemical reaction using Atom Economy and E-Factor metrics.", "describe the electronic structure of atoms in terms of quantum theory using atomic orbitals and quantum numbers.", "justify the organization of the periodic table and predict trends in the properties of the elements.", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and explain molecular shape and stability in terms of electron count.", "describe the interactions of molecules in solids, liquids, and gases to compare physical and reactive properties.", "Course Structure and Continuity Plans", "No extensions will be granted for Participation Challenges, but each student can drop one participation challenge from their overall grade.", "Printed spiral bound copies of the course notes can be purchased online from the UW bookstore https://wstore.uwaterloo.ca/", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare pandemic-related illnesses on Quest (Information at this link)", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 13, "course_code": "CHEM 120L", "course_name": "CHEM120L - General Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 1 Fall 2024", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Be sure to record their name and contact information in your lab manual.", "Skillfully perform basic procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "1,3,5,7,9,11", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Sept 19 - 24", "1,3,5,7,9,11", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "1,3,5,7,9,11", "- studying cis and trans isomers", "Oct 24-29", "1,3,5,7,9,11", "Titration as an Analysis Tool", "- identify an unknown solid acid", "1,3,5,7,9,11", "Introduction to Chromatography", "- quantify a cation using ion exchange", "1,3,5,7,9,11", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 15, "course_code": "CHEM 123L", "course_name": "CHEM123L - General Chemistry Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 2 Winter 2025", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- a real life analysis", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 16, "course_code": "CHEM 237", "course_name": "CHEM237 - Introductory Biochemistry (0.50)", "term_name": "Required Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:20AM", "RCH 101", "10:30AM - 11:20AM RCH 101", "ESC 227", "Structure and properties of proteins and enzymes.", "develop a molecular level understanding of biological processes to achieve this the following learning outcomes will be", "in both qualitative and quantitative examples", "evaluate unknown thermodynamic parameters from given values of others.", "I equilibrium constants from standard free energy changes.", "qualitatively describe the composition of solutions of a weak acid or base as a function of pH.", "calculate the precise", "recognize the 20 amino acids that are commonly found in proteins and identify compounds derived from them", "calculate the charge on an amino acid side chain as a function of pH", "know the 4 levels of protein structure and the covalent and non covalent interactions that stabilize them", "explain how to purify proteins using the physical and chemical properties of the proteins", "determine the primary sequence of a protein given the appropriate data", "understand basic chemical kinetics and the application to biological systems", "determine the mechanism of inhibition of an enzyme using", "the structure of fatty acids and membrane lipids", "the structures of cell membranes and how the fatty acid composition of those membranes affects membrane structure and fluidity", "the structure of simple sugars and polysaccharides and the chemistry of the reactions in which they participate", "Suggested supplementary reading in \"Biochemistry Free for All\".", "Biochemistry free for all: Introduction Water and Buffers, pages 34-49", "VVP chapters 3 and 4.1", "Biochemistry free for all pages 53-70", "Appendix A.1 and A.2", "Chapter 4.2 and 4.3", "Biochemistry free for all.", "pp 74-108", "Week 6  Protein folding and Introduction to hemoglobin", "Chapter 4 - Biochemistry in focus", "Biochemistry free for all pages 128-141", "first kinetics Chapter 10 then mechanisms Chapter 9", "Biochemistry free for all pages 337-362", "Biochemistry free for all pp 190-217", "Biochemistry free for all pp 222-233", "Biochemistry free for all pp 287 - 312", "Notice of Recording"]}, {"course_id": 23, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 30, "course_code": "BIOL 434", "course_name": "BIOL434 - Human Molecular Genetics (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Human Molecular Genetics Fall 2024", "Recent advances in human molecular genetics will be examined with emphasis on how human disease-causing genes are mapped, identified, isolated, and characterized.", "describe structural elements of the human genome and their uses in gene mapping", "describe molecular techniques applied to mapping the location of and determining the sequence of specific genes", "differentiate between complex and simple traits in the etiology of disease using real world examples", "describe how various molecular change contribute to human disease", "describe the role of genomics tools in the determination of disease predisposition and appreciate how pathogenicity/neutrality of a sequence variant is determined", "evaluate the current limitations in the applications of genomics to the etiology of disease", "appreciate ethical and legal issues that have developed as a result of expanding human molecular genetic technologies", "evaluate and critically read primary literature on disease (to identify rationale/hypothesis, and and assess the skills needed to critically evaluate the methods and assess the conclusions", "Pattern of inheritance", "Pattern of inheritance", "Human genome sequencing", "23-Sep-24 M", "Human genome sequencing", "The architecture and working of human genome", "The architecture and working of human genome", "Human gene regulation and epigenome", "Human gene regulation and epigenome", "Human genetic variation", "Human gene regulation and epigenome", "18-Oct-24 F", "21-Oct-24 M  Epigenome/ Comparative genomics and evolution", "Molecular pathology", "25-Oct-24 F", "28-Oct-24 M", "Mapping and identifying genes for monogenic disorders", "Mapping and identifying genes for monogenic disorders", "Complex diseases", "4-Nov-24 M  Cancer genetics and genomics", "6-Nov-24 W Cancer genetics and genomics", "Model organisms", "29-Nov-24 F", "To facilitate equal contribute from all members, it is vital to maintain open and constant communication.", "Notice of Recording", "They host in-person appointments in their offices in South Campus Hall (SCH), remote appointments via a virtual platform, drop-in appointments at the Library, and email-based appointments so you can get help without missing class."]}, {"course_id": 47, "course_code": "BIOL 354", "course_name": "BIOL354 - Environmental Toxicology (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Environmental Toxicology Fall 2024", "02:30PM - 05:20PM B2 351", "07:00PM - 09:50PM B2 351", "02:30PM - 05:20PM B2 351", "02:30PM - 05:20PM B2 351", "07:00PM - 09:50PM B2 351", "Please bring a reusable mug if you'd like a cup of tea.", "An introduction to the basic theories, principles, and techniques of environmental toxicology.", "A comparative study of the effects of specific groups of toxicants and how they can affect molecular, cellular, and organismal processes will be explored in lectures and through laboratory experiments.", "Know the basic theories, principles and techniques of environmental toxicology.", "Understand how different toxicants move from source to receptor, the concept of dose-response relationships and toxicokinetics.", "Understand the process of assessing toxicity using various toxicity test methods and the understand the physiological impacts of various classes of toxicants.", "Know the scientific terminology and knowledge base necessary to effectively communicate the impact of toxicants on target organisms through an in-person group presentation.", "Follow safety procedures as they relate to working in a toxicology laboratory and handling samples and organisms in the lab.", "Conduct toxicity tests using model organisms to assess the effects of pollutants.", "Describe how bioassays are used to estimate toxicity in environmental toxicology.", "Interpret and analyze the results of toxicity experiments, draw appropriate conclusions supported by the data in the format of a laboratory report.", "Week 2 Dose-Response Relationships & Toxicity Test Methods Chapter 4 Sections 4.3.2.", "no grade**", "no grade**", "Week 8 Survey of Toxic Substances - Inorganic & Organic Contaminants", "2,4-D", "2,4-D", "**", "Official Grades and Course Access", "Few are available on loan in the lab (first come, first served)", "WHMIS training checked for completion during the first lab Yes", "At the discretion of the instructor, you may be permitted to take a make-up exam.", "The make-up exam may be of different format than the missed examination (e.g. oral examination for the make-up).", "The Lecture Minute Paper activity will be followed by a discussion Indigenous Learning Circles that provide an opportunity for relational and reciprocal learning, fostering critical thinking, problem-solving skills, increased engagement, and community building.", "Lab Activities & Assessments", "Notice of Recording", "Don’t waste your time with these requests!", "Library for research-based assignments"]}, {"course_id": 49, "course_code": "BIOL 359", "course_name": "BIOL359 - Evolution 1: Mechanisms (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["A study of the processes of evolution; the differentiation of populations and the origin of new forms of life.", "Describe and explain the various agents of evolution", "Demonstrate how these processes may result in adaptation, speciation and extinction", "Analyze and interpret cases of evolution", "Apply evolutionary concepts of conservation biology", "Evidence for Evolution", "Natural Selection", "Variation", "Mendelian Genetics- selection and mutation", "Mendelian Genetics- gene flow, genetic drift and non-random mating", "Adaptation", "Evolution of Sex", "8.3", "Sexual Selection", "Evolution of Social Behavior", "Speciation"]}, {"course_id": 55, "course_code": "CS 200", "course_name": "CS200 - Concepts for Advanced Computer Usage (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Concepts for Advanced Computer Usage Winter 2025", "10:30AM - 12:20PM MC 3027", "E-mail: barbara.daly@uwaterloo.ca", "E-mail: cs200@uwaterloo.ca", "Important concepts underlying major personal computer application categories; methodologies for learning and evaluating software; operating system and hardware design from the user's point of view, with implications for maintaining a personal computer.", "To develop an understanding of important intellectual concepts underlying major personal computer application categories, and the application of those concepts to problem solving.", "To develop an understanding of personal computer software and hardware appropriate for students who own and maintain their own machines.", "Introduction", "Word Processing", "A1", "Backups", "A2", "A4", "A6", "Database Intro", "Monday, Mar 10 Advanced Databases", "Examinations"]}, {"course_id": 71, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 72, "course_code": "PSYCH 101", "course_name": "PSYCH101 - Introductory Psychology (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Email: nhwegenschimmel@uwaterloo.ca", "One challenge of online course work can be the absence of a social network.", "There are two discussion boards set up for you to communicate with your classmates to facilitate your success in the course.", "Please be generous in your participation on these discussion boards, returning occasionally to read and respond to your classmates.", "The goal here is to facilitate communication between students and to reduce redundancies in correspondence, which can be overwhelming in online formats.", "A general survey course designed to provide the student with an understanding of the basic concepts and techniques of modern psychology as a behavioural science.", "Introductory Psychology will introduce students to the fundamental theories, concepts, methods, and issues encountered in the field of psychology.", "In addition to learning the core concepts of the field, this course is also meant to instruct the student in the scientific method (as it is used in the social sciences), to give students insight into themselves and their relationships with others, and to develop skills that will help students be successful in university and beyond.", "Explain and apply the core concepts of psychology.", "This will provide a foundation of knowledge upon which you can build in upper year psychology courses.", "Gain greater insight into yourself, others, and the human condition: Apply core concepts to yourself and others; recognize and value human diversity.", "Module 10: Behaviour in Groups", "Introduction to psychology.", "Introduce Yourself Non-completion -2%", "Extensions for extenuating circumstances may be granted at the discretion of the instructor.", "Library for research-based assignments", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 80, "course_code": "ARBUS 202", "course_name": "ARBUS202 - Professional and Business Ethics (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["11:30AM -", "V. Fernandes", "Study of ethical and moral issues that typically arise in professional and business activity.", "In the context of this course we will look specifically at ethical issues and principles of conduct that are relevant to professionals and business people.", "Topics include: fundamentals of moral and political theory, ethical decision-making, professional responsibility, corporate social responsibility, and equality, among other things.", "Like many other courses in philosophy, this series of lectures, readings, and discussions will deal with a critical analysis of many and varied views regarding life, existence, values, religious belief, etc.", "Form an opinion on the importance of ethical reasoning in business and professional contexts.", "Identify ethical problems in complex professional and business related situations.", "Apply ethical concepts to particular business and professional situations.", "Explain the roles of professional codes of conduct and codes of ethics in real world contexts.", "1 Jan 6 - 10 Introduction", "Module 2 Check-in", "3 Jan 20 - 24 Ethical Decision Making", "Module 3 Check-in", "5 Feb 3 - 7 Equality & Discrimination", "Module 6 Check-in", "7 Feb 24 - 28 Markets & the Environment", "Module 7 Check-in", "Module 9 Check-in", "Module 10 Check-in", "11 Mar 24 - 28 Whistle-blowing and Codes of Ethics", "Module 11 Check-in", "Module 12 Check-in", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 88, "course_code": "PHIL 226", "course_name": "PHIL226 - Biomedical Ethics (0.50)", "term_name": "Elective Courses", "program_name": "Biomedical Sciences", "program_id": 17, "major_id": 1, "major_name": "Biomedical Sciences (Bachelor of Science - Honours)", "topics": ["Biomedical Ethics Winter 2024", "I will have in-person drop-in office hours on Mondays and Wednesdays 1:15-2:15 in Hagey Hall 322A. You can also request an appointment by emailing me and letting me know your availability as well as whether you prefer virtual or in-person.", "If you are in a debate club, your goal is to defeat your opponent.", "Philosophy is not a debate club.", "First, I will describe the overall structure of the course.", "There will be a multiple choice Learn quiz on Unit 1.", "Third, we spend three classes learning about some general ethical concepts relevant to bioethics: utilitarianism, care ethics, and relational autonomy.", "One is a multiple choice Learn quiz on the readings from the first four classes of Unit 2.", "Just like in Unit 2, there will be a multiple choice Learn quiz on the readings from the first four classes, an in-class test that guides you into writing a first rough draft of your essay, and an essay assignment.", "Unit 1: Some Examples of Ethical Reasoning and Argumentation", "In-Class Test that will have questions that guide you into writing a first rough draft of Essay 1", "I will bring a small number of printed copies for borrowing.", "In A Companion to Bioethics, 2nd edition, edited by Helga Kuhse and Peter Singer, 85-90.", "In The Feminist Health Care Ethics Research Network, Susan Sherwin Coordinator, The Politics of Women’s Health: Exploring Agency and Autonomy, 19-47.", "“Conscientious Objection in Medicine: Accommodation versus Professionalism and the Public Good.”", "“The Best Interests Standard as a Logic of Empire: Unpacking the Political Dimensions of Parental Refusal.”", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Monday March 25", "It is a multiple choice quiz that should not take too long to complete.", "Instructions for the In-Class Tests", "An In-Class Test will have questions that guide you into writing a first rough draft of your essay", "You should study one reading from the first six classes of the relevant Unit", "I will bring a small number of printed copies for borrowing.", "A test that is assessed as Pass receives a grade of 50.", "A test that is assessed as Fail receives a grade of 0.", "Instructions for the Essays", "Introduction (about 75-125 words)", "You are not allowed to use GenAI during the In-Class Tests that guide you into writing a first rough draft of your essay, but you are allowed to use GenAI during the process of getting from your first draft to your final version of your Essay.", "Every philosopher I have met says this.", "Talking - Yes", "Getting Suggestions - No", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:"]}, {"course_id": 1, "course_code": "STAT 331", "course_name": "STAT331 - Applied Linear Models (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Applied Linear Models Winter 2025", "08:30AM - 09:50AM MC 4020", "02:30PM - 03:20PM", "RCH 101", "Thursdays from 3:00-4:00pm in M3 3021", "Modelling the relationship between a response variable and several explanatory variables (an output-input system) via regression models.", "Model diagnostics and improvement.", "Algorithms for variable selection.", "Review of basic Normal theory, t, chi-squared, and F distributions.", "Simple linear regression.", "Analysis of variance.", "Multiple linear regression, variable selection techniques, indicator variables, diagnostics.", "Brief introduction to non-linear regression, factorial experimentation.", "Registered students can enroll in the class discussion board through Piazza.", "Search for your question first before posting.", "Do not expect a full solution to your question.", "To help maintain a safe, respectful, and productive community in which we – students and teaching team alike – can take risks in our learning/teaching, tackle challenging concepts, and ultimately grow as learners, we should endeavor to follow these mutual expectations:", "Explain the main concepts of linear regression models.", "Understand the methods of least squares and maximum likelihood estimation for model parameters.", "Interpret the model and its parameters (e.g., regression coefficients) in the context of any application.", "Draw inferences from a fitted model about the parameters of interest and make predictions.", "Apply the previous two outcomes when fitting linear models to real data using R.", "Assess model quality by diagnosing violations in underlying model assumptions (and identify strategies for improvement).", "Evaluate competing fitted models built using various model selection methods (and choose between them).", "Introduction", "The Straight Line Model", "Model formulation and interpretation", "Least squares estimation", "Mean response and residual variance estimation", "Introduction to R/RStudio", "Maximum likelihood estimation", "Estimators and their properties", "Important distributions", "Distributions of estimators", "Confidence intervals", "O - Ch. 2-4", "Straight Line Model in R", "Prediction intervals", "Intervals in R", "Hypothesis testing", "O - Ch. 4-5", "ANOVA and F test", "Model limits", "Data transformations", "O - Ch. 4-6", "O - Ch. 7", "A1 and Q1 Solutions", "Multivariate normal distribution", "The Linear Model", "Examples", "O - Ch. 8-9", "Estimation", "Estimators and their properties", "Distributions of estimators", "O - Ch. 9, 11, 12", "ANOVA and F test", "Significance tests", "General linear hypothesis", "O - Ch. 9, 11, 12", "A2 and Midterm Solutions", "Case Study: South African heart disease", "Nested models", "Additional sum of squares", "O - Ch. 12", "Outliers", "O - Ch. 13-14", "Influence", "O - Ch. 14-15", "A3 and Q2 Solutions", "One-variable-at-a-time selection methods", "Criteria-based selection methods", "O - Ch. 16", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solve exercises from the textbook on your own.", "Introduction to Regression Modeling by Abraham and Ledolter This textbook is an optional reference book (available for free on LEARN).", "R and R-Studio Free software.", "To serve as an opportunity to demonstrate your understanding, application, and integration of the course material, including practical application of the skills/concepts with the statistical software, R.", "Missed Assignment: The time window to complete these assessments are generous and, in general, a sickness lasting a couple of days will not be enough of a reason to ask for alternative accommodations and/or extension.", "Tips for Success", "Students should critically compare their work with available solutions and against the solutions of fellow classmates.", "Notice of Recording", "To help you decide if you should isolate, you can use the provincial self-assessment tool.", "In the scenario where we must transition back online the following contingencies will be used:", "These materials are made available for the personal use of students registered in the current offering of this course.", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical proofs and the fitting, interpretation, and assessment of linear models in real applications.", "Library for research-based assignments"]}, {"course_id": 3, "course_code": "STAT 333", "course_name": "STAT333 - Stochastic Processes 1 (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM DC 1350", "04:00PM - 05:20PM", "Erik Hintz: Fridays, 2:00pm - 3:00pm, in M3-2106", "Requests must be emailed to: sasugradadv@uwaterloo.ca", "Topics cover generating functions, conditional probability distributions and conditional expectation, discrete-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, applications including the random walk, the gambler's ruin problem, and the Galton-Watson branching process, an introduction to counting processes, connections between the exponential distribution and Poisson process, and non-homogeneous and compound Poisson processes.", "use moment generating functions as a tool to determine expected values and identify probability distributions of random variables;", "use the law of total expectation to calculate expected values and probabilities through the principle of conditioning;", "specify a discrete-time Markov chain (DTMC), in terms of its transition probability matrix and initial conditions, and calculate various transition probabilities;", "classify the states of a DTMC;", "define fundamental DTMC concepts including irreducibility, periodicity, and recurrence/transience;", "find limiting/stationary probability distributions for certain DTMCs through the use of the Basic Limit Theorem;", "calculate absorption probabilities and expected absorption times for DTMCs using the principle of conditioning with respect to the first transition;", "Week 11 March 24 - March 28 Chap 4: Exponential Distribution & Poisson Processes Tutorial Assignment 2", "Week 12 March 31 - April 4 Chap 4: Exponential Distribution & Poisson Processes Tutorial Test 3", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solving exercises from the Course Notes on your own.", "Introduction to Probability Models by Sheldon M. Ross (2019)"]}, {"course_id": 5, "course_code": "STAT 431", "course_name": "STAT431 - Generalized Linear Models and their Applications (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Generalized Linear Models and their Applications Winter 2025", "Review of the normal linear model and maximum likelihood estimation; regression models for binomial, Poisson and multinomial data; generalized linear models; and other topics in regression modelling.", "The primary objective of this course is to introduce students to generalized linear models.", "Attention will be mainly directed towards theory and applications involving binary, categorical, and count data, although the generalized linear model will be presented in its full generality for responses from the exponential family.", "This course introduces several useful regression techniques for the analysis of data arising in many different settings (ie， medicine, industry, psychology etc.).", "The intended audience consists of students interested in advanced regression modeling.", "The objectives are to help students develop an understanding of the statistical theory and to equip them with the ability to fit regression models for a wide range of problems.", "run generalized linear regression for binary, categorical and count data and have a deep understanding of the underlying theories.", "Week 7 Dose-Response Models Lecture 11", "An Introduction to Generalized Linear Models by Dobson, AJ and Barnett, AG, fourth edition No 92", "Software: Students are encouraged to use R for coding problems in assignments, but feel free to use any computing software you feel comfortable with.", "An introduction to R: https://cran.r-project.org/doc/manuals/r-release/R-intro.pdf.", "Arrangements for students with official conflicts will be handled on a case by case basis."]}, {"course_id": 9, "course_code": "AMATH 242", "course_name": "AMATH242 - Introduction to Computational Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 12, "course_code": "AMATH 350", "course_name": "AMATH350 - Differential Equations for Business and Economics (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Differential Equations for Business and Economics Winter 2025", "11:30AM - 12:20PM MC 4045", "First order ordinary differential equations.", "Applications to continuous compounding and the dynamics of supply and demand.", "Higher order linear ordinary differential equations.", "Systems of linear ordinary differential equations.", "Introduction to linear partial differential equations.", "Ordinary differential equations and their applications", "Systems of linear ordinary differential equations", "Linear partial differential equations and Fourier transform", "Black-Scholes equation and solution", "(Jan 6-10) Introduction to Differential Equations (DEs), Separable Equations, Initial-Value Problems, Applications from Finance", "Dimensional Homogeneity, First-Order Linear Ordinary DEs, Use of Substitutions, Applications from Finance Chapter 2 Posting Assignment 1", "Introduction to Higher-Order Linear Equations: Theoretical Background", "Introduction to Systems of Ordinary Differential Equations, Method of Solution for Homogeneous Systems (Second Order)", "(Mar 3-7) Introduction to Partial Differential Equations, First-order Equations (Partial Integration, Method of Characteristics) Chapter 5", "Second-Order Linear PDEs: Classification, Solution by Partial Integration or Method of Characteristics Chapter 5", "Please submit your assignments early in case of unexpected technical difficulties."]}, {"course_id": 14, "course_code": "MATH 239", "course_name": "MATH239 - Introduction to Combinatorics (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics Winter 2025", "11:30AM - 12:20PM MC 4059", "09:30AM - 10:20AM MC 4021", "P. Nelson", "08:30AM - 09:20AM QNC 1502", "S. Pfannerer-Mittas", "10:30AM - 11:20AM MC 4058", "11:30AM - 12:20PM MC 4058", "09:30AM - 10:20AM MC 4042", "02:30PM - 03:20PM", "10:30AM - 11:20AM PHY 150", "04:30PM - 05:20PM", "You should have no reason to contact them directly, but you can find their email addresses through Learn.", "First name Last name", "Guilherme Zeus Dantas E Moura", "Theodore Morrison", "Matthew Kroeker", "Introduction to graph theory: colourings, matchings, connectivity, planarity.", "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.", "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 15, "course_code": "MATH 249", "course_name": "MATH249 - Introduction to Combinatorics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics (Advanced Level)", "09:30AM - 10:20AM MC 2017", "For graph theory, while we will focus on the same topics covered in MATH 239 (planarity and bipartite matching), our coverage of those topics will differ substantially in depth and in the techniques that we employ; in particular, we will see striking applications of algebra.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 16, "course_code": "BIOL 239", "course_name": "BIOL239 - Genetics (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM", "10:30AM - 11:20AM STC 1012", "You can!", "Chromosomal mechanisms in mitosis and meiosis.", "Natural selection and the evolution of genetic systems.", "Describe the fundamentals of gene structure, function and transmission in prokaryotic and eukaryotic cells and organisms.", "Describe the various ways mutations can arise and how mutations may affect gene expression and phenotypic outcomes.", "Describe recombinant DNA technology in bacteria and its role in biotechnology.", "Effectively work with others, discussing, evaluating, and communicating genetics concepts and synthesizing ideas in a group.", "Readings", "textbook 1.1-1.2", "Mendelian genetics and probability", "Modification of Mendelian ratios", "textbook 3.2-3.3, 4.2-4.4, 15.1", "Mitosis, meiosis, and chromosome numbers", "DNA and the genetic code", "textbook 9.2-9.3", "T4: Mitosis and meiosis", "DNA cloning", "T5: Testing genetic ratios", "Cancer genetics", "T9: Population genetics", "Exam period", "- write the final exam and achieve a grade of at least 50% on the cumulative test and exam section", "Online learning activities: These activities are designed to test your knowledge of several important concepts explained by the lecture presentations in this course, and should be completed after the portion of the course when they are covered in lecture.", "They are all due toward the end of the term but can be completed as many times as you like to help you work on these concepts.", "Read the instructions carefully before attempting these as a completion quiz (in the quiz section) must also be completed to obtain credit.", "In this case, the weight of the missed submission will be transferred to the final exam.", "The dates affected and degree of incapacitation will be used to determine follow-up action."]}, {"course_id": 20, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Biostatistics", "program_id": 19, "major_id": 1, "major_name": "Biostatistics (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 11, "course_code": "AFM 321", "course_name": "AFM321 - Personal Financial Planning and Taxation (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Personal Financial Planning and Taxation Winter 2025", "AFM 321", "AFM 321 001", "Email: kaishu.wu@uwaterloo.ca", "AFM 321:", "This course integrates financial planning and taxes for individuals.", "It connects elements of planning, saving, spending, and reporting to budgeting and tax implications, as they evolve over an individual's lifetime.", "View requirements for AFM 321", "AFM 321 helps students develop a do-it-yourself (DIY) individual financial planning and tax mindset.", "Students will learn how to prepare and assess a basic financial plan for themselves, centered around the budget, across various life stages.", "Within each area of planning, saving, spending, and reporting, students will develop appreciation of important financial and tax considerations that will set them up for financial success.", "Prepare a financial plan and budget for various life stages using fore core elements (planning, saving, spending, and reporting)", "2. Analyze and recommend a financial plan/budget for various life stages", "3. Integrate tax implications and analysis within your plan/budget and each life stage", "4. Use data and analytical techniques to evaluate comparable investments", "3 individual budget and financial planning assignments 37%", "TopHat knowledge and reflection questions & Module practice problems 13%", "Individually or in groups, students will complete mini-cases requiring them to prepare a budget and all related documentation, including tax implications, related to planning, saving, spending, and reporting.", "Students will write a comprehensive final exam that builds on the previous budget and financial planning assignments and will require them to prepare or analyze a budget/financial plan, related schedules, and consider tax calculations and implications.", "The assignment will require a written report detailing the comparison and conclusions reached, as well as collection and analysis of data and a visualization of certain findings.", "To be awarded a grade for these components, you must enroll in TopHat using your UW username-specific email (no alias UW email address, or non-UW email address).", "GenAI use is not permitted for these problems.", "The instructor is a facilitator of the knowledge and discussion.", "9-10 if you attended classes throughout the term, and participated meaningfully in the discussion several times each week consistently throughout the term.", "Although rare, we will always make corrections for clear inconsistencies in your grade (i.e., specific feedback says you achieved one ranking, but assessment was checked for a lower ranking).", "Submission Times", "Due to the highly structured nature of the study plans and the fact that many SAF courses are offered on a limited basis, students should be aware that a penalty imposed as a result of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Intellectual property includes items such as:", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 18, "course_code": "AFM 433", "course_name": "AFM433 - Business Strategy (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "AFM433 Business Strategy Winter 2025", "AFM 433", "AFM 433 001", "AFM 433 002", "02:30PM - 05:20PM", "AFM 433 003", "AFM 433 101", "07:00PM - 08:50PM", "AFM 433:", "Managers contribute to the organization through their analytical and leadership capabilities as well as their technical expertise.", "The course provides a framework for developing and implementing strategy that fits the firm's environment, managerial values, and organization.", "View requirements for AFM 433", "Assess the alignment of an organization’s mission, vision, and values with its business strategy and its organizational accountability system", "Describe an organization’s governance structure and the specific roles of the board in strategic management", "Strengthen thinking and problem-solving skills by learning when, why, and how to apply strategy analysis concepts/tools and design thinking skills", "AFM433 Voice over PPT online lectures available on LEARN to be lsitened to in advance each week according to the detailed course schedule Yes free", "You will submit a one page writeup for five of these cases to count towards your individual case submission grade.", "Details will be provided on LEARN for the requirements for the submissions, but in general they will be one page in length and will be graded on a full credit or half-credit basis.", "Teams", "All members of a team normally receive the team’s grade for each component of the team assignments because strategy development and implementation are team efforts, not an individual activity.", "Your team will pick a company of interest and present a 10-minute overview of the company’s strategy and an assessment of their competitive advantage.", "Details of the assignment and criteria for choosing the company are posted in a separate document on LEARN.", "Your teams will be given a specific timeslot for your presentation closer to the date.", "The Midterm Exam is a case exam.", "You are expected to select and apply appropriate analytical models and communication skills to address the case role and requirement.", "The Final Exam is a 2.5-hour in person case exam and will cover all 11 modules of the course.", "Both the midterm and the final exam will require you to have a working laptop to complete.", "A separate Instruction sheet will be issued prior to the exam providing further details.", "A written request must be submitted that indicates your reasons for believing that the case solution was improperly graded.", "Notice of Recording", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "Submission Times", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 23, "course_code": "BIOL 130", "course_name": "BIOL130 - Introductory Cell Biology (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "An introduction to the concepts of cell biology with emphasis on (1) the structural organization of the cell and (2) the function of critical molecular processes that are characteristic of living organisms.", "Explain the fundamental elements of cells, the chemistry of life, and the major classes of biological macromolecules.", "Describe metabolism, the role of enzymes in chemical reactions, and how cells can capture, and utilize, energy.", "Explain how cells respond to signals and form cellular communities.", "Module 1 - Introduction to Cell Biology & The Cell Theory", "Module 2 - Molecules of Life", "2 Module 3 - Cells and Membranes  In-class case study", "3 Module 4 - Nucleic Acids & Information Flow", "4 Module 5 - Protein Structure, Function & Synthesis  In-class case study", "6 Module 7 - Cellular Respiration In-class case study", "In-class case study", "9 Module 9 - Cell Signalling", "10 Module 10 - Cell & Tissue Form", "and In-class case study", "11 Module 11 - DNA Replication & Cell Division Case study due", "12 Module 11 - DNA Replication & Cell Division  Term Test 1", "Official Grades and Course Access", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each module for the achieve assignments and term tests.", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines", "Library for research-based assignments"]}]