[{"course_id": 19, "course_code": "STAT 331", "course_name": "STAT331 - Applied Linear Models (0.50)", "term_name": "Required Courses", "program_name": "Applied Mathematics", "program_id": 7, "major_id": 7, "major_name": "Engineering Specialization", "topics": ["Notice of Recording", "Applied Linear Models Winter 2025", "08:30AM - 09:50AM MC 4020", "02:30PM - 03:20PM", "RCH 101", "Thursdays from 3:00-4:00pm in M3 3021", "Modelling the relationship between a response variable and several explanatory variables (an output-input system) via regression models.", "Model diagnostics and improvement.", "Algorithms for variable selection.", "Review of basic Normal theory, t, chi-squared, and F distributions.", "Simple linear regression.", "Analysis of variance.", "Multiple linear regression, variable selection techniques, indicator variables, diagnostics.", "Brief introduction to non-linear regression, factorial experimentation.", "Registered students can enroll in the class discussion board through Piazza.", "Search for your question first before posting.", "Do not expect a full solution to your question.", "To help maintain a safe, respectful, and productive community in which we – students and teaching team alike – can take risks in our learning/teaching, tackle challenging concepts, and ultimately grow as learners, we should endeavor to follow these mutual expectations:", "Explain the main concepts of linear regression models.", "Understand the methods of least squares and maximum likelihood estimation for model parameters.", "Interpret the model and its parameters (e.g., regression coefficients) in the context of any application.", "Draw inferences from a fitted model about the parameters of interest and make predictions.", "Apply the previous two outcomes when fitting linear models to real data using R.", "Assess model quality by diagnosing violations in underlying model assumptions (and identify strategies for improvement).", "Evaluate competing fitted models built using various model selection methods (and choose between them).", "Introduction", "The Straight Line Model", "Model formulation and interpretation", "Least squares estimation", "Mean response and residual variance estimation", "Introduction to R/RStudio", "Maximum likelihood estimation", "Estimators and their properties", "Important distributions", "Distributions of estimators", "Confidence intervals", "O - Ch. 2-4", "Straight Line Model in R", "Prediction intervals", "Intervals in R", "Hypothesis testing", "O - Ch. 4-5", "ANOVA and F test", "Model limits", "Data transformations", "O - Ch. 4-6", "O - Ch. 7", "A1 and Q1 Solutions", "Multivariate normal distribution", "The Linear Model", "Examples", "O - Ch. 8-9", "Estimation", "Estimators and their properties", "Distributions of estimators", "O - Ch. 9, 11, 12", "ANOVA and F test", "Significance tests", "General linear hypothesis", "O - Ch. 9, 11, 12", "A2 and Midterm Solutions", "Case Study: South African heart disease", "Nested models", "Additional sum of squares", "O - Ch. 12", "Outliers", "O - Ch. 13-14", "Influence", "O - Ch. 14-15", "A3 and Q2 Solutions", "One-variable-at-a-time selection methods", "Criteria-based selection methods", "O - Ch. 16", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solve exercises from the textbook on your own.", "Introduction to Regression Modeling by Abraham and Ledolter This textbook is an optional reference book (available for free on LEARN).", "R and R-Studio Free software.", "To serve as an opportunity to demonstrate your understanding, application, and integration of the course material, including practical application of the skills/concepts with the statistical software, R.", "Missed Assignment: The time window to complete these assessments are generous and, in general, a sickness lasting a couple of days will not be enough of a reason to ask for alternative accommodations and/or extension.", "Tips for Success", "Students should critically compare their work with available solutions and against the solutions of fellow classmates.", "Notice of Recording", "To help you decide if you should isolate, you can use the provincial self-assessment tool.", "In the scenario where we must transition back online the following contingencies will be used:", "These materials are made available for the personal use of students registered in the current offering of this course.", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical proofs and the fitting, interpretation, and assessment of linear models in real applications.", "Library for research-based assignments"]}, {"course_id": 23, "course_code": "ECE 486", "course_name": "ECE486 - Robot Dynamics and Control (0.50)", "term_name": "Required Courses", "program_name": "Applied Mathematics", "program_id": 7, "major_id": 7, "major_name": "Engineering Specialization", "topics": ["Robot Dynamics and Control Spring 2024", "ECE 486 / ECE 780", "ECE 486 001", "ECE 486 101", "08:00PM -", "ECE 486 201", "ECE 780 001", "ECE 486:", "Introduction to the study of robotics focusing on the mechanics and control of serial manipulators.", "Topics include rigid body motion, forward and inverse kinematics, differential kinematics, forward and inverse dynamics, trajectory generation, motion planning, and feedback control.", "This course will introduce students to dynamic modeling and control techniques for robotic systems, and expose them to some cutting-edge research.", "Dynamics of manipulators", "Optimization-based robot control", "May 7 Introduction to robot dynamics and control", "May 23 Dynamic model of manipulators 6 [", "CONTROL OF MANIPULATORS", "Jun 27 Control of driftless systems 14", "Jul 4 Control of differentially flat systems 14", "OPTIMIZATION-BASED ROBOT CONTROL", "Jul 18 Invariance and control barrier functions 4 [", "The lecturing deliverable will consist in a 15-minute presentation of a topic not covered in class and independently studied.", "Magnus Egerstedt, Robot Ecology: Constraint-Based Design for Long-Duration Autonomy, Princeton University Press, 2021 No", "ECE 486", "The project will consist of a mobile manipulation task using the DJI RoboMaster EP programmed in", "The code developed to complete the project", "The reports must be formatted using", "The project will consist of the solution to a problem in the student’s research area using the techniques", "– Section II: Novelty and/or impact", "– Section III: How robot dynamics and control techniques play a key role", "– Section V: Metric for success", "– Section I: Introduction", "– Section III: Materials and methods", "The code developed to complete the project"]}, {"course_id": 24, "course_code": "SYDE 544", "course_name": "SYDE544 - Biomedical Measurement and Signal Processing (0.50)", "term_name": "Required Courses", "program_name": "Applied Mathematics", "program_id": 7, "major_id": 7, "major_name": "Engineering Specialization", "topics": ["Biomedical Measurement and Signal Processing Winter 2024", "01:30PM - 03:20PM", "steven.pretty@uwaterloo.ca", "Email: spretty@uwaterloo.ca", "Signal processing techniques will be discussed in the context of extraction and application of useful biomedical signals.", "Prereq: One of BIOL 273, BME 284, SYDE 384/584; Level at least 3A Biomedical Engineering or Level at least 3B Systems Design Engineering or Level at least 3B Honours Life Physics (Biophysics Specialization)", "Understand and describe theoretical concepts underlying biomedical signal acquisition and analysis (CEAB 1)", "Solve problems and perform investigations utilizing biomedical signal measurement and analysis approaches (CEAB 2 & 3)", "Work in a team to effectively communicate biomedical signal concepts and applications in both verbal presentations and written reports (CEAB 6 & 7)", "Knowledge Base Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "2. Problem Analysis An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "7. Communication Skills An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Three hours of lectures per week, which will cover the pertinent theoretical concepts and provide solutions to relevant exercises:", "N/A Jan 11th Introduction & Overview", "4 Jan 18th Mathematical Model of a Spiking Neuron", "7 Jan 25th Electrode-Electrolyte Interfaces & Half-Cell Potentials", "8 Jan 25th Electrode-Electrolyte Interfaces & Half-Cell Potentials", "Electrode Model & Electrode-Skin Interface", "Op-Amps & Bio-Potential Amplifier Design", "Op-Amps & Bio-Potential Amplifier Design", "Coupling to the Environment & Electrical Safety", "20 Mar 1st EMG Introduction", "23 Mar 8th EMG Decomposition", "25 Mar 14th Myoelectric Control & Pattern Recognition", "26 Mar 15th EMG Driven Musculoskeletal Modelling", "27 Mar 21st Heart Anatomy and Function", "28 Mar 21st Heart Conduction System and ECG", "Apr 8th Reserved for Make-Up Presentations", "Dayan & Abbott (2001)", "Theoretical Neuroscience", "Clifford (2006) Advanced Methods and Tools for ECG Data Analysis", "Rowan & Tolunsky (2003) Primer of EEG with a Mini-Atlas", "An Introduction to the Event-Related Potential Technique", "These tests will be non-cumulative and assess the following content:", "A help session for each assignment will be scheduled during the tutorial time most closely corresponding with the conclusion of a module.", "Presentations should be ~15 minutes in length followed by up to 5 minutes of discussion.", "Include ‘SYDE544’ and a description of the email in the subject line", "Include your first and last name as well as student number in your signature", "This course includes the independent development and practice of specific skills, such as generating summaries of scientific literature.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 30, "course_code": "CHE 312", "course_name": "CHE312 - Mathematics of Heat and Mass Transfer (0.50)", "term_name": "Required Courses", "program_name": "Applied Mathematics", "program_id": 7, "major_id": 7, "major_name": "Engineering Specialization", "topics": ["Mathematics of Heat and Mass Transfer Winter 2025", "CHE 312", "CHE 312 001", "10:30AM - 12:20PM DWE 3516", "E. Boghaert", "10:30AM - 11:20AM DWE 3516", "CHE 312 101", "11:30AM - 12:20PM DWE 3516", "E. Boghaert", "Eline Boghaert (eline.boghaert@uwaterloo.ca)", "Vector form of the microscopic thermal energy balance for solids and incompressible fluids.", "Mass and heat transfer models leading to ordinary differential equation problems in Cartesian, cylindrical and spherical geometries; types of boundary conditions.", "Bessel functions.", "Analytical solution of linear partial differential equations: combination of variables, separation of variables and Sturm-Liouville theory, Laplace transform.", "Mass and heat transfer models leading to linear partial differential equations: 1D transient diffusion and conduction in Cartesian, cylindrical and spherical geometries; steady-state 2D conduction and diffusion.", "View requirements for CHE 312", "Create simple mathematical models of heat and mass transport on the basis of justifiable assumptions and your understanding of the physical situation (i.e. modes of transport, geometry, boundary and initial conditions, etc.)", "Develop analytical solutions to these models [", "Apply these solutions to quantify heat and mass transport rates [", "2b", "Critique the performance of these models [", "Work in a team to model and design a solution to a heat transfer problem of interest [2b, 4a, 4b, 4c].", "Write a technical report describing a model developed to describe a heat transfer problem of interest [", "7b", "Note numbers in brackets refer to the related chapters in the recommended textbook.", "Develop and solve one-dimensional steady state heat transfer models.", "Develop and solve one-dimensional steady state heat transfer models.", "Develop and solve one-dimensional steady state mass transfer models.", "Develop and solve two-dimensional steady state mass transfer models.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 34, "course_code": "CHE 331", "course_name": "CHE331 - Electrochemical Engineering (0.50)", "term_name": "Required Courses", "program_name": "Applied Mathematics", "program_id": 7, "major_id": 7, "major_name": "Engineering Specialization", "topics": ["Electrochemical Engineering Winter 2025", "CHE 331", "01:30PM - 03:20PM", "CHE 331 101", "Topics and applications of electrochemistry and electrochemical engineering.", "Thermodynamic and kinetic aspects of corrosion.", "Electrochemical energy conversion and storage.", "View requirements for CHE 331", "Extend chemical thermodynamics to electrochemical systems.", "Use thermodynamics to predict when a reaction can happen and to describe the activation overpotential of electrokinetic processes.", "Design electrochemical cells and reactors for electrolysis and galvanic processes under given conditions.", "Design and assess corrosion mitigation strategy to extend the lifetime of materials/parts.", "cells, Faraday's law ,current efficiency and electrochemical CSTRs 5-7", "10   8 Current and next-generation battery technologies 19-20", "There final quiz will be during the examination period (April 8th to 25th)", "The most useful textbook in the context of learning fundamental electrochemistry is Bard & Faulkner, Electrochemical Methods: Fundamentals and Applications and also, Electrochemical Science and Technology by Oldham, Myland and Bond was used as a reference for part of the lecture material.", "IMPORTANT:   You cannot fail quiz component and still be given a passing mark in the course.", "Intellectual property includes items such as:", "Graduate Attribute Program Indicators", "A knowledge base for engineering: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "1a Demonstrate understanding of concepts in mathematics.", "1b Demonstrate understanding of concepts in natural science.", "1c Demonstrate understanding of engineering fundamentals.", "1d Demonstrate understanding of specialized engineering knowledge.", "2. Problem Analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "3a Create investigative studies of complex engineering problems.", "3b Gather information from relevant sources to address complex engineering problems.", "4. Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "4a Define design requirements and specifications for complex, open-ended engineering problems.", "4b Critically evaluate and compare design choices.", "7. Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "8a Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Impact of Engineering: An ability to analyze social and environmental aspects of engineering activities.", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "10a Identify ethical and unethical behavior in professional situations.", "10b Identify how an engineer is accountable to multiple stakeholders in engineering practice.", "Life-long Learning: An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge.", "12a Identify gaps in their knowledge, skills and abilities."]}, {"course_id": 36, "course_code": "CHE 361", "course_name": "CHE361 - Bioprocess Engineering (0.50)", "term_name": "Required Courses", "program_name": "Applied Mathematics", "program_id": 7, "major_id": 7, "major_name": "Engineering Specialization", "topics": ["03:30PM - 05:20PM", "03:30PM - 04:20PM", "04:30PM - 05:20PM", "Introduction of biological systems for the production of commercial goods and services, e.g., foods, pharmaceuticals, chemicals, fuels, diagnostics, waste treatment, and biomaterials.", "Introduction to design of bioprocess systems, including biosafety and sustainability.", "Development of reaction kinetics associated with biological systems.", "Development of material balances for key constituents in bioreactors operated in different modes, e.g., batch, fed-batch, continuous stirred-tank reactor (CSTR), perfusion, recycle.", "Introduction to mass and heat transfer considerations for bioreactors.", "Dynamic simulation of cultures defined by ordinary differential equations.", "Introduction of downstream processes associated with biological systems and recovery of biological products.", "View requirements for CHE 361", "Understand enzyme kinetics and derive enzyme kinetic equations based on associated biological information", "Model bioreactor for enzymatic reactions", "Understand how cells replicate with bioproduct formation", "Model bioreactor for cell cultivation and bioproduct formation", "Demonstrate competence in the fundamental concepts of biological sciences and biochemical/bioprocess engineering, including biomolecules, biocatalysts, metabolic pathways, enzyme functions/kinetics, cell behaviors and growth kinetics, bioreactor systems for enzymatic reactions and cell cultivation.", "Apply biological and chemical engineering concepts to design and analysis of bioreactor systems, including mass balance, bioreactor types, bioreactor configurations, bioreactor operation, bioreactor control, bioreactor modeling, bioreactor optimization etc. (2a; 2b; 2c; 4a; 5a; 11b)", "•Week 1: Bioprocess introduction and biological background review", "•Week 2: Enzyme kinetics introduction", "•Week 3: Enzyme kinetics modeling", "•Week 4: Bioreactor modeling for enzymatic reaction", "•Week 6: Enzyme inhibition kinetics", "•Week 7: Enzyme inhibition kinetics (continued) and other enzyme kinetics", "•Week 8: Cell growth biology and cell cultivation", "•Week 9: Cell growth kinetics", "•Week 10: Bioreactor (batch) modeling for cell cultivation and bioproduction", "•Week 11: Bioreactor (CSTR) modeling for cell cultivation and bioproduction", "•Week 12: Stoichiometric modeling of cell cultivation and bioproduction", "Bioprocess Engineering (Basic Concepts) No 173.59"]}, {"course_id": 8, "course_code": "MATH 118", "course_name": "MATH118 - Calculus 2 for Engineering (0.50)", "term_name": "1B Term", "program_name": "Architectural Engineering", "program_id": 9, "major_id": 1, "major_name": "Architectural Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:30AM - 11:20AM RCH 110", "02:30PM - 03:20PM", "RCH 306", "09:30AM - 10:20AM RCH 105", "RCH 306", "10:30AM - 11:20AM RCH 103", "RCH 204", "02:30PM - 03:20PM", "02:30PM - 04:20PM MC 4060", "Monday -", "Monday", "Linear and separable first order differential equations, applications.", "Parametric curves and polar coordinates, arc length and area.", "Get experience in writing well-organized and readable mathematical solutions, so that you will be able to communicate mathematical or technical ideas.", "Select an appropriate integration technique and apply it to solve indefinite or definite integrals.", "Find a power series representation of a function and find a closed form for a function represented by a power series.", "Understand the formal definition of the limit of a sequence and use it to prove basic limits.", "Understand the principle of mathematical induction and use it to prove some mathematical statements.", "Integration by substitution (review)", "Integration by parts (review)", "Trigonometric integrals", "Trigonometric substitution and completing the square", "Partial fractions", "Numerical integration", "Error bounds for numerical integration", "Improper integrals", "First make up lecture occurs", "Separable DEs, linear first-order DEs", "Applications of DEs", "Sequences, limits of sequences", "Recursively-defined sequences, mathematical induction", "Appendix A", "Integral test, p-series", "Comparison tests", "Second make up lecture occurs", "-", "Winter reading week", "-", "Absolute vs. conditional convergence", "Ratio and root tests", "Estimating sums", "Power series", "Taylor and Maclaurin series", "Sums of power series", "Applications of series", "Parametric equations", "Polar coordinates, polar curves", "Area and arc length of polar curves", "In particular:"]}, {"course_id": 10, "course_code": "CIVE 123", "course_name": "CIVE123 - Electrical Circuits and Instrumentation (0.50)", "term_name": "1B Term", "program_name": "Architectural Engineering", "program_id": 9, "major_id": 1, "major_name": "Architectural Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electrical Circuits and Instrumentation Winter 2025", "Monday, Friday -", "10:00AM - 11:20AM RCH 302", "Duty", "E-mail", "Function and characteristics of basic electrical transducers.", "Basics of data acquisition.", "Demos for circuit basics: https://youtube.com/playlist?list=PLDkq31epwdjxzg5AHIOsDk0dry4lAW5Sl", "3 1&2 Current, Voltage, Power and Energy,", "4 2&3 Basic resistive circuit techniques", "9 6 Operational Amplifiers", "10 7 Capacitors and inductors", "12 9 AC Circuit Analysis - I"]}, {"course_id": 18, "course_code": "COMMST 191", "course_name": "COMMST191 - Communication in the Engineering Profession (AE, CIVE, ENVE, GEOE) (0.50)", "term_name": "2A Term", "program_name": "Architectural Engineering", "program_id": 9, "major_id": 1, "major_name": "Architectural Engineering (Bachelor of Applied Science - Honours)", "topics": ["jclausen@uwaterloo.ca (please do not use the D2L email system)", "I monitor my email M-F, 9:00 am - 5:00 pm.", "I am teaching multiple communication courses, and especially early in the sememster, I cannot always quickly know whch course you are referring to just from your email.", "In this course students in Architectural, Civil, Environmental, and Geological Engineering will enhance oral and written communication competencies in contexts relevant to the engineering profession.", "In this course, you will work to enhance your written and oral technical communication competencies in contexts relevant to the engineering profession as well as to your future career.", "More generally, in this course, you should anticipate learning what professional norms of technical communication and dominant forms of sharing knowledge prevail within and across the fields of engineering.", "Yet this course also attempts to impart awareness and appreciation for how these communicative forms are matters of social context and sites of negotiation and contestation.", "By extension, this progression also encourages you to find a place and voice in the conversations within your fields of study and to reflect upon the meaning and shape of available forums for technical communication.", "I perceive our classroom as a co-constructed space, in which readings and discussions may frequently challenge your attitudes, your unconsciously held beliefs, or your positions on current issues.", "To ensure a safe and open space in which all can converse and learn productively, it is vital that we conduct our relationships with respect and an ethic of care.", "Describe and apply conventions, genres, norms, and values of communication in an engineering discipline;", "Compose persuasive, audience-specific technical arguments;", "Analyze and summarice technical content in clear and concise ways;", "Deliver effective oral presentations; and", "Appraise and reflect on their own compositions, and those of their peers, to strategically revise and edit documents and presentations", "Objectives for Students of Communication Studies", "You (students) will understand the complexity of communication as a human process of shared meaning-making in the context of power, history, and culture.", "You will increase your capacity to recognize and enhance yours and others’ agency – the ability to make a difference in the world for yourself and others – and understand the implications of your communication behaviors for yourself and others.", "Recognize diverse linguistic practices and modes of communication as resources for writers and speakers.", "You will understand communication as a practice, and improve your critical and creative communication competencies by developing your ability to use writing, speaking, and other media of communication to create effective and engaging artifacts.", "Your will reflect on your role in fostering the public good (the multifaceted well-being of individuals and groups), begin to imagine a better future, and make decisions in your communication that can transform the communities to which you belong.", "Introduction to Communication/What is this course about?", "Audience Analysis", "Demographics and Professional Audiences", "Researching and Describing Technical Subjects", "Chapter 11: Technical Definitions and Descriptions", "In-class Oral Proposals", "Document Design and Models of Communication", "Feb 15-21  R    E    A    D    I    N    G      W    E    E    K", "March 4: Research Abstract", "Stakeholder Analysis and Persuasion", "“Identifying and Analyzing Stakeholders and Their Interests” (Online)", "Nov. 14:  Stakeholder Analysis In-class Activity", "Ethics", "Joy Buolamwini, “How I’m Fighting Bias in Algorithms,” TED (Video)", "Engagement and contribution is demonstrated in a number of ways.", "At the end of the term you will have a chance to make the case for what grade you believe you should receive with a self-assessment.", "Did I contribute something for each of the activities (if any) listed for that week?", "Did I make my contributions available to my peers in a timely manner that they can respond and engage with it?", "In this assignment, you will choose a specific topic related to civil engineering and identify an overarching problem to produce a project proposal.", "In this assignment you will creating a proposal in response to an imagined request for proposals (RFP) from a contractor in the industry, and presenting that proposal in a short three-minute pitch for your classmates, who will consider the persuasiveness of your proposal.", "Failures of retaining walls", "Failures of suspension bridges", "Importance and justification of arches", "Role of surveying in engineering", "In groups of 2 or 3, you will provide a technical summary of that element for a public, non-specialist audience.", "You will present a summary of the project element as a poster presentation on a standard 24x36 inch poster board using a combination of written and graphic communication.", "We may be involved in a public displaying of the posters we create, alongside students from other sections of Engineering Communication on evening in February over in one of the Engineering buildings.", "Part 2: Research Abstract", "The abstract should provide information relevant to solutions to the problem you articulated in your proposal and continue to advocate for a particular solution/recommendations.", "For the final project you will create a policy brief aimed at a clear stakeholder audience.", "Instructions", "A formal policy brief includes the following sections:", "Executive summary", "Explanation of results", "identify and address a specific policy-making audience", "explain the current research on this topic in clear, non-technical language", "highlight the features of the research most relevant for policy makers and stakeholders", "make one or two recommendations based on your synthesis of the research", "Natural Resource Development", "Climate Change Impact", "Mass Transportation Design", "Communicative competencies will play a significant role in distinguishing the most successful engineers from others who are equally skilled technicians but who lack the ability to communicate effectively.", "You will hand-in a 200 word individual reflection on the process of translating engineering concepts for a public non-expert audience.", "You should reflect on what skills, competencies and concepts you used in creating your final project.", "What do you think are your strengths and weaknesses in communicative competencies?", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 37, "course_code": "BIOL 130", "course_name": "BIOL130 - Introductory Cell Biology (0.50)", "term_name": "Natural Science List", "program_name": "Architectural Engineering", "program_id": 9, "major_id": 1, "major_name": "Architectural Engineering (Bachelor of Applied Science - Honours)", "topics": ["S. Ruffell", "An introduction to the concepts of cell biology with emphasis on (1) the structural organization of the cell and (2) the function of critical molecular processes that are characteristic of living organisms.", "Explain the fundamental elements of cells, the chemistry of life, and the major classes of biological macromolecules.", "Describe metabolism, the role of enzymes in chemical reactions, and how cells can capture, and utilize, energy.", "Explain how cells respond to signals and form cellular communities.", "Module 1 - Introduction to Cell Biology & The Cell Theory", "Module 2 - Molecules of Life", "2 Module 3 - Cells and Membranes  In-class case study", "3 Module 4 - Nucleic Acids & Information Flow", "4 Module 5 - Protein Structure, Function & Synthesis  In-class case study", "6 Module 7 - Cellular Respiration In-class case study", "In-class case study", "9 Module 9 - Cell Signalling", "10 Module 10 - Cell & Tissue Form", "and In-class case study", "11 Module 11 - DNA Replication & Cell Division Case study due", "12 Module 11 - DNA Replication & Cell Division  Term Test 1", "Official Grades and Course Access", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each module for the achieve assignments and term tests.", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines", "Library for research-based assignments"]}, {"course_id": 38, "course_code": "BIOL 150", "course_name": "BIOL150 - Organismal and Evolutionary Ecology (0.50)", "term_name": "Natural Science List", "program_name": "Architectural Engineering", "program_id": 9, "major_id": 1, "major_name": "Architectural Engineering (Bachelor of Applied Science - Honours)", "topics": ["Organismal and Evolutionary Ecology Fall 2023", "11:30AM - 12:20PM RCH 101", "Learn Discussion Board", "Email and Appointment Requests", "Coverage includes hypothesis testing and the nature of scientific inquiry, basic population genetics, physiological ecology, life histories, dispersal, basic population and community ecology, macroevolution, systematics and classification, as well as functional morphology.", "The theory of evolution unites the whole of biology and all living organisms into a coherent body of knowledge, allowing comparisons across all forms of life.", "Ecology describes how organisms interact with their environment and each other to create interdependent systems from microscopic to global scales.", "These disciplines are fundamentally tied together: evolution is the primary mechanism by which species adapt to their environment; ecological interactions and environmental variability drive natural selection.", "You will also carry out simulated lab assignments to test the principles of evolution, design ecological experiments to test alternate hypotheses about the conservation of species and manipulate demographic parameters to test their influence on population growth.", "Understand the principles of scientific methodology", "Define ecological and evolutionary terms, such as the niche, adaptation, and altruism", "Illustrate these mechanisms in the context of course examples", "Explain how ecological interactions and evolution are interconnected", "Sign code of conduct and upload to LEARN.", "2) Sept 8 Evolution for Ecology Section 1: Evolution and Ecology are Intertwined", "4) Sept 13 Evolution for Ecology", "5) Sept 15 Evolution for Ecology Section 3: Genetics and Evolution", "6) Sept 18 Evolution for Ecology Section 4: Managing the Evolution of Resistance", "9) Sep 25 Physiological Ecology Section 1: Trade-offs and Species Distributions", "15) Oct 9-13 Holiday – No classes Understanding Experimental Design Simulation due by Oct 16, 11:59 pm", "16) Oct 16 Empiricism in Ecology Understanding Experimental Design Simulation due by 11:59 pm (best 2/3 for 10%)", "It is important that you review the information below before you subscribe to the SimUText for Organismal Ecology and Evolution - Chapters at University of Waterloo.", "SimUText Application Installers", "SimUText Application Installers", "At the end of every unit, you will work individually to develop a concept map using Cmap Cloud to visually display the relationships among what you consider the key concepts in the unit.", "These should represent your personal comprehension of how the concepts relate to each other, and no two should be identical.", "Also, class will entail a lot of discussion that won’t be represented in PPT slides.", "The simulations include one on Evolution in Ecology, one on Experimental Design in Ecology and one on Population Growth.", "The learning outcome for the unit tests is to demonstrate your recall and comprehension of the material covered in the units and to incentivize keeping up with the readings and attending lectures and reviewing for the final exam.", "The learning outcome is to demonstrate recall, synthesis and integration of material learned during the course.", "The final exam will consist of multiple-choice, T/F, solve the equation type of questions and integration questions that are designed to test your basic and deeper understanding of the course concepts.", "Important note regarding tests and exams", "Unit tests will be completed for the first 4 units of the course.", "Ensure you have a reliable internet connection and functional computer to complete them – technical challenges encountered during remote completion are not an excuse for missed tests.", "I will have a limited number of printed back-ups for students in class who experience technical difficulties.", "You will need to have a reliable internet connection and functional computer to complete the exams.", "Emails can be received 24 hours per day.", "If you miss a make-up exam for any reason, you will be given a DNW, and must petition the Associate Dean of Science if you feel you missed it for a valid reason.", "At the discretion of the instructor, you may be permitted to write a make-up exam.", "The timing will be conveyed to you via e-mail if you are eligible for a make-up.", "If you follow these steps,", "I will consider granting an extension", "Students are responsible for their own behavior and should be mindful of the impact that their actions have on the wellbeing of others.", "Act in a respectful and open manner when listening to the views and ideas of others.", "Participate fully in the discussion boards: make sure your answers are to the best of your ability and that you respond to others’ posts.", "Signature"]}, {"course_id": 39, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "Natural Science List", "program_name": "Architectural Engineering", "program_id": 9, "major_id": 1, "major_name": "Architectural Engineering (Bachelor of Applied Science - Honours)", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}, {"course_id": 40, "course_code": "BIOL 273", "course_name": "BIOL273 - Principles of Human Physiology 1 (0.50)", "term_name": "Natural Science List", "program_name": "Architectural Engineering", "program_id": 9, "major_id": 1, "major_name": "Architectural Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "10:00AM - 11:20AM M3 1006", "M. Bording-Jorgensen", "Dr. Vivian Dayeh - Tuesdays 11:30 am -12:30pm in B1-277.", "The physiology of major organ systems of the human body.", "Topics include neurophysiology and peripheral nervous system, muscle, the cardiovascular system, the components of blood, respiratory system, and immune system.", "The combination of BIOL273 and BIOL373 covers all of the major topics of human physiology.", "Identify the components/structures of the following organ systems: nervous, muscular, cardiovascular, respiratory, and immune.", "Describe how these five organ systems are organized in the human body.", "Explain the function of each of these five organ systems.", "Demonstrate the integration of these five organ systems in maintaining homeostasis.", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Section 001 - 10:00AM", "Section 001 - 11:20AM", "Official Grades and Course Access", "Corresponding Silverthorn textbook chapters in parentheses for each unit.", "This unit serves as an introduction to the study of the function of the five organ systems examined in this course (nervous, muscular, cardiovascular, respiratory, and immune).", "Unit 1 will introduce how the organ systems work together to maintain homeostasis within the body.", "The organization of the nervous system will be explored in this unit.", "The types of cells found in the central and peripheral nervous system serve as a starting point to discuss their function within the nervous system.", "Initially gross structure of skeletal muscle including the structure of a muscle fibre and myofibrils will be examined.", "An exploration into the muscle contraction mechanism via excitation-contraction coupling will be examined to explain how muscles work.", "This unit will start with an introduction into the heart and components of the cardiovascular system, which will be followed by cardiac muscle contraction mechanism.", "In this unit we will examine the structure and function of the respiratory system, incorporating gas laws and ventilation.", "Pulmonary function through lung compliance and elastance as well as the control of ventilation will be examined.", "This unit will start with the general function of immune system and introduction to the types of pathogens that infect the body.", "The anatomy of the immune system will be discussed returning to the role of haematopoiesis.", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each unit for the assignments and term tests.", "Required for the Mastering A&P Online Assignments and Dynamic Study Modules.", "Course website Waterloo Learn https://learn.uwaterloo.ca - includes general course information, language of physiology online assignment, review sheets for each unit, and links to the Mastering A&P Online Assignments.", "Emails can be received 24 hours per day.", "Students should carefully consider the wisdom of missing a test or assignment.", "Mastering A&P assignments handed in late will receive a deduction of 5%/day for the first five late days after which a grade of zero (0) will be recorded.", "Notice of Recording", "Don’t waste your time with these requests!", "Expectations for Change", "This course includes the independent development and practice of specific skills, such as multiple choice question creation.", "Library for research-based assignments", "Disability-related Policies"]}, {"course_id": 41, "course_code": "CHE 161", "course_name": "CHE161 - Engineering Biology (0.50)", "term_name": "Natural Science List", "program_name": "Architectural Engineering", "program_id": 9, "major_id": 1, "major_name": "Architectural Engineering (Bachelor of Applied Science - Honours)", "topics": ["09:30AM - 10:20AM RCH 110", "08:30AM - 09:20AM", "Friday -", "Friday", "10:30AM - 12:20PM", "•Chemical Engineering", "•Office hours: 2.30 pm-3.30 pm Mondays, can also be scheduled upon email request", "Introduction to basic concepts of biochemistry and cell biology.", "Properties and functions of biopolymers.", "Elements of cell structure and diversity, and relationship of biochemistry with cell metabolism.", "View requirements for CHE 161", "1) Demonstrate a basic understanding of biochemistry, cell biology and molecular biology (1b)", "2) Converse at a fundamental level with scientist and engineers that use biology and biotechnology (1b)", "5) Identify societal, safety and ethical concerns surrounding biotechnology.", "Biomolecules", "1.1 Sugar and Polysaccharides", "1.2 Fatty acids and derived polymers", "1.3 Amino acid and Proteins", "1.4 Nucleotides and Nucleic acids", "2.1 Life definition and classification", "2.2 Cell structure and reproduction", "2.3 Bioproduction", "3.2 Sugar metabolism", "3.3 Fatty acid metabolism", "3.4 Protein metabolism", "3.5 Enzyme kinetics", "4.1 Central Dogma"]}, {"course_id": 47, "course_code": "ENVS 200", "course_name": "ENVS200 - Field Ecology (0.50)", "term_name": "Natural Science List", "program_name": "Architectural Engineering", "program_id": 9, "major_id": 1, "major_name": "Architectural Engineering (Bachelor of Applied Science - Honours)", "topics": ["Field Ecology Winter 2025", "**We aim to respond to forum posts and necessary emails within general workday hours (8:30 AM – 4:30 PM) and within 24hrs, except over weekends and holidays.", "Introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "View requirements for ENVS 200", "Such knowledge, called ecoliteracy, will provide a critical basis for your engagement in the 21st century, the “century of the environment”—not least because so many of the environmental issues we face derive in part from a limited understanding of how we are embedded within and dependent upon ecological systems.", "Field ecology necessarily harbours an ethical component both because of our natural affinity for life (or ‘biophilia’) and because questions of ecological ‘impact’ and 'quality’ are necessarily value-laden.", "In summary, this course introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "By the end of this course, you should be on a path to life-long learning as an ecologically-literate citizen.", "Demonstrate how these principles apply to real-world situations (in context of lab activities, assignments, and labs), including human interactions with the natural world.", "Articulate the elements of scientific inquiry as they apply to ecology/", "These course learning outcomes will not only prepare you to be an informed citizen and member of the community of life on earth, but also provide the basis for knowledge, humility, and wisdom in your dealings with ecological problems in your daily life and eventual career.", "Week Number", "Introduction and indicator species: Bird identification Lab 1:  Survey completed and submitted in lab (2%)", "3. Jan 21 *Conditions and Resources; Climate and Biomes", "You should review the course “reading guide” in LEARN before reading because you are not responsible for all textbook sections and vocabulary.", "demonstrate how these principles apply to real-world situations, including human interactions with the natural world Readings, Labs, Discussion board Weekly lecture quizzes and activities, exams, lab activities, discussion forums", "These experiences are intended to help you apply ecological concepts in real-world contexts while building valuable field skills.", "Simply missing a deadline and later mentioning registration with Accessibility Services will not be considered sufficient.", "Appeals and grievance", "Availability for exams", "These slides are meant to be a template for your note-taking: they will not replace careful attention, note-taking and participation.", "Along with the University of Waterloo and the Faculty of Environment and its Departments, I consider your well-being to be extremely important.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "However, there may be instances during lectures where AI usage is allowed after receiving clear verbal permission from the professor.", "Students are responsible for following these guidelines and seeking clarification when needed.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 51, "course_code": "SCI 238", "course_name": "SCI238 - Introductory Astronomy (0.50)", "term_name": "Natural Science List", "program_name": "Architectural Engineering", "program_id": 9, "major_id": 1, "major_name": "Architectural Engineering (Bachelor of Applied Science - Honours)", "topics": ["SCI 238", "SCI 238 001", "Discussions:", "Lecture slides can be found here.", "SCI 238:", "View requirements for SCI 238", "All are welcome!", "5 Tuesday, Jan 21st Light and Matter Chapter 5     Spectral tubes and spectrometers", "Science of \"Interstellar\"", "Order Mastering Astronomy", "No exceptions to these requirements will generally be made in cases where students miss classes or do not complete assignments.", "Library for research-based assignments"]}, {"course_id": 63, "course_code": "CIVE 332", "course_name": "CIVE332 - Civil Systems and Project Management (0.50)", "term_name": "List 1", "program_name": "Architectural Engineering", "program_id": 9, "major_id": 1, "major_name": "Architectural Engineering (Bachelor of Applied Science - Honours)", "topics": ["Civil Systems and Project Management Winter 2025", "10:00AM - 11:20AM MC 2066", "INSTRUCTOR:    Muhammad Bilal, E2-3328 m25bilal@uwaterloo.ca", "E2-3328", "E2-3321", "Introduction to conceptual planning, construction, management, optimization, and life-cycle performance assessment of civil engineering systems including capital projects.", "Fundamentals of decision theory including concepts of risk, uncertainty, utility, probability, value of information, and game theory.", "Tools for supporting decision-making process, including linear and integer programming, network models, optimization, and Monte Carlo simulation.", "Risk- and cost-benefit analysis of public projects and their impact on sustainability, and quality of life.", "Design, model and analyze some civil engineering systems and understand their complexity;", "Choose and effectively apply tools and methods to improve civil engineering systems performance;", "Apply fundamentals of decision analysis, utility and game theory to assess and quantify risk, uncertainty, and expected utility used in decision-support systems;", "Demonstrate the use of project management tools and methods to applications in planning, scheduling, and estimating on engineering projects; and", "Mathematically and numerically formulate, structure and solve optimization problems (single/multiple/linear/integer/non-linear) using multi-criteria decision-making methods, including assessing sensitivity of decisions.", "PART 1 – Systems Theory: Design Methodology", "PART 1 – Systems Theory: Complex Systems + Review", "Linear Programming Intro", "PART 4 – Optimization: Linear Programming", "Multi-objective programming", "Linear programming models of network flow", "Linear programming models of network flow", "Integer and Mixed Integer Programming"]}, {"course_id": 65, "course_code": "ME 452", "course_name": "ME452 - HVAC Load Analysis and Design Fundamentals (0.50)", "term_name": "List 1", "program_name": "Architectural Engineering", "program_id": 9, "major_id": 1, "major_name": "Architectural Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "HVAC Load Analysis and Design Fundamentals Winter 2025", "11:30AM - 12:20PM RCH 305", "Email: hasan.habib@uwaterloo.ca", "Duct design and fan selection.", "Heating and cooling load calculations.", "Infiltration and exfiltration.", "B. Be able to fully design an air conditioning and ventilation system", "C. Be able to perform heating and cooling load, and preliminary energy use calculations for buildings", "D. Have developed the ability to apply their knowledge in a real-world setting (practical experience)", "E. Be capable of communicating effectively with industry professionals and clients", "F. Have developed the skills to research and interpret information needed to remain current in the field", "Module 1: Introduction to HVAC:  History, ASHRAE, Unit Systems (chap.", "Module 2: Air Conditioning and Ventilation: Fundamental Concepts of HVAC/Air Conditioning Systems (chap.", "3), Fans and Air Distribution Systems (chap. 16).", "A tentative checklist of material to be reviewed each week will be posted in Learn.", "Midterm Exam: will be held in two parts during scheduled lecture time.", "You can also present case studies of interesting buildings or even a biographical review of someone who made an impact to HVAC.", "A) Develop an appreciation and understanding for the various codes, standards, and guidelines that determine HVAC design practices X    X", "B) Fully specify and design an air conditioning and ventilation system   X", "C) Perform heating and cooling load, and preliminary energy use calculations for buildings     X", "F) Develop the skills to research and interpret information needed to remain current in the field X", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 74, "course_code": "CIVE 460", "course_name": "CIVE460 - Engineering Biomechanics (0.50)", "term_name": "List 2", "program_name": "Architectural Engineering", "program_id": 9, "major_id": 1, "major_name": "Architectural Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Biomechanics Winter 2025", "02:30PM - 05:20PM", "RCH 301", "Introduction to engineering technologies applicable to the field of biomechanics.", "Specific topics covered may include biological growth, form and function; biomaterials; kinematics and neurology of gait; biotribology; joint anatomy, function and repair; occupational biomechanics; trauma prevention.", "The course will provide a general overview of engineering biomechanics for civil, mechanical and biomedical engineering students.", "2. Conduct gait analysis and calculate forces applied at joints and foot reactions", "Introduction", "Evolution of Biomechanics", "Applications (medical and engineering)", "Musculoskeletal System", "Introduction,", "Anatomical positions & movements,", "System components,", "Gait Biomechanics", "Introduction;", "Muscles forces,", "Bone & Cartilage Biomechanics", "Introduction (highlights & progress),", "Bone mechanical properties & applications;", "Cartilage structure and mechanics", "Tendon & Ligament biomechanics", "Mechanical behaviour", "Biotribology & Joint Replacement", "Biotribology subfields,", "Cancer Biomechanics", "Introduction: cancer stages,", "Mechanical characteristics of cancer cells,", "Biomechanics and cancer treatment,", "Cardiovascular biomechanics, and", "Biomechanics in Radiotherapy", "“Orthopaedic Biomechanics: Mechanics and Design in Musculoskeletal Systems,” Pearson Prentice Hall.", "Biomechanics and motor control of human movement.", "Biomechanics and motor contAl-Mayah, A. (Ed.)"]}, {"course_id": 77, "course_code": "CIVE 596", "course_name": "CIVE596 - Construction Engineering (0.50)", "term_name": "List 2", "program_name": "Architectural Engineering", "program_id": 9, "major_id": 1, "major_name": "Architectural Engineering (Bachelor of Applied Science - Honours)", "topics": ["Construction Engineering Spring 2024", "08:30AM - 09:20AM", "Topics in construction engineering and management including methods of delivering construction, contractual relationships, prevailing construction practices, construction equipment, concrete form design, concrete, steel, and masonry construction, introduction to trenchless technology, construction safety, planning and scheduling of repetitive construction, cash flow analysis, and construction project control.", "Impact of uncertainty", "Impact of planning", "Unique project dynamics of a start and an end", "Importance of basic how-to knowledge", "The natures of the trades", "Planning and scheduling", "Estimating and bidding", "The design and construction process", "Cost estimation", "Construction pricing and contracting", "Construction planning", "Fundamental scheduling procedures", "Advanced scheduling", "Project cost and schedule control", "Understand owner and contractor perspectives in construction project management.", "Plan and schedule small to medium construction projects using CPM and resource constrained methods, and to optimize schedules according to project constraints and objectives.", "Estimate the cost of a small to medium construction project to within +/- 25% of final cost.", "Understand how to identify and manage risks and uncertainty for capital projects.", "Interpret and act on basic cost, schedule and quality reports to control project performance.", "Understand and apply basic ethical judgment and action as a project manager.", "Work and manage work in a safe and healthy way on a typical job site.", "Have some idea where their knowledge ends and what they still need to learn to become construction project leaders.", "The design and construction process", "June 24-28", "Fundamental scheduling procedures  Fundamental scheduling procedures     TBD as term progresses", "chapters 8-10", "Advanced scheduling  Quiz 3      TBD as term progresses", "chapters 8-10", "Advanced scheduling  Advanced scheduling     TBD as term progresses", "Chapters 11-13", "My experience from briefly working as a labourer and equipment operator in early years, to studying projects and project management over several decades, to managing small projects in positions such as a former CEE Department Chair will be used to attempt to connect the theory with the practice.", "This course includes the independent development and practice of specific skills described above.", "The only allowable aid is a basic scientific calculator.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 81, "course_code": "CIVE 484", "course_name": "CIVE484 - Physical Infrastructure Planning (0.50)", "term_name": "List 3", "program_name": "Architectural Engineering", "program_id": 9, "major_id": 1, "major_name": "Architectural Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 11:20AM EV3 1408", "Adam Skoyles - askoyles@uwaterloo.ca", "Samantha Leger - sjleger@uwaterloo.ca", "Please direct these inquiries to the instructor.", "The need for infrastructure and environmental assessments; the impacts of infrastructure on urban form; core infrastructure concepts; economics of infrastructure costs, finance and pricing.", "The role of private sector in providing and maintaining infrastructure is discussed.", "*eligible for MES", "PLAN 684 – Prereq: Academic Level - Graduate", "Introduction", "Have an appreciation for the need for public infrastructure and a general understanding of the history and rationale for infrastructure development.", "Demonstrate a functional understanding of the Environmental Assessment process related to the planning, evaluation, and financing of physical infrastructure investments.", "Connect the impact of political decision-making on infrastructure decisions, and the consequences of inaction.", "Understand the key principles of asset management and importance of life-cycle costing of infrastructure.", "Learning Modes and Expectations", "Sequence of Course Topics & Readings", "Introduction and Course Overview", "Site Development Considerations", "Paying for Infrastructure", "Guest Speaker Reflections – Throughout the term, three (3) guest speakers will be invited to share their real-world experience and expertise on a variety of subjects.", "Students will be responsible to prepare short reflections (400-500 words) on these lectures, succinctly summarizing key messages and demonstrating critical understanding of the subject matter.", "Groups will prepare a project proposal for an infrastructure and planning related topic of their choosing and develop a Terms of Reference to guide their project work.", "The study area and its context (include maps and figures)", "Rationale for the study", "Identification of Key Stakeholders and Consultation approach", "Background and Preliminary Options Report - This Report should respond to the TOR and include at a minimum:", "Purpose of the study", "Summary of methodology", "Consultation Plan and identification of key stakeholders and anticipated issues (make assumptions)", "Detail a monitoring and/or maintenance plan.", "The complete style outline can be found in the Publication Manual of the American Psychological Association, located in the reference section in Dana Porter Library, or on sale in the Book Store.", "APA Frequently Asked Questions - http://www.apastyle.org/learn/faqs/", "University of Wisconsin-Madison Writing Centre: http://www.writing.wisc.edu", "Students do not need to ask the instructor in advance to use these grace days.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 0, "course_code": "BIOL 130", "course_name": "BIOL130 - Introductory Cell Biology (0.50)", "term_name": "Required Courses", "program_name": "Biochemistry", "program_id": 13, "major_id": 1, "major_name": "Biochemistry (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "An introduction to the concepts of cell biology with emphasis on (1) the structural organization of the cell and (2) the function of critical molecular processes that are characteristic of living organisms.", "Explain the fundamental elements of cells, the chemistry of life, and the major classes of biological macromolecules.", "Describe metabolism, the role of enzymes in chemical reactions, and how cells can capture, and utilize, energy.", "Explain how cells respond to signals and form cellular communities.", "Module 1 - Introduction to Cell Biology & The Cell Theory", "Module 2 - Molecules of Life", "2 Module 3 - Cells and Membranes  In-class case study", "3 Module 4 - Nucleic Acids & Information Flow", "4 Module 5 - Protein Structure, Function & Synthesis  In-class case study", "6 Module 7 - Cellular Respiration In-class case study", "In-class case study", "9 Module 9 - Cell Signalling", "10 Module 10 - Cell & Tissue Form", "and In-class case study", "11 Module 11 - DNA Replication & Cell Division Case study due", "12 Module 11 - DNA Replication & Cell Division  Term Test 1", "Official Grades and Course Access", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each module for the achieve assignments and term tests.", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines", "Library for research-based assignments"]}, {"course_id": 1, "course_code": "BIOL 130L", "course_name": "BIOL130L - Cell Biology Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Biochemistry", "program_id": 13, "major_id": 1, "major_name": "Biochemistry (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "STC 4018", "02:30PM - 05:20PM", "STC 4018", "However, we do run multiple labs at the same time which means we may not always be in the office.", "Situation", "Please email Dr. Gurska directly at jola.gurska@uwaterloo.ca", "What does it mean to be a cell biologist?", "One group of scientists might explore growing tissues in a laboratory to one day produce artificial skin or organs.", "No matter what their question, cell biologists use a similar set of laboratory skills that allow them to peek inside the tiniest of biological units that make up the diversity of organisms we see around us.", "Although fundamental techniques like microscopy have hugely advanced since the invention of the light microscope, every cell biologist needs to learn how to properly use a microscope to see cells reliably.", "These can be very tricky to use properly but doing so could be the difference between a world-changing discovery and an experiment that no one can replicate.", "These and other methods that are integral to working in the cell biology field will be introduced in this laboratory and it is my hope that you will leave confident in these fundamental techniques.", "Maintain a well-organized and comprehensive lab book.", "Identify elements of a well-structured laboratory report and write some elements of a lab report.", "Assignment 3 Model Organisms and Experimental Design 3%", "I welcome any inquiries regarding AccessAbility accommodations.", "Some examples of what will be noted includes the following:", "did you complete the bioskills exercises during the first lab?", "did you behave in a respectful and professional manner in the lab?", "Using a micropipette without a tip,", "Holding a micropipette upside down with liquid in the micropipette tip,", "Setting a micropipette precariously close to the edge of the bench so that it may fall on the floor,", "Forcing the pipettes past their minimum and maximum calibrated ranges", "Keeping a thorough lab book is a critical skill learned in a biology laboratory to document key observations and procedures.", "Some reagents will already be set up to use at your bench, while others will be in dispensing bottles on the side bench or in the fume hoods, in which case the liquid must be dispensed directly from the bottles.", "These can be purchased at the W Store Essentials in the STC.", "Since many standard laboratory reagents are volatile, please consider not wearing contact lenses in the laboratory.", "When not in use, stools should be tucked away under-bench and personal items stowed underneath in cupboards.", "Finally, please remember that safety should be a collective concern.", "They will be reviewed at the end of the term for statistical purposes only.", "The goal of the draft submissions is to teach you the capabilities of Turn-it-in analysis and to encourage you to use the software to improve your paraphrasing and referencing.", "Details on how to interpret Turn-it-in reports and use the draft Dropboxes can be found under Content on LEARN.", "As outlined under Quizzes section above, please note that the BIOL 130L online multiple-choice quizzes are designed to be completed in half the time you are given.", "Expectation of Academic Integrity", "This course includes the independent development and practice of specific skills, such as scientific writing and communication.", "Poorly paraphrased information without in-text citation 5 marks off for each", "Poorly paraphrased information with in-text citation 3 marks off for each", "Well paraphrased information without in-text citation 3 marks off for each", "Lab Manual is cited in Results and/or Discussion 1 mark off for each citation", "A reference in the reference list does not have corresponding in-text citations 5 marks off for each", "An in-text citation is not in the reference list 5 marks off for each", "Misconduct; student’s name will be sent to the Associate Dean to check if this is the first misconduct"]}, {"course_id": 3, "course_code": "BIOL 239", "course_name": "BIOL239 - Genetics (0.50)", "term_name": "Required Courses", "program_name": "Biochemistry", "program_id": 13, "major_id": 1, "major_name": "Biochemistry (Bachelor of Science - Honours)", "topics": ["11:30AM - 12:20PM", "10:30AM - 11:20AM STC 1012", "You can!", "Chromosomal mechanisms in mitosis and meiosis.", "Natural selection and the evolution of genetic systems.", "Describe the fundamentals of gene structure, function and transmission in prokaryotic and eukaryotic cells and organisms.", "Describe the various ways mutations can arise and how mutations may affect gene expression and phenotypic outcomes.", "Describe recombinant DNA technology in bacteria and its role in biotechnology.", "Effectively work with others, discussing, evaluating, and communicating genetics concepts and synthesizing ideas in a group.", "Readings", "textbook 1.1-1.2", "Mendelian genetics and probability", "Modification of Mendelian ratios", "textbook 3.2-3.3, 4.2-4.4, 15.1", "Mitosis, meiosis, and chromosome numbers", "DNA and the genetic code", "textbook 9.2-9.3", "T4: Mitosis and meiosis", "DNA cloning", "T5: Testing genetic ratios", "Cancer genetics", "T9: Population genetics", "Exam period", "- write the final exam and achieve a grade of at least 50% on the cumulative test and exam section", "Online learning activities: These activities are designed to test your knowledge of several important concepts explained by the lecture presentations in this course, and should be completed after the portion of the course when they are covered in lecture.", "They are all due toward the end of the term but can be completed as many times as you like to help you work on these concepts.", "Read the instructions carefully before attempting these as a completion quiz (in the quiz section) must also be completed to obtain credit.", "In this case, the weight of the missed submission will be transferred to the final exam.", "The dates affected and degree of incapacitation will be used to determine follow-up action."]}, {"course_id": 4, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "Required Courses", "program_name": "Biochemistry", "program_id": 13, "major_id": 1, "major_name": "Biochemistry (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}]