[{"course_id": 80, "course_code": "STV 305", "course_name": "STV305 - Technology, Society and the Modern City (0.50)", "term_name": "Approved Courses List", "program_name": "Knowledge Integration", "program_id": 95, "major_id": 4, "major_name": "Science, Technology, and Society Specialization", "topics": ["Email: cshelley@uwaterloo.ca.", "Cities may be humanity's most significant invention, where we shape our vision of the civilized life.", "At the same time, the demands of cities shape our lives in fundamental ways.", "The purpose of this course is to examine the technology of civilized life, with the city itself as both a technological system and a scene of technological living.", "View requirements for STV 305", "Describe concepts and perspectives relating to cities as socio-technical systems.", "Analyze and evaluate developments in cities in light of those concepts and perspectives.", "Reflect and communicate analyses of social and ethical aspects of technology and cities.", "Week 11 November 21 Smart cities", "Discussions", "Each student is expected to participate in in-class discussion each week.", "Summaries", "Summaries may be shared with the class to kick-start in-class discussion.", "Self-assessments", "Grade exemptions", "Each student’s lowest discussion mark and exercise mark will be dropped from the calculation of their overall mark in those categories.", "Students are welcome to request regrading of assignments.", "Test conflicts"]}, {"course_id": 3, "course_code": "CHEM 125L", "course_name": "CHEM125L - Chemical Reaction Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and to modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Section", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- analysing real world samples and", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 7, "course_code": "CHEM 254", "course_name": "CHEM254 - Introductory Chemical Thermodynamics (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["08:30AM - 09:20AM", "RCH 306", "B. Power", "Instructor: Bill Power", "An introduction to the first, second, and third laws of thermodynamics and the application of these laws to ideal systems, mixtures, and chemical reactions.", "Thermodynamic principles are used to study changes in state, including phase changes, and to establish the link between the equilibrium constant and the properties of the substances involved in a chemical reaction.", "This course is a basic introduction to thermodynamics with emphasis on applications in chemistry.", "The course provides the necessary background to study changes in state of many physical and chemical systems.", "Define and apply the four laws of thermodynamics", "Identify, describe and ultimately design a variety of physical and chemical systems through their internal changes and/or interactions with their surroundings", "Quantify internal energy U, heat q, work w, enthalpy H, entropy S and Gibbs energy G in that same variety of physical and chemical systems", "Predict spontaneous change in systems of varying complexity", "Explain and quantify transformations involving both pure substances and mixtures using thermodynamic concepts", "There will be online and in-class assignments, on a rotating interval of about two weeks.", "It will occur in a 2.5 hour time slot sometime between April 9 and April 25 (I have no control over this scheduling).", "I will have a copy on reserve in the library (https://www.reserves.uwaterloo.ca/ares/ares.dll?Action=10&Form=50&Value=222108) and the price listed here is for a one-year electronic subscription.", "In addition, I have prepared a number of narrated powerpoint lectures, which I hope you will find useful in learning the material.", "Each lecture also has notes that provide written transcripts of what I am speaking, in case that helps you to learn some of the terms.", "One will be tutorial assignments which you will complete the first half of the problem individually, then work on an extension of the problem in groups of 4.", "CHEM 254 - Winter 2025 | General | Microsoft Teams", "I will provide any materials there as well as on LEARN, just in case one or the other has access issues.", "Four of the assignments, involving both individual and group work in a team-based learning (TBL) format, should help you to be able to assess different thermodynamic systems and learn to use the appropriate thermodynamic tools.", "The other four assignments, to be completed individually and much broader in scope and effort required, will help you to apply those skills to more complex and realistic physical and chemical systems.", "These may cover several chapters at a time.", "This course includes the independent development and practice of specific skills, such as problem solving in a chemical and scientific context.", "Library for research-based assignments"]}, {"course_id": 9, "course_code": "CS 114", "course_name": "CS114 - Principles of Computing for Science (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Principles of Computing for Science Winter 2025", "08:30AM - 09:50AM MC 4059", "Monday -", "Monday", "07:00PM - 08:50PM", "10:30AM - 11:20AM MC 4063", "Coordinator", "Student who make use of office hours usually get better grades; use them!", "Introduction to basic imperative programming principles; programming concepts including functions, flow control, lists, arrays; numerical accuracy and efficiency; data analysis and general-purpose algorithms.", "Introduction to object-oriented programming concepts.", "Describe the basic memory model for mutation of basic types, lists, and objects in Python.", "Identify situations where recursion is an appropriate tool, and use it.", "6 Feb 6-11 M4: Strings and Lists", "7 Feb 13-25 M5: Sorting and Dictionaries", "If both exams are held in person", "If in-person exams cannot be held then they will be held online (if possible).", "Students have the option of self-declaring a short-term absence, as described here: https://uwaterloo.ca/registrar/current-students/undergraduate-student-short-term-absences", "Students should check their basic tests email to ensure that the code meets the specification exactly.", "If ill, please complete a complete a Verification of Illness Form and contact the course coordinator to discuss alternate arrangements.", "Generative AI: This course includes the independent development and practice of specific skills, such as writing and reading code, tracing, and algorithm design.", "Library for research-based assignments"]}, {"course_id": 11, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 12, "course_code": "MATH 227", "course_name": "MATH227 - Calculus 3 for Honours Physics (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Email: pmcgrath@uwaterloo.ca", "Directional derivative and the chain rule for multivariable functions.", "Double and triple integrals on simple domains; transformations and Jacobians; change of variable in multiple integrals.", "Vector fields, divergence and curl.", "Vector integral calculus: Line and surface integrals, Green's Theorem, Stokes' Theorem, Gauss' Theorem, conservative vector fields.", "Work in and convert between Cartesian and polar coordinates in two-dimensions or Cartesian, cylindrical, and spherical coordinates in three-dimensions.", "Plot and describe the behaviour of a vector field.", "Determine using a variety of tests if a vector field is conservative.", "Understand the fundamental differences between conservative and non-conservative vector fields.", "Determine the extreme values of a function of multiple variables.", "This course covers a selection of topics from multivariable vector calculus.", "In particular, we will aim to cover one item per week from the following list:", "Arc length and line integrals.", "Quadric surfaces and coordinate systems.", "Extrema of multivariable functions and Lagrange multipliers.", "A previous course in linear algebra is strongly recommended.", "I will also share short videos each week in which I work through examples and/or discuss particularly important concepts.", "I will also post problem sets with full solutions each week so that you have plenty of practice problems to work through.", "Discussion", "You can join our Piazza forum at", "To be clear - such websites are not allowed to be used for the completion of any assessment in MATH 227."]}, {"course_id": 15, "course_code": "MNS 102", "course_name": "MNS102 - Techniques for Materials and Nanosciences (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Techniques for Materials and Nanosciences Winter 2025", "MNS 102", "Overview of materials synthesis, including both wet chemical and dry physical based methodologies; basic metrology and materials characterization of surface and bulk properties; introduction to the design, fabrication, and evaluation of simple devices; survey of emerging new techniques in materials and nanosciences.", "View requirements for MNS 102", "Overview of Materials and Nanosciences - Review of notable nanoscale phenomena | Structure-property relations | Basic physics and chemistry background | Lab tours", "Wet chemistry methods: Beaker chemistry, Sol-Sel, Hydrothermal, Electrochemistry | Templates, seed-layers and catalysts ||", "Dry chemistry methods: Solid-state synthesis, Chemical Vapour Deposition, Physical Vapour Deposition (including magnetron sputtering, e-beam evaporation, pulsed laser deposition), Molecular Beam Epitaxy | General materials growth mechanisms", "Module 2: Basic Metrology and Materials Characterization - Structure determination techniques | X-ray Diffraction: Basic introduction in group theory, basic physics, diffraction of powders and thin films) | Light Microscopy: Key concepts including magnification, working distance, depth of focus, spatial resolution vs field of view | Transmission Electron Microscopy and electron diffraction| Scanning Electron Microscopy (and Energy-Dispersive X-ray analysis) | Scanning Tunnelling Microscopy | Atomic Force Microscopy ||", "Composition determination techniques | Optical spectroscopies: Absorption vs transmission, IR, Raman, UV, photoluminescence || X-ray photoelectron spectroscopy: Photoelectric effect and Einstein's equation, electronic and band structures | Secondary ion mass spectrometry: Static vs Dynamic SIMS ||", "Characterization of electrical, physical and magnetic properties | Resistivity and conductivity | Heat capacity | Magnetic properties", "Module 3: Device Design and Fabrication - Top-down vs bottom-up approaches | Optical Lithography | Electron Beam Lithography | Nano-imprinting | Nano-machining and nano-manipulation", "Module 4: Emerging Techniques - Super-resolution Microscopy | Helium Ion Microscopy | Ion Beam Lithography | Other tools", "To learn the fundamental structure-properties relations of nanoscale materials.", "To learn the basic principles of common synthesis and materials characterization techniques."]}, {"course_id": 26, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 27, "course_code": "PHYS 122L", "course_name": "PHYS122L - Waves, Electricity and Magnetism Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 2 - Circuits", "Experiment 5 - Magnetic Fields of a Coil", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 28, "course_code": "PHYS 234", "course_name": "PHYS234 - Quantum Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["11:30AM - 12:20PM DC 1351", "K. Islam", "Introduction to formalism of quantum physics.", "Introduction to operators.", "Background: understanding why we need a quantum theory", "Learning the building blocks of a quantum theory: state vectors and operator", "Jan 06, 08, 10 Introduction to Quantum Physics, Stern-Gerlach experiments 1", "Jan 20, 22, 24 Matrix notation, general quantum systems, operators 2", "Mar 10, 12, 14 Continuous quantum systems – formalism, infinite potential well,", "Mar 17, 19, 21 Continuous quantum systems – infinite potential well (continued), finite potential well 5", "Mar 24, 26, 28 Continuous quantum systems – quantum harmonic oscillator 9", "Mar 31, Apr 02, 04 Continuous quantum systems (continued), Review", "Students should start checking for posted exam dates:", "Everyone needs a support system.", "Every student in PHYS 234 is expected to treat their peers and their instructor with kindness, fairness, tolerance, and respect.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 30, "course_code": "PHYS 249", "course_name": "PHYS249 - Computational Physics and Linear Algebra (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Computational Physics and Linear Algebra Fall 2024", "10:30AM - 12:20PM DC 1350", "Email: brenda.lee@uwaterloo.ca", "Computational techniques; numerical accuracy and speed; Python libraries and implementation; algorithms for numerical integration; matrix operations.", "Computational approach to vectors in 2- and 3-space; linear equations, matrices, determinants; eigenvalues and diagonalization.", "Resource Details", "These will not be recorded and consist primarily of board work.", "Understand and apply the basic concepts of vectors, matrices and linear transformations", "Interpret the geometric meaning of vector spaces, subspaces, linear independence, basis and dimension", "Perform matrix operations including addition, multiplication, transposition and inversion both manually and using Python libraries such as NumPy", "Solve systems of linear equations manually and computationally using LU decomposition and Gaussian elimination", "Calculate eigenvalues and eigenvectors of matrices manually and computationally; and interpret their significance in physics applications", "Apply diagonalization techniques to solve differential equations relevant to physics problems", "Understand inner product spaces and concepts of length and orthogonality in both theoretical and computational settings", "Describe and represent linear transformations using matrices; and their contribution to geometric objects and physical systems", "Develop iterative and computational skillsets through Python to model and simulate physical systems with the help of linear algebra concepts", "Identify and articulate transferable skills from their science courses and connect these to the Future Ready Talent Framework", "Create accomplishment statements that effectively communicate these skills on their resumes", "Thursdays Tutorial and Skills Identification & Articulation Workshop @ 10:30am - 12:20pm", "Not all topics may be covered in their entirety, but the core topics from the course calendar description will.", "Topic 1: Intro to Course, Linear Algebra & Python Programming", "2 Sep 9-13 Topic 3: Spanning and Linear Independence", "Topic 5: Projections and Applications", "Skills Identification & Articulation Worksheet 0", "Topic 6: Visualization and Solving of Vector Operations using Python", "Topic 7: Systems of Linear Equations, Gaussian Elimination and Back-Substitution", "Topic 9: Applications of Systems of Linear Equations with Computational Methods and Visualization with Python", "Topic 10: Matrix Addition and Multiplication", "Topic 11: Transpose, Identity and Inverse of a Matrix", "Skills Identification & Articulation Worksheet 1", "Topic 12: Matrix Factorizations", "Topic 13: Computational Methods in Matrix Algebra", "Topic 14: Vector Spaces and Subspaces", "Topic 16: Visualization of Vector Spaces through Computational Methods Skills Identification & Articulation Worksheet 2", "Topic 18: Computational Methods using Determinants", "Topic 19: Eigenvalues and Eigenvectors with Matrix Diagonalization", "Topic 22: Least Squares Approximations Skills Identification & Articulation Worksheet 3", "Topic 23: Numerical Approximation Methods", "UNIT 8 | COMPLEX VALUES & COMPUTATIONAL APPLICATIONS", "Topic 24: Complex Numbers & Computational Applications", "Jan 21: Standing decisions and official grades available in Quest", "Instructions and installation guidance will be provided at the beginning of the term on LEARN Yes", "An Introduction to Linear Algebra for Science and Engineering Excellent book that we will be using in this course; highly recommend getting this if you can No", "Linear Algebra: A Modern Introduction, 4th Edition, David Poole Good elementary book which has suitable problems for scientists No", "Computational Physics, 2nd Edition, Mark Newman Great for beginners to computational physics with Python No", "Introduction to Linear Algebra, 6th Edition, Gilbert Strange (MIT) Excellent mixture of linear algebra and optimization / data science but no physics applications No", "You are encouraged to explore the topics of linear algebra and computational physics / numerical methods of analysis through these recommended textbooks and materials above for your own benefit and enhanced learning experience.", "HOMEWORK (15% Completion Grade): I'm giving you free marks to practice, practice, practice and show you've put in the time to do some linear algebra!", "Level of Collaboration Allowed: Not Monitored", "Do them by the end of the next week to get grades.", "Level of Collaboration Allowed: None - Screening for Plagiarism Active - Debugging Support on Discord is Allowed", "Frequency: Once in the Middle of the Term", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Level of Collaboration Allowed: Groupwork Allowed", "Grading: Based on completion and suitability of responses", "The written content will primarily be code and Jupyter Notebook files.", "Code plagiarism includes moderate to significant reproduction of other's work (source code from available resources, code from classmate submissions, fragments of original code, etc.)", "Notice of Recording", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 32, "course_code": "PHYS 334", "course_name": "PHYS334 - Quantum Physics 2 (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "04:30PM - 05:20PM", "Formalism of quantum mechanics.", "Identical particles.", "Applications in atomic and molecular physics.", "Physically predict, and mathematically model, the outcome(s) after measuring a quantum system", "Understand and model the difference between a single measurement outcome and an ensemble average", "Predict the time dependence of a quantum system, given its initial state and Hamiltonian", "Use commutator identities to check commutation relations for operators", "Write the position and momentum operators in terms of the harmonic oscillator ladder operators, and vice versa", "State the commutation relations that define a set of angular momentum operators", "State the spectrum (allowed eigenvalues) of the angular momentum operators 𝐽^2 and 𝐽_𝑧, in terms of quantum numbers 𝑗 and 𝑚", "State the restrictions on the 𝐽^2 and 𝐽_𝑧 eigenvalues, in terms of restrictions on their associated quantum numbers 𝑗 and 𝑚", "State the effect of all angular momentum operators on the joint eigenstates of 𝐽^2 and 𝐽_𝑧", "Compute the matrix representations of the angular momentum operators for a given 𝑗, in the joint eigenbasis of 𝐽^2 and 𝐽_𝑧", "Describe the eigenfunctions of orbital angular momentum (spherical harmonics) in the position basis", "For systems with “central” potentials (those that depend only on a radial coordinate), describe the decomposition of the energy eigenfunctions into their angular and radial components", "Describe the energies and eigenstates of the hydrogen atom", "Describe the degeneracy of different energy eigenstates of the hydrogen atom", "State two possible complete sets of mutually commuting operators (CSCOs) whose eigenstates can be used as bases to describe a set of two angular momenta", "State the eigenvalues of the CSCOs used to describe a set of two angular momenta", "State the selection rules for the Clebsch-Gordan coefficients that relate the coupled and uncoupled bases of a system with two angular momenta", "Calculate perturbative energy shifts and wavefunction changes for nondegenerate systems", "Calculate perturbative energy shifts for degenerate systems, selecting an appropriate basis for the calculation", "Use the variational method to estimate the ground-state energies of simple one-dimensional problems, given a suitable trial function", "State the definition of a boson and a fermion, in terms of the spin of the particles", "State the symmetry properties of bosonic and fermionic wavefunctions", "Exams", "There will be two in-class exams given during the lecture period in our usual classroom.", "Exam 2: Wed. Mar 19 (covers material up through and including nondegenerate perturbation theory)", "HW1 - formalism and postulates - due Jan 24", "HW2 - quantum harmonic oscillator and angular momentum - due Feb 7", "HW3 - spherical harmonics and hydrogen atom - due Feb 28", "HW4 - addition of angular momentum and nondegenerate perturbation theory - due Mar 12", "Week 1 - Intro to class and mathematical formalism of quantum mechanics", "Week 4 - Angular momentum", "Week 5 - Spherical harmonics and central potentials", "Week 8 - Nondegenerate perturbation theory", "Week 9 - Degenerate perturbation theory, fine structure, Zeeman effect", "Quantum Mechanics: A Paradigms Approach, David H. McIntyre", "Introduction to Quantum Mechanics, David Griffiths", "Zettili shines in its extensive collection of worked examples and practice problems.", "Some assignment problems may be graded on a multiple choice basis.", "Notice of Recording"]}, {"course_id": 39, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 40, "course_code": "BIOL 280", "course_name": "BIOL280 - Introduction to Biophysics (0.50)", "term_name": "Approved Courses List", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Introduction to Biophysics Winter 2025", "08:30AM - 09:50AM RCH 301", "Email: brenda.lee@uwaterloo.ca", "Email: ibukhteeva@uwaterloo.ca", "Email: jglasier@uwaterloo.ca", "Introduction to a physical understanding of biological systems at macro and molecular scales.", "The course is intended for second-year science and engineering students and will cover a broad spectrum of topics in biophysics, as well as an introduction to neurobiology, nanotechnology, and biotechnology.", "Explain fundamental physical principles as they relate to biological systems at the macro and molecular scales", "Apply mathematical and physical models to describe and predict biological phenomena, including respiration, membrane transport, and energy transformation", "Demonstrate a systemic approach to problem-solving in applying physical concepts to solve questions related to biological systems", "Explore the structural and functional properties of biomolecules (proteins, nucleic acids, lipids, carbohydrates) and their role in cellular and molecular systems", "Evaluate the role of physical laws in physiological processes, such as neuronal signal propagation and blood flow dynamics", "Demonstrate knowledge of a wide range of biophysical and experimental methods (e.g. microscopy, spectroscopy, light scattering techniques) and their applications in research and medicine", "Critically assess biophysical methods used in research and medical applications and highlight their benefits, limitations, potential", "Develop scientific communication skills through the creation of written reports and problem-solving assignments related to biophysical concepts", "Not all topics may be covered in their entirety, but the core topics from the course calendar description will.", "1 Jan 6-10 Topic 1: Introduction to Biophysics", "Topic 7: Introduction to Cellular & Molecular Biophysics", "Topic 9: Biophysics of Nucleic Acid and DNA", "Topic 14: Introduction to Bionanotechnology", "Topic 16: Advanced Methods in Biophysics", "Topic 17: Methods in Medical Physics", "Apr 9: Final examination period begins", "May 20: Standing decisions and official grades available in Quest", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "Level of Collaboration Allowed: None - Screening for Plagiarism Active", "A detailed set of instructions will be provided on LEARN, but the general grading scheme will follow these key requirements:", "Biological explanation of 1 application (e.g. medical disease, cellular/molecular mechanism or interactions, biological phenomena)", "Physical explanation of 2 methods that can be used to study this biological application", "Pros and cons of each method presented", "Comparison of methods to see which one is more suitable under certain conditions", "Grading: Based on accuracy and depth of information in paper, and organization of content; a grading rubric will be provided prior to submission", "Notice of Recording", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 45, "course_code": "CHEM 237", "course_name": "CHEM237 - Introductory Biochemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:20AM", "RCH 101", "10:30AM - 11:20AM RCH 101", "ESC 227", "Structure and properties of proteins and enzymes.", "develop a molecular level understanding of biological processes to achieve this the following learning outcomes will be", "in both qualitative and quantitative examples", "evaluate unknown thermodynamic parameters from given values of others.", "I equilibrium constants from standard free energy changes.", "qualitatively describe the composition of solutions of a weak acid or base as a function of pH.", "calculate the precise", "recognize the 20 amino acids that are commonly found in proteins and identify compounds derived from them", "calculate the charge on an amino acid side chain as a function of pH", "know the 4 levels of protein structure and the covalent and non covalent interactions that stabilize them", "explain how to purify proteins using the physical and chemical properties of the proteins", "determine the primary sequence of a protein given the appropriate data", "understand basic chemical kinetics and the application to biological systems", "determine the mechanism of inhibition of an enzyme using", "the structure of fatty acids and membrane lipids", "the structures of cell membranes and how the fatty acid composition of those membranes affects membrane structure and fluidity", "the structure of simple sugars and polysaccharides and the chemistry of the reactions in which they participate", "Suggested supplementary reading in \"Biochemistry Free for All\".", "Biochemistry free for all: Introduction Water and Buffers, pages 34-49", "VVP chapters 3 and 4.1", "Biochemistry free for all pages 53-70", "Appendix A.1 and A.2", "Chapter 4.2 and 4.3", "Biochemistry free for all.", "pp 74-108", "Week 6  Protein folding and Introduction to hemoglobin", "Chapter 4 - Biochemistry in focus", "Biochemistry free for all pages 128-141", "first kinetics Chapter 10 then mechanisms Chapter 9", "Biochemistry free for all pages 337-362", "Biochemistry free for all pp 190-217", "Biochemistry free for all pp 222-233", "Biochemistry free for all pp 287 - 312", "Notice of Recording"]}, {"course_id": 48, "course_code": "CHEM 267L", "course_name": "CHEM267L - Organic Chemistry Laboratory (0.25)", "term_name": "Approved Courses List", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Answers can be expected within 24 hours.", "Experiments include the reduction of vanillin; an electrophilic aromatic substitution; the synthesis of a fragrant ester using Fischer esterification and preparation of a fluorescent laser dye, 3-acetyl-7-(diethylamino)-2H-1-benzopyran-2-one.", "The organic chemistry laboratory provides students with opportunities to carry out some of the organic synthesis reactions encountered in CHEM 267 in a real-world experience.", "Additionally, students will become versed in several basic organic chemistry laboratory techniques including: liquid-liquid extraction, distillation, one and two solvent recrystallization and melting point determination, to name a few.", "Be proficient with basic organic laboratory techniques including selecting proper glassware, measuring small and large quantities of solids and liquids, designing the setup required for simple synthetic reactions, filtration, and basic characterization.", "Understand and be able to design and execute a liquid-liquid extraction processes for the separation of ionizable acidic, ionizable basic, and non-ionizable (neutral) substances.", "Scheduling issues", "Fillable form online for Möbius support", "Laboratory performance marks will be given by the Teaching Assistants and Lab Instructor and averaged for each in-person lab period.", "To receive 10/10 in performance this term you must show self-sufficiency by either replacing empty acetone bottles at the sink, refilling the DI water, letting your TA know the bottles at your workstation need a top-up and cleaning shared areas beyond your own.", "This is not directly the case; we do expect students to need a lot of clarifications when working in the lab for the first time.", "Laboratory Worksheets and Reports", "General Policies", "Aside from LEARN, we will use various software to facilitate the delivery of the laboratory.", "Important note: Since the manual is printed months before delivery of the lab, we may need to make corrections during the term."]}, {"course_id": 50, "course_code": "CHEM 333", "course_name": "CHEM333 - Metabolism 1 (0.50)", "term_name": "Approved Courses List", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["09:30AM - 10:20AM DWE 2527", "First we will cover general principles of thermodynamics and high energy compounds ( NTPs, NAD(P)+ and fats).", "And some general principles of the energy metabolism and the regulation of metabolic pathways.", "understand the logic of the pathways by being able to draw the chemical structures of the intermediates in these pathways.", "draw the chemical mechanisms of the enzymes involved in these metabolic pathways and to use that information to apply it to new systems.", "understand the interconnection of these pathways and the basis, of the regulation and coordination of these pathways.", "week ART Reading VVP reading and practice problems MVH", "1: Introduction to metabolism, review of Energy Metabolic Energy (410-429)", "6: Electron transport and oxidative phosphorylation Energy: Electron Transport & Oxidative Phosphorylation (430-471)", "10: Integration and coordinated regulation of the pathways metabolic disorders Signalling (828-855)", "Biochemistry Free for All https://biochem.oregonstate.edu/undergraduate/educational-resources Yes", "Fundamentals of Biochemistry 5th edition by Voet, Voet and Pratt Yes", "Online quizzes   10% of final mark These will be a combination of multiple choice and written answers."]}, {"course_id": 52, "course_code": "CHEM 357", "course_name": "CHEM357 - Physical Biochemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Materials and Nanosciences", "program_id": 102, "major_id": 1, "major_name": "Materials and Nanosciences (Bachelor of Science - Honours)", "topics": ["Physical Biochemistry Winter 2025", "10:30AM - 11:20AM RCH 307", "B. Power", "Instructor: Bill Power", "The use of diffusion, ultracentrifugation, osmotic pressure, electrophoresis and X-ray diffraction to study the properties of biopolymers.", "This course is meant to provide you with a basic introduction to physical chemistry as applied to the life sciences with emphasis on applications in biochemistry.", "This course will cover the basics of thermodynamics and their applications to biological molecules and systems, their transport properties, chemical and enzyme kinetics, and physical techniques used to establish and investigate the structures of biological macromolecules.", "I will aim to provide you with all the background necessary to cover the many topics in this course, from entropy and thermodynamic principles from the 18th century to modern applications such as AI which resulted in half of the the 2024 Nobel Prize in Chemistry going to Google's DeepMind leaders Demis Hassabis and John Jumper for their development of AlphaFold, a protein structure database (of 220 million structures!).", "In return you should have some familiarity with the basics of biochemistry and biological structures and terminology, as well as some comfort working with derivatives, including partial derivatives, integrals and differential equations.", "Understand the four laws of thermodynamics and their applications to biological systems", "Understand the importance of Gibbs free energy and chemical potential in describing physical and chemistry transformations", "Understand the basics of chemical kinetics and rate laws and mechanisms", "Be able to characterize enzyme kinetics using the Michaelis-Menten description and describe competition and inhibition in such mechanisms", "Know how to apply and interpret structural tools such as optical and NMR spectroscopy, X-ray diffraction and computational tools to biological macromolecules", "There will be online and in-class assignments, on a rotating interval of about two weeks.", "It will occur in a 2.5 hour time slot sometime between April 9 and April 25 (I have no control over this scheduling).", "Weeks 1 to 3:   Thermodynamics, its Laws and its Applications", "Week 10:            Biomolecular Structure; Optical Spectroscopy", "Weeks 11 to 12: NMR Spectroscopy; X-ray Diffraction; AI Methods and AlphaFold", "We will cover much of this book, though perhaps not in detail in some sections, and it should be a useful resource.", "I will have a copy on reserve in the library (https://www.reserves.uwaterloo.ca/ares/ares.dll?Action=10&Form=50&Value=222107) and the price listed here is for a one-year electronic subscription (https://www.pearson.com/en-ca/subject-catalog/p/physical-chemistry-principles-and-applications-in-biological-sciences/P200000006771/9780137612826).", "This course includes the independent development and practice of specific skills, such as problem solving in a chemical and scientific context.", "Library for research-based assignments"]}, {"course_id": 13, "course_code": "AMATH 350", "course_name": "AMATH350 - Differential Equations for Business and Economics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Economics", "program_id": 103, "major_id": 4, "major_name": "Mathematical Economics (Bachelor of Mathematics - Honours)", "topics": ["Differential Equations for Business and Economics Winter 2025", "11:30AM - 12:20PM MC 4045", "First order ordinary differential equations.", "Applications to continuous compounding and the dynamics of supply and demand.", "Higher order linear ordinary differential equations.", "Systems of linear ordinary differential equations.", "Introduction to linear partial differential equations.", "Ordinary differential equations and their applications", "Systems of linear ordinary differential equations", "Linear partial differential equations and Fourier transform", "Black-Scholes equation and solution", "(Jan 6-10) Introduction to Differential Equations (DEs), Separable Equations, Initial-Value Problems, Applications from Finance", "Dimensional Homogeneity, First-Order Linear Ordinary DEs, Use of Substitutions, Applications from Finance Chapter 2 Posting Assignment 1", "Introduction to Higher-Order Linear Equations: Theoretical Background", "Introduction to Systems of Ordinary Differential Equations, Method of Solution for Homogeneous Systems (Second Order)", "(Mar 3-7) Introduction to Partial Differential Equations, First-order Equations (Partial Integration, Method of Characteristics) Chapter 5", "Second-Order Linear PDEs: Classification, Solution by Partial Integration or Method of Characteristics Chapter 5", "Please submit your assignments early in case of unexpected technical difficulties."]}, {"course_id": 14, "course_code": "STAT 331", "course_name": "STAT331 - Applied Linear Models (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Economics", "program_id": 103, "major_id": 4, "major_name": "Mathematical Economics (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Applied Linear Models Winter 2025", "08:30AM - 09:50AM MC 4020", "02:30PM - 03:20PM", "RCH 101", "Thursdays from 3:00-4:00pm in M3 3021", "Modelling the relationship between a response variable and several explanatory variables (an output-input system) via regression models.", "Model diagnostics and improvement.", "Algorithms for variable selection.", "Review of basic Normal theory, t, chi-squared, and F distributions.", "Simple linear regression.", "Analysis of variance.", "Multiple linear regression, variable selection techniques, indicator variables, diagnostics.", "Brief introduction to non-linear regression, factorial experimentation.", "Registered students can enroll in the class discussion board through Piazza.", "Search for your question first before posting.", "Do not expect a full solution to your question.", "To help maintain a safe, respectful, and productive community in which we – students and teaching team alike – can take risks in our learning/teaching, tackle challenging concepts, and ultimately grow as learners, we should endeavor to follow these mutual expectations:", "Explain the main concepts of linear regression models.", "Understand the methods of least squares and maximum likelihood estimation for model parameters.", "Interpret the model and its parameters (e.g., regression coefficients) in the context of any application.", "Draw inferences from a fitted model about the parameters of interest and make predictions.", "Apply the previous two outcomes when fitting linear models to real data using R.", "Assess model quality by diagnosing violations in underlying model assumptions (and identify strategies for improvement).", "Evaluate competing fitted models built using various model selection methods (and choose between them).", "Introduction", "The Straight Line Model", "Model formulation and interpretation", "Least squares estimation", "Mean response and residual variance estimation", "Introduction to R/RStudio", "Maximum likelihood estimation", "Estimators and their properties", "Important distributions", "Distributions of estimators", "Confidence intervals", "O - Ch. 2-4", "Straight Line Model in R", "Prediction intervals", "Intervals in R", "Hypothesis testing", "O - Ch. 4-5", "ANOVA and F test", "Model limits", "Data transformations", "O - Ch. 4-6", "O - Ch. 7", "A1 and Q1 Solutions", "Multivariate normal distribution", "The Linear Model", "Examples", "O - Ch. 8-9", "Estimation", "Estimators and their properties", "Distributions of estimators", "O - Ch. 9, 11, 12", "ANOVA and F test", "Significance tests", "General linear hypothesis", "O - Ch. 9, 11, 12", "A2 and Midterm Solutions", "Case Study: South African heart disease", "Nested models", "Additional sum of squares", "O - Ch. 12", "Outliers", "O - Ch. 13-14", "Influence", "O - Ch. 14-15", "A3 and Q2 Solutions", "One-variable-at-a-time selection methods", "Criteria-based selection methods", "O - Ch. 16", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solve exercises from the textbook on your own.", "Introduction to Regression Modeling by Abraham and Ledolter This textbook is an optional reference book (available for free on LEARN).", "R and R-Studio Free software.", "To serve as an opportunity to demonstrate your understanding, application, and integration of the course material, including practical application of the skills/concepts with the statistical software, R.", "Missed Assignment: The time window to complete these assessments are generous and, in general, a sickness lasting a couple of days will not be enough of a reason to ask for alternative accommodations and/or extension.", "Tips for Success", "Students should critically compare their work with available solutions and against the solutions of fellow classmates.", "Notice of Recording", "To help you decide if you should isolate, you can use the provincial self-assessment tool.", "In the scenario where we must transition back online the following contingencies will be used:", "These materials are made available for the personal use of students registered in the current offering of this course.", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical proofs and the fitting, interpretation, and assessment of linear models in real applications.", "Library for research-based assignments"]}, {"course_id": 20, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Economics", "program_id": 103, "major_id": 4, "major_name": "Mathematical Economics (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 22, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Economics", "program_id": 103, "major_id": 4, "major_name": "Mathematical Economics (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 5, "course_code": "PMATH 450", "course_name": "PMATH450 - Lebesgue Integration and Fourier Analysis (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Lebesgue Integration and Fourier Analysis Fall 2024", "Lebesgue measure on the line, the Lebesgue integral, monotone and dominated convergence theorems, Lp-spaces: completeness and dense subspaces.", "Prove theorems and solve problems on Lebesgue integrals and Fourier analysis, and move like Jagger."]}, {"course_id": 8, "course_code": "STAT 331", "course_name": "STAT331 - Applied Linear Models (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Applied Linear Models Winter 2025", "08:30AM - 09:50AM MC 4020", "02:30PM - 03:20PM", "RCH 101", "Thursdays from 3:00-4:00pm in M3 3021", "Modelling the relationship between a response variable and several explanatory variables (an output-input system) via regression models.", "Model diagnostics and improvement.", "Algorithms for variable selection.", "Review of basic Normal theory, t, chi-squared, and F distributions.", "Simple linear regression.", "Analysis of variance.", "Multiple linear regression, variable selection techniques, indicator variables, diagnostics.", "Brief introduction to non-linear regression, factorial experimentation.", "Registered students can enroll in the class discussion board through Piazza.", "Search for your question first before posting.", "Do not expect a full solution to your question.", "To help maintain a safe, respectful, and productive community in which we – students and teaching team alike – can take risks in our learning/teaching, tackle challenging concepts, and ultimately grow as learners, we should endeavor to follow these mutual expectations:", "Explain the main concepts of linear regression models.", "Understand the methods of least squares and maximum likelihood estimation for model parameters.", "Interpret the model and its parameters (e.g., regression coefficients) in the context of any application.", "Draw inferences from a fitted model about the parameters of interest and make predictions.", "Apply the previous two outcomes when fitting linear models to real data using R.", "Assess model quality by diagnosing violations in underlying model assumptions (and identify strategies for improvement).", "Evaluate competing fitted models built using various model selection methods (and choose between them).", "Introduction", "The Straight Line Model", "Model formulation and interpretation", "Least squares estimation", "Mean response and residual variance estimation", "Introduction to R/RStudio", "Maximum likelihood estimation", "Estimators and their properties", "Important distributions", "Distributions of estimators", "Confidence intervals", "O - Ch. 2-4", "Straight Line Model in R", "Prediction intervals", "Intervals in R", "Hypothesis testing", "O - Ch. 4-5", "ANOVA and F test", "Model limits", "Data transformations", "O - Ch. 4-6", "O - Ch. 7", "A1 and Q1 Solutions", "Multivariate normal distribution", "The Linear Model", "Examples", "O - Ch. 8-9", "Estimation", "Estimators and their properties", "Distributions of estimators", "O - Ch. 9, 11, 12", "ANOVA and F test", "Significance tests", "General linear hypothesis", "O - Ch. 9, 11, 12", "A2 and Midterm Solutions", "Case Study: South African heart disease", "Nested models", "Additional sum of squares", "O - Ch. 12", "Outliers", "O - Ch. 13-14", "Influence", "O - Ch. 14-15", "A3 and Q2 Solutions", "One-variable-at-a-time selection methods", "Criteria-based selection methods", "O - Ch. 16", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solve exercises from the textbook on your own.", "Introduction to Regression Modeling by Abraham and Ledolter This textbook is an optional reference book (available for free on LEARN).", "R and R-Studio Free software.", "To serve as an opportunity to demonstrate your understanding, application, and integration of the course material, including practical application of the skills/concepts with the statistical software, R.", "Missed Assignment: The time window to complete these assessments are generous and, in general, a sickness lasting a couple of days will not be enough of a reason to ask for alternative accommodations and/or extension.", "Tips for Success", "Students should critically compare their work with available solutions and against the solutions of fellow classmates.", "Notice of Recording", "To help you decide if you should isolate, you can use the provincial self-assessment tool.", "In the scenario where we must transition back online the following contingencies will be used:", "These materials are made available for the personal use of students registered in the current offering of this course.", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical proofs and the fitting, interpretation, and assessment of linear models in real applications.", "Library for research-based assignments"]}, {"course_id": 9, "course_code": "STAT 333", "course_name": "STAT333 - Stochastic Processes 1 (0.50)", "term_name": "Required Courses", "program_name": "Mathematical Finance", "program_id": 104, "major_id": 1, "major_name": "Mathematical Finance (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM DC 1350", "04:00PM - 05:20PM", "Erik Hintz: Fridays, 2:00pm - 3:00pm, in M3-2106", "Requests must be emailed to: sasugradadv@uwaterloo.ca", "Topics cover generating functions, conditional probability distributions and conditional expectation, discrete-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, applications including the random walk, the gambler's ruin problem, and the Galton-Watson branching process, an introduction to counting processes, connections between the exponential distribution and Poisson process, and non-homogeneous and compound Poisson processes.", "use moment generating functions as a tool to determine expected values and identify probability distributions of random variables;", "use the law of total expectation to calculate expected values and probabilities through the principle of conditioning;", "specify a discrete-time Markov chain (DTMC), in terms of its transition probability matrix and initial conditions, and calculate various transition probabilities;", "classify the states of a DTMC;", "define fundamental DTMC concepts including irreducibility, periodicity, and recurrence/transience;", "find limiting/stationary probability distributions for certain DTMCs through the use of the Basic Limit Theorem;", "calculate absorption probabilities and expected absorption times for DTMCs using the principle of conditioning with respect to the first transition;", "Week 11 March 24 - March 28 Chap 4: Exponential Distribution & Poisson Processes Tutorial Assignment 2", "Week 12 March 31 - April 4 Chap 4: Exponential Distribution & Poisson Processes Tutorial Test 3", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solving exercises from the Course Notes on your own.", "Introduction to Probability Models by Sheldon M. Ross (2019)"]}]