[{"course_id": 27, "course_code": "CO 370", "course_name": "CO370 - Deterministic OR Models (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Deterministic OR Models Winter 2025", "Mahtab Alghasi: Wednesdays from 11am-12pm in MC5488", "An applications-oriented course that illustrates how various mathematical models and methods of optimization can be used to solve problems arising in business, industry, and science.", "Formulate computational tasks as optimization problems of appropriate type", "Understand optimization concepts surrounding real world challenges (sensitivity analysis, robust optimization, stochastic optimization)", "Have some familiarity with algorithmic techniques and heuristics for solving optimization problems", "Part I: Formulations", "Flows", "Integer Programs that reduce to Linear Programs", "Part 2: Real World Challenges that can be addressed in Optimization", "Robust optimization", "Stochastic Optimization", "Part 3: Algorithms and Heuristics for Solving Optimization", "Branch and Bound", "Please sign yourself up at", "A missed test will be treated the same as a mark of zero.", "The answer to most common issues as well as how-to videos can be found at", "To avoid issues, only use your UWaterloo email, never use multiple email addresses.", "Illnesses and INC", "In case of a", "short period of illness and a strong performance in the course we should be able to simply", "Copyright Information"]}, {"course_id": 37, "course_code": "CO 487", "course_name": "CO487 - Applied Cryptography (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Instructor: Samuel Jaques", "Email: sejaques@uwaterloo.ca", "Timothy Miller", "Nicolas Swanson", "A broad introduction to modern cryptography, highlighting the tools and techniques used to secure internet and messaging applications.", "It is one of the core technologies for securing the emerging information infrastructure.", "This course is a comprehensive introduction to modern cryptography that is aimed primarily at those interested in applications.", "In the area of public-key cryptography, topics will include an overview of specific systems (Diffie–Hellman, RSA, DSA, etc.) and a few advanced protocols.", "The security of these schemes and the use of public-key techniques for generating digital signatures will be described.", "Linear and differential cryptanalysis of ciphers.", "Define the main information security goals of confidentiality, integrity, authentication, and availability", "Explain the intended security properties of each cryptographic primitive and analyze relationships between security properties", "Explain mathematical techniques underlying standardized cryptographic algorithms", "Identify flaws in uses of cryptographic algorithms", "Determine which cryptographic algorithms can be used and combined to build systems with desired functionality and security", "Understand and contextualize the cryptography and security around them in daily life", "0 1 (Jan 6-8) Introduction", "Symmetric Encryption", "3.6 9 Elliptic Curve Cryptography 4 Yes", "4   Applications", "Understanding Cryptography: From Established Symmetric and Asymmetric Ciphers to Post-Quantum Algorithms, 2nd edition, Springer, 2024 Primary reference.", "A1: January 23", "A4: March 20", "This will be clearly indicated for each such question.", "In that case you are required to work independently.", "These questions will test your ability to identify the important concepts introduced in lectures, and your understanding of them.", "In particular:", "Please inform us of these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 38, "course_code": "CS 341", "course_name": "CS341 - Algorithms (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Algorithms Winter 2025", "10:00AM - 11:20AM MC 4061", "08:30AM - 09:50AM MC 1056", "The study of efficient algorithms and effective algorithm design techniques.", "Topics include divide and conquer algorithms, recurrences, greedy algorithms, dynamic programming, graph search and backtrack, problems without algorithms, NP-completeness and its implications.", "DPV", "Introduction to Algorithms, by Cormen, Leiserson, Rivest and Stein, MIT Press.", "describe the main idea first,", "Extensions and Other Accommodations on Assignments", "Students can currently self-declare two kinds of absences on Quest: short-term absence and pandemic-related absence.", "Since a short-term absence lasts 2 days, this means the only accommodation we offer for a short-term absence is a 48 hour extension.", "If you request accommodations through AccessAbility Services (AAS) by filling out a Missed Course Component form, the accommodation is determined on a case-by-case basis through consultation with AAS, but will generally be one of the above options unless your situation is unusual.", "If you collaborate with others, you must clearly indicate the collaboration for each problem.", "This is not a software engineering course; we will not test your code against inputs that do not match our specifications.", "Continuity Plan", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 40, "course_code": "CS 451", "course_name": "CS451 - Data-Intensive Distributed Computing (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Data-Intensive Distributed Computing Winter 2025", "10:00AM - 11:20AM MC 2017", "RCH 307", "10:00AM - 11:20AM MC 2017", "RCH 307", "Introduces students to infrastructure for data-intensive computing, with a focus on abstractions, frameworks, and algorithms that allow developers to distribute computations across many machines.", "Topics include core concepts (partitioning, replication, locality, consistency), computational models (MapReduce, dataflows, stream processing, bulk-synchronous parallel), and applications.", "Explain the key concepts in distributed big data projects", "Write clean and efficient Hadoop MapReduce and Spark code", "Understand and design distributed algorithms for the analysis of textual, graph, and relational data", "Explain the design issues involved with distributed relational and non-relational database systems such as Apache HBase / Google BigTable", "Introduction to Distributed Text Processing 1", "Introduction to Hadoop MapReduce 3", "Introduction to Apache Spark 3", "Distributed Database Systems 3", "This course includes the independent development and practice of specific skills, such as designing MapReduce and Spark code.", "Library for research-based assignments"]}, {"course_id": 41, "course_code": "CS 466", "course_name": "CS466 - Algorithm Design and Analysis (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Algorithm Design and Analysis Fall 2024", "Monday -", "Monday", "Sepehr Assadi - sassadi@uwaterloo.ca", "MohammadHossein Ebtehaj - mhebtehaj@uwaterloo.ca", "General information", "Mathematical maturity, and a strong background in probability, data structures, and algorithm design.", "I invite you to let me know about what I can stop, start, or continue doing to make sure every one of my students feels valued and can engage actively in our learning community.", "This is an advanced algorithm design and analysis course, aimed at undergraduate students interested in a deep dive in theoretical computer science (TCS), as well as graduate students doing research in TCS.", "Probabilistic analysis: Randomized algorithms, Concentration inequalities, Balls-and-bins", "Linear programming: Basics, Duality, Center-of-gravity algorithm, Rounding", "Multiplicative weight update (MWU): Expert problem, Fast packing/covering linear programs", "Random walks: Connectivity in RL, Perfect matchings in regular bipartite graphs, Sampling", "Dynamic graph algorithms: Connectivity, Approximate matching", "Parallel algorithms: Matching in RNC, Isolation lemma", "design and analyze algorithms for a wide range of canonical problems studied in this course, and even more importantly, for new problems that you may have not encountered directly yet,", "know a wide range of algorithmic and mathematical tools commonly used in design and analysis of algorithms, and", "have a basic familiarity with various algorithmic models of computation studied in TCS.", "Probabilistic Background and Concentration inequalities", "Streaming distinct elements, Limited independence hash functions", "Balls-and-bins experiments: Power of two choices via random graph theory", "MSTs: Basics, Fredman-Tarjan algorithm", "MSTs: Karger-Klein-Tarjan algorithm", "Linear programming (LP): Basics and Applications", "Linear Programming (LP): Duality and Integrality gaps", "Linear Programming (LP): More on Integrality gaps, Dual fitting for set cover", "Linear Programming (LP): Primal-dual for bipartite matching", "Online matching with a primal-dual analysis", "Graph sketches: Connectivity and L0-samplers", "Random walks: fundamental theorem of Markov chains, connectivity in RL", "Random walks: Perfect matching in regular bipartite graphs", "DP09 Devdatt P. Dubhashi and Alessandro Panconesi, Concentration of Measure for the Analysis of Randomised Algorithms.", "V20 Nisheeth K. Vishnoi, Algorithms for Convex Optimization.", "AHK12", "Please refer to the Course Webpage for a list of papers related to the topics discussed in the lectures.", "This is a list of some other closely related courses taught elsewhere:", "Randomised and Advanced Algorithms, Winter 2024 by Clément Canonne @ University of Sydney.", "Advanced Algorithms, Spring 2023 by Anupam Gupta @ CMU.", "Advanced Algorithms, Fall 2021 by Mohsen Ghaffari @ ETH.", "Advanced Algorithm Design, Fall 2022 by Matt Weinberg and Huacheng Yu @ Princeton.", "Advanced Topics in Algorithms, Fall 2021 by Kent Quanrud @ Purdue.", "Advanced Algorithms, Winter 2020 by Aleksandar Nikolov @ University of Toronto.", "CS466/666: Algorithm Design and Analysis, Spring 2024 by Rafael Oliveira", "CS466/666: Algorithm Design and Analysis, Fall 2024 by Sepehr Assadi", "CS466/666: Algorithm Design and Analysis, Fall 2022 by Therese Biedl", "CS466/666: Algorithm Design and Analysis, Spring 2022 by Lap Chi Lau", "Course Project (only for graduate students in CS 666) 15%", "15% Course Project (only for graduate students in CS 666)", "The solutions should be turned in as a single pdf file containing the answers to the assignment questions in order.", "For students: LaTeX tremendously helps you in writing clean and well-structured proofs (a necessity for a rigorous proof ) as well as editing an already written proof further.", "For submissions, only one member of the group submits the full solutions on Crowdmark and lists the name of their partners in the group.", "In this case, all members of the group lose one of their extensions.", "However, you can bring in a one-page cheat sheet with you to the exam.", "The final exam follows the same policies as the mid-term exam for blank solutions, one-page cheat sheet, and missed exams.", "Course Project (only for graduate students registered in CS 666)", "Policies and Statements", "Email is fast and tends to give the illusion of constant and immediate access.", "Also, please use email only to communicate specific concerns, questions, or comments regarding your experience in the course, or setting up appointments for in-person meetings outside office hours in case necessary.", "I am using bunch of different email filters to manage my (unmanageable) inbox and I may not get to see emails without this format at all...", "Please let us know ways to improv", "Please inform us of these at the start of the course.", "Your Health & Well-Being", "This is a challenging course with various advanced topics and not-so-easy assignments and exams.", "All of these are going to be time and energy consuming.", "I expect that any assignment or exam you submit in this course will be your own product and follows the collaboration and external resources policies specified earlier in this course outline.", "Intellectual property includes items such as:"]}, {"course_id": 43, "course_code": "CS 479", "course_name": "CS479 - Neural Networks (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["04:00PM - 05:20PM", "04:00PM - 05:20PM", "Mohamed Hibat-Allah", "Xinyu Crystina Zhang", "Andy Zheng", "Junteng Zheng", "Simple neuron models and networks of neurons.", "Advanced topics, including adversarial inputs and biologically plausible learning methods.", "Formulate a neural learning method as gradient-based optimization", "Derive a neural learning method based on energy minimization", "Design neural-network solutions for different learning scenarios", "Identify some commonalities between artificial neural networks and the brain", "-", "Introduction, Neuron Models", "Hodgkin-Huxley", "Leaky Integrate-and-Fire", "-", "Synapses", "Formulation of Learning", "Loss functions", "-", "Error Backpropagation", "-", "Automatic Differentiation", "-", "Overfitting", "Optimization Considerations", "SGD", "Momentum", "-", "Vision", "-", "No classes", "-", "-", "Autoencoders", "Vector Embeddings", "-", "Advanced Autoencoders", "Diffusion Networks", "-", "-", "Population Coding", "Optimal linear decoding", "Transformations", "Dynamics", "-", "Biological backprop", "Instructions will be given for each programming assignment.", "A1 Jan 22 Neuron and synapse models", "A4 Mar 19 Recurrent networks", "The projects will be done in groups of 2 students, and will involve implementing a method from a paper, and reproducing some of its results.", "Continuity of In-Person Course Components", "The assignment procedures will not be affected by a cancellation of in-person classes since they are distributed and submitted online.", "Students will be given a 24-hour period during which the exam must be written.", "What you can do: GenAI can be used as a smart substitute for Google search, e.g., code debugging, finding plotting commands.", "What you can't do: GenAI must not be used to code up the logic of a solution, or part of a solution."]}, {"course_id": 50, "course_code": "STAT 441", "course_name": "STAT441 - Statistical Learning - Classification (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["10:00AM - 11:20AM B1 271", "Email: mlysy@uwaterloo.ca", "STAT 841: View requirements for STAT 841", "Describe the basic principles and methods of statistical classification.", "Know when to use each of these methods on a given dataset.", "Evaluate and compare the output of various classifiers.", "An Introduction to Statistical Learning with Applications in R, by James, Witten, Hastie & Tibshirani https://www.statlearning.com", "There will be two closed-book midterms worth 15% each on the following dates:", "There are no make-up midterms in this course.", "Discussion Board", "Please self-enroll at https://piazza.com/uwaterloo.ca/winter2025/stat441841cm763.", "You can generally expect a response from TAs within two business days.", "Software", "Material and assignments will require the use of R and Python programming languages, as well as the technical document writing programs for these languages: R Markdown and Quarto.", "Regrades", "Email", "Emails which do not adhere to this standard will generally be ignored.", "Intellectual property includes items such as:", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 51, "course_code": "STAT 442", "course_name": "STAT442 - Data Visualization (0.50)", "term_name": "List 1", "program_name": "Computational Mathematics", "program_id": 38, "major_id": 2, "major_name": "Computational Mathematics Minor", "topics": ["Notice of Recording", "Data Visualization Winter 2025", "11:30AM - 12:20PM B1 271", "Discussion Board", "Email", "Response time", "Both human perception and statistical properties inform the methods used to display and visually explore categorical, continuous, time-ordered, map, and high dimensional data.", "Statistical concepts visually presented include variability, densities, quantiles, conditioning, and hypothesis testing.", "Interactive graphics include linking, brushing, motion, and the navigation of high dimensional spaces guided via projection indices.", "Interpret and critique the most commonly used kinds of visualizations today.", "Create a variety of univariate, bivariate, and multivariate graphs using base R and the tidyverse.", "Look up the necessary code to complete additional graphs not covered here.", "Book - Data Science - A First Introduction.", "Book - The Chicago Guide to Multivariate Analysis, Jane E. Miller", "Book - Cool Infographics - Effective Communication with Data Visualization and Design, Randy Krum.", "Industry Paper - Making Data Meaningful, United Nations Economic Commission for Europe.", "Notice of Recording", "No waiving of this penalty will occur for technical issues.", "Details can be found here: https://uwaterloo.ca/math/accommodations", "Phone: 519-884-0000 extension 213", "Lots of people look like they have it together in public and online when they're a mess inside too.", "They got you into university, so they've already done most of the work, but at this point, the most they can really do for you decide if you can get into graduate school before doing industry experience.", "Don't let that be your reason for thinking this is as good as it gets.", "In particular:", "Please inform me of these at the start of the course."]}, {"course_id": 4, "course_code": "MATH 115", "course_name": "MATH115 - Linear Algebra for Engineering (0.50)", "term_name": "1A Term", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Linear Algebra for Engineering Fall 2024", "02:30PM - 03:20PM", "RCH 301", "RCH 301", "10:30AM - 11:20AM E7 5353", "02:30PM - 03:20PM", "E. Dupont", "03:30PM - 04:20PM E7 5343", "10:30AM - 12:20PM RCH 301", "10:30AM - 12:20PM", "PHY 313", "E. Dupont", "08:30AM - 09:20AM", "08:30AM - 10:20AM PHY 313", "08:30AM - 10:20AM RCH 309", "10:30AM - 11:20AM RCH 103", "11:30AM - 12:20PM RCH 103", "RCH 204", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "08:30AM - 10:20AM EV3 4412", "08:30AM - 10:20AM MC 4058", "02:30PM - 03:20PM", "09:30AM - 10:20AM RCH 302", "F. Al-Faisal", "10:30AM - 12:20PM MC 4063", "10:30AM - 12:20PM MC 4060", "10:30AM - 11:20AM RCH 110", "F. Al-Faisal", "03:30PM - 04:20PM", "02:30PM - 04:20PM MC 4060", "DWE 3522", "Tuesday -", "07:00PM - 08:50PM", "Linear equations, matrices, and determinants.", "Introduction to vector spaces.", "Eigenvalues and diagonalization.", "Present solutions to problems in a clear and logical manner with all steps being fully justified.", "Understand the basic operations of addition and scalar multiplication as they apply to vectors, matrices and linear transformations.", "Find the solution to a system of linear equations using matrices and elementary row operations.", "Understand matrix algebra and its connection to systems of equations.", "Have both a geometric and an algebraic understanding of span, linear independence, bases and subspaces.", "Recognize the link between matrices and linear transformations, and understand that many common geometric operations such as projections, reflections and rotations are linear transformations.", "Develop a basic algebraic and geometric understanding of complex numbers and complex polynomials.", "Determine the eigenvalues and eigenvectors of a matrix and diagonalize a matrix.", "1.1 Vectors in Rn", "1.2 Linear Combinations", "1.3 The Norm and the Dot Product", "1.4 Vector Equations of Lines and Planes", "1.5 The Cross Product in R3", "1.6 The Scalar Equation of Planes in R3", "1.7 Projections", "Chapter 2 Systems of Linear Equations", "2.1 Introduction and Terminology", "2.2 Solving Systems of Linear Equations", "2.3 Rank", "2.4 Homogeneous Systems of Linear Equations", "3.1 Matrix Algebra", "3.2 The Matrix-Vector Product", "3.3 The Matrix Equation Ax=b", "3.4 Matrix Multiplication", "3.5 Matrix Inverses", "4.1 Spanning Sets", "4.2 Geometry of Spanning Sets", "4.3 Linear Dependence and Linear Independence", "4.4 Subspaces of Rn", "4.5 Bases and Dimension", "4.6 Fundamental Subspaces of a Matrix", "Chapter 5 Linear Transformations", "5.1 Matrix Transformations and Linear Transformations", "5.2 Examples of Linear Transformations", "5.3 Operations on Linear Transformations", "5.4 Inverses of Linear Transformations", "5.5 The Kernel and the Range", "Chapter 6 Determinants", "6.1 Determinants and Invertibility", "6.2 Elementary Row and Column Operations", "6.3 Properties of Determinants", "7.1 Basic Operations", "7.2 Conjugate and Modulus", "7.3 Polar Form", "7.4 Complex Polynomials", "7.5 Complex nth Roots", "Chapter 8 Eigenvalues and Eigenvectors", "8.1 Introduction", "8.2 Computing Eigenvalues and Eigenvectors", "8.3 Eigenspaces", "8.4 Diagonalization", "8.5 Powers of Matrices", "Linear Algebra for Engineering Fall 2024 Course Notes Required text provided on LEARN Yes", "Linear Algebra with Applications by Keith Nicholson Optional text provided on LEARN No", "The Linear Algebra for Engineering Fall 2024 Course Notes is the required text for this course, and is available on LEARN.", "The text Linear Algebra with Applications is an optional text also available on LEARN for those students looking for an alternate exposition of the material and/or additional problems to work on.", "Students looking for extra practice beyond the course notes are welcome to attempt problems in the corresponding sections of the optional textbook.", "Python Assignments: Throughout the term, there will be 5 equally weighted assignments where students will use python to execute some prewritten code in an effort to explore some larger-scale applications of linear algebra.", "If you find yourself in a situation where you are missing multiple assessments, then you are advised to contact both your instructor and the First Year Engineering Office to make sure you have the proper supports in place to succeed in this courses.", "To be clear - such websites are not allowed to be used for the completion of any part of the course MATH 115, and students are not permitted to share questions from the course anywhere.", "Generative AI: This course includes the independent development and practice of specific skills, such as computations, problem solving and proof writing.", "Library for research-based assignments"]}, {"course_id": 6, "course_code": "COMMST 192", "course_name": "COMMST192 - Communication in the Engineering Profession (COMPE, ELE, MGTE) (0.50)", "term_name": "1A Term", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["D. Shakespeare", "In this course students in Computer, Electrical, and Management Engineering will enhance oral and written communication competencies in contexts relevant to the engineering profession.", "By participating in classes and completing course assignments, you will practice genres of communication crafted for audiences that might include employers, clients, peer groups, technical staff, public audiences, and regulatory and policy-focused stakeholders.", "By focusing on genre, design, and audience, you will come to better understand concepts including meaning-making, perception, and responsibility.", "More generally, in this course, students can and should learn professional norms of technical communication and dominant forms of sharing knowledge within the fields of engineering.", "Yet this course also attempts to teach students how these communicative forms are matters of social context and sites of negotiation and contestation.", "We also hope students will find their place and voice in the conversations in their fields of study and reflect on the meaning and shape of available forums for technical communication.", "describe and apply conventions, genres, and norms, and values of communication in an engineering discipline", "compose persuasive, audience-specific technical arguments", "analyze and summarize technical content in a clear and concise way", "You (students) will understand the complexity of communication as a human process of shared meaning-making in the context of power, history, and culture.", "You will increase your capacity to recognize and enhance yours and others’ agency – the ability to make a difference in the world for yourself and others – and understand the implications of your communication behaviours for yourself and others.", "You will recognize diverse linguistic practices and modes of communication as resources for writers and speakers.", "You will understand communication as a practice, and improve your critical and creative communication competencies by developing your ability to use writing, speaking, and other media of communication to create effective and engaging artifacts.", "You will reflect on your role in fostering the public good (the multifaceted well-being of individuals and groups), begin to imagine a better future, and make decisions in your communication that can transform the communities to which you belong.", "4 September Introduction to the Course \"The Art of Communicating Science\" (TED) acquire course text", "9 September Introduction to Rhetoric; Facts, Evidence, and Opinions Crowley & Hawhee; McBrayer read assigned texts", "18 November Ethics for Engineers in-class texts", "27 November Discourse and Power", "Late assignments will be penalized at a rate of 3% per day, including weekends and holidays.", "To record your efforts, you will be given a participation sheet that you will complete at the end of each session: you'll rate yourself for your performance and describe your in-class activities.", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website"]}, {"course_id": 10, "course_code": "ECE 124", "course_name": "ECE124 - Digital Circuits and Systems (0.50)", "term_name": "1B Term", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Digital Circuits and Systems Winter 2025", "Monday -", "Monday", "08:30AM - 10:20AM", "03:30PM - 04:20PM E7 5343", "Monday -", "Monday", "08:30AM - 10:20AM", "08:30AM - 09:50AM RCH 302", "11:30AM - 12:20PM RCH 302", "Number systems and Boolean arithmetic.", "Boolean algebra and simplification of Boolean functions.", "View requirements for ECE 124", "understand Boolean algebra and manipulate Boolean operations to simplify related functions,", "comprehend logic gates, and design, optimize and implement combinational logic circuits,", "gain knowledge of digital storage elements and finite state machines, and design and analyze synchronous sequential circuits,", "grasp the essential principles of analyzing and designing asynchronous sequential circuits,", "understand common number systems for signed numbers and design basic arithmetic circuits", "Boolean logic and algebra", "Algebraic simplification and applications", "Optimized implementations", "Introduction to sequential circuits", "Design of synchronous sequential circuits", "Asynchronous sequential circuit analysis and design", "Number representations and simple arithmetic circuits", "Number conversion (review & self-study).", "Binary logic and circuits.", "Don’t cares and multiple outputs.", "Flip-flop choices.", "Analysis of ASC.", "Hazards free circuits.", "Number systems (octal and hex).", "Presentations in E2-2364 by lab instructor", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "The time and room number for the tutorial sessions where some of the practice problems will be solved/discussed are", "Tut 101, 102 & 103:   3:30-4:20M in E7-5343", "Labs are integral part of the course and must be completed in a satisfactory manner.", "The weights on these remote exams will remain the same as those stated earlier for the case of in-person (see weight distribution tables under Student Assessment).", "This course includes the independent development and practice of specific skills, such as FPGA design coding with VHDL or Verilog Hardware description languages.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca"]}, {"course_id": 11, "course_code": "ECE 140", "course_name": "ECE140 - Linear Circuits (0.50)", "term_name": "1B Term", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Linear Circuits Winter 2025", "ECE 140", "ECE 140 001", "03:30PM - 04:20PM E7 5343", "Friday -", "Friday", "04:30PM - 05:20PM", "M. Cooper-Stachowsky", "04:30PM - 05:20PM", "Friday -", "Friday", "ECE 140 201", "08:30AM - 11:20AM E2 3344", "ECE 140 202", "08:30AM - 11:20AM E2 3344", "08:30AM - 11:20AM E2 3344", "ECE 140 204", "01:30PM - 04:20PM E2 3344", "01:30PM - 04:20PM E2 3344", "01:30PM - 04:20PM E2 3344", "ECE 140 101", "08:30AM - 11:20AM E5 4106", "ECE 140 102", "08:30AM - 11:20AM E5 4106", "ECE 140 103", "08:30AM - 11:20AM E5 4106", "02:30PM - 04:20PM DWE 3518", "ECE 140 105", "ECE 140 106", "Section 001 - Computer Engineering", "Email: derek.wright@uwaterloo.ca", "Office: E7-3324", "Bookings include a Teams link when in-person meetings are not possible.", "Section 002 - Software Engineering", "Email: mstachowsky@uwaterloo.ca", "Email:    m4alsaad@uwaterloo.ca", "Katherine Idzik", "Email:    kidzik@uwaterloo.ca", "TAs Name Duty Email", "Avraiem Iskandar Labs a2iskand@uwaterloo.ca", "Analysis of linear circuits.", "Preparing for, conducting, and reporting of laboratory experiments.", "View requirements for ECE 140", "Understand the characteristics and properties of linear electric circuit components", "Analyze intermediate linear circuits under DC, transient and AC operating conditions", "Use (apply) appropriate electronics lab tools for building and debugging intermediate linear circuits", "3.[1-4,6]", "12 Mar 23 Sinusoidal Steady-State Analysis 13.[1,2,4] Tutorial 5", "1 3 Voltage and Current", "3 9 Circuit Analysis Methods", "4 11 Operational Amplifiers", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 12, "course_code": "ECE 192", "course_name": "ECE192 - Engineering Economics and Impact on Society (0.25)", "term_name": "1B Term", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Economics and Impact on Society Winter 2025", "03:30PM - 04:20PM E7 5343", "Monday, Friday -", "This course teaches engineering economics and the impact of engineering on the society at large.", "Important concepts of engineering economics including cash flow diagrams, present worth, quantification of impact costs, and rate of return analysis are presented.", "Energy supply scenarios and the environment, global energy use and supply, and environmental impacts of engineering projects are discussed.", "View requirements for ECE 192", "Prepare a cash flow diagram and perform cash flow analysis", "Perform a rate-of-return analysis for an engineering problem", "Solve economic problems and evaluate engineering project alternatives", "Chapters 1: Economic Analysis and Cost Estimation", "Decision Making and Problem Classification", "Engineering Cost Estimation and Cash Flow Diagrams", "Chapters 2: Economic Analysis and Cost Estimation", "The Power of Compounding", "Compound InterestFactors", "Non-uniform CashFlows", "Depreciation", "Present Worth Analysis", "Future Worth Analysis", "Annual Worth Analysis", "Chapter 5: Internal Rate of Return Analysis", "Payback Period Analysis", "Chapter 6: Other Rate of Return Analysis", "Chapter 7: Cost-Benefit Analysis", "Benefit-Cost Ratio", "Incremental Benefit-Cost Analysis", "Sensitivity Analysis", "Break-even Analysis", "Basic Probability and Expected-Value Analysis", "Chapter 9: Decision Making", "Decision-Tree Analysis", "eTextbook: Engineering Economics: Financial Decision Making for Engineers (Canadian Edition) Yes TBD", "E.M., and Pirnia, M., Engineering Economics: Financial Decision Making for Engineers, 6th ed., Pearson Canada, 2016."]}, {"course_id": 15, "course_code": "ECE 204", "course_name": "ECE204 - Numerical Methods (0.50)", "term_name": "2A Term", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Numerical Methods Winter 2025", "ECE 204", "ECE 204 002", "03:30PM - 04:20PM E7 4043", "02:30PM - 03:20PM", "E7 4043", "03:30PM - 04:20PM E7 4043", "ECE 204 001", "08:30AM - 09:20AM E7 4043", "10:30AM - 11:20AM E7 4043", "09:30AM - 10:20AM E7 4043", "ECE 204:", "Application of computational methods to engineering problems.", "Number systems, errors and error propagation.", "Introduction to numerical linear algebra.", "Interpolation and numerical integration.", "Introduction to numerical solutions of ordinary differential equations, optimization.", "View requirements for ECE 204", "As an overview, this course will introduce the application of computational methods for modeling and simulating real-world physical systems.", "By comprehending the limitations of such arithmetic, we can develop computational methods that enable us to mitigate these effects allowing us to, in turn, to attain sufficiently accurate approximations or simulations within a practical timeframe.", "To describe, examine, design and develop tools that can be used to approximate solutions to both linear and nonlinear algebraic equations and systems of such equations.", "To describe, examine, design and develop tools that can be used to approximate solutions to analytic equations (initial- and boundary-value problems) and systems of such equations.", "Also, the Department of Electrical and Computer Engineering cancels classes during mid-term week and, instead, offers make-up lectures.", "2 Representation of real numbers", "3 Tools for finding numerical algorithms", "3.2 Iteration and fixed-point iteration", "3.3 Linear algebra", "3.4 Interpolation", "3.6 Bracketing", "3.7 Intermediate-value theorem", "3.8 Summary of tools and looking ahead", "5 Introduction to approximating the value of expressions", "5.1 Evaluating a polynomial at a point and Horner's rule", "5.2.1 Approximating values using interpolating polynomials", "5.3 Least-squares best-fitting polynomials", "5.3.1 Approximating a point using least-squares best-fitting polynomials", "5.3.2 Approximating the derivative using least-squares best-fitting polynomials", "5.3.3 Approximating an integral using least-squares best-fitting polynomials", "6 Approximating solutions to algebraic equations", "6.1 Approximating the solution to the quadratic equation", "6.2 Approximating solutions to non-linear algebraic equations", "6.2.3 The bracketed secant method", "6.2.4 The secant method", "6.3 Approximating solutions to systems of linear equations", "6.3.1 The Gauss-Seidel method", "6.3.2 The method of successive over-relaxation", "6.4 Approximating solutions to systems of non-linear equations", "6.4.1 Newton's method in n dimensions", "7.1.1 Approximating solutions to initial-value problems (IVPs)", "7.1.1.1 Approximating solutions to first-order IVPs", "7.1.1.1.1 Euler's method", "The 4th-order Runge-Kutta method", "7.1.1.1.4 Error analysis of these methods", "7.1.1.2 Adaptive techniques for 1st-order initial-value problems (IVPs)", "7.1.1.2.1 Adaptive Euler-Heun method", "7.1.1.2.2 Adaptive Dormand-Prince method", "7.1.1.3 Approximating solutions to systems of 1st-order IVPs", "7.1.1.4 Approximating solutions to higher-order IVPs", "7.1.1.5 Approximating solutions to systems of higher-order IVPs", "7.1.2 Approximating solutions to boundary-value problems", "7.1.2.1 The shooting method", "7.1.2.2 The finite-difference method", "7.1.2.3 Neumann and insulated boundary conditions", "7.2 Approximating solutions to partial differential equations", "7.2.1 The heat equation in one dimension", "7.2.2 The wave equation in one dimension", "8 Optimization", "8.1 Optimizing functions of a real variable", "8.1.1 Step-by-step optimization", "8.1.2 Newton's method for finding extrema", "8.1.3 The golden-ratio search", "8.2 Optimizing functions of a vector variable", "8.2.1 Hooke-Jeeves method", "8.2.2 Newton's method for finding extrema in n dimensions", "The University of Waterloo also has a site licence for Matlab., which you may choose to use other than Octave.", "The laboratory sessions are help sessions where you can speak to a teaching assistant.", "MOSS is used to verify that all source code in projects is not plagiarized from peers either from this offering or previous offerings of this course.", "Notice of Recording", "Generative artificial intelligence: This course includes the independent development and practice of specific skills, such as software design and development.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at uWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 24, "course_code": "ECE 224", "course_name": "ECE224 - Embedded Microprocessor Systems (0.50)", "term_name": "2B Term", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Embedded Microprocessor Systems Fall 2024", "ECE 224", "ECE 224 001", "Monday, Friday -", "E7 4043", "ECE 224 002", "Monday, Friday -", "08:30AM - 09:50AM E7 4043", "11:30AM - 12:20PM E7 4043", "Rabiul Islam r25islam@uwaterloo.ca", "Emon Sarkar esarkar@uwaterloo.ca", "View requirements for ECE 224", "Course introduction: In this course, you will explore the design of embedded systems and computer interfaces.", "How should data be organized?", "When should data be exchanged?", "What conditions must be satisfied to reliably exchange data?", "Identify system realities (such as noise, jitter, metastability, and transmission line effects) and select suitable approaches for managing these realities in an embedded computer system.", "Compare and critically assess design tradeoffs in an embedded computer system.", "Analyze the effects of synchronization mechanisms on the operational characteristics of an embedded computer system.", "Design hardware and software components to reliably connect devices to an embedded computer system.", "Course Introduction", "An introduction to the teaching team, course expectations, deliverables, marking scheme, and a very brief introduction to interfacing concepts.", "Embedded Systems", "A review of the fundamentals of embedded systems and the terminology associated with embedded systems.", "Interfacing Software, Device Drivers and Synchronization", "A review of embedded software design concepts, followed by a discussion of synchronization concepts and analysis.", "A detailed examination of the design and behavior of drivers for shared and transmission lines, including considerations of signal integrity.", "Buses and Interconnections", "A comparison of the functional behavior and timing behavior of synchronous, asynchronous, partially interlocked asynchronous, semi-synchronous, and split cycle bus systems.", "Arbitration", "A detailed examination of alternatives for interconnection arbitration including both centralized and distributed arbitration techniques.", "Parallel Interfacing", "This includes an examination of the role of the interface in matching bus timing and signaling characteristics with a device's timing and signaling characteristics.", "Serial Interfacing", "This includes a comparison of asynchronous communication techniques and synchronous techniques as well as the protocols for serial communication.", "Error Detection and Correction", "An introduction to error detection and error correction including a discussion of error types, differences in detection and correction, and one example of an error correcting code (the Hamming code).", "Analog Interfacing", "An introduction to digital-to-analog interfacing, analog-to-digital interfacing, and sample-and-hold circuitry.", "This includes a discussion of static and dynamic errors.", "Examples", "You may use these exams to assess your preparation for the exams in the course.", "Assessment Estimated Completion Time Completion Date", "Lab studies: Lab studies are to be completed in groups of two.", "Students then write C software using the Intel Nios II Software Build Tools to control their embedded system to achieve a specified design goal.", "Lab Study 0: This is an introductory lab study that examines the design of a system-on-a-programmable chip (SOPC) design.", "In this lab, students design, build, and test a 32-bit microprocessor system based on the Nios II processor core.", "The hardware design and the board support package serve as a starting point for both Lab Study 1 and Lab Study 2.", "In this lab study, students design a software system that uses pushbuttons, LEDs, 7-segment displays, timers, polling loops, and multiple interrupt handlers to conduct an experiment into servicing a device.", "In this lab study, students design a software system to read a pre-recorded audio file from an SD card, process the audio data, and play it back on a speaker using a DAC.", "Students are given broad latitude to design the system.", "When a lab study builds upon previous submissions, comments such as \"In the previous submission, concerns were expressed related to the number of sample points in the experiment.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm and those who support others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 25, "course_code": "ECE 252", "course_name": "ECE252 - Systems Programming and Concurrency (0.50)", "term_name": "2B Term", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Systems Programming and Concurrency Fall 2024", "ECE 252", "ECE 252 001", "Monday, Friday -", "11:30AM -", "E7 4043", "Monday, Friday -", "10:00AM - 11:20AM E7 4043", "M. Cooper-Stachowsky", "11:30AM - 12:20PM E7 4043", "ECE 252 101", "E7 4043", "ECE 252 102", "04:30PM - 05:20PM", "ECE 252 201", "08:30AM - 11:20AM E2 3346", "ECE 252 202", "ECE 252 204", "08:30AM - 11:20AM E2 3346", "Mike Cooper-Stachowsky (Section 2): Mike came to the university of Waterloo in 2014 where he worked in the first year office helping new students transition into university.", "He is particularly interested in operating systems and systems programming, and learned a lot by writing his own kernel for the x86.", "Manavjit Singh Dhindsa -- ms2dhind@uwaterloo.ca", "Sheikh Abrar Tahmid -- sa2tahmi@uwaterloo.ca", "ECE 252:", "Performance and correctness of concurrent systems.", "Deadlock detection and recovery; file systems.", "View requirements for ECE 252", "This course assumes you are comfortable programming in a low level programming language (likely C++ from your Algorithms and Data Structures course).", "Apply standard concurrency scenarios such as producer-consumer, readers-writers, dining philosophers, as well as deadlock and starvation.", "Interact with the Linux operating system through the command-line interface and the C language API.", "Use inter-process communication such as shared memory and message queues.", "Do you need a textbook?", "To request that a question be re-marked, you will need to submit your request in writing via e-mail to the instructor.", "Collaboration and Group Work.", "Please bring this situation to the attention of the course staff as soon as possible so that can be resolved quickly.", "However, each group must submit their own, independently-developed code for each lab.", "Similarly, each person must submit their own, independently-developed code for each assignment.", "I suggest you avoid looking at other people’s code entirely, but if you do, then you should not be doing that anywhere you might be writing your own code.", "The temptation to write your code just like what you see is simply too high.", "However, penalties may be more severe for repeat offenders (see below for information on Academic Integrity).", "All of the above applies to multiple instances — a student caught in several incidents of academic dishonesty will be subject to the above penalties for each of the incidents.", "Laptop and Device Policy: The human visual system has evolved to perceive saber-toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text-mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "Piazza is a great tool for collaboration and it allows rapid but asynchronous exchange of infor mation.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be difficult to interpret on a discussion forum.", "In either case, we will cancel all the in-person lectures and in-class exercises during the relevant period and try to have some online synchronous video lectures during that period.", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, Chat- GPT) and how such tools can be used to write and test code.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 26, "course_code": "ECE 298", "course_name": "ECE298 - Instrumentation and Prototyping Laboratory (0.25)", "term_name": "2B Term", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Instrumentation and Prototyping Laboratory Fall 2024", "08:30AM - 11:20AM E2 3353", "08:30AM - 11:20AM E2 3353", "08:30AM - 11:20AM E2 3353", "08:30AM - 11:20AM E2 3353", "08:30AM - 11:20AM E2 3353", "Prototyping such as printed circuit board design and manufacture.", "View requirements for ECE 298", "Getting any electronic design from a concept to a PCB assembly requires knowledge with practical engineering techniques,", "with design development software and with Lab instrumentation.", "expand their levels of experience in these areas.", "Each student will be purchasing a kit from the W Bookstore to build a PCB assembly of this non-embedded design.", "Students will work in teams of two to design a feasibility model of a solution and then", "prepare it for a prototype development cycle.", "3) GAIN FAMILIARITY WITH THE USE OF LAB EQUIPMENT in design debug", "4) DEVELOP AND PRESENT A PROTOTYPE DESIGN FOR A MINI-DESIGN REVIEW.", "5) PREPARE A PCB DESIGN AND DOCUMENTATION FOR A PROTOTYPE DESIGN SUBMISSION", "(5c) Apply the workflow for designing and assembling embedded systems", "(4a) Define requirements and specifications for an open-ended design problem", "Lab B2 –Embedded Project: Preparations for Final Feasibility Model Development and DEMO", "Develop the Project functions using a breadboard as a platform to interface kit components and the MCU Development board.", "Develop the MCU code to operate each component interface circuit individually first.", "Lab B3 –Embedded Project: Preparations for FINAL FEASIBILITY MODEL Schematic Design and FINAL Feasibility Model DEMO & DESIGN REVIEW VIDEO:", "Develop a schematic of the Final Feasibility Model design using Proteus tools.", "Create NET CLASSES in the schematic.", "Create a Video for a mini-Design Review of your Feasibility Model Schematic Design.", "Lab B4 –Embedded Project: Prototype Development and Report", "Cover all design details and organize them for a Prototype Report.", "PROTOTYPE MODEL Report Development Begins", "Prototype Model Development Report - Team Mark 15%", "LAB B1 starts SEPT 23", "EMBEDDED PROJECT: PROTOTYPE SCHEMATIC AND PCB DESIGN FILES."]}, {"course_id": 28, "course_code": "ECE 327", "course_name": "ECE327 - Digital Hardware Systems (0.50)", "term_name": "3A Term", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Digital Hardware Systems Winter 2025", "ECE 327 / ECE 627", "10:00AM - 11:20AM E7 4053", "11:30AM -", "ECE 327 101", "ECE 327 201", "04:30PM - 05:20PM E7 4053", "04:30PM - 05:20PM", "04:30PM - 05:20PM E7 4053", "Maran Ma: E2-3354A Wednesday 1:30-2:30pm", "Design and modelling of digital hardware systems using a hardware description language.", "Power analysis and optimization.", "View requirements for ECE 327", "ECE 627:", "Introduction to power analysis and optimization.", "Introduction to faults and testing.", "View requirements for ECE 627", "The design and engineering of computing chips is an exciting, and valuable skill that spans multiple engineering disciplines including software engineering, parallel programming, verification and reasoning, compilation techniques, down to physical/analog/electrical effects.", "This course will help open the door to careers in the richly-rewarding chip design industry in a variety of roles such as RTL developers, verification engineers, system-level developers, and future leaders and managers.", "ECE327 will be vital to navigate these exciting times.", "We must think about and understand concurrent operations at a cycle-by-cycle level of abstraction.", "There are commonly used paradigms, and design patterns that we must known when organizing the RTL code.", "We will learn how to break down a complex design into these components, and learn how to reason about correctness, and understand their translation to hardware primitives.", "Most digital design are constrained to fit specific cost targets, and the analysis tools help guide the design process with appropriate feedback.", "These compilation iterations are fundamental to digital design and a good designer knows how to direct the tools, rewrite Verilog code, and generate the desired hardware.", "A class project will be used to tie together all the key design lessons we learn in this course.", "We will be developing a large-language model (LLM) solution involving a matrix multiplier as part of the project.", "Describe hardware components at the RTL-level in Verilog, verify these designs through simulation, and map these design to an FPGA fabric.", "Introduction - Introduction to hardware design, quick look at concurrency, debugging, synthesis and entire hardware design flow.", "Reasoning about parallelism in Verilog and drawing timing waveforms/diagrams from the code and vice versa.", "State Machines - Sequential logic design in the form of controllers (or state machines).", "Retiming - Automating pipelining of feed-forward datapaths.", "Strategies and ideas for retiming steps.", "Static Scheduling - Time-shared reuse of hardware resources.", "Construction of static scheduling tables based on resource constraints.", "Design of state machine controllers, and datapaths building blocks.", "Dynamic Scheduling - Dynamic scheduling of resource shared datapaths.", "Timing Analysis - Understanding clock frequency and algorithms for timing analysis.", "Elmore Delay - Simplified high-level model of wire delays.", "Power - Power/energy analysis of hardware components.", "Analytical expressions for power and energy.", "ECE627-only] FPGAs - FPGA Logic, Interconnect, and Architecture, Introduction to reconfigurable hardware/FPGAs, understanding logic design, interconnect and overall composition.", "For relevant labs, the course uses the AMD/Xilinx Pynq FPGA boards available in E2-2356A.", "FPGA board deployment will be done as part of some of the labs, and you will get a chance to rectify errors should this fail.", "Remember, the final exam covers the entire course!", "Precise determination will be done on a case-by-case basis.", "- For any missed graded item, we offer the option of taking a final if you miss it for a legitimate reason as per university guidelines.", "Plagiarism in ECE327 will likely manifest in the form of copying RTL code, scripts, bitstreams as-is or recast with minor modifications.", "We have a MOSS configuration to check code plagiarism and we take this seriously.", "We understand that these circumstances can be troubling, and you may need to speak with someone for emotional support."]}, {"course_id": 29, "course_code": "ECE 350", "course_name": "ECE350 - Real-Time Operating Systems (0.50)", "term_name": "3A Term", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Real-Time Operating Systems Winter 2025", "ECE 350", "ECE 350 001", "08:30AM - 09:50AM E7 4053", "11:30AM -", "ECE 350 201", "01:30PM - 04:20PM E2 2356A", "ECE 350 202", "01:30PM - 04:20PM E2 2356A", "01:30PM - 04:20PM E2 2356A", "ECE 350 101", "10:00AM - 11:20AM E7 4053", "About Prof. Zarnett", "8 years industry engineering experience in display & imaging", "Research specialization brain-machine interfacing", "Ahmed Elbaroudy - ammaelba@uwaterloo.ca", "Neeraj Nagar - nnagar@uwaterloo.ca", "Memory and virtual memory and caching; I/O devices, drivers, and permanent storage management; process scheduling; queue management in the kernel; real-time kernel development.", "Aspects of multi-core operating systems.", "View requirements for ECE 350", "Understand the differences between non-real-time and real-time operating system.", "The course notes should be pretty much everything you need for this course.", "I read them so you don’t have to!", "They are neither required nor recommended, but I'll list them here in case you truly wish to look at them.", "Operating Systems Internals and Design Principles (9th Edition).", "Please bring this situation to the attention of the course staff as soon as possible so that can be resolved quickly.", "However, each group must submit their own, independently-developed code for each lab.", "Similarly, each person must submit their own, independently-developed code for each assignment.", "I suggest you avoid looking at other people’s code entirely, but if you do, then you should not be doing that anywhere you might be writing your own code.", "The temptation to write your code just like what you see is simply too high.", "However, penalties may be more severe for repeat offenders (see below for information on Academic Integrity).", "All of the above applies to multiple instances — a student caught in several incidents of academic dishonesty will be subject to the above penalties for each of the incidents.", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, ChatGPT) and how such tools can be used to write and test code.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be diﬃcult to interpret on a discussion forum.", "The human visual system has evolved to perceive saber‐toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text‐mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions."]}, {"course_id": 36, "course_code": "ARBUS 202", "course_name": "ARBUS202 - Professional and Business Ethics (0.50)", "term_name": "Ethics List", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["11:30AM -", "V. Fernandes", "Study of ethical and moral issues that typically arise in professional and business activity.", "In the context of this course we will look specifically at ethical issues and principles of conduct that are relevant to professionals and business people.", "Topics include: fundamentals of moral and political theory, ethical decision-making, professional responsibility, corporate social responsibility, and equality, among other things.", "Like many other courses in philosophy, this series of lectures, readings, and discussions will deal with a critical analysis of many and varied views regarding life, existence, values, religious belief, etc.", "Form an opinion on the importance of ethical reasoning in business and professional contexts.", "Identify ethical problems in complex professional and business related situations.", "Apply ethical concepts to particular business and professional situations.", "Explain the roles of professional codes of conduct and codes of ethics in real world contexts.", "1 Jan 6 - 10 Introduction", "Module 2 Check-in", "3 Jan 20 - 24 Ethical Decision Making", "Module 3 Check-in", "5 Feb 3 - 7 Equality & Discrimination", "Module 6 Check-in", "7 Feb 24 - 28 Markets & the Environment", "Module 7 Check-in", "Module 9 Check-in", "Module 10 Check-in", "11 Mar 24 - 28 Whistle-blowing and Codes of Ethics", "Module 11 Check-in", "Module 12 Check-in", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 41, "course_code": "BIOL 110", "course_name": "BIOL110 - Biodiversity, Biomes, and Evolution (0.50)", "term_name": "Natural Science List", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Labs begin the week of **Sept. 9**", "(Any issues in laboratory should contact Dr. Wolff)", "Monitor LEARN for important information", "A survey of organisms that inhabit a range of aquatic and terrestrial ecosystems (e.g., coral reefs, lakes, forests).", "Evolutionary and ecological frameworks will be used to explore how organisms diversify and are considered distinct species.", "The laboratory for this course is integrated with the lecture (unlike some of your other first year courses) - you will need to be sure to read the lab exercises before attending, and come prepared for our outdoor labs where appropriate shoes and clothing are necessary for the weather.", "I teach courses in ecology, evolution and genetics.", "I have been teaching evolution and ecology at the University of Waterloo for 7 years, and I hope to share with students my enthusiasm for phylogenetics.", "List themes and characteristics that differentiate the major groups of eukaryotes.", "Identify specific animals that facilitate and/or endanger human society.", "Construct and evaluate phylogenetic trees using parsimony", "Introduction", "Phylogeny and the modern view of biological relatedness", "Ecosystems and Resource Flux", "**Oct. 28  Midterm**", "Concepts in Diversity", "Activities will include using microscopes and drawing what you see, dissections of preserved animals, and collecting benthic invertebrates from the local stream and identifying them using pictoral keys.", "Note: You can also choose to do neither and forego the bonus mark altogether, as this is voluntary.", "Participation in Research Study", "Reminder, as participation in this study is voluntary, and it is a bonus mark, students may also decide to not do either activity and forego the bonus mark altogether.", "Notice of Recording", "In the case of an unwritten final exam, your course mark will be entered as DNW (32% for calculation of overall average)."]}, {"course_id": 42, "course_code": "BIOL 130", "course_name": "BIOL130 - Introductory Cell Biology (0.50)", "term_name": "Natural Science List", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["S. Ruffell", "An introduction to the concepts of cell biology with emphasis on (1) the structural organization of the cell and (2) the function of critical molecular processes that are characteristic of living organisms.", "Explain the fundamental elements of cells, the chemistry of life, and the major classes of biological macromolecules.", "Describe metabolism, the role of enzymes in chemical reactions, and how cells can capture, and utilize, energy.", "Explain how cells respond to signals and form cellular communities.", "Module 1 - Introduction to Cell Biology & The Cell Theory", "Module 2 - Molecules of Life", "2 Module 3 - Cells and Membranes  In-class case study", "3 Module 4 - Nucleic Acids & Information Flow", "4 Module 5 - Protein Structure, Function & Synthesis  In-class case study", "6 Module 7 - Cellular Respiration In-class case study", "In-class case study", "9 Module 9 - Cell Signalling", "10 Module 10 - Cell & Tissue Form", "and In-class case study", "11 Module 11 - DNA Replication & Cell Division Case study due", "12 Module 11 - DNA Replication & Cell Division  Term Test 1", "Official Grades and Course Access", "At the end of each unit there is a list of important terms and concepts to review.", "Students are encouraged to read the material in assigned chapters for each module for the achieve assignments and term tests.", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines", "Library for research-based assignments"]}, {"course_id": 43, "course_code": "BIOL 130L", "course_name": "BIOL130L - Cell Biology Laboratory (0.25)", "term_name": "Natural Science List", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["02:30PM - 05:20PM", "STC 4018", "02:30PM - 05:20PM", "STC 4018", "However, we do run multiple labs at the same time which means we may not always be in the office.", "Situation", "Please email Dr. Gurska directly at jola.gurska@uwaterloo.ca", "What does it mean to be a cell biologist?", "One group of scientists might explore growing tissues in a laboratory to one day produce artificial skin or organs.", "No matter what their question, cell biologists use a similar set of laboratory skills that allow them to peek inside the tiniest of biological units that make up the diversity of organisms we see around us.", "Although fundamental techniques like microscopy have hugely advanced since the invention of the light microscope, every cell biologist needs to learn how to properly use a microscope to see cells reliably.", "These can be very tricky to use properly but doing so could be the difference between a world-changing discovery and an experiment that no one can replicate.", "These and other methods that are integral to working in the cell biology field will be introduced in this laboratory and it is my hope that you will leave confident in these fundamental techniques.", "Maintain a well-organized and comprehensive lab book.", "Identify elements of a well-structured laboratory report and write some elements of a lab report.", "Assignment 3 Model Organisms and Experimental Design 3%", "I welcome any inquiries regarding AccessAbility accommodations.", "Some examples of what will be noted includes the following:", "did you complete the bioskills exercises during the first lab?", "did you behave in a respectful and professional manner in the lab?", "Using a micropipette without a tip,", "Holding a micropipette upside down with liquid in the micropipette tip,", "Setting a micropipette precariously close to the edge of the bench so that it may fall on the floor,", "Forcing the pipettes past their minimum and maximum calibrated ranges", "Keeping a thorough lab book is a critical skill learned in a biology laboratory to document key observations and procedures.", "Some reagents will already be set up to use at your bench, while others will be in dispensing bottles on the side bench or in the fume hoods, in which case the liquid must be dispensed directly from the bottles.", "These can be purchased at the W Store Essentials in the STC.", "Since many standard laboratory reagents are volatile, please consider not wearing contact lenses in the laboratory.", "When not in use, stools should be tucked away under-bench and personal items stowed underneath in cupboards.", "Finally, please remember that safety should be a collective concern.", "They will be reviewed at the end of the term for statistical purposes only.", "The goal of the draft submissions is to teach you the capabilities of Turn-it-in analysis and to encourage you to use the software to improve your paraphrasing and referencing.", "Details on how to interpret Turn-it-in reports and use the draft Dropboxes can be found under Content on LEARN.", "As outlined under Quizzes section above, please note that the BIOL 130L online multiple-choice quizzes are designed to be completed in half the time you are given.", "Expectation of Academic Integrity", "This course includes the independent development and practice of specific skills, such as scientific writing and communication.", "Poorly paraphrased information without in-text citation 5 marks off for each", "Poorly paraphrased information with in-text citation 3 marks off for each", "Well paraphrased information without in-text citation 3 marks off for each", "Lab Manual is cited in Results and/or Discussion 1 mark off for each citation", "A reference in the reference list does not have corresponding in-text citations 5 marks off for each", "An in-text citation is not in the reference list 5 marks off for each", "Misconduct; student’s name will be sent to the Associate Dean to check if this is the first misconduct"]}, {"course_id": 44, "course_code": "BIOL 150", "course_name": "BIOL150 - Organismal and Evolutionary Ecology (0.50)", "term_name": "Natural Science List", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Organismal and Evolutionary Ecology Fall 2023", "11:30AM - 12:20PM RCH 101", "Learn Discussion Board", "Email and Appointment Requests", "Coverage includes hypothesis testing and the nature of scientific inquiry, basic population genetics, physiological ecology, life histories, dispersal, basic population and community ecology, macroevolution, systematics and classification, as well as functional morphology.", "The theory of evolution unites the whole of biology and all living organisms into a coherent body of knowledge, allowing comparisons across all forms of life.", "Ecology describes how organisms interact with their environment and each other to create interdependent systems from microscopic to global scales.", "These disciplines are fundamentally tied together: evolution is the primary mechanism by which species adapt to their environment; ecological interactions and environmental variability drive natural selection.", "You will also carry out simulated lab assignments to test the principles of evolution, design ecological experiments to test alternate hypotheses about the conservation of species and manipulate demographic parameters to test their influence on population growth.", "Understand the principles of scientific methodology", "Define ecological and evolutionary terms, such as the niche, adaptation, and altruism", "Illustrate these mechanisms in the context of course examples", "Explain how ecological interactions and evolution are interconnected", "Sign code of conduct and upload to LEARN.", "2) Sept 8 Evolution for Ecology Section 1: Evolution and Ecology are Intertwined", "4) Sept 13 Evolution for Ecology", "5) Sept 15 Evolution for Ecology Section 3: Genetics and Evolution", "6) Sept 18 Evolution for Ecology Section 4: Managing the Evolution of Resistance", "9) Sep 25 Physiological Ecology Section 1: Trade-offs and Species Distributions", "15) Oct 9-13 Holiday – No classes Understanding Experimental Design Simulation due by Oct 16, 11:59 pm", "16) Oct 16 Empiricism in Ecology Understanding Experimental Design Simulation due by 11:59 pm (best 2/3 for 10%)", "It is important that you review the information below before you subscribe to the SimUText for Organismal Ecology and Evolution - Chapters at University of Waterloo.", "SimUText Application Installers", "SimUText Application Installers", "At the end of every unit, you will work individually to develop a concept map using Cmap Cloud to visually display the relationships among what you consider the key concepts in the unit.", "These should represent your personal comprehension of how the concepts relate to each other, and no two should be identical.", "Also, class will entail a lot of discussion that won’t be represented in PPT slides.", "The simulations include one on Evolution in Ecology, one on Experimental Design in Ecology and one on Population Growth.", "The learning outcome for the unit tests is to demonstrate your recall and comprehension of the material covered in the units and to incentivize keeping up with the readings and attending lectures and reviewing for the final exam.", "The learning outcome is to demonstrate recall, synthesis and integration of material learned during the course.", "The final exam will consist of multiple-choice, T/F, solve the equation type of questions and integration questions that are designed to test your basic and deeper understanding of the course concepts.", "Important note regarding tests and exams", "Unit tests will be completed for the first 4 units of the course.", "Ensure you have a reliable internet connection and functional computer to complete them – technical challenges encountered during remote completion are not an excuse for missed tests.", "I will have a limited number of printed back-ups for students in class who experience technical difficulties.", "You will need to have a reliable internet connection and functional computer to complete the exams.", "Emails can be received 24 hours per day.", "If you miss a make-up exam for any reason, you will be given a DNW, and must petition the Associate Dean of Science if you feel you missed it for a valid reason.", "At the discretion of the instructor, you may be permitted to write a make-up exam.", "The timing will be conveyed to you via e-mail if you are eligible for a make-up.", "If you follow these steps,", "I will consider granting an extension", "Students are responsible for their own behavior and should be mindful of the impact that their actions have on the wellbeing of others.", "Act in a respectful and open manner when listening to the views and ideas of others.", "Participate fully in the discussion boards: make sure your answers are to the best of your ability and that you respond to others’ posts.", "Signature"]}, {"course_id": 47, "course_code": "BIOL 220", "course_name": "BIOL220 - Introduction to Plant Structure and Function (0.50)", "term_name": "Natural Science List", "program_name": "Computer Engineering", "program_id": 39, "major_id": 2, "major_name": "Computer Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Plant Structure and Function Winter 2025", "11:30AM - 12:20PM RCH 101", "S. Schoor", "I will make my best effort to respond to emails within 24 hrs.", "An introduction to plant diversity, and the anatomy and physiology of vascular plants.", "Understand the importance of the relationship between plants and humans in the environment and appreciate the species richness and diversity of plants", "Recognize and identify various cell types and how they account for the structure and function of tissues and organs", "Plant Evolution: Structure and Reproduction", "Focus will be applied to the adaptive strategies employed by algae to move from water to land, the development of complex tissues and organs and the role of reproduction strategies in plant success.", "Cellular composition of plant tissues and what role they play in their function will be studied; with particular interest in the relationship between vascular tissue and water transport.", "Additionally, students will study how hormones and growth regulators regulate plant development, tropic movement and plant response to biotic and abiotic stressors, as well as learn of their many uses in agriculture.", "Week 1 Jan 6 (1) Introduction & The Plant Cell (Ch 1,3) No labs this week", "Laboratory Mark Distribution", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline)."]}]