[{"course_id": 36, "course_code": "ECON 372", "course_name": "ECON372 - Business Finance 2 (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Business Finance 2 Fall 2024", "ECON 372", "10:00AM - 11:20AM DWE 3517", "For your convenience, office hours will be both in person and through MS Teams on a first-come-first-serve basis.", "Email: prajsic@uwaterloo.ca", "“ECON 372” must appear in the subject line and the message must include your full name and student ID number.", "This course examines a number of topics relevant to financial practitioners.", "View requirements for ECON 372", "The purpose of this course is to provide students with advanced topics in corporate finance and their applications.", "The key concepts and topics to be covered include security valuation, risk and return, risk diversification, capital asset pricing model (CAPM), investment performance measurement, financial derivatives, and forecasting.", "Students will learn how to apply these concepts to real world problems using various examples and case studies.", "The course deepens the general framework of financial landscape offered in ECON 371 by discussing the role of financial instruments and institutions in the economy.", "The goal is to develop a deeper understanding of financial markets and investment strategies.", "understand the need for firms and individuals to make financial decisions and together work towards overcoming the universal problem of scarcity;", "appreciate the relevance of finance in a changing world;", "explain why maximizing market value is the logical financial goal of the corporation", "calculate and interpret some key measures of firm performance", "understand and apply the Capital Asset Pricing Model", "describe how options markets can be used to manage risk", "identify different types of debt financing available to a firm", "understand why investment decisions, rather than financing decisions, fundamentally determine the value and cost of capital of the firm", "create pro forma income statements and balance sheets.", "Introduction to Advanced Business Finance:", "Review of Key Concepts in Finance", "Review of Key Concepts in Finance", "Capital Markets and the Pricing of Risk", "Capital Markets and the Pricing of Risk", "Determining the Cost of Capital", "Determining the Cost of Capital", "Risk and the Pricing of Options", "Financial Planning and Forecasting:", "Financial Modeling and Pro Forma Analysis", "The purpose of the review quizzes is to help students identify and understand key concepts covered in the lectures and in the textbook.", "The persuasive essay assignment is supposed to incorporate theoretical aspects of the course that are communicated to a general audience with some basic background and interest in financial issues.", "Under the Training & Support tab, you will find helpful information including technical support.", "Midterms and Final Exam", "The format for midterms and the final exam will be a mix of multiple-choice questions, numerical calculation questions, and written problems.", "Missing a Midterm Due to Self-Isolation", "Please carefully read the Economics Department policy on deferred final exams for instructions.", "Intellectual property includes items such as:", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "Economics Department Deferred Final Exam Policy"]}, {"course_id": 39, "course_code": "INDEV 100", "course_name": "INDEV100 - Introduction to International Development (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to International Development Fall 2023", "Students obtain an overview of the multi-dimensional and transdisciplinary nature of development.", "Themes include theories and strategies of development; history of development; relevance of context (culture, economics, and politics); the impact of law and international regulatory bodies; environmental influences; urbanization; the factors of health, literacy and violence; development agencies.", "Reference is made to particular development problems in specific developing countries.", "Discriminatory and intolerant language is unacceptable, but openness about these complicated issues is encouraged using thoughtful and respectful language.", "You can expect the instructor to respond to emails within 48 hours exclusive of weekends and holidays.", "To identify and critique the history of International Development concepts, theories, actors, and institutions.", "To explain and assess key development issues in the field of International Development.", "Is International Development legitimate?", "Tentative guest speakers are also indicated in the schedule below.", "Sep 21 Colonialism and Post-Development   Haslam et al.", "Nov 24 Tutorial: The City Water Index & the multi-facetedness of development issues.", "12 Nov 28 Democracy in Development   Haslam et al.", "Introduction to International Development: Approaches, Actors, Issues and Practices.", "Participation is defined in this course as frequent and relevant contributions to in-class discussions, in the form of either questions or comments, that provide new critical insight or knowledge and foster an environment of inclusivity and respect in the classroom.", "Each quiz has 20 multiple-choice questions which cover the main concepts and ideas of the section of the curriculum.", "Do not email the instructor until you have read and completed the following.", "Please be sure to read the rubric before starting your assignment.", "your name and student number;", "**Please note that your mark can be raised, lowered, or remain the same through a re-grade**", "*", "*", "* Please submit your paper for consideration by email to the instructor no later than one week following your receipt of the decision by the TA.", "Include a formal business letter that includes the following information:", "your name and student number;", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 42, "course_code": "STAT 231", "course_name": "STAT231 - Statistics (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "03:30PM - 04:20PM DC 1350", "02:30PM - 03:20PM", "11:30AM - 12:20PM MC 1085", "03:30PM - 04:20PM", "10:30AM - 11:20AM EIT 1015", "09:30AM - 10:20AM EIT 1015", "Email: aslynko@uwaterloo.ca", "Email: liqun.diao@uwaterloo.ca", "Email: yangjc@uwaterloo.ca", "Email: henan.xu@uwaterloo.ca", "Funmilayo Adeku", "Email: fadeku@uwaterloo.ca", "This course provides a systematic approach to empirical problem solving which will enable students to critically assess the sampling protocol and conclusions of an empirical study including the possible sources of error in the study and whether evidence of a causal relationship can be reasonably concluded.", "The connection between the attributes of a population and the parameters in the named distributions covered in STAT230 will be emphasized.", "Numerical and graphical techniques for summarizing data and checking the fit of a statistical model will be discussed.", "The method of maximum likelihood will be used to obtain point and interval estimates for the parameters of interest as well as testing hypotheses.", "The interpretation of confidence intervals and p-values will be emphasized.", "The Chi-squared and t distributions will be introduced and used to construct confidence intervals and tests of hypotheses including likelihood ratio tests.", "Contingency tables and Gaussian response models including the two sample Gaussian and simple linear regression will be used as examples.", "Course Information Webpage", "Please do not send these questions via email.", "I expect everyone to be respectful to each other, any posts that do not meet the principles in Policy 33: Ethical Behaviour will be removed.", "Email", "Please send emails from uwaterloo.ca email address and include the session number and student ID number.", "Continuity Plans", "Use numerical and graphical summaries of a data set to describe the characteristics of a variate and to check the fit of a statistical model to the data.", "Use the steps of PPDAC to identify both the objectives and possible sources of error in an empirical study, and to critically evaluate the conclusions.", "Identify the connection between attributes of a population and the parameters in the named distributions (Binomial, Poisson, Multinomial, Exponential, Normal).", "Define and use the likelihood function to obtain point estimates of the unknown parameters in a model particularly for the Binomial, Poisson, Multinomial, Exponential and Gaussian (Normal) models.", "Use a pivotal quantity to construct a confidence interval for a parameter in some specific cases, and interpret the confidence interval.", "Use the likelihood function to construct and conduct a test of hypothesis for an unknown parameter in a model.", "Interpret p-values and describe the connection with confidence intervals.", "Define the properties of the Chi-squared and t distribution.", "Define a Gaussian response model including simple linear regression; determine point and interval estimates and conduct tests of hypotheses for the parameters in a Gaussian model.", "Use a Goodness of Fit test to test the fit of a model, independence in a two-way table and equality of proportions for two or more groups", "Describe the importance of randomization and pairing in experimental design and be able to recognize whether a study design allows the researcher to conclude cause and effect.", "This learning consists of taking the time to carefully read the course notes on your own, making sure you understand the concepts and steps demonstrated in the lectures to tackle examples, and then solving the end-of-chapter problems.", "Monday", "Friday", "Welcome", "1.1 Introduction to Statistical Sciences", "1.3 Numerical Data Summaries", "1.3 Graphical Summaries", "1.4 Probability Distributions and Statistical Models", "1.5 Data Analysis and Statistical Inference", "1.6 Introduction to R and RStudio", "2.1 Choosing a Statistical Model", "2.2 Estimation of Parameters", "2.3 Method of Maximum Likelihood", "2.4 Likelihood Functions for Multinomial Models", "2.5 Invariance Property of MLE", "2.6 Checking the Model", "3.1 Planing and Conducting Empirical Studies", "3.2 Steps of PPDAC", "3.3 Case Study", "4.1 Statistical Models and Estimation", "4.2 Estimators and Sampling Distributions", "4.4 Confidence Intervals and Pivotal Quantities", "4.5 The Chi-Squared and t Distributions", "4.6 Likelihood-Based Confidence Intervals", "4.7 Confidence Intervals for Parameters in the Gaussian model", "4.7 Confidence Intervals for Parameters in the Gaussian model (Continued)", "5.1 Introduction to Hypothesis Testing", "5.2 Test of Hypotheses for Parameters in the Gaussian Model", "Relationship Between Hypothesis Testing and Confidence Intervals", "5.3 Likelihood Ratio Test of Hypothesis - One parameter", "6.1 Gaussian Response Models", "6.2 Simple Linear Regression: Maximum Likelihood and Least Squares Estimates", "Confidence Interval for Parameters in the Model", "6.3 Checking Model Assumptions and Residual Plots", "Randomization, Paring, and Experimental Design", "7.1 Likelihood Ratio Test for the Multinomial Model", "7.2 Goodness of Fit Tests", "This learning consists mostly of making sure you understand the concepts and steps that were introduced and used in class to solve examples and then solving problems from the Course Notes on your own.", "R Statistical Software", "R and the RStudio development environment can be downloaded from here.", "All assessments are proctored, in-person, and closed-book exams.", "A 2.5-hour cumulative final examination will be held during the final exam period (April 9 - 25, 2025).", "If you have a question regarding the marking of an assessment, you should first check the posted solutions on LEARN.", "First and last name", "Session number", "Please be specific and explain your rationale for a remark.", "Notice of Recording", "Short-term absence", "COVID-19-related absence", "No limits on number of submissions per term and only available during the formal lecture period", "In particular:", "Please inform us of these at the start of the course.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 43, "course_code": "STAT 333", "course_name": "STAT333 - Stochastic Processes 1 (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["11:30AM - 12:20PM DC 1350", "04:00PM - 05:20PM", "Erik Hintz: Fridays, 2:00pm - 3:00pm, in M3-2106", "Requests must be emailed to: sasugradadv@uwaterloo.ca", "Topics cover generating functions, conditional probability distributions and conditional expectation, discrete-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, applications including the random walk, the gambler's ruin problem, and the Galton-Watson branching process, an introduction to counting processes, connections between the exponential distribution and Poisson process, and non-homogeneous and compound Poisson processes.", "use moment generating functions as a tool to determine expected values and identify probability distributions of random variables;", "use the law of total expectation to calculate expected values and probabilities through the principle of conditioning;", "specify a discrete-time Markov chain (DTMC), in terms of its transition probability matrix and initial conditions, and calculate various transition probabilities;", "classify the states of a DTMC;", "define fundamental DTMC concepts including irreducibility, periodicity, and recurrence/transience;", "find limiting/stationary probability distributions for certain DTMCs through the use of the Basic Limit Theorem;", "calculate absorption probabilities and expected absorption times for DTMCs using the principle of conditioning with respect to the first transition;", "Week 11 March 24 - March 28 Chap 4: Exponential Distribution & Poisson Processes Tutorial Assignment 2", "Week 12 March 31 - April 4 Chap 4: Exponential Distribution & Poisson Processes Tutorial Test 3", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solving exercises from the Course Notes on your own.", "Introduction to Probability Models by Sheldon M. Ross (2019)"]}, {"course_id": 0, "course_code": "CS 349", "course_name": "CS349 - User Interfaces (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["04:00PM - 05:20PM", "Please contact her in regards to any accommodations, including those for illness and short-term absences.", "Bella Chen", "Zitao Wang", "Beginning in the second week, we hold regular weekday office hours in-person and online within the CS 349 team (via Microsoft Teams).", "An introduction to contemporary user interface implementation concepts, including event abstraction, graphical components, layout, feedback, testing, accessibility, and architectures to develop user interfaces.", "Explain architectural and algorithmic details underlying current user interfaces and user interface toolkits.", "Implement user interfaces in a browser using Typescript: (1) using the HTML Canvas; (2) using HTML elements and DOM manipulation, and (3) using a modern UI web development framework", "5 Feb 3 - Feb 7 Dispatch, Layout A1", "11 Mar 24 - Mar 29 Direct Manipulation, Accessibility", "Exams", "Final, in-person tbd tbd", "It has code relating to lectures and a git submodule with the SimpleKit UI toolkit.", "See the README for details for cloning and keeping everything up to date.", "A1-A4 4 x 13% = 52%", "You should conform to the tools and versions specified in the assignment description.", "Out-of-scope Language Features", "Please review policies for Academic Integrity, Using Code from Other Sources, and Using Advanced AI Systems under Course Policies.", "You may use code examples provided in-class (i.e., in the CS349 public repo).", "You may directly use or include portions of these in-class samples in your assignments.", "You may discuss how you accomplished something in general terms with other students, but you may not directly share code.", "Self-Declared Short-term Absence", "There are no extensions beyond the maximum 48-hour late period after the original deadline.", "You can use any code from this term's offering of CS 349 without documenting it as a source.", "This includes starter code for assignments, code shown in lectures, and code from the course code repo.", "Using Advanced AI Systems", "Use of advanced AI systems to generate code (ie.", "Intellectual property includes items such as:", "All source code written by the instructor and provided in lecture, as starter code for an assignment, or in a sample code repository.", "Inclusiveness", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 1, "course_code": "CS 449", "course_name": "CS449 - Human-Computer Interaction (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Human-Computer Interaction Fall 2024", "11:30AM -", "10:00AM - 11:20AM B2 350", "11:30AM -", "10:00AM - 11:20AM B2 350", "10:00AM - 11:20AM DC 1350", "LEC - Monday 10-11:30am DC 1350", "An introduction to the fundamental theories, methods, and research in the design and evaluation of novel computational artifacts designed to meet real-world human needs.", "Through lectures and design activities, students work in teams of 5 to design a solution for a real-world problem.", "The end result of the team project is a high-fidelity interactive prototype of a mobile application, targeted at solving a particular real-world problem.", "Identify the primary luminaries in Interactive Design and HCI", "Identify your target users", "Design studies to understand your users and their needs within a sociocultural context", "Create user data-driven designs and prototypes of different levels of fidelity", "Design studies to evaluate designs during different stages of the project", "Properly gather and analyze qualitative and quantitative data from semi-structured interviews, paper prototype evaluation, heuristic evaluations and cognitive walkthrough", "Discover a variety of HCI research methodologies", "Add a high-quality design of an interesting product to your design portfolio", "The success of a team project depends critically on each student being a responsible member of the team, i.e., showing up and participating.", "Special consideration can be made for a few exceptions (e.g., academic travel, illnesses and family emergencies).", "Deliverables and Late Penalties", "Intellectual property includes items such as:"]}, {"course_id": 2, "course_code": "BET 360", "course_name": "BET360 - Design Frameworks for Social Ventures (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Design Frameworks for Social Ventures Fall 2024", "BET 360", "In this course, students will explore several design frameworks as they relate to complex problems; assess the impacts of these frameworks in recent entrepreneurial applications; and determine how to apply these concepts in the design of the social impact aspects of ventures and cross-industry collaborations.", "View requirements for BET 360", "Articulate the importance of design, and design thinking in solving problems for social and environmental change, through entrepreneurial ventures", "Understand, describe, and apply emerging frameworks in designing for social impact (ie.", "Collaborate with others to explore significant social problems using critical lenses", "Design, when everybody designs: An introduction to design for social innovation.", "Thinking in Systems: A primer.", "Electronic Device Policy", "Accommodation for Students with Disabilities", "This course includes the independent development and practice of specific critical thinking skills, such as;", "To understand, explain, and analyze base content knowledge around a range of topics in social impact and design, curated for this course", "Library for research-based assignments"]}, {"course_id": 6, "course_code": "PACS 315", "course_name": "PACS315 - Engineering and Peace (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Engineering and Peace Fall 2024", "07:00PM - 09:50PM CGR 1302", "Office Hours: Online or in-person meetings can be booked via Calendly between 8:30 AM – 4:30 PM on weekdays", "This course is built on the conviction that the kinds of problems engineers seek to address, and the ways they seek to address them, should matter for anyone interested in advancing peace in the world.", "Topics include historical connections between the discipline of engineering and warfare, understanding the engineering method and mindset, and technological frontiers for peacebuilding.", "Augment their approach to analyzing and solving problems with insights from both engineering and peacebuilding theory and practice; and", "Identify opportunities to apply their expertise and passions to make a meaningful social impact", "Why has war been the business of so many engineers?", "Sep. 18", "Sheldon Fernandez", "UWaterloo Turkstra Chair in Urban Engineering", "Critical Media Lab", "Communitech", "Laurel Boytim", "The Ripple Effect Education", "Engineers as social innovators Riley, “We’ve Been Framed!”", "Global Peace Index 2024 Institute for Economics & Peace.", "Morgan & Claypool Publishers, 2007.", "We’ve Been Framed!", "Also available for free through MIT Press Open Access] No", "Engineers of Jihad: The Curious Connection Between Violent Extremism and Education.", "Engineers of Jihad: The Curious Connection Between Violent Extremism and Education.", "A Perusall-generated score of 2.0 or higher is required to receive credit each week, and the overall grade for this element will be based on the accumulation of these credits (2% per reading assignment up to a maximum of 10 credits).", "Engage with a guest engineer and/or peacebuilder.", "Each class will begin with a conversation with a guest speaker with expertise and life experiences related to the topics covered in this course.", "95% – Made a contribution that went above and beyond expectations by demonstrating an exceptional level of consideration and care, and/or providing a rare and surprising degree of insight", "Each submission should be a minimum of 250 words.", "Offer a critique of the book, highlighting both strengths and witnesses, as well as offering a recommendation for who would benefit most from reading the book.", "Why did you chose to attend this event?", "Who played a key role in leading the event?", "Please read Grebel's full land acknowledgement for additional context on the college’s connections to the first European settlers on this land.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "This course includes the independent development and practice of reflection and writing skills."]}, {"course_id": 8, "course_code": "STV 202", "course_name": "STV202 - Design and Society (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Design and Society Winter 2025", "Email: cshelley@uwaterloo.ca", "Email: js2kim@uwaterloo.ca", "View requirements for STV 202", "Topics include the nature of design, the social and cultural implications of design, the roles of designers in relation to the social contract, and design assessment in light of social values such as risk, fairness, progress, and sustainability.", "The course material provides a mixture of theoretical concepts and practical cases of their application.", "Describe concepts and perspectives relating to social and ethical aspects of good design.", "Analyze and evaluate designs in light of those concepts and perspectives.", "Compare concepts and perspectives and consider overlaps and differences among them.", "Reflect on the significance of social and ethical issues in their understanding of good design.", "The numbers in parentheses next to learning outcomes above refer to applicable Canadian Engineering Accreditation Board Engineering Graduate Attributes defined here: https://uwaterloo.ca/engineering/graduate-attributes", "Rational design & Social psychology.", "Social contracts & Agendas.", "Design and society: Social issues in technological design, Berlin: Springer.", "A 10-question, multiple-choice quiz is to be completed by each student on the course Learn site for each non-midterm module starting at the outset of week 2.", "Quiz questions each week relate to the textbook chapter(s) assigned for that week.", "Design discussions", "Discussions will take place each non-workshop week after week 1.", "Design presentations", "5 minutes) and may be chosen for viewing in subsequent classes.", "Midterms", "Midterm 1 covers chapters Good design through Culture, Midterm 2 covers chapters Social contract through Activism, and Midterm 3 covers chapters Risk through Sustainability.", "Grade exemptions", "To allow for situations not covered under the Late submissions policy (see below), each student’s lowest quiz, discussion,  presentation, and workshop grade will be dropped from the calculation of their overall grade in each of those categories.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 14, "course_code": "STV 305", "course_name": "STV305 - Technology, Society and the Modern City (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Email: cshelley@uwaterloo.ca.", "Cities may be humanity's most significant invention, where we shape our vision of the civilized life.", "At the same time, the demands of cities shape our lives in fundamental ways.", "The purpose of this course is to examine the technology of civilized life, with the city itself as both a technological system and a scene of technological living.", "View requirements for STV 305", "Describe concepts and perspectives relating to cities as socio-technical systems.", "Analyze and evaluate developments in cities in light of those concepts and perspectives.", "Reflect and communicate analyses of social and ethical aspects of technology and cities.", "Week 11 November 21 Smart cities", "Discussions", "Each student is expected to participate in in-class discussion each week.", "Summaries", "Summaries may be shared with the class to kick-start in-class discussion.", "Self-assessments", "Grade exemptions", "Each student’s lowest discussion mark and exercise mark will be dropped from the calculation of their overall mark in those categories.", "Students are welcome to request regrading of assignments.", "Test conflicts"]}, {"course_id": 18, "course_code": "ENGL 295", "course_name": "ENGL295 - Social Media (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["D. Deveau", "D. Deveau", "Email: danielle.deveau@uwaterloo.ca", "This course surveys the popular social media landscape and charts scholarly approaches, both methodological and theoretical, to understanding and analyzing social media texts.", "View requirements for ENGL 295", "This course surveys the popular social media landscape and charts scholarly approaches, both methodological and theoretical, to understanding and analyzing social media texts.", "Demonstrate proficiency in critical analysis of social media platforms and content", "Produce effective evaluations of social media through the communication theory lenses of audience; ownership; production; regulation; labour; and effects", "Identify key social media companies as well as regulatory tensions or gaps", "Demonstrate curiosity, engagement, and a desire to learn through active participation in the course", "Demonstrate professionalism and academic independence by participating fully, initiating your own learning, and meeting course milestones", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 34, "course_code": "CS 445", "course_name": "CS445 - Software Requirements Specification and Analysis (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Software Requirements Specification and Analysis Winter 2025", "10:00AM - 11:20AM MC 2035", "Email:x784chen@uwaterloo.ca", "Email: ar2elsha@uwaterloo.ca", "Email: d3pang@uwaterloo.ca", "Models, notations, and processes for software requirements identification, representation, analysis, and validation.", "ECE 451: View requirements for ECE 451", "The week of", "Deliverables", "1 Introduction", "3 RE Reference Model", "Jan 13 4 Domain Model 4 Domain Model D0 – Group members & Project idea", "Jan 27 7 Functional Modelling 8 OCL D1 – Domain Model & Stakeholders", "Feb 10 10 Quality Requirements 10 Quality Requirements D2 -  Use case Diagram & Description", "Feb 24 11 Requirements Conflict management 12 Prioritizing Requirements D3 – Functional Model & OCL", "Mar 3 13 Cost Estimation 14 Risk Analysis D4 – State Diagram", "Mar 17 15 Temporal Logic 16 Validation and Verification D5 – Cost Estimation & Risk Analysis", "Mar 31 17 Software Project Management 18 Requirement Engineering for AI Systems D6 - Quality Attributes and Temporal Logic", "Ability to separate requirements from specifications from domain assumptions and argue that a specification + domain assumptions satisfy requirements", "Ability to model requirements in a variety of modelling paradigms", "Ability to elicit and document non-functional requirements such that the to-be-developed software can be objectively tested for their satisfaction", "Ability to use tools to manage a Software Development Team.", "Why is requirements analysis complex?", "Functions as a modelling notation.  Pre- and post-conditions.", "Use-case diagrams.", "Functions over a class diagram.", "Modelling dynamic behaviour of a software system.", "UML State Machines.", "Specification patterns.", "7: Model Integration (1 hour)", "The expected contents and organization of a Software Requirements Specification (SRS).", "AI vs non-AI Systems based on what we covered in this course.", "Braek and Haugen, Engineering real-time systems: an object-oriented methodology using SDL, Prentice-Hall, 1993.", "Larman, Applying UML and Patterns, Prentice Hall, 2004.", "Maciaszek, Requirements Analysis and System Design, Addison Wesley, 2001.", "Bray, An Introduction to Requirements Engineering, Addison-Wesley, 2002.", "Nuseibeh and Zave, Software Requirements and Design:", "van Lamsweerde, Requirements Engineering: From System Goals to UML Models to Software Specifications, Wiley, 2009.", "Brooks, The Design of Design, Addison Wesley, 2010.", "Alan Davis, Just Enough Requirements Management: Where Software Development Meets Marketing, Dorset House Publishing, 2005.", "The project can be related to requirements engineering or a more general software engineering topic.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 35, "course_code": "ECE 451", "course_name": "ECE451 - Software Requirements Specification and Analysis (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Software Requirements Specification and Analysis Winter 2025", "10:00AM - 11:20AM MC 2035", "Email:x784chen@uwaterloo.ca", "Email: ar2elsha@uwaterloo.ca", "Email: d3pang@uwaterloo.ca", "Models, notations, and processes for software requirements identification, representation, analysis, and validation.", "ECE 451: View requirements for ECE 451", "The week of", "Deliverables", "1 Introduction", "3 RE Reference Model", "Jan 13 4 Domain Model 4 Domain Model D0 – Group members & Project idea", "Jan 27 7 Functional Modelling 8 OCL D1 – Domain Model & Stakeholders", "Feb 10 10 Quality Requirements 10 Quality Requirements D2 -  Use case Diagram & Description", "Feb 24 11 Requirements Conflict management 12 Prioritizing Requirements D3 – Functional Model & OCL", "Mar 3 13 Cost Estimation 14 Risk Analysis D4 – State Diagram", "Mar 17 15 Temporal Logic 16 Validation and Verification D5 – Cost Estimation & Risk Analysis", "Mar 31 17 Software Project Management 18 Requirement Engineering for AI Systems D6 - Quality Attributes and Temporal Logic", "Ability to separate requirements from specifications from domain assumptions and argue that a specification + domain assumptions satisfy requirements", "Ability to model requirements in a variety of modelling paradigms", "Ability to elicit and document non-functional requirements such that the to-be-developed software can be objectively tested for their satisfaction", "Ability to use tools to manage a Software Development Team.", "Why is requirements analysis complex?", "Functions as a modelling notation.  Pre- and post-conditions.", "Use-case diagrams.", "Functions over a class diagram.", "Modelling dynamic behaviour of a software system.", "UML State Machines.", "Specification patterns.", "7: Model Integration (1 hour)", "The expected contents and organization of a Software Requirements Specification (SRS).", "AI vs non-AI Systems based on what we covered in this course.", "Braek and Haugen, Engineering real-time systems: an object-oriented methodology using SDL, Prentice-Hall, 1993.", "Larman, Applying UML and Patterns, Prentice Hall, 2004.", "Maciaszek, Requirements Analysis and System Design, Addison Wesley, 2001.", "Bray, An Introduction to Requirements Engineering, Addison-Wesley, 2002.", "Nuseibeh and Zave, Software Requirements and Design:", "van Lamsweerde, Requirements Engineering: From System Goals to UML Models to Software Specifications, Wiley, 2009.", "Brooks, The Design of Design, Addison Wesley, 2010.", "Alan Davis, Just Enough Requirements Management: Where Software Development Meets Marketing, Dorset House Publishing, 2005.", "The project can be related to requirements engineering or a more general software engineering topic.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 40, "course_code": "CS 447", "course_name": "CS447 - Software Testing, Quality Assurance, and Maintenance (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Notice of Recording", "04:00PM - 05:20PM", "Weiyi Shang <wshang@uwaterloo.ca>", "Introduces students to systematic testing of software systems.", "ECE 453: View requirements for ECE 453", "Organized testing can help identify problems in software systems, enabling developers to fix these problems.", "And easier-to-test software is better software.", "• You will be able to create and evaluate test suites for reasonably-sized software systems.", "• You will learn how to effectively test during the software engineering process.", "Creating tests", "Test minimization", "Week 12 March 27th Field testing", "Late policy: every person can have a late (max 24 hours) deliverable once", "Notice of Recording"]}, {"course_id": 42, "course_code": "SE 465", "course_name": "SE465 - Software Testing and Quality Assurance (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Software Testing and Quality Assurance Winter 2025", "Introduces students to systematic testing of software systems.", "Engineering is about applying the appropriate amount of effort to make sure that systems work properly, especially systems that affect the public in some way.", "In this course, as software engineering students, you will learn about tools and techniques that you can use to make your software systems fit-for-purpose.", "write new test suites, improve existing test suites, and critique test suite quality using engineering judgment", "The week-by-week schedule might slip.", "I last taught SE 465 in Winter 2019 and the ECE 453 version in Winter 2023, but I think that you will benefit from the revamp I'm doing this term.", "Introduction", "Evaluating your tests: coverage, fuzzing, mutation-based fuzzing, mutation analysis", "Symbolic Execution", "Z3 SMT Solver", "Dynamic Symbolic Execution", "Semantics of Symbolic Execution", "Verification Condition Generation", "Bounded Model Checking", "Real-life Applications of Verification", "Metamorphic testing", "I anticipate that the final exam will be in-person, and that quizzes will be in-class in-person, though there are no guarantees.", "Acceptable collaboration includes discussing ideas and structures with others, as well as helping others debug their code.", "If your code is too close in structure to someone else's code, you are going to have a problem.", "Or, let's sum this up in two short instructions:", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, ChatGPT) and how such tools can be used to write and test code.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be diﬃcult to interpret on a discussion forum.", "The human visual system has evolved to perceive saber‐toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text‐mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 44, "course_code": "CS 459", "course_name": "CS459 - Privacy, Cryptography, Network and Data Security (0.50)", "term_name": "Required Courses", "program_name": "Software Engineering", "program_id": 152, "major_id": 4, "major_name": "Human-Computer Interaction Specialization", "topics": ["Privacy, Cryptography, Network and Data Security Winter 2025", "04:00PM - 05:20PM", "Office hours are assignment-dependent and their time/location will be disclosed during the introduction of each assignment.", "Introduction to privacy and security using cryptography and related techniques in networks, distributed systems, and data science.", "For at-rest protection, specific topics include the basics of cryptography and relevant ethics/policy concepts.", "Evaluate the use of cryptography to protect data assets in storage, transit, and use", "Analyze security and privacy threats to data assets, including the privacy level of various data release mechanisms, privacy-utility trade-offs, and statistical inference attacks to infer sensitive information", "Evaluate the use of network security hardware and software to protect data assets in transit and use.", "Introduction", "Lecture 1 - Logistics and Introduction to the course (Jan. 6th)", "Data Protected in Transit", "Assignments can be submitted multiple times, and the last one will be used for marking.", "Include a clear justification for your claims.", "Your paper should be a summary of past and current work on your topic, as well as an overview of known open problems and potential future directions in the area.", "Your proposal and paper paper should be formatted in the two-column ACM proceedings format, using one of the ACM SIG Proceedings Templates.", "The ACM templates include headings for “Categories and Subject Descriptors”, “General Terms”, and “Keywords”, which you do not need to use.", "Otherwise, in general, create a public one so that your peers can benefit too.", "Email:", "We understand that these circumstances can be troubling, and you may need to speak with someone for emotional support."]}, {"course_id": 2, "course_code": "MATH 115", "course_name": "MATH115 - Linear Algebra for Engineering (0.50)", "term_name": "1A Term", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Linear Algebra for Engineering Fall 2024", "02:30PM - 03:20PM", "RCH 301", "RCH 301", "10:30AM - 11:20AM E7 5353", "02:30PM - 03:20PM", "E. Dupont", "03:30PM - 04:20PM E7 5343", "10:30AM - 12:20PM RCH 301", "10:30AM - 12:20PM", "PHY 313", "E. Dupont", "08:30AM - 09:20AM", "08:30AM - 10:20AM PHY 313", "08:30AM - 10:20AM RCH 309", "10:30AM - 11:20AM RCH 103", "11:30AM - 12:20PM RCH 103", "RCH 204", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "08:30AM - 10:20AM EV3 4412", "08:30AM - 10:20AM MC 4058", "02:30PM - 03:20PM", "09:30AM - 10:20AM RCH 302", "F. Al-Faisal", "10:30AM - 12:20PM MC 4063", "10:30AM - 12:20PM MC 4060", "10:30AM - 11:20AM RCH 110", "F. Al-Faisal", "03:30PM - 04:20PM", "02:30PM - 04:20PM MC 4060", "DWE 3522", "Tuesday -", "07:00PM - 08:50PM", "Linear equations, matrices, and determinants.", "Introduction to vector spaces.", "Eigenvalues and diagonalization.", "Present solutions to problems in a clear and logical manner with all steps being fully justified.", "Understand the basic operations of addition and scalar multiplication as they apply to vectors, matrices and linear transformations.", "Find the solution to a system of linear equations using matrices and elementary row operations.", "Understand matrix algebra and its connection to systems of equations.", "Have both a geometric and an algebraic understanding of span, linear independence, bases and subspaces.", "Recognize the link between matrices and linear transformations, and understand that many common geometric operations such as projections, reflections and rotations are linear transformations.", "Develop a basic algebraic and geometric understanding of complex numbers and complex polynomials.", "Determine the eigenvalues and eigenvectors of a matrix and diagonalize a matrix.", "1.1 Vectors in Rn", "1.2 Linear Combinations", "1.3 The Norm and the Dot Product", "1.4 Vector Equations of Lines and Planes", "1.5 The Cross Product in R3", "1.6 The Scalar Equation of Planes in R3", "1.7 Projections", "Chapter 2 Systems of Linear Equations", "2.1 Introduction and Terminology", "2.2 Solving Systems of Linear Equations", "2.3 Rank", "2.4 Homogeneous Systems of Linear Equations", "3.1 Matrix Algebra", "3.2 The Matrix-Vector Product", "3.3 The Matrix Equation Ax=b", "3.4 Matrix Multiplication", "3.5 Matrix Inverses", "4.1 Spanning Sets", "4.2 Geometry of Spanning Sets", "4.3 Linear Dependence and Linear Independence", "4.4 Subspaces of Rn", "4.5 Bases and Dimension", "4.6 Fundamental Subspaces of a Matrix", "Chapter 5 Linear Transformations", "5.1 Matrix Transformations and Linear Transformations", "5.2 Examples of Linear Transformations", "5.3 Operations on Linear Transformations", "5.4 Inverses of Linear Transformations", "5.5 The Kernel and the Range", "Chapter 6 Determinants", "6.1 Determinants and Invertibility", "6.2 Elementary Row and Column Operations", "6.3 Properties of Determinants", "7.1 Basic Operations", "7.2 Conjugate and Modulus", "7.3 Polar Form", "7.4 Complex Polynomials", "7.5 Complex nth Roots", "Chapter 8 Eigenvalues and Eigenvectors", "8.1 Introduction", "8.2 Computing Eigenvalues and Eigenvectors", "8.3 Eigenspaces", "8.4 Diagonalization", "8.5 Powers of Matrices", "Linear Algebra for Engineering Fall 2024 Course Notes Required text provided on LEARN Yes", "Linear Algebra with Applications by Keith Nicholson Optional text provided on LEARN No", "The Linear Algebra for Engineering Fall 2024 Course Notes is the required text for this course, and is available on LEARN.", "The text Linear Algebra with Applications is an optional text also available on LEARN for those students looking for an alternate exposition of the material and/or additional problems to work on.", "Students looking for extra practice beyond the course notes are welcome to attempt problems in the corresponding sections of the optional textbook.", "Python Assignments: Throughout the term, there will be 5 equally weighted assignments where students will use python to execute some prewritten code in an effort to explore some larger-scale applications of linear algebra.", "If you find yourself in a situation where you are missing multiple assessments, then you are advised to contact both your instructor and the First Year Engineering Office to make sure you have the proper supports in place to succeed in this courses.", "To be clear - such websites are not allowed to be used for the completion of any part of the course MATH 115, and students are not permitted to share questions from the course anywhere.", "Generative AI: This course includes the independent development and practice of specific skills, such as computations, problem solving and proof writing.", "Library for research-based assignments"]}, {"course_id": 5, "course_code": "SE 101", "course_name": "SE101 - Introduction to Methods of Software Engineering (0.25)", "term_name": "1A Term", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Introduction to Methods of Software Engineering Fall 2024", "An introduction to some of the basic methods and principles used by software engineers, including fundamentals of technical communication, measurement, analysis, and design.", "Some aspects of the software engineering profession, including standards, safety and intellectual property.", "Professional development including résumé skills, interview skills, and preparation for co-op terms.", "Software Engineering Principles", "(b) Analysis and design", "2. Software Engineering Profession and Professionalism", "Labs will cover a series of software-engineering-relevant tools, related to the learning outcomes above.", "Assignments may be screened via automated grading and/or feedback software, and may also be subject to plagiarism detection via systems such as MOSS."]}, {"course_id": 6, "course_code": "CS 138", "course_name": "CS138 - Introduction to Data Abstraction and Implementation (0.50)", "term_name": "1B Term", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Introduction to Data Abstraction and Implementation Winter 2025", "10:30AM - 12:20PM", "10:00AM - 11:20AM RCH 302", "11:30AM - 12:20PM RCH 302", "11:30AM - 12:20PM MC 2034", "Email: migod@uwaterloo.ca", "Alireza Shaeri", "Email: cs138@uwaterloo.ca", "Email: w352chen@uwaterloo.ca", "Aniruddhan Murali", "Email: a25mural@uwaterloo.ca", "Email: w2ren@uwaterloo.ca", "Hanna Derets", "Email: sfking@uwaterloo.ca", "Office Hours: Scheduled by email and held through Microsoft Teams", "Software abstractions via elementary data structures and their implementation; encapsulation and modularity; class and interface definitions; object instantiation; recursion; elementary abstract data types, including sequences, stacks, queues, and trees; implementation using linked structures and arrays; vectors and strings; memory models; automatic vs. dynamic memory management.", "Understand and apply object-oriented programming concepts.", "Write object-oriented code that manipulates linked data structures.", "Write code without memory errors in a memory-unsafe programming language.", "Operating system and Unix concepts, programming language concepts", "Introduction to C++ concepts (3 hours)", "ADT and their implementations as linked structures (12 hours)", "The C/C++ memory model: pointers vs references, stack vs freestore", "Implementing and travesing linked structures", "Space and time complexity of solutions", "Simple testing and debugging strategies", "Object-based computing (9 hours)", "Class definitions, instantiation, object construction and destruction", "Objects vs pointers to objects", "Interface design and abstraction, responsibility allocation", "The adapter design pattern", "Introduction to object-oriented programming (9 hours)", "Introduction to inheritance and its implementation in C++", "Introduction to generics, type parameterization, and C++ templates", "The template method design pattern", "Use of generic data containers and the Standard Template Library", "Design heuristics and strategies for object-oriented programming", "-marking is intended for situations where minor changes result in major mark boosts (i.e. a forgotten semicolon failed 4/5 secret cases).", "A better title would be something like \"Iterating Over a Vector\" or \"Question About Maps.\"", "This course includes the independent development and practice of specific skills, such as as writing and reading code, tracing, and algorithm design.", "Library for research-based assignments"]}, {"course_id": 7, "course_code": "ECE 124", "course_name": "ECE124 - Digital Circuits and Systems (0.50)", "term_name": "1B Term", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Digital Circuits and Systems Winter 2025", "Monday -", "Monday", "08:30AM - 10:20AM", "03:30PM - 04:20PM E7 5343", "Monday -", "Monday", "08:30AM - 10:20AM", "08:30AM - 09:50AM RCH 302", "11:30AM - 12:20PM RCH 302", "Number systems and Boolean arithmetic.", "Boolean algebra and simplification of Boolean functions.", "View requirements for ECE 124", "understand Boolean algebra and manipulate Boolean operations to simplify related functions,", "comprehend logic gates, and design, optimize and implement combinational logic circuits,", "gain knowledge of digital storage elements and finite state machines, and design and analyze synchronous sequential circuits,", "grasp the essential principles of analyzing and designing asynchronous sequential circuits,", "understand common number systems for signed numbers and design basic arithmetic circuits", "Boolean logic and algebra", "Algebraic simplification and applications", "Optimized implementations", "Introduction to sequential circuits", "Design of synchronous sequential circuits", "Asynchronous sequential circuit analysis and design", "Number representations and simple arithmetic circuits", "Number conversion (review & self-study).", "Binary logic and circuits.", "Don’t cares and multiple outputs.", "Flip-flop choices.", "Analysis of ASC.", "Hazards free circuits.", "Number systems (octal and hex).", "Presentations in E2-2364 by lab instructor", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "The time and room number for the tutorial sessions where some of the practice problems will be solved/discussed are", "Tut 101, 102 & 103:   3:30-4:20M in E7-5343", "Labs are integral part of the course and must be completed in a satisfactory manner.", "The weights on these remote exams will remain the same as those stated earlier for the case of in-person (see weight distribution tables under Student Assessment).", "This course includes the independent development and practice of specific skills, such as FPGA design coding with VHDL or Verilog Hardware description languages.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca"]}, {"course_id": 8, "course_code": "ECE 140", "course_name": "ECE140 - Linear Circuits (0.50)", "term_name": "1B Term", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "Linear Circuits Winter 2025", "ECE 140", "ECE 140 001", "03:30PM - 04:20PM E7 5343", "Friday -", "Friday", "04:30PM - 05:20PM", "M. Cooper-Stachowsky", "04:30PM - 05:20PM", "Friday -", "Friday", "ECE 140 201", "08:30AM - 11:20AM E2 3344", "ECE 140 202", "08:30AM - 11:20AM E2 3344", "08:30AM - 11:20AM E2 3344", "ECE 140 204", "01:30PM - 04:20PM E2 3344", "01:30PM - 04:20PM E2 3344", "01:30PM - 04:20PM E2 3344", "ECE 140 101", "08:30AM - 11:20AM E5 4106", "ECE 140 102", "08:30AM - 11:20AM E5 4106", "ECE 140 103", "08:30AM - 11:20AM E5 4106", "02:30PM - 04:20PM DWE 3518", "ECE 140 105", "ECE 140 106", "Section 001 - Computer Engineering", "Email: derek.wright@uwaterloo.ca", "Office: E7-3324", "Bookings include a Teams link when in-person meetings are not possible.", "Section 002 - Software Engineering", "Email: mstachowsky@uwaterloo.ca", "Email:    m4alsaad@uwaterloo.ca", "Katherine Idzik", "Email:    kidzik@uwaterloo.ca", "TAs Name Duty Email", "Avraiem Iskandar Labs a2iskand@uwaterloo.ca", "Analysis of linear circuits.", "Preparing for, conducting, and reporting of laboratory experiments.", "View requirements for ECE 140", "Understand the characteristics and properties of linear electric circuit components", "Analyze intermediate linear circuits under DC, transient and AC operating conditions", "Use (apply) appropriate electronics lab tools for building and debugging intermediate linear circuits", "3.[1-4,6]", "12 Mar 23 Sinusoidal Steady-State Analysis 13.[1,2,4] Tutorial 5", "1 3 Voltage and Current", "3 9 Circuit Analysis Methods", "4 11 Operational Amplifiers", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 14, "course_code": "CS 240", "course_name": "CS240 - Data Structures and Data Management (0.50)", "term_name": "2B Term", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Data Structures and Data Management Winter 2025", "10:00AM - 11:20AM RCH 112", "11:30AM -", "10:30AM - 11:20AM MC 4040", "11:30AM - 12:20PM MC 4040", "Email: oveksler@uwaterloo.ca", "Email: cs240@uwaterloo.ca", "Email: cs240@uwaterloo.ca", "All of Tom's consulting hours are in-person in MC 4065.", "Email: cs240@uwaterloo.ca", "Email: cs240@uwaterloo.ca", "Email: cs240@uwaterloo.ca", "Instructional Support Coordinator: Karen Anderson", "Email: kaanders@uwaterloo.ca", "Introduction to widely used and effective methods of data organization, focusing on data structures, their algorithms, and the performance of these algorithms.", "CS 240: Data Structures and Data Management", "This course introduces widely used and effective methods of data organization, focusing on data structures, their algorithms, and the performance of these algorithms.", "Analyze, apply, and use various data structures and data-management techniques in a variety of applications", "Perform rigorous complexity analyses of simple algorithms and data structures, which includes writing correct mathematical proofs on inductively-defined structures and solving simple recurrence relations", "Select a good data structure to solve a specific algorithmic problem", "Apply data structures correctly and efficiently in one or more high-level programming languages, including C++", "Audience", "Successors: Most third-year CS major courses", "Conflicts: Other courses that seriously consider efficiency and correctness of fundamental data structures and their algorithms", "Analytical:", "Define and explain order notation; perform complexity analyses of simple algorithms", "Perform basic computations of discrete probability and expectation", "Use mathematical induction on recursively defined structures, including finding simple errors in inductive arguments", "Prove simple properties of program fragments correct through the use of pre-conditions and post-conditions for loops and recursive calls", "Computational and algorithmic:", "Design, implement, test, and debug C++ programs to solve problems requiring hundreds of lines of code", "Define the ADTs for stacks and queues; write efficient implementations in C/C++", "Describe tree structures, including binary search trees and multi-way trees; use these structures in C/C++ programs", "Describe basic sorting algorithms (including Quicksort) and implement them in C/C++", "Perform rigorous asymptotic analyses of simple algorithms and express the result using order notation; compare algorithms based on their asymptotic complexity; and prove formal results involving order notation", "Apply the priority-queue ADT to solve various application problems, implement a priority queue using heaps, and analyze the complexity of common implementations of heap operations", "Develop best-, worst- and average-case analyses of sorting algorithms, including Quicksort, and explain the ramifications of these analyses in practice; explain the basic principles of randomized algorithms and their potential advantages, specifically in the case of Quicksort; explain the difference between comparison-based sorting and non-comparison-based sorting algorithms, and when and why the latter may run faster; and apply sorting-based techniques to algorithmic problems, such as elimination of duplicates", "Explain the advantages and disadvantages of various hashing techniques; identify the best hashing techniques to use in a particular application scenario; and recognize when hashing techniques are preferable to other dictionary implementations", "Design data structures for real-world data (where keys are often inherently multidimensional) in such a way that common operations (including range search) can be implemented efficiently", "Design special data structures that can efficiently store and process words and strings, and select and apply a suitable technique for data compression in a specific application scenario", "Introduction and review (3 hours)", "Basic computer model: the random-access machine", "Runtime of an algorithm: worst-case, best-case, and average-case", "Review of stacks and queues", "Priority queue ADT and simple implementations", "Sorting and analysis of randomized algorithms (5 hours)", "Quicksort (non-randomized): worst-case, best-case, and average-case complexity", "Randomized quicksort and its analysis; application to selection and its analysis", "Lower bound on comparison-based sorting", "Non-comparison-based sorting algorithms (e.g., Counting Sort and Radix Sort)", "Dictionary ADT and simple implementations", "Binary search trees (insert and delete operations and analysis)", "Key-indexed search, simple hash functions", "Range search in a binary search tree", "Algorithms and data structures for text processing (8 hours)", "Sometimes these include animations/overlays, in case of which there will be both a Display version (with them) and a Print version (omitting them, but otherwise the same content).", "The slides for each module will be posted as the term progresses.", "Module 1 Introduction and Asymptotic Analysis M1.pdf", "Module 3 Sorting, Average-Case and Randomized Algorithms M3.pdf", "Optional: Goodrich & Tamassia   8.3", "Module 8 Range-Searching in Dictionaries of Points   Course notes Chapter 8", "A0.tex", "A1.tex", "The following books are on reserve in the DC library for reference and additional resources:", "Algorithm Design and Applications (2015)", "Also covers cuckoo hashing.", "Sedgewick] Algorithms in C++, Third Edition (1998)", "Computational Geometry: Algorithms and Applications", "CLRS] Introduction to Algorithms, 2nd edition (2001)", "Introduction to Algorithms, 2nd edition is also avaliable online (in campus).", "This website will be the primary means of communication and distribution of materials for the course.", "The course uses a number of different tools for distributing information and receiving submissions.", "These are not worth credit, but may help you in self-testing your understanding of the material.", "Only one programming question can be shifted to the final exam.", "If more than this has verification for non-submittal, then it will be considered on a case-by-case basis.", "A student with a medical reason may not be granted an INC because they have not performed sufficiently well during the academic term.", "An INC will be granted ONLY if there is a strong reason for missing the exam (generally a serious medical issue verified by a doctor's note) AND a satisfactory performance during the term (both assignments and midterm).", "Academic Dishonesty", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "The first criterion for marking is the correctness, the second criterion is efficiency.", "describe the main idea first in words,", "In the case that you are using facts stated in lectures/modules, be sure to cite where you got them from.)", "Files should be named .cpp, where the specific file name will be specified in the assignment.", "You should include sufficiently many comments in your code that the main ideas of design and correctness are clear.", "One-line changes: In the case you passed the public test, and failed some secret tests, if your program works with a one line change, then we may accept it for remarking and give some marks after deducting a penalty (typically 10-20% of the programming question).", "Here are some ways to create PDF files:", "Create your solution in LaTeX. LaTeX is a document preparation system that uses a mark-up language to write/create and co-ordinate different parts of documents, including diagrams and was introduced in Assignment 0.", "The following are least preferred methods since the results may be hard for markers to read and/or the files may be too large.", "Submitting a Re-Mark Request: Please email cs240@uwaterloo.ca in order to submit a request.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 17, "course_code": "ECE 192", "course_name": "ECE192 - Engineering Economics and Impact on Society (0.25)", "term_name": "2B Term", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Engineering Economics and Impact on Society Winter 2025", "03:30PM - 04:20PM E7 5343", "Monday, Friday -", "This course teaches engineering economics and the impact of engineering on the society at large.", "Important concepts of engineering economics including cash flow diagrams, present worth, quantification of impact costs, and rate of return analysis are presented.", "Energy supply scenarios and the environment, global energy use and supply, and environmental impacts of engineering projects are discussed.", "View requirements for ECE 192", "Prepare a cash flow diagram and perform cash flow analysis", "Perform a rate-of-return analysis for an engineering problem", "Solve economic problems and evaluate engineering project alternatives", "Chapters 1: Economic Analysis and Cost Estimation", "Decision Making and Problem Classification", "Engineering Cost Estimation and Cash Flow Diagrams", "Chapters 2: Economic Analysis and Cost Estimation", "The Power of Compounding", "Compound InterestFactors", "Non-uniform CashFlows", "Depreciation", "Present Worth Analysis", "Future Worth Analysis", "Annual Worth Analysis", "Chapter 5: Internal Rate of Return Analysis", "Payback Period Analysis", "Chapter 6: Other Rate of Return Analysis", "Chapter 7: Cost-Benefit Analysis", "Benefit-Cost Ratio", "Incremental Benefit-Cost Analysis", "Sensitivity Analysis", "Break-even Analysis", "Basic Probability and Expected-Value Analysis", "Chapter 9: Decision Making", "Decision-Tree Analysis", "eTextbook: Engineering Economics: Financial Decision Making for Engineers (Canadian Edition) Yes TBD", "E.M., and Pirnia, M., Engineering Economics: Financial Decision Making for Engineers, 6th ed., Pearson Canada, 2016."]}, {"course_id": 18, "course_code": "MATH 239", "course_name": "MATH239 - Introduction to Combinatorics (0.50)", "term_name": "2B Term", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Introduction to Combinatorics Winter 2025", "11:30AM - 12:20PM MC 4059", "09:30AM - 10:20AM MC 4021", "P. Nelson", "08:30AM - 09:20AM QNC 1502", "S. Pfannerer-Mittas", "10:30AM - 11:20AM MC 4058", "11:30AM - 12:20PM MC 4058", "09:30AM - 10:20AM MC 4042", "02:30PM - 03:20PM", "10:30AM - 11:20AM PHY 150", "04:30PM - 05:20PM", "You should have no reason to contact them directly, but you can find their email addresses through Learn.", "First name Last name", "Guilherme Zeus Dantas E Moura", "Theodore Morrison", "Matthew Kroeker", "Introduction to graph theory: colourings, matchings, connectivity, planarity.", "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.", "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 19, "course_code": "CS 341", "course_name": "CS341 - Algorithms (0.50)", "term_name": "3A Term", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Algorithms Winter 2025", "10:00AM - 11:20AM MC 4061", "08:30AM - 09:50AM MC 1056", "The study of efficient algorithms and effective algorithm design techniques.", "Topics include divide and conquer algorithms, recurrences, greedy algorithms, dynamic programming, graph search and backtrack, problems without algorithms, NP-completeness and its implications.", "DPV", "Introduction to Algorithms, by Cormen, Leiserson, Rivest and Stein, MIT Press.", "describe the main idea first,", "Extensions and Other Accommodations on Assignments", "Students can currently self-declare two kinds of absences on Quest: short-term absence and pandemic-related absence.", "Since a short-term absence lasts 2 days, this means the only accommodation we offer for a short-term absence is a 48 hour extension.", "If you request accommodations through AccessAbility Services (AAS) by filling out a Missed Course Component form, the accommodation is determined on a case-by-case basis through consultation with AAS, but will generally be one of the above options unless your situation is unusual.", "If you collaborate with others, you must clearly indicate the collaboration for each problem.", "This is not a software engineering course; we will not test your code against inputs that do not match our specifications.", "Continuity Plan", "In particular:", "Please inform of us these at the start of the course."]}]