[{"course_id": 50, "course_code": "CHEM 357", "course_name": "CHEM357 - Physical Biochemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Medicinal Chemistry", "program_id": 116, "major_id": 1, "major_name": "Medicinal Chemistry (Bachelor of Science - Honours)", "topics": ["Physical Biochemistry Winter 2025", "10:30AM - 11:20AM RCH 307", "B. Power", "Instructor: Bill Power", "The use of diffusion, ultracentrifugation, osmotic pressure, electrophoresis and X-ray diffraction to study the properties of biopolymers.", "This course is meant to provide you with a basic introduction to physical chemistry as applied to the life sciences with emphasis on applications in biochemistry.", "This course will cover the basics of thermodynamics and their applications to biological molecules and systems, their transport properties, chemical and enzyme kinetics, and physical techniques used to establish and investigate the structures of biological macromolecules.", "I will aim to provide you with all the background necessary to cover the many topics in this course, from entropy and thermodynamic principles from the 18th century to modern applications such as AI which resulted in half of the the 2024 Nobel Prize in Chemistry going to Google's DeepMind leaders Demis Hassabis and John Jumper for their development of AlphaFold, a protein structure database (of 220 million structures!).", "In return you should have some familiarity with the basics of biochemistry and biological structures and terminology, as well as some comfort working with derivatives, including partial derivatives, integrals and differential equations.", "Understand the four laws of thermodynamics and their applications to biological systems", "Understand the importance of Gibbs free energy and chemical potential in describing physical and chemistry transformations", "Understand the basics of chemical kinetics and rate laws and mechanisms", "Be able to characterize enzyme kinetics using the Michaelis-Menten description and describe competition and inhibition in such mechanisms", "Know how to apply and interpret structural tools such as optical and NMR spectroscopy, X-ray diffraction and computational tools to biological macromolecules", "There will be online and in-class assignments, on a rotating interval of about two weeks.", "It will occur in a 2.5 hour time slot sometime between April 9 and April 25 (I have no control over this scheduling).", "Weeks 1 to 3:   Thermodynamics, its Laws and its Applications", "Week 10:            Biomolecular Structure; Optical Spectroscopy", "Weeks 11 to 12: NMR Spectroscopy; X-ray Diffraction; AI Methods and AlphaFold", "We will cover much of this book, though perhaps not in detail in some sections, and it should be a useful resource.", "I will have a copy on reserve in the library (https://www.reserves.uwaterloo.ca/ares/ares.dll?Action=10&Form=50&Value=222107) and the price listed here is for a one-year electronic subscription (https://www.pearson.com/en-ca/subject-catalog/p/physical-chemistry-principles-and-applications-in-biological-sciences/P200000006771/9780137612826).", "This course includes the independent development and practice of specific skills, such as problem solving in a chemical and scientific context.", "Library for research-based assignments"]}, {"course_id": 16, "course_code": "NE 241", "course_name": "NE241 - Electromagnetism (0.50)", "term_name": "2A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electromagnetism Fall 2024", "08:30AM - 11:20AM QNC 2611", "08:30AM - 11:20AM QNC 2611", "08:30AM - 11:20AM QNC 2611", "E-mail", "Coulomb's law, electric field and electric flux, Gauss's law, electric potential, potential and field, magnetic field, Ampere's law, solenoid, electromagnetic induction, magnetic flux, Lenz' law, Faraday's law, capacitors and capacitance, inductors and inductance, Maxwell's equations, electromagnetic fields and waves, polarization.", "Welcome to the NE 241 laboratory!", "In lab 3, you will study different configurations of parallel plate capacitors and measure charge distribution and capacitance for different configurations.", "In lab 4, you will investigate the electric field and potential of different objects using COMSOL software.", "In lab 5, you will measure magnetic fields for different objects, self-inductance, and explore the induced emf concepts.", "F", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 17, "course_code": "COMMST 100", "course_name": "COMMST100 - Interpersonal Communication (0.50)", "term_name": "2A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["jclausen@uwaterloo.ca (please do not use the D2L email system)", "I monitor my email M-F, 9:00 am - 5:00 pm.", "Focuses on the one-to-one, face-to-face communication in both the personal and professional realms.", "Such topics as verbal and non-verbal interactions, listening, and the better management of interpersonal communication will be studied.", "In this course, we will work to understand more fully how we communicate (and are communicated to) in the world we live in and to develop the tools to research, apply, and practice key interpersonal communication concepts in our everyday lives.", "Students will be encouraged to identify, negotiate, and challenge existing communicative norms as they explore a range of interpersonal and intrapersonal issues that include culture, identity, and power.", "Understand the complexity of communication as a human process of shared meaning- making in the context of power, history, and culture", "Increase your capacity to recognize and enhance yours and others’ agency – the ability to make a difference in the world for yourself and others – and understand the implications of your communication behaviours for yourself and others", "Understand communication as a practice and improve your critical and creative communication competencies by developing your ability to use writing and other media of communication to create meaning", "This entails opportunities for student-directed inquiry, challenge and risk-taking, and reflection on your roles and responsibilities", "Reflect on your role in fostering the public good (the multifaceted well-being of individuals and groups), begin to imagine a better future, and make decisions in your communication that can transform the communities to which you belong", "Recognize diverse linguistic practices and modes of expression as resources for writers and speakers", "Introduction", "Read: Meaning as Co-Created", "Read: “Cultural and Historical Influences: Communication Competence in Context”", "Exceeds assignment guidelines; strong and consistently applied definition of audience and purpose; thoughtful and innovative adaptation of the subject to the audience’s needs; subject developed and organized at every level for listener comprehension; speaker uses language appropriately, effectively and even inventively; maintains relaxed, inviting delivery free of verbal fillers and distractions; cites sources appropriately both in spoken and written work; submits well prepared required materials.", "Your entries should be roughly two typewritten, double- spaced pages each although they can go slightly over.", "While the amount you write under each heading may change week to week, this format allows you to address each area regularly.", "Decide how often you will communicate and in what manner.", "Decide how you will divide the workload and handle conflicts.", "Handing in a clear contract will earn 5%.", "Your job will be to engage the class and apply what we are reading to people’s own opinions, experience, etc. Sign up for this assignment is on a first-come/first-served basis starting during week two of classes.", "Group Presenation 2: Final Presenation You and your group will create a fifteen-minute videotaped presentation exploring a problem in interpersonal communication and proposing a solution for that problem.", "This presentation will involve research into a specific issue related to interpersonal communication and creating good reasons for following your proposed solution.", "This course includes the independent development and practice of specific skills, such as self reflection, critical thinking skills and interpersonal communication.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 19, "course_code": "EMLS 101R", "course_name": "EMLS101R - Oral Communications for Academic Purposes (0.50)", "term_name": "2A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["& Location:", "Email:                         christa.schuller@uwaterloo.ca", "Designed specifically for students for whom English is not the first language, this course introduces group discussion strategies and presentation skills.", "A focus on pronunciation and vocabulary assists learners to better engage in conversations and listen to and deliver English presentations.", "This is achieved with the focus on gambits, voice quality, and speech clarity, which assist learners in developing strategies to better engage in discussions, and listen to and deliver English presentations in both remote and face-to-face contexts.", "Create and organize discussions and presentations", "Use a clear and appropriate format", "Develop relevant and well formatted materials (PowerPoint slides and discussion notes)", "Select effective introductions and conclusions to engage the audience", "Clearly express their ideas verbally and non-verbally", "Use communication gambits and signpost language effectively during discussions as well as individual and team presentations", "Use body language and space on stage to enhance the expression of ideas", "Listen for main ideas and details of some selected TED talks to form opinions on current socio-cultural, educational, environmental, and technological issues", "Critically evaluate various sources of information and then incorporate these sources in oral communication to create strong, academic support for their ideas", "Topics & Activities In-class Activities & Assignments Home                 Assignments", "Nonverbal communication- Importance of body language", "Introduction to group discussion assignment", "Analysis of non-verbal communication of selected presenters", "Small talk & non-verbal communication practice", "Main ideas and brief summary of TED Talks", "Question types for semi-formal discussion", "Discussion facilitation and gambits", "Non-verbal communication during a discussion", "Discussion skills", "Introduction to informative presentation introductions and conclusions", "Introduction to individual  presentations: thesis statement and format", "Chunking, pausing and focus words", "Writing thesis statements", "Pausing and focus words", "Effective PowerPoint slide design & APA citations", "Opening and closing a presentation", "Practice designing a slide and presenting its content", "Sample presentation", "Submitting PPT and Outline", "Submitting PPT and Outline", "Introduction to product review", "Inventions and innovations; product features", "Brainstorming for main ideas", "March 24 - 28", "Product review development – outline and slides", "Sample product review slides & outline", "Search for support materials, content development & slide design", "Product review presentations", "You will also need to watch the presentations of the other students and actively participate in the Q & A sessions following these presentations.", "A self-reflection on your preparation for the presentation, its delivery, and the Q & A will follow.", "A brief Q & A session will then follow.", "You will also need to watch the presentations of the other students and actively participate in the Q & A sessions following these presentations.", "These quizzes will cover the concepts related to academic and professional presentations, both individual and co-delivered, as well as discussions.", "Electronic Device Policy", "This course includes the independent development and practice of specific skills, such as collecting, synthesizing, and analyzing information; developing and practicing oral skills; critically evaluating and elaborating on ideas.", "Library for research-based assignments", "You can earn an EMLS Diploma by completing four EMLS courses and earning a cumulative average of 65%.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 24, "course_code": "NE 217", "course_name": "NE217 - Advanced Calculus and Numerical Methods 2 (0.50)", "term_name": "2B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Advanced Calculus and Numerical Methods 2 Spring 2024", "10:00AM - 11:20AM MC 4020", "10:00AM - 11:20AM MC 4020", "Friday -", "Friday", "02:30PM - 05:20PM", "Email: thompson@uwaterloo.ca", "Green's, Gauss', and Stokes' Theorems: Applications to electromagnetism and fluid mechanics.", "First order PDEs.", "Second order linear PDEs", "Numerical methods and the CFL condition.", "Matrix and relaxation methods.", "A vector calculus description of the finite element method.", "Stoke’s theorem, scalar and vector surface integrals."]}, {"course_id": 27, "course_code": "NE 226L", "course_name": "NE226L - Laboratory Characterization Methods (0.25)", "term_name": "2B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["01:30PM - 04:20PM QNC 2614", "Tuesday -", "QNC 2614", "01:30PM - 04:20PM QNC 2614", "01:30PM - 04:20PM QNC 2614", "Dr. Yael Zilberman-Simakov", "First Name Last Name Email Address Lab Exercise Exercise Starting Location", "Sarah  Rezaei  sarah.rezaei@uwaterloo.ca FT-IR QNC 2614", "This laboratory course introduces students to six materials characterization techniques employed routinely by nanotechnology engineers in their practices.", "Prepare samples for and safely operate all six instruments for most common analysis situations.", "Choose an appropriate set of starting conditions to begin analysis.", "in-lab performance 10", "15 in-laboratory 15", "in-lab performance 10", "in-laboratory submission 20"]}, {"course_id": 35, "course_code": "NE 343", "course_name": "NE343 - Microfabrication and Thin-Film Technology (0.50)", "term_name": "3A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Microfabrication and Thin Film-Technology Spring 2024", "04:00PM - 05:20PM", "Substrate preparation.", "Homoepitaxy, heteroepitaxy, and molecular-beam epitaxy.", "Physical and chemical vapor deposition.", "This course is held with ECE 433: Fabrication Technologies for Micro and Nano Devices", "Explain how plasma discharges and how to create them.", "Determine junction formation processes for microelectronic device needs.", "Explain nanopatterning principles and limits of optical lithography.", "Section 6: Optical Lithography and its limits", "Section 10: Transistor and CMOS Fabrication"]}, {"course_id": 41, "course_code": "NE 352", "course_name": "NE352 - Surfaces and Interfaces (0.50)", "term_name": "3B Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 11:20AM RCH 105", "08:30AM - 09:50AM RCH 105", "Surfaces and interfaces in microelectronics and nanofabrication.", "Capillary phenomena and molecular self-assembly.", "Describe the origin of a variety of interfacial phenomena", "Calculate surface/interfacial forces and potential energies of micro- and nano-scale systems", "Design experiments to measure interfacial tension, including the selection of appropriate tools", "Analyze experimental data to determine surface characteristics", "Design surfaces to create stable or unstable dispersions", "4 Sept 25th 3 Electric double layer: Poisson-Boltzmann, Gouy-Chapman-Stern theories", "10 Nov 6th 6 Polymers and surfaces, adsorption phenomena, stabilization vs. flocculation mechanisms", "13 Nov 27th 8 Surface area and pore-size analysis", "I encourage you to buy one of these as it will be helpful for future reference.", "Intermolecular and Surface Forces, By Jacob N. Israelachvili, 3rdedition", "Intellectual property includes items such as:", "Graduate Attribute Program Indicators", "A knowledge base for engineering: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "1a Demonstrate understanding of concepts in mathematics.", "1b Demonstrate understanding of concepts in natural science.", "1c Demonstrate understanding of engineering fundamentals.", "1d Demonstrate understanding of specialized engineering knowledge.", "2. Problem Analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "3a Create investigative studies of complex engineering problems.", "3b Gather information from relevant sources to address complex engineering problems.", "4. Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "4a Define design requirements and specifications for complex, open-ended engineering problems.", "4b Critically evaluate and compare design choices.", "7. Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "8a Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Impact of Engineering: An ability to analyze social and environmental aspects of engineering activities.", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "10a Identify ethical and unethical behavior in professional situations.", "10b Identify how an engineer is accountable to multiple stakeholders in engineering practice.", "Life-long Learning: An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge.", "12a Identify gaps in their knowledge, skills and abilities."]}, {"course_id": 43, "course_code": "NE 408", "course_name": "NE408 - Nanosystems Design Project (0.50)", "term_name": "4A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Nanosystems Design Project Fall 2024", "11:30AM - 12:20PM RCH 105", "Course Instructor & FYDP Coordinator:", "Office: E3-3141", "The Fourth Year Design Project is a three course sequence with NE307 “Introduction to Nanosystems Design” in the 3B term, NE408 “Nanosystems Design Project” in the 4A term, and NE409 “Nanosystems Design Project and Symposium” in the 4B term.", "You will work through the design process and the initial development and testing of your project.", "Define a specification for an engineering problem", "Develop a solution to a problem using the design process (including iterating to the solution)", "Work effectively on a team to tackle a technical problem", "Identify and analyze relevant health & safety, sustainability and economic aspects of an engineering project", "Perform experimental investigation appropriate to a design challenge, including selection and use of tools", "Perform literature investigation appropriate to a design challenge.", "Design Description", "Design Description", "Revised Project Plan & Milestones", "** Class meeting #3 ** in RCH 105", "Verification Plan", "Test Plan", "Design Verification & Stage 1 of Prototype Implementation:", "Progress Update", "Quality of technical communication 20%", "Design process execution and engineering analysis 30-35%", "4% Revised Project Plan & Milestones", "30-35% Design process execution and engineering analysis", "The file name must show the FYDP number as well as the submission number."]}, {"course_id": 44, "course_code": "NE 454A", "course_name": "NE454A - Nano-Electronics Laboratory 1 (0.25)", "term_name": "4A Term", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 02:20PM QNC 2611", "08:30AM - 02:20PM QNC 2611", "08:30AM - 02:20PM QNC 2611", "08:30AM - 02:20PM QNC 2611", "08:30AM - 02:20PM QNC 2611", "08:30AM - 02:20PM QNC 2611", "NE454-A (Nano-electronics): design, simulation and prototyping of an oscillator circuit coupled with the design of an optimized PCB layout of the circuit that serves as a direct replacement for a commercial quartz crystal microbalance oscillator circuit.", "The PCB board will be populated with components, mounted in the QCM system and subjected to validation tests to determine if the design criteria for the circuit have been met in the follow-up laboratory sequence in NE 455A. Each student-designed oscillator circuit board will be compared directly, in a side-by-side comparison, with a commercial QCM system.", "Application of experimental tools and techniques in nano-electronics.", "Experimental exercises may involve circuit simulation and design, circuit prototyping, design of a driver circuit for a quartz crystal microbalance (QCM), printed circuit board (PCB) design and layout optimization, and the use of various characterization instrumentation.", "NE454-A (Nano-electronics): design, simulation and prototyping of an oscillator circuit coupled with the design of an optimized PCB layout of the circuit that serves as a direct replacement for a commercial quartz crystal microbalance oscillator circuit.", "The PCB board will be populated with components, mounted in the QCM system and subjected to validation tests to determine if the design criteria for the circuit have been met in the follow-up laboratory sequence in NE 455A. Each student-designed oscillator circuit board will be compared directly, in a side-by-side comparison, with a commercial QCM system.", "Examine the principles of oscillating circuits.", "Operate PSpice circuit simulation software tool to be familiar with its syntax.", "Create and design an optimized PCB layout using the EAGLECAD software, a package to prepare it for commercial fabrication.", "Communicate clearly and effectively in written and/or visual form through working in the lab and writing technical reports.", "F", "However, laboratory manuals are supplied online for each of the four laboratory exercise sequences.", "In-lab Report 1", "In-lab Report 3", "PCB Design Submission", "Total", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 74, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}, {"course_id": 78, "course_code": "CIVE 230", "course_name": "CIVE230 - Engineering and Sustainable Development (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering and Sustainable Development Spring 2024", "10:00AM - 11:20AM RCH 301", "nadine.ibrahim@uwaterloo.ca", "nadine.ibrahim@uwaterloo.ca", "This course introduces the concept of sustainability and how it applies to decision-making in civil engineering.", "The course begins by defining sustainability, both practically and technically, and describing the concepts of systems, and systems interactions.", "Economic concepts and their applicability to sustainability are described for both developed and developing countries.", "Sustainability concepts covering the triple bottom line are presented, and their applicability to sustainability are described.", "First, the qualitative concepts and background information is presented.", "I’ll be teaching sustainable development and its connection to engineering using both a qualitative and quantitative understanding of sustainability.", "Qualitatively, this involves describing sustainability objectives, trends, current conditions and future projections, and to have a technical and public understanding of sustainability challenges.", "Quantitatively, this involves modeling environmental parameters using linear programming, differential equations, regression and extrapolation, and understanding the metrics used for sustainability assessments.", "I believe students have different strengths, where the diversity of coursework will leverage individual strengths and give everybody a chance to shine!", "I encourage you to read the announcements on a regular basis and stay up to date.", "IDENTIFY: Identify implications of human activities on the three dimensions of sustainability", "QUANTIFY: Quantify sustainability indicators to assess trade-offs", "DEMONSTRATE: Demonstrate course concepts to assess sustainability in global cities", "Relate course concepts to everyday activities and living experiences", "TBD", "Introduction to Engineering and the Environment.", "Introduction to Environmental Engineering and Science 3rd Edition, Prentice Hall.", "Some situations can warrant exceptions - speak to your instructor about these, and I’ll do my best to accommodate extenuating circumstances.", "Lecture topics will be presented in multiple formats to provide flexibility for different users and learning preferences.", "A knowledge survey on your thoughts and experiences with sustainability concepts and practices", "This will be open in the first and last weeks of term.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 79, "course_code": "CO 487", "course_name": "CO487 - Applied Cryptography (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Instructor: Samuel Jaques", "Email: sejaques@uwaterloo.ca", "Timothy Miller", "Nicolas Swanson", "A broad introduction to modern cryptography, highlighting the tools and techniques used to secure internet and messaging applications.", "It is one of the core technologies for securing the emerging information infrastructure.", "This course is a comprehensive introduction to modern cryptography that is aimed primarily at those interested in applications.", "In the area of public-key cryptography, topics will include an overview of specific systems (Diffie–Hellman, RSA, DSA, etc.) and a few advanced protocols.", "The security of these schemes and the use of public-key techniques for generating digital signatures will be described.", "Linear and differential cryptanalysis of ciphers.", "Define the main information security goals of confidentiality, integrity, authentication, and availability", "Explain the intended security properties of each cryptographic primitive and analyze relationships between security properties", "Explain mathematical techniques underlying standardized cryptographic algorithms", "Identify flaws in uses of cryptographic algorithms", "Determine which cryptographic algorithms can be used and combined to build systems with desired functionality and security", "Understand and contextualize the cryptography and security around them in daily life", "0 1 (Jan 6-8) Introduction", "Symmetric Encryption", "3.6 9 Elliptic Curve Cryptography 4 Yes", "4   Applications", "Understanding Cryptography: From Established Symmetric and Asymmetric Ciphers to Post-Quantum Algorithms, 2nd edition, Springer, 2024 Primary reference.", "A1: January 23", "A4: March 20", "This will be clearly indicated for each such question.", "In that case you are required to work independently.", "These questions will test your ability to identify the important concepts introduced in lectures, and your understanding of them.", "In particular:", "Please inform us of these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 81, "course_code": "ECE 224", "course_name": "ECE224 - Embedded Microprocessor Systems (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Embedded Microprocessor Systems Fall 2024", "ECE 224", "ECE 224 001", "Monday, Friday -", "E7 4043", "ECE 224 002", "Monday, Friday -", "08:30AM - 09:50AM E7 4043", "11:30AM - 12:20PM E7 4043", "Rabiul Islam r25islam@uwaterloo.ca", "Emon Sarkar esarkar@uwaterloo.ca", "View requirements for ECE 224", "Course introduction: In this course, you will explore the design of embedded systems and computer interfaces.", "How should data be organized?", "When should data be exchanged?", "What conditions must be satisfied to reliably exchange data?", "Identify system realities (such as noise, jitter, metastability, and transmission line effects) and select suitable approaches for managing these realities in an embedded computer system.", "Compare and critically assess design tradeoffs in an embedded computer system.", "Analyze the effects of synchronization mechanisms on the operational characteristics of an embedded computer system.", "Design hardware and software components to reliably connect devices to an embedded computer system.", "Course Introduction", "An introduction to the teaching team, course expectations, deliverables, marking scheme, and a very brief introduction to interfacing concepts.", "Embedded Systems", "A review of the fundamentals of embedded systems and the terminology associated with embedded systems.", "Interfacing Software, Device Drivers and Synchronization", "A review of embedded software design concepts, followed by a discussion of synchronization concepts and analysis.", "A detailed examination of the design and behavior of drivers for shared and transmission lines, including considerations of signal integrity.", "Buses and Interconnections", "A comparison of the functional behavior and timing behavior of synchronous, asynchronous, partially interlocked asynchronous, semi-synchronous, and split cycle bus systems.", "Arbitration", "A detailed examination of alternatives for interconnection arbitration including both centralized and distributed arbitration techniques.", "Parallel Interfacing", "This includes an examination of the role of the interface in matching bus timing and signaling characteristics with a device's timing and signaling characteristics.", "Serial Interfacing", "This includes a comparison of asynchronous communication techniques and synchronous techniques as well as the protocols for serial communication.", "Error Detection and Correction", "An introduction to error detection and error correction including a discussion of error types, differences in detection and correction, and one example of an error correcting code (the Hamming code).", "Analog Interfacing", "An introduction to digital-to-analog interfacing, analog-to-digital interfacing, and sample-and-hold circuitry.", "This includes a discussion of static and dynamic errors.", "Examples", "You may use these exams to assess your preparation for the exams in the course.", "Assessment Estimated Completion Time Completion Date", "Lab studies: Lab studies are to be completed in groups of two.", "Students then write C software using the Intel Nios II Software Build Tools to control their embedded system to achieve a specified design goal.", "Lab Study 0: This is an introductory lab study that examines the design of a system-on-a-programmable chip (SOPC) design.", "In this lab, students design, build, and test a 32-bit microprocessor system based on the Nios II processor core.", "The hardware design and the board support package serve as a starting point for both Lab Study 1 and Lab Study 2.", "In this lab study, students design a software system that uses pushbuttons, LEDs, 7-segment displays, timers, polling loops, and multiple interrupt handlers to conduct an experiment into servicing a device.", "In this lab study, students design a software system to read a pre-recorded audio file from an SD card, process the audio data, and play it back on a speaker using a DAC.", "Students are given broad latitude to design the system.", "When a lab study builds upon previous submissions, comments such as \"In the previous submission, concerns were expressed related to the number of sample points in the experiment.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm and those who support others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 83, "course_code": "ECE 252", "course_name": "ECE252 - Systems Programming and Concurrency (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Systems Programming and Concurrency Fall 2024", "ECE 252", "ECE 252 001", "Monday, Friday -", "11:30AM -", "E7 4043", "Monday, Friday -", "10:00AM - 11:20AM E7 4043", "M. Cooper-Stachowsky", "11:30AM - 12:20PM E7 4043", "ECE 252 101", "E7 4043", "ECE 252 102", "04:30PM - 05:20PM", "ECE 252 201", "08:30AM - 11:20AM E2 3346", "ECE 252 202", "ECE 252 204", "08:30AM - 11:20AM E2 3346", "Mike Cooper-Stachowsky (Section 2): Mike came to the university of Waterloo in 2014 where he worked in the first year office helping new students transition into university.", "He is particularly interested in operating systems and systems programming, and learned a lot by writing his own kernel for the x86.", "Manavjit Singh Dhindsa -- ms2dhind@uwaterloo.ca", "Sheikh Abrar Tahmid -- sa2tahmi@uwaterloo.ca", "ECE 252:", "Performance and correctness of concurrent systems.", "Deadlock detection and recovery; file systems.", "View requirements for ECE 252", "This course assumes you are comfortable programming in a low level programming language (likely C++ from your Algorithms and Data Structures course).", "Apply standard concurrency scenarios such as producer-consumer, readers-writers, dining philosophers, as well as deadlock and starvation.", "Interact with the Linux operating system through the command-line interface and the C language API.", "Use inter-process communication such as shared memory and message queues.", "Do you need a textbook?", "To request that a question be re-marked, you will need to submit your request in writing via e-mail to the instructor.", "Collaboration and Group Work.", "Please bring this situation to the attention of the course staff as soon as possible so that can be resolved quickly.", "However, each group must submit their own, independently-developed code for each lab.", "Similarly, each person must submit their own, independently-developed code for each assignment.", "I suggest you avoid looking at other people’s code entirely, but if you do, then you should not be doing that anywhere you might be writing your own code.", "The temptation to write your code just like what you see is simply too high.", "However, penalties may be more severe for repeat offenders (see below for information on Academic Integrity).", "All of the above applies to multiple instances — a student caught in several incidents of academic dishonesty will be subject to the above penalties for each of the incidents.", "Laptop and Device Policy: The human visual system has evolved to perceive saber-toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text-mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "Piazza is a great tool for collaboration and it allows rapid but asynchronous exchange of infor mation.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be difficult to interpret on a discussion forum.", "In either case, we will cancel all the in-person lectures and in-class exercises during the relevant period and try to have some online synchronous video lectures during that period.", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, Chat- GPT) and how such tools can be used to write and test code.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 91, "course_code": "MTE 241", "course_name": "MTE241 - Introduction to Computer Structures and Real-Time Systems (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Introduction to Computer Structures and Real-Time Systems Fall 2024", "08:30AM - 09:20AM E7 3343", "08:30AM - 10:20AM E7 3343", "M. Cooper-Stachowsky", "MTE 241 202", "M. Cooper-Stachowsky", "M. Cooper-Stachowsky", "11:30AM -", "12:20PM E7 3343", "All software and also the law and ethics course one time -- let's discuss contract law if you're up for it?", "Mike Cooper-Stachowsky -- mstachowsky@uwaterloo.ca", "Introduction to computer organization, basic real-time concepts, process management, interprocess communication and synchronization, memory management, resource management, interrupt handling, concurrent programming, file systems.", "View requirements for MTE 241", "Describe the basic components of a computer system [KB(I)]*", "Perform Memory-Mapped I/O [KB(D)]", "Program a real-time application with multiple coordinated tasks [Des(D),Tools(D)]", "STM32F401RE Nucleo Board A microcontroller board for the labs.", "A Practical Introduction to Real-Time Systems For Undergraduate Engineering It's the textbook, available free in PDF form: https://ece.uwaterloo.ca/~dwharder/icsrts/Lecture_materials/A_practical_introduction_to_real-time_systems_for_undergraduate_engineering.pdf No", "Available for free in PDF form: https://github.com/jzarnett/mte241/ Yes", "You should purchase this board well in advance of the first lab and install the STM32CubeIDE software to test that it works.", "A small number of lab computers will have the software installed for your use.", "You will use the STM32F401RE microcontroller board and the STM32CubeIDE to write a real-time operating system in the C language.", "The questions are designed to test your understanding of the concepts you should have learned in the lab.", "Exams are in-person, closed-book.", "This paper must be a standard letter size.", "Laptop and Device Policy: The human visual system has evolved to perceive saber-toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text-mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "In either case, we will cancel all the in-person lectures and in-class exercises during the relevant period and try to have some online synchronous video lectures during that period.", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, Chat- GPT) and how such tools can be used to write and test code.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 92, "course_code": "MTE 262", "course_name": "MTE262 - Introduction to Digital Logic (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Introduction to Digital Logic Winter 2025", "02:30PM - 03:20PM", "E7 3343", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "08:30AM - 11:20AM E7 3419", "Number systems, logic gates, Boolean algebra.", "Karnaugh maps, and", "Implementation of combinational and sequential logic circuits on Field Programmable Gate Arrays (FPGA) boards.", "Sequential logic and state machines.", "Use logic gates and common circuit blocks to build and analyze combinational logic circuits", "Explain different number systems and convert between bases, in particular decimal and binary and decimal and hexadecimal, which are commonly used in digital systems", "Manipulate and simplify circuits using Boolean algebra and Karnaugh maps", "Implement digital logic using industry grade tools such as Field Programmable Gate Arrays (FPGAs), Programmable Logic Controllers (PLC) and system simulations", "Develop and use state machines to implement and analyze sequential circuits", "1 Introduction to Digital Logic", "3 Introduction to VHDL", "5 Boolean Algebra", "7 Number Systems", "9 Sequential Circuits", "W11 (Mar-25) PLC Introduction + Simulation", "While a cell phone can be used, a device with a larger screen will give you a better experience.", "The only exception to this rule is under extenuating circumstances, accommodations and submission of VIF (in case of illness).", "The only exception to this rule is under extenuating circumstances, accommodations and submission of VIF (in case of illness).", "There will be a total of 5 labs, where you will work in groups and will take place in-person in E7 – 3419.", "No extensions are allowed in submission of labs except under extenuating circumstances, accommodations and in case of approval of Verification of Illness.", "Exams", "**", "Do I have to do the labs again?", "Can I reuse material from previous lab submissions?", "No, you must start with a blank page and redo the labs as though you are completing them for the first time.", "Notice of Recording", "This course includes the independent development and practice of specific skills, such as manipulating digital logic and programming devices such as PLCs.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 93, "course_code": "STAT 341", "course_name": "STAT341 - Computational Statistics and Data Analysis (0.50)", "term_name": "List 2", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Computational Statistics and Data Analysis Winter 2025", "04:00PM - 05:20PM", "10:00AM - 11:20AM EIT 1015", "04:30PM - 05:20PM", "Megan French", "Daniel Zhang", "While personal matters can be communicated via email, Piazza should be the primary platform for Q&A outside of class.", "A computationally focused approach to statistical reasoning in the context of real data.", "Functional programming in R and algorithms will be used to define interesting attributes of finite populations and their sampling characteristics.", "Understand the fundamentals of population-based statistical analyses, as well as implicitly/explicitly defined population attributes", "Understand the basics of sampling and the underlying ideas/mechanisms of probability sampling and related issues", "Understand the basics of inductive inference including target and study populations, measurements, comparing subpopulations, random intervals and coverage probabilities, and resampling methods such as bootstrap", "Generate high-quality visualization and inferential statistics R output for the topics above", "Prepare reports that communicate your statistical analyses using LaTeX and R Markdown.", "Jan. 6 Introduction to the course", "location and scale invariance/equivariance", "Power transformations and linear relationships", "Implicitly defined Attributes", "Solving system of equations Assignment #1", "Iteratively re-weighted least-squares", "Sampling mechanisms and inclusion probabilities", "Sampling design", "9. Mar. 3 Anatomy of tests of significance", "A t-like discrepancy measure  Assignment #2", "Mar. 10 Multiple testing", "Student-t-based intervals", "Mar. 17  Introduction to resampling methods", "Bootstrap in regression", "Multiple samples and prediction", "Decomposition of APSE, bias-variance trade-off", "Training and Test sets", "K-fold cross validation Assignment #3", "Each folder will contain five files, e.g. for section 2.1-", "There will be a 2.5-hour, closed book, cumulative final exam during the Final Examination Period: April 9 – April 25.", "An INC grade is rarely granted and will be considered on a case-by-case basis, with decisions based largely on your performance throughout the semester.", "Self-Declared COVID-19 Related Absences: You may self-declare one absence per term during the formal lecture period for influenza-like illnesses.", "Course Software: R is a language and a free statistical computing and graphics software that we will use extensively throughout the course.", "The only time you may run into trouble is if you call a function from a package to handle a task you have been asked to code out explicitly.", "For example, if you are asked to code a function that calculates the mean of a vector in R, and your solution is to just call the function mean(), then you will not receive any marks.", "Communication: When you email your instructor, make sure you include the following information in your email:", "Including non-English characters in your email (sometimes imposed by installing a non-English operating system) prompts UW servers to spam your emails for the instructor.", "These characters most often appear in (not exclusively) the subject line, From, To, and Date/Time portions of previous communications if you reply to an email.", "You must use the web-based email platform if you suspect that you have non-English characters in your emails imposed by your computer, phone, tablet, etc.", "This course includes the independent development and practice of specific skills related to computational statistics and data analysis.", "Phone: 519-884-0000 extension 213"]}, {"course_id": 97, "course_code": "BME 386", "course_name": "BME386 - The Physics of Medical Imaging (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["The Physics of Medical Imaging Fall 2024", "10:00AM - 11:50AM E5 6006", "09:30AM - 10:20AM E5 6006", "08:30AM - 09:20AM", "Email: phajireza@uwaterloo.ca | Office: E7-6416", "2- TBD", "The fundamental laws of electricity, magnetism, and optics will be taught through the introduction to basic concepts of medical imaging: radiation for imaging, x-ray, computed tomography (CT), magnetic resonance imaging (MRI), ultrasound or sonography imaging, electric impedance tomography, confocal microscopy, fluoroscopy.", "Understand and describe the fundamental laws of electricity, magnetism, and optics (1c)", "Understand and describe the fundamental laws of light-matter interactions (1b,c)", "Describe the physical mechanisms governing X-ray, MRI, ultrasound and optical imaging techniques (1c,d)", "Apply fundamental physics concepts to the general design of imaging systems (1b,c, 2)", "Randall D. Knight: Physics for Scientists and Engineers: A Strategic Approach with Modern Physics (4th Edition).", "Please make sure no inappropriate comments will be shared during the lectures.", "A student who is found to be disruptive during lectures will be given only one verbal warning for the term.", "This course includes the independent development and practice of specific skills.", "• Library for research-based assignments", "Compassionate Accommodation:", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Compassionate and respectful communication:", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable."]}, {"course_id": 98, "course_code": "BME 393", "course_name": "BME393 - Digital Systems (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Digital Systems Winter 2025", "11:00AM - 12:20PM E7 4417", "omar.alburaiki@uwaterloo.ca", "Email omar.alburaiki@uwaterloo.ca", "Topics will be reinforced in the context of biomedical microcontrollers and sensors used in physiological monitoring and clinical support systems.", "Topics will be reinforced in the context of biomedical microcontrollers and sensors used in physiological monitoring and clinical support systems.", "Analyze internal components of digital systems and their technical details", "2. Explain the importance of digital systems and computer architecture for biomedical applications", "4. Use biomedical controllers and sensors to design digital systems", "5. Design digital systems that are reliable (observed behavior matches specifications), safe (avoid putting human lives in danger even in presence of errors and failures), and robust (ability to handle unspecified inputs and state)", "Week6# Sequential Circuits and Sequential Logic Design", "Week7# More on Sequential Circuits and Sequential Logic Design", "Week8# Microcontroller Architecture and Interfacing, Timers/Counters", "Week10# Microprocessor Architecture, Datapath Design", "Week12# Microprocessor Pipelined Design", "Week13# More on Microprocessor Pipelined Design", "Harris and Harris: “Digital Design and Computer Architecture”.", "Each of these assignments may include analytical, numerical (using Falstad) and explanatory components exploring fundamental aspects of the material covered in the course."]}, {"course_id": 99, "course_code": "BME 544", "course_name": "BME544 - Biomedical Measurement and Signal Processing (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Biomedical Measurement and Signal Processing Winter 2025", "Signal processing techniques will be discussed in the context of extraction and application of useful biomedical signals.", "(3) Understand and apply digital signal processing concepts and techniques to biomedical signals", "(4) Develop a signal processing system to reliably extract features from biomedical signals for a particular application and justify the approaches/choices made", "1 Knowledge Base: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "4b Critically evaluate and compare design choices 4", "17-Jan Power Spectra and Spectrograms 3", "31-Jan Sampling in Embedded Systems 2", "14-Feb Correlation Analysis 2,3", "24-Feb Parametric Signal Processing 3", "28-Feb Speech Processing and Applications 2,3", "07-Mar Electrodes and coupling to the environment 2", "21-Mar Brain Anatomy and EEG 1", "24-Mar EEG Processing 2,3", "Biomedical Signal Analysis, 3rd Edition.", "A total of 6 assignments will be given during the term.", "Data Collection", "One is for students to gain experience in recording measurements of different biomedical signals.", "The second is to provide a set of recordings for students to use to test and evaluate signal processing approaches.", "It is anticipated the four sets of data collection will be conducted during the term.", "The project is an individual Students will identify an application involving a biomedical signal.", "Based on the application, they will develop and evaluate a signal processing system to reliably extract features from biomedical signals for that application and justify the approaches/choices made.", "Notice of Recording", "Course and Departmental expectations", "Compassionate and respectful communication", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "SYDE-BME Compassionate Accommodation", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 103, "course_code": "CHE 331", "course_name": "CHE331 - Electrochemical Engineering (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electrochemical Engineering Winter 2025", "CHE 331", "01:30PM - 03:20PM", "CHE 331 101", "Topics and applications of electrochemistry and electrochemical engineering.", "Thermodynamic and kinetic aspects of corrosion.", "Electrochemical energy conversion and storage.", "View requirements for CHE 331", "Extend chemical thermodynamics to electrochemical systems.", "Use thermodynamics to predict when a reaction can happen and to describe the activation overpotential of electrokinetic processes.", "Design electrochemical cells and reactors for electrolysis and galvanic processes under given conditions.", "Design and assess corrosion mitigation strategy to extend the lifetime of materials/parts.", "cells, Faraday's law ,current efficiency and electrochemical CSTRs 5-7", "10   8 Current and next-generation battery technologies 19-20", "There final quiz will be during the examination period (April 8th to 25th)", "The most useful textbook in the context of learning fundamental electrochemistry is Bard & Faulkner, Electrochemical Methods: Fundamentals and Applications and also, Electrochemical Science and Technology by Oldham, Myland and Bond was used as a reference for part of the lecture material.", "IMPORTANT:   You cannot fail quiz component and still be given a passing mark in the course.", "Intellectual property includes items such as:", "Graduate Attribute Program Indicators", "A knowledge base for engineering: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "1a Demonstrate understanding of concepts in mathematics.", "1b Demonstrate understanding of concepts in natural science.", "1c Demonstrate understanding of engineering fundamentals.", "1d Demonstrate understanding of specialized engineering knowledge.", "2. Problem Analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "3a Create investigative studies of complex engineering problems.", "3b Gather information from relevant sources to address complex engineering problems.", "4. Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "4a Define design requirements and specifications for complex, open-ended engineering problems.", "4b Critically evaluate and compare design choices.", "7. Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "8a Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Impact of Engineering: An ability to analyze social and environmental aspects of engineering activities.", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "10a Identify ethical and unethical behavior in professional situations.", "10b Identify how an engineer is accountable to multiple stakeholders in engineering practice.", "Life-long Learning: An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge.", "12a Identify gaps in their knowledge, skills and abilities."]}, {"course_id": 104, "course_code": "CHE 361", "course_name": "CHE361 - Bioprocess Engineering (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["03:30PM - 05:20PM", "03:30PM - 04:20PM", "04:30PM - 05:20PM", "Introduction of biological systems for the production of commercial goods and services, e.g., foods, pharmaceuticals, chemicals, fuels, diagnostics, waste treatment, and biomaterials.", "Introduction to design of bioprocess systems, including biosafety and sustainability.", "Development of reaction kinetics associated with biological systems.", "Development of material balances for key constituents in bioreactors operated in different modes, e.g., batch, fed-batch, continuous stirred-tank reactor (CSTR), perfusion, recycle.", "Introduction to mass and heat transfer considerations for bioreactors.", "Dynamic simulation of cultures defined by ordinary differential equations.", "Introduction of downstream processes associated with biological systems and recovery of biological products.", "View requirements for CHE 361", "Understand enzyme kinetics and derive enzyme kinetic equations based on associated biological information", "Model bioreactor for enzymatic reactions", "Understand how cells replicate with bioproduct formation", "Model bioreactor for cell cultivation and bioproduct formation", "Demonstrate competence in the fundamental concepts of biological sciences and biochemical/bioprocess engineering, including biomolecules, biocatalysts, metabolic pathways, enzyme functions/kinetics, cell behaviors and growth kinetics, bioreactor systems for enzymatic reactions and cell cultivation.", "Apply biological and chemical engineering concepts to design and analysis of bioreactor systems, including mass balance, bioreactor types, bioreactor configurations, bioreactor operation, bioreactor control, bioreactor modeling, bioreactor optimization etc. (2a; 2b; 2c; 4a; 5a; 11b)", "•Week 1: Bioprocess introduction and biological background review", "•Week 2: Enzyme kinetics introduction", "•Week 3: Enzyme kinetics modeling", "•Week 4: Bioreactor modeling for enzymatic reaction", "•Week 6: Enzyme inhibition kinetics", "•Week 7: Enzyme inhibition kinetics (continued) and other enzyme kinetics", "•Week 8: Cell growth biology and cell cultivation", "•Week 9: Cell growth kinetics", "•Week 10: Bioreactor (batch) modeling for cell cultivation and bioproduction", "•Week 11: Bioreactor (CSTR) modeling for cell cultivation and bioproduction", "•Week 12: Stoichiometric modeling of cell cultivation and bioproduction", "Bioprocess Engineering (Basic Concepts) No 173.59"]}, {"course_id": 111, "course_code": "CHE 571", "course_name": "CHE571 - Industrial Ecology (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Industrial Ecology Fall 2024", "04:00PM - 05:20PM", "Industrial ecology is a rapidly growing field that systematically examines local, regional, and global uses and flows of materials and energy in products, processes, industrial sectors, and economies.", "It focuses on the potential role of industry in reducing environmental burdens throughout the product life cycle from the extraction of raw materials to the production of goods, to the use of those goods and to the management of the resulting wastes.", "This course will review the environmental issues associated with chemical industries and the roles of engineers to manage these issues.", "The principles and philosophy of green chemistry will be addressed including pollution prevention in unit operations.", "The concepts and practices of environmental life cycle analysis and accounting will be addressed in detail, together with the basics of risk assessment, management and communication.", "View requirements for CHE 571", "Introduction to sustainability and industrial ecology", "Brief overview of the scientific evidence for climate change", "Environmental Law in Canada; due diligence as a defence", "Climate legislation in Canada; carbon trading", "Describe the key principles of industrial ecology, sustainable development and sustainability engineering [1d,8a,9a].", "Explain the science of global warming and climate change [", "Apply carbon accounting standards to develop greenhouse gas emission and reduction estimates for inventories and reduction projects [", "Describe key environmental legislation in Ontario and Canada [8b,9a]", "Basics of sustainability and industrial ecology.", "Introduction to greenhouse gas (GHG) accounting.", "Week 5 GHG accounting - offset systems.", "A timed multiple-choice component.", "3.0 points - solutions are complete, correct and well-presented.", "2.0-2.5 points - solutions are mostly complete and well-presented but have minor errors, missing information.", "Intellectual property includes items such as:", "Graduate Attribute Program Indicators", "A knowledge base for engineering: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "1a Demonstrate understanding of concepts in mathematics.", "1b Demonstrate understanding of concepts in natural science.", "1c Demonstrate understanding of engineering fundamentals.", "1d Demonstrate understanding of specialized engineering knowledge.", "2. Problem Analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "3a Create investigative studies of complex engineering problems.", "3b Gather information from relevant sources to address complex engineering problems.", "4. Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "4a Define design requirements and specifications for complex, open-ended engineering problems.", "4b Critically evaluate and compare design choices.", "7. Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "8a Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Impact of Engineering: An ability to analyze social and environmental aspects of engineering activities.", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "10a Identify ethical and unethical behavior in professional situations.", "10b Identify how an engineer is accountable to multiple stakeholders in engineering practice.", "Life-long Learning: An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge.", "12a Identify gaps in their knowledge, skills and abilities.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 114, "course_code": "CIVE 460", "course_name": "CIVE460 - Engineering Biomechanics (0.50)", "term_name": "List 3", "program_name": "Nanotechnology Engineering", "program_id": 120, "major_id": 5, "major_name": "Nanotechnology Engineering (Bachelor of Applied Science - Honours)", "topics": ["Engineering Biomechanics Winter 2025", "02:30PM - 05:20PM", "RCH 301", "Introduction to engineering technologies applicable to the field of biomechanics.", "Specific topics covered may include biological growth, form and function; biomaterials; kinematics and neurology of gait; biotribology; joint anatomy, function and repair; occupational biomechanics; trauma prevention.", "The course will provide a general overview of engineering biomechanics for civil, mechanical and biomedical engineering students.", "2. Conduct gait analysis and calculate forces applied at joints and foot reactions", "Introduction", "Evolution of Biomechanics", "Applications (medical and engineering)", "Musculoskeletal System", "Introduction,", "Anatomical positions & movements,", "System components,", "Gait Biomechanics", "Introduction;", "Muscles forces,", "Bone & Cartilage Biomechanics", "Introduction (highlights & progress),", "Bone mechanical properties & applications;", "Cartilage structure and mechanics", "Tendon & Ligament biomechanics", "Mechanical behaviour", "Biotribology & Joint Replacement", "Biotribology subfields,", "Cancer Biomechanics", "Introduction: cancer stages,", "Mechanical characteristics of cancer cells,", "Biomechanics and cancer treatment,", "Cardiovascular biomechanics, and", "Biomechanics in Radiotherapy", "“Orthopaedic Biomechanics: Mechanics and Design in Musculoskeletal Systems,” Pearson Prentice Hall.", "Biomechanics and motor control of human movement.", "Biomechanics and motor contAl-Mayah, A. (Ed.)"]}]