[{"course_id": 5, "course_code": "STAT 331", "course_name": "STAT331 - Applied Linear Models (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Applied Linear Models Winter 2025", "08:30AM - 09:50AM MC 4020", "02:30PM - 03:20PM", "RCH 101", "Thursdays from 3:00-4:00pm in M3 3021", "Modelling the relationship between a response variable and several explanatory variables (an output-input system) via regression models.", "Model diagnostics and improvement.", "Algorithms for variable selection.", "Review of basic Normal theory, t, chi-squared, and F distributions.", "Simple linear regression.", "Analysis of variance.", "Multiple linear regression, variable selection techniques, indicator variables, diagnostics.", "Brief introduction to non-linear regression, factorial experimentation.", "Registered students can enroll in the class discussion board through Piazza.", "Search for your question first before posting.", "Do not expect a full solution to your question.", "To help maintain a safe, respectful, and productive community in which we – students and teaching team alike – can take risks in our learning/teaching, tackle challenging concepts, and ultimately grow as learners, we should endeavor to follow these mutual expectations:", "Explain the main concepts of linear regression models.", "Understand the methods of least squares and maximum likelihood estimation for model parameters.", "Interpret the model and its parameters (e.g., regression coefficients) in the context of any application.", "Draw inferences from a fitted model about the parameters of interest and make predictions.", "Apply the previous two outcomes when fitting linear models to real data using R.", "Assess model quality by diagnosing violations in underlying model assumptions (and identify strategies for improvement).", "Evaluate competing fitted models built using various model selection methods (and choose between them).", "Introduction", "The Straight Line Model", "Model formulation and interpretation", "Least squares estimation", "Mean response and residual variance estimation", "Introduction to R/RStudio", "Maximum likelihood estimation", "Estimators and their properties", "Important distributions", "Distributions of estimators", "Confidence intervals", "O - Ch. 2-4", "Straight Line Model in R", "Prediction intervals", "Intervals in R", "Hypothesis testing", "O - Ch. 4-5", "ANOVA and F test", "Model limits", "Data transformations", "O - Ch. 4-6", "O - Ch. 7", "A1 and Q1 Solutions", "Multivariate normal distribution", "The Linear Model", "Examples", "O - Ch. 8-9", "Estimation", "Estimators and their properties", "Distributions of estimators", "O - Ch. 9, 11, 12", "ANOVA and F test", "Significance tests", "General linear hypothesis", "O - Ch. 9, 11, 12", "A2 and Midterm Solutions", "Case Study: South African heart disease", "Nested models", "Additional sum of squares", "O - Ch. 12", "Outliers", "O - Ch. 13-14", "Influence", "O - Ch. 14-15", "A3 and Q2 Solutions", "One-variable-at-a-time selection methods", "Criteria-based selection methods", "O - Ch. 16", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solve exercises from the textbook on your own.", "Introduction to Regression Modeling by Abraham and Ledolter This textbook is an optional reference book (available for free on LEARN).", "R and R-Studio Free software.", "To serve as an opportunity to demonstrate your understanding, application, and integration of the course material, including practical application of the skills/concepts with the statistical software, R.", "Missed Assignment: The time window to complete these assessments are generous and, in general, a sickness lasting a couple of days will not be enough of a reason to ask for alternative accommodations and/or extension.", "Tips for Success", "Students should critically compare their work with available solutions and against the solutions of fellow classmates.", "Notice of Recording", "To help you decide if you should isolate, you can use the provincial self-assessment tool.", "In the scenario where we must transition back online the following contingencies will be used:", "These materials are made available for the personal use of students registered in the current offering of this course.", "Students may not distribute or reproduce these materials for commercial or non-commercial means.", "In particular:", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as mathematical proofs and the fitting, interpretation, and assessment of linear models in real applications.", "Library for research-based assignments"]}, {"course_id": 7, "course_code": "STAT 333", "course_name": "STAT333 - Stochastic Processes 1 (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["11:30AM - 12:20PM DC 1350", "04:00PM - 05:20PM", "Erik Hintz: Fridays, 2:00pm - 3:00pm, in M3-2106", "Requests must be emailed to: sasugradadv@uwaterloo.ca", "Topics cover generating functions, conditional probability distributions and conditional expectation, discrete-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, applications including the random walk, the gambler's ruin problem, and the Galton-Watson branching process, an introduction to counting processes, connections between the exponential distribution and Poisson process, and non-homogeneous and compound Poisson processes.", "use moment generating functions as a tool to determine expected values and identify probability distributions of random variables;", "use the law of total expectation to calculate expected values and probabilities through the principle of conditioning;", "specify a discrete-time Markov chain (DTMC), in terms of its transition probability matrix and initial conditions, and calculate various transition probabilities;", "classify the states of a DTMC;", "define fundamental DTMC concepts including irreducibility, periodicity, and recurrence/transience;", "find limiting/stationary probability distributions for certain DTMCs through the use of the Basic Limit Theorem;", "calculate absorption probabilities and expected absorption times for DTMCs using the principle of conditioning with respect to the first transition;", "Week 11 March 24 - March 28 Chap 4: Exponential Distribution & Poisson Processes Tutorial Assignment 2", "Week 12 March 31 - April 4 Chap 4: Exponential Distribution & Poisson Processes Tutorial Test 3", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solving exercises from the Course Notes on your own.", "Introduction to Probability Models by Sheldon M. Ross (2019)"]}, {"course_id": 8, "course_code": "STAT 341", "course_name": "STAT341 - Computational Statistics and Data Analysis (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Computational Statistics and Data Analysis Winter 2025", "04:00PM - 05:20PM", "10:00AM - 11:20AM EIT 1015", "04:30PM - 05:20PM", "Megan French", "Daniel Zhang", "While personal matters can be communicated via email, Piazza should be the primary platform for Q&A outside of class.", "A computationally focused approach to statistical reasoning in the context of real data.", "Functional programming in R and algorithms will be used to define interesting attributes of finite populations and their sampling characteristics.", "Understand the fundamentals of population-based statistical analyses, as well as implicitly/explicitly defined population attributes", "Understand the basics of sampling and the underlying ideas/mechanisms of probability sampling and related issues", "Understand the basics of inductive inference including target and study populations, measurements, comparing subpopulations, random intervals and coverage probabilities, and resampling methods such as bootstrap", "Generate high-quality visualization and inferential statistics R output for the topics above", "Prepare reports that communicate your statistical analyses using LaTeX and R Markdown.", "Jan. 6 Introduction to the course", "location and scale invariance/equivariance", "Power transformations and linear relationships", "Implicitly defined Attributes", "Solving system of equations Assignment #1", "Iteratively re-weighted least-squares", "Sampling mechanisms and inclusion probabilities", "Sampling design", "9. Mar. 3 Anatomy of tests of significance", "A t-like discrepancy measure  Assignment #2", "Mar. 10 Multiple testing", "Student-t-based intervals", "Mar. 17  Introduction to resampling methods", "Bootstrap in regression", "Multiple samples and prediction", "Decomposition of APSE, bias-variance trade-off", "Training and Test sets", "K-fold cross validation Assignment #3", "Each folder will contain five files, e.g. for section 2.1-", "There will be a 2.5-hour, closed book, cumulative final exam during the Final Examination Period: April 9 – April 25.", "An INC grade is rarely granted and will be considered on a case-by-case basis, with decisions based largely on your performance throughout the semester.", "Self-Declared COVID-19 Related Absences: You may self-declare one absence per term during the formal lecture period for influenza-like illnesses.", "Course Software: R is a language and a free statistical computing and graphics software that we will use extensively throughout the course.", "The only time you may run into trouble is if you call a function from a package to handle a task you have been asked to code out explicitly.", "For example, if you are asked to code a function that calculates the mean of a vector in R, and your solution is to just call the function mean(), then you will not receive any marks.", "Communication: When you email your instructor, make sure you include the following information in your email:", "Including non-English characters in your email (sometimes imposed by installing a non-English operating system) prompts UW servers to spam your emails for the instructor.", "These characters most often appear in (not exclusively) the subject line, From, To, and Date/Time portions of previous communications if you reply to an email.", "You must use the web-based email platform if you suspect that you have non-English characters in your emails imposed by your computer, phone, tablet, etc.", "This course includes the independent development and practice of specific skills related to computational statistics and data analysis.", "Phone: 519-884-0000 extension 213"]}, {"course_id": 10, "course_code": "CS 146", "course_name": "CS146 - Elementary Algorithm Design and Data Abstraction (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Elementary Algorithm Design and Data Abstraction (Advanced Level)", "Monday -", "Monday", "07:00PM - 08:50PM", "02:30PM - 03:20PM", "Brad In-person MC 6427", "On-line Consulting Hours: Microsoft Teams", "CS 146: Elementary Algorithm Design and Data Abstraction (advanced version)", "To familiarize students with key concepts in introductory computer science from an imperative perspective and to contrast this with the functional perspective taken in CS 145;", "To allow students to complete the CS portion of their Math core requirements and, if desired, to continue on to second-year core courses in CS;", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "Introduction to C and elementary mutation in Scheme", "The memory model.", "Variable declaration, assignment and infix expressions in C. Basic I/O in C. Compilation.", "Algorithm analysis in C. File I/O in C and Scheme.", "Program organization and testing methods.", "Space analysis in C and Scheme.", "Mutable lists, queues, deques, and trees in C. Time-space tradeoffs among mutable and immutable ADT implementations.", "Low-level abstractions", "Pointer arithmetic in C. Arrays in C and vectors in Scheme.", "Strings in C. Elementary hashing.", "Libraries in C and Scheme.", "Implementing high-level abstractions", "given a clear and concise statement of a problem or task, write a program from scratch of up to two hundred lines of properly-formatted and documented C code to solve the problem or carry out the task;", "use elementary data structures such as lists and trees in such programs, with proper attention to explicit allocation and deallocation of memory;", "be able to write programs in both Scheme and C that obtain input from external sources and/or send output to external sources (interaction, files, redirected files) and whose I/O behaviour conforms to precise specifications;", "analyze the running time and space requirements of such programs and describe examples of data that demonstrate that the analysis cannot be improved.", "The provided slides are not a substitute for attendance in any first-year CS course, but in CS 146, there are no slides, and the lecture summaries made available after lecture are an even worse substitute for attendance.", "Lectures will involve the development of ideas summarized very tersely in the handouts, as well as on-the-fly development of code, analyses, and proofs.", "CS145 and CS146 were originally designed as a year-long unit of curriculum, but eventually the individual courses drifted in their own directions.", "1.1 A note on logistics", "1.2 Review of forms of recursion and associated proof techniques", "1.3 In preparation for side effects", "1.4 Output", "1.5 Input", "1.6 First Introduction to C", "1.8 Memoization", "1.9 Mutation in C", "1.11 Boxes in C", "1.12 Advanced mutation", "1.13 Aliasing in C", "1.14 Memory and vectors", "1.15 Vectors in Racket", "1.16 Arrays in C", "1.18 ADTs in C; Amortized Analysis", "2 SIMPL: a simple imperative language", "2.1 Syntax and informal semantics", "2.2 Examples in several languages", "2.3 Formal semantics", "2.5 Proving imperative programs correct", "A primitive imperative language", "3.1 A primitive imperative language", "3.2 The PRIMPL simulator", "3.4 The SIMPL to A-PRIMPL compiler", "3.6 Strings in C", "3.7 Adding functions to SIMPL", "3.8 Adding both arrays and functions to SIMPL", "3.9 Implementing lists in PRIMPL", "4 MMIX: a realistic instruction set", "4.1 A more realistic processor", "4.2 The MMIX architecture", "4.2.1 Branches and Jumps", "4.2.2 Example", "4.2.3 Software Interrupts", "4.2.5 A Problem with Branches and Jumps", "4.4 Towards a SIMPL to MMIX compiler", "5.1 Storing primitive values", "5.3 Managing memory", "5.4 Structural and pointer equality", "5.5 Function application in a Racket interpreter", "5.7 Justifying the cost of Racket primitives", "5.8 Moving towards implementation in an imperative language", "6.2 Zippers", "6.3 A continuation-passing interpreter", "6.6.2 Mark-and-sweep", "6.6.3 Copying garbage collection", "6.7 Heterogeneous Data in C", "6.8 Multidimensional Arrays in C", "6.10 Variable-length Argument Lists", "7.1 Continuation-passing style", "7.2 Exception handling", "7.3 Undelimited continuations", "7.4 Delimited continuations", "7.5 Racket’s implementation of continuations", "In CS 146, we will examine the imperative paradigm, and compare and contrast the way that efficient algorithms and data structures are designed in imperative and functional languages.", "Racket is a laboratory for current research on aspects of functional programming languages, and we will continue to look at interesting topics in this area, perhaps at the cost of some coherency in the flow of material.", "They will not be due each week on the same day, as is common in the other first-year CS courses and the first-year Math courses.", "Assignment questions are the main way to reinforce and deepen your understanding of the concepts and skills discussed in lecture.", "You will submit program files electronically to the Marmoset system , which runs tests on your code and informs you of the results fairly rapidly.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "(Please also note that we may use the trends in a student's submission history to estimate the likelihood of other forms of cheating as well.)", "Library for research-based assignments"]}, {"course_id": 11, "course_code": "CS 240", "course_name": "CS240 - Data Structures and Data Management (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Data Structures and Data Management Winter 2025", "10:00AM - 11:20AM RCH 112", "11:30AM -", "10:30AM - 11:20AM MC 4040", "11:30AM - 12:20PM MC 4040", "Email: oveksler@uwaterloo.ca", "Email: cs240@uwaterloo.ca", "Email: cs240@uwaterloo.ca", "All of Tom's consulting hours are in-person in MC 4065.", "Email: cs240@uwaterloo.ca", "Email: cs240@uwaterloo.ca", "Email: cs240@uwaterloo.ca", "Instructional Support Coordinator: Karen Anderson", "Email: kaanders@uwaterloo.ca", "Introduction to widely used and effective methods of data organization, focusing on data structures, their algorithms, and the performance of these algorithms.", "CS 240: Data Structures and Data Management", "This course introduces widely used and effective methods of data organization, focusing on data structures, their algorithms, and the performance of these algorithms.", "Analyze, apply, and use various data structures and data-management techniques in a variety of applications", "Perform rigorous complexity analyses of simple algorithms and data structures, which includes writing correct mathematical proofs on inductively-defined structures and solving simple recurrence relations", "Select a good data structure to solve a specific algorithmic problem", "Apply data structures correctly and efficiently in one or more high-level programming languages, including C++", "Audience", "Successors: Most third-year CS major courses", "Conflicts: Other courses that seriously consider efficiency and correctness of fundamental data structures and their algorithms", "Analytical:", "Define and explain order notation; perform complexity analyses of simple algorithms", "Perform basic computations of discrete probability and expectation", "Use mathematical induction on recursively defined structures, including finding simple errors in inductive arguments", "Prove simple properties of program fragments correct through the use of pre-conditions and post-conditions for loops and recursive calls", "Computational and algorithmic:", "Design, implement, test, and debug C++ programs to solve problems requiring hundreds of lines of code", "Define the ADTs for stacks and queues; write efficient implementations in C/C++", "Describe tree structures, including binary search trees and multi-way trees; use these structures in C/C++ programs", "Describe basic sorting algorithms (including Quicksort) and implement them in C/C++", "Perform rigorous asymptotic analyses of simple algorithms and express the result using order notation; compare algorithms based on their asymptotic complexity; and prove formal results involving order notation", "Apply the priority-queue ADT to solve various application problems, implement a priority queue using heaps, and analyze the complexity of common implementations of heap operations", "Develop best-, worst- and average-case analyses of sorting algorithms, including Quicksort, and explain the ramifications of these analyses in practice; explain the basic principles of randomized algorithms and their potential advantages, specifically in the case of Quicksort; explain the difference between comparison-based sorting and non-comparison-based sorting algorithms, and when and why the latter may run faster; and apply sorting-based techniques to algorithmic problems, such as elimination of duplicates", "Explain the advantages and disadvantages of various hashing techniques; identify the best hashing techniques to use in a particular application scenario; and recognize when hashing techniques are preferable to other dictionary implementations", "Design data structures for real-world data (where keys are often inherently multidimensional) in such a way that common operations (including range search) can be implemented efficiently", "Design special data structures that can efficiently store and process words and strings, and select and apply a suitable technique for data compression in a specific application scenario", "Introduction and review (3 hours)", "Basic computer model: the random-access machine", "Runtime of an algorithm: worst-case, best-case, and average-case", "Review of stacks and queues", "Priority queue ADT and simple implementations", "Sorting and analysis of randomized algorithms (5 hours)", "Quicksort (non-randomized): worst-case, best-case, and average-case complexity", "Randomized quicksort and its analysis; application to selection and its analysis", "Lower bound on comparison-based sorting", "Non-comparison-based sorting algorithms (e.g., Counting Sort and Radix Sort)", "Dictionary ADT and simple implementations", "Binary search trees (insert and delete operations and analysis)", "Key-indexed search, simple hash functions", "Range search in a binary search tree", "Algorithms and data structures for text processing (8 hours)", "Sometimes these include animations/overlays, in case of which there will be both a Display version (with them) and a Print version (omitting them, but otherwise the same content).", "The slides for each module will be posted as the term progresses.", "Module 1 Introduction and Asymptotic Analysis M1.pdf", "Module 3 Sorting, Average-Case and Randomized Algorithms M3.pdf", "Optional: Goodrich & Tamassia   8.3", "Module 8 Range-Searching in Dictionaries of Points   Course notes Chapter 8", "A0.tex", "A1.tex", "The following books are on reserve in the DC library for reference and additional resources:", "Algorithm Design and Applications (2015)", "Also covers cuckoo hashing.", "Sedgewick] Algorithms in C++, Third Edition (1998)", "Computational Geometry: Algorithms and Applications", "CLRS] Introduction to Algorithms, 2nd edition (2001)", "Introduction to Algorithms, 2nd edition is also avaliable online (in campus).", "This website will be the primary means of communication and distribution of materials for the course.", "The course uses a number of different tools for distributing information and receiving submissions.", "These are not worth credit, but may help you in self-testing your understanding of the material.", "Only one programming question can be shifted to the final exam.", "If more than this has verification for non-submittal, then it will be considered on a case-by-case basis.", "A student with a medical reason may not be granted an INC because they have not performed sufficiently well during the academic term.", "An INC will be granted ONLY if there is a strong reason for missing the exam (generally a serious medical issue verified by a doctor's note) AND a satisfactory performance during the term (both assignments and midterm).", "Academic Dishonesty", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "The first criterion for marking is the correctness, the second criterion is efficiency.", "describe the main idea first in words,", "In the case that you are using facts stated in lectures/modules, be sure to cite where you got them from.)", "Files should be named .cpp, where the specific file name will be specified in the assignment.", "You should include sufficiently many comments in your code that the main ideas of design and correctness are clear.", "One-line changes: In the case you passed the public test, and failed some secret tests, if your program works with a one line change, then we may accept it for remarking and give some marks after deducting a penalty (typically 10-20% of the programming question).", "Here are some ways to create PDF files:", "Create your solution in LaTeX. LaTeX is a document preparation system that uses a mark-up language to write/create and co-ordinate different parts of documents, including diagrams and was introduced in Assignment 0.", "The following are least preferred methods since the results may be hard for markers to read and/or the files may be too large.", "Submitting a Re-Mark Request: Please email cs240@uwaterloo.ca in order to submit a request.", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course."]}, {"course_id": 16, "course_code": "CS 245E", "course_name": "CS245E - Logic and Computation (Enriched) (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["10:00AM - 11:20AM MC 2034", "Tuesday -", "This includes:", "Basic sematic notions:", "Truth tables", "A formal proof system for Propositional logic", "Soundness and completeness theorems for the proof system", "Basic sematic notions", "Structures for a vocabulary", "Logical truths and logical implications", "Translations between FOL formulas and English and mathematical statements.", "A formal proof system for Predicate logic", "Soundness theorem for the proof system", "However, the focus of this version of the course is more on fundamental and mathematical concepts (on the expense of developing technical skills, such as designing formal proofs).", "We will use propositional logic as a main tool for demonstration key logical concepts such as", "Structural induction its justification and many applications.", "soundness and completeness theorems", "the expressive power of the logic (what can and what cannot be expressed).", "We will revisit these topics for first order logic.", "Finally, we will discuss applications of logic to computer science, in particular showing limitations of computations (undesirability)."]}, {"course_id": 17, "course_code": "CS 246", "course_name": "CS246 - Object-Oriented Software Development (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Object-Oriented Software Development Winter 2025", "10:00AM - 11:20AM MC 1056", "10:30AM - 11:20AM MC 3003", "11:30AM - 12:20PM MC 3003", "Tuesday -", "Ross Evans rpevans@uwaterloo.ca", "Introduction to object-oriented programming and to tools and techniques for software development.", "Designing, coding, debugging, testing, and documenting medium-sized programs: reading specifications and designing software to implement them; selecting appropriate data structures and control structures; writing reusable code; reusing existing code; basic performance issues; debuggers; test suites.", "This course introduces students to object-oriented programming in C++ to facilitate designing, coding, debugging, testing, and documenting medium-sized programs.", "Students learn to read a specification and design software to implement it.", "Important skills are selecting appropriate data structures and control structures, writing reusable code, reusing existing code, understanding basic performance issues, developing debugging skills, and learning to test a program.", "C++", "Introduction to C++", "I/O and Strings", "Basic language constructs and Functions", "Exceptions", "Introduction to Templates", "Exception safety", "Template functions and algorithms", "Object-Oriented Programming", "UML class models", "Constructors and Destructors", "Encapsulation", "Inheritance", "Design patterns: Iterator, Observer, Decorator, Factory method, Template method, Non-virtual interface (NVI), and the Pimpl idiom", "Inheritance: vtables", "Multiple inheritance", "Design quality", "MVC (model-view-controller) architecture", "Design, implement, test, and debug C++ programs to solve problems requiring hundreds of lines of code, making appropriate use of", "types, variables, arrays, strings, and dynamic memory; loops, conditionals, and other control structures; structures, unions, and enumerations; procedures and functions; the preprocessor; formatted and unformatted I/O", "a subset of the STL, including vector, list, and map", "assertions and exceptions", "test suites for regression testing, white and black box testing", "structured programming, incremental development", "interface design, abstractions, information hiding, cohesion and coupling", "a subset of UML to specify classes, objects and relationships among them", "a selection of design patterns", "Explain the following properties of the memory model used in C++, including their impact on time and space efficiency when designing code: bytes vs. words, memory as an array, run-time stack and stack frames, memory allocation on the heap vs. automatic allocation on the stack, pointers as memory addresses, the representation of objects in memory", "You must complete A0 in order to receive marks for the rest of the course.", "A1 Basic C++ Monday, January 20 Monday, January 27 5", "A2 Introduction to OOP Monday, February 3 Monday, February 10 6", "A4 Design Patterns Monday, March 10 Monday, March 17 8", "Note: Marmoset is not a compiler!", "Do not submit C++ code to Marmoset, without first attempting to compile it yourself.", "Students from different sections can be in the same group.", "Working on a group is an important learning experience for software development in a team.", "Students in a group will be responsible for forming and managing the group.", "Please be very careful in selecting your group as there are always groups that end up having major issues every term.", "Exams", "Examination Date Final Grade Weight", "Each weekly set of problems completed succesfully can be used to replace 0.5% of the final grade from the final exam.", "In the case where both a midterm and final exam can be held, the final course grade will be calculated from the following components and weights:", "To pass the course, you must satisfy these three conditions:", "A grade of at least 45% on the weighted average of assignments A1-A4", "Assignments1to4  = (A1*5 + A2*6 + A3*6 + A4*8) / 25", "Normal = A1*5 + A2*6 + A3*6 + A4*8 + A5*15 + Midterm*20 + Final*(40-0.5*TutorialsCompleted) + 0.5*TutorialsCompleted", "if (MidtermInPerson==TRUE && FinalInPerson==TRUE)", "else", "if (MidtermInPerson==FALSE && FinalInPerson==TRUE)", "else", "if (MidtermInPerson==TRUE && FinalInPerson==FALSE)", "else", "if (MidtermInPerson==FALSE && FinalInPerson==FALSE)", "else", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 25, "course_code": "STAT 431", "course_name": "STAT431 - Generalized Linear Models and their Applications (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Generalized Linear Models and their Applications Winter 2025", "Review of the normal linear model and maximum likelihood estimation; regression models for binomial, Poisson and multinomial data; generalized linear models; and other topics in regression modelling.", "The primary objective of this course is to introduce students to generalized linear models.", "Attention will be mainly directed towards theory and applications involving binary, categorical, and count data, although the generalized linear model will be presented in its full generality for responses from the exponential family.", "This course introduces several useful regression techniques for the analysis of data arising in many different settings (ie， medicine, industry, psychology etc.).", "The intended audience consists of students interested in advanced regression modeling.", "The objectives are to help students develop an understanding of the statistical theory and to equip them with the ability to fit regression models for a wide range of problems.", "run generalized linear regression for binary, categorical and count data and have a deep understanding of the underlying theories.", "Week 7 Dose-Response Models Lecture 11", "An Introduction to Generalized Linear Models by Dobson, AJ and Barnett, AG, fourth edition No 92", "Software: Students are encouraged to use R for coding problems in assignments, but feel free to use any computing software you feel comfortable with.", "An introduction to R: https://cran.r-project.org/doc/manuals/r-release/R-intro.pdf.", "Arrangements for students with official conflicts will be handled on a case by case basis."]}, {"course_id": 27, "course_code": "STAT 441", "course_name": "STAT441 - Statistical Learning - Classification (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["10:00AM - 11:20AM B1 271", "Email: mlysy@uwaterloo.ca", "STAT 841: View requirements for STAT 841", "Describe the basic principles and methods of statistical classification.", "Know when to use each of these methods on a given dataset.", "Evaluate and compare the output of various classifiers.", "An Introduction to Statistical Learning with Applications in R, by James, Witten, Hastie & Tibshirani https://www.statlearning.com", "There will be two closed-book midterms worth 15% each on the following dates:", "There are no make-up midterms in this course.", "Discussion Board", "Please self-enroll at https://piazza.com/uwaterloo.ca/winter2025/stat441841cm763.", "You can generally expect a response from TAs within two business days.", "Software", "Material and assignments will require the use of R and Python programming languages, as well as the technical document writing programs for these languages: R Markdown and Quarto.", "Regrades", "Email", "Emails which do not adhere to this standard will generally be ignored.", "Intellectual property includes items such as:", "In particular:", "Please inform us of these at the start of the course."]}, {"course_id": 28, "course_code": "STAT 442", "course_name": "STAT442 - Data Visualization (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Notice of Recording", "Data Visualization Winter 2025", "11:30AM - 12:20PM B1 271", "Discussion Board", "Email", "Response time", "Both human perception and statistical properties inform the methods used to display and visually explore categorical, continuous, time-ordered, map, and high dimensional data.", "Statistical concepts visually presented include variability, densities, quantiles, conditioning, and hypothesis testing.", "Interactive graphics include linking, brushing, motion, and the navigation of high dimensional spaces guided via projection indices.", "Interpret and critique the most commonly used kinds of visualizations today.", "Create a variety of univariate, bivariate, and multivariate graphs using base R and the tidyverse.", "Look up the necessary code to complete additional graphs not covered here.", "Book - Data Science - A First Introduction.", "Book - The Chicago Guide to Multivariate Analysis, Jane E. Miller", "Book - Cool Infographics - Effective Communication with Data Visualization and Design, Randy Krum.", "Industry Paper - Making Data Meaningful, United Nations Economic Commission for Europe.", "Notice of Recording", "No waiving of this penalty will occur for technical issues.", "Details can be found here: https://uwaterloo.ca/math/accommodations", "Phone: 519-884-0000 extension 213", "Lots of people look like they have it together in public and online when they're a mess inside too.", "They got you into university, so they've already done most of the work, but at this point, the most they can really do for you decide if you can get into graduate school before doing industry experience.", "Don't let that be your reason for thinking this is as good as it gets.", "In particular:", "Please inform me of these at the start of the course."]}, {"course_id": 33, "course_code": "MATH 237", "course_name": "MATH237 - Calculus 3 for Honours Mathematics (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["The gradient vector and the directional derivative.", "Multiple integrals in various co-ordinate systems.", "Choose appropriate techniques from differential multivariable calculus to solve optimization problems both with and without constraints.", "Choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Unit 1: Graphs of Scalar Functions", "Unit 3: Continuous Functions", "Week 3 Unit 4: The Linear Approximation and Partial Derivatives MA Unit 4", "Unit 7: Directional Derivatives and the Gradient Vector", "Unit 11: Coordinate Systems", "Unit 13: Jacobians and Inverse Mappings", "Beyond this, no extensions will be given without a timely and documented justified cause, including opportunely and officially reporting absences to the university.", "Communication Etiquette", "Avoiding Academic Offences", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as: analyze functions of two or more variables with respect to limits, continuity, differentiability, and linear approximation; choose appropriate techniques from differential multivariable calculus to solve optimization problems; choose appropriate coordinate systems, build linear mappings, and apply the Change of Variable Theorem to evaluate double and triple integrals.", "Library for research-based assignments"]}, {"course_id": 35, "course_code": "MATH 239", "course_name": "MATH239 - Introduction to Combinatorics (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics Winter 2025", "11:30AM - 12:20PM MC 4059", "09:30AM - 10:20AM MC 4021", "P. Nelson", "08:30AM - 09:20AM QNC 1502", "S. Pfannerer-Mittas", "10:30AM - 11:20AM MC 4058", "11:30AM - 12:20PM MC 4058", "09:30AM - 10:20AM MC 4042", "02:30PM - 03:20PM", "10:30AM - 11:20AM PHY 150", "04:30PM - 05:20PM", "You should have no reason to contact them directly, but you can find their email addresses through Learn.", "First name Last name", "Guilherme Zeus Dantas E Moura", "Theodore Morrison", "Matthew Kroeker", "Introduction to graph theory: colourings, matchings, connectivity, planarity.", "Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees.", "MATH 239 is an introduction to combinatorics with a particular focus on counting techniques and graph theory.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 36, "course_code": "MATH 249", "course_name": "MATH249 - Introduction to Combinatorics (Advanced Level) (0.50)", "term_name": "Required Courses", "program_name": "Data Science", "program_id": 44, "major_id": 2, "major_name": "Data Science (Bachelor of Mathematics - Honours)", "topics": ["Introduction to Combinatorics (Advanced Level)", "09:30AM - 10:20AM MC 2017", "For graph theory, while we will focus on the same topics covered in MATH 239 (planarity and bipartite matching), our coverage of those topics will differ substantially in depth and in the techniques that we employ; in particular, we will see striking applications of algebra.", "extract coefficients from rational generating series", "find maximum matchings in bipartite graphs", "understand and use the concepts of paths, cycles, trees, bipartiteness, and planarity in graph theory", "be comfortable writing proofs for results on discrete objects", "2 Jan 13,15,17 Generating series, Sum and Product lemmas, Negative Binomial Theorem, Integer Compositions Part I: 2.1-2.3", "5 Feb 3,5,7 Solving linear recurrence relations, Binary trees, irrational generating series Part I: 4.1, 4.2, 4.4 Assignment 4, Feb 7", "6 Feb 10,12,14 Introduction to graph theory Part II: 4.1-4.6 Assignment 5, Feb 14", "Grading scheme A", "Students are encouraged to collaborate on solving the questions but each student must write their own solutions independently in their own words.", "Please inform of us these at the start of the course.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 1, "course_code": "BET 360", "course_name": "BET360 - Design Frameworks for Social Ventures (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Design Frameworks for Social Ventures Fall 2024", "BET 360", "In this course, students will explore several design frameworks as they relate to complex problems; assess the impacts of these frameworks in recent entrepreneurial applications; and determine how to apply these concepts in the design of the social impact aspects of ventures and cross-industry collaborations.", "View requirements for BET 360", "Articulate the importance of design, and design thinking in solving problems for social and environmental change, through entrepreneurial ventures", "Understand, describe, and apply emerging frameworks in designing for social impact (ie.", "Collaborate with others to explore significant social problems using critical lenses", "Design, when everybody designs: An introduction to design for social innovation.", "Thinking in Systems: A primer.", "Electronic Device Policy", "Accommodation for Students with Disabilities", "This course includes the independent development and practice of specific critical thinking skills, such as;", "To understand, explain, and analyze base content knowledge around a range of topics in social impact and design, curated for this course", "Library for research-based assignments"]}, {"course_id": 5, "course_code": "PACS 315", "course_name": "PACS315 - Engineering and Peace (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Engineering and Peace Fall 2024", "07:00PM - 09:50PM CGR 1302", "Office Hours: Online or in-person meetings can be booked via Calendly between 8:30 AM – 4:30 PM on weekdays", "This course is built on the conviction that the kinds of problems engineers seek to address, and the ways they seek to address them, should matter for anyone interested in advancing peace in the world.", "Topics include historical connections between the discipline of engineering and warfare, understanding the engineering method and mindset, and technological frontiers for peacebuilding.", "Augment their approach to analyzing and solving problems with insights from both engineering and peacebuilding theory and practice; and", "Identify opportunities to apply their expertise and passions to make a meaningful social impact", "Why has war been the business of so many engineers?", "Sep. 18", "Sheldon Fernandez", "UWaterloo Turkstra Chair in Urban Engineering", "Critical Media Lab", "Communitech", "Laurel Boytim", "The Ripple Effect Education", "Engineers as social innovators Riley, “We’ve Been Framed!”", "Global Peace Index 2024 Institute for Economics & Peace.", "Morgan & Claypool Publishers, 2007.", "We’ve Been Framed!", "Also available for free through MIT Press Open Access] No", "Engineers of Jihad: The Curious Connection Between Violent Extremism and Education.", "Engineers of Jihad: The Curious Connection Between Violent Extremism and Education.", "A Perusall-generated score of 2.0 or higher is required to receive credit each week, and the overall grade for this element will be based on the accumulation of these credits (2% per reading assignment up to a maximum of 10 credits).", "Engage with a guest engineer and/or peacebuilder.", "Each class will begin with a conversation with a guest speaker with expertise and life experiences related to the topics covered in this course.", "95% – Made a contribution that went above and beyond expectations by demonstrating an exceptional level of consideration and care, and/or providing a rare and surprising degree of insight", "Each submission should be a minimum of 250 words.", "Offer a critique of the book, highlighting both strengths and witnesses, as well as offering a recommendation for who would benefit most from reading the book.", "Why did you chose to attend this event?", "Who played a key role in leading the event?", "Please read Grebel's full land acknowledgement for additional context on the college’s connections to the first European settlers on this land.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "This course includes the independent development and practice of reflection and writing skills."]}, {"course_id": 6, "course_code": "PHIL 226", "course_name": "PHIL226 - Biomedical Ethics (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Biomedical Ethics Winter 2024", "I will have in-person drop-in office hours on Mondays and Wednesdays 1:15-2:15 in Hagey Hall 322A. You can also request an appointment by emailing me and letting me know your availability as well as whether you prefer virtual or in-person.", "If you are in a debate club, your goal is to defeat your opponent.", "Philosophy is not a debate club.", "First, I will describe the overall structure of the course.", "There will be a multiple choice Learn quiz on Unit 1.", "Third, we spend three classes learning about some general ethical concepts relevant to bioethics: utilitarianism, care ethics, and relational autonomy.", "One is a multiple choice Learn quiz on the readings from the first four classes of Unit 2.", "Just like in Unit 2, there will be a multiple choice Learn quiz on the readings from the first four classes, an in-class test that guides you into writing a first rough draft of your essay, and an essay assignment.", "Unit 1: Some Examples of Ethical Reasoning and Argumentation", "In-Class Test that will have questions that guide you into writing a first rough draft of Essay 1", "I will bring a small number of printed copies for borrowing.", "In A Companion to Bioethics, 2nd edition, edited by Helga Kuhse and Peter Singer, 85-90.", "In The Feminist Health Care Ethics Research Network, Susan Sherwin Coordinator, The Politics of Women’s Health: Exploring Agency and Autonomy, 19-47.", "“Conscientious Objection in Medicine: Accommodation versus Professionalism and the Public Good.”", "“The Best Interests Standard as a Logic of Empire: Unpacking the Political Dimensions of Parental Refusal.”", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Federation of Post-Secondary Educators of BC. https://fpse.ca/decolonization_manual_whose_land_is_it_anyway", "Monday March 25", "It is a multiple choice quiz that should not take too long to complete.", "Instructions for the In-Class Tests", "An In-Class Test will have questions that guide you into writing a first rough draft of your essay", "You should study one reading from the first six classes of the relevant Unit", "I will bring a small number of printed copies for borrowing.", "A test that is assessed as Pass receives a grade of 50.", "A test that is assessed as Fail receives a grade of 0.", "Instructions for the Essays", "Introduction (about 75-125 words)", "You are not allowed to use GenAI during the In-Class Tests that guide you into writing a first rough draft of your essay, but you are allowed to use GenAI during the process of getting from your first draft to your final version of your Essay.", "Every philosopher I have met says this.", "Talking - Yes", "Getting Suggestions - No", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:"]}, {"course_id": 8, "course_code": "SOC 324", "course_name": "SOC324 - Digital Cultures (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Digital Cultures: Technology & Society Fall 2022", "I am an Associate Professor in the Department of Sociology & Legal Studies and at the Stratford School of Interaction Design and Business.", "Questions of a personal nature", "This course examines how digital play represents and structures social interaction and how games develop social norms, influence social consensus, and respond to deviance.", "Apply sociological theories and concepts to understand, examine, and critically evaluate how technology shapes, and is shaped by, social phenomena.", "Identify some of the complex ethical choices and moral codes embedded in digital tools, such as game consoles and smart phones.", "Identify how digital technologies shape our interpersonal relationships and communities, in both positive and negative ways.", "Identify and develop personal research interests relating to digital culture and technology.", "Synthesize complex written arguments, summarize core ideas effectively, and pull out key concepts.", "Develop creative ways to communicate and teach core concepts to others.", "Introduction to the Course No assigned readings.", "The Technological Society", "Theories to make sense of our digital lives.", "In The Design of Everyday Things: Revised and Expanded Edition, Revised, Expanded ed. edition, 1–36.", "Techno-social Designing.", "Tragic Design: The Impact of Bad Product Design and How to Fix It (1st edition).", "-oreilly- com.proxy.lib.uwaterloo.ca/library /view/tragic-design /9781491923603/ch05.html", "Addressing Human Bias in Technology Design", "Confronting the Absence of Women in Technology Innovation.", "Community in the Network Society", "Computer Love: Replicating Social Order Through Early Computer Dating Systems.", "Ethical Dimensions of Technology", "TBD", "Assigned readings and playlists may change through the term.", "Summative Activites take a similar structure to your Module Reflections.", "In a few short classes, we can’t cover everything.", "Your precis should directly provide the following:", "Make an argument for why your is topic sociologically relevant, and should it be covered in a third-year sociology course.", "Be creative!", "Schedule permitting, all projects will be shared and presented in class in celebratory teaching/viewing sessions", "Late Policies and Extension Requests", "Extensions longer than 1 week require:", "Notice of Recording", "However, if Health & Safety protocols demand a shift away from in-person teaching and towards online teaching, some activities for this course may involve recording, in partial fulfillment of the course learning outcomes.", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Do you want professors and interviewers to call you by a different first name?", "Intellectual property includes items such as:"]}, {"course_id": 10, "course_code": "STV 202", "course_name": "STV202 - Design and Society (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Design and Society Winter 2025", "Email: cshelley@uwaterloo.ca", "Email: js2kim@uwaterloo.ca", "View requirements for STV 202", "Topics include the nature of design, the social and cultural implications of design, the roles of designers in relation to the social contract, and design assessment in light of social values such as risk, fairness, progress, and sustainability.", "The course material provides a mixture of theoretical concepts and practical cases of their application.", "Describe concepts and perspectives relating to social and ethical aspects of good design.", "Analyze and evaluate designs in light of those concepts and perspectives.", "Compare concepts and perspectives and consider overlaps and differences among them.", "Reflect on the significance of social and ethical issues in their understanding of good design.", "The numbers in parentheses next to learning outcomes above refer to applicable Canadian Engineering Accreditation Board Engineering Graduate Attributes defined here: https://uwaterloo.ca/engineering/graduate-attributes", "Rational design & Social psychology.", "Social contracts & Agendas.", "Design and society: Social issues in technological design, Berlin: Springer.", "A 10-question, multiple-choice quiz is to be completed by each student on the course Learn site for each non-midterm module starting at the outset of week 2.", "Quiz questions each week relate to the textbook chapter(s) assigned for that week.", "Design discussions", "Discussions will take place each non-workshop week after week 1.", "Design presentations", "5 minutes) and may be chosen for viewing in subsequent classes.", "Midterms", "Midterm 1 covers chapters Good design through Culture, Midterm 2 covers chapters Social contract through Activism, and Midterm 3 covers chapters Risk through Sustainability.", "Grade exemptions", "To allow for situations not covered under the Late submissions policy (see below), each student’s lowest quiz, discussion,  presentation, and workshop grade will be dropped from the calculation of their overall grade in each of those categories.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 16, "course_code": "STV 305", "course_name": "STV305 - Technology, Society and the Modern City (0.50)", "term_name": "List A", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Email: cshelley@uwaterloo.ca.", "Cities may be humanity's most significant invention, where we shape our vision of the civilized life.", "At the same time, the demands of cities shape our lives in fundamental ways.", "The purpose of this course is to examine the technology of civilized life, with the city itself as both a technological system and a scene of technological living.", "View requirements for STV 305", "Describe concepts and perspectives relating to cities as socio-technical systems.", "Analyze and evaluate developments in cities in light of those concepts and perspectives.", "Reflect and communicate analyses of social and ethical aspects of technology and cities.", "Week 11 November 21 Smart cities", "Discussions", "Each student is expected to participate in in-class discussion each week.", "Summaries", "Summaries may be shared with the class to kick-start in-class discussion.", "Self-assessments", "Grade exemptions", "Each student’s lowest discussion mark and exercise mark will be dropped from the calculation of their overall mark in those categories.", "Students are welcome to request regrading of assignments.", "Test conflicts"]}, {"course_id": 19, "course_code": "BME 364", "course_name": "BME364 - Engineering Biomedical Economics (0.50)", "term_name": "List B", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Engineering Biomedical Economics Fall 2024", "09:30AM - 10:20AM E5 6006", "10:30AM - 12:20PM", "08:30AM - 09:20AM", "This course examines key economic issues in health care and biomedical industries.", "Topics include the market for medical care, health insurance, various models of healthcare delivery and competition and the role of government in policy, financing and delivery of health care.", "This course will train students to use economic analysis to model and understand the complex interactions between health care delivery, insurance markets, health innovators, governments, and firms.", "Articulate differences between healthcare systems and how incentives affect the system economics.", "Articulate differences between healthcare systems and how incentives affect the system economics.", "Investigate a research topic in the area of health economics.", "Apply cost-benefit analysis to aid in healthcare decision making.", "A knowledge base for engineering:   Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the biomedical engineering program.", "2. Problem analysis:  An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "Investigation:  An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "4. Design:  An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, and economic, environmental, cultural and societal considerations.", "7. Communication skills:  An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Professionalism:   An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Such ability includes an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society, the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Life-long learning:  An ability to identify and to address their own educational needs in a changing world in ways sufficient to maintain their competence and to allow them to contribute to the advancement of knowledge.", "The Labor Market for Physicians", "7. Demand for Insurance", "Adverse Selection in Real Markets", "Pharmaceuticals and the Economics of Innovation", "The Economics of Health Externalities", "*", "The Contribution and Effects of the Country’s Healthсare Sector on its GDP", "Healthcare as a Basic Human Right: The Pros and Cons of Providing Free Healthcare", "A Look at the Feasibility of a Universal Health Care System", "Methods to Reduce the Risk of Adverse Selection", "The Differences between Moral Hazard and Adverse Selection and their Effects on Health Economics", "The Need to Educate Patients on the Costs Added to their Medical Bills", "The Role of Medical Resources in Increasing Life Expectancy Numbers", "Reasons Patients Should Select Larger Medical Facilities to Avoid Costly Treatments", "The Adverse Effects of an Unplanned Influx in Health Care on the Overall Economic Balance", "The Role of a Stronger Health Care System and Nutrition Programs on the Throughput of the Employed Masses", "Notice of Recording"]}, {"course_id": 25, "course_code": "SYDE 262", "course_name": "SYDE262 - Engineering Economics of Design (0.50)", "term_name": "List B", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Engineering Economics of Design Fall 2024", "jessie.ma@uwaterloo.ca", "11:30AM - 12:20PM E7 4433", "jessie.ma@uwaterloo.ca", "Jessie Ma | jessie.ma@uwaterloo.ca | E7-6304", "Topics include microeconomics, supply, demand and external costs in the context of systems design.", "Evaluate and compare alternatives for an engineering firm's financial decisions (GA 11a, 11b)", "Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)", "Create a business plan for an engineering firm, accounting for uncertainty in economic and environmental aspects (GA 9a, 9b)", "Identify external costs in the context of systems design, including the use of sustainability indicators (GA 9a, 9b)", "1 Sep 2 Introduction Introduction", "3 Sep 16   Decision Making - Cash Flow Series Patters Assignment 1 posted Evaluate and compare alternatives for an engineering firm's financial decisions (GA 11a, 11b) Excel", "4 Sep 23   Decision Making 2 - Basic Evaluation Methods   Evaluate and compare alternatives for an engineering firm's financial decisions (GA 11a, 11b) Excel", "5 Sep 30   Decision Making 3 - Analysis Period & Project Lives; Risk Analysis Assignment 1 due Oct 4 Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)  Excel", "6 Oct 7 2. Context - Looking Outside Entrepreneurship   Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)", "9 Oct 28   Intrapreneurship; Evaluation of Complex Projects (Replacement Analysis, Life Cycle Costs, Benefit-Cost Analysis) Group Project posted Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)", "Identify external costs in the context of systems design, including the us of sustainability indicators (GA 9a, 9b)", "Identify external costs in the context of systems design, including the us of sustainability indicators (GA 9a, 9b)", "12 Nov 18   Business Plans; Markets   Create a business plan for an engineering firm, accounting for uncertainty in economic and environmental aspects (GA 9a, 9b) Excel", "Notice of Recording", "Sign your email with your first and last name and your student number.", "There could be a need to make alternate arrangements for in-person course activities.", "This alternate arrangement could be for a short period of time (e.g., one week) or a more sustained disruption to in-person course activities.", "Impacted in-person deliverables will be handled on a case-by-case basis with notification provided as soon as possible (see COVID-19-Related Absences and Short-Term Absences below).", "They will review your case and coordinate a reasonable and fair plan in consultation with appropriate others.", "Laptops, Tablets, and Electronic Devices", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.", "A.A.S. also offers learning strategy supports to all students that can be accessed through:", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 40, "course_code": "AVIA 100", "course_name": "AVIA100 - Introduction to Aviation (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Aviation Fall 2024", "S. Kearns", "03:30PM - 04:20PM", "S. Kearns", "10:30AM - 11:20AM EV1 350", "S. Kearns", "04:30PM - 05:20PM", "S. Kearns", "10:30AM - 11:20AM EV3 4408", "S. Kearns", "Instructor: Dr. Suzanne Kearns", "Email: suzanne.kearns@uwaterloo.ca", "The nature and impact of each of these topics is explored through a combination of lecture, class discussion and activities, and student presentations.", "View requirements for AVIA 100", "• Demonstrate their understanding of key elements critical to the aviation industry in Canada and Internationally.", "• Describe a range of professional and safety issues, give examples of domestic and international regulatory and labour issues, and examine environmental concerns associated with aviation.", "October 21 Navigation", "However, the library's license limits the number of simultaneous users.", "There is no exception to this and make-up grades are not available as completing quizzes during their assigned window is an element of professionalism within the course.", "You are expected to prepare a single slide for your element of the presentation, and combine them into a single presentation file for your entire group.", "Quizzes are in multiple-choice format.", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 114, "course_code": "ENBUS 102", "course_name": "ENBUS102 - Introduction to Environment and Business (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Environment and Business Fall 2024", "Come by and introduce yourself :)", "Introduction of ways in which business has and is responding to environmental and business issues; business and sustainable development; issues of corporate/business greening.", "The central objective of this course is to explore the genesis of sustainability through a survey of the history and development of the ever-changing interface between business, society, and the environment.", "2. Understand why firms have sought to look beyond shareholders in how they understand and build value", "3. Discuss the practices firms engage in and how those practices have changed over time", "Sep 24 Linear to Systems Thinking", "Westley, F. What is a system?", "Systems thinking - The new approach for sustainable and profitable businesses.", "Weak versus Strong Sustainability", "Environmental Economics versus Ecological Economics", "UN Sustainable Development", "Oct 1 Evolution of Business Sustainability", "Oct 3 From Shareholders to Stakeholders to Social License", "Network for Business Sustainability", "Oct 8 Regulations and Command and Control", "Li, S. The business case for ESG: Why Companies Adopt Environmental Value Beyond Social Responsibility.", "Thriving at Waterloo Avoiding Plagiarism: Citations and Referencing", "Graber-Stiehl, I. How bogus 'eco-friendly' products trick you.", "Thriving at Waterloo Avoiding Unauthorized Collaboration", "Sustainable Finance", "Weber, O., & Feltmate, B.  Introduction to Sustainable Finance (pp 3-24), In Sustainable Banking and Finance: Managing the Social and Environmental Impact of Financial Institutions.", "Li, S. The business case for ESG: Why Companies Adopt Environmental Value Beyond Social Responsibility.", "The exam will include a combination of multiple-choice and short-answer questions.", "You must specify the sections you want addressed and a rationale for why it deserves consideration, with specific reference to the rubric and assessment criteria.", "Only in exceptional cases will this penalty be waived!", "Intellectual property includes items such as:", "Anti-racism Statement", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 121, "course_code": "ENBUS 315", "course_name": "ENBUS315 - Fashion, Consumption, and Sustainability (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Develop recommendations related to your own sustainable consumption patterns, with a specific emphasis on fashion", "Explore Explore a specific issue related to sustainable fashion/consumption", "6 June 12 Textiles and their impacts", "10 July 10 Alternative models to curb consumption", "Zero Waste Fashion Design by Timo Rissanen and Holly McQuillan, Bloomsbury Visual Arts, 2018.", "Fashion Takes Action - Creating a Conscious Fashion Future", "Home - Fashion Revolution : Fashion Revolution", "Kate Fletcher", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 126, "course_code": "ERS 100", "course_name": "ERS100 - Foundations: Environment, Resources and Sustainability (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["ERS 100", "08:30AM - 10:20AM EV2 2002", "Introduces analytical approaches for problem definition and problem solving that are appropriate for a wide range of environment and resource issues.", "Also examines alternative approaches that recognize the broader context and underlying roots in ethical positions and ecological, economic, and institutional systems.", "View requirements for ERS 100", "This course provides foundations for studying in the School of Environment, Resources and Sustainability.", "The course emphasizes the need to understand how we can use social, natural and physical sciences to understand and solve environmental and resource problems in sustainable ways.", "We will learn how to recognize the broader context around environment and resource issues and examine the roots of our problems within and ecological, political, social, and economic systems.", "This course is structured in a semi-flipped way.", "The lecture portion of the course will explore key concepts and ideas further, while the activity will help you engage with the material in a student-centered approach to learning.", "Define foundational concepts for studying in SERS, including systems and sustainability", "Identify links between the social and ecological aspects of environmental problems, locally and globally", "Evaluate sources of information, including mainstream media sources and peer reviewed journals, to develop information literacy and critical thinking skills", "Identify the strengths of different kinds of data collection and analytical approaches for environmental problem solving", "Examine and evaluate research about complex environmental problems", "Course Introduction", "- A deeper look at the SERS diplomas and pathways", "Sustainability:  Diverging and Competing Understanding", "Systems Assignment – Group Formation and Discussion on Assignment Expectations", "Wicked and Complex Problems: Systems and Resilience Thinking", "Systems Assignment – Research Session", "Sept 27th @11:55 p.m. EST", "Knowledge Systems and World Views (Indigenous and Western)", "Systems Assignment – Two-Slide Presentations", "Systems Assignment – Group Discussion of Systems Maps", "In Tutorial: Systems Assignment 2 - Systems Map Group Presentation/Discussion (5%)", "Research Questions, Data Collection, Evaluation and Communication of Data", "Systems Assignment – Presentations", "Social Systems and the Environment: Constraints, Transformations and Resilience", "Systems Assignment – Presentations", "Ecological Systems: Conservation and Resilience", "Systems Assignment 2: Systems Map Group Discussion (In Tutorial: Week 6) 5%", "Systems Assignment 3: Final Group Presentations (In Tutorial: Weeks 7 & 8) 10%", "(similar to A and A+ in the previous system)", "(Similar to B+ and A- in the previous system)", "(Similar to B- and B in the previous system)", "(Similar to D-, D and D+ in the previous system)", "(Similar to F and F+ in the previous system)", "**", "Mental health, creating a community of inclusion, being a global citizen and participating as a citizen scientist, is an important part of your SERS journey.", "Systems Assignment", "In this course, we delve into analytical approaches for defining and solving environmental and resource issues, emphasizing the importance of understanding these problems within their broader contexts.", "This assignment is designed to enhance your grasp of systems thinking—a crucial skill for addressing complex environmental challenges.", "By engaging with a case study, you will explore the intricate web of factors that contribute to environmental issues, identify key nodes within these systems, and develop a systems map to visualize these connections.", "Defining foundational concepts: You will apply systems thinking and sustainability principles to real-world environmental problems.", "Identifying links between social and ecological aspects: Your case study will highlight the interconnectedness of social and ecological factors, both locally and globally.", "Examining and evaluating research: You will critically analyze complex environmental problems through your case study, enhancing your research skills.", "Evaluating sources of information: By sourcing information from mainstream media and peer-reviewed journals, you will develop information literacy and critical thinking skills.", "Four smaller, scaffolded assignments make up this larger Systems Assignment.", "According to the authors of Skoden \"The purpose of this text is to offer support to individuals and institutions working towards understanding the colonial history of Canada and its ongoing impact on people who are First Nations, Métis, and Inuit.", "Skoden is designed to offer opportunities for reflection on what this truth means for each of us personally and professionally\" (pp.", "However, many of these ideas will be seen and discussed as you move on in your academic careers.", "A reflection written by each group member based on their role and experience in the discussion will be submitted individually for marking by Nov. 22nd @ 11:55 p.m. on LEARN.", "It will empower you to be more in control of your thoughts and feelings so that you can make better decisions, be happier, and navigate challenging conversations more effectively.", "Please complete the following lessons:", "To begin using Perspectives, please follow these steps:", "Create a username and password - Please use your last name and the last four digits of your student number.", "We will work to address these concerns.", "Excuses are not accepted in the case of crashed computer and lost or misplaced work.", "Create sub-headings for each of the main sub-sections (you can remove these or keep these later…they are intended as a guide to writing to ensure you address each sub-section!).", "*", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}]