[{"course_id": 88, "course_code": "PHYS 115", "course_name": "PHYS115 - Mechanics (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:50AM RCH 110", "08:30AM - 09:20AM", "09:30AM - 10:20AM RCH 105", "Name Role Email", "How to Email the Teaching Team", "See the document \"Guidance for Writing Emails to the Teaching Team\" on LEARN for email formatting tips and examples.", "Discuss strategies for solving problems.", "Please see “First-Year Engineering Tutors” and “Physics Tutorial Centre” below.", "Conservation of linear momentum, collisions, rotational kinematics and dynamics, conservation of angular momentum.", "Define and describe core concepts of classical mechanics (e.g., free fall, force, energy) and provide real-world examples to demonstrate their applications [KB, LL].", "Break down complex physical scenarios into their underlying principles, identifying relationships between forces, motion, and energy; for instance, by drawing free body diagrams [KB, PA].", "Section", "Units", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "TUT 103 & 104", "L1 and L2, Math Review 1-1 – 1.3, 2.1 – 2.3, 2.6 IQ0, TQ0 & TPS0 0, 1 / 0, 1 PE1 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "L3 and L4 2.4 – 2.5, 4.1 – 4.4 IQ1, TQ1 & TPS1 1, 2 / 1, 2 IQ0 & TQ0 (TUT 101 & 102) marks released @ 7 PM, PE2 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L3 and L4 2.4 – 2.5, 4.1 – 4.4 IQ1, TQ1 & TPS1 1, 2 / 1, 2 IQ0 & TQ0 (TUT 103 & 104) marks released @ 7 PM, PA2 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "L5 and L6 4.6 – 4.7, 5.1 IQ2, TQ2 & TPS2 2, 3 / 2, 3 IQ1 & TQ1 (TUT 101 & 102) marks released @ 7 PM, PA3 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L5 and L6 4.6 – 4.7, 5.1 IQ2, TQ2 & TPS2 2, 3 / 2, 3 IQ1 & TQ1 (TUT 103 & 104) marks released @ 7 PM, PA3 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "Applications of Newton's Laws 5.2 – 5.3 VQ7 4 / 4 -", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "TUT 103 & 104", "LEC 001 & 002", "Kinetic energy, Work and Kinetic energy 7.1 – 7.2 VQ10 5 / 5 -", "LEC 001 & 002", "LEC 001 & 002", "Potential Energy, Conservation of Mechanical Energy, Reading a Potential Energy Curve 8.1 – 8.3 VQ12 5 / 5 AS4 closed @ 7 PM, AS5 & PS5 released @ 7 PM", "T5", "TUT 101 & 102", "L10 to L12 7.1 – 7.6, 8.1 – 8.3 IQ4 TQ4 & TPS4 4, 5 / 4, 5 IQ3 & TQ3 (TUT 101 & 102) marks released @ 7 PM, PA5 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L10 to L12 7.1 – 7.6, 8.1 – 8.3 IQ4, TQ5 & TPS4 4, 5 / 4, 5 IQ3 & TQ3 (TUT 103 & 104) marks released @ 7 PM, PA5 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "Work done on a System by an External Force, Conservation of Energy 8.4 – 8.5 VQ13 6 / 6 -", "LEC 001 & 002", "T6", "TUT 101 & 102", "L13 and L14 8.4 – 8.5 IQ5, TQ5 & TPS5 5, 6 / 5, 6 IQ4 & TQ4 (TUT 101 & 102) marks released @ 7 PM, PA6 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L13 and L14 8.4 – 8.5 IQ5, TQ5 & TPS5 5, 6 / 5, 6 IQ4 & TQ4 (TUT 103 & 104) marks released @ 7 PM, PA6 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "Conservation of Linear Momentum, Elastic Collisions in One Dimension 9.5 – 9.6 VQ16 7 / 7 AS7 & PS7 released @ 7 PM", "TUT 101 & 102", "L15 and L16 9.1 – 9.6 IQ6 & TPS6 (L13 & L14) 6, 7 / 6, 7 IQ5 & TQ5 (TUT 101 & 102) marks released @ 7 PM, PA7 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L15 and L16 9.1 – 9.6 IQ6 & TPS6 (L13 & L14) 6, 7 / 6, 7 IQ5 & TQ6 (TUT 103 & 104) marks released @ 7 PM, PA7 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "Momentum and Kinetic Energy in Collisions,  9.7 – 9.8 VQ17 8 / 8 -", "LEC 001 & 002", "TUT 101 & 102", "L17 and L18 9.7 – 9.9 IQ7, TQ7 & TPS7 7, 8 / 7, 8 IQ6 & TQ6 (TUT 101 & 102) marks released @ 7 PM, PA8 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "LEC 001 & 002", "LEC 001 & 002", "T9", "TUT 101 & 102", "L19 and L20 10.1 – 10.7, 11.4 IQ8, TQ8 & TPS8 8, 9 / 8, 9 IQ7 & TQ7 (TUT 101 & 102) marks released @ 7 PM, PA9 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "L19 and L20 10.1 – 10.7, 11.4 IQ8, TQ8 & TPS8 8, 9 / 8, 9 IQ7 & TQ7 (TUT 103 & 104) marks released @ 7 PM, PA9 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "Work and Rotational Kinetic Energy 10.8 VQ22 10 / 10", "LEC 001 & 002", "TUT 101 & 102", "L21 to L23 11.5 – 11.9, 10.8 IQ9, TQ9 & TPS9 9, 10 / 9, 10 IQ8 & TQ8 (TUT 101 & 102) marks released @ 7 PM, PA10 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L21 to L23 11.5 – 11.9, 10.8 IQ9, TQ9 & TPS9 9, 10 / 9, 10 IQ8 & TQ8 (TUT 103 & 104) marks released @ 7 PM, PA10 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "L24 and L25 11.1 – 11.3, 12.1 – 12.2 IQ10, TQ10 & TPS10 10, 11 / 10, 11 IQ9 & TQ9 (TUT 101 & 102) marks released @ 7 PM, PA11 opened @ 4PM & closed @ 5PM", "14 - 2025/04/07 (Mon) - - - - IQ9 & TQ9 (TUT 103 & 104) marks released @ 7 PM, PA11 opened @ 4PM & closed @ 5PM", "Important Dates and Events in Winter 2025", "First Day of Classes Monday, January 6", "Resume Reviews Ongoing – E2 1772", "Yes -", "Yes -", "Yes -", "Marking Scheme A", "Weekly Group Progress Reports in Tutorial Sessions 3.5%", "Weekly Peer Evaluation in Tutorial Sessions 1.5%", "Weekly Team Progress Reports in Tutorial Sessions 3.5%", "Weekly Peer Evaluation in Tutorial Sessions 1.5", "As outlined below, your final mark incorporates both in-class and out-of-class activities, individual and teamwork, as well as test-based and non-test-based assessments.", "Only the first ten correct responses receive bonus marks.", "This rubric is adapted from a similar rubric in the PHYS 111 course, Fall 2022).", "Extraction of Physical Properties - Well-labeled (free-body) Diagram No physical properties extracted.", "All information represented on a well-labeled (free-body) diagram including coordinate systems, vectors.", "Manipulating Equations and Use of Numbers - Algebra and Calculations Incorrect or missing steps in algebra and numbers introduced prematurely.", "Equations manipulated satisfactorily but coordinates or numbers used incorrectly.", "Weekly Progress Reports in Tutorial Sessions", "Extraction of Physical Properties - Well-labeled (free-body) Diagram No physical properties extracted.", "Manipulating Equations and Use of Numbers - Algebra and Calculations Incorrect or missing steps in algebra and numbers introduced prematurely.", "Equations manipulated satisfactorily but coordinates or numbers used incorrectly.", "Weekly Peer Evaluation in Tutorial Sessions", "Aspect of team functioning Well below average Below average Average Above average Well above average", "Problem Solving Skills", "Level of Collaboration Allowed: Allowed – Team collaboration is required during tutorial sessions and strongly encouraged outside of them.", "Students complete at least the first two questions in teams during tutorials and submit team progress reports.", "Solutions for the remaining questions can be collaboratively discussed outside tutorials.", "I frequently monitor this channel and try to address your questions as much as I can.", "One short-term self-declaration", "Cannot be used for in-person LAB or STU", "One self-declaration of COVID-like symptoms", "Reason and dates of absence required for submission", "Discord", "The First Year Office", "The office supports you in establishing a strong academic foundation during your first year, which will help you throughout your undergraduate studies and prepare you for a successful career.", "First-Year Engineering Tutors", "Peer success coaching", "My learning skills evaluation is a self-reflection tool designed to help you assess your current learning strategies and identify areas for growth and improvement.", "Quick Tips and Resources", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Library for research-based assignments"]}, {"course_id": 90, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 95, "course_code": "PHYS 234", "course_name": "PHYS234 - Quantum Physics 1 (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["11:30AM - 12:20PM DC 1351", "K. Islam", "Introduction to formalism of quantum physics.", "Introduction to operators.", "Background: understanding why we need a quantum theory", "Learning the building blocks of a quantum theory: state vectors and operator", "Jan 06, 08, 10 Introduction to Quantum Physics, Stern-Gerlach experiments 1", "Jan 20, 22, 24 Matrix notation, general quantum systems, operators 2", "Mar 10, 12, 14 Continuous quantum systems – formalism, infinite potential well,", "Mar 17, 19, 21 Continuous quantum systems – infinite potential well (continued), finite potential well 5", "Mar 24, 26, 28 Continuous quantum systems – quantum harmonic oscillator 9", "Mar 31, Apr 02, 04 Continuous quantum systems (continued), Review", "Students should start checking for posted exam dates:", "Everyone needs a support system.", "Every student in PHYS 234 is expected to treat their peers and their instructor with kindness, fairness, tolerance, and respect.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 96, "course_code": "PHYS 263", "course_name": "PHYS263 - Classical Mechanics and Special Relativity (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "Classical Mechanics and Special Relativity Winter 2025", "08:30AM - 09:20AM", "Newtonian dynamics of particles and systems of particles.", "You will be expected to become fluent in solving the problems covered in this course using a variety of approaches (e.g. forces, torques, and energy conservation).", "Classical Dynamics of Particles and Systems (5th edition)", "Notice of Recording"]}, {"course_id": 97, "course_code": "PHYS 275", "course_name": "PHYS275 - Planets (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["08:30AM - 09:50AM B1 271", "Surname A-I: Darshak Patel DA26PATE@uwaterloo.ca", "Surname M-Z: Sofia Chiarenza SCHIAREN@uwaterloo.ca", "recognize and describe the most important features on the surfaces of terrestrial planets and moons, and related them to the age of the surface", "describe the major components of our solar system (planets, moons, dwarf planets, asteroids, comets) and distinguishing features of each", "solve simple problems related to ice sublimation in comets, and use this to describe their observable properties", "describe how astronomers measure sizes and shapes of distant asteroids", "perform simple calculations to relate observable quantities to physical exoplanet properties", "describe several ways in which some exoplanet systems differ from our own, and be able to knowledgeably discuss the implications of this", "explain why giant planets are found farther from the Sun than terrestrial planets and why most solar system objects orbit the Sun in the same plane and the same direction", "use what little we know about objects in our solar system, and exoplanetary systems, together with the presence of life on Earth, to engage in intelligent discussion about the likelihood of life elsewhere in the Universe", "describe some of the ways in which evidence for extraterrestrial life might be found in the next 20 years", "Learn time management, study skills, and how to balance multiple deadlines and obligations", "3 Thurs Sept 12 2.1.6, 3.3.1 Energy and angular momentum", "10 Tues Oct 8 6-3 Energy transport and surface morphology", "12 Tues Oct 29 6.4 Impact cratering", "14 Tues Nov 5 9 Terrestrial planets in the Solar System", "15 Thurs Nov 7 8 Gas giants in the Solar System", "Planet formation", "Alternative Grading Scheme - used only in the case that the midterm is missed with a valid excuse (e.g. VIF)", "The essay has four components", "Important:  You must submit these evaluations by the deadline in order for your own Peer evaluation score to count!"]}, {"course_id": 99, "course_code": "PHYS 334", "course_name": "PHYS334 - Quantum Physics 2 (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "04:30PM - 05:20PM", "Formalism of quantum mechanics.", "Identical particles.", "Applications in atomic and molecular physics.", "Physically predict, and mathematically model, the outcome(s) after measuring a quantum system", "Understand and model the difference between a single measurement outcome and an ensemble average", "Predict the time dependence of a quantum system, given its initial state and Hamiltonian", "Use commutator identities to check commutation relations for operators", "Write the position and momentum operators in terms of the harmonic oscillator ladder operators, and vice versa", "State the commutation relations that define a set of angular momentum operators", "State the spectrum (allowed eigenvalues) of the angular momentum operators 𝐽^2 and 𝐽_𝑧, in terms of quantum numbers 𝑗 and 𝑚", "State the restrictions on the 𝐽^2 and 𝐽_𝑧 eigenvalues, in terms of restrictions on their associated quantum numbers 𝑗 and 𝑚", "State the effect of all angular momentum operators on the joint eigenstates of 𝐽^2 and 𝐽_𝑧", "Compute the matrix representations of the angular momentum operators for a given 𝑗, in the joint eigenbasis of 𝐽^2 and 𝐽_𝑧", "Describe the eigenfunctions of orbital angular momentum (spherical harmonics) in the position basis", "For systems with “central” potentials (those that depend only on a radial coordinate), describe the decomposition of the energy eigenfunctions into their angular and radial components", "Describe the energies and eigenstates of the hydrogen atom", "Describe the degeneracy of different energy eigenstates of the hydrogen atom", "State two possible complete sets of mutually commuting operators (CSCOs) whose eigenstates can be used as bases to describe a set of two angular momenta", "State the eigenvalues of the CSCOs used to describe a set of two angular momenta", "State the selection rules for the Clebsch-Gordan coefficients that relate the coupled and uncoupled bases of a system with two angular momenta", "Calculate perturbative energy shifts and wavefunction changes for nondegenerate systems", "Calculate perturbative energy shifts for degenerate systems, selecting an appropriate basis for the calculation", "Use the variational method to estimate the ground-state energies of simple one-dimensional problems, given a suitable trial function", "State the definition of a boson and a fermion, in terms of the spin of the particles", "State the symmetry properties of bosonic and fermionic wavefunctions", "Exams", "There will be two in-class exams given during the lecture period in our usual classroom.", "Exam 2: Wed. Mar 19 (covers material up through and including nondegenerate perturbation theory)", "HW1 - formalism and postulates - due Jan 24", "HW2 - quantum harmonic oscillator and angular momentum - due Feb 7", "HW3 - spherical harmonics and hydrogen atom - due Feb 28", "HW4 - addition of angular momentum and nondegenerate perturbation theory - due Mar 12", "Week 1 - Intro to class and mathematical formalism of quantum mechanics", "Week 4 - Angular momentum", "Week 5 - Spherical harmonics and central potentials", "Week 8 - Nondegenerate perturbation theory", "Week 9 - Degenerate perturbation theory, fine structure, Zeeman effect", "Quantum Mechanics: A Paradigms Approach, David H. McIntyre", "Introduction to Quantum Mechanics, David Griffiths", "Zettili shines in its extensive collection of worked examples and practice problems.", "Some assignment problems may be graded on a multiple choice basis.", "Notice of Recording"]}, {"course_id": 108, "course_code": "SCI 238", "course_name": "SCI238 - Introductory Astronomy (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["SCI 238", "SCI 238 001", "Discussions:", "Lecture slides can be found here.", "SCI 238:", "View requirements for SCI 238", "All are welcome!", "5 Tuesday, Jan 21st Light and Matter Chapter 5     Spectral tubes and spectrometers", "Science of \"Interstellar\"", "Order Mastering Astronomy", "No exceptions to these requirements will generally be made in cases where students miss classes or do not complete assignments.", "Library for research-based assignments"]}, {"course_id": 110, "course_code": "AMATH 242", "course_name": "AMATH242 - Introduction to Computational Mathematics (0.50)", "term_name": "List 1", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Introduction to Computational Mathematics Winter 2025", "10:00AM - 11:20AM MC 1085", "A rigorous introduction to the field of computational mathematics.", "The focus is on the interplay between continuous models and their solution via discrete processes.", "Topics include pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms, and numerical integration.", "Explain the shortcomings of finite precision arithmetic", "Analyze problems in terms of conditioning, and algorithms in terms of stability", "Know some common and basic algorithms in computational mathematics, e.g. Numerical solution of linear systems, Numerical Integration, etc.", "Apply these algorithms to solve problems from various domains", "Errors and Error Propagation(Chapter 1)", "Floating point numbers and operations (1.2)", "Standard floating point systems (1.2.2)", "Condition of a Mathematical Problem (1.3)", "Four Algorithms for Root Finding (2.2)", "Numerical Linear Algebra(Chapter 3)", "Algorithm and computational cost (3.2.3)", "Week of February 3(V)", "Condition and stability(3.3)", "Iterative Methods for solving Ax = b (3.4)", "Jacobi and Gauss-Seidel Methods (3.4.1)", "Week of February 24(VII)", "Piecewise Linear Interpolation (5.2.1)", "Week of March 3(VIII)", "Integration (chapter 6)", "Integration of an Interpolating Polynomial (6.1)", "Accuracy, Truncation Error and Degree of Precision", "Gaussian Integration (6.3)", "Week of March 17(X)", "Introduction to Scientific Computing, Van Loan, Prentice Hall, 2000 No", "Introduction to Scientific Computing and Data Analysis by Mark Holmes Available on the library website No", "Students are expected to provide well commented code with the expectation that what a code is doing can be well understood (there will be a small number of marks for each coding programming question set aside for this).", "Most of the marks for the computational problems will be given for the description of the algorithm and the explanation of results and/or outputs.", "Submitting \"raw code\" will earn very few marks.", "Figures and graphs should be carefully created to present the data and conclusions in an effective and clear manner.", "Requests related to the missed materials are handled by the instructor on a case-by-case basis, except when they fall under the Faculty of Mathematics guidelines (see https://uwaterloo.ca/math/accommodations)."]}, {"course_id": 118, "course_code": "CS 449", "course_name": "CS449 - Human-Computer Interaction (0.50)", "term_name": "List 1", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Human-Computer Interaction Fall 2024", "11:30AM -", "10:00AM - 11:20AM B2 350", "11:30AM -", "10:00AM - 11:20AM B2 350", "10:00AM - 11:20AM DC 1350", "LEC - Monday 10-11:30am DC 1350", "An introduction to the fundamental theories, methods, and research in the design and evaluation of novel computational artifacts designed to meet real-world human needs.", "Through lectures and design activities, students work in teams of 5 to design a solution for a real-world problem.", "The end result of the team project is a high-fidelity interactive prototype of a mobile application, targeted at solving a particular real-world problem.", "Identify the primary luminaries in Interactive Design and HCI", "Identify your target users", "Design studies to understand your users and their needs within a sociocultural context", "Create user data-driven designs and prototypes of different levels of fidelity", "Design studies to evaluate designs during different stages of the project", "Properly gather and analyze qualitative and quantitative data from semi-structured interviews, paper prototype evaluation, heuristic evaluations and cognitive walkthrough", "Discover a variety of HCI research methodologies", "Add a high-quality design of an interesting product to your design portfolio", "The success of a team project depends critically on each student being a responsible member of the team, i.e., showing up and participating.", "Special consideration can be made for a few exceptions (e.g., academic travel, illnesses and family emergencies).", "Deliverables and Late Penalties", "Intellectual property includes items such as:"]}, {"course_id": 119, "course_code": "CS 450", "course_name": "CS450 - Computer Architecture (0.50)", "term_name": "List 1", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["10:00AM - 11:20AM MC 4021", "The course is intended to provide the student with an appreciation of modern computer design and its relation to system architecture, compiler technology, and operating system functionality.", "Understand the fundamental principles of computer architecture systems.", "Come up with novel designs that meet application demands, and evaluate the tradeoffs of different design choices based on the knowledge learned in this course.", "January 7, 2025 Introduction", "January 9, 2025 Fundamental Concepts", "January 14, 2025 ISA I", "January 21, 2025 Intro to Microarchitecture & Single Cycle", "January 23, 2025 Single-Cycle & Pipelining", "January 28, 2025 Control & Data Dependency", "January 30, 2025 Control Dependency & SIMD", "February 6, 2025 Branch Prediction I", "February 13, 2025 Introduction to microarchitecture simulation", "March 13, 2025 Memory Systems I", "March 18, 2025 Memory Systems II"]}, {"course_id": 120, "course_code": "CS 451", "course_name": "CS451 - Data-Intensive Distributed Computing (0.50)", "term_name": "List 1", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Data-Intensive Distributed Computing Winter 2025", "10:00AM - 11:20AM MC 2017", "RCH 307", "10:00AM - 11:20AM MC 2017", "RCH 307", "Introduces students to infrastructure for data-intensive computing, with a focus on abstractions, frameworks, and algorithms that allow developers to distribute computations across many machines.", "Topics include core concepts (partitioning, replication, locality, consistency), computational models (MapReduce, dataflows, stream processing, bulk-synchronous parallel), and applications.", "Explain the key concepts in distributed big data projects", "Write clean and efficient Hadoop MapReduce and Spark code", "Understand and design distributed algorithms for the analysis of textual, graph, and relational data", "Explain the design issues involved with distributed relational and non-relational database systems such as Apache HBase / Google BigTable", "Introduction to Distributed Text Processing 1", "Introduction to Hadoop MapReduce 3", "Introduction to Apache Spark 3", "Distributed Database Systems 3", "This course includes the independent development and practice of specific skills, such as designing MapReduce and Spark code.", "Library for research-based assignments"]}, {"course_id": 125, "course_code": "CS 459", "course_name": "CS459 - Privacy, Cryptography, Network and Data Security (0.50)", "term_name": "List 1", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Privacy, Cryptography, Network and Data Security Winter 2025", "04:00PM - 05:20PM", "Office hours are assignment-dependent and their time/location will be disclosed during the introduction of each assignment.", "Introduction to privacy and security using cryptography and related techniques in networks, distributed systems, and data science.", "For at-rest protection, specific topics include the basics of cryptography and relevant ethics/policy concepts.", "Evaluate the use of cryptography to protect data assets in storage, transit, and use", "Analyze security and privacy threats to data assets, including the privacy level of various data release mechanisms, privacy-utility trade-offs, and statistical inference attacks to infer sensitive information", "Evaluate the use of network security hardware and software to protect data assets in transit and use.", "Introduction", "Lecture 1 - Logistics and Introduction to the course (Jan. 6th)", "Data Protected in Transit", "Assignments can be submitted multiple times, and the last one will be used for marking.", "Include a clear justification for your claims.", "Your paper should be a summary of past and current work on your topic, as well as an overview of known open problems and potential future directions in the area.", "Your proposal and paper paper should be formatted in the two-column ACM proceedings format, using one of the ACM SIG Proceedings Templates.", "The ACM templates include headings for “Categories and Subject Descriptors”, “General Terms”, and “Keywords”, which you do not need to use.", "Otherwise, in general, create a public one so that your peers can benefit too.", "Email:", "We understand that these circumstances can be troubling, and you may need to speak with someone for emotional support."]}, {"course_id": 127, "course_code": "CS 466", "course_name": "CS466 - Algorithm Design and Analysis (0.50)", "term_name": "List 1", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Algorithm Design and Analysis Fall 2024", "Monday -", "Monday", "Sepehr Assadi - sassadi@uwaterloo.ca", "MohammadHossein Ebtehaj - mhebtehaj@uwaterloo.ca", "General information", "Mathematical maturity, and a strong background in probability, data structures, and algorithm design.", "I invite you to let me know about what I can stop, start, or continue doing to make sure every one of my students feels valued and can engage actively in our learning community.", "This is an advanced algorithm design and analysis course, aimed at undergraduate students interested in a deep dive in theoretical computer science (TCS), as well as graduate students doing research in TCS.", "Probabilistic analysis: Randomized algorithms, Concentration inequalities, Balls-and-bins", "Linear programming: Basics, Duality, Center-of-gravity algorithm, Rounding", "Multiplicative weight update (MWU): Expert problem, Fast packing/covering linear programs", "Random walks: Connectivity in RL, Perfect matchings in regular bipartite graphs, Sampling", "Dynamic graph algorithms: Connectivity, Approximate matching", "Parallel algorithms: Matching in RNC, Isolation lemma", "design and analyze algorithms for a wide range of canonical problems studied in this course, and even more importantly, for new problems that you may have not encountered directly yet,", "know a wide range of algorithmic and mathematical tools commonly used in design and analysis of algorithms, and", "have a basic familiarity with various algorithmic models of computation studied in TCS.", "Probabilistic Background and Concentration inequalities", "Streaming distinct elements, Limited independence hash functions", "Balls-and-bins experiments: Power of two choices via random graph theory", "MSTs: Basics, Fredman-Tarjan algorithm", "MSTs: Karger-Klein-Tarjan algorithm", "Linear programming (LP): Basics and Applications", "Linear Programming (LP): Duality and Integrality gaps", "Linear Programming (LP): More on Integrality gaps, Dual fitting for set cover", "Linear Programming (LP): Primal-dual for bipartite matching", "Online matching with a primal-dual analysis", "Graph sketches: Connectivity and L0-samplers", "Random walks: fundamental theorem of Markov chains, connectivity in RL", "Random walks: Perfect matching in regular bipartite graphs", "DP09 Devdatt P. Dubhashi and Alessandro Panconesi, Concentration of Measure for the Analysis of Randomised Algorithms.", "V20 Nisheeth K. Vishnoi, Algorithms for Convex Optimization.", "AHK12", "Please refer to the Course Webpage for a list of papers related to the topics discussed in the lectures.", "This is a list of some other closely related courses taught elsewhere:", "Randomised and Advanced Algorithms, Winter 2024 by Clément Canonne @ University of Sydney.", "Advanced Algorithms, Spring 2023 by Anupam Gupta @ CMU.", "Advanced Algorithms, Fall 2021 by Mohsen Ghaffari @ ETH.", "Advanced Algorithm Design, Fall 2022 by Matt Weinberg and Huacheng Yu @ Princeton.", "Advanced Topics in Algorithms, Fall 2021 by Kent Quanrud @ Purdue.", "Advanced Algorithms, Winter 2020 by Aleksandar Nikolov @ University of Toronto.", "CS466/666: Algorithm Design and Analysis, Spring 2024 by Rafael Oliveira", "CS466/666: Algorithm Design and Analysis, Fall 2024 by Sepehr Assadi", "CS466/666: Algorithm Design and Analysis, Fall 2022 by Therese Biedl", "CS466/666: Algorithm Design and Analysis, Spring 2022 by Lap Chi Lau", "Course Project (only for graduate students in CS 666) 15%", "15% Course Project (only for graduate students in CS 666)", "The solutions should be turned in as a single pdf file containing the answers to the assignment questions in order.", "For students: LaTeX tremendously helps you in writing clean and well-structured proofs (a necessity for a rigorous proof ) as well as editing an already written proof further.", "For submissions, only one member of the group submits the full solutions on Crowdmark and lists the name of their partners in the group.", "In this case, all members of the group lose one of their extensions.", "However, you can bring in a one-page cheat sheet with you to the exam.", "The final exam follows the same policies as the mid-term exam for blank solutions, one-page cheat sheet, and missed exams.", "Course Project (only for graduate students registered in CS 666)", "Policies and Statements", "Email is fast and tends to give the illusion of constant and immediate access.", "Also, please use email only to communicate specific concerns, questions, or comments regarding your experience in the course, or setting up appointments for in-person meetings outside office hours in case necessary.", "I am using bunch of different email filters to manage my (unmanageable) inbox and I may not get to see emails without this format at all...", "Please let us know ways to improv", "Please inform us of these at the start of the course.", "Your Health & Well-Being", "This is a challenging course with various advanced topics and not-so-easy assignments and exams.", "All of these are going to be time and energy consuming.", "I expect that any assignment or exam you submit in this course will be your own product and follows the collaboration and external resources policies specified earlier in this course outline.", "Intellectual property includes items such as:"]}, {"course_id": 128, "course_code": "CS 479", "course_name": "CS479 - Neural Networks (0.50)", "term_name": "List 1", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["04:00PM - 05:20PM", "04:00PM - 05:20PM", "Mohamed Hibat-Allah", "Xinyu Crystina Zhang", "Andy Zheng", "Junteng Zheng", "Simple neuron models and networks of neurons.", "Advanced topics, including adversarial inputs and biologically plausible learning methods.", "Formulate a neural learning method as gradient-based optimization", "Derive a neural learning method based on energy minimization", "Design neural-network solutions for different learning scenarios", "Identify some commonalities between artificial neural networks and the brain", "-", "Introduction, Neuron Models", "Hodgkin-Huxley", "Leaky Integrate-and-Fire", "-", "Synapses", "Formulation of Learning", "Loss functions", "-", "Error Backpropagation", "-", "Automatic Differentiation", "-", "Overfitting", "Optimization Considerations", "SGD", "Momentum", "-", "Vision", "-", "No classes", "-", "-", "Autoencoders", "Vector Embeddings", "-", "Advanced Autoencoders", "Diffusion Networks", "-", "-", "Population Coding", "Optimal linear decoding", "Transformations", "Dynamics", "-", "Biological backprop", "Instructions will be given for each programming assignment.", "A1 Jan 22 Neuron and synapse models", "A4 Mar 19 Recurrent networks", "The projects will be done in groups of 2 students, and will involve implementing a method from a paper, and reproducing some of its results.", "Continuity of In-Person Course Components", "The assignment procedures will not be affected by a cancellation of in-person classes since they are distributed and submitted online.", "Students will be given a 24-hour period during which the exam must be written.", "What you can do: GenAI can be used as a smart substitute for Google search, e.g., code debugging, finding plotting commands.", "What you can't do: GenAI must not be used to code up the logic of a solution, or part of a solution."]}, {"course_id": 138, "course_code": "ECE 327", "course_name": "ECE327 - Digital Hardware Systems (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Digital Hardware Systems Winter 2025", "ECE 327 / ECE 627", "10:00AM - 11:20AM E7 4053", "11:30AM -", "ECE 327 101", "ECE 327 201", "04:30PM - 05:20PM E7 4053", "04:30PM - 05:20PM", "04:30PM - 05:20PM E7 4053", "Maran Ma: E2-3354A Wednesday 1:30-2:30pm", "Design and modelling of digital hardware systems using a hardware description language.", "Power analysis and optimization.", "View requirements for ECE 327", "ECE 627:", "Introduction to power analysis and optimization.", "Introduction to faults and testing.", "View requirements for ECE 627", "The design and engineering of computing chips is an exciting, and valuable skill that spans multiple engineering disciplines including software engineering, parallel programming, verification and reasoning, compilation techniques, down to physical/analog/electrical effects.", "This course will help open the door to careers in the richly-rewarding chip design industry in a variety of roles such as RTL developers, verification engineers, system-level developers, and future leaders and managers.", "ECE327 will be vital to navigate these exciting times.", "We must think about and understand concurrent operations at a cycle-by-cycle level of abstraction.", "There are commonly used paradigms, and design patterns that we must known when organizing the RTL code.", "We will learn how to break down a complex design into these components, and learn how to reason about correctness, and understand their translation to hardware primitives.", "Most digital design are constrained to fit specific cost targets, and the analysis tools help guide the design process with appropriate feedback.", "These compilation iterations are fundamental to digital design and a good designer knows how to direct the tools, rewrite Verilog code, and generate the desired hardware.", "A class project will be used to tie together all the key design lessons we learn in this course.", "We will be developing a large-language model (LLM) solution involving a matrix multiplier as part of the project.", "Describe hardware components at the RTL-level in Verilog, verify these designs through simulation, and map these design to an FPGA fabric.", "Introduction - Introduction to hardware design, quick look at concurrency, debugging, synthesis and entire hardware design flow.", "Reasoning about parallelism in Verilog and drawing timing waveforms/diagrams from the code and vice versa.", "State Machines - Sequential logic design in the form of controllers (or state machines).", "Retiming - Automating pipelining of feed-forward datapaths.", "Strategies and ideas for retiming steps.", "Static Scheduling - Time-shared reuse of hardware resources.", "Construction of static scheduling tables based on resource constraints.", "Design of state machine controllers, and datapaths building blocks.", "Dynamic Scheduling - Dynamic scheduling of resource shared datapaths.", "Timing Analysis - Understanding clock frequency and algorithms for timing analysis.", "Elmore Delay - Simplified high-level model of wire delays.", "Power - Power/energy analysis of hardware components.", "Analytical expressions for power and energy.", "ECE627-only] FPGAs - FPGA Logic, Interconnect, and Architecture, Introduction to reconfigurable hardware/FPGAs, understanding logic design, interconnect and overall composition.", "For relevant labs, the course uses the AMD/Xilinx Pynq FPGA boards available in E2-2356A.", "FPGA board deployment will be done as part of some of the labs, and you will get a chance to rectify errors should this fail.", "Remember, the final exam covers the entire course!", "Precise determination will be done on a case-by-case basis.", "- For any missed graded item, we offer the option of taking a final if you miss it for a legitimate reason as per university guidelines.", "Plagiarism in ECE327 will likely manifest in the form of copying RTL code, scripts, bitstreams as-is or recast with minor modifications.", "We have a MOSS configuration to check code plagiarism and we take this seriously.", "We understand that these circumstances can be troubling, and you may need to speak with someone for emotional support."]}, {"course_id": 140, "course_code": "ECE 409", "course_name": "ECE409 - Cryptography and System Security (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Cryptography and System Security Winter 2025", "04:00PM - 05:20PM", "08:30AM - 09:50AM E7 5353", "Introduction to cryptology and computer security, theory of secure communications, points of attack, conventional cryptographic systems, public key cryptographic systems, standards, firewalls, wireless system security, applications.", "View requirements for ECE 409", "This course will provide introduction to  cryptography and system security.", "It covers  basic concepts in cryptography and system security,   types of attacks, trust and threat models,  pseudorandomness, computational security,  symmetric-key  cryptography,  public-key cryptography,   attacks on cryptographic operations,   network security protocols,   wireless system security and privacy,  applications in IoT systems,   special topics on  privacy preserving  AI,   quantum key  distribution and post-quantum cryptography.", "Explain the principles of cryptography and system security.", "Explain how practical schemes of symmetric-key cryptography and public-key cryptography are designed and implemented.", "Analyze the security and privacy protections in wireless systems and their applications in IoT.", "Apply security principles to solve problems in concrete applications.", "Introduction  to Cryptography  and System Security", "Cryptography and cryptanalysis", "Basic protections: encryption and authentication", "Classification of cryptosystems", "Basic  concepts of secure systems.", "Types of attacks,  trust and threat model", "Computational security and one-way functions", "Chapter 3. Symmetric-key Cryptographic Systems", "Arithmetics of binary finite fields", "Secure hash functions: SHA1, SHA2 and SHA3", "MAC and forgery attack", "Time-memory trade-off attacks and attacks by AI", "Public-key Cryptographic Systems", "Arithmetic operations", "Security of public-key cryptography (factorization, DL, LWE)", "Practical public-key systems (DH, RSA, DSA, ECC)", "Fault side-channel attacks", "Network Security Protocols", "Implementing secure systems:  PKI  and  X.509 certificates", "Hop-by-hop versus end-to-end protections and VPN", "Chapter 6. Wireless System Security", "5G security architecture for IoT security and privacy", "Privacy preserving machine learning: secret sharing; securing federate learning", "Basic concepts for quantum cryptography", "Quantum key distribution", "Post-quantum cryptography", "Communication System Security L.L. Chen and G. Gong", "R. Anderson, Security Engineering A Guide to Building Dependable Distributed Systems, Wiley, 2014 (Anderson14).", "Schneier on Security, http://www.schneier.com/blog/. A blog covering current computer security and privacy issues.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 146, "course_code": "ECE 457A", "course_name": "ECE457A - Co-operative and Adaptive Algorithms (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Co-operative and Adaptive Algorithms Fall 2024", "ECE 457A", "E7 3343", "• Huda Diab Abdulgalil: Email hdiababd@uwaterloo.ca", "The course starts by addressing the ill-structured problems and need for computational intelligence methods.", "It introduces the concepts of heuristics and their use in conjunction with search methods, solving problems using heuristics and metaheuristics, constraints satisfaction.", "The course also introduces the concepts of co-operation and adaptations and how they are influencing new methods for solving complex problems.", "The course starts by illustrating how the concepts of co-operation and adaptation are manifested in nature and how such models are inspiring new types of solutions methods.", "Topics to be covered include search algorithms, game playing, constraints satisfaction, meta-heuristics, evolutionary computing methods, swarm intelligence, ant-colony algorithms, particle swarm methods, adaptive and learning algorithms and the use of these algorithms in solving continuous and discrete problems that arise in engineering applications.", "View requirements for ECE 457A", "Motivate the need for algorithms that exhibit a degree of intelligence: logical, computational, and biologically inspired.", "Introduce the concepts of cooperation and adaptations and how they are influencing new methods for solving complex problems.", "Illustrate the use of these algorithms in solving continuous and discrete, and machine learning problems", "Introduction: About this course, AI, Adaptation, Cooperation, goals and definitions of artificial intelligence;", "ill-structured problems and need for approximate algorithms, cooperation and adaptation in nature.", "Search: state space problem formulation and representation;", "use of heuristic search methods and meta-heuristic algorithms", "Trajectory Methods: Tabu search", "Engineering use cases", "Engineering use cases", "Mathematical Models of Genetic Algorithms", "Introduction to Swarm Intelligence: cooperation and adaptation methods inspired by nature.", "Engineering use cases", "Engineering use cases", "Evolutionary Programming: Continuous and Discrete EP", "Finite State Machine Optimization", "Evolutionary Strategies", "Self-Adaptive Evolution Strategies", "Introduction to evolutionary computing Introduction to evolutionary computing, by Eiben and A, Smith, J.E, Springer, Berlin, 2003.", "Search and Optimization by Metaheuristics Techniques and Algorithms Inspired by Nature Search and Optimization by Metaheuristics Techniques and Algorithms Inspired by Nature Ke-Lin Du, M. N. S. Swamy No", "Search Algorithms Types: Breadth and Depth First Search Algorithm Search Algorithms Types: Breadth and Depth First Search Algorithm Merium Hazem Anwar Labib Bishara, Merihan Hazem Anwar Labib Bishara No", "**The lecture notes are copy-right protected material.", "Such behaviour includes:", "Adhering to the principles of academic integrity when conducting and reporting research.”"]}, {"course_id": 147, "course_code": "ECE 457B", "course_name": "ECE457B - Fundamentals of Computational Intelligence (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Fundamentals of Computational Intelligence Winter 2025", "ECE 457B", "Monday, Friday -", "10:00AM - 11:20AM E7 5353", "04:00PM - 05:20PM", "Da Saem Lee : ds3lee@uwaterloo.ca", "Communication and Discussion", "If you really have a critical time issue, or you don't want the TA's to see the message (for any reason at all), then you should send Prof. Crowley a direct message on Teams chat in addition to email.", "Model-based prediction and classification.", "Multiple examples and case studies such as autonomous driving, intelligent manufacturing, natural language understanding, speech recognition, computer vision, stock market prediction, disease early detection and diagnosis.", "View requirements for ECE 457B", "It encompasses a broad spectrum of supervised learning topics, including nonparametric and parametric models, linear and nonlinear approaches, deep learning paradigms, and probabilistic models.", "Theoretical knowledge is translated into practice through tutorials on industry-standard tools such as PyTorch and Keras.", "Interactive classroom discussions will pivot around both the practical trade- offs inherent in real-world applications and the theoretical underpinnings that provide an intuitive grasp of the field.", "These topics are an outline, and each year some subset of non-core topics will be skipped due to time constraints and in order to benefit students through deeper focus.", "Classification I", "Distance based - k-Nearest Neighbours (kNN)", "Fundamentals of Parameter Estimation and Learning", "MAP Implementation as Classification: Naive Bayes Algorithm", "Dimensionality Reduction and Manifold Learning", "Vector Embeddings : TF-IDF, Word2Vec, BERT", "Kernel Methods and Latent Models", "k-Means Algorithm, DBScan Algorithm", "Anomaly Detection: Classification, Outlier, Density, and Isolation based", "Classification III : Data, Image and Time-series classification using Deep Learning", "Representation Learning II: Auto-encoders and Variational Auto-Encoders", "Attention and Transformer Networks", "Some additional information and links might be here for older courses.", "A visual grading tool for pdfs submissions of tests and assignments, allows limited online test with mark-down text entry and multiple choice questions.", "Some assignments and tests might be made available online for submission using this tool as well.", "Arxiv Tutorials - pdfs will be posted to hypothes.is and others links will be provided to a number of detailed tutorials on some course topics.", "The first half covers many of basics of this course, while the second half focusses on Deep Learning only.", "Exams", "Completing the assignments will require multiple skills:", "familiarity with statistical, probabilistic analysis of data and results", "logical design and clear description of a expeirmental methodology", "programming various algorithms for processing, training and analysis of data to achieve given tasks (programming will be in Python using libraries such as sci-kit learn and tensorflow, pytorch, pandas)", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 148, "course_code": "ECE 457C", "course_name": "ECE457C - Reinforcement Learning (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["04:00PM - 05:20PM E7 4043", "Introduction to reinforcement learning (RL) theory and algorithms for learning decision-making policies in situations with uncertainty and limited information.", "Suggested Background", "The course will use some concepts from ECE 203 and ECE 307 on Bayesian Probability and Statistics, these will be reviewed but familiarity will help significantly.", "All other concepts needed for the course will be introduced directly.", "Identify and Explain the component theoretical concepts of Reinforcement Learning systems.", "Evaluate the performance of a particular RL system on a given domain through proper experimental design, statistical analysis and visualization", "Assess and critique the applicability of general RL concepts and specific RL algorithms to various problem tasks in Data Science, Artificial Intelligence, Planning, Control, and Machine Learning.", "Motivation and Context", "Importance of reasoning and decision making about uncertainty.", "Decision making under uncertainty:", "Theory, Bellman equations", "Value Iteration, Policy Iteration", "Other variants of these", "Value Function Approximation", "supervised training, back-propagation", "Experience replay buffers, mini-batch training and other methods of training and architecture", "Actor-Critic methods", "Decision Transformers", "Other Uses of RL Concepts", "Human Preference Elicitation - especially for Foundation Models and Large Language Models", "Moral Psychology - theories on human moral reasoning rely heavily on RL concept", "Wrap-up and Review", "Dimitrakakis2019", "Once you get through the first half of our course, many of the concepts on this site will be familiar to you.", "Family Tree of Algorithms - Here, a list of algorithms at the cuttingedge of RL as of 1 year ago to so, so it'sa good place to find out more.", "But in a fast growing field, it may be a bit out of date about the latest now. https://spinningup.openai.com/en/latest/spinningup/rl_intro2.html", "Piazza : ECE457C Discussions - TBD", "A visual grading tool for pdfs submissions of tests and assignments, allows limited online test with mark-down text entry and multiple choice questions.", "Some assignments and tests might be made available online for submission using this tool as well.", "Assignment will involve a mixture of short answers, mathematical solutions, programming in python and reporting of results of performance and outcomes of trained RL policies on provided simulated environments.", "Recipe for success:", "University can be a challenging environment and it is normal to need support from time-to-time.", "see these slides on university policy for COVID-19 safety once in-person classes begin again.", "If the student has a medical reason why they cannot wear a mask they should contact the professor electronically and provide proof of this.", "Whena student asks or answersa question it may be difficult for them to be heard while wearing a mask.", "Students can find the Illness Self-declaration form in the  Personal Information section of Quest.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 150, "course_code": "ECE 459", "course_name": "ECE459 - Programming for Performance (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["ECE 459", "Monday, Friday -", "08:30AM - 09:50AM E7 5353", "04:00PM - 05:20PM", "Monday, Friday -", "04:00PM - 05:20PM", "11:30AM -", "07:00PM - 07:50PM E7 5353", "07:00PM - 07:50PM E7 5353", "About Prof. Zarnett", "Then I got the AIF in the mail and decided I didn't want to study Computer Engineering after all.", "I'm an Associate Professor of Electrical and Computer Engineering.", "Some of you will know me as the previous Director of Software Engineering from back when you were in 1A. I studied math/CS yet convinced PEO to license me as a P.Eng.", "My research interests focus on using compiler and static analysis techniques to ensure program correctness.", "The LI is responsible for technical matters related to the assignments: git.uwaterloo.ca, git in general, administering the systems where you need to run your labs.", "And I enjoy engaging in discussions about these fields.", "Thanushon Sivakaran <tsivakar@uwaterloo.ca>", "Profiling computer systems; bottlenecks, Amdahl's law.", "View requirements for ECE 459", "Many modern software systems must process large amounts of data, either in the form of huge data sets or vast numbers of (concurrent) transactions.", "This course introduces students to techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs.", "These techniques will enable you to design and build critical software infrastructure, especially in an age of Big Data.", "While you may have seen some of these ideas in the context of operating systems (ECE350/SE350/CS350/MTE241) and concurrency (ECE252/CS343), this course gives you tools to make code run faster.", "Design and apply techniques for profiling, rearchitecting, and implementing software systems that can handle industrial-sized inputs.", "We intend to use these slots until we reach the end of the course material.", "The notes cite a number of sources, some of which are useful books.", "Rust familiarization and use of nonblocking I/O;", "Auto‐grading and auto‐feedback systems, including marmoset, may be used for the evaluation of some of your assignments.", "Acceptable collaboration includes discussing ideas and structures with others, as well as helping others debug their code.", "If your code is too close in structure to someone else's code, you are going to have a problem.", "Or, let's sum this up in two short instructions:", "The teaching team is keenly aware of the existence of generative AI (e.g., Github Copilot, ChatGPT) and how such tools can be used to write and test code.", "It almost goes without saying, but we ask you to be respectful and polite when communicating via this medium and to assume the best about others, as tone can be diﬃcult to interpret on a discussion forum.", "The human visual system has evolved to perceive saber‐toothed tigers in the savannah.", "We encourage everyone to be respectful of their classmates and to not distract them.", "Wise use of computers and the Internet can be helpful for fully engaging in class.", "From the command prompt, you can use compilers and text‐mode web browsers (w3m, lynx, links/elinks, etc....) tmux may also be helpful in managing multiple terminal sessions.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 152, "course_code": "ECE 486", "course_name": "ECE486 - Robot Dynamics and Control (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Robot Dynamics and Control Spring 2024", "ECE 486 / ECE 780", "ECE 486 001", "ECE 486 101", "08:00PM -", "ECE 486 201", "ECE 780 001", "ECE 486:", "Introduction to the study of robotics focusing on the mechanics and control of serial manipulators.", "Topics include rigid body motion, forward and inverse kinematics, differential kinematics, forward and inverse dynamics, trajectory generation, motion planning, and feedback control.", "This course will introduce students to dynamic modeling and control techniques for robotic systems, and expose them to some cutting-edge research.", "Dynamics of manipulators", "Optimization-based robot control", "May 7 Introduction to robot dynamics and control", "May 23 Dynamic model of manipulators 6 [", "CONTROL OF MANIPULATORS", "Jun 27 Control of driftless systems 14", "Jul 4 Control of differentially flat systems 14", "OPTIMIZATION-BASED ROBOT CONTROL", "Jul 18 Invariance and control barrier functions 4 [", "The lecturing deliverable will consist in a 15-minute presentation of a topic not covered in class and independently studied.", "Magnus Egerstedt, Robot Ecology: Constraint-Based Design for Long-Duration Autonomy, Princeton University Press, 2021 No", "ECE 486", "The project will consist of a mobile manipulation task using the DJI RoboMaster EP programmed in", "The code developed to complete the project", "The reports must be formatted using", "The project will consist of the solution to a problem in the student’s research area using the techniques", "– Section II: Novelty and/or impact", "– Section III: How robot dynamics and control techniques play a key role", "– Section V: Metric for success", "– Section I: Introduction", "– Section III: Materials and methods", "The code developed to complete the project"]}, {"course_id": 153, "course_code": "ECE 488", "course_name": "ECE488 - Multivariable Control Systems (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Multivariable Control Systems Winter 2025", "ECE 488", "Monday, Friday -", "D. Davison", "04:00PM - 05:20PM", "ECE 488 101", "08:00PM -", "D. Davison", "Instructor Dan Davison", "EIT-3114", "Review of feedback control design fundamentals; SISO controller parameterizations; the fundamental effect of MIMO interaction; introduction to state-space models in continuous and discrete time; SISO techniques for MIMO design; optimal control; model-predictive control design; state estimation; decoupling, MIMO PID control design; applications in areas such as aerospace systems.", "View requirements for ECE 488", "Course pre-requisites:", "This course builds on classical control theory from a first control course (ECE380, MTE360, BME356, SYDE352, or equivalent).", "I assume you have good working knowledge of Laplace transforms, transfer functions, Bode plots, block diagrams, and basic control tools (Routh-Hurwitz stability test, root locus plots, Nyquist plots, design of PID/lead/lag controllers).", "To develop tools that allow us to analyze and design control systems that have multiple inputs and/or multiple outputs.", "(7) Proficiently interpret and analyze MIMO systems (Chapter 4)", "(9) Proficiently manipulate and analyze MIMO state-space systems (Chapter 5)", "(11) Explain the advantages and disadvantages of state-space and transfer-function techniques for MIMO control (Chapter 5)", "Tests and final exam", "Tests and final exam", "Tests and final exam", "Tests and final exam", "Tests and final exam", "\"Impact of engineering on society and the environment\"", "\"Economics and project management\"", "Mon Feb 10 Lecture Ch 3 pp.157-164 and P3 & P4", "These slots will compensate for lectures that are cancelled during the ECE Midterm Week.", "You can send a print request online at https://wstore.uwaterloo.ca/pages/w-print-student.", "Chapter 4:  \"Control System Design\", by Goodwin, Graebe, and Salgado, 2001", "Summary of marked components", "Tests and final exam", "Any reason for missing a test, other than those listed above, results in a score of zero on that test.", "The purpose of the Project Exercises is to increase your understanding of the techniques and ideas presented in the lectures by applying them to a quasi-realistic system.", "In-person students who faithfully attend the in-person lectures can get bonus marks.", "I will occasionally distribute slips to each person present in the lecture room.", "Correctly answer a simple question on the slip, and put the slip in the box at the front of the room.", "Most of the 36 lecture videos explain how a random subset of viewers can get a 0.5% bonus mark.", "Mixed learning modes:  Students who switch between in-person and online learning may collect a mixture of in-person and online bonus marks."]}, {"course_id": 154, "course_code": "ECE 493", "course_name": "ECE493 - Special Topics in Electrical and Computer Engineering (0.50)", "term_name": "List 2", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Notice of Recording", "Social Robotics - Foundations, Technology and Applications of Human-Centered Robotics Winter 2025", "ECE 750 / ECE 493", "ECE 750 / ECE 493 001", "10:00AM - 11:20AM E7 5353", "kerstin.dautenhahn@uwaterloo.ca", "04:00PM - 05:20PM", "08:00PM -", "Prof. Kerstin Dautenhahn:", "E5-5027", "kerstin.dautenhahn@uwaterloo.ca", "ECE 750:", "View requirements for ECE 750", "View requirements for ECE 493", "The course will provide an introduction to the research field of social robotics, with a particular human-centered perspective.", "Robots that can interact socially in an effective and acceptable manner with people have become increasingly important for applications ranging from robot-assisted therapy for people with special needs, robotic assistants for older people and care home residents, robots as tools in education or robotic co-workers for a new generation of  industrial robot that emphasize human-machine collaboration and communication.", "Students will gain an understanding of the concepts and theories underlying social robotics, as well as research methodologies and techniques to realize socially intelligent robots and design, plan and evaluate human-robot interaction experiments.", "Understand concepts and theories underlying social robotics", "Apply research methodologies and techniques to realize socially intelligent robots", "Design, plan, and evaluate human-robot interaction experiments", "Demonstrate scientific writing and presentation skills", "Explain how psychology and social sciences can inform the engineering of social robots", "Understand basic principles of sensors, actuators and multi-model interaction and communication for social robots", "Explain examples of robot computational architectures used in human-robot interaction", "Definitions of social robots and requirements of robots’ social skill and their relevance to robotics and Artificial Intelligence in real-world applications", "The role of affective expressions of social robots and modelling emotions to facilitate human-robot engagement", "Evaluating usability, user experience and acceptance of social robots", "Guidelines of how to write up social robotics research for a scientific publication", "Overview of cognitive architectures for socially intelligent robots", "Featuring interdisciplinary research in social robotics based on research from other fields, e.g. from (developmental) psychology, ethology or primatology", "Roles of social robots in human society and their potential impact on society and wellbeing", "Selected examples of applications of social robots e.g. in care, therapy, education, rehabilitation and co-worker scenarios will be discussed throughout the course", "Ethical, safety and privacy issues as relevant to social robotics will be discussed throughout the course", "Course Grading for Graduate Students:", "20% Individual discussion paper: Students will reflect on work in Science Fiction involving the concepts of social and intelligent robots, and reflect on the relevance to today’s robotics technology in robotics and Artificial Intelligence.", "Students can choose the work and discuss the selection with the instructor.", "Students are required to write a report that motivates, describes and discusses those behaviours in light of the state of the art literature, and describe an experimental design for a human-robot interaction experiment where those behaviours could be tested and analyzed.", "Specifically, students’ reports will be evaluated based on a) the literature review demonstrating the level of knowledge in this domain, b) the relevance of the identified research questions and hypotheses, c) the depth of the proposed research program, d) the range, complexity and quality of the implemented and documented robot behaviours, e) the detailed description of the methodology used to carry out and analyze this program of work, f) the user study conducted and how results are presented and analysed, and finally, g) a critical evaluation of possible limitations of the expected outcomes and backup plans in order to address  possible delays and technical difficulties encountered during the implementation of the work.", "Note, those skills can also be applied to related fields of Human-Computer Interaction (HCI), Human Factors etc.", "20% Individual discussion paper: Students will reflect on work in Science Fiction involving the concepts of social and intelligent robots, and reflect on the relevance to today’s robotics technology in robotics and Artificial Intelligence.", "Students can choose the work and discuss the selection with the instructor.", "Students are required to write a report that motivates, describes and discusses those behaviours in light of the state of the art literature, and describe a possible experimental design for a human-robot interaction experiment where those implemented behaviours could be tested and analyzed.", "Specifically, students’ reports will be evaluated based on a) the literature review demonstrating the level of knowledge in this domain, b) the relevance of the identified research questions and hypotheses, c) the depth of the proposed research program, d) the range, complexity and quality of the implemented and documented robot behaviours, e) the detailed description of the methodology used to carry out and analyze this program of work, f) a critical evaluation of possible limitations of the expected outcomes and backup plans in order to address  possible delays and technical difficulties encountered during the implementation of the work.", "Note, those skills can also be applied to related fields of Human-Computer Interaction (HCI), Human Factors etc.", "Notice of Recording"]}, {"course_id": 165, "course_code": "CO 487", "course_name": "CO487 - Applied Cryptography (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Instructor: Samuel Jaques", "Email: sejaques@uwaterloo.ca", "Timothy Miller", "Nicolas Swanson", "A broad introduction to modern cryptography, highlighting the tools and techniques used to secure internet and messaging applications.", "It is one of the core technologies for securing the emerging information infrastructure.", "This course is a comprehensive introduction to modern cryptography that is aimed primarily at those interested in applications.", "In the area of public-key cryptography, topics will include an overview of specific systems (Diffie–Hellman, RSA, DSA, etc.) and a few advanced protocols.", "The security of these schemes and the use of public-key techniques for generating digital signatures will be described.", "Linear and differential cryptanalysis of ciphers.", "Define the main information security goals of confidentiality, integrity, authentication, and availability", "Explain the intended security properties of each cryptographic primitive and analyze relationships between security properties", "Explain mathematical techniques underlying standardized cryptographic algorithms", "Identify flaws in uses of cryptographic algorithms", "Determine which cryptographic algorithms can be used and combined to build systems with desired functionality and security", "Understand and contextualize the cryptography and security around them in daily life", "0 1 (Jan 6-8) Introduction", "Symmetric Encryption", "3.6 9 Elliptic Curve Cryptography 4 Yes", "4   Applications", "Understanding Cryptography: From Established Symmetric and Asymmetric Ciphers to Post-Quantum Algorithms, 2nd edition, Springer, 2024 Primary reference.", "A1: January 23", "A4: March 20", "This will be clearly indicated for each such question.", "In that case you are required to work independently.", "These questions will test your ability to identify the important concepts introduced in lectures, and your understanding of them.", "In particular:", "Please inform us of these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 166, "course_code": "CS 467", "course_name": "CS467 - Introduction to Quantum Information Processing (0.50)", "term_name": "List 3", "program_name": "Software Engineering", "program_id": 152, "major_id": 5, "major_name": "Software Engineering (Bachelor of Software Engineering - Honours)", "topics": ["Introduction to Quantum Information Processing Winter 2024", "Basics of computational complexity; basics of quantum information; quantum phenomena; quantum circuits and universality; relationship between quantum and classical complexity classes; simple quantum algorithms; quantum Fourier transform; Shor factoring algorithm; Grover search algorithm; physical realization of quantum computation; error-correction and fault-tolerance; quantum key distribution.", "This course aims to give a basic foundation in the field of quantum information processing (often just called \"quantum computing\").", "QIP is a multidisciplinary subject and therefore this course will introduce fundamental concepts in theoretical computer science and physics that will enable students to pursue further study in various aspects of QIP.", "Prerequisites: A solid background in basic linear algebra (e.g. a good performance in MATH 235 or MATH 114) is necessary.", "Explain the logical level functioning of quantum computers.", "Describe and analyze several elementary quantum algorithms.", "Introduction to Quantum Mechanics (6 hrs)", "Bloch sphere.", "Introduction to Computation and Computational Complexity (6 hrs)", "Quantum circuits.", "Basic complexity classes.", "Quantum Algorithms (9 hrs)", "Basic algorithms.", "Implementations of quantum information processors.", "An Introduction to Quantum Computing, by Kaye et al.", "Students may assist each other in working through assignment problems, as"]}]