[{"course_id": 10, "course_code": "CIVE 123", "course_name": "CIVE123 - Electrical Circuits and Instrumentation (0.50)", "term_name": "1B Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electrical Circuits and Instrumentation Winter 2025", "Monday, Friday -", "10:00AM - 11:20AM RCH 302", "Duty", "E-mail", "Function and characteristics of basic electrical transducers.", "Basics of data acquisition.", "Demos for circuit basics: https://youtube.com/playlist?list=PLDkq31epwdjxzg5AHIOsDk0dry4lAW5Sl", "3 1&2 Current, Voltage, Power and Energy,", "4 2&3 Basic resistive circuit techniques", "9 6 Operational Amplifiers", "10 7 Capacitors and inductors", "12 9 AC Circuit Analysis - I"]}, {"course_id": 13, "course_code": "CIVE 121", "course_name": "CIVE121 - Computational Methods (0.50)", "term_name": "1B Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Computational Methods Winter 2025", "08:30AM - 09:50AM RCH 302", "Introduction to computer programming, examples of efficient numerical algorithms for basic scientific computations.", "Programming and problem solving concepts introduced in the course will be incorporated into group projects involving civil, environmental, or geological engineering applications.", "MATLAB is an easy and readable programming language and is an excellent choice for those who are learning programming for the first time.", "Students who complete this course will gain a fundamental understanding of computer programming techniques and be able to operate, analyze, and visualize all types of data for future engineering studies.", "It is an introductory programming course that utilizes MATLAB to illustrate general concepts in computer programming.", "Compose working, efficient, and readable MATLAB scripts in various ways.", "Debug your code to identify and fix programming errors.", "Identify suitable keywords to search for code snippets on the web."]}, {"course_id": 22, "course_code": "GEOE 223", "course_name": "GEOE223 - Differential Equations and Balance Laws (0.50)", "term_name": "2A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Differential Equations and Balance Laws Winter 2025", "10:00AM - 11:20AM RCH 309", "08:30AM - 09:20AM", "An introduction to ordinary differential equations with applications to mass and energy balance problems in engineering.", "Standard methods of solution of first and second order linear equations with constant coefficients.", "Numerical methods for solving ordinary differential equations.", "Many practical physical and engineering problems can be analyzed using mathematical models formulated in terms of ordinary differential equations; these often arise from the application of mass, momentum, or energy balance laws.", "The objective of this course is to equip engineering students with a working knowledge of the methods which are used to solve these equations.", "Differential equations are introduced, along with standard methods of solution for first and second order linear equations with constant coefficients.", "identify and differentiate between the various types of differential equations; with this knowledge, be able to identify the most appropriate method of solution", "pose appropriate boundary or initial conditions and solve that equation using standard methods for given a mathematical problem statement expressed in terms of a linear differential equation", "check whether a solution to a differential equation is correct", "think critically about a mathematical problem and evaluate the validity of results from mathematical methods", "appreciate the utility and value of having an education in mathematics as part of their training as an engineer", "Canadian Engineering Accreditation Board", "Piazza – Wiki-style Q&A; primary way to get & give text-based help in ENVE/GEOE 223", "Drop-in Hours", "Students are very welcome and encouraged to meet with the teaching team in scheduled drop-in hours.", "1 Jan 6-10 CH1: Introductory concepts and definitions, simply integrable and separable solutions", "2 Jan 13-17 CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties, substitution", "3 Jan 20-24 CH3: Applications of linear first-order ODEs", "4 Jan 27-31 CH4: Solving homogeneous linear higher-order ODEs with constant coefficients A1, Jan 28", "6 Feb 10-14 CH6: Applications of linear higher-order linear ODEs", "Reading Week & Family Day", "7 Feb 24-28 CH7: Slope fields and numerical solution of first-order ODEs A2, Feb 25", "Notes of Diffy Qs, Differential Equations for Engineers, Jiří Lebl, Creative Commons, 2024.", "Calculus for Engineers (4e), Donald Trim, Pearson, 2007.", "Common first-year calculus text.", "CH1: Introductory concepts & definitions, simply integrable & separable solutions 0.2,3; 1.1,3 15.1,2", "CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties; substitution 1.4", "CH3: Applications of linear first-order ODEs 1.4 15.2,3,5", "CH4: Solving homogeneous linear higher-order ODEs with constant coefficients 2.1-3 15.6-8", "CH5: Solving non-homogeneous linear higher-order ODEs with constant coefficients using the method of undetermined coefficients 2.5 15.9", "CH6: Applications of linear higher-order linear ODEs  2.4 15.10", "CH7: Slope fields and numerical solution of first-order ODEs 1.2,7", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "extenuating circumstance", "This course includes the independent development and practice of engineering specific skills.", "Campus Supports", "Library for research-based assignments"]}, {"course_id": 24, "course_code": "GEOE 224", "course_name": "GEOE224 - Probability and Statistics (0.50)", "term_name": "2A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Instructor (first-half)", "E2-3322", "TBD", "TBD", "TBD", "TBD", "TBD", "TBD", "TBD", "john.quilty", "spbuis", "Role of probability in engineering and decision-making under uncertainty.", "Basic probability concepts.", "Introduction to regression analysis.", "Introduction to design of experiments and statistical quality control.", "Probability concepts and statistics are used to quantify this “uncertainty” and hopefully reduce the “risk” in our design and decision-making.", "This course aims to introduce students to the basic concepts of probability and statistics.", "Mathematical Expectation", "Statistical Estimation", "Regression Analysis", "Mathematical Expectation", "Statistical Estimation", "Regression Analysis", "Probability and Statistics for Engineers and Scientists, 9th Ed.", "These problem sets are ungraded and meant for you to test and apply the concepts learned in the lectures.", "Notice of Recording"]}, {"course_id": 27, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "2B Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}, {"course_id": 32, "course_code": "EARTH 458", "course_name": "EARTH458 - Physical Hydrogeology (0.50)", "term_name": "3A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrogeology Fall 2024", "08:30AM - 09:50AM DWE 3519", "An introduction to the principles and theories of mineral deposit genesis.", "Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered.", "View requirements for EARTH 458L", "Applied geophysics provides geoscientists with a wide-range of non-invasive methods for characterizing the Earth's interior.", "This course is an introduction to the physical principles underlying field acquisition, processing, and data interpretation for commonly used applied geophysical techniques (seismic, electrical, electromagnetic induction, gravity, and magnetic methods).", "This course is not only pertinent for geoscientists but also for engineers and others interested in learning how physics can be used to explore the Earth's interior or perform non-destructive testing.", "Near-surface geophysics is used to characterize the shallow subsurface for a wide-spectrum of applications.", "This application-oriented course covers current methodology in near-surface geophysics, including electrical, electromagnetic, ground penetrating radar, seismic refraction, and well-logging methods.", "Techniques for geophysical data acquisition and interpretation are studied and applied to field data.", "Examples of the application of geophysical techniques to archeological, forensics, geotechnical, glaciology, and hydrogeological problems are examined.", "View requirements for EARTH 461", "A field-oriented course on current methodology in the general area of geotechnical or engineering geophysics as applied to environmental problems.", "Typical topics covered: well logging and time domain electromagnetic surveys for groundwater supply; magnetic and terrain conductivity surveys for waste materials; ground penetrating radar applications to stratigraphy and contamination; streaming potential surveys of dam leakage.", "A pre-lab quiz must be completed before attending each field lab.", "Labs will be completed in groups with field data recorded in field books or datasheets.", "These data will be used to a complete individual lab assignment.", "This site contains over 100 groundwater monitoring wells.", "Field lab activities involve:", "(3) Measurement of in-situ hydraulic conductivity using single-well response tests", "Each lab will provide you with a unique dataset that you will use to develop a conceptual site model of the local groundwater flow system.", "• Properly construct and interpret soil core logs using United Soil Classification System, and make lithostratigraphic interpretations using geophysical logs", "• Assess and interpret water level measurements through the construction of water table maps and flownets", "• Interpret single-well response tests including falling and rising head (slug) tests to determine in-situ hydraulic conductivity", "• Interpret hydraulic pumping tests to determine aquifer transmissivity and storage parameters and assess water resource vulnerability", "Each module will contain a series of recorded lecture slides and video demonstrations reviewing core concepts and guidelines for the upcoming field lab.", "Please include “Earth 458L” in the subject line of all e-mail communications as well as your Full Name and Student ID# in the text of the email.", "Hydrogeological equipment to make measurements and collect data (temporary use)", "Specialized hydrogeological software to complete certain assignments", "Datasheet to record field data", "Other data should be recorded in your field books and distributed to your group members as needed.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Notice of Recording", "Participation in Field Labs:", "These quizzes are designed to keep you on schedule and prepare you for the in-person field lab and assigned activities.", "There will be a 48-hour grace period to finalize the submission of your assigned activities without incurring any late penalty."]}, {"course_id": 34, "course_code": "ENVE 330", "course_name": "ENVE330 - Lab Analysis and Field Sampling Techniques (0.50)", "term_name": "3A Term", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Lab Analysis and Field Sampling Techniques Spring 2024", "08:30AM - 09:50AM DWE 3518", "An introduction to the fundamental concepts of physical and chemical measurement of the environment.", "Introduction to measurement techniques including: colorimetry, chromatography, spectroscopy, electrochemical probes, remote sensing.", "Design of monitoring strategies, and use of methods to assess validity of laboratory data.", "Develop environmental sampling program skills and strategize the overall progression sequence of sample designs with time and space which include:", "Develop skills in data representation (parameter specific graphing techniques) and error filtering of real and large(r) data sets.", "Develop skills in site background investigations (desktop studies) with particular attention focused towards:", "Data mining of existing studies,", "Develop skills and experience in atmospheric quantity and quality sampling and analysis, including:", "Identify common sampling techniques, devices and limitations of near-surface air quality monitoring.", "Develop skills and experience in infiltration quantity sampling and analysis, including:", "Double-ring Infiltrometer,", "Develop skills and experience in surface water quantity and quality analysis, including:", "Velocity-area,  slope-area, and float-tracer discharge estimates,", "Slug injection and continuous injection dye-tracer tests,", "Depth integrated and grab sampling collection techniques in flowing waters,", "Field water quality analysis employing Hach Kits,", "Long-term water quality data employing data loggers (Sondes),", "Analytical techniques of field sample data for COD, Total Nitrogen (TN), Total Phosphorous (TP)", "Develop skills and experience in groundwater water quantity and quality analysis, including:", "Laboratory methods and field techniques.", "Basic statistical and spatial statistical techniques used in field sampling.", "Developing concepts of environmental monitoring design programs.", "Design Project Presentation (Group) 15", "Missed field camps may result in an INC for the academic year that the course is offered.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 51, "course_code": "CHE 361", "course_name": "CHE361 - Bioprocess Engineering (0.50)", "term_name": "List 1", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["03:30PM - 05:20PM", "03:30PM - 04:20PM", "04:30PM - 05:20PM", "Introduction of biological systems for the production of commercial goods and services, e.g., foods, pharmaceuticals, chemicals, fuels, diagnostics, waste treatment, and biomaterials.", "Introduction to design of bioprocess systems, including biosafety and sustainability.", "Development of reaction kinetics associated with biological systems.", "Development of material balances for key constituents in bioreactors operated in different modes, e.g., batch, fed-batch, continuous stirred-tank reactor (CSTR), perfusion, recycle.", "Introduction to mass and heat transfer considerations for bioreactors.", "Dynamic simulation of cultures defined by ordinary differential equations.", "Introduction of downstream processes associated with biological systems and recovery of biological products.", "View requirements for CHE 361", "Understand enzyme kinetics and derive enzyme kinetic equations based on associated biological information", "Model bioreactor for enzymatic reactions", "Understand how cells replicate with bioproduct formation", "Model bioreactor for cell cultivation and bioproduct formation", "Demonstrate competence in the fundamental concepts of biological sciences and biochemical/bioprocess engineering, including biomolecules, biocatalysts, metabolic pathways, enzyme functions/kinetics, cell behaviors and growth kinetics, bioreactor systems for enzymatic reactions and cell cultivation.", "Apply biological and chemical engineering concepts to design and analysis of bioreactor systems, including mass balance, bioreactor types, bioreactor configurations, bioreactor operation, bioreactor control, bioreactor modeling, bioreactor optimization etc. (2a; 2b; 2c; 4a; 5a; 11b)", "•Week 1: Bioprocess introduction and biological background review", "•Week 2: Enzyme kinetics introduction", "•Week 3: Enzyme kinetics modeling", "•Week 4: Bioreactor modeling for enzymatic reaction", "•Week 6: Enzyme inhibition kinetics", "•Week 7: Enzyme inhibition kinetics (continued) and other enzyme kinetics", "•Week 8: Cell growth biology and cell cultivation", "•Week 9: Cell growth kinetics", "•Week 10: Bioreactor (batch) modeling for cell cultivation and bioproduction", "•Week 11: Bioreactor (CSTR) modeling for cell cultivation and bioproduction", "•Week 12: Stoichiometric modeling of cell cultivation and bioproduction", "Bioprocess Engineering (Basic Concepts) No 173.59"]}, {"course_id": 53, "course_code": "CHE 571", "course_name": "CHE571 - Industrial Ecology (0.50)", "term_name": "List 1", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Industrial Ecology Fall 2024", "04:00PM - 05:20PM", "Industrial ecology is a rapidly growing field that systematically examines local, regional, and global uses and flows of materials and energy in products, processes, industrial sectors, and economies.", "It focuses on the potential role of industry in reducing environmental burdens throughout the product life cycle from the extraction of raw materials to the production of goods, to the use of those goods and to the management of the resulting wastes.", "This course will review the environmental issues associated with chemical industries and the roles of engineers to manage these issues.", "The principles and philosophy of green chemistry will be addressed including pollution prevention in unit operations.", "The concepts and practices of environmental life cycle analysis and accounting will be addressed in detail, together with the basics of risk assessment, management and communication.", "View requirements for CHE 571", "Introduction to sustainability and industrial ecology", "Brief overview of the scientific evidence for climate change", "Environmental Law in Canada; due diligence as a defence", "Climate legislation in Canada; carbon trading", "Describe the key principles of industrial ecology, sustainable development and sustainability engineering [1d,8a,9a].", "Explain the science of global warming and climate change [", "Apply carbon accounting standards to develop greenhouse gas emission and reduction estimates for inventories and reduction projects [", "Describe key environmental legislation in Ontario and Canada [8b,9a]", "Basics of sustainability and industrial ecology.", "Introduction to greenhouse gas (GHG) accounting.", "Week 5 GHG accounting - offset systems.", "A timed multiple-choice component.", "3.0 points - solutions are complete, correct and well-presented.", "2.0-2.5 points - solutions are mostly complete and well-presented but have minor errors, missing information.", "Intellectual property includes items such as:", "Graduate Attribute Program Indicators", "A knowledge base for engineering: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "1a Demonstrate understanding of concepts in mathematics.", "1b Demonstrate understanding of concepts in natural science.", "1c Demonstrate understanding of engineering fundamentals.", "1d Demonstrate understanding of specialized engineering knowledge.", "2. Problem Analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "3a Create investigative studies of complex engineering problems.", "3b Gather information from relevant sources to address complex engineering problems.", "4. Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "4a Define design requirements and specifications for complex, open-ended engineering problems.", "4b Critically evaluate and compare design choices.", "7. Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "8a Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Impact of Engineering: An ability to analyze social and environmental aspects of engineering activities.", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "10a Identify ethical and unethical behavior in professional situations.", "10b Identify how an engineer is accountable to multiple stakeholders in engineering practice.", "Life-long Learning: An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge.", "12a Identify gaps in their knowledge, skills and abilities.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 59, "course_code": "CIVE 554", "course_name": "CIVE554 - Geotechnical Engineering 3 (0.50)", "term_name": "List 1", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Geotechnical Engineering 3 Winter 2025", "11:30AM -", "11:30AM - 12:20PM DWE 3518", "Email: n2elyasi@uwaterloo.ca", "This course focuses on the design of earth structures using geotechnical engineering concepts taught in CIVE/GEOE 353 and 354 and new engineering and design concepts.", "You will be exposed to all required engineering concepts through recorded lectures, in-class tutorials, assigned readings and the completion and submission of assignments and design projects.", "The assignments and design projects are structured to review key engineering concepts and to simulate the work of a practicing geotechnical consulting engineer.", "Understand the role of the geotechnical engineer and Engineer of Record in construction projects", "Evaluate geotechnical borehole records", "Evaluate geotechnical field and laboratory test data", "Design earth structures using soil mechanics principles", "Evaluate earth dam design components and potential failure modes", "Prepare geotechnical design reports", "Course concepts include:", "1) The role of the Design Engineer", "3) Design of Earth Dams, and", "The time date and location of the tutorial will be announced in advance via MSTEAMs and via email communication.", "Assignments will be assigned throughout the term, to enhance the understanding of key geotechnical engineering concepts and to advance the completion of your design project.", "Embankment Design Project 35", "This course includes the independent development and practice of specific skills, such as the application of soil mechanic principles for the design of earth structures.", "Library for research-based assignments"]}, {"course_id": 63, "course_code": "ENVE 577", "course_name": "ENVE577 - Engineering for Solid Waste Management (0.50)", "term_name": "List 1", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Attention is given to the engineering design and operational aspects of the control of generation, storage, collection, transfer and transport, processing and disposal of solid wastes in landfill site.", "Design of natural attenuation sites and system reliability features for landfill designs.", "Topics include waste characterization, collection systems, transportation, treatment technologies, landfill design, recycling, waste-to-energy systems, greenhouse gas impacts, and policy frameworks.", "Understand the composition and generation rates of solid waste", "Analyze waste collection, segregation, and treatment methods", "Design components of solid waste management systems (e.g., landfills, composting systems)", "Explore innovative technologies for resource recovery, recycling, and waste-to-energy processes", "Module 1: Introduction to Solid Waste Management", "Definition and types of solid waste", "Examples of waste management systems from different regions", "Calculate the waste generation rate (WGR) per capita for a given dataset and project future WGR trends using population growth models", "Jan 9 Waste Generation and Characteristics", "Physical, chemical, and biological characteristics", "Typical components and composition of waste", "Hazardous wastes and recycling streams", "Introduction to waste composition audits", "Calculate the environmental impact using simplified LCA metrics for waste scenarios", "Jan 16 Lifecycle Analysis and Waste Hierarchy", "Jan 21   Waste Collection Systems", "Door-to-door collection", "Community bins and transfer stations", "Equipment used in collection", "Estimate transportation costs for different modes of waste transfer (e.g., by truck, rail) based on distance, fuel costs, and waste tonnage", "Operations and routing strategies", "Design and function of transfer stations", "Jan 28   Temporary Storage Solutions", "Design of storage bins and containers", "Safety considerations", "Calculate the capacity needs of storage containers", "based on waste generation rates and collection frequency", "Role of public awareness", "Estimate biogas yield from anaerobic digestion of organic waste using stoichiometric calculations", "Process design and optimization", "Applications and challenges", "Incineration: principles and applications", "Pyrolysis and gasification", "Calculate energy recovery from the incineration of municipal solid waste using calorific values", "Design of Material Recovery Facilities (MRFs)", "Challenges in recycling", "Technical, environmental, and economic considerations", "Assess the efficiency of a WTE plant using energy balance equations", "Definitions and frameworks", "Composting and anaerobic digestion as mitigation techniques", "Site selection and design", "Leachate and gas management", "Design a landfill’s leachate collection system based on given permeability and rainfall data", "Operational strategies", "Post-closure monitoring and land reuse", "Environmental and health impacts", "Strategies for remediation", "*TBD", "Mar 13 Analysis and Design of Solid Waste Management Infrastructure", "Design and operation of materials recovery facilities", "Overview of thermal methods and biological processes", "Mar18                          Digital and Smart Solutions for SWM", "Data analytics for waste tracking", "*TBD", "Tools and methodologies", "Challenges and solutions", "Innovations in SWM policies", "** Note:", "Design Project 25%", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, such as practical analysis and critical thinking.", "Library for research-based assignments"]}, {"course_id": 67, "course_code": "ME 452", "course_name": "ME452 - HVAC Load Analysis and Design Fundamentals (0.50)", "term_name": "List 1", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "HVAC Load Analysis and Design Fundamentals Winter 2025", "11:30AM - 12:20PM RCH 305", "Email: hasan.habib@uwaterloo.ca", "Duct design and fan selection.", "Heating and cooling load calculations.", "Infiltration and exfiltration.", "B. Be able to fully design an air conditioning and ventilation system", "C. Be able to perform heating and cooling load, and preliminary energy use calculations for buildings", "D. Have developed the ability to apply their knowledge in a real-world setting (practical experience)", "E. Be capable of communicating effectively with industry professionals and clients", "F. Have developed the skills to research and interpret information needed to remain current in the field", "Module 1: Introduction to HVAC:  History, ASHRAE, Unit Systems (chap.", "Module 2: Air Conditioning and Ventilation: Fundamental Concepts of HVAC/Air Conditioning Systems (chap.", "3), Fans and Air Distribution Systems (chap. 16).", "A tentative checklist of material to be reviewed each week will be posted in Learn.", "Midterm Exam: will be held in two parts during scheduled lecture time.", "You can also present case studies of interesting buildings or even a biographical review of someone who made an impact to HVAC.", "A) Develop an appreciation and understanding for the various codes, standards, and guidelines that determine HVAC design practices X    X", "B) Fully specify and design an air conditioning and ventilation system   X", "C) Perform heating and cooling load, and preliminary energy use calculations for buildings     X", "F) Develop the skills to research and interpret information needed to remain current in the field X", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 73, "course_code": "BIOL 354", "course_name": "BIOL354 - Environmental Toxicology (0.50)", "term_name": "List 2", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Environmental Toxicology Fall 2024", "02:30PM - 05:20PM B2 351", "07:00PM - 09:50PM B2 351", "02:30PM - 05:20PM B2 351", "02:30PM - 05:20PM B2 351", "07:00PM - 09:50PM B2 351", "Please bring a reusable mug if you'd like a cup of tea.", "An introduction to the basic theories, principles, and techniques of environmental toxicology.", "A comparative study of the effects of specific groups of toxicants and how they can affect molecular, cellular, and organismal processes will be explored in lectures and through laboratory experiments.", "Know the basic theories, principles and techniques of environmental toxicology.", "Understand how different toxicants move from source to receptor, the concept of dose-response relationships and toxicokinetics.", "Understand the process of assessing toxicity using various toxicity test methods and the understand the physiological impacts of various classes of toxicants.", "Know the scientific terminology and knowledge base necessary to effectively communicate the impact of toxicants on target organisms through an in-person group presentation.", "Follow safety procedures as they relate to working in a toxicology laboratory and handling samples and organisms in the lab.", "Conduct toxicity tests using model organisms to assess the effects of pollutants.", "Describe how bioassays are used to estimate toxicity in environmental toxicology.", "Interpret and analyze the results of toxicity experiments, draw appropriate conclusions supported by the data in the format of a laboratory report.", "Week 2 Dose-Response Relationships & Toxicity Test Methods Chapter 4 Sections 4.3.2.", "no grade**", "no grade**", "Week 8 Survey of Toxic Substances - Inorganic & Organic Contaminants", "2,4-D", "2,4-D", "**", "Official Grades and Course Access", "Few are available on loan in the lab (first come, first served)", "WHMIS training checked for completion during the first lab Yes", "At the discretion of the instructor, you may be permitted to take a make-up exam.", "The make-up exam may be of different format than the missed examination (e.g. oral examination for the make-up).", "The Lecture Minute Paper activity will be followed by a discussion Indigenous Learning Circles that provide an opportunity for relational and reciprocal learning, fostering critical thinking, problem-solving skills, increased engagement, and community building.", "Lab Activities & Assessments", "Notice of Recording", "Don’t waste your time with these requests!", "Library for research-based assignments"]}, {"course_id": 74, "course_code": "BIOL 447", "course_name": "BIOL447 - Environmental Microbiology (0.50)", "term_name": "List 2", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Environmental Microbiology Fall 2024", "10:00AM - 11:20AM MC 4064", "10:00AM - 11:20AM MC 4064", "You can!", "A study of the environmental impact of microorganisms.", "Tutorials emphasize critical analysis of primary literature.", "Relate microbe-environment interactions to core concepts in microbiology and biochemistry", "Identify appropriate experimental methods to answer specific research questions", "Evaluate experimental designs in published research", "Effectively communicate critical evaluation to peers", "Introduction to cellular respiration and redox;", "Calculating the oxidation state of a carbon;", "Sampling & analysis", "Critical evaluation of research", "Important points to consider when critically evaluating published research papers;", "critical evaluation, part 1", "Algal and cyanobacterial blooms", "Chapter 6 - Microbial primary production and phototrophy;", "(2023)   (Introduction and Methods)", "critical evaluation, part 1", "critical evaluation, part 2", "Biodegradation & bioremediation", "critical evaluation, part 2", "Hydrocarbon degradation", "Passow U & Overton EB (2021) (review paper)", "Environmental impacts of viruses", "Chapter 10 - Ecology of viruses;", "Final exam - TBA", "You can miss up to 3 classes and still achieve full participation marks.", "I have chosen settings that make the scores as transparent as possible, and students can see their in-progress scores for each assignment.", "You can self-declare an absence on Quest in certain situations.", "The dates affected and degree of incapacitation will be used to determine follow-up action."]}, {"course_id": 84, "course_code": "EARTH 456", "course_name": "EARTH456 - Numerical Methods in Hydrogeology (0.50)", "term_name": "List 2", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Numerical Methods in Hydrogeology Winter 2025", "An introduction to the theory and practice of groundwater flow and contaminant transport modeling.", "Topics related to variably-saturated flow will focus on derivation of Richard's equation, a control volume finite difference discretization, assembly and solution of the flow equation, material balance error, truncation error analysis, stability and monotonicity.", "Explain the fundamental theory behind groundwater flow and contaminant transport modeling", "Apply numerical techniques, including control volume finite difference discretization, to solve groundwater flow and contaminant transport equations.", "Analyze numerical model accuracy, including material balance error, truncation error, stability, and monotonicity in variably-saturated flow and contaminant transport problems.", "Use a modeling software to model variably-saturated flow and contaminant transport.", "Interpret and visualize groundwater flow and contaminant transport model results and communicate findings effectively.", "Identify the concepts of groundwater and solute transport modeling and their real-world applications.", "Section 1.1 Derivation of Richards' Equation", "Section 1.2 Derivation of Richards 'Equation – Pressure Head Formulation", "Section 1.3 Three-Dimensional Groundwater Flow", "Derive and interpret three-dimensional groundwater flow dynamics and their mathematical representation.", "Section 1.4 Control Volume Finite Difference Discretization for Flow", "Section 1.5 A Rigorous Derivation of the Control Volume Finite Difference Discretization", "Develop, apply, and justify control volume finite difference discretization techniques for groundwater flow problems, demonstrating a rigorous understanding of mathematical principles.", "Assemble and implement saturated groundwater flow equations in numerical models using discretized formulations.", "Assemble the saturated groundwater flow equation using control volume discretization.", "Analyze groundwater flow material balance errors and their implications for numerical model accuracy.", "Section 1.8 Truncation Error Analysis", "Section 1.8 Truncation Error Analysis", "Section 1.9 Stability and Monotonicity", "Section 2.1 Derivation of the Contaminant Transport Equation", "Analyze the stability and monotonicity of numerical methods for groundwater flow models.", "Derive the contaminant transport equation and articulate its role in modeling solute movement through porous media.", "Section 2.1 Derivation of the Contaminant Transport Equation", "Section 2.2 Control Volume Finite Difference Discretization of the Contaminant Transport Equation", "Section 2.3 Central Spatial Weighting of Advective Flux", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Apply control volume finite difference discretization to the contaminant transport equation for numerical modeling.", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Section 2.4 Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.5 Upstream Spatial Weighting of Advective Flux", "Section 2.5.1 Truncation Error of Upstream Spatial Weighting", "Section 2.6 Crank-Nicolson Temporal Weighting with Upstream Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.7 Assembly of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.7.1 Monotonicity of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.8 Assembly of Fully-Implicit Temporal Weighting with Upstream Spatial Weighting", "Section 2.8.1 Monotonicity of Upstream Spatial Weighting with Fully-Implicit Temporal Weighting", "Section 2.9 Boundary Conditions for Transport Coupled to Flow", "Analyze the accuracy of various contaminant transport weighting schemes and their impact on numerical model performance.", "Apply boundary conditions for contaminant transport coupled with groundwater flow and assess material balance errors to ensure reliable numerical simulations.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "The total maximum bonus points that can be earned across all five assignments is five.", "Students can earn bonus points by actively participating in discussions or helping their peers understand the course material and assignments.", "Explaining a challenging concept to peers in a collaborative study session.", "A maximum of five contributions will be allowed per assignment."]}, {"course_id": 88, "course_code": "GEOG 209", "course_name": "GEOG209 - Hydroclimatology (0.50)", "term_name": "List 2", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 10:20AM EV2 2002", "Dr. Richard Petrone                                                                                       Winter 2025", "Lab Co-ordinator:", "TBA", "An introduction to the fundamental processes governing climate and hydrological systems and the links between them.", "It starts with a discussion of basic atmospheric and hydrological processes and traces the flow of energy and water between the earth's surface and the atmosphere.", "This course provides students with a thorough background of the fundamental processes governing the climate and hydrological systems, and the links between them.", "The course first reviews fundamental atmospheric and hydrologic processes, and traces the flow of energy and water between the Earth’s surface and the atmosphere.", "Through the use of group activities students will be given the opportunity to gain experience manipulating real hydrological and meteorological data and instrumentation.", "This course will serve as an introduction to near-surface hydroclimatic processes, their feedbacks and climate change, forming essential background for upper level courses in climate change, hydroclimatology and environmental sciences and studies in general.", "The fundamental knowledge and skills developed in this course will provide students with the basis to appreciate and understand the natural hydrologic and climate systems.", "It also provides the required foundation for advanced courses in climatology and hydrology.", "The objective of this course is to provide students with the background to further their interests in weather and climate, and provide the theoretical foundations for upper level science and management courses.", "To identify the key boundary layer processes that drive the hydroclimate system.", "To identify and evaluate the characteristics of different land-use types and ecosystems that drive their hydroclimatic regimes.", "Introduction to Hydroclimatology", "Evapotranspiration", "Climates of Natural Surfaces and Vegetation Effects", "Floods and Drought", "Ecology – Hydroclimate Linkages – Water and Carbon Exchange", "Landuse Change and Hydroclimatic Effects", "SVAT modelling", "Tutorial rooms and groups will be determined in the first week of lectures.", "Feb. 3              Lab #2 – Streamflow & Climate assignment introduced & Lab #1 handed in", "March 10         Lab #3 – Energy Balance & Evapotranspiration assignment introduced and Lab #2 handed in", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 89, "course_code": "GEOG 305", "course_name": "GEOG305 - Fluvial Geomorphology (0.50)", "term_name": "List 2", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["RCH 211", "Emphasis on concepts related to fluvial processes, river mechanics, the relationship between environmental change and river regime.", "Fluvial geomorphology is the scientific study of river landforms and the processes that create them.", "A working knowledge of fluvial processes has important practical environmental science, watershed management and engineering applications and is relevant to many other fields of environmental enquiry such as environmental engineering, watershed planning, source water protection, forestry, and risk management.", "This course will examine a range of physical and chemical processes that create micro and macro-scale landforms over a range of spatial and temporal scales.", "Implications of these processes for environmental management in the context of environmental change will be considered.", "To understand basic fluvial geomorphic processes and their role in landform development and change", "Why study rivers?", "Sept 16              Landscapes and Rivers", "Inputs, outputs and storage", "Types of systems", "Fluvial system variables", "Spatial and temporal scales", "Concept of equilibrium", "Feedback, thresholds and equilibrium – Southern Rockies case study", "Flow generation and hydrological pathways", "Storm hydrograph and drainage basin response", "Discharge Measurement and Streamflow Analysis", "Floods", "Bankfull discharge", "Flood magnitude and frequency", "Regional flood frequency curves", "Rills and gullying", "Soil erosion models", "Modes of sediment transport in rivers", "Sediment storage and delivery ratio", "Flow in river channels", "Driving and resisting forces", "Channel parameters", "Concept of flow continuity", "Flow, channel and boundary resistance", "Subcritical, critical and supercritical flow", "Boundary layer", "Concept of stream power", "Work, energy and stream power", "Erosion in bedrock channels", "Erosion in alluvial channels", "Sediment supply and transport rates", "Driving variables", "Boundary conditions", "Nature of change", "System response", "https://uwaterloo.kanopy.com/video/return-river-0", "Dec 2                  Impact of climate change on river systems", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 91, "course_code": "GEOG 381", "course_name": "GEOG381 - Advanced Geographic Information Systems (0.50)", "term_name": "List 2", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Advanced Geographic Information Systems Winter 2025", "08:30AM - 10:20AM AL 124", "Email:                     dtrobins@uwaterloo.ca", "Email:                     hayden.lam@uwaterloo.ca", "Students learn theoretical and operational approaches to advanced spatial analysis using geographical information systems.", "Emphasis is placed on the use of automation procedures using models and programming to address a variety of topics that may include but are not limited to digital terrain modeling, suitability analysis, network analysis, and cell-based models.", "Understand the components of multi-criteria analysis and how to operationalize them using spatial data and software or computer code", "Interpret and create methods for automation of spatial data management, manipulation, and analysis", "Recognize and critique ways to analyse results from multiple outcomes (e.g., sensitivity analysis)", "Communicate when statistical and non-statistical techniques can be used to aid human decision-making about location suitability or susceptibility", "The lecture will be used to introduce the theory and concepts behind advanced GIS methods as well as to demonstrate techniques that will aid the completion of lab assignments.", "Feb 13 Visual Scripting and Model Builder", "7  Feb 27 Sensitivity Analysis", "Notice of Recording", "Community of Learners", "A goal for this course is that we shall all contribute to a climate that promotes a Community of Learners.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "This course includes the independent development and practice of specific skills, such as analyzing spatial data, summarizing data for reporting results, or putting together statistical models.", "Library for research-based assignments", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 97, "course_code": "PLAN 478", "course_name": "PLAN478 - Transit Planning and Operations (0.50)", "term_name": "List 2", "program_name": "Environmental Engineering", "program_id": 60, "major_id": 2, "major_name": "Environmental Engineering (Bachelor of Applied Science - Honours)", "topics": ["Transit Planning and Operations Winter 2025", "08:30AM - 09:50AM RCH 103", "02:30PM - 03:20PM", "The historical evolution of transit in cities; the technological innovations which made transit possible; and transit mode definitions.", "System operational characteristics are defined and quantitative measures of effectiveness are introduced.", "Methods for selecting appropriate transit modes are covered.", "The focus of this course is on the use of quantitative techniques to analyse and solve problems arising in the planning, design, operation and management of urban public transportation systems.", "Topics include an introduction to public transportation modes, transit performance analysis, fleet sizing and route design; control of transit operations, and paratransit planning, scheduling and dispatching.", "The course also covers various transit modelling issues arising in the Advanced Public Transportation Systems that aim at maximising transit system efficiency and reliability using emerging technologies such as global positioning systems (GPS), electronic fare payment, and automatic passenger counters and pre-trip/en-route passenger information systems.", "The historical evolution of transit in cities; the technological innovations which made transit possible; and transit mode definitions.", "System operational characteristics are defined and quantitative measures of effectiveness are introduced.", "Methods for selecting appropriate transit modes are covered.*eligible for MES", "Classify urban transportation modes by right of way, technology, and service types", "Compute and graph quantitative relationships, including vehicle dynamics and time-space diagrams", "Determine fleet size requirements and schedules for a given route/line or a set of routes/lines", "Understand the range of approaches for estimating transit ridership", "Select the optimal mode for a transportation route based on vehicle characteristics, planning contexts, travel forecasts, and economic factors", "Design a basic transit network with efficient transfers and schedules", "Introduction and History of Public Transit", "Transportation and Transit Planning", "Travel Demand Modeling", "Transit System Characteristics and Performance", "Scheduling", "Network Structures", "Transit System Financing", "The Future of Public Transit", "Submission requirements will be specified for each assignment.", "This course includes the independent development and practice of specific skills, such as evaluating transit data, planning transit routes, and estimating transit ridership.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 0, "course_code": "BIOL 110", "course_name": "BIOL110 - Biodiversity, Biomes, and Evolution (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Labs begin the week of **Sept. 9**", "(Any issues in laboratory should contact Dr. Wolff)", "Monitor LEARN for important information", "A survey of organisms that inhabit a range of aquatic and terrestrial ecosystems (e.g., coral reefs, lakes, forests).", "Evolutionary and ecological frameworks will be used to explore how organisms diversify and are considered distinct species.", "The laboratory for this course is integrated with the lecture (unlike some of your other first year courses) - you will need to be sure to read the lab exercises before attending, and come prepared for our outdoor labs where appropriate shoes and clothing are necessary for the weather.", "I teach courses in ecology, evolution and genetics.", "I have been teaching evolution and ecology at the University of Waterloo for 7 years, and I hope to share with students my enthusiasm for phylogenetics.", "List themes and characteristics that differentiate the major groups of eukaryotes.", "Identify specific animals that facilitate and/or endanger human society.", "Construct and evaluate phylogenetic trees using parsimony", "Introduction", "Phylogeny and the modern view of biological relatedness", "Ecosystems and Resource Flux", "**Oct. 28  Midterm**", "Concepts in Diversity", "Activities will include using microscopes and drawing what you see, dissections of preserved animals, and collecting benthic invertebrates from the local stream and identifying them using pictoral keys.", "Note: You can also choose to do neither and forego the bonus mark altogether, as this is voluntary.", "Participation in Research Study", "Reminder, as participation in this study is voluntary, and it is a bonus mark, students may also decide to not do either activity and forego the bonus mark altogether.", "Notice of Recording", "In the case of an unwritten final exam, your course mark will be entered as DNW (32% for calculation of overall average)."]}, {"course_id": 2, "course_code": "BIOL 220", "course_name": "BIOL220 - Introduction to Plant Structure and Function (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Plant Structure and Function Winter 2025", "11:30AM - 12:20PM RCH 101", "S. Schoor", "I will make my best effort to respond to emails within 24 hrs.", "An introduction to plant diversity, and the anatomy and physiology of vascular plants.", "Understand the importance of the relationship between plants and humans in the environment and appreciate the species richness and diversity of plants", "Recognize and identify various cell types and how they account for the structure and function of tissues and organs", "Plant Evolution: Structure and Reproduction", "Focus will be applied to the adaptive strategies employed by algae to move from water to land, the development of complex tissues and organs and the role of reproduction strategies in plant success.", "Cellular composition of plant tissues and what role they play in their function will be studied; with particular interest in the relationship between vascular tissue and water transport.", "Additionally, students will study how hormones and growth regulators regulate plant development, tropic movement and plant response to biotic and abiotic stressors, as well as learn of their many uses in agriculture.", "Week 1 Jan 6 (1) Introduction & The Plant Cell (Ch 1,3) No labs this week", "Laboratory Mark Distribution", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline)."]}, {"course_id": 3, "course_code": "BIOL 239", "course_name": "BIOL239 - Genetics (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["11:30AM - 12:20PM", "10:30AM - 11:20AM STC 1012", "You can!", "Chromosomal mechanisms in mitosis and meiosis.", "Natural selection and the evolution of genetic systems.", "Describe the fundamentals of gene structure, function and transmission in prokaryotic and eukaryotic cells and organisms.", "Describe the various ways mutations can arise and how mutations may affect gene expression and phenotypic outcomes.", "Describe recombinant DNA technology in bacteria and its role in biotechnology.", "Effectively work with others, discussing, evaluating, and communicating genetics concepts and synthesizing ideas in a group.", "Readings", "textbook 1.1-1.2", "Mendelian genetics and probability", "Modification of Mendelian ratios", "textbook 3.2-3.3, 4.2-4.4, 15.1", "Mitosis, meiosis, and chromosome numbers", "DNA and the genetic code", "textbook 9.2-9.3", "T4: Mitosis and meiosis", "DNA cloning", "T5: Testing genetic ratios", "Cancer genetics", "T9: Population genetics", "Exam period", "- write the final exam and achieve a grade of at least 50% on the cumulative test and exam section", "Online learning activities: These activities are designed to test your knowledge of several important concepts explained by the lecture presentations in this course, and should be completed after the portion of the course when they are covered in lecture.", "They are all due toward the end of the term but can be completed as many times as you like to help you work on these concepts.", "Read the instructions carefully before attempting these as a completion quiz (in the quiz section) must also be completed to obtain credit.", "In this case, the weight of the missed submission will be transferred to the final exam.", "The dates affected and degree of incapacitation will be used to determine follow-up action."]}, {"course_id": 4, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}, {"course_id": 5, "course_code": "BIOL 240L", "course_name": "BIOL240L - Microbiology Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["BIOL 240L", "BIOL 240L 001", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 002", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 003", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 005", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 006", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 007", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 008", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 010", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 012", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 013", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 014", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 015", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 017", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 018", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 021", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "Email: cduxbury@uwaterloo.ca", "View requirements for BIOL 240L", "Main Objective Obtain a a good understanding of the basic techniques used in a microbiology lab to study and handle microorganisms safely.", "Apply staining techniques to differentiate and observe types of bacteria", "Appreciate proper aseptic technique while handling microorganisms in the lab and inoculating media", "Properly prepare slides for examination under the microscope", "Prepare and use dilutions to isolate pure cultures and to enumerate the number of organisms in a culture", "Exp 3: Basic Bacterial Shapes", "Exp 12: Pour-Plate Method", "Exp 14: Aseptic Technique in Pipette Handling", "Exp 15: Standard Plate Count Method", "Exp 17: Bacterial Flagella Stain", "Exp 19: Miniprep of Plasmid DNA", "Exp 20: Analysis of Plasmid and Genomic DNA", "Exp 21: Metabolic Activities of Bacteria", "Exp 30: Evaluation of Chemical Antimicrobial Agents", "Exp 31: Antibiotic Sensitivity Testing", "Exp 32: Isolation of Bacterial Mutants", "TBA", "Extra precautions must be taken to ensure the safety of yourself and those around us!", "Always be prepared for a quiz; they could be given at any time and they are cumulative!", "To make this happen, a flowchart for each experiment is required.", "The flowchart is similar to a \"map\" of your experiment and should be sufficiently detailed and include the most important information about the experimental steps and possible time management.", "The flowchart should NOT be a reiteration of the \"METHODS\" section in your manual.", "Please see Flowchart Help Sheet for a flowchart example.", "Your professionalism mark will be assigned by your TAs and will be assessed on the basis of your performance in the laboratory, attendance, and your degree of skill in microbiological techniques.", "More information will be given closer to date.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 8, "course_code": "BIOL 354", "course_name": "BIOL354 - Environmental Toxicology (0.50)", "term_name": "Required Courses", "program_name": "Environmental Sciences", "program_id": 61, "major_id": 1, "major_name": "Environmental Sciences - Ecology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Environmental Toxicology Fall 2024", "02:30PM - 05:20PM B2 351", "07:00PM - 09:50PM B2 351", "02:30PM - 05:20PM B2 351", "02:30PM - 05:20PM B2 351", "07:00PM - 09:50PM B2 351", "Please bring a reusable mug if you'd like a cup of tea.", "An introduction to the basic theories, principles, and techniques of environmental toxicology.", "A comparative study of the effects of specific groups of toxicants and how they can affect molecular, cellular, and organismal processes will be explored in lectures and through laboratory experiments.", "Know the basic theories, principles and techniques of environmental toxicology.", "Understand how different toxicants move from source to receptor, the concept of dose-response relationships and toxicokinetics.", "Understand the process of assessing toxicity using various toxicity test methods and the understand the physiological impacts of various classes of toxicants.", "Know the scientific terminology and knowledge base necessary to effectively communicate the impact of toxicants on target organisms through an in-person group presentation.", "Follow safety procedures as they relate to working in a toxicology laboratory and handling samples and organisms in the lab.", "Conduct toxicity tests using model organisms to assess the effects of pollutants.", "Describe how bioassays are used to estimate toxicity in environmental toxicology.", "Interpret and analyze the results of toxicity experiments, draw appropriate conclusions supported by the data in the format of a laboratory report.", "Week 2 Dose-Response Relationships & Toxicity Test Methods Chapter 4 Sections 4.3.2.", "no grade**", "no grade**", "Week 8 Survey of Toxic Substances - Inorganic & Organic Contaminants", "2,4-D", "2,4-D", "**", "Official Grades and Course Access", "Few are available on loan in the lab (first come, first served)", "WHMIS training checked for completion during the first lab Yes", "At the discretion of the instructor, you may be permitted to take a make-up exam.", "The make-up exam may be of different format than the missed examination (e.g. oral examination for the make-up).", "The Lecture Minute Paper activity will be followed by a discussion Indigenous Learning Circles that provide an opportunity for relational and reciprocal learning, fostering critical thinking, problem-solving skills, increased engagement, and community building.", "Lab Activities & Assessments", "Notice of Recording", "Don’t waste your time with these requests!", "Library for research-based assignments"]}]