[{"course_id": 73, "course_code": "EARTH 458", "course_name": "EARTH458 - Physical Hydrogeology (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "Field Methods in Hydrogeology Fall 2024", "08:30AM - 09:50AM DWE 3519", "An introduction to the principles and theories of mineral deposit genesis.", "Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered.", "View requirements for EARTH 458L", "Applied geophysics provides geoscientists with a wide-range of non-invasive methods for characterizing the Earth's interior.", "This course is an introduction to the physical principles underlying field acquisition, processing, and data interpretation for commonly used applied geophysical techniques (seismic, electrical, electromagnetic induction, gravity, and magnetic methods).", "This course is not only pertinent for geoscientists but also for engineers and others interested in learning how physics can be used to explore the Earth's interior or perform non-destructive testing.", "Near-surface geophysics is used to characterize the shallow subsurface for a wide-spectrum of applications.", "This application-oriented course covers current methodology in near-surface geophysics, including electrical, electromagnetic, ground penetrating radar, seismic refraction, and well-logging methods.", "Techniques for geophysical data acquisition and interpretation are studied and applied to field data.", "Examples of the application of geophysical techniques to archeological, forensics, geotechnical, glaciology, and hydrogeological problems are examined.", "View requirements for EARTH 461", "A field-oriented course on current methodology in the general area of geotechnical or engineering geophysics as applied to environmental problems.", "Typical topics covered: well logging and time domain electromagnetic surveys for groundwater supply; magnetic and terrain conductivity surveys for waste materials; ground penetrating radar applications to stratigraphy and contamination; streaming potential surveys of dam leakage.", "A pre-lab quiz must be completed before attending each field lab.", "Labs will be completed in groups with field data recorded in field books or datasheets.", "These data will be used to a complete individual lab assignment.", "This site contains over 100 groundwater monitoring wells.", "Field lab activities involve:", "(3) Measurement of in-situ hydraulic conductivity using single-well response tests", "Each lab will provide you with a unique dataset that you will use to develop a conceptual site model of the local groundwater flow system.", "• Properly construct and interpret soil core logs using United Soil Classification System, and make lithostratigraphic interpretations using geophysical logs", "• Assess and interpret water level measurements through the construction of water table maps and flownets", "• Interpret single-well response tests including falling and rising head (slug) tests to determine in-situ hydraulic conductivity", "• Interpret hydraulic pumping tests to determine aquifer transmissivity and storage parameters and assess water resource vulnerability", "Each module will contain a series of recorded lecture slides and video demonstrations reviewing core concepts and guidelines for the upcoming field lab.", "Please include “Earth 458L” in the subject line of all e-mail communications as well as your Full Name and Student ID# in the text of the email.", "Hydrogeological equipment to make measurements and collect data (temporary use)", "Specialized hydrogeological software to complete certain assignments", "Datasheet to record field data", "Other data should be recorded in your field books and distributed to your group members as needed.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Notice of Recording", "Participation in Field Labs:", "These quizzes are designed to keep you on schedule and prepare you for the in-person field lab and assigned activities.", "There will be a 48-hour grace period to finalize the submission of your assigned activities without incurring any late penalty."]}, {"course_id": 77, "course_code": "ENVE 577", "course_name": "ENVE577 - Engineering for Solid Waste Management (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Attention is given to the engineering design and operational aspects of the control of generation, storage, collection, transfer and transport, processing and disposal of solid wastes in landfill site.", "Design of natural attenuation sites and system reliability features for landfill designs.", "Topics include waste characterization, collection systems, transportation, treatment technologies, landfill design, recycling, waste-to-energy systems, greenhouse gas impacts, and policy frameworks.", "Understand the composition and generation rates of solid waste", "Analyze waste collection, segregation, and treatment methods", "Design components of solid waste management systems (e.g., landfills, composting systems)", "Explore innovative technologies for resource recovery, recycling, and waste-to-energy processes", "Module 1: Introduction to Solid Waste Management", "Definition and types of solid waste", "Examples of waste management systems from different regions", "Calculate the waste generation rate (WGR) per capita for a given dataset and project future WGR trends using population growth models", "Jan 9 Waste Generation and Characteristics", "Physical, chemical, and biological characteristics", "Typical components and composition of waste", "Hazardous wastes and recycling streams", "Introduction to waste composition audits", "Calculate the environmental impact using simplified LCA metrics for waste scenarios", "Jan 16 Lifecycle Analysis and Waste Hierarchy", "Jan 21   Waste Collection Systems", "Door-to-door collection", "Community bins and transfer stations", "Equipment used in collection", "Estimate transportation costs for different modes of waste transfer (e.g., by truck, rail) based on distance, fuel costs, and waste tonnage", "Operations and routing strategies", "Design and function of transfer stations", "Jan 28   Temporary Storage Solutions", "Design of storage bins and containers", "Safety considerations", "Calculate the capacity needs of storage containers", "based on waste generation rates and collection frequency", "Role of public awareness", "Estimate biogas yield from anaerobic digestion of organic waste using stoichiometric calculations", "Process design and optimization", "Applications and challenges", "Incineration: principles and applications", "Pyrolysis and gasification", "Calculate energy recovery from the incineration of municipal solid waste using calorific values", "Design of Material Recovery Facilities (MRFs)", "Challenges in recycling", "Technical, environmental, and economic considerations", "Assess the efficiency of a WTE plant using energy balance equations", "Definitions and frameworks", "Composting and anaerobic digestion as mitigation techniques", "Site selection and design", "Leachate and gas management", "Design a landfill’s leachate collection system based on given permeability and rainfall data", "Operational strategies", "Post-closure monitoring and land reuse", "Environmental and health impacts", "Strategies for remediation", "*TBD", "Mar 13 Analysis and Design of Solid Waste Management Infrastructure", "Design and operation of materials recovery facilities", "Overview of thermal methods and biological processes", "Mar18                          Digital and Smart Solutions for SWM", "Data analytics for waste tracking", "*TBD", "Tools and methodologies", "Challenges and solutions", "Innovations in SWM policies", "** Note:", "Design Project 25%", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, such as practical analysis and critical thinking.", "Library for research-based assignments"]}, {"course_id": 80, "course_code": "ME 452", "course_name": "ME452 - HVAC Load Analysis and Design Fundamentals (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "HVAC Load Analysis and Design Fundamentals Winter 2025", "11:30AM - 12:20PM RCH 305", "Email: hasan.habib@uwaterloo.ca", "Duct design and fan selection.", "Heating and cooling load calculations.", "Infiltration and exfiltration.", "B. Be able to fully design an air conditioning and ventilation system", "C. Be able to perform heating and cooling load, and preliminary energy use calculations for buildings", "D. Have developed the ability to apply their knowledge in a real-world setting (practical experience)", "E. Be capable of communicating effectively with industry professionals and clients", "F. Have developed the skills to research and interpret information needed to remain current in the field", "Module 1: Introduction to HVAC:  History, ASHRAE, Unit Systems (chap.", "Module 2: Air Conditioning and Ventilation: Fundamental Concepts of HVAC/Air Conditioning Systems (chap.", "3), Fans and Air Distribution Systems (chap. 16).", "A tentative checklist of material to be reviewed each week will be posted in Learn.", "Midterm Exam: will be held in two parts during scheduled lecture time.", "You can also present case studies of interesting buildings or even a biographical review of someone who made an impact to HVAC.", "A) Develop an appreciation and understanding for the various codes, standards, and guidelines that determine HVAC design practices X    X", "B) Fully specify and design an air conditioning and ventilation system   X", "C) Perform heating and cooling load, and preliminary energy use calculations for buildings     X", "F) Develop the skills to research and interpret information needed to remain current in the field X", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 91, "course_code": "NE 352", "course_name": "NE352 - Surfaces and Interfaces (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:00AM - 11:20AM RCH 105", "08:30AM - 09:50AM RCH 105", "Surfaces and interfaces in microelectronics and nanofabrication.", "Capillary phenomena and molecular self-assembly.", "Describe the origin of a variety of interfacial phenomena", "Calculate surface/interfacial forces and potential energies of micro- and nano-scale systems", "Design experiments to measure interfacial tension, including the selection of appropriate tools", "Analyze experimental data to determine surface characteristics", "Design surfaces to create stable or unstable dispersions", "4 Sept 25th 3 Electric double layer: Poisson-Boltzmann, Gouy-Chapman-Stern theories", "10 Nov 6th 6 Polymers and surfaces, adsorption phenomena, stabilization vs. flocculation mechanisms", "13 Nov 27th 8 Surface area and pore-size analysis", "I encourage you to buy one of these as it will be helpful for future reference.", "Intermolecular and Surface Forces, By Jacob N. Israelachvili, 3rdedition", "Intellectual property includes items such as:", "Graduate Attribute Program Indicators", "A knowledge base for engineering: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "1a Demonstrate understanding of concepts in mathematics.", "1b Demonstrate understanding of concepts in natural science.", "1c Demonstrate understanding of engineering fundamentals.", "1d Demonstrate understanding of specialized engineering knowledge.", "2. Problem Analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "3a Create investigative studies of complex engineering problems.", "3b Gather information from relevant sources to address complex engineering problems.", "4. Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "4a Define design requirements and specifications for complex, open-ended engineering problems.", "4b Critically evaluate and compare design choices.", "7. Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "8a Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Impact of Engineering: An ability to analyze social and environmental aspects of engineering activities.", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "10a Identify ethical and unethical behavior in professional situations.", "10b Identify how an engineer is accountable to multiple stakeholders in engineering practice.", "Life-long Learning: An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge.", "12a Identify gaps in their knowledge, skills and abilities."]}, {"course_id": 3, "course_code": "CHEM 125L", "course_name": "CHEM125L - Chemical Reaction Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and to modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Section", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- analysing real world samples and", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 13, "course_code": "CHEM 254", "course_name": "CHEM254 - Introductory Chemical Thermodynamics (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["08:30AM - 09:20AM", "RCH 306", "B. Power", "Instructor: Bill Power", "An introduction to the first, second, and third laws of thermodynamics and the application of these laws to ideal systems, mixtures, and chemical reactions.", "Thermodynamic principles are used to study changes in state, including phase changes, and to establish the link between the equilibrium constant and the properties of the substances involved in a chemical reaction.", "This course is a basic introduction to thermodynamics with emphasis on applications in chemistry.", "The course provides the necessary background to study changes in state of many physical and chemical systems.", "Define and apply the four laws of thermodynamics", "Identify, describe and ultimately design a variety of physical and chemical systems through their internal changes and/or interactions with their surroundings", "Quantify internal energy U, heat q, work w, enthalpy H, entropy S and Gibbs energy G in that same variety of physical and chemical systems", "Predict spontaneous change in systems of varying complexity", "Explain and quantify transformations involving both pure substances and mixtures using thermodynamic concepts", "There will be online and in-class assignments, on a rotating interval of about two weeks.", "It will occur in a 2.5 hour time slot sometime between April 9 and April 25 (I have no control over this scheduling).", "I will have a copy on reserve in the library (https://www.reserves.uwaterloo.ca/ares/ares.dll?Action=10&Form=50&Value=222108) and the price listed here is for a one-year electronic subscription.", "In addition, I have prepared a number of narrated powerpoint lectures, which I hope you will find useful in learning the material.", "Each lecture also has notes that provide written transcripts of what I am speaking, in case that helps you to learn some of the terms.", "One will be tutorial assignments which you will complete the first half of the problem individually, then work on an extension of the problem in groups of 4.", "CHEM 254 - Winter 2025 | General | Microsoft Teams", "I will provide any materials there as well as on LEARN, just in case one or the other has access issues.", "Four of the assignments, involving both individual and group work in a team-based learning (TBL) format, should help you to be able to assess different thermodynamic systems and learn to use the appropriate thermodynamic tools.", "The other four assignments, to be completed individually and much broader in scope and effort required, will help you to apply those skills to more complex and realistic physical and chemical systems.", "These may cover several chapters at a time.", "This course includes the independent development and practice of specific skills, such as problem solving in a chemical and scientific context.", "Library for research-based assignments"]}, {"course_id": 20, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 22, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 28, "course_code": "PHYS 112L", "course_name": "PHYS112L - Physics 2 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Sean Dougherty", "Aney Kapadia", "Kayra Erisoglu-Akyildiz", "jbschrie@uwaterloo.ca", "s2doughe@uwaterloo.ca", "Course Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"'", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 3 - Circuits", "Experiment 4 - Circuits", "Experiment 5 - Circuits", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 29, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 30, "course_code": "PHYS 122L", "course_name": "PHYS122L - Waves, Electricity and Magnetism Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 2 - Circuits", "Experiment 5 - Magnetic Fields of a Coil", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 34, "course_code": "CHEM 267L", "course_name": "CHEM267L - Organic Chemistry Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Answers can be expected within 24 hours.", "Experiments include the reduction of vanillin; an electrophilic aromatic substitution; the synthesis of a fragrant ester using Fischer esterification and preparation of a fluorescent laser dye, 3-acetyl-7-(diethylamino)-2H-1-benzopyran-2-one.", "The organic chemistry laboratory provides students with opportunities to carry out some of the organic synthesis reactions encountered in CHEM 267 in a real-world experience.", "Additionally, students will become versed in several basic organic chemistry laboratory techniques including: liquid-liquid extraction, distillation, one and two solvent recrystallization and melting point determination, to name a few.", "Be proficient with basic organic laboratory techniques including selecting proper glassware, measuring small and large quantities of solids and liquids, designing the setup required for simple synthetic reactions, filtration, and basic characterization.", "Understand and be able to design and execute a liquid-liquid extraction processes for the separation of ionizable acidic, ionizable basic, and non-ionizable (neutral) substances.", "Scheduling issues", "Fillable form online for Möbius support", "Laboratory performance marks will be given by the Teaching Assistants and Lab Instructor and averaged for each in-person lab period.", "To receive 10/10 in performance this term you must show self-sufficiency by either replacing empty acetone bottles at the sink, refilling the DI water, letting your TA know the bottles at your workstation need a top-up and cleaning shared areas beyond your own.", "This is not directly the case; we do expect students to need a lot of clarifications when working in the lab for the first time.", "Laboratory Worksheets and Reports", "General Policies", "Aside from LEARN, we will use various software to facilitate the delivery of the laboratory.", "Important note: Since the manual is printed months before delivery of the lab, we may need to make corrections during the term."]}, {"course_id": 42, "course_code": "CHEM 333", "course_name": "CHEM333 - Metabolism 1 (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["09:30AM - 10:20AM DWE 2527", "First we will cover general principles of thermodynamics and high energy compounds ( NTPs, NAD(P)+ and fats).", "And some general principles of the energy metabolism and the regulation of metabolic pathways.", "understand the logic of the pathways by being able to draw the chemical structures of the intermediates in these pathways.", "draw the chemical mechanisms of the enzymes involved in these metabolic pathways and to use that information to apply it to new systems.", "understand the interconnection of these pathways and the basis, of the regulation and coordination of these pathways.", "week ART Reading VVP reading and practice problems MVH", "1: Introduction to metabolism, review of Energy Metabolic Energy (410-429)", "6: Electron transport and oxidative phosphorylation Energy: Electron Transport & Oxidative Phosphorylation (430-471)", "10: Integration and coordinated regulation of the pathways metabolic disorders Signalling (828-855)", "Biochemistry Free for All https://biochem.oregonstate.edu/undergraduate/educational-resources Yes", "Fundamentals of Biochemistry 5th edition by Voet, Voet and Pratt Yes", "Online quizzes   10% of final mark These will be a combination of multiple choice and written answers."]}, {"course_id": 46, "course_code": "CHEM 357", "course_name": "CHEM357 - Physical Biochemistry (0.50)", "term_name": "Approved Courses List", "program_name": "Chemistry", "program_id": 26, "major_id": 1, "major_name": "Chemistry (Bachelor of Science - Honours)", "topics": ["Physical Biochemistry Winter 2025", "10:30AM - 11:20AM RCH 307", "B. Power", "Instructor: Bill Power", "The use of diffusion, ultracentrifugation, osmotic pressure, electrophoresis and X-ray diffraction to study the properties of biopolymers.", "This course is meant to provide you with a basic introduction to physical chemistry as applied to the life sciences with emphasis on applications in biochemistry.", "This course will cover the basics of thermodynamics and their applications to biological molecules and systems, their transport properties, chemical and enzyme kinetics, and physical techniques used to establish and investigate the structures of biological macromolecules.", "I will aim to provide you with all the background necessary to cover the many topics in this course, from entropy and thermodynamic principles from the 18th century to modern applications such as AI which resulted in half of the the 2024 Nobel Prize in Chemistry going to Google's DeepMind leaders Demis Hassabis and John Jumper for their development of AlphaFold, a protein structure database (of 220 million structures!).", "In return you should have some familiarity with the basics of biochemistry and biological structures and terminology, as well as some comfort working with derivatives, including partial derivatives, integrals and differential equations.", "Understand the four laws of thermodynamics and their applications to biological systems", "Understand the importance of Gibbs free energy and chemical potential in describing physical and chemistry transformations", "Understand the basics of chemical kinetics and rate laws and mechanisms", "Be able to characterize enzyme kinetics using the Michaelis-Menten description and describe competition and inhibition in such mechanisms", "Know how to apply and interpret structural tools such as optical and NMR spectroscopy, X-ray diffraction and computational tools to biological macromolecules", "There will be online and in-class assignments, on a rotating interval of about two weeks.", "It will occur in a 2.5 hour time slot sometime between April 9 and April 25 (I have no control over this scheduling).", "Weeks 1 to 3:   Thermodynamics, its Laws and its Applications", "Week 10:            Biomolecular Structure; Optical Spectroscopy", "Weeks 11 to 12: NMR Spectroscopy; X-ray Diffraction; AI Methods and AlphaFold", "We will cover much of this book, though perhaps not in detail in some sections, and it should be a useful resource.", "I will have a copy on reserve in the library (https://www.reserves.uwaterloo.ca/ares/ares.dll?Action=10&Form=50&Value=222107) and the price listed here is for a one-year electronic subscription (https://www.pearson.com/en-ca/subject-catalog/p/physical-chemistry-principles-and-applications-in-biological-sciences/P200000006771/9780137612826).", "This course includes the independent development and practice of specific skills, such as problem solving in a chemical and scientific context.", "Library for research-based assignments"]}, {"course_id": 3, "course_code": "CHEM 125L", "course_name": "CHEM125L - Chemical Reaction Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and to modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Section", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- analysing real world samples and", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 10, "course_code": "CHEM 254", "course_name": "CHEM254 - Introductory Chemical Thermodynamics (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["08:30AM - 09:20AM", "RCH 306", "B. Power", "Instructor: Bill Power", "An introduction to the first, second, and third laws of thermodynamics and the application of these laws to ideal systems, mixtures, and chemical reactions.", "Thermodynamic principles are used to study changes in state, including phase changes, and to establish the link between the equilibrium constant and the properties of the substances involved in a chemical reaction.", "This course is a basic introduction to thermodynamics with emphasis on applications in chemistry.", "The course provides the necessary background to study changes in state of many physical and chemical systems.", "Define and apply the four laws of thermodynamics", "Identify, describe and ultimately design a variety of physical and chemical systems through their internal changes and/or interactions with their surroundings", "Quantify internal energy U, heat q, work w, enthalpy H, entropy S and Gibbs energy G in that same variety of physical and chemical systems", "Predict spontaneous change in systems of varying complexity", "Explain and quantify transformations involving both pure substances and mixtures using thermodynamic concepts", "There will be online and in-class assignments, on a rotating interval of about two weeks.", "It will occur in a 2.5 hour time slot sometime between April 9 and April 25 (I have no control over this scheduling).", "I will have a copy on reserve in the library (https://www.reserves.uwaterloo.ca/ares/ares.dll?Action=10&Form=50&Value=222108) and the price listed here is for a one-year electronic subscription.", "In addition, I have prepared a number of narrated powerpoint lectures, which I hope you will find useful in learning the material.", "Each lecture also has notes that provide written transcripts of what I am speaking, in case that helps you to learn some of the terms.", "One will be tutorial assignments which you will complete the first half of the problem individually, then work on an extension of the problem in groups of 4.", "CHEM 254 - Winter 2025 | General | Microsoft Teams", "I will provide any materials there as well as on LEARN, just in case one or the other has access issues.", "Four of the assignments, involving both individual and group work in a team-based learning (TBL) format, should help you to be able to assess different thermodynamic systems and learn to use the appropriate thermodynamic tools.", "The other four assignments, to be completed individually and much broader in scope and effort required, will help you to apply those skills to more complex and realistic physical and chemical systems.", "These may cover several chapters at a time.", "This course includes the independent development and practice of specific skills, such as problem solving in a chemical and scientific context.", "Library for research-based assignments"]}, {"course_id": 17, "course_code": "CS 116", "course_name": "CS116 - Introduction to Computer Science 2 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Computer Science 2 Winter 2025", "Monday -", "Monday", "07:00PM - 08:50PM", "E. Dupont", "E. Dupont", "E. Dupont", "10:00AM - 11:20AM MC 4045", "02:30PM - 03:20PM", "08:30AM - 09:20AM", "09:30AM - 10:20AM MC 4042", "10:30AM - 11:20AM MC 4060", "11:30AM - 12:20PM MC 4060", "02:30PM - 03:20PM", "This course builds on the techniques and patterns learned in CS115 while making the transition to use of an imperative language.", "Use higher-order functions to improve the readability and efficiency of programs", "Describe the basic memory model for mutation of basic types, lists, and objects in Python", "Distinguish between constant, linear, quadratic, and exponential running times of algorithms", "Write useful Python programs using console and file input and output for practical tasks", "All times are given in Eastern Time.", "Important!", "In order to maintain a level of success in the course, students should not miss the completion of any modules.", "Students should check their basic tests email to ensure that the code meets the specification exactly.", "Please make sure you do this often!", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 18, "course_code": "CS 234", "course_name": "CS234 - Data Types and Structures (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Data Types and Structures Fall 2024", "MarkUs problems Email IAs at the course account", "Microsoft Teams problems Email ISG Coordinator Scott King", "Missed assignment or quiz Email ISG Coordinator Scott King", "Extenuating circumstances Email ISG Coordinator Scott King", "Error in mark entry Email IAs at the course account", "ISG Coordinator", "Introduction to commonly used data types, including lists, sets, mappings, and trees.", "This course introduces widely used and effective methods of data organization, focusing on data structures, their algorithms, and the performance of these algorithms.", "Students who successfully complete the course can use these tools to design and develop efficient programs for a wide variety of applications.", "Audience", "Students wishing to understand how choices made in program design can significantly affect performance and how to make these choices", "Highly recommended for students in Information Management and similar fields and for those in the Mathematics/Teaching plan", "The initial topics in CS 234 will present some material new to those coming out of CS 116 (but covered in CS 136) and some material new to those coming out of CS 136 (but covered in CS 116).", "Co-requisites: None", "Rance D. Neśaise, Data Structures and Algorithms Using Python, Wiley, 2010", "Describe basic quadratic sorting algorithms, such as Selection Sort or Insertion Sort.", "Given a simple, well-specified computational task, write a program in a high-level imperative language (e.g., Python, C, or Java) and generate appropriate test cases.", "Use as appropriate simple types, built-in compound types and control idioms, such as selection, iteration, and recursion.", "Explain the benefits of using abstract data types (ADTs) and data structures, and more generally, the concepts of modularity and data hiding, in solving problems in a wide variety of application areas.", "Understand the differing points of view of the user and provider of an ADT and the use of an interface to communicate between views.", "Explain and use the concepts of asymptotic running time, order notation, worst-case, average-case, and best-case complexity, and lower and upper bounds.", "Given a simple algorithm written in pseudocode, determine and informally justify its asymptotic running time, as expressed in order notation.", "Explain the basic structure of memory, including the distinction between external and internal memory and the concept of paging.", "Explain the complexity of some common implementations of these ADTs.", "Given a well-specified computational problem, determine which (if any) ADTs would be suitable.", "Explain how specialized data structures can lead to efficient solutions to specific real-world problems.", "Topics: User and provider viewpoints, planning and coding stages, abstract data types, modularity and data hiding, ADT Multiset, pseudocode, memory model", "Topics: Best, worst, and average-case running times, order notation, algorithm analysis", "Topics: Graph terminology, ADT Undirected Graph, ADT Directed Graph, implementations, depth-first search, breadth-first search", "Topics: Average-case analysis, interpolation search, heuristics, hashing, bucket sort, radix sort", "Notice of Recording", "Should problems occur, your early drafts serve as backups in case of computer problems, and provide evidence of your having attempted to submit work before the deadline.", "Re-mark requests", "The subject should be \"Ax re-mark request\" for x the number of the assignment.", "In the body of the email, include the rationale for the re-mark and the parts of the question that need atttention.", "Exam policies and missed examinations", "Phone: 519-884-0000 extension 213", "In particular:", "Please inform of us these at the start of the course.", "Library for research-based assignments"]}, {"course_id": 20, "course_code": "MATH 106", "course_name": "MATH106 - Applied Linear Algebra 1 (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Applied Linear Algebra 1 Winter 2025", "Systems of linear equations.", "Introduction to vector spaces.", "We will see how to solve systems of linear equations using matrix methods before studying matrices as algebraic objects in their own right.", "Next, we will learn about the fundamental concepts of span, linear independence, and basis and learn how to determine whether a set is a subspace of Rn.", "After studying subspaces, we will study linear mappings, which map subspaces to subspaces.", "We will discuss the geometric interpretation of these mappings and study their fundamental subspaces.", "Finally, we will learn how to calculate the determinant of a matrix and use this knowledge to diagonalize square matrices.", "Provide a graphical and algebraic description of vectors, lines, and planes in R^n", "Model and solve mathematical and discipline-specific problems using systems of linear equations", "Perform basic algebraic operations on matrices", "Given a set of vectors in R^n, determine whether it is linearly independent, a spanning set of R^n, or a basis of R^n", "Given a basis and a vector in standard coordinates, use matrix methods to calculate its coordinate vectors", "Given a set in R^n, determine whether it is a subspace of R^n", "Given a mapping L: R^n --> R^m, determine whether it is linear", "Given a linear mapping, choose the appropriate algorithm find a basis for each of its fundamental subspaces", "Given a square matrix, calculate its determinant and provide a geometric interpretation of this value", "Communicate ideas and concepts relating to linear algebra using accurate mathematical language and notation", "Calculators", "Avoiding Academic Offences", "I am committed to creating a learning environment where diverse perspectives are recognized and valued as a source of strength.", "School-Life Conflict"]}, {"course_id": 22, "course_code": "MATH 128", "course_name": "MATH128 - Calculus 2 for the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["F. Dunbar", "Instructor: Fiona Dunbar", "Separable and linear first order differential equations and applications.", "Introduction to sequences.", "Parametric/vector representation of curves; particle motion and arc length.", "Polar coordinates in the plane.", "use integration techniques to solve linear first-order equations and improper integrals,", "visualize and approximate higher-order differential equations,", "interpret and derive power series representation of a function,", "use the concept of linear approximation and apply it to Taylor polynomials as well as use techniques for quantifying approximation error,", "understand the relationship between vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "If you are unable to acquire one of these calculators, you must contact your instructor in the first week or two of the course so an equivalent alternative can be identified and added to the exam proctors' list of permitted aids.", "This course includes the independent development and practice of specific skills, such as integration techniques, visualizing/approximating higher-order differential equations, deriving power series, linear approximation and applying to Taylor polynomials, using vector-valued functions, polar coordinates, and applications of integration to arc lengths.", "Library for research-based assignments"]}, {"course_id": 24, "course_code": "CHEM 237", "course_name": "CHEM237 - Introductory Biochemistry (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:20AM", "RCH 101", "10:30AM - 11:20AM RCH 101", "ESC 227", "Structure and properties of proteins and enzymes.", "develop a molecular level understanding of biological processes to achieve this the following learning outcomes will be", "in both qualitative and quantitative examples", "evaluate unknown thermodynamic parameters from given values of others.", "I equilibrium constants from standard free energy changes.", "qualitatively describe the composition of solutions of a weak acid or base as a function of pH.", "calculate the precise", "recognize the 20 amino acids that are commonly found in proteins and identify compounds derived from them", "calculate the charge on an amino acid side chain as a function of pH", "know the 4 levels of protein structure and the covalent and non covalent interactions that stabilize them", "explain how to purify proteins using the physical and chemical properties of the proteins", "determine the primary sequence of a protein given the appropriate data", "understand basic chemical kinetics and the application to biological systems", "determine the mechanism of inhibition of an enzyme using", "the structure of fatty acids and membrane lipids", "the structures of cell membranes and how the fatty acid composition of those membranes affects membrane structure and fluidity", "the structure of simple sugars and polysaccharides and the chemistry of the reactions in which they participate", "Suggested supplementary reading in \"Biochemistry Free for All\".", "Biochemistry free for all: Introduction Water and Buffers, pages 34-49", "VVP chapters 3 and 4.1", "Biochemistry free for all pages 53-70", "Appendix A.1 and A.2", "Chapter 4.2 and 4.3", "Biochemistry free for all.", "pp 74-108", "Week 6  Protein folding and Introduction to hemoglobin", "Chapter 4 - Biochemistry in focus", "Biochemistry free for all pages 128-141", "first kinetics Chapter 10 then mechanisms Chapter 9", "Biochemistry free for all pages 337-362", "Biochemistry free for all pp 190-217", "Biochemistry free for all pp 222-233", "Biochemistry free for all pp 287 - 312", "Notice of Recording"]}, {"course_id": 26, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 32, "course_code": "PHYS 112L", "course_name": "PHYS112L - Physics 2 Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "08:30AM - 11:20AM STC 3028", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Sean Dougherty", "Aney Kapadia", "Kayra Erisoglu-Akyildiz", "jbschrie@uwaterloo.ca", "s2doughe@uwaterloo.ca", "Course Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"'", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 3 - Circuits", "Experiment 4 - Circuits", "Experiment 5 - Circuits", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}, {"course_id": 33, "course_code": "PHYS 122", "course_name": "PHYS122 - Waves, Electricity and Magnetism (0.50)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["Karen Cummings Instructor-course coordinator karenc@uwaterloo.ca", "Batia Friedman-Shaw BFRIEDMA@uwaterloo.ca", "Simple harmonic motion, resonance, damped harmonic motion, complex numbers, wave motion and sound, electrostatic force and potential, electric current and power, capacitors, DC circuits, LRC circuits, introduction to magnetic fields Lorentz Force.", "Understand and correctly apply concepts related to oscillations and waves including sound.", "Understand and correctly apply concepts related to electrostatics and magnetism.", "Apply problem solving approaches to write clear and correct solutions to quantitative problems involving oscillations, waves, electrostatics and magnetism, as well as topics from the first term of mechanics.", "Apply appropriate mathematics in solving problems involving oscillations, waves, electrostatics and magnetism including using derivatives, integration, dot and cross products and complex numbers.", "Effectively communicate your understanding of scientific and technical information in writing and orally, using mathematical symbols and words.", "Monday Dates", "Mathematical review: Derivatives and integrals of polynomials and trigonometric functions, dot- and cross-products, Taylor series expansions, complex numbers including using complex exponentials to represent sine and cosine.", "Jan 13 Oscillations: Mathematical and physical representations of simple harmonic motion including damping, resonance, and energy considerations- with examples from springs and pendula.", "Electric force and field: Charge, electrostatic force, electric fields, electric dipoles", "*******", "******", "Electric potential and potential energy including equipotential surfaces, potential gradients.", "There are no make-up midterms.", "Capacitance: capacitors in series and parallel, energy and charge in capacitors, dielectrics.", "March 10 Current, voltage, resistance:  emf, resistivity, conduction, energy and power in electric circuits.", "DC circuits: resistors in series and parallel, Kirchhoff’s Laws, R-C circuits, electrical measurements and power distribution.", "March 24 Introduction to magnets: magnetic field, field lines, magnetic flux, moving charge in a magnetic field ( Lorentz Force) , force on current-carrying wires, current loops, motors, Hall effect.", "Induction: Magnetic field for moving charge, current element, current-carrying wire.", "*********", "Final Exam will be cumulative and is held during the final exam period", "**********", "If you paid for an e-text and/or MasteringPhysics last term, the code should carry over to both PHYS122 and PHYS124.", "If you did not purchase a code last term, there is a 14-day free trial period on MasteringPhysics.", "Just register fully in MasteringPhysics with your code for either course.", "Mastering Physics", "Answering these bonus questions can make-up for points missed elsewhere on any MasteringPhysics assignment, or can result in a score for MasteringPhysics that is greater than 100%.", "There are no make-ups.", "Most groups in PHYS122 will be quite good and will still get this score of 75%.", "Groups who are not collaborating effectively will be reduced in score to a 2 or even a 1 in some cases.", "In fairness to those students who do not get sick, we will drop one score for TA Eval and one for Artifact for everyone.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 34, "course_code": "PHYS 122L", "course_name": "PHYS122L - Waves, Electricity and Magnetism Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Chemistry", "program_id": 26, "major_id": 3, "major_name": "Chemistry - Computational Specialization (Bachelor of Science - Honours)", "topics": ["08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "02:30PM - 05:20PM", "STC 3018", "02:30PM - 05:20PM", "STC 3018", "08:30AM - 11:20AM STC 3018", "Administrator first for minor issues", "I have a question about the material covered in the next lab?", "I have a question about the administration of the course?", "Section Number: Similar to the Course Code there are a number of sections in this course so to make it easier for a solution to be determined it is important to include your section.", "The section number will be the number following the course code, something like \"001\"", "How do we set ourselves up for success in these ventures?", "This course will focus on developing experimental skills and critical thinking in data collection and analysis.", "There will be times where you will be asked to figure out the best way to investigate a certain phenomena and will be given minimal instructions, the goal being to get you used coming up with ways to experimentally determine what you are looking for like scientists do when performing research.", "Clearly communicate their experimental processes and results and justify their decisions.", "Critically evaluate data collection methods and choose optimal experimental methods.", "Develop models of physical systems and methods to test and refine them based on experimental results.", "Experiment 2 - Circuits", "Experiment 5 - Magnetic Fields of a Coil", "Please only submit your forms to the Absence Database, do not email them to the Course Administrator.", "Extenuating Circumstances: Students can request academic considerations for extenuating circumstances (bereavement, emergencies, University of Waterloo sanctioned academic or athletic events, etc.), and requests will be reviewed on a case-by-case basis.", "Section number", "Library for research-based assignments"]}]