[{"course_id": 25, "course_code": "BIOL 239", "course_name": "BIOL239 - Genetics (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["11:30AM - 12:20PM", "10:30AM - 11:20AM STC 1012", "You can!", "Chromosomal mechanisms in mitosis and meiosis.", "Natural selection and the evolution of genetic systems.", "Describe the fundamentals of gene structure, function and transmission in prokaryotic and eukaryotic cells and organisms.", "Describe the various ways mutations can arise and how mutations may affect gene expression and phenotypic outcomes.", "Describe recombinant DNA technology in bacteria and its role in biotechnology.", "Effectively work with others, discussing, evaluating, and communicating genetics concepts and synthesizing ideas in a group.", "Readings", "textbook 1.1-1.2", "Mendelian genetics and probability", "Modification of Mendelian ratios", "textbook 3.2-3.3, 4.2-4.4, 15.1", "Mitosis, meiosis, and chromosome numbers", "DNA and the genetic code", "textbook 9.2-9.3", "T4: Mitosis and meiosis", "DNA cloning", "T5: Testing genetic ratios", "Cancer genetics", "T9: Population genetics", "Exam period", "- write the final exam and achieve a grade of at least 50% on the cumulative test and exam section", "Online learning activities: These activities are designed to test your knowledge of several important concepts explained by the lecture presentations in this course, and should be completed after the portion of the course when they are covered in lecture.", "They are all due toward the end of the term but can be completed as many times as you like to help you work on these concepts.", "Read the instructions carefully before attempting these as a completion quiz (in the quiz section) must also be completed to obtain credit.", "In this case, the weight of the missed submission will be transferred to the final exam.", "The dates affected and degree of incapacitation will be used to determine follow-up action."]}, {"course_id": 26, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}, {"course_id": 27, "course_code": "BIOL 240L", "course_name": "BIOL240L - Microbiology Laboratory (0.25)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["BIOL 240L", "BIOL 240L 001", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 002", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 003", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 005", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 006", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 007", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 008", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 010", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 012", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 013", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 014", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 015", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 017", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 018", "09:30AM -", "cheryl.duxbury@uwaterloo.ca", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "02:30PM - 05:20PM", "cheryl.duxbury@uwaterloo.ca", "BIOL 240L 021", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "07:00PM - 09:50PM", "cheryl.duxbury@uwaterloo.ca", "Email: cduxbury@uwaterloo.ca", "View requirements for BIOL 240L", "Main Objective Obtain a a good understanding of the basic techniques used in a microbiology lab to study and handle microorganisms safely.", "Apply staining techniques to differentiate and observe types of bacteria", "Appreciate proper aseptic technique while handling microorganisms in the lab and inoculating media", "Properly prepare slides for examination under the microscope", "Prepare and use dilutions to isolate pure cultures and to enumerate the number of organisms in a culture", "Exp 3: Basic Bacterial Shapes", "Exp 12: Pour-Plate Method", "Exp 14: Aseptic Technique in Pipette Handling", "Exp 15: Standard Plate Count Method", "Exp 17: Bacterial Flagella Stain", "Exp 19: Miniprep of Plasmid DNA", "Exp 20: Analysis of Plasmid and Genomic DNA", "Exp 21: Metabolic Activities of Bacteria", "Exp 30: Evaluation of Chemical Antimicrobial Agents", "Exp 31: Antibiotic Sensitivity Testing", "Exp 32: Isolation of Bacterial Mutants", "TBA", "Extra precautions must be taken to ensure the safety of yourself and those around us!", "Always be prepared for a quiz; they could be given at any time and they are cumulative!", "To make this happen, a flowchart for each experiment is required.", "The flowchart is similar to a \"map\" of your experiment and should be sufficiently detailed and include the most important information about the experimental steps and possible time management.", "The flowchart should NOT be a reiteration of the \"METHODS\" section in your manual.", "Please see Flowchart Help Sheet for a flowchart example.", "Your professionalism mark will be assigned by your TAs and will be assessed on the basis of your performance in the laboratory, attendance, and your degree of skill in microbiological techniques.", "More information will be given closer to date.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 33, "course_code": "CHEM 120", "course_name": "CHEM120 - General Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["General Chemistry 1 Winter 2025", "RCH 101", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "The second part of this course is concerned with explaining periodicity and trends in chemical reactivity in terms of the electronic structure of atoms and molecules.", "Topics covered in this part of the course include the quantum theory of the hydrogen atom; electron configurations in multi-electron atoms; ionic and covalent bonding; Lewis structures, valence shell electron repulsion theory and molecular geometry; quantum mechanical bonding theories, including valence bond theory and molecular orbital theory.", "Additional topics may include an introduction to electron-transfer reactions, including the assignment of oxidation states and the balancing of oxidation-reduction reactions.", "assess the greenness of a chemical reaction using Atom Economy and E-Factor metrics.", "describe the electronic structure of atoms in terms of quantum theory using atomic orbitals and quantum numbers.", "justify the organization of the periodic table and predict trends in the properties of the elements.", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and explain molecular shape and stability in terms of electron count.", "describe the interactions of molecules in solids, liquids, and gases to compare physical and reactive properties.", "Course Structure and Continuity Plans", "No extensions will be granted for Participation Challenges, but each student can drop one participation challenge from their overall grade.", "Printed spiral bound copies of the course notes can be purchased online from the UW bookstore https://wstore.uwaterloo.ca/", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare pandemic-related illnesses on Quest (Information at this link)", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 34, "course_code": "CHEM 120L", "course_name": "CHEM120L - General Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 1 Fall 2024", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Be sure to record their name and contact information in your lab manual.", "Skillfully perform basic procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "1,3,5,7,9,11", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Sept 19 - 24", "1,3,5,7,9,11", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "1,3,5,7,9,11", "- studying cis and trans isomers", "Oct 24-29", "1,3,5,7,9,11", "Titration as an Analysis Tool", "- identify an unknown solid acid", "1,3,5,7,9,11", "Introduction to Chromatography", "- quantify a cation using ion exchange", "1,3,5,7,9,11", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 36, "course_code": "CHEM 123L", "course_name": "CHEM123L - General Chemistry Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 2 Winter 2025", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- a real life analysis", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 37, "course_code": "CHEM 237", "course_name": "CHEM237 - Introductory Biochemistry (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:20AM", "RCH 101", "10:30AM - 11:20AM RCH 101", "ESC 227", "Structure and properties of proteins and enzymes.", "develop a molecular level understanding of biological processes to achieve this the following learning outcomes will be", "in both qualitative and quantitative examples", "evaluate unknown thermodynamic parameters from given values of others.", "I equilibrium constants from standard free energy changes.", "qualitatively describe the composition of solutions of a weak acid or base as a function of pH.", "calculate the precise", "recognize the 20 amino acids that are commonly found in proteins and identify compounds derived from them", "calculate the charge on an amino acid side chain as a function of pH", "know the 4 levels of protein structure and the covalent and non covalent interactions that stabilize them", "explain how to purify proteins using the physical and chemical properties of the proteins", "determine the primary sequence of a protein given the appropriate data", "understand basic chemical kinetics and the application to biological systems", "determine the mechanism of inhibition of an enzyme using", "the structure of fatty acids and membrane lipids", "the structures of cell membranes and how the fatty acid composition of those membranes affects membrane structure and fluidity", "the structure of simple sugars and polysaccharides and the chemistry of the reactions in which they participate", "Suggested supplementary reading in \"Biochemistry Free for All\".", "Biochemistry free for all: Introduction Water and Buffers, pages 34-49", "VVP chapters 3 and 4.1", "Biochemistry free for all pages 53-70", "Appendix A.1 and A.2", "Chapter 4.2 and 4.3", "Biochemistry free for all.", "pp 74-108", "Week 6  Protein folding and Introduction to hemoglobin", "Chapter 4 - Biochemistry in focus", "Biochemistry free for all pages 128-141", "first kinetics Chapter 10 then mechanisms Chapter 9", "Biochemistry free for all pages 337-362", "Biochemistry free for all pp 190-217", "Biochemistry free for all pp 222-233", "Biochemistry free for all pp 287 - 312", "Notice of Recording"]}, {"course_id": 46, "course_code": "BIOL 434", "course_name": "BIOL434 - Human Molecular Genetics (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Human Molecular Genetics Fall 2024", "Recent advances in human molecular genetics will be examined with emphasis on how human disease-causing genes are mapped, identified, isolated, and characterized.", "describe structural elements of the human genome and their uses in gene mapping", "describe molecular techniques applied to mapping the location of and determining the sequence of specific genes", "differentiate between complex and simple traits in the etiology of disease using real world examples", "describe how various molecular change contribute to human disease", "describe the role of genomics tools in the determination of disease predisposition and appreciate how pathogenicity/neutrality of a sequence variant is determined", "evaluate the current limitations in the applications of genomics to the etiology of disease", "appreciate ethical and legal issues that have developed as a result of expanding human molecular genetic technologies", "evaluate and critically read primary literature on disease (to identify rationale/hypothesis, and and assess the skills needed to critically evaluate the methods and assess the conclusions", "Pattern of inheritance", "Pattern of inheritance", "Human genome sequencing", "23-Sep-24 M", "Human genome sequencing", "The architecture and working of human genome", "The architecture and working of human genome", "Human gene regulation and epigenome", "Human gene regulation and epigenome", "Human genetic variation", "Human gene regulation and epigenome", "18-Oct-24 F", "21-Oct-24 M  Epigenome/ Comparative genomics and evolution", "Molecular pathology", "25-Oct-24 F", "28-Oct-24 M", "Mapping and identifying genes for monogenic disorders", "Mapping and identifying genes for monogenic disorders", "Complex diseases", "4-Nov-24 M  Cancer genetics and genomics", "6-Nov-24 W Cancer genetics and genomics", "Model organisms", "29-Nov-24 F", "To facilitate equal contribute from all members, it is vital to maintain open and constant communication.", "Notice of Recording", "They host in-person appointments in their offices in South Campus Hall (SCH), remote appointments via a virtual platform, drop-in appointments at the Library, and email-based appointments so you can get help without missing class."]}, {"course_id": 51, "course_code": "CHEM 333", "course_name": "CHEM333 - Metabolism 1 (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["09:30AM - 10:20AM DWE 2527", "First we will cover general principles of thermodynamics and high energy compounds ( NTPs, NAD(P)+ and fats).", "And some general principles of the energy metabolism and the regulation of metabolic pathways.", "understand the logic of the pathways by being able to draw the chemical structures of the intermediates in these pathways.", "draw the chemical mechanisms of the enzymes involved in these metabolic pathways and to use that information to apply it to new systems.", "understand the interconnection of these pathways and the basis, of the regulation and coordination of these pathways.", "week ART Reading VVP reading and practice problems MVH", "1: Introduction to metabolism, review of Energy Metabolic Energy (410-429)", "6: Electron transport and oxidative phosphorylation Energy: Electron Transport & Oxidative Phosphorylation (430-471)", "10: Integration and coordinated regulation of the pathways metabolic disorders Signalling (828-855)", "Biochemistry Free for All https://biochem.oregonstate.edu/undergraduate/educational-resources Yes", "Fundamentals of Biochemistry 5th edition by Voet, Voet and Pratt Yes", "Online quizzes   10% of final mark These will be a combination of multiple choice and written answers."]}, {"course_id": 54, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Biotechnology/Chartered Professional Accountancy", "program_id": 20, "major_id": 1, "major_name": "Biotechnology/Chartered Professional Accountancy (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 4, "course_code": "MATH 115", "course_name": "MATH115 - Linear Algebra for Engineering (0.50)", "term_name": "1A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Linear Algebra for Engineering Fall 2024", "02:30PM - 03:20PM", "RCH 301", "RCH 301", "10:30AM - 11:20AM E7 5353", "02:30PM - 03:20PM", "E. Dupont", "03:30PM - 04:20PM E7 5343", "10:30AM - 12:20PM RCH 301", "10:30AM - 12:20PM", "PHY 313", "E. Dupont", "08:30AM - 09:20AM", "08:30AM - 10:20AM PHY 313", "08:30AM - 10:20AM RCH 309", "10:30AM - 11:20AM RCH 103", "11:30AM - 12:20PM RCH 103", "RCH 204", "02:30PM - 03:20PM", "03:30PM - 04:20PM", "08:30AM - 10:20AM EV3 4412", "08:30AM - 10:20AM MC 4058", "02:30PM - 03:20PM", "09:30AM - 10:20AM RCH 302", "F. Al-Faisal", "10:30AM - 12:20PM MC 4063", "10:30AM - 12:20PM MC 4060", "10:30AM - 11:20AM RCH 110", "F. Al-Faisal", "03:30PM - 04:20PM", "02:30PM - 04:20PM MC 4060", "DWE 3522", "Tuesday -", "07:00PM - 08:50PM", "Linear equations, matrices, and determinants.", "Introduction to vector spaces.", "Eigenvalues and diagonalization.", "Present solutions to problems in a clear and logical manner with all steps being fully justified.", "Understand the basic operations of addition and scalar multiplication as they apply to vectors, matrices and linear transformations.", "Find the solution to a system of linear equations using matrices and elementary row operations.", "Understand matrix algebra and its connection to systems of equations.", "Have both a geometric and an algebraic understanding of span, linear independence, bases and subspaces.", "Recognize the link between matrices and linear transformations, and understand that many common geometric operations such as projections, reflections and rotations are linear transformations.", "Develop a basic algebraic and geometric understanding of complex numbers and complex polynomials.", "Determine the eigenvalues and eigenvectors of a matrix and diagonalize a matrix.", "1.1 Vectors in Rn", "1.2 Linear Combinations", "1.3 The Norm and the Dot Product", "1.4 Vector Equations of Lines and Planes", "1.5 The Cross Product in R3", "1.6 The Scalar Equation of Planes in R3", "1.7 Projections", "Chapter 2 Systems of Linear Equations", "2.1 Introduction and Terminology", "2.2 Solving Systems of Linear Equations", "2.3 Rank", "2.4 Homogeneous Systems of Linear Equations", "3.1 Matrix Algebra", "3.2 The Matrix-Vector Product", "3.3 The Matrix Equation Ax=b", "3.4 Matrix Multiplication", "3.5 Matrix Inverses", "4.1 Spanning Sets", "4.2 Geometry of Spanning Sets", "4.3 Linear Dependence and Linear Independence", "4.4 Subspaces of Rn", "4.5 Bases and Dimension", "4.6 Fundamental Subspaces of a Matrix", "Chapter 5 Linear Transformations", "5.1 Matrix Transformations and Linear Transformations", "5.2 Examples of Linear Transformations", "5.3 Operations on Linear Transformations", "5.4 Inverses of Linear Transformations", "5.5 The Kernel and the Range", "Chapter 6 Determinants", "6.1 Determinants and Invertibility", "6.2 Elementary Row and Column Operations", "6.3 Properties of Determinants", "7.1 Basic Operations", "7.2 Conjugate and Modulus", "7.3 Polar Form", "7.4 Complex Polynomials", "7.5 Complex nth Roots", "Chapter 8 Eigenvalues and Eigenvectors", "8.1 Introduction", "8.2 Computing Eigenvalues and Eigenvectors", "8.3 Eigenspaces", "8.4 Diagonalization", "8.5 Powers of Matrices", "Linear Algebra for Engineering Fall 2024 Course Notes Required text provided on LEARN Yes", "Linear Algebra with Applications by Keith Nicholson Optional text provided on LEARN No", "The Linear Algebra for Engineering Fall 2024 Course Notes is the required text for this course, and is available on LEARN.", "The text Linear Algebra with Applications is an optional text also available on LEARN for those students looking for an alternate exposition of the material and/or additional problems to work on.", "Students looking for extra practice beyond the course notes are welcome to attempt problems in the corresponding sections of the optional textbook.", "Python Assignments: Throughout the term, there will be 5 equally weighted assignments where students will use python to execute some prewritten code in an effort to explore some larger-scale applications of linear algebra.", "If you find yourself in a situation where you are missing multiple assessments, then you are advised to contact both your instructor and the First Year Engineering Office to make sure you have the proper supports in place to succeed in this courses.", "To be clear - such websites are not allowed to be used for the completion of any part of the course MATH 115, and students are not permitted to share questions from the course anywhere.", "Generative AI: This course includes the independent development and practice of specific skills, such as computations, problem solving and proof writing.", "Library for research-based assignments"]}, {"course_id": 7, "course_code": "CHE 161", "course_name": "CHE161 - Engineering Biology (0.50)", "term_name": "1B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["09:30AM - 10:20AM RCH 110", "08:30AM - 09:20AM", "Friday -", "Friday", "10:30AM - 12:20PM", "•Chemical Engineering", "•Office hours: 2.30 pm-3.30 pm Mondays, can also be scheduled upon email request", "Introduction to basic concepts of biochemistry and cell biology.", "Properties and functions of biopolymers.", "Elements of cell structure and diversity, and relationship of biochemistry with cell metabolism.", "View requirements for CHE 161", "1) Demonstrate a basic understanding of biochemistry, cell biology and molecular biology (1b)", "2) Converse at a fundamental level with scientist and engineers that use biology and biotechnology (1b)", "5) Identify societal, safety and ethical concerns surrounding biotechnology.", "Biomolecules", "1.1 Sugar and Polysaccharides", "1.2 Fatty acids and derived polymers", "1.3 Amino acid and Proteins", "1.4 Nucleotides and Nucleic acids", "2.1 Life definition and classification", "2.2 Cell structure and reproduction", "2.3 Bioproduction", "3.2 Sugar metabolism", "3.3 Fatty acid metabolism", "3.4 Protein metabolism", "3.5 Enzyme kinetics", "4.1 Central Dogma"]}, {"course_id": 9, "course_code": "MATH 118", "course_name": "MATH118 - Calculus 2 for Engineering (0.50)", "term_name": "1B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["10:30AM - 11:20AM RCH 110", "02:30PM - 03:20PM", "RCH 306", "09:30AM - 10:20AM RCH 105", "RCH 306", "10:30AM - 11:20AM RCH 103", "RCH 204", "02:30PM - 03:20PM", "02:30PM - 04:20PM MC 4060", "Monday -", "Monday", "Linear and separable first order differential equations, applications.", "Parametric curves and polar coordinates, arc length and area.", "Get experience in writing well-organized and readable mathematical solutions, so that you will be able to communicate mathematical or technical ideas.", "Select an appropriate integration technique and apply it to solve indefinite or definite integrals.", "Find a power series representation of a function and find a closed form for a function represented by a power series.", "Understand the formal definition of the limit of a sequence and use it to prove basic limits.", "Understand the principle of mathematical induction and use it to prove some mathematical statements.", "Integration by substitution (review)", "Integration by parts (review)", "Trigonometric integrals", "Trigonometric substitution and completing the square", "Partial fractions", "Numerical integration", "Error bounds for numerical integration", "Improper integrals", "First make up lecture occurs", "Separable DEs, linear first-order DEs", "Applications of DEs", "Sequences, limits of sequences", "Recursively-defined sequences, mathematical induction", "Appendix A", "Integral test, p-series", "Comparison tests", "Second make up lecture occurs", "-", "Winter reading week", "-", "Absolute vs. conditional convergence", "Ratio and root tests", "Estimating sums", "Power series", "Taylor and Maclaurin series", "Sums of power series", "Applications of series", "Parametric equations", "Polar coordinates, polar curves", "Area and arc length of polar curves", "In particular:"]}, {"course_id": 10, "course_code": "PHYS 115", "course_name": "PHYS115 - Mechanics (0.50)", "term_name": "1B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:50AM RCH 110", "08:30AM - 09:20AM", "09:30AM - 10:20AM RCH 105", "Name Role Email", "How to Email the Teaching Team", "See the document \"Guidance for Writing Emails to the Teaching Team\" on LEARN for email formatting tips and examples.", "Discuss strategies for solving problems.", "Please see “First-Year Engineering Tutors” and “Physics Tutorial Centre” below.", "Conservation of linear momentum, collisions, rotational kinematics and dynamics, conservation of angular momentum.", "Define and describe core concepts of classical mechanics (e.g., free fall, force, energy) and provide real-world examples to demonstrate their applications [KB, LL].", "Break down complex physical scenarios into their underlying principles, identifying relationships between forces, motion, and energy; for instance, by drawing free body diagrams [KB, PA].", "Section", "Units", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "TUT 103 & 104", "L1 and L2, Math Review 1-1 – 1.3, 2.1 – 2.3, 2.6 IQ0, TQ0 & TPS0 0, 1 / 0, 1 PE1 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "L3 and L4 2.4 – 2.5, 4.1 – 4.4 IQ1, TQ1 & TPS1 1, 2 / 1, 2 IQ0 & TQ0 (TUT 101 & 102) marks released @ 7 PM, PE2 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L3 and L4 2.4 – 2.5, 4.1 – 4.4 IQ1, TQ1 & TPS1 1, 2 / 1, 2 IQ0 & TQ0 (TUT 103 & 104) marks released @ 7 PM, PA2 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "L5 and L6 4.6 – 4.7, 5.1 IQ2, TQ2 & TPS2 2, 3 / 2, 3 IQ1 & TQ1 (TUT 101 & 102) marks released @ 7 PM, PA3 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L5 and L6 4.6 – 4.7, 5.1 IQ2, TQ2 & TPS2 2, 3 / 2, 3 IQ1 & TQ1 (TUT 103 & 104) marks released @ 7 PM, PA3 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "Applications of Newton's Laws 5.2 – 5.3 VQ7 4 / 4 -", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "TUT 103 & 104", "LEC 001 & 002", "Kinetic energy, Work and Kinetic energy 7.1 – 7.2 VQ10 5 / 5 -", "LEC 001 & 002", "LEC 001 & 002", "Potential Energy, Conservation of Mechanical Energy, Reading a Potential Energy Curve 8.1 – 8.3 VQ12 5 / 5 AS4 closed @ 7 PM, AS5 & PS5 released @ 7 PM", "T5", "TUT 101 & 102", "L10 to L12 7.1 – 7.6, 8.1 – 8.3 IQ4 TQ4 & TPS4 4, 5 / 4, 5 IQ3 & TQ3 (TUT 101 & 102) marks released @ 7 PM, PA5 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L10 to L12 7.1 – 7.6, 8.1 – 8.3 IQ4, TQ5 & TPS4 4, 5 / 4, 5 IQ3 & TQ3 (TUT 103 & 104) marks released @ 7 PM, PA5 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "Work done on a System by an External Force, Conservation of Energy 8.4 – 8.5 VQ13 6 / 6 -", "LEC 001 & 002", "T6", "TUT 101 & 102", "L13 and L14 8.4 – 8.5 IQ5, TQ5 & TPS5 5, 6 / 5, 6 IQ4 & TQ4 (TUT 101 & 102) marks released @ 7 PM, PA6 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L13 and L14 8.4 – 8.5 IQ5, TQ5 & TPS5 5, 6 / 5, 6 IQ4 & TQ4 (TUT 103 & 104) marks released @ 7 PM, PA6 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "Conservation of Linear Momentum, Elastic Collisions in One Dimension 9.5 – 9.6 VQ16 7 / 7 AS7 & PS7 released @ 7 PM", "TUT 101 & 102", "L15 and L16 9.1 – 9.6 IQ6 & TPS6 (L13 & L14) 6, 7 / 6, 7 IQ5 & TQ5 (TUT 101 & 102) marks released @ 7 PM, PA7 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L15 and L16 9.1 – 9.6 IQ6 & TPS6 (L13 & L14) 6, 7 / 6, 7 IQ5 & TQ6 (TUT 103 & 104) marks released @ 7 PM, PA7 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "Momentum and Kinetic Energy in Collisions,  9.7 – 9.8 VQ17 8 / 8 -", "LEC 001 & 002", "TUT 101 & 102", "L17 and L18 9.7 – 9.9 IQ7, TQ7 & TPS7 7, 8 / 7, 8 IQ6 & TQ6 (TUT 101 & 102) marks released @ 7 PM, PA8 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "LEC 001 & 002", "LEC 001 & 002", "T9", "TUT 101 & 102", "L19 and L20 10.1 – 10.7, 11.4 IQ8, TQ8 & TPS8 8, 9 / 8, 9 IQ7 & TQ7 (TUT 101 & 102) marks released @ 7 PM, PA9 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "L19 and L20 10.1 – 10.7, 11.4 IQ8, TQ8 & TPS8 8, 9 / 8, 9 IQ7 & TQ7 (TUT 103 & 104) marks released @ 7 PM, PA9 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "Work and Rotational Kinetic Energy 10.8 VQ22 10 / 10", "LEC 001 & 002", "TUT 101 & 102", "L21 to L23 11.5 – 11.9, 10.8 IQ9, TQ9 & TPS9 9, 10 / 9, 10 IQ8 & TQ8 (TUT 101 & 102) marks released @ 7 PM, PA10 opened @ 4PM & closed @ 5PM", "TUT 103 & 104", "L21 to L23 11.5 – 11.9, 10.8 IQ9, TQ9 & TPS9 9, 10 / 9, 10 IQ8 & TQ8 (TUT 103 & 104) marks released @ 7 PM, PA10 opened @ 4PM & closed @ 5PM", "LEC 001 & 002", "LEC 001 & 002", "TUT 101 & 102", "L24 and L25 11.1 – 11.3, 12.1 – 12.2 IQ10, TQ10 & TPS10 10, 11 / 10, 11 IQ9 & TQ9 (TUT 101 & 102) marks released @ 7 PM, PA11 opened @ 4PM & closed @ 5PM", "14 - 2025/04/07 (Mon) - - - - IQ9 & TQ9 (TUT 103 & 104) marks released @ 7 PM, PA11 opened @ 4PM & closed @ 5PM", "Important Dates and Events in Winter 2025", "First Day of Classes Monday, January 6", "Resume Reviews Ongoing – E2 1772", "Yes -", "Yes -", "Yes -", "Marking Scheme A", "Weekly Group Progress Reports in Tutorial Sessions 3.5%", "Weekly Peer Evaluation in Tutorial Sessions 1.5%", "Weekly Team Progress Reports in Tutorial Sessions 3.5%", "Weekly Peer Evaluation in Tutorial Sessions 1.5", "As outlined below, your final mark incorporates both in-class and out-of-class activities, individual and teamwork, as well as test-based and non-test-based assessments.", "Only the first ten correct responses receive bonus marks.", "This rubric is adapted from a similar rubric in the PHYS 111 course, Fall 2022).", "Extraction of Physical Properties - Well-labeled (free-body) Diagram No physical properties extracted.", "All information represented on a well-labeled (free-body) diagram including coordinate systems, vectors.", "Manipulating Equations and Use of Numbers - Algebra and Calculations Incorrect or missing steps in algebra and numbers introduced prematurely.", "Equations manipulated satisfactorily but coordinates or numbers used incorrectly.", "Weekly Progress Reports in Tutorial Sessions", "Extraction of Physical Properties - Well-labeled (free-body) Diagram No physical properties extracted.", "Manipulating Equations and Use of Numbers - Algebra and Calculations Incorrect or missing steps in algebra and numbers introduced prematurely.", "Equations manipulated satisfactorily but coordinates or numbers used incorrectly.", "Weekly Peer Evaluation in Tutorial Sessions", "Aspect of team functioning Well below average Below average Average Above average Well above average", "Problem Solving Skills", "Level of Collaboration Allowed: Allowed – Team collaboration is required during tutorial sessions and strongly encouraged outside of them.", "Students complete at least the first two questions in teams during tutorials and submit team progress reports.", "Solutions for the remaining questions can be collaboratively discussed outside tutorials.", "I frequently monitor this channel and try to address your questions as much as I can.", "One short-term self-declaration", "Cannot be used for in-person LAB or STU", "One self-declaration of COVID-like symptoms", "Reason and dates of absence required for submission", "Discord", "The First Year Office", "The office supports you in establishing a strong academic foundation during your first year, which will help you throughout your undergraduate studies and prepare you for a successful career.", "First-Year Engineering Tutors", "Peer success coaching", "My learning skills evaluation is a self-reflection tool designed to help you assess your current learning strategies and identify areas for growth and improvement.", "Quick Tips and Resources", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Library for research-based assignments"]}, {"course_id": 11, "course_code": "COMMST 100", "course_name": "COMMST100 - Interpersonal Communication (0.50)", "term_name": "1B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["jclausen@uwaterloo.ca (please do not use the D2L email system)", "I monitor my email M-F, 9:00 am - 5:00 pm.", "Focuses on the one-to-one, face-to-face communication in both the personal and professional realms.", "Such topics as verbal and non-verbal interactions, listening, and the better management of interpersonal communication will be studied.", "In this course, we will work to understand more fully how we communicate (and are communicated to) in the world we live in and to develop the tools to research, apply, and practice key interpersonal communication concepts in our everyday lives.", "Students will be encouraged to identify, negotiate, and challenge existing communicative norms as they explore a range of interpersonal and intrapersonal issues that include culture, identity, and power.", "Understand the complexity of communication as a human process of shared meaning- making in the context of power, history, and culture", "Increase your capacity to recognize and enhance yours and others’ agency – the ability to make a difference in the world for yourself and others – and understand the implications of your communication behaviours for yourself and others", "Understand communication as a practice and improve your critical and creative communication competencies by developing your ability to use writing and other media of communication to create meaning", "This entails opportunities for student-directed inquiry, challenge and risk-taking, and reflection on your roles and responsibilities", "Reflect on your role in fostering the public good (the multifaceted well-being of individuals and groups), begin to imagine a better future, and make decisions in your communication that can transform the communities to which you belong", "Recognize diverse linguistic practices and modes of expression as resources for writers and speakers", "Introduction", "Read: Meaning as Co-Created", "Read: “Cultural and Historical Influences: Communication Competence in Context”", "Exceeds assignment guidelines; strong and consistently applied definition of audience and purpose; thoughtful and innovative adaptation of the subject to the audience’s needs; subject developed and organized at every level for listener comprehension; speaker uses language appropriately, effectively and even inventively; maintains relaxed, inviting delivery free of verbal fillers and distractions; cites sources appropriately both in spoken and written work; submits well prepared required materials.", "Your entries should be roughly two typewritten, double- spaced pages each although they can go slightly over.", "While the amount you write under each heading may change week to week, this format allows you to address each area regularly.", "Decide how often you will communicate and in what manner.", "Decide how you will divide the workload and handle conflicts.", "Handing in a clear contract will earn 5%.", "Your job will be to engage the class and apply what we are reading to people’s own opinions, experience, etc. Sign up for this assignment is on a first-come/first-served basis starting during week two of classes.", "Group Presenation 2: Final Presenation You and your group will create a fifteen-minute videotaped presentation exploring a problem in interpersonal communication and proposing a solution for that problem.", "This presentation will involve research into a specific issue related to interpersonal communication and creating good reasons for following your proposed solution.", "This course includes the independent development and practice of specific skills, such as self reflection, critical thinking skills and interpersonal communication.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 13, "course_code": "EMLS 101R", "course_name": "EMLS101R - Oral Communications for Academic Purposes (0.50)", "term_name": "1B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["& Location:", "Email:                         christa.schuller@uwaterloo.ca", "Designed specifically for students for whom English is not the first language, this course introduces group discussion strategies and presentation skills.", "A focus on pronunciation and vocabulary assists learners to better engage in conversations and listen to and deliver English presentations.", "This is achieved with the focus on gambits, voice quality, and speech clarity, which assist learners in developing strategies to better engage in discussions, and listen to and deliver English presentations in both remote and face-to-face contexts.", "Create and organize discussions and presentations", "Use a clear and appropriate format", "Develop relevant and well formatted materials (PowerPoint slides and discussion notes)", "Select effective introductions and conclusions to engage the audience", "Clearly express their ideas verbally and non-verbally", "Use communication gambits and signpost language effectively during discussions as well as individual and team presentations", "Use body language and space on stage to enhance the expression of ideas", "Listen for main ideas and details of some selected TED talks to form opinions on current socio-cultural, educational, environmental, and technological issues", "Critically evaluate various sources of information and then incorporate these sources in oral communication to create strong, academic support for their ideas", "Topics & Activities In-class Activities & Assignments Home                 Assignments", "Nonverbal communication- Importance of body language", "Introduction to group discussion assignment", "Analysis of non-verbal communication of selected presenters", "Small talk & non-verbal communication practice", "Main ideas and brief summary of TED Talks", "Question types for semi-formal discussion", "Discussion facilitation and gambits", "Non-verbal communication during a discussion", "Discussion skills", "Introduction to informative presentation introductions and conclusions", "Introduction to individual  presentations: thesis statement and format", "Chunking, pausing and focus words", "Writing thesis statements", "Pausing and focus words", "Effective PowerPoint slide design & APA citations", "Opening and closing a presentation", "Practice designing a slide and presenting its content", "Sample presentation", "Submitting PPT and Outline", "Submitting PPT and Outline", "Introduction to product review", "Inventions and innovations; product features", "Brainstorming for main ideas", "March 24 - 28", "Product review development – outline and slides", "Sample product review slides & outline", "Search for support materials, content development & slide design", "Product review presentations", "You will also need to watch the presentations of the other students and actively participate in the Q & A sessions following these presentations.", "A self-reflection on your preparation for the presentation, its delivery, and the Q & A will follow.", "A brief Q & A session will then follow.", "You will also need to watch the presentations of the other students and actively participate in the Q & A sessions following these presentations.", "These quizzes will cover the concepts related to academic and professional presentations, both individual and co-delivered, as well as discussions.", "Electronic Device Policy", "This course includes the independent development and practice of specific skills, such as collecting, synthesizing, and analyzing information; developing and practicing oral skills; critically evaluating and elaborating on ideas.", "Library for research-based assignments", "You can earn an EMLS Diploma by completing four EMLS courses and earning a cumulative average of 65%.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 23, "course_code": "CHEM 262L", "course_name": "CHEM262L - Organic Chemistry Laboratory for Engineering Students (0.25)", "term_name": "2A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["08:30AM - 11:20AM ESC 104", "08:30AM - 11:20AM ESC 104", "Answers can be expected within 24 hours.", "Topics include acid-base chemistry, substitution reactions, liquid-liquid extraction, product isolation and purification.", "Be proficient with basic organic laboratory techniques including selecting proper glassware, measuring small and large quantities of solids and liquids, designing the setup required for simple synthetic reactions, filtration, and basic characterization.", "Understand and be able to design and execute a liquid-liquid extraction processes for the separation of ionizable acidic, ionizable basic, and non-ionizable (neutral) substances.", "Demonstrate independent thinking by answering questions in your own words, showing critical reflection beyond the initial description of observations and facts.", "Scheduling issues", "Fillable form online for Möbius support", "Laboratory performance marks will be given by the Teaching Assistants and Lab Instructor and averaged for each in-person lab period.", "This is not directly the case; we do expect students to need a lot of clarifications when working in the lab for the first time.", "Laboratory Worksheets and Reports", "Questions similar to the pre-laboratory quizzes and reports will be used, but may be modified to be multiple choice.", "General Policies", "Aside from LEARN, we will use various software to facilitate the delivery of the laboratory.", "Important note: Since the manual is printed months before delivery of the lab, we may need to make corrections during the term.", "All in-lab worksheets are completed individually but reports submitted on Crowdmark can be completed with your partner.", "Please be mindful of this and avoid missing your lab for unapproved reasons.", "Human rights must be centered in our pedagogical practice to ensure students feel safe and respected into our instructional spaces.", "We also acknowledge that speaking of underrepresented groups in Science is a misnomer and we should speak of historically excluded persons as Black, Indigenous, Queer and Persons of Colour have contributed to chemical research since the inception of the field."]}, {"course_id": 31, "course_code": "CHE 312", "course_name": "CHE312 - Mathematics of Heat and Mass Transfer (0.50)", "term_name": "3A Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Mathematics of Heat and Mass Transfer Winter 2025", "CHE 312", "CHE 312 001", "10:30AM - 12:20PM DWE 3516", "E. Boghaert", "10:30AM - 11:20AM DWE 3516", "CHE 312 101", "11:30AM - 12:20PM DWE 3516", "E. Boghaert", "Eline Boghaert (eline.boghaert@uwaterloo.ca)", "Vector form of the microscopic thermal energy balance for solids and incompressible fluids.", "Mass and heat transfer models leading to ordinary differential equation problems in Cartesian, cylindrical and spherical geometries; types of boundary conditions.", "Bessel functions.", "Analytical solution of linear partial differential equations: combination of variables, separation of variables and Sturm-Liouville theory, Laplace transform.", "Mass and heat transfer models leading to linear partial differential equations: 1D transient diffusion and conduction in Cartesian, cylindrical and spherical geometries; steady-state 2D conduction and diffusion.", "View requirements for CHE 312", "Create simple mathematical models of heat and mass transport on the basis of justifiable assumptions and your understanding of the physical situation (i.e. modes of transport, geometry, boundary and initial conditions, etc.)", "Develop analytical solutions to these models [", "Apply these solutions to quantify heat and mass transport rates [", "2b", "Critique the performance of these models [", "Work in a team to model and design a solution to a heat transfer problem of interest [2b, 4a, 4b, 4c].", "Write a technical report describing a model developed to describe a heat transfer problem of interest [", "7b", "Note numbers in brackets refer to the related chapters in the recommended textbook.", "Develop and solve one-dimensional steady state heat transfer models.", "Develop and solve one-dimensional steady state heat transfer models.", "Develop and solve one-dimensional steady state mass transfer models.", "Develop and solve two-dimensional steady state mass transfer models.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 38, "course_code": "CHE 331", "course_name": "CHE331 - Electrochemical Engineering (0.50)", "term_name": "3B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Electrochemical Engineering Winter 2025", "CHE 331", "01:30PM - 03:20PM", "CHE 331 101", "Topics and applications of electrochemistry and electrochemical engineering.", "Thermodynamic and kinetic aspects of corrosion.", "Electrochemical energy conversion and storage.", "View requirements for CHE 331", "Extend chemical thermodynamics to electrochemical systems.", "Use thermodynamics to predict when a reaction can happen and to describe the activation overpotential of electrokinetic processes.", "Design electrochemical cells and reactors for electrolysis and galvanic processes under given conditions.", "Design and assess corrosion mitigation strategy to extend the lifetime of materials/parts.", "cells, Faraday's law ,current efficiency and electrochemical CSTRs 5-7", "10   8 Current and next-generation battery technologies 19-20", "There final quiz will be during the examination period (April 8th to 25th)", "The most useful textbook in the context of learning fundamental electrochemistry is Bard & Faulkner, Electrochemical Methods: Fundamentals and Applications and also, Electrochemical Science and Technology by Oldham, Myland and Bond was used as a reference for part of the lecture material.", "IMPORTANT:   You cannot fail quiz component and still be given a passing mark in the course.", "Intellectual property includes items such as:", "Graduate Attribute Program Indicators", "A knowledge base for engineering: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "1a Demonstrate understanding of concepts in mathematics.", "1b Demonstrate understanding of concepts in natural science.", "1c Demonstrate understanding of engineering fundamentals.", "1d Demonstrate understanding of specialized engineering knowledge.", "2. Problem Analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "3a Create investigative studies of complex engineering problems.", "3b Gather information from relevant sources to address complex engineering problems.", "4. Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "4a Define design requirements and specifications for complex, open-ended engineering problems.", "4b Critically evaluate and compare design choices.", "7. Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "8a Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Impact of Engineering: An ability to analyze social and environmental aspects of engineering activities.", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "10a Identify ethical and unethical behavior in professional situations.", "10b Identify how an engineer is accountable to multiple stakeholders in engineering practice.", "Life-long Learning: An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge.", "12a Identify gaps in their knowledge, skills and abilities."]}, {"course_id": 40, "course_code": "CHE 361", "course_name": "CHE361 - Bioprocess Engineering (0.50)", "term_name": "3B Term", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["03:30PM - 05:20PM", "03:30PM - 04:20PM", "04:30PM - 05:20PM", "Introduction of biological systems for the production of commercial goods and services, e.g., foods, pharmaceuticals, chemicals, fuels, diagnostics, waste treatment, and biomaterials.", "Introduction to design of bioprocess systems, including biosafety and sustainability.", "Development of reaction kinetics associated with biological systems.", "Development of material balances for key constituents in bioreactors operated in different modes, e.g., batch, fed-batch, continuous stirred-tank reactor (CSTR), perfusion, recycle.", "Introduction to mass and heat transfer considerations for bioreactors.", "Dynamic simulation of cultures defined by ordinary differential equations.", "Introduction of downstream processes associated with biological systems and recovery of biological products.", "View requirements for CHE 361", "Understand enzyme kinetics and derive enzyme kinetic equations based on associated biological information", "Model bioreactor for enzymatic reactions", "Understand how cells replicate with bioproduct formation", "Model bioreactor for cell cultivation and bioproduct formation", "Demonstrate competence in the fundamental concepts of biological sciences and biochemical/bioprocess engineering, including biomolecules, biocatalysts, metabolic pathways, enzyme functions/kinetics, cell behaviors and growth kinetics, bioreactor systems for enzymatic reactions and cell cultivation.", "Apply biological and chemical engineering concepts to design and analysis of bioreactor systems, including mass balance, bioreactor types, bioreactor configurations, bioreactor operation, bioreactor control, bioreactor modeling, bioreactor optimization etc. (2a; 2b; 2c; 4a; 5a; 11b)", "•Week 1: Bioprocess introduction and biological background review", "•Week 2: Enzyme kinetics introduction", "•Week 3: Enzyme kinetics modeling", "•Week 4: Bioreactor modeling for enzymatic reaction", "•Week 6: Enzyme inhibition kinetics", "•Week 7: Enzyme inhibition kinetics (continued) and other enzyme kinetics", "•Week 8: Cell growth biology and cell cultivation", "•Week 9: Cell growth kinetics", "•Week 10: Bioreactor (batch) modeling for cell cultivation and bioproduction", "•Week 11: Bioreactor (CSTR) modeling for cell cultivation and bioproduction", "•Week 12: Stoichiometric modeling of cell cultivation and bioproduction", "Bioprocess Engineering (Basic Concepts) No 173.59"]}, {"course_id": 49, "course_code": "ARBUS 202", "course_name": "ARBUS202 - Professional and Business Ethics (0.50)", "term_name": "Ethics List", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["11:30AM -", "V. Fernandes", "Study of ethical and moral issues that typically arise in professional and business activity.", "In the context of this course we will look specifically at ethical issues and principles of conduct that are relevant to professionals and business people.", "Topics include: fundamentals of moral and political theory, ethical decision-making, professional responsibility, corporate social responsibility, and equality, among other things.", "Like many other courses in philosophy, this series of lectures, readings, and discussions will deal with a critical analysis of many and varied views regarding life, existence, values, religious belief, etc.", "Form an opinion on the importance of ethical reasoning in business and professional contexts.", "Identify ethical problems in complex professional and business related situations.", "Apply ethical concepts to particular business and professional situations.", "Explain the roles of professional codes of conduct and codes of ethics in real world contexts.", "1 Jan 6 - 10 Introduction", "Module 2 Check-in", "3 Jan 20 - 24 Ethical Decision Making", "Module 3 Check-in", "5 Feb 3 - 7 Equality & Discrimination", "Module 6 Check-in", "7 Feb 24 - 28 Markets & the Environment", "Module 7 Check-in", "Module 9 Check-in", "Module 10 Check-in", "11 Mar 24 - 28 Whistle-blowing and Codes of Ethics", "Module 11 Check-in", "Module 12 Check-in", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 64, "course_code": "CHE 561", "course_name": "CHE561 - Biomaterials and Tissue Engineering (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Biomaterials and Tissue Engineering Winter 2025", "Assistant Professor in the Department of Chemical Engineering and member of the Waterloo Institute for Nanotechnology", "The course provides an overview of the recent advances in medicine and nano-technologies for development of tissue engineering and regenerative medicine.", "Strategies and technologies for designing, testing, and manufacturing of biomaterials and tissue-engineering products will be introduced.", "The biological and clinical applications will be discussed.", "The unmet medical needs, challenges in manufacturing, regulatory approval and commercialization for tissue engineering applications will also be discussed.", "CHE 561: View requirements for CHE 561", "The course provides an overview of the recent advances in medicine and nano-technologies for development of tissue engineering and regenerative medicine.", "Strategies and technologies for designing, testing, and manufacturing of biomaterials and tissue-engineering products will be introduced.", "The biological and clinical applications will be discussed.", "The unmet medical needs, challenges in manufacturing, regulatory approval and commercialization for tissue engineering applications will also be discussed.", "Apply fundamentals of fabrication technology for tissue engineering applications", "Integrate fundamentals of materials science to solve biomedical unmet needs", "Understand the fundamentals of biocompatibility and physiology for tissue engineering applications", "Design tissue engineering solutions to solve health-care problems", "Communicate through reports and presentations", "-Introduction to tissue engineering", "-Scale in biological systems", "-Introduction biomaterials and nanotechnologies for biomedical engineering", "Biomaterials design and properties", "Drug and gene delivery", "-Key components of tissue engineering", "Biomaterials: engineering biological structures", "Protein interactions with biomaterials", "Molecular and cellular processes with living environment, blood-materials interaction, short and long term reactions to the body.Cell interactions with biomaterials", "Immune response and wound healing", "Growth factors, controlled release and gene delivery", "Cells and Stem cells", "Neural repair and regeneration", "Diabetes / bone tissue engineering", "Assessment of biomedical products", "Regulatory and commercialization", "Design project presentations", "Design project 40%", "Design project is to be done in groups of 3-4.", "Design Project Outline Friday, February 7 at 11:59 PM 10%", "Design Project peer and self-evaluations Friday, April 4, 11:59 PM 10%", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 67, "course_code": "CHE 565", "course_name": "CHE565 - Synthetic Biology Project Design (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Synthetic Biology Project Design Fall 2024", "B. Ingalls", "B. Ingalls bingalls@uwaterloo.ca", "Synthetic biology involves developing new approaches, based on engineering principles, for genetic engineering of biological systems.", "Students will prepare a comprehensive research proposal for a synthetic biology project of their own design, under the supervision of a faculty member.", "BIOL 349: View requirements for BIOL 349", "CHE 565: View requirements for CHE 565", "The goal is to prepare a research proposal for a synthetic biology project and to make a strong case for its adoption by the iGEM team.", "Each", "Each", "week, the presenter for the following week will make a short presentation outlining two", "This proposal should be", "literature should be cited and reviewed, followed by a rationale for the project, and a", "methodological detail for the project to be carried out in the laboratory by a team of", "The paper must also contain references, figures / charts", "The main part of the text should be a maximum of 10,000", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 68, "course_code": "CHE 571", "course_name": "CHE571 - Industrial Ecology (0.50)", "term_name": "List 1", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Industrial Ecology Fall 2024", "04:00PM - 05:20PM", "Industrial ecology is a rapidly growing field that systematically examines local, regional, and global uses and flows of materials and energy in products, processes, industrial sectors, and economies.", "It focuses on the potential role of industry in reducing environmental burdens throughout the product life cycle from the extraction of raw materials to the production of goods, to the use of those goods and to the management of the resulting wastes.", "This course will review the environmental issues associated with chemical industries and the roles of engineers to manage these issues.", "The principles and philosophy of green chemistry will be addressed including pollution prevention in unit operations.", "The concepts and practices of environmental life cycle analysis and accounting will be addressed in detail, together with the basics of risk assessment, management and communication.", "View requirements for CHE 571", "Introduction to sustainability and industrial ecology", "Brief overview of the scientific evidence for climate change", "Environmental Law in Canada; due diligence as a defence", "Climate legislation in Canada; carbon trading", "Describe the key principles of industrial ecology, sustainable development and sustainability engineering [1d,8a,9a].", "Explain the science of global warming and climate change [", "Apply carbon accounting standards to develop greenhouse gas emission and reduction estimates for inventories and reduction projects [", "Describe key environmental legislation in Ontario and Canada [8b,9a]", "Basics of sustainability and industrial ecology.", "Introduction to greenhouse gas (GHG) accounting.", "Week 5 GHG accounting - offset systems.", "A timed multiple-choice component.", "3.0 points - solutions are complete, correct and well-presented.", "2.0-2.5 points - solutions are mostly complete and well-presented but have minor errors, missing information.", "Intellectual property includes items such as:", "Graduate Attribute Program Indicators", "A knowledge base for engineering: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "1a Demonstrate understanding of concepts in mathematics.", "1b Demonstrate understanding of concepts in natural science.", "1c Demonstrate understanding of engineering fundamentals.", "1d Demonstrate understanding of specialized engineering knowledge.", "2. Problem Analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "3a Create investigative studies of complex engineering problems.", "3b Gather information from relevant sources to address complex engineering problems.", "4. Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "4a Define design requirements and specifications for complex, open-ended engineering problems.", "4b Critically evaluate and compare design choices.", "7. Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "8a Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Impact of Engineering: An ability to analyze social and environmental aspects of engineering activities.", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "10a Identify ethical and unethical behavior in professional situations.", "10b Identify how an engineer is accountable to multiple stakeholders in engineering practice.", "Life-long Learning: An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge.", "12a Identify gaps in their knowledge, skills and abilities.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 72, "course_code": "EARTH 456", "course_name": "EARTH456 - Numerical Methods in Hydrogeology (0.50)", "term_name": "List 2", "program_name": "Chemical Engineering", "program_id": 25, "major_id": 1, "major_name": "Chemical Engineering (Bachelor of Applied Science - Honours)", "topics": ["Numerical Methods in Hydrogeology Winter 2025", "An introduction to the theory and practice of groundwater flow and contaminant transport modeling.", "Topics related to variably-saturated flow will focus on derivation of Richard's equation, a control volume finite difference discretization, assembly and solution of the flow equation, material balance error, truncation error analysis, stability and monotonicity.", "Explain the fundamental theory behind groundwater flow and contaminant transport modeling", "Apply numerical techniques, including control volume finite difference discretization, to solve groundwater flow and contaminant transport equations.", "Analyze numerical model accuracy, including material balance error, truncation error, stability, and monotonicity in variably-saturated flow and contaminant transport problems.", "Use a modeling software to model variably-saturated flow and contaminant transport.", "Interpret and visualize groundwater flow and contaminant transport model results and communicate findings effectively.", "Identify the concepts of groundwater and solute transport modeling and their real-world applications.", "Section 1.1 Derivation of Richards' Equation", "Section 1.2 Derivation of Richards 'Equation – Pressure Head Formulation", "Section 1.3 Three-Dimensional Groundwater Flow", "Derive and interpret three-dimensional groundwater flow dynamics and their mathematical representation.", "Section 1.4 Control Volume Finite Difference Discretization for Flow", "Section 1.5 A Rigorous Derivation of the Control Volume Finite Difference Discretization", "Develop, apply, and justify control volume finite difference discretization techniques for groundwater flow problems, demonstrating a rigorous understanding of mathematical principles.", "Assemble and implement saturated groundwater flow equations in numerical models using discretized formulations.", "Assemble the saturated groundwater flow equation using control volume discretization.", "Analyze groundwater flow material balance errors and their implications for numerical model accuracy.", "Section 1.8 Truncation Error Analysis", "Section 1.8 Truncation Error Analysis", "Section 1.9 Stability and Monotonicity", "Section 2.1 Derivation of the Contaminant Transport Equation", "Analyze the stability and monotonicity of numerical methods for groundwater flow models.", "Derive the contaminant transport equation and articulate its role in modeling solute movement through porous media.", "Section 2.1 Derivation of the Contaminant Transport Equation", "Section 2.2 Control Volume Finite Difference Discretization of the Contaminant Transport Equation", "Section 2.3 Central Spatial Weighting of Advective Flux", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Apply control volume finite difference discretization to the contaminant transport equation for numerical modeling.", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Section 2.4 Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.5 Upstream Spatial Weighting of Advective Flux", "Section 2.5.1 Truncation Error of Upstream Spatial Weighting", "Section 2.6 Crank-Nicolson Temporal Weighting with Upstream Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.7 Assembly of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.7.1 Monotonicity of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.8 Assembly of Fully-Implicit Temporal Weighting with Upstream Spatial Weighting", "Section 2.8.1 Monotonicity of Upstream Spatial Weighting with Fully-Implicit Temporal Weighting", "Section 2.9 Boundary Conditions for Transport Coupled to Flow", "Analyze the accuracy of various contaminant transport weighting schemes and their impact on numerical model performance.", "Apply boundary conditions for contaminant transport coupled with groundwater flow and assess material balance errors to ensure reliable numerical simulations.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "The total maximum bonus points that can be earned across all five assignments is five.", "Students can earn bonus points by actively participating in discussions or helping their peers understand the course material and assignments.", "Explaining a challenging concept to peers in a collaborative study session.", "A maximum of five contributions will be allowed per assignment."]}]