[{"course_id": 9, "course_code": "BIOL 150", "course_name": "BIOL150 - Organismal and Evolutionary Ecology (0.50)", "term_name": "List 2", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Organismal and Evolutionary Ecology Fall 2023", "11:30AM - 12:20PM RCH 101", "Learn Discussion Board", "Email and Appointment Requests", "Coverage includes hypothesis testing and the nature of scientific inquiry, basic population genetics, physiological ecology, life histories, dispersal, basic population and community ecology, macroevolution, systematics and classification, as well as functional morphology.", "The theory of evolution unites the whole of biology and all living organisms into a coherent body of knowledge, allowing comparisons across all forms of life.", "Ecology describes how organisms interact with their environment and each other to create interdependent systems from microscopic to global scales.", "These disciplines are fundamentally tied together: evolution is the primary mechanism by which species adapt to their environment; ecological interactions and environmental variability drive natural selection.", "You will also carry out simulated lab assignments to test the principles of evolution, design ecological experiments to test alternate hypotheses about the conservation of species and manipulate demographic parameters to test their influence on population growth.", "Understand the principles of scientific methodology", "Define ecological and evolutionary terms, such as the niche, adaptation, and altruism", "Illustrate these mechanisms in the context of course examples", "Explain how ecological interactions and evolution are interconnected", "Sign code of conduct and upload to LEARN.", "2) Sept 8 Evolution for Ecology Section 1: Evolution and Ecology are Intertwined", "4) Sept 13 Evolution for Ecology", "5) Sept 15 Evolution for Ecology Section 3: Genetics and Evolution", "6) Sept 18 Evolution for Ecology Section 4: Managing the Evolution of Resistance", "9) Sep 25 Physiological Ecology Section 1: Trade-offs and Species Distributions", "15) Oct 9-13 Holiday – No classes Understanding Experimental Design Simulation due by Oct 16, 11:59 pm", "16) Oct 16 Empiricism in Ecology Understanding Experimental Design Simulation due by 11:59 pm (best 2/3 for 10%)", "It is important that you review the information below before you subscribe to the SimUText for Organismal Ecology and Evolution - Chapters at University of Waterloo.", "SimUText Application Installers", "SimUText Application Installers", "At the end of every unit, you will work individually to develop a concept map using Cmap Cloud to visually display the relationships among what you consider the key concepts in the unit.", "These should represent your personal comprehension of how the concepts relate to each other, and no two should be identical.", "Also, class will entail a lot of discussion that won’t be represented in PPT slides.", "The simulations include one on Evolution in Ecology, one on Experimental Design in Ecology and one on Population Growth.", "The learning outcome for the unit tests is to demonstrate your recall and comprehension of the material covered in the units and to incentivize keeping up with the readings and attending lectures and reviewing for the final exam.", "The learning outcome is to demonstrate recall, synthesis and integration of material learned during the course.", "The final exam will consist of multiple-choice, T/F, solve the equation type of questions and integration questions that are designed to test your basic and deeper understanding of the course concepts.", "Important note regarding tests and exams", "Unit tests will be completed for the first 4 units of the course.", "Ensure you have a reliable internet connection and functional computer to complete them – technical challenges encountered during remote completion are not an excuse for missed tests.", "I will have a limited number of printed back-ups for students in class who experience technical difficulties.", "You will need to have a reliable internet connection and functional computer to complete the exams.", "Emails can be received 24 hours per day.", "If you miss a make-up exam for any reason, you will be given a DNW, and must petition the Associate Dean of Science if you feel you missed it for a valid reason.", "At the discretion of the instructor, you may be permitted to write a make-up exam.", "The timing will be conveyed to you via e-mail if you are eligible for a make-up.", "If you follow these steps,", "I will consider granting an extension", "Students are responsible for their own behavior and should be mindful of the impact that their actions have on the wellbeing of others.", "Act in a respectful and open manner when listening to the views and ideas of others.", "Participate fully in the discussion boards: make sure your answers are to the best of your ability and that you respond to others’ posts.", "Signature"]}, {"course_id": 10, "course_code": "BIOL 240", "course_name": "BIOL240 - Fundamentals of Microbiology (0.50)", "term_name": "List 2", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["S. Ruffell", "Instructor: Sarah Ruffell", "Introduction to the biology of bacterial and archaeal organisms.", "Topics include cell structure and function, methods of cultivation, genetics, phylogeny and taxonomy, and metabolic and genetic diversity.", "The course is intended to provide basic knowledge of the world of microorganisms and consideration of how we study the activities of these small inhabitants of the planet.", "The knowledge gained in this course will also prepare you to succeed in more advanced courses in microbiology, microbial ecology, and molecular biology.", "Explain the impact of microbiology on the evolution of life and on human society.", "Describe the diversity of bacteria, archaea, and microbial eukaryotes and differentiate between the three domains of microbial life based on key characteristics.", "List nutritional categories of microbial metabolism and identify appropriate methods for cultivating microorganisms from these categories.", "Explain how microorganisms regulate gene expression in order to compete for limited energy and nutrients.", "List methods and mechanisms for exchange and manipulation of microbial DNA.", "Describe how modern molecular methods have impacted microbiology.", "Course Introduction", "John Wiley & Sons Canada, Ltd.", "Microbiology 3rd edition -- Digital Version", "Emails can be received 24 hours per day.", "Disability-related policies: Policy 58 - Accessibility and Student Academic Accommodation Guidelines"]}, {"course_id": 11, "course_code": "BIOL 354", "course_name": "BIOL354 - Environmental Toxicology (0.50)", "term_name": "List 2", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Notice of Recording", "Environmental Toxicology Fall 2024", "02:30PM - 05:20PM B2 351", "07:00PM - 09:50PM B2 351", "02:30PM - 05:20PM B2 351", "02:30PM - 05:20PM B2 351", "07:00PM - 09:50PM B2 351", "Please bring a reusable mug if you'd like a cup of tea.", "An introduction to the basic theories, principles, and techniques of environmental toxicology.", "A comparative study of the effects of specific groups of toxicants and how they can affect molecular, cellular, and organismal processes will be explored in lectures and through laboratory experiments.", "Know the basic theories, principles and techniques of environmental toxicology.", "Understand how different toxicants move from source to receptor, the concept of dose-response relationships and toxicokinetics.", "Understand the process of assessing toxicity using various toxicity test methods and the understand the physiological impacts of various classes of toxicants.", "Know the scientific terminology and knowledge base necessary to effectively communicate the impact of toxicants on target organisms through an in-person group presentation.", "Follow safety procedures as they relate to working in a toxicology laboratory and handling samples and organisms in the lab.", "Conduct toxicity tests using model organisms to assess the effects of pollutants.", "Describe how bioassays are used to estimate toxicity in environmental toxicology.", "Interpret and analyze the results of toxicity experiments, draw appropriate conclusions supported by the data in the format of a laboratory report.", "Week 2 Dose-Response Relationships & Toxicity Test Methods Chapter 4 Sections 4.3.2.", "no grade**", "no grade**", "Week 8 Survey of Toxic Substances - Inorganic & Organic Contaminants", "2,4-D", "2,4-D", "**", "Official Grades and Course Access", "Few are available on loan in the lab (first come, first served)", "WHMIS training checked for completion during the first lab Yes", "At the discretion of the instructor, you may be permitted to take a make-up exam.", "The make-up exam may be of different format than the missed examination (e.g. oral examination for the make-up).", "The Lecture Minute Paper activity will be followed by a discussion Indigenous Learning Circles that provide an opportunity for relational and reciprocal learning, fostering critical thinking, problem-solving skills, increased engagement, and community building.", "Lab Activities & Assessments", "Notice of Recording", "Don’t waste your time with these requests!", "Library for research-based assignments"]}, {"course_id": 15, "course_code": "ENVS 200", "course_name": "ENVS200 - Field Ecology (0.50)", "term_name": "List 2", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Field Ecology Winter 2025", "**We aim to respond to forum posts and necessary emails within general workday hours (8:30 AM – 4:30 PM) and within 24hrs, except over weekends and holidays.", "Introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "View requirements for ENVS 200", "Such knowledge, called ecoliteracy, will provide a critical basis for your engagement in the 21st century, the “century of the environment”—not least because so many of the environmental issues we face derive in part from a limited understanding of how we are embedded within and dependent upon ecological systems.", "Field ecology necessarily harbours an ethical component both because of our natural affinity for life (or ‘biophilia’) and because questions of ecological ‘impact’ and 'quality’ are necessarily value-laden.", "In summary, this course introduces the main concepts and principles of ecology; the cycling of elements; energetics and structural organization of major ecological systems; population dynamics; impact of natural resource management practices and urban and industrial development on the environment; incorporating environmental quality considerations into development activities.", "The lab sessions include field trips to study natural and disturbed ecosystems, urban and applied ecology.", "By the end of this course, you should be on a path to life-long learning as an ecologically-literate citizen.", "Demonstrate how these principles apply to real-world situations (in context of lab activities, assignments, and labs), including human interactions with the natural world.", "Articulate the elements of scientific inquiry as they apply to ecology/", "These course learning outcomes will not only prepare you to be an informed citizen and member of the community of life on earth, but also provide the basis for knowledge, humility, and wisdom in your dealings with ecological problems in your daily life and eventual career.", "Week Number", "Introduction and indicator species: Bird identification Lab 1:  Survey completed and submitted in lab (2%)", "3. Jan 21 *Conditions and Resources; Climate and Biomes", "You should review the course “reading guide” in LEARN before reading because you are not responsible for all textbook sections and vocabulary.", "demonstrate how these principles apply to real-world situations, including human interactions with the natural world Readings, Labs, Discussion board Weekly lecture quizzes and activities, exams, lab activities, discussion forums", "These experiences are intended to help you apply ecological concepts in real-world contexts while building valuable field skills.", "Simply missing a deadline and later mentioning registration with Accessibility Services will not be considered sufficient.", "Appeals and grievance", "Availability for exams", "These slides are meant to be a template for your note-taking: they will not replace careful attention, note-taking and participation.", "Along with the University of Waterloo and the Faculty of Environment and its Departments, I consider your well-being to be extremely important.", "Writing and communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "However, there may be instances during lectures where AI usage is allowed after receiving clear verbal permission from the professor.", "Students are responsible for following these guidelines and seeking clarification when needed.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 20, "course_code": "CHE 571", "course_name": "CHE571 - Industrial Ecology (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Industrial Ecology Fall 2024", "04:00PM - 05:20PM", "Industrial ecology is a rapidly growing field that systematically examines local, regional, and global uses and flows of materials and energy in products, processes, industrial sectors, and economies.", "It focuses on the potential role of industry in reducing environmental burdens throughout the product life cycle from the extraction of raw materials to the production of goods, to the use of those goods and to the management of the resulting wastes.", "This course will review the environmental issues associated with chemical industries and the roles of engineers to manage these issues.", "The principles and philosophy of green chemistry will be addressed including pollution prevention in unit operations.", "The concepts and practices of environmental life cycle analysis and accounting will be addressed in detail, together with the basics of risk assessment, management and communication.", "View requirements for CHE 571", "Introduction to sustainability and industrial ecology", "Brief overview of the scientific evidence for climate change", "Environmental Law in Canada; due diligence as a defence", "Climate legislation in Canada; carbon trading", "Describe the key principles of industrial ecology, sustainable development and sustainability engineering [1d,8a,9a].", "Explain the science of global warming and climate change [", "Apply carbon accounting standards to develop greenhouse gas emission and reduction estimates for inventories and reduction projects [", "Describe key environmental legislation in Ontario and Canada [8b,9a]", "Basics of sustainability and industrial ecology.", "Introduction to greenhouse gas (GHG) accounting.", "Week 5 GHG accounting - offset systems.", "A timed multiple-choice component.", "3.0 points - solutions are complete, correct and well-presented.", "2.0-2.5 points - solutions are mostly complete and well-presented but have minor errors, missing information.", "Intellectual property includes items such as:", "Graduate Attribute Program Indicators", "A knowledge base for engineering: Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the program.", "1a Demonstrate understanding of concepts in mathematics.", "1b Demonstrate understanding of concepts in natural science.", "1c Demonstrate understanding of engineering fundamentals.", "1d Demonstrate understanding of specialized engineering knowledge.", "2. Problem Analysis: An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "3. Investigation: An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "3a Create investigative studies of complex engineering problems.", "3b Gather information from relevant sources to address complex engineering problems.", "4. Design: An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, economic, environmental, cultural and societal considerations.", "4a Define design requirements and specifications for complex, open-ended engineering problems.", "4b Critically evaluate and compare design choices.", "7. Communication skills: An ability to communicate complex engineering concepts within the profession and with society at large.", "Professionalism: An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "8a Articulate the roles and responsibilities of the professional engineer in society with reference to the protection of the public and its interest.", "Impact of Engineering: An ability to analyze social and environmental aspects of engineering activities.", "Such abilities include an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society; the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Analyze the social, health, safety, and environmental aspects of an engineering project, incorporating sustainability considerations and environmental stewardship in making decisions.", "10a Identify ethical and unethical behavior in professional situations.", "10b Identify how an engineer is accountable to multiple stakeholders in engineering practice.", "Life-long Learning: An ability to identify and to address their own educational needs in a changing world to sufficiently maintain their competence and contribute to the advancement of knowledge.", "12a Identify gaps in their knowledge, skills and abilities.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 26, "course_code": "ENVE 577", "course_name": "ENVE577 - Engineering for Solid Waste Management (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Attention is given to the engineering design and operational aspects of the control of generation, storage, collection, transfer and transport, processing and disposal of solid wastes in landfill site.", "Design of natural attenuation sites and system reliability features for landfill designs.", "Topics include waste characterization, collection systems, transportation, treatment technologies, landfill design, recycling, waste-to-energy systems, greenhouse gas impacts, and policy frameworks.", "Understand the composition and generation rates of solid waste", "Analyze waste collection, segregation, and treatment methods", "Design components of solid waste management systems (e.g., landfills, composting systems)", "Explore innovative technologies for resource recovery, recycling, and waste-to-energy processes", "Module 1: Introduction to Solid Waste Management", "Definition and types of solid waste", "Examples of waste management systems from different regions", "Calculate the waste generation rate (WGR) per capita for a given dataset and project future WGR trends using population growth models", "Jan 9 Waste Generation and Characteristics", "Physical, chemical, and biological characteristics", "Typical components and composition of waste", "Hazardous wastes and recycling streams", "Introduction to waste composition audits", "Calculate the environmental impact using simplified LCA metrics for waste scenarios", "Jan 16 Lifecycle Analysis and Waste Hierarchy", "Jan 21   Waste Collection Systems", "Door-to-door collection", "Community bins and transfer stations", "Equipment used in collection", "Estimate transportation costs for different modes of waste transfer (e.g., by truck, rail) based on distance, fuel costs, and waste tonnage", "Operations and routing strategies", "Design and function of transfer stations", "Jan 28   Temporary Storage Solutions", "Design of storage bins and containers", "Safety considerations", "Calculate the capacity needs of storage containers", "based on waste generation rates and collection frequency", "Role of public awareness", "Estimate biogas yield from anaerobic digestion of organic waste using stoichiometric calculations", "Process design and optimization", "Applications and challenges", "Incineration: principles and applications", "Pyrolysis and gasification", "Calculate energy recovery from the incineration of municipal solid waste using calorific values", "Design of Material Recovery Facilities (MRFs)", "Challenges in recycling", "Technical, environmental, and economic considerations", "Assess the efficiency of a WTE plant using energy balance equations", "Definitions and frameworks", "Composting and anaerobic digestion as mitigation techniques", "Site selection and design", "Leachate and gas management", "Design a landfill’s leachate collection system based on given permeability and rainfall data", "Operational strategies", "Post-closure monitoring and land reuse", "Environmental and health impacts", "Strategies for remediation", "*TBD", "Mar 13 Analysis and Design of Solid Waste Management Infrastructure", "Design and operation of materials recovery facilities", "Overview of thermal methods and biological processes", "Mar18                          Digital and Smart Solutions for SWM", "Data analytics for waste tracking", "*TBD", "Tools and methodologies", "Challenges and solutions", "Innovations in SWM policies", "** Note:", "Design Project 25%", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, such as practical analysis and critical thinking.", "Library for research-based assignments"]}, {"course_id": 27, "course_code": "ME 452", "course_name": "ME452 - HVAC Load Analysis and Design Fundamentals (0.50)", "term_name": "List 3", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Notice of Recording", "HVAC Load Analysis and Design Fundamentals Winter 2025", "11:30AM - 12:20PM RCH 305", "Email: hasan.habib@uwaterloo.ca", "Duct design and fan selection.", "Heating and cooling load calculations.", "Infiltration and exfiltration.", "B. Be able to fully design an air conditioning and ventilation system", "C. Be able to perform heating and cooling load, and preliminary energy use calculations for buildings", "D. Have developed the ability to apply their knowledge in a real-world setting (practical experience)", "E. Be capable of communicating effectively with industry professionals and clients", "F. Have developed the skills to research and interpret information needed to remain current in the field", "Module 1: Introduction to HVAC:  History, ASHRAE, Unit Systems (chap.", "Module 2: Air Conditioning and Ventilation: Fundamental Concepts of HVAC/Air Conditioning Systems (chap.", "3), Fans and Air Distribution Systems (chap. 16).", "A tentative checklist of material to be reviewed each week will be posted in Learn.", "Midterm Exam: will be held in two parts during scheduled lecture time.", "You can also present case studies of interesting buildings or even a biographical review of someone who made an impact to HVAC.", "A) Develop an appreciation and understanding for the various codes, standards, and guidelines that determine HVAC design practices X    X", "B) Fully specify and design an air conditioning and ventilation system   X", "C) Perform heating and cooling load, and preliminary energy use calculations for buildings     X", "F) Develop the skills to research and interpret information needed to remain current in the field X", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "Library for research-based assignments", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 29, "course_code": "CIVE 230", "course_name": "CIVE230 - Engineering and Sustainable Development (0.50)", "term_name": "List 4", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Engineering and Sustainable Development Spring 2024", "10:00AM - 11:20AM RCH 301", "nadine.ibrahim@uwaterloo.ca", "nadine.ibrahim@uwaterloo.ca", "This course introduces the concept of sustainability and how it applies to decision-making in civil engineering.", "The course begins by defining sustainability, both practically and technically, and describing the concepts of systems, and systems interactions.", "Economic concepts and their applicability to sustainability are described for both developed and developing countries.", "Sustainability concepts covering the triple bottom line are presented, and their applicability to sustainability are described.", "First, the qualitative concepts and background information is presented.", "I’ll be teaching sustainable development and its connection to engineering using both a qualitative and quantitative understanding of sustainability.", "Qualitatively, this involves describing sustainability objectives, trends, current conditions and future projections, and to have a technical and public understanding of sustainability challenges.", "Quantitatively, this involves modeling environmental parameters using linear programming, differential equations, regression and extrapolation, and understanding the metrics used for sustainability assessments.", "I believe students have different strengths, where the diversity of coursework will leverage individual strengths and give everybody a chance to shine!", "I encourage you to read the announcements on a regular basis and stay up to date.", "IDENTIFY: Identify implications of human activities on the three dimensions of sustainability", "QUANTIFY: Quantify sustainability indicators to assess trade-offs", "DEMONSTRATE: Demonstrate course concepts to assess sustainability in global cities", "Relate course concepts to everyday activities and living experiences", "TBD", "Introduction to Engineering and the Environment.", "Introduction to Environmental Engineering and Science 3rd Edition, Prentice Hall.", "Some situations can warrant exceptions - speak to your instructor about these, and I’ll do my best to accommodate extenuating circumstances.", "Lecture topics will be presented in multiple formats to provide flexibility for different users and learning preferences.", "A knowledge survey on your thoughts and experiences with sustainability concepts and practices", "This will be open in the first and last weeks of term.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 30, "course_code": "EARTH 456", "course_name": "EARTH456 - Numerical Methods in Hydrogeology (0.50)", "term_name": "List 4", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Numerical Methods in Hydrogeology Winter 2025", "An introduction to the theory and practice of groundwater flow and contaminant transport modeling.", "Topics related to variably-saturated flow will focus on derivation of Richard's equation, a control volume finite difference discretization, assembly and solution of the flow equation, material balance error, truncation error analysis, stability and monotonicity.", "Explain the fundamental theory behind groundwater flow and contaminant transport modeling", "Apply numerical techniques, including control volume finite difference discretization, to solve groundwater flow and contaminant transport equations.", "Analyze numerical model accuracy, including material balance error, truncation error, stability, and monotonicity in variably-saturated flow and contaminant transport problems.", "Use a modeling software to model variably-saturated flow and contaminant transport.", "Interpret and visualize groundwater flow and contaminant transport model results and communicate findings effectively.", "Identify the concepts of groundwater and solute transport modeling and their real-world applications.", "Section 1.1 Derivation of Richards' Equation", "Section 1.2 Derivation of Richards 'Equation – Pressure Head Formulation", "Section 1.3 Three-Dimensional Groundwater Flow", "Derive and interpret three-dimensional groundwater flow dynamics and their mathematical representation.", "Section 1.4 Control Volume Finite Difference Discretization for Flow", "Section 1.5 A Rigorous Derivation of the Control Volume Finite Difference Discretization", "Develop, apply, and justify control volume finite difference discretization techniques for groundwater flow problems, demonstrating a rigorous understanding of mathematical principles.", "Assemble and implement saturated groundwater flow equations in numerical models using discretized formulations.", "Assemble the saturated groundwater flow equation using control volume discretization.", "Analyze groundwater flow material balance errors and their implications for numerical model accuracy.", "Section 1.8 Truncation Error Analysis", "Section 1.8 Truncation Error Analysis", "Section 1.9 Stability and Monotonicity", "Section 2.1 Derivation of the Contaminant Transport Equation", "Analyze the stability and monotonicity of numerical methods for groundwater flow models.", "Derive the contaminant transport equation and articulate its role in modeling solute movement through porous media.", "Section 2.1 Derivation of the Contaminant Transport Equation", "Section 2.2 Control Volume Finite Difference Discretization of the Contaminant Transport Equation", "Section 2.3 Central Spatial Weighting of Advective Flux", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Apply control volume finite difference discretization to the contaminant transport equation for numerical modeling.", "Section 2.3.1 Truncation Error of Central Spatial Weighting", "Section 2.4 Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.5 Upstream Spatial Weighting of Advective Flux", "Section 2.5.1 Truncation Error of Upstream Spatial Weighting", "Section 2.6 Crank-Nicolson Temporal Weighting with Upstream Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.7 Assembly of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Section 2.7.1 Monotonicity of Crank-Nicolson Temporal Weighting with Central Spatial Weighting", "Analyze truncation errors in various spatiotemporal weighting methods to evaluate their impact on numerical accuracy.", "Section 2.8 Assembly of Fully-Implicit Temporal Weighting with Upstream Spatial Weighting", "Section 2.8.1 Monotonicity of Upstream Spatial Weighting with Fully-Implicit Temporal Weighting", "Section 2.9 Boundary Conditions for Transport Coupled to Flow", "Analyze the accuracy of various contaminant transport weighting schemes and their impact on numerical model performance.", "Apply boundary conditions for contaminant transport coupled with groundwater flow and assess material balance errors to ensure reliable numerical simulations.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "This option is only relevant in the case where the arithmetic mean grade on your assignments is greater than 75% and your final exam mark exceeds the arithmetic mean of the assignment marks.", "The total maximum bonus points that can be earned across all five assignments is five.", "Students can earn bonus points by actively participating in discussions or helping their peers understand the course material and assignments.", "Explaining a challenging concept to peers in a collaborative study session.", "A maximum of five contributions will be allowed per assignment."]}, {"course_id": 31, "course_code": "EARTH 458", "course_name": "EARTH458 - Physical Hydrogeology (0.50)", "term_name": "List 4", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 6, "major_name": "Environmental Engineering Option", "topics": ["Notice of Recording", "Field Methods in Hydrogeology Fall 2024", "08:30AM - 09:50AM DWE 3519", "An introduction to the principles and theories of mineral deposit genesis.", "Basic technical, economic, legal, and ethical aspects of mineral exploration and responsible development of natural resources are also covered.", "View requirements for EARTH 458L", "Applied geophysics provides geoscientists with a wide-range of non-invasive methods for characterizing the Earth's interior.", "This course is an introduction to the physical principles underlying field acquisition, processing, and data interpretation for commonly used applied geophysical techniques (seismic, electrical, electromagnetic induction, gravity, and magnetic methods).", "This course is not only pertinent for geoscientists but also for engineers and others interested in learning how physics can be used to explore the Earth's interior or perform non-destructive testing.", "Near-surface geophysics is used to characterize the shallow subsurface for a wide-spectrum of applications.", "This application-oriented course covers current methodology in near-surface geophysics, including electrical, electromagnetic, ground penetrating radar, seismic refraction, and well-logging methods.", "Techniques for geophysical data acquisition and interpretation are studied and applied to field data.", "Examples of the application of geophysical techniques to archeological, forensics, geotechnical, glaciology, and hydrogeological problems are examined.", "View requirements for EARTH 461", "A field-oriented course on current methodology in the general area of geotechnical or engineering geophysics as applied to environmental problems.", "Typical topics covered: well logging and time domain electromagnetic surveys for groundwater supply; magnetic and terrain conductivity surveys for waste materials; ground penetrating radar applications to stratigraphy and contamination; streaming potential surveys of dam leakage.", "A pre-lab quiz must be completed before attending each field lab.", "Labs will be completed in groups with field data recorded in field books or datasheets.", "These data will be used to a complete individual lab assignment.", "This site contains over 100 groundwater monitoring wells.", "Field lab activities involve:", "(3) Measurement of in-situ hydraulic conductivity using single-well response tests", "Each lab will provide you with a unique dataset that you will use to develop a conceptual site model of the local groundwater flow system.", "• Properly construct and interpret soil core logs using United Soil Classification System, and make lithostratigraphic interpretations using geophysical logs", "• Assess and interpret water level measurements through the construction of water table maps and flownets", "• Interpret single-well response tests including falling and rising head (slug) tests to determine in-situ hydraulic conductivity", "• Interpret hydraulic pumping tests to determine aquifer transmissivity and storage parameters and assess water resource vulnerability", "Each module will contain a series of recorded lecture slides and video demonstrations reviewing core concepts and guidelines for the upcoming field lab.", "Please include “Earth 458L” in the subject line of all e-mail communications as well as your Full Name and Student ID# in the text of the email.", "Hydrogeological equipment to make measurements and collect data (temporary use)", "Specialized hydrogeological software to complete certain assignments", "Datasheet to record field data", "Other data should be recorded in your field books and distributed to your group members as needed.", "Do not submit a series of cell phone photos of your assignment!!", "Must be uploaded to the appropriate Dropbox folder", "Notice of Recording", "Participation in Field Labs:", "These quizzes are designed to keep you on schedule and prepare you for the in-person field lab and assigned activities.", "There will be a 48-hour grace period to finalize the submission of your assigned activities without incurring any late penalty."]}, {"course_id": 2, "course_code": "CIVE 332", "course_name": "CIVE332 - Civil Systems and Project Management (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Civil Systems and Project Management Winter 2025", "10:00AM - 11:20AM MC 2066", "INSTRUCTOR:    Muhammad Bilal, E2-3328 m25bilal@uwaterloo.ca", "E2-3328", "E2-3321", "Introduction to conceptual planning, construction, management, optimization, and life-cycle performance assessment of civil engineering systems including capital projects.", "Fundamentals of decision theory including concepts of risk, uncertainty, utility, probability, value of information, and game theory.", "Tools for supporting decision-making process, including linear and integer programming, network models, optimization, and Monte Carlo simulation.", "Risk- and cost-benefit analysis of public projects and their impact on sustainability, and quality of life.", "Design, model and analyze some civil engineering systems and understand their complexity;", "Choose and effectively apply tools and methods to improve civil engineering systems performance;", "Apply fundamentals of decision analysis, utility and game theory to assess and quantify risk, uncertainty, and expected utility used in decision-support systems;", "Demonstrate the use of project management tools and methods to applications in planning, scheduling, and estimating on engineering projects; and", "Mathematically and numerically formulate, structure and solve optimization problems (single/multiple/linear/integer/non-linear) using multi-criteria decision-making methods, including assessing sensitivity of decisions.", "PART 1 – Systems Theory: Design Methodology", "PART 1 – Systems Theory: Complex Systems + Review", "Linear Programming Intro", "PART 4 – Optimization: Linear Programming", "Multi-objective programming", "Linear programming models of network flow", "Linear programming models of network flow", "Integer and Mixed Integer Programming"]}, {"course_id": 3, "course_code": "CO 250", "course_name": "CO250 - Introduction to Optimization (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Introduction to Optimization Winter 2025", "walaa.moursi@uwaterloo.ca", "Instructor: Walaa Moursi walaa.moursi@uwaterloo.ca", "A broad introduction to the field of optimization, discussing applications, and solution techniques.", "Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms.", "Carry out the computations by hand for simple instances of various algorithms such as the Simplex.", "Formulate the dual of various linear programs.", "Reproduce the main proofs in the course and prove simple related concepts independently.", "The simplest models are linear programs where both the constraints and the objective functions are linear.", "Even though this may appear at a first glance to be overly restrictive, linear programming algorithms are used widely across most branches of industry.", "In these cases, we would like to add the condition that some variables in our linear program take integer values only.", "These models are known as integer programs.", "Finally, in certain instances, such as portfolio optimization (in financial mathematics), the natural way of formulating the optimization problem may require the use of non-linear constraints, or a non-linear objective function.", "In the first part of this course, we will illustrate these various models with examples that arise from real problems.", "The Simplex algorithm to solve linear programs will be discussed in some detail and general-purpose integer programming techniques such as branch-and-bound and cutting planes will also be described.", "These algorithms while guaranteed to terminate, may in the worst case (and often do in practice) take a prohibitively long time.", "An indispensable tool for the design of such fast algorithms is the theory of duality, which will be a main focus of this course.", "We will move towards the conclusion of the course with a review of the various techniques used to solve linear and integer programs and by providing a geometric interpretation of these algorithms.", "This discussion will lead us to non-linear convex optimization problems.", "Also included in this last part of the material are approximation algorithms.", "Shows a linear programming polytope together with a possible path (red) taken by the simplex method to solve the corresponding LP.", "A Gentle Introduction to Optimization - Digital Version", "A Gentle Introduction to Optimization - Print Version", "You can access a free trial of your eTextbook from the Course Information module in LEARN.", "Details of the delivery of the midterm are to be posted in the second week of classes.", "This is a closed-book exam.", "A grade of INC (incomplete) will be only awarded to students who cannot write the final examination for reasons acceptable to the instructor, such as a medical certificate by a recognized medical professional provided to the instructor promptly."]}, {"course_id": 31, "course_code": "BME 364", "course_name": "BME364 - Engineering Biomedical Economics (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Notice of Recording", "Engineering Biomedical Economics Fall 2024", "09:30AM - 10:20AM E5 6006", "10:30AM - 12:20PM", "08:30AM - 09:20AM", "This course examines key economic issues in health care and biomedical industries.", "Topics include the market for medical care, health insurance, various models of healthcare delivery and competition and the role of government in policy, financing and delivery of health care.", "This course will train students to use economic analysis to model and understand the complex interactions between health care delivery, insurance markets, health innovators, governments, and firms.", "Articulate differences between healthcare systems and how incentives affect the system economics.", "Articulate differences between healthcare systems and how incentives affect the system economics.", "Investigate a research topic in the area of health economics.", "Apply cost-benefit analysis to aid in healthcare decision making.", "A knowledge base for engineering:   Demonstrated competence in university level mathematics, natural sciences, engineering fundamentals, and specialized engineering knowledge appropriate to the biomedical engineering program.", "2. Problem analysis:  An ability to use appropriate knowledge and skills to identify, formulate, analyze, and solve complex engineering problems in order to reach substantiated conclusions.", "Investigation:  An ability to conduct investigations of complex problems by methods that include appropriate experiments, analysis and interpretation of data, and synthesis of information in order to reach valid conclusions.", "4. Design:  An ability to design solutions for complex, open-ended engineering problems and to design systems, components or processes that meet specified needs with appropriate attention to health and safety risks, applicable standards, and economic, environmental, cultural and societal considerations.", "7. Communication skills:  An ability to communicate complex engineering concepts within the profession and with society at large.", "Such ability includes reading, writing, speaking and listening, and the ability to comprehend and write effective reports and design documentation, and to give and effectively respond to clear instructions.", "Professionalism:   An understanding of the roles and responsibilities of the professional engineer in society, especially the primary role of protection of the public and the public interest.", "Such ability includes an understanding of the interactions that engineering has with the economic, social, health, safety, legal, and cultural aspects of society, the uncertainties in the prediction of such interactions; and the concepts of sustainable design and development and environmental stewardship.", "Life-long learning:  An ability to identify and to address their own educational needs in a changing world in ways sufficient to maintain their competence and to allow them to contribute to the advancement of knowledge.", "The Labor Market for Physicians", "7. Demand for Insurance", "Adverse Selection in Real Markets", "Pharmaceuticals and the Economics of Innovation", "The Economics of Health Externalities", "*", "The Contribution and Effects of the Country’s Healthсare Sector on its GDP", "Healthcare as a Basic Human Right: The Pros and Cons of Providing Free Healthcare", "A Look at the Feasibility of a Universal Health Care System", "Methods to Reduce the Risk of Adverse Selection", "The Differences between Moral Hazard and Adverse Selection and their Effects on Health Economics", "The Need to Educate Patients on the Costs Added to their Medical Bills", "The Role of Medical Resources in Increasing Life Expectancy Numbers", "Reasons Patients Should Select Larger Medical Facilities to Avoid Costly Treatments", "The Adverse Effects of an Unplanned Influx in Health Care on the Overall Economic Balance", "The Role of a Stronger Health Care System and Nutrition Programs on the Throughput of the Employed Masses", "Notice of Recording"]}, {"course_id": 36, "course_code": "SYDE 262", "course_name": "SYDE262 - Engineering Economics of Design (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Notice of Recording", "Engineering Economics of Design Fall 2024", "jessie.ma@uwaterloo.ca", "11:30AM - 12:20PM E7 4433", "jessie.ma@uwaterloo.ca", "Jessie Ma | jessie.ma@uwaterloo.ca | E7-6304", "Topics include microeconomics, supply, demand and external costs in the context of systems design.", "Evaluate and compare alternatives for an engineering firm's financial decisions (GA 11a, 11b)", "Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)", "Create a business plan for an engineering firm, accounting for uncertainty in economic and environmental aspects (GA 9a, 9b)", "Identify external costs in the context of systems design, including the use of sustainability indicators (GA 9a, 9b)", "1 Sep 2 Introduction Introduction", "3 Sep 16   Decision Making - Cash Flow Series Patters Assignment 1 posted Evaluate and compare alternatives for an engineering firm's financial decisions (GA 11a, 11b) Excel", "4 Sep 23   Decision Making 2 - Basic Evaluation Methods   Evaluate and compare alternatives for an engineering firm's financial decisions (GA 11a, 11b) Excel", "5 Sep 30   Decision Making 3 - Analysis Period & Project Lives; Risk Analysis Assignment 1 due Oct 4 Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)  Excel", "6 Oct 7 2. Context - Looking Outside Entrepreneurship   Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)", "9 Oct 28   Intrapreneurship; Evaluation of Complex Projects (Replacement Analysis, Life Cycle Costs, Benefit-Cost Analysis) Group Project posted Understand how economic forces affect an engineering firm and product design (GA 11a, 11b)", "Identify external costs in the context of systems design, including the us of sustainability indicators (GA 9a, 9b)", "Identify external costs in the context of systems design, including the us of sustainability indicators (GA 9a, 9b)", "12 Nov 18   Business Plans; Markets   Create a business plan for an engineering firm, accounting for uncertainty in economic and environmental aspects (GA 9a, 9b) Excel", "Notice of Recording", "Sign your email with your first and last name and your student number.", "There could be a need to make alternate arrangements for in-person course activities.", "This alternate arrangement could be for a short period of time (e.g., one week) or a more sustained disruption to in-person course activities.", "Impacted in-person deliverables will be handled on a case-by-case basis with notification provided as soon as possible (see COVID-19-Related Absences and Short-Term Absences below).", "They will review your case and coordinate a reasonable and fair plan in consultation with appropriate others.", "Laptops, Tablets, and Electronic Devices", "Even if students are unsure of whether they qualify for A.A.S. support, an A.A.S. consultant can talk them through next steps, and refer them elsewhere if appropriate.", "A.A.S. also offers learning strategy supports to all students that can be accessed through:", "Course and Departmental Expectations", "Compassionate and respectful communication: Most online communication between the Department and students will be done through LEARN and/or email.", "Along with the right to make adult decisions comes the responsibility and accountability for those decisions and any outcomes.", "The Department of Systems Design Engineering follows University of Waterloo’s general policy: students who self-elect to forgo a deliverable receive a “0” for that deliverable.", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 40, "course_code": "ECE 457B", "course_name": "ECE457B - Fundamentals of Computational Intelligence (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Fundamentals of Computational Intelligence Winter 2025", "ECE 457B", "Monday, Friday -", "10:00AM - 11:20AM E7 5353", "04:00PM - 05:20PM", "Da Saem Lee : ds3lee@uwaterloo.ca", "Communication and Discussion", "If you really have a critical time issue, or you don't want the TA's to see the message (for any reason at all), then you should send Prof. Crowley a direct message on Teams chat in addition to email.", "Model-based prediction and classification.", "Multiple examples and case studies such as autonomous driving, intelligent manufacturing, natural language understanding, speech recognition, computer vision, stock market prediction, disease early detection and diagnosis.", "View requirements for ECE 457B", "It encompasses a broad spectrum of supervised learning topics, including nonparametric and parametric models, linear and nonlinear approaches, deep learning paradigms, and probabilistic models.", "Theoretical knowledge is translated into practice through tutorials on industry-standard tools such as PyTorch and Keras.", "Interactive classroom discussions will pivot around both the practical trade- offs inherent in real-world applications and the theoretical underpinnings that provide an intuitive grasp of the field.", "These topics are an outline, and each year some subset of non-core topics will be skipped due to time constraints and in order to benefit students through deeper focus.", "Classification I", "Distance based - k-Nearest Neighbours (kNN)", "Fundamentals of Parameter Estimation and Learning", "MAP Implementation as Classification: Naive Bayes Algorithm", "Dimensionality Reduction and Manifold Learning", "Vector Embeddings : TF-IDF, Word2Vec, BERT", "Kernel Methods and Latent Models", "k-Means Algorithm, DBScan Algorithm", "Anomaly Detection: Classification, Outlier, Density, and Isolation based", "Classification III : Data, Image and Time-series classification using Deep Learning", "Representation Learning II: Auto-encoders and Variational Auto-Encoders", "Attention and Transformer Networks", "Some additional information and links might be here for older courses.", "A visual grading tool for pdfs submissions of tests and assignments, allows limited online test with mark-down text entry and multiple choice questions.", "Some assignments and tests might be made available online for submission using this tool as well.", "Arxiv Tutorials - pdfs will be posted to hypothes.is and others links will be provided to a number of detailed tutorials on some course topics.", "The first half covers many of basics of this course, while the second half focusses on Deep Learning only.", "Exams", "Completing the assignments will require multiple skills:", "familiarity with statistical, probabilistic analysis of data and results", "logical design and clear description of a expeirmental methodology", "programming various algorithms for processing, training and analysis of data to achieve given tasks (programming will be in Python using libraries such as sci-kit learn and tensorflow, pytorch, pandas)", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 45, "course_code": "MSE 211", "course_name": "MSE211 - Organizational Behaviour (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 8, "major_name": "Management Science Option", "topics": ["Sofiia Doroshenko <sdoroshenko@uwaterloo.ca>", "Introduction to the concepts of learning, person perception, attitudes, and motivation in an organization.", "Discussion of power, control, leadership, and management in light of the above concepts.", "The basic objective of the course is to help you to develop both theoretical and practical approaches for analyzing and making sense of individual and group behaviour in organizational situations.", "Demonstrate understanding of basic theories/concepts of organizational behaviour.", "2. Demonstrate understanding of factors that affect the behaviour of individuals and groups in organizations.", "3. Demonstrate understanding of factors affecting communication effectiveness in organizations.", "Introduction                                            Ch 1", "Personality & Intelligence                     Ch 3", "Lewin’s field theory                               Handouts", "Groups & Teams                                    Ch 11", "Communication                                      Ch 20", "This course includes the independent development and practice of specific skills, such as analyzing and writing about organizational situations.", "In cases where there is further clear evidence of plagiarism regardless of AI% score, the work will be submitted to the Associate Dean as a potential academic integrity offence.", "Keep copies of your pre- and post- grammar-corrected drafts in case we ask to see them.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 3, "course_code": "ECE 305", "course_name": "ECE305 - Introduction to Quantum Mechanics (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Notice of Recording", "Introduction to Quantum Mechanics Fall 2024", "ECE 305", "11:30AM -", "04:00PM - 05:20PM", "Introduction to quantization, wave-particle duality, and the uncertainty principle.", "Introduction to approximation methods including time-independent perturbation theory.", "View requirements for ECE 305", "Learn basic mathematics for quantum mechanics", "Understand the fundamental concepts of quantum mechanics: quantization, wave-particle duality, the uncertainty principles", "Learn how to solve Schrödinger equations for exemplary problems: particle-in-a-box, finite-height potential, a harmonic oscillator", "Learn modern applications of quantum mechanics", "Make-Up-F", "Tutorial-Th", "Introduction", "Stern-Gerlach", "Math/Matrix Notation", "Quantum State Vectors", "Linear Algebra", "Ch. 2.3-2.4", "Expectation Values", "Calculating expectation values", "Expectation values", "Schrödinger Equation", "Schrödinger Equation", "Spin Precession", "Energy Eigenvalue Equation", "Schrödinger Equation", "Wavefunction", "Wavefunction", "Wavefunction", "Nov.11-15", "Nov.18-22", "Finite Squarewell", "Nov.25-29", "Quantum Cryptography", "Quantum Mechanics: A Paradigms Approach by David H. McIntyre Yes", "Linear Algebra Lecture Material: https://ece.uwaterloo.ca/~ne112/Lecture_materials/.", "Notice of Recording"]}, {"course_id": 6, "course_code": "PHYS 234", "course_name": "PHYS234 - Quantum Physics 1 (0.50)", "term_name": "Required Courses", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["11:30AM - 12:20PM DC 1351", "K. Islam", "Introduction to formalism of quantum physics.", "Introduction to operators.", "Background: understanding why we need a quantum theory", "Learning the building blocks of a quantum theory: state vectors and operator", "Jan 06, 08, 10 Introduction to Quantum Physics, Stern-Gerlach experiments 1", "Jan 20, 22, 24 Matrix notation, general quantum systems, operators 2", "Mar 10, 12, 14 Continuous quantum systems – formalism, infinite potential well,", "Mar 17, 19, 21 Continuous quantum systems – infinite potential well (continued), finite potential well 5", "Mar 24, 26, 28 Continuous quantum systems – quantum harmonic oscillator 9", "Mar 31, Apr 02, 04 Continuous quantum systems (continued), Review", "Students should start checking for posted exam dates:", "Everyone needs a support system.", "Every student in PHYS 234 is expected to treat their peers and their instructor with kindness, fairness, tolerance, and respect.", "This extends to welcoming the opinions of others and being considerate of their lived experiences."]}, {"course_id": 15, "course_code": "GEOE 223", "course_name": "GEOE223 - Differential Equations and Balance Laws (0.50)", "term_name": "List 1", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Differential Equations and Balance Laws Winter 2025", "10:00AM - 11:20AM RCH 309", "08:30AM - 09:20AM", "An introduction to ordinary differential equations with applications to mass and energy balance problems in engineering.", "Standard methods of solution of first and second order linear equations with constant coefficients.", "Numerical methods for solving ordinary differential equations.", "Many practical physical and engineering problems can be analyzed using mathematical models formulated in terms of ordinary differential equations; these often arise from the application of mass, momentum, or energy balance laws.", "The objective of this course is to equip engineering students with a working knowledge of the methods which are used to solve these equations.", "Differential equations are introduced, along with standard methods of solution for first and second order linear equations with constant coefficients.", "identify and differentiate between the various types of differential equations; with this knowledge, be able to identify the most appropriate method of solution", "pose appropriate boundary or initial conditions and solve that equation using standard methods for given a mathematical problem statement expressed in terms of a linear differential equation", "check whether a solution to a differential equation is correct", "think critically about a mathematical problem and evaluate the validity of results from mathematical methods", "appreciate the utility and value of having an education in mathematics as part of their training as an engineer", "Canadian Engineering Accreditation Board", "Piazza – Wiki-style Q&A; primary way to get & give text-based help in ENVE/GEOE 223", "Drop-in Hours", "Students are very welcome and encouraged to meet with the teaching team in scheduled drop-in hours.", "1 Jan 6-10 CH1: Introductory concepts and definitions, simply integrable and separable solutions", "2 Jan 13-17 CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties, substitution", "3 Jan 20-24 CH3: Applications of linear first-order ODEs", "4 Jan 27-31 CH4: Solving homogeneous linear higher-order ODEs with constant coefficients A1, Jan 28", "6 Feb 10-14 CH6: Applications of linear higher-order linear ODEs", "Reading Week & Family Day", "7 Feb 24-28 CH7: Slope fields and numerical solution of first-order ODEs A2, Feb 25", "Notes of Diffy Qs, Differential Equations for Engineers, Jiří Lebl, Creative Commons, 2024.", "Calculus for Engineers (4e), Donald Trim, Pearson, 2007.", "Common first-year calculus text.", "CH1: Introductory concepts & definitions, simply integrable & separable solutions 0.2,3; 1.1,3 15.1,2", "CH2: Solving linear 1st-order ODEs with integrating factors, linear solution properties; substitution 1.4", "CH3: Applications of linear first-order ODEs 1.4 15.2,3,5", "CH4: Solving homogeneous linear higher-order ODEs with constant coefficients 2.1-3 15.6-8", "CH5: Solving non-homogeneous linear higher-order ODEs with constant coefficients using the method of undetermined coefficients 2.5 15.9", "CH6: Applications of linear higher-order linear ODEs  2.4 15.10", "CH7: Slope fields and numerical solution of first-order ODEs 1.2,7", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:", "extenuating circumstance", "This course includes the independent development and practice of engineering specific skills.", "Campus Supports", "Library for research-based assignments"]}, {"course_id": 20, "course_code": "ME 203", "course_name": "ME203 - Ordinary Differential Equations (0.50)", "term_name": "List 1", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Ordinary Differential Equations Fall 2024", "First and higher order differential equations.", "Linear equations with constant and variable coefficients.", "Systems of linear equations.", "Applications involving simple dynamical systems and principles of mass, momentum and heat conservation will emphasize the role of ordinary differential equations in understanding the behaviour of physical systems.", "Introduction to the Laplace transform method for solving ordinary differential equations.", "Specifically, we define what ordinary differential equations are and how they relate to the physical problems encountered in simplified engineering systems.", "Techniques for solving first and higher order differential equations, linear equations with constant and variable coefficients, and non-linear equations are introduced.", "Applications involving simple dynamical systems and principles of mass, momentum, and heat conservation will emphasize the role of ordinary differential equations in understanding the behaviour of physical systems.", "Classify a differential equation with respect to order and form", "Understand what it means for a function to be a solution to a ODE/IVP", "Use appropriate analytical method(s) to find a solution to different types of ODE problem", "Select appropriate analytical method(s) to solve ODEs", "Formulate simplified models which represent the behaviour of simplified engineering systems", "Find solutions to said simplified models and provide a meaningful interpretation of found solution", "a) Classify a differential equation with respect to order and form", "b) Understand what it means for a function to be a solution to a ODE/IVP", "2. Find explicit solutions to specific classes", "a) Be able to find explicit solutions for particular first or second order ODES and systems of first order equations using a range of approaches which includes the Laplace transform", "b) Determine the correct solution technique to solve a problem", "3. Effectively apply the concepts of differential equations in the analysis of simplified engineering systems", "a) Formulate simplified models which represent the behaviour of simplified engineering systems", "b) Find solutions to said simplified models and provide a meaningful interpretation of found solution", "Linear Independence (Wronskian, Variation of Parameters, & Reduction of Order) ~ 5 Lectures", "Cauchy-Euler & Variable Coefficient ODEs ~ 2 Lectures", "Systems of 1st order ODEs ~ 4 Lectures", "Giordano and Weir:  Differential Equations: A Modelling Approach, Addison-Wesley", "You will be permitted calculators and a single sided (US letter page - 8.5 by 11 inches) cheat sheet where you can write anything you want except worked examples.", "Solutions to these problem sets will be available on LEARN the following Monday.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 27, "course_code": "CIVE 123", "course_name": "CIVE123 - Electrical Circuits and Instrumentation (0.50)", "term_name": "List 2", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Electrical Circuits and Instrumentation Winter 2025", "Monday, Friday -", "10:00AM - 11:20AM RCH 302", "Duty", "E-mail", "Function and characteristics of basic electrical transducers.", "Basics of data acquisition.", "Demos for circuit basics: https://youtube.com/playlist?list=PLDkq31epwdjxzg5AHIOsDk0dry4lAW5Sl", "3 1&2 Current, Voltage, Power and Energy,", "4 2&3 Basic resistive circuit techniques", "9 6 Operational Amplifiers", "10 7 Capacitors and inductors", "12 9 AC Circuit Analysis - I"]}, {"course_id": 29, "course_code": "ECE 140", "course_name": "ECE140 - Linear Circuits (0.50)", "term_name": "List 2", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Notice of Recording", "Linear Circuits Winter 2025", "ECE 140", "ECE 140 001", "03:30PM - 04:20PM E7 5343", "Friday -", "Friday", "04:30PM - 05:20PM", "M. Cooper-Stachowsky", "04:30PM - 05:20PM", "Friday -", "Friday", "ECE 140 201", "08:30AM - 11:20AM E2 3344", "ECE 140 202", "08:30AM - 11:20AM E2 3344", "08:30AM - 11:20AM E2 3344", "ECE 140 204", "01:30PM - 04:20PM E2 3344", "01:30PM - 04:20PM E2 3344", "01:30PM - 04:20PM E2 3344", "ECE 140 101", "08:30AM - 11:20AM E5 4106", "ECE 140 102", "08:30AM - 11:20AM E5 4106", "ECE 140 103", "08:30AM - 11:20AM E5 4106", "02:30PM - 04:20PM DWE 3518", "ECE 140 105", "ECE 140 106", "Section 001 - Computer Engineering", "Email: derek.wright@uwaterloo.ca", "Office: E7-3324", "Bookings include a Teams link when in-person meetings are not possible.", "Section 002 - Software Engineering", "Email: mstachowsky@uwaterloo.ca", "Email:    m4alsaad@uwaterloo.ca", "Katherine Idzik", "Email:    kidzik@uwaterloo.ca", "TAs Name Duty Email", "Avraiem Iskandar Labs a2iskand@uwaterloo.ca", "Analysis of linear circuits.", "Preparing for, conducting, and reporting of laboratory experiments.", "View requirements for ECE 140", "Understand the characteristics and properties of linear electric circuit components", "Analyze intermediate linear circuits under DC, transient and AC operating conditions", "Use (apply) appropriate electronics lab tools for building and debugging intermediate linear circuits", "3.[1-4,6]", "12 Mar 23 Sinusoidal Steady-State Analysis 13.[1,2,4] Tutorial 5", "1 3 Voltage and Current", "3 9 Circuit Analysis Methods", "4 11 Operational Amplifiers", "Notice of Recording", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 35, "course_code": "NE 241", "course_name": "NE241 - Electromagnetism (0.50)", "term_name": "List 2", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 11, "major_name": "Quantum Engineering Option", "topics": ["Electromagnetism Fall 2024", "08:30AM - 11:20AM QNC 2611", "08:30AM - 11:20AM QNC 2611", "08:30AM - 11:20AM QNC 2611", "E-mail", "Coulomb's law, electric field and electric flux, Gauss's law, electric potential, potential and field, magnetic field, Ampere's law, solenoid, electromagnetic induction, magnetic flux, Lenz' law, Faraday's law, capacitors and capacitance, inductors and inductance, Maxwell's equations, electromagnetic fields and waves, polarization.", "Welcome to the NE 241 laboratory!", "In lab 3, you will study different configurations of parallel plate capacitors and measure charge distribution and capacitance for different configurations.", "In lab 4, you will investigate the electric field and potential of different objects using COMSOL software.", "In lab 5, you will measure magnetic fields for different objects, self-inductance, and explore the induced emf concepts.", "F", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 3, "course_code": "CIVE 121", "course_name": "CIVE121 - Computational Methods (0.50)", "term_name": "List 1", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Computational Methods Winter 2025", "08:30AM - 09:50AM RCH 302", "Introduction to computer programming, examples of efficient numerical algorithms for basic scientific computations.", "Programming and problem solving concepts introduced in the course will be incorporated into group projects involving civil, environmental, or geological engineering applications.", "MATLAB is an easy and readable programming language and is an excellent choice for those who are learning programming for the first time.", "Students who complete this course will gain a fundamental understanding of computer programming techniques and be able to operate, analyze, and visualize all types of data for future engineering studies.", "It is an introductory programming course that utilizes MATLAB to illustrate general concepts in computer programming.", "Compose working, efficient, and readable MATLAB scripts in various ways.", "Debug your code to identify and fix programming errors.", "Identify suitable keywords to search for code snippets on the web."]}, {"course_id": 5, "course_code": "CS 116", "course_name": "CS116 - Introduction to Computer Science 2 (0.50)", "term_name": "List 1", "program_name": "Options: Faculty of Engineering", "program_id": 122, "major_id": 12, "major_name": "Software Engineering Option", "topics": ["Introduction to Computer Science 2 Winter 2025", "Monday -", "Monday", "07:00PM - 08:50PM", "E. Dupont", "E. Dupont", "E. Dupont", "10:00AM - 11:20AM MC 4045", "02:30PM - 03:20PM", "08:30AM - 09:20AM", "09:30AM - 10:20AM MC 4042", "10:30AM - 11:20AM MC 4060", "11:30AM - 12:20PM MC 4060", "02:30PM - 03:20PM", "This course builds on the techniques and patterns learned in CS115 while making the transition to use of an imperative language.", "Use higher-order functions to improve the readability and efficiency of programs", "Describe the basic memory model for mutation of basic types, lists, and objects in Python", "Distinguish between constant, linear, quadratic, and exponential running times of algorithms", "Write useful Python programs using console and file input and output for practical tasks", "All times are given in Eastern Time.", "Important!", "In order to maintain a level of success in the course, students should not miss the completion of any modules.", "Students should check their basic tests email to ensure that the code meets the specification exactly.", "Please make sure you do this often!", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}]