[{"course_id": 134, "course_code": "ERS 320", "course_name": "ERS320 - Economics and Sustainability (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Economics and Sustainability Winter 2025", "DWE 1515", "03:30PM - 04:20PM", "In the case of inclement weather, course lectures may shift online.", "View requirements for ERS 320", "We cover multiple perspectives in economics and trace the evolution of key drivers, debates, and policy approaches before turning to new frontiers of research and practice.", "The course format combines interactive lectures with exercises to build skills in economic and policy analysis, technical writing (policy briefings) for specialized audiences, and data analysis and visualization.", "The term will culminate in a poster session on sustainable economic futures with a focus on water, climate, and biodiversity - three areas where economists have prepared major reviews in the last 15 years.", "Describe and compare different economic perspectives on sustainability and development", "Identify trends and debates on the economics of sustainability from a systems perspective;", "Evaluate the strengths and weaknesses of economic methodologies for policy analysis;", "Integrate economic ideas and methods with other disciplinary perspectives in the humanities, natural sciences, engineering sciences and social sciences", "Introduction", "Why economics matters for sustainability", "The evolution of economic ideas about sustainability", "Sustainability economics", "Markets and the commons", "Why and how markets fail; coordination problems; property rights", "Valuing nature", "Frameworks and methods for valuing the environment", "How institutions and incentives shape behaviour and policy", "Defining and applying key concepts", "The Economics of Safe Drinking Water", "Atlas of Water Markets: East Africa and Latin America", "Natural Monopolies & Negative Externalities", "Atlas of Water Markets: South Asia, Southern Europe & North Africa", "The Economics of Biodiversity and Climate Adaptation", "Atlas of Water Markets: Western USA and Australia", "New frontiers of economic thinking about sustainability", "Summit", "Students are expected to attend each class and participate in three ways: critical reading; active engagement in class discussions and debates; and completion of practical exercises during tutorials.", "The mid-term exam, held Feb 26th, will be an in-class exam assessing understanding of core concepts and debates.", "The format will include multiple choice and short essays.", "Each student will be tasked with completing a policy briefing that applies economic concepts and methods to identify the causes of a water sustainability challenge and outline potential solutions.", "Notice of Recording", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 168, "course_code": "FINE 252", "course_name": "FINE252 - Religion in Popular Film (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Religion in Popular Film Fall 2024", "This course examines how religion has been a central concern and inspiration for filmmakers and how popular films have informed and shaped our understanding of religion.", "FINE 252: View requirements for FINE 252", "Religion reflects both humankind's search for meaning and its attempts to maintain particular meanings in the face of cultural challenge and social pressure.", "We use them as ways of establishing shared interests and in-groups, as well as exploring questions both mundane and momentous.", "As our culture passes relentlessly from literacy to visuality, discerning how the various dimensions of religious belief and practice are reflected and refracted in film and television is an important element in understanding the nature of religion in late modern society.", "Engage in critical dialogue with these texts and experiences, with scholars who have contributed to their interpretation, and with each other;", "Improve communication skills through written assignments and class participation; and continue to foster skills in critical thinking and analysis.", "Saved!", "Internet Movie Database", "Journal of Religion and Film", "Discussion Etiquette", "Cross-listed Courses"]}, {"course_id": 186, "course_code": "FR 276", "course_name": "FR276 - Introduction to Literature: Quebec and French Canada (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to Literature: Quebec and French Canada Winter 2025", "08:30AM - 09:50AM ML 354", "Sélectionner des informations pertinentes à travers différentes sources critiques", "La chasse-galerie Introduction aux études littéraires", "La chasse-galerie Réalisme et surnaturel; La représentation de la marginalité", "Méthodologie: Analyser un conte traditionnel", "La poésie entre terroir et exotisme La querelle des régionalistes et des exotiques", "Méthodologie: Analyser un poème - le commentaire de texte", "Méthodologie: La dissertation littéraire", "Cohérence et fragmentation dans les récits contemporains Dissertation littéraire", "La professeure les reverra brièvement, puis les étudiant.e.s auront quelques jours pour terminer leur devoir à la maison.", "La dissertation littéraire", "Remise des travaux", "An INC grade may not be used to complete the entire course.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 208, "course_code": "GEOG 101", "course_name": "GEOG101 - Human Geographies: People, Space and Change (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["04:00PM - 05:20PM", "E-mail: bdoberst@uwaterloo.ca", "An introduction to human geography through key subfields of the discipline, examining population change, the rise of cities, our relationship to nature, social inequalities, economic forms, cultural difference and environmental change at the local and global scale.", "So-called “food geography” is then explored, followed by an examination of the geographic basis of patterns of urbanization, and an exploration of global economic activity.", "The course concludes with a short unit on hazards geography, analysis of global development patterns and processes, and an assessment of human impacts on and sustainability in terrestrial and marine environments.", "For Winter 2025, course content will be delivered through a combination of in-class lectures and self-viewed readings and videos.", "Compare and contrast Human Geography theory with real-world expressions of Human Geography", "Construct solutions which apply Human Geography concepts and skills to real-world sustainability problems", "Course Introduction", "Introduction/Course Overview", "Nature of Geography/Human Geography & Key concepts", "Regions and places", "Spatial Analysis & Interaction", "Mental maps", "Movement, Migration & Environmental refugees", "Population control & EcoFootprints", "Geography of Health & Disease", "Health & Disease", "Food systems and impacts", "Environmental impacts of food", "Food deserts, food miles & lower impact food", "Development theories Economic/Non-economic", "Development Indicators & Development aid", "Urban systems and urban structures", "Urban Sustainability", "Urbanization in Developing Countries/Informal settlements", "Economic Geography", "Economic Activity: Primary sector", "Geography of hazards and disasters", "-Other valid reasons beyond the control of the student (to be approved on a case-by-case basis at the discretion of the instructor).", "Directions:", "Explain why you chose the SDG that you chose.", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Other valid reasons beyond the control of the student (to be approved on a case-by-case basis at the discretion of the instructor).", "In case you are still not convinced, imagine you have an online quiz, begin the quiz, realize you need to check something in the lecture notes, and the system is “down”!", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 224, "course_code": "GEOG 349", "course_name": "GEOG349 - Urban Form and Spatial Structure (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["An examination of the major factors giving rise to distinctive styles of urban spatial organization.", "The best planning practices from developing countries are being used in some western industrialized countries, and vice versa.", "Based on current globalization and learning from best planning practices worldwide, this course will offer comparative analysis of urban spatial structure and urban form, as well as administrative and regulatory implications of urbanization around world.", "Be aware of the evolution of the urban systems in each world region", "Understand the common urban problems and their possible solutions in many cities", "Become familiar with urban form and internal urban structure and how they may be demonstrated in different world cities", "Appreciate a comprehensive set of tools for understanding the changing urban forms", "Become familiar with critical thinking in urban problems and internal structure", "They can expect to learn the elements of clear thinking and to be nurtured in their development to be careful, critical, and innovative thinkers.", "Global knowledge of urban issues and overseas experience: Students should be able to demonstrate an awareness of the environmental, economic, social diversities and interdependences that exist among nations and regions.", "Advanced writing skills: Students should be able to communicate ideas clearly and cogently.", "General Introduction – World Urban Development; Concepts and Definitions", "Introduction to Cities.", "Introduction to Cities.", "WEEK 3. Cities of Middle America; Cities and Systems", "World cities under conditions of financialized globalization: Towards an augmented world city hypothesis.", "Introduction to Cities.", "Chapter 3: Social Theories of Urban Space and Place: Perspectives in the Post-World War II era.", "Introduction to Cities.", "Recommended readings: Introduction to Cities.", "Inequality and Diversity in the Post-World War II Metropolis.", "Introduction to Cities.", "Cities of Sub-Saharan Africa; Integrated transportation and land use planning", "Introduction to Cities.", "Cities of Southeast Asia; Peri-urbanism and Metropolitan Regions", "The real estate turn in policy and planning: Land monetization and the political economy of peri-urbanization in Asia.", "Introduction to Cities.", "Urbanization and Cities in Developing-country Cities.", "Cities of East Asia; Urban heritage and conservation planning", "Heritage conservation and the politics of difference.", "Heritage conservation through planning: A comparison of policies and principles in England and China.", "Cities of Australia and the Pacific Islands; Urban Poverty Alleviation", "Financial development and poverty reduction nexus: A cointegration and causality analysis in Bangladesh.", "The track of this global expedition weaves through nine major regions of the world, exploring significant urban patterns, processes, and internal spatial structure.", "Students are asked to relate the principles of sustainable urban forms to the reflections, since these principles provide a powerful framework for constructing ideas and discussions.", "The concept of urban form and principles of sustainable urban forms should be discussed in the assignment.", "A strong reflection will summarize key course concepts and principles and apply them to personal experience and perceptions.", "Discuss how these experiences have shaped your awareness of the impact of certain urban forms on people’s experience with cities in the countries that we cover in Week 2 to Week 4, your personal values, and your approach to planning/geography.", "Formatting:", "Problem-solving mentalities and skills are crucial for planners and geographers.", "These five categories of tools include 1) planning and building regulation (e.g. intensification); 2) fiscal and non-fiscal incentivization (e.g. special economic zone); 3) direct provision by public and/or voluntary sectors (e.g. public sector involvement); 4) education and awareness-raising (e.g. planning-related open houses); and 5) promotion of behavioral change (e.g. pedestrian friendly public space and TOD design).", "Please note that students must focus on one planning tool for an in-depth evaluation, even if multiple tools are involved in the chosen case.", "A strong report will comprehensively evaluate the chosen planning tool (including its functions, implementations, strengths and weaknesses, and socioeconomic consequences).", "Introduction (2 marks)", "A brief and general reflection on the comprehension and implementations of planning tools (3 marks)", "At least five references regarding the chosen planning tool should be cited.", "Formatting:", "Web searches may be helpful in identifying up-to-date factual material and empirical illustrations, but do not qualify towards an item count of reference materials].", "The essay should at least consist of an introduction, a middle portion presenting major findings, and a summary or conclusion.", "The purpose of the analysis is to present a synthesis and critical analysis of the readings and/or your own reference resources.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 226, "course_code": "GEOG 368", "course_name": "GEOG368 - Ecology and Conservation for Planning (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Ecology and Conservation for Planning Winter 2025", "02:30PM - 05:20PM", "This course provides students with a critical understanding of the relationship between human development and natural environments.", "Students will develop an understanding of core ecological principles and how these can be taken up in plans and policies to promote nature conservation in urban and rural environments.", "The course will include examples of how planners mitigate the environmental impacts of development of land, allotment of open space and parks, and conservation of sensitive areas and species in both urban and rural contexts.", "understand biophysical and ecological processes in urban areas", "plan for biophysical and ecological process when developing and managing the built environment", "Overview of syllabus and foundational concepts", "Get into groups and choose case study for weekly activities and final project", "Spatial patterns and mosaics", "Urban water systems and water bodies", "Urban habitat and vegetation", "Urban features", "Readings", "The ecological and evolutionary consequences of systemic racism in urban environments.", "ECOLOGICAL URBANISM: A FRAMEWORK FOR THE DESIGN OF RESILIENT CITIES Yes 0", "Each quiz corresponds to the theme for each week.", "The first will critically engage with a recent and important contribution from Schell et al.", "Each Reflection Paper should be approximately 500 to 1,000 words and should answer the following questions:", "The case study should describe each of the focal ecological components of the city and develop a plan to improve or enhance the sustainability of these components.", "These will vary week to week, but are designed to prepare students to complete their case study assignment.", "The complete style outline can be found in the Publication Manual of the American Psychological Association, located in the reference section in Dana Porter Library, or on sale in the Book Store.", "APA Frequently Asked Questions - http://www.apastyle.org/learn/faqs/", "University of Wisconsin-Madison Writing Centre: http://www.writing.wisc.edu", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 227, "course_code": "GEOG 411", "course_name": "GEOG411 - The Digital Economy (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["02:30PM - 05:20PM", "Email:                                       daniel.cockayne@uwaterloo.ca", "Email:               s32zaman@uwaterloo.ca", "Beginning with the infrastructures that supports digital systems and entrepreneurship, and with a close focus on entrepreneurial digital media production in Silicon Valley, this course explores the numerous ways that digital systems implicate economic systems, examining social media, attention economies, the sharing economy, digital work platforms, and influencer economies.", "Describe the digital infrastructures and systems that support the digital economy and the geographic histories of their emergence.", "Critically analyze the economic systems that are necessary conditions for modern-day digital media technologies.", "Theorize these phenomena in relation to geographical concepts including the international division of labor and difference in the global economy.", "Topics and reading", "Introduction of the course topics, assignments, and expectations.", "Producing The Digital Economy I: Silicon Valley & San Francisco", "How do we measure ‘success’ in the digital media sector?", "Recode/Decode", "Producing The Digital Economy II: Venture Capital and Inequality", "What are some of the historical and structural implications of venture capital as a financial mechanism?", "Rethinking the venture capital model.", "Social Media and Attention Economies", "Advertising and data allow these companies to run - how do they keep people interested?", "What are some of the perhaps unintended impacts of the rise of social media?", "The Culture of Connectivity: A Critical History of Social Media.", "The Gig Economy - Uber and Airbnb", "How have ‘gig economy’ platforms like Uber and Airbnb changed sectors and industries?", "Are these platforms really different from prior forms of economic activity?", "How does the gig economy relate to concepts like precarity?", "Algorithmic labor and information asymmetries: a case study of Uber drivers.", "The internet allows people to create personas online, and many have found ways to monetize these platforms for themselves, through procuring idealized performances of the self.", "Streamers and influencers make money through sponsorship and through cuts of platforms’ ad revenue.", "What are some of the implications of these shifts?", "Self-enterprising eSports: Meritocracy, precarity, and disposability of eSports players in China.", "What are some of the darker sides of entrepreneurship and privilege that characterize a many digital companies?", "How do these factors affect and implicated offline economies too?", "Content and readings TBD", "Short Analytical Essay Due", "Producing Digital Economies III: Work Platforms and The Planetary Labor Market", "Difference and dependence amongst digital workers: the case of Amazon Mechanical Turk.", "These networks are essential for the functioning of the digital economy as we know it - but they are often unthought and unspoken.", "What outsources and offshored forms of work are necessary to produce computers and smartphones?", "How are race and gender relevant for understanding our daily usage of advanced technologies?", "Indigenous circuits: Navajo women and the racialization of electronic manufacture.", "Whither labor geography and the rise of the robots?", "Social & Cultural Geography 18(3): 435-442.", "This will primarily be in the form of discussion during the weekly seminar framed around the instructor presentation and readings", "You’ll be in groups of 3-4 for discussion - the make-up of these groups may vary throughout the term", "The paper should be primarily critical/analytical in nature – it should not be primarily descriptive/summative", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 257, "course_code": "HLTH 201", "course_name": "HLTH201 - Aging and Health (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["04:00PM - 05:20PM", "A basic understanding of the physical aging process is explored, distinguishing between pathological states/illness and normal change.", "Blended courses are designed to integrate online activities and face-to-face class time to leverage the advantages of each type of instructional modality.", "Evidence supports blended learning as an effective way to learn because it:", "Describe population aging and its impact on society in Canada and worldwide.", "Collaboration", "A slip day is a 24-hour grace period.", "Students can self-declare the following types of absences in Quest.", "This implies that these are integral components of a successful higher education:", "If necessary, you are responsible to seek training in these skills at campus workshops.", "In the case of a submission discrepancy you will be required to provide that email as proof of submission.", "Students who believe they provided valid answers that have not been addressed by the TA are invited to make a case to the instructor after an initial discussion with the TA.", "This course includes the independent development and practice of specific skills, such as searching and identifying relevant information and images, synthesizing ideas, developing logical arguments, and clearly and accurately communicating your ideas.", "Library for research-based assignments", "If you have a name and/or set of pronouns that differ from those that appear in your official university record; and", "You may experience stressors that can impact your personal well-being and academic experience, but there are multiple supports and resources available to you on and off-campus.", "As students, you and those close to you may experience a range of issues that can cause barriers to well-being and learning.", "Everyone needs a support system.", "Accommodations for Racial Trauma", "Have you experienced impacts of racism, racial trauma, racial violence, and are looking for academic accommodation options related to those experiences and impacts?", "A land acknowledgement is a small step towards reconciliation and needs to followed by actions, such as education.", "We recognize aging as an embedded personal history, and the impact of history in the lived experience of older adults, particularly those with past and present histories of oppression and colonialism.", "We acknowledge the historical and current presence and land rights of Indigenous peoples within Canada.", "Intellectual Property and Copyright", "Intellectual property includes items such as:"]}, {"course_id": 262, "course_code": "HLTH 260", "course_name": "HLTH260 - Social Determinants of Health (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Social Determinants of Health Winter 2025", "Dominique Basque    dbasque@uwaterloo.ca", "These inequalities can be seen across various axes including gender, ethnicity, and access to material resources.", "3) Construct and practice engaging in conversations that effectively articulate/explain the social determinants of health and their impacts", "6) Practice using the concepts of respectful dialogue and discussion with peers/class", "Introduction", "Feb 3 Drug Addiction", "'The Life you Want' Addiction and the Far North", "-15 min)", "Prison, Police, and the Carceral System", "Climate and SDH:"]}, {"course_id": 284, "course_code": "INDEV 100", "course_name": "INDEV100 - Introduction to International Development (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Introduction to International Development Fall 2023", "Students obtain an overview of the multi-dimensional and transdisciplinary nature of development.", "Themes include theories and strategies of development; history of development; relevance of context (culture, economics, and politics); the impact of law and international regulatory bodies; environmental influences; urbanization; the factors of health, literacy and violence; development agencies.", "Reference is made to particular development problems in specific developing countries.", "Discriminatory and intolerant language is unacceptable, but openness about these complicated issues is encouraged using thoughtful and respectful language.", "You can expect the instructor to respond to emails within 48 hours exclusive of weekends and holidays.", "To identify and critique the history of International Development concepts, theories, actors, and institutions.", "To explain and assess key development issues in the field of International Development.", "Is International Development legitimate?", "Tentative guest speakers are also indicated in the schedule below.", "Sep 21 Colonialism and Post-Development   Haslam et al.", "Nov 24 Tutorial: The City Water Index & the multi-facetedness of development issues.", "12 Nov 28 Democracy in Development   Haslam et al.", "Introduction to International Development: Approaches, Actors, Issues and Practices.", "Participation is defined in this course as frequent and relevant contributions to in-class discussions, in the form of either questions or comments, that provide new critical insight or knowledge and foster an environment of inclusivity and respect in the classroom.", "Each quiz has 20 multiple-choice questions which cover the main concepts and ideas of the section of the curriculum.", "Do not email the instructor until you have read and completed the following.", "Please be sure to read the rubric before starting your assignment.", "your name and student number;", "**Please note that your mark can be raised, lowered, or remain the same through a re-grade**", "*", "*", "* Please submit your paper for consideration by email to the instructor no later than one week following your receipt of the decision by the TA.", "Include a formal business letter that includes the following information:", "your name and student number;", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 291, "course_code": "INDEV 308", "course_name": "INDEV308 - Introduction to Social Entrepreneurship (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["B. Wylie-Toal", "Email: bwylieto@uwaterloo.ca", "This course uses the case study method to examine the challenges of starting, funding and operating an early-stage social change venture in a developing country.", "Students explore the complexities of managing and sustaining growth, the role of governing boards, and the role of private sector partnerships and resources.", "Environmental issues, including climate change, are some of the most pressing concerns of the 21st Century.", "The first investigates the concept of green entrepreneurship.", "The second part of this course explores the role of strategy and business models in helping to create financial value for the entrepreneur while simultaneously redressing the environmental problem at the core of the business.", "Understand the central concepts of entrepreneurship in general, and green entrepreneurship more specifically", "Apply that knowledge and gain experience in entrepreneurship by identifying, developing and proposing a concept for a new green venture", "Recognize the challenges of navigating ambiguity and gain experience in self-managing your learning", "Course Overview and Introduction to Entrepreneurship", "Foundations: Systems Change, Social Innovation, and Green Entrepreneurship", "Foundations: New venture life cycles and managing venture development", "Milestones: The importance of problems and opportunity recognition", "Milestones: Business strategy and business models", "Milestones: Perceived legitimacy and the start-up pitch", "Five of these activities will be for final grades and will be pass-fail.", "As a class, we will use a stage-gate process to track and manage the progress of each start-up team, giving the whole class visibility into the pace of progress and lessons learned by you and your peers.", "As part of the challenge, each team will complete a problem and solution brief, an overview of the strategy and logic behind the business, as well a business model for the new enterprise.", "In addition to summarizing these details in a final report, each team will pitch their business to the class at the end of the term.", "However, the team contract is due in September and the Pitch is due November 29th.", "Approved Self-Declared Absence Exception to Late Submission Policy:", "Intellectual property includes items such as:", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 292, "course_code": "INDEV 404", "course_name": "INDEV404 - International Development Theory (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["E-mail: c2mccord@uwaterloo.ca", "This course emphasizes both theoretical and conceptual frameworks, techniques, practices and methods for analysis of development, focusing in particular on the development - environment interface and questions of sustainability.", "View requirements for INDEV 602", "This course emphasizes both theoretical and conceptual frameworks, techniques, practices and methods for analysis of development, focusing in particular on the historical and spatial trajectory of international development through an examination of seminal texts.", "View requirements for INDEV 404", "The course involves a mix of lectures and seminars that will involve weekly discussions of the assigned readings linked to case studies.", "This course is designed to provide students with a critical understanding of: 1.", "The meaning of theory", "The meaning of development to different people, agencies and cultures", "The ‘nexus’ between development theory and practice", "5. Key scholars in the field of international development and their philosophical stances", "The role and scope of different actors in international development practice", "Understand the problem motivating the field of sustainable development", "A Primer on Systems Thinking, Reflexivity and Critical Thought.", "Establish the parameters for defining theory", "Critically examine the nexus between theory and practice", "Develop skills in systems thinking, reflexivity, and critical thinking", "In pursuit of this aim, we will review systems thinking, reflexivity, and critical thinking as cognitive schemas to help us understand and evaluate these two dimensions of international development scholarship.", "Investigate the construction of well-being as a concept", "Critique the relationship between economic growth and well-being", "Analyze the link between poverty and well-being", "Overview: The subjectivity of well-being can make us feel confident that we know what well-being is when we see it, but that determination is entrenched in cultural presuppositions about the nature of well-being and the ways that well-being can be pursued.", "In this week, we will explore different understandings of what well-being is and how that conceptualization of well-being can influence development theory and practice.", "Understand the multidimensionality of development", "Critique the relationship between economic growth and development", "The reasons underlying this difficulty often stem from our own assumptions about the nature of development.", "Those assumptions, very often, not only dictate the definition ascribed to development but also direct the path we choose in pursuit of that development.", "During this week, we will confront the various definitions and dimensions of development and investigate how they relate to development theory and practice.", "Understand the historical development of international development", "Identify the precursors to sustainable development", "Critique the trajectory of theories underlying international development", "As a result, the history of development theory can feel like a swinging pendulum with revolutions, reactions and re-inventions defining the trajectory of the field.", "During this week, we will explore the ideas and theories that have come to define the trajectory of development theory and how this history has defined the current conceptualization of sustainable development.", "Evaluate sustainability definitions and criteria", "Define sustainable development and its implications for development practice", "In order to understand sustainability, and its relationship to sustainable development, there are certain cognitive schemas (like systems thinking) that can help to emphasize the often hidden implications of these two terms.", "During this week, we will explore sustainability definitions and their relationship to sustainable development theory and practice.", "Explain the relationship between disaster risk reduction and sustainable development", "Evaluate the theoretical models underpinning disaster risk reduction", "We will then critique the ways in which these concepts align and conflict with sustainable development practice.", "Explain concepts used in sustainability assessment", "Understand the role of community-based methods in sustainability assessment", "Overview: How do we know if our current development practices are sustainable?", "How do we take the theories, frameworks, and criteria that define sustainability and make them practical in our assessment tools?", "As a means of guiding this discussion, we will use the frameworks available in community-based research and development methods.", "As we will see in future weeks, the methods and approaches subsumed by community-based methods can provide a helpful guide for managing and monitoring sustainable development projects.", "Discuss how power shapes development practice", "Investigate the role of democratization in shaping development", "Evaluate the role of community-based methods in shaping development governance", "In this week, we will delve into this discussion and try to define power and its implications for development practice and thought.", "This discussion will form the basis of our investigations into sustainable development governance and management.", "Evaluate governance approaches in shaping sustainable development practice", "Understand the importance of multi-level governance in sustainable development", "Assess strategies for governing and managing sustainable development", "Overview: So far in this course, we have established the complexity of sustainable development and the challenge of achieving the diverse criteria which have come to define sustainability.", "As we have seen so far in this course, a systems approach to this challenge will be essential for understanding and appreciating the approaches discussed during this week in the course.", "Apply established theory and ethical frameworks to the role of the development agent", "Reflect on the appropriate skills and dispositions that the development agent should carry", "Understand effective strategies for working with groups as a development agent", "This week, we will explore how the theories and practices that define development can inform our own roles as development agents.", "Understand the importance of futures thinking", "Learn to apply futures thinking methods in sustainable development", "Discuss the future of sustainable development practice", "Overview: This week, we will look at the future of sustainable development by exploring an emerging technique that has important implications for development practice.", "Futures thinking is a reorientation of our conceptualization of the future.", "With this framing in mind, futures thinking seeks to orient our current choices towards the better and more sustainable future that we are working towards.", "Solution Analysis 20%", "Solution Analysis 20%", "In other words:", "Maximum Possible Score", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online.", "In case of difficulties, contact uwacehelp@ist.uwaterloo.ca.", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see http://iris.uwaterloo.ca/ethics/", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 319, "course_code": "MSE 211", "course_name": "MSE211 - Organizational Behaviour (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Sofiia Doroshenko <sdoroshenko@uwaterloo.ca>", "Introduction to the concepts of learning, person perception, attitudes, and motivation in an organization.", "Discussion of power, control, leadership, and management in light of the above concepts.", "The basic objective of the course is to help you to develop both theoretical and practical approaches for analyzing and making sense of individual and group behaviour in organizational situations.", "Demonstrate understanding of basic theories/concepts of organizational behaviour.", "2. Demonstrate understanding of factors that affect the behaviour of individuals and groups in organizations.", "3. Demonstrate understanding of factors affecting communication effectiveness in organizations.", "Introduction                                            Ch 1", "Personality & Intelligence                     Ch 3", "Lewin’s field theory                               Handouts", "Groups & Teams                                    Ch 11", "Communication                                      Ch 20", "This course includes the independent development and practice of specific skills, such as analyzing and writing about organizational situations.", "In cases where there is further clear evidence of plagiarism regardless of AI% score, the work will be submitted to the Associate Dean as a potential academic integrity offence.", "Keep copies of your pre- and post- grammar-corrected drafts in case we ask to see them.", "Library for research-based assignments", "Sexual Violence Prevention & Response Office (SVPRO), supports students at UWaterloo who have experienced, or have been impacted by, sexual violence and gender-based violence.", "This includes those who experienced harm, those who are supporting others who experienced harm.", "SVPRO can be contacted at svpro@uwaterloo.ca", "Intellectual property includes items such as:"]}, {"course_id": 349, "course_code": "PLAN 100", "course_name": "PLAN100 - Urbanization Today: Introduction to Cities and Regions (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Urbanization Today: Introduction to Cities and Regions Fall 2024", "10:30AM - 12:20PM EXP 1689", "B. Doucet", "Dr. Brian Doucet firmly believes that academic knowledge should be shared with wider audiences to enhance not only scholarly debates, but also political, policy, planning and public discussions about cities and communities.", "He is a frequent commentator in the media and has experience and expertise speaking with a wide range of audiences about many important urban topics.", "Dr Doucet’s first full-length documentary film Thinking Beyond the Market: a film about genuinely affordable housing, will be released in fall 2024.", "His interest in cities and transportation began at an early age; his childhood home was within earshot of the Yonge subway line and as a child, he spent many hours watching trains from the bridge over the tracks!", "He is particularly interested in the relationship between new transit lines and processes of gentrification and displacement.", "His first book Why Detroit Matters (2017, Policy Press) examined counternarratives and inspiring visions in Detroit.", "He was previously a competitive curler and represented the Netherlands at the European Curling Championships in 2008, 2010 and 2011.", "This course considers the history of urbanization, models of urban and regional development, and ideals of good urban form in Canadian and global contexts.", "Students will develop a critical perspective on the historical and contemporary relationships between processes of urbanization and broader societal trends and structures.", "Introduction", "We will explore different models of urban development, the role that shifting economic and social forces have played on the growth and development of cities, and different eras of urbanization.", "Rather than only describing these changes, this course will introduce a critical perspective on the impacts of urbanization and urban change on marginalized groups.", "The course will be taught through a combination of thematic lectures and case studies of challenges facing particular cities.", "A key component of this course is to encourage and challenge students to look differently at the world around them in order to examine planning’s role in what we see visible (and invisible) in our cities.", "Part One, The Growth and Development of Cities (weeks 1-6) explores different ideas and practices about how cities developed over time, as well as introducing different parts of the city (downtowns, inner cities, suburbs, mid-sized cities etc).", "Learning Modes and Expectations:", "The lectures will be given by Dr Brian Doucet and will introduce and explain key concepts, issues and examples.", "The tutorials will be divided into smaller groups of around 25-30 students and held in the days following each lecture.", "We understand that most of you are first-year students entering a new phase of your studies and that university education comes with very different expectation than other places of learning.", "One of the main goals of this course is to develop critical thinking and observation skills in order to start your journey towards ‘thinking like a planner.’", "As a result, we are more interested in your own thoughts, ideas and knowledge about a topic and how these can all grow throughout the course, rather than what you can find and produce through a generative AI software program.", "Learn about the growth and development of cities through the history of urbanization and planning", "Learn about the different parts of the Canadian urban system and how they have changed over time", "Understand the impacts of key structures and processes in contributing towards social and spatial inequality", "Develop skills related to note taking, lecture and reading comprehension", "Develop skills related to observing aspects of change and aspects of the planning process within the built environment.", "History of planning in Canada and other countries (History & Principles of Planning)", "Forms, scales and settings of human settlements (Human Settlements)", "Processes and factors of change in human settlements (Human Settlements)", "Schedules", "Student Drop-in Hours, LEARN Discussion Boards and Email Consultation", "Note that I do not regularly check my email in the evenings, weekends and during Reading Week", "If you are unable to attend in person, please send me an email request to arrange a time during these drop-in hours", "PART 1: The Growth and Development of Cities", "Introduction", "Evolution of Cities", "Models of Urban Development", "Neighbourhood change in central Halifax, 1951–2011.", "Midtern Test", "Enduring features of the North American suburb: Built form, automobile orientation, suburban culture and political mobilization.", "--Curb Cuts Episode 308. 99& Invisible Podcast", "Climate change and urban life", "It will be a closed-book test.", "Students will take one of the topics from weeks 4 - 6 and explore a particular issue in more detail.", "This review should explain how the topics and examples covered in the podcast are related to some of the key themes and topics in this course.", "The review should end with a broader reflection on how planning can influence the selected topic and/or case study.", "Episode 388", "The final exam will be a cumulative test of the main content for this course.", "It will be closed book and held during the exam period.", "Late Penalties and Extension Requests", "5% for the first 24 hours", "Students should plan ahead and look carefully at all the deadlines for their courses; and requests for extensions must be written in an email.", "Other Important Information", "Intellectual property includes items such as:", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "If the development of your research proposal consists of research that involves humans as participants, then please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CECA provide an interview conflict procedure to manage these situations.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "This course includes the independent development and practice of specific skills.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 351, "course_code": "PLAN 341", "course_name": "PLAN341 - Ecology and Conservation for Planning (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Ecology and Conservation for Planning Winter 2025", "02:30PM - 05:20PM", "This course provides students with a critical understanding of the relationship between human development and natural environments.", "Students will develop an understanding of core ecological principles and how these can be taken up in plans and policies to promote nature conservation in urban and rural environments.", "The course will include examples of how planners mitigate the environmental impacts of development of land, allotment of open space and parks, and conservation of sensitive areas and species in both urban and rural contexts.", "understand biophysical and ecological processes in urban areas", "plan for biophysical and ecological process when developing and managing the built environment", "Overview of syllabus and foundational concepts", "Get into groups and choose case study for weekly activities and final project", "Spatial patterns and mosaics", "Urban water systems and water bodies", "Urban habitat and vegetation", "Urban features", "Readings", "The ecological and evolutionary consequences of systemic racism in urban environments.", "ECOLOGICAL URBANISM: A FRAMEWORK FOR THE DESIGN OF RESILIENT CITIES Yes 0", "Each quiz corresponds to the theme for each week.", "The first will critically engage with a recent and important contribution from Schell et al.", "Each Reflection Paper should be approximately 500 to 1,000 words and should answer the following questions:", "The case study should describe each of the focal ecological components of the city and develop a plan to improve or enhance the sustainability of these components.", "These will vary week to week, but are designed to prepare students to complete their case study assignment.", "The complete style outline can be found in the Publication Manual of the American Psychological Association, located in the reference section in Dana Porter Library, or on sale in the Book Store.", "APA Frequently Asked Questions - http://www.apastyle.org/learn/faqs/", "University of Wisconsin-Madison Writing Centre: http://www.writing.wisc.edu", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 353, "course_code": "PLAN 414", "course_name": "PLAN414 - Heritage Conservation Planning (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["SEM", "Online - Asynchronous", "Email: mletourneau@uwaterloo.ca", "Join Zoom Meeting https://us06web.zoom.us/j/88003457775?pwd=vBsdDRY3PpBoUUdLcvZ4mVc8j5m4Ap.1", "Email: s2hai@uwaterloo.ca", "The role of cultural heritage in the community context is examined.", "Varying forms of heritage preservation, its function and organization are covered.", "This course may include a field component.", "The role of cultural heritage in the community context is examined.", "Varying forms of heritage preservation, its function and organization are covered.", "This course may include a field component.", "(If a field trip occurs, the cost will not exceed $25.)", "Graduate Students: Special session to be booked", "INTRODUCTION", "This is a course that explores the question, “What is the role of cultural heritage resources in urban and regional planning?”", "Through class projects, students will learn about, and work with, the basic tools for inventorying and evaluating cultural heritage resources as well as some of the key legislative and policy tools available to them.", "Demonstrate how heritage planning is an integral part of sustainable, healthy, and resilient communities as well as urban and regional planning", "Challenge students to consider some of the practical, legislative, and ethical issues of practice", "Explore the diversity of heritage conservation planning activities, challenging preconceptions, and illustrating opportunities", "Lectures will build upon the text, and will provide specific case studies, more detailed information, and in some cases, alternative viewpoints.", "Begins", "Course Introduction and overview", "The importance of nomenclature", "The Value of Heritage and the Heritage of Value", "Your solution, their problem-Their solution, your problem: The Gordian knot of cultural heritage planning and management at the local government level in Australia.", "The evolution of the heritage conservation context", "The Concept of Cultural Heritage - Its History and its Challenges", "Aleida Assmann \"The Concept of Cultural Heritage\"", "Human Remains and Heritage Planning", "101-155 & 217-255.", "Activity – Understanding Heritage By-laws", "The Importance of Understanding and Research", "Sites of Conscience", "Sites of Conscience", "18th Century - www.youtube.com/watch?v=nx8CvzaPlgw", "19th Century - www.youtube.com/watch?v=1oxIQARyL-U", "In Well-preserved: The Ontario Heritage Foundation’s manual of principles and practice for architectural conservation.", "Truth and Reconciliation Commission of Canada.", "Understanding the Economics", "Research Design", "Support to policy development in the field of intangible cultural heritage www.youtube.com/watch?v=qSPrqUYc0OA", "Insurance and Heritage Properties - National Trust for Canada", "Heritage designation and property values: Is there an effect?", "Urban Design and Heritage", "Sustainability and Heritage in a World of Change", "Sustainability and Heritage in a World of Change", "Mining threats UNESCO World Heritage Sites in Canada Mining threats UNESCO World Heritage Sites in Canada", "during times of Populism - Laurajane Smith[Video] Political uses of Heritage during times of Populism - Laurajane Smith", "Understanding values of cultural heritage within the framework of social identity conflicts.", "Sustainable heritage-in-practice: Relationships, goals, localization and models.", "Archaeology and Heritage Planning", "Ontario Archaeology 101 – The Ontario Historical Society", "Managing Change", "The Museum", "The shift towards values in UK heritage practice.", "Planning for the Worst", "Risk Assessment for Cultural Heritage", "Protecting Cultural Heritage from Disasters", "Introduction: Cultural heritage as a futuristic field.", "For these assignments, students will choose one of the following topics and write a critical academic paper on it.", "Studentsare expected to undertake a short literature review; identify any relevant legislation, charters, statements, or texts (as necessary); and provide a short case study for illustrative purposes.", "Note the papers must be planning focused!", "Planning for Cultural Landscapes", "Planning for Sustainability and Heritage", "Planning for Intangible Heritage", "Graphics and illustrations should be included where appropriate.", "The paper should be 2000-2500 words in length.", "The summary report can be written in the first person but should still be a critical academic discussion.", "The professor will be responsible for the evaluation of all graduate papers and proposals.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments", "Intellectual property includes items such as:", "If the development of your research proposal consists of research that involves humans as participants, the please contact the course instructor for guidance and see: https://uwaterloo.ca/research/office-research-ethics", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security.", "In the event of instructor illness, classes will be temporarily suspended and in-person classes may be temporarily moved online, depending on the severity of instructor illness and self-isolation requirements.", "Should the University of Waterloo require the suspension of in-person instructional activity, all classes, tests and exams will be conducted online."]}, {"course_id": 358, "course_code": "PLAN 471", "course_name": "PLAN471 - Planning and Municipal Law (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["08:30AM - 11:20AM RCH 112", "08:30AM - 11:20AM RCH 112", "TBA", "Planning issues dealt with by the Ontario Municipal Board are used to illustrate the power to regulate the use of land, the law relating to citizen participation, problems of non-conforming uses, and the maintenance of environmental quality in neighbourhoods and communities.", "Introduction", "This upper-level course is designed to enhance students’ understanding of the laws and policies that guide land-use planning in Ontario and in the broader Canadian context.", "Evaluate key planning legislation, plans and guidelines that regulate land-use planning in the Province of Ontario", "Differentiate between the regulatory powers of various levels of government in relation to planning", "Apply their knowledge of planning law to the analysis of planning case studies", "Meetings outside of this time can be scheduled by e-mail.", "Core knowledge will be assessed through a mid-term test and cumulative exam.", "Introduction", "The legal basis of planning", "Jan. 24 Municipal power & authority", "Constitution Acts", "Des Rosiers & Anescu, 2024", "Mosonyi & Baker, 2016", "Feb. 7 Charter of Rights and Freedoms", "Charter of Rights & Freedoms", "Mar. 14 Official Plans", "Mar. 20 Zoning by-laws", "Student success in the course will be evaluated through individual and group assignments as well as a mid-term test and final evaluation.", "The School of Planning has adopted a single standard referencing system for all papers and assignments submitted in Planning courses.", "On the web you can find some other quick references for formatting and writing at the following URLs:", "APA Frequently asked Questions - http://www.apastyle.org/learn/faqs/", "University of Wisconsin-Madison Writing Centre: http://www.writing.wisc.edu", "In the case of a missed test or examination, students will be offered a make-up at an alternate time.", "Intellectual property includes items such as:", "Instructors are asked for leniency in these situations; but, a co-op interview does not relieve the student of any requirements associated with that class meeting.", "CEE provides an interview conflict procedure to manage these situations.", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Instructors maintain agency over considerations granted for missed course components.", "For illness/medically-related absences other than Covid-19, please have a medical provider complete the Verification of Illness (VIF) form and submit it to https://absence.uwaterloo.ca.", "You are limited to one of these per term, and can only use it during the formal lecture period.", "Note that you cannot use this absence for consideration in FLD, LAB, or STU components of your course.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important."]}, {"course_id": 361, "course_code": "REC 200", "course_name": "REC200 - Play, Creativity and Child Development (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Play, Creativity and Child Development Spring 2024", "02:30PM - 05:20PM", "Email: luc.cousineau@uwaterloo.ca", "Email: sariai@uwaterloo.ca", "A critical analysis of definitions, concepts and assumptions of classical, recent and modern theories of play with implications for programming, planning and evaluating children's play.", "Understand and describe the nature of play and creative expression and their relationship to child development.", "Evaluate public and private leisure and other human service agencies provision of child and youth development programming, and identify the benefits of high quality programs.", "Apply acquired knowledge about play, creativity, and child/youth development to the development and application of programs/services for human services and recreation programs.", "Dietze & Kashin (2019) – Chapter 1: Exploring the", "Child Development", "Adolescent Development", "Community Places and Play (asynchronous lecture so the same time can be used to visit & evaluate a playground)", "Playground Evaluation", "Principles of Playground Design https://playgroundideas .org/10-principles-ofplayground-design/", "Are our school playgrounds being wrapped in cotton wool?", "A Genealogy of Summer Camp.", "In Becoming and Being a Camp Counsellor:", "Free-Range Parenting Debate", "Is Free-Range Parenting a Good Idea?", "2s", "The role of the coach in facilitating positive youth development: Moving from theory to practice.", "Play Spaces and Materials", "Development", "Play and Schools", "Appendix 3.7 Steps to Help Children and Schools Thrive", "Applying Universal Design for Inclusion in Play", "Yong (2017) – 6-year-old girls already have gendered beliefs about intelligence, The Atlantic https://www.theatlantic.com/science/archive/  2017/01/six-year-old-girls-already-havegendered-beliefs-about-intelligence/514340/", "-", "https://www.theatlantic.com/education/archiv  e/2017/09/whats-lost-when-only-rich-kidsplay-sports/541317/", "Students will conclude by making recommendations for practictioners based on their analysis.", "This course includes the independent development and practice of specific skills, such as [fill this in with your discipline-specific skills].", "Library for research-based assignments"]}, {"course_id": 413, "course_code": "AFM 231", "course_name": "AFM231 - Business Law (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["07:00PM - 09:50PM", "Students can contact the course instructor via email at rhussein@uwaterloo.ca.", "Particular attention is given to the law relating to contracts and business organizations.", "AFM 231: View requirements for AFM 231", "While the course introduces you to basic concepts in law, it is designed for, and particularly emphasizes topics that will be of specific relevance to you as future business managers, owners, or even practicing professionals.", "This includes understanding the basics of legal risk so you can make more effective business decisions.", "Business managers/owners often must engage in risk management exercises.", "Appreciate the complexity of integrating multiple private law concepts into the analysis of a business situation.", "Utilize a basic framework for legal risk management assessments and generate an inventory of possible legal risk management tools.", "Describe the common as well as contrasting relationship between legal compliance and ethical conduct.", "March 24-28", "Wrap-up", "Accordingly, if students do opt to use an older edition it would be advisable to use an edition that is as close to the 8th edition as possible and consider cross-referencing it to the current edition and noting any differences.", "Completion", "The response demonstrates a clear understanding of the relevant course concepts and effectively applies these concepts to the hypothetical scenario.", "Application to Real-World Example", "The response includes an appropriate real-world example that relates to the course material, illustrating how the concept can be applied outside the context of the hypothetical.", "Students may also include a revised answer based on a similar but different set of hypothetical facts.", "For example, a student may propose one solution based on the given facts but suggest a different solution if the facts were altered.", "Students are expected to demonstrate critical thinking and clearly articulate their reasoning.", "Each quiz covers content that relates to the current course content (the current chapters and occasionally a prior chapter as well if it has not yet been part of a quiz).", "Submission Times", "Reevaluation Request", "Requests for re-evaluation of submitted material can be done via email.", "Also, students should detail what their concern as specifically as possible.", "Artificial Intelligence Tools", "Also, some evaluation elements are structured such that it may be even quicker to do it yourself than to utilize an AI tool and then further edit/revise before submission.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 443, "course_code": "ECON 221", "course_name": "ECON221 - Statistics for Economists (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Statistics for Economists Winter 2025", "ECON 221", "ECON 221 001", "08:30AM - 09:50AM HH 334", "Email: pchausse@uwaterloo.ca", "Clinic: There is a clinic to help students with ECON 211 and ECON 221 every Tuesday and Wednesday from 3:00PM to 4:30PM in HH 235.", "ECON 221:", "This course introduces students to describing economic data and drawing inferences from features of economic data.", "Starting from fundamental axioms of probability, students will learn about the calculation of probabilities of basic events and the features of random variables, the most important tool for representing the outcomes of complex economic phenomena.", "Students will describe discrete and continuous random variables via their probability distributions and summary statistics such as means and standard deviations, as well as the relationships between two random variables in terms of covariance, correlation, and simple regression models.", "The concepts of hypothesis testing and confidence intervals, and the fundamentals of statistical inference are discussed for basic features of random variables and for comparing the features of more than one random variable.", "View requirements for ECON 221", "evaluate and conduct elementary data analysis", "use probability theory to model uncertain outcomes", "conduct basic statistical inference", "Introduction (First lecture)", "Estimators and Inference on the mean: Chapter 8 of K", "Inference on the variance and the chi-square distribution: Chapter 11 of HID", "Students will submit two files: plain-English data analysis in one text file and the associated computer code used to conduct the analysis in another text file.", "Exercises will be given and reviewed.", "Economics Department Deferred Final Exam Policy", "Applications for Accommodation", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 451, "course_code": "ECON 372", "course_name": "ECON372 - Business Finance 2 (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Business Finance 2 Fall 2024", "ECON 372", "10:00AM - 11:20AM DWE 3517", "For your convenience, office hours will be both in person and through MS Teams on a first-come-first-serve basis.", "Email: prajsic@uwaterloo.ca", "“ECON 372” must appear in the subject line and the message must include your full name and student ID number.", "This course examines a number of topics relevant to financial practitioners.", "View requirements for ECON 372", "The purpose of this course is to provide students with advanced topics in corporate finance and their applications.", "The key concepts and topics to be covered include security valuation, risk and return, risk diversification, capital asset pricing model (CAPM), investment performance measurement, financial derivatives, and forecasting.", "Students will learn how to apply these concepts to real world problems using various examples and case studies.", "The course deepens the general framework of financial landscape offered in ECON 371 by discussing the role of financial instruments and institutions in the economy.", "The goal is to develop a deeper understanding of financial markets and investment strategies.", "understand the need for firms and individuals to make financial decisions and together work towards overcoming the universal problem of scarcity;", "appreciate the relevance of finance in a changing world;", "explain why maximizing market value is the logical financial goal of the corporation", "calculate and interpret some key measures of firm performance", "understand and apply the Capital Asset Pricing Model", "describe how options markets can be used to manage risk", "identify different types of debt financing available to a firm", "understand why investment decisions, rather than financing decisions, fundamentally determine the value and cost of capital of the firm", "create pro forma income statements and balance sheets.", "Introduction to Advanced Business Finance:", "Review of Key Concepts in Finance", "Review of Key Concepts in Finance", "Capital Markets and the Pricing of Risk", "Capital Markets and the Pricing of Risk", "Determining the Cost of Capital", "Determining the Cost of Capital", "Risk and the Pricing of Options", "Financial Planning and Forecasting:", "Financial Modeling and Pro Forma Analysis", "The purpose of the review quizzes is to help students identify and understand key concepts covered in the lectures and in the textbook.", "The persuasive essay assignment is supposed to incorporate theoretical aspects of the course that are communicated to a general audience with some basic background and interest in financial issues.", "Under the Training & Support tab, you will find helpful information including technical support.", "Midterms and Final Exam", "The format for midterms and the final exam will be a mix of multiple-choice questions, numerical calculation questions, and written problems.", "Missing a Midterm Due to Self-Isolation", "Please carefully read the Economics Department policy on deferred final exams for instructions.", "Intellectual property includes items such as:", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "Economics Department Deferred Final Exam Policy"]}, {"course_id": 460, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 486, "course_code": "LS 221", "course_name": "LS221 - Research Methods (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Research Methods Spring 2023", "Email: adam.mursal@uwaterloo.ca", "An introductory survey of the research techniques commonly employed by sociologists, criminologists, and legal studies researchers.", "The formulation of research designs appropriate to various kinds of intellectual problems in social science is stressed.", "Comprehend fundamental research concepts and methodology (e.g., quantitative and qualitative research methods).", "Readings and Videos", "Introduction + General Research Orientations", "Research Designs", "Quantitative Analysis", "Structured Observation and Content Analysis", "Social Research Methods 6th Edition (Canadian Edition): 2022 Authors: Edward Bell; Alan Bryman; Steven Kleinknecht Yes", "*An older Canadian edition of the textbook can be used, however, students are responsible for ensuring the appropriateness of course context and matching the related chapters to assigned weekly readings.", "Assignment prompts: Must be 700-800 words in length, and are responses to a specific question provided as part of the lecture series.", "Prompt 1 Question: What are factors that may influence what a person decides to research in the social sciences?", "What are factors that might influence what you will propose to research in this course?", "In your response, please provide a clear argument and discussion either for or against the use of covert research methods in the social sciences.", "Students will create a study on a sociological/legal topic of their choosing that is both viable and realistic given the course context.", "Cross-listed courses", "Intellectual property includes items such as:", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website"]}, {"course_id": 490, "course_code": "LS 322", "course_name": "LS322 - Field Research Methods (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Field Research Methods Winter 2024", "08:30AM - 09:50AM AL 105", "Email: kkpadda@uwaterloo.ca", "** Please note that I won't be answering any questions regarding course material (for example - definitions of concepts, differences between theoretical perspectives, etc.) over email.", "I believe that these types of questions are best discussed in person.", "Office Hours: By appointment & via Zoom", "This course provides a critical evaluation of research techniques in sociology, criminology, and legal studies with an emphasis on learning and applying qualitative fieldwork approaches.", "Antireq: SDS 351R", "Explain the nature and purpose of qualitative research in the field of Sociology and Criminology", "Formulate research questions and draw connections to theoretical constructs that emerge from the data.", "Recognize and critically evaluate ethical issues and considerations in qualitative interdisciplinary research and the implications of ethical decisions on participants, researchers, and communities.", "Demonstrate understanding of theoretical, practical, and critical aspects of qualitative research.", "By experimenting with different qualitative research methods, you'll develop an invaluable toolkit of knowledge and experiences that will be useful in the future - whether you're heading to graduate school, working in research settings, or designing projects in the workplace.", "Readings", "Introduction to the course", "Introduction to Qualitative Research Methods + Asking Questions and Identifying Goals", "Chapter 1: Introduction", "Strategies for Designing Research", "Chapter 3: Strategies for Designing Research", "Ethical Issues in Research", "23-Jan", "Ensuring Quality in Qualitative Research", "Sample sizes for saturation in qualitative research: A systematic review of empirical tests.", "On science and the logic of case selection in field-based research.", "Interview partners + contracts", "Indigenous and Decolonizing Research Methodologies I", "Social Identity Map: A Reflexivity Tool for Practicing Explicit Positionality in Critical Qualitative Research.", "Field Methods 34(2): 181–88. 1525822X221093824.", "Interview I", "Chapter 6: In-Depth Interviewing", "Interview III", "Interpreting Qualitative Data I", "A Pragmatic Introduction to Doing GT Research.", "Sociological Methods & Research.", "Interpreting Qualitative Data II", "NVivo Analysis + mid-semester check-in", "Interpreting Qualitative Data III", "Visualizing qualitative data in evaluation research.", "On-line serial], 2(3).https://doi.org/10.46743/2160-3715/1995.2061", "Unobtrusive Methods/ Digital Ethnography I", "Digital Ethnography II", "Ethnography and Observation I", "A Decolonizing Method of Inquiry: using institutional ethnography to facilitate community-based research and knowledge translation.", "doi:10.1177/1466138113513526", "Ethnography and Observation II", "No Magic!", "Ethnoscripts 23: 92–115.", "Ethnography and Observation III", "Ethnography and Observation IV", "Unlock the power of qualitative research and potential challenges", "*Qualitative Research Findings leading Machine Learning and other big-data research", "Drop-in office hours", "Drop-in office hours", "----", "Students will complete the Tri-Council Policy Statement CORE-2022 course, which provides them with an institutionally recognized certificate of completion.", "You will be conducting a preliminary analysis, including identifying themes and making connections to your existing disciplinary knowledge.", "The research question should be something that can be observed, and you need to take detailed descriptive and analytic notes during the observation.", "You will be formulating a research question that can be explored through online non-participant observation.", "You will be revisiting your initial proposal submission and will be incorporating the feedback you received and the knowledge you have gained since the original submission.", "As a final component of the course, you will be asked to submit a comprehensive reflection, which is open-ended and allows you to discuss your learning, challenges faced during the course, future goals, skills developed, and how you can communicate these skills to different audiences, be it academic or non-academic.", "This course includes the independent development and practice of specific skills, such as critical thinking; synthesizing and analyzing information; developing and practicing writing skills.", "Library for research-based assignments", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 495, "course_code": "LS 413", "course_name": "LS413 - Surveillance and Society (0.50)", "term_name": "List C", "program_name": "Degree Requirements", "program_id": 45, "major_id": 1, "major_name": "Bachelor of Applied Science Degree Requirements", "topics": ["Notice of Recording", "Surveillance and Society Fall 2024", "SEM", "I am an Associate Professor in the Department of Sociology & Legal Studies and at the Stratford School of Interaction Design and Business.", "I am in the second year of my master’s program in Sociology and Legal Studies.", "Questions of a personal nature", "Reviews of draft writing before submission", "Every student is encouraged to introduce themselves to me before October 29 by attending a drop-in session and saying hello, or booking a one-on-one appointment.", "An examination of the way monitoring technologies alter and shape social life in terms of security, fear, control, and vulnerability.", "Some of the topics covered in the course include differential access and exclusion mechanisms enabled by online surveillance, predictive marketing using big data algorithms, racialized classification schemes and a host of monitoring technologies in online spaces, workplaces, and the home.", "Readings will be drawn from the social sciences and popular media to facilitate critical inquiry into the shaping of popular perceptions about the surveillance and social control.", "Communicate, describe, and debate topics related to how surveillance operates in social contexts, particularly how it comes to influence everyday life.", "Analyse both academic and popular writing and reporting on surveillance and privacy, and synthesize core themes in written reflective summaries.", "Week 1 Module 0: Introduction to the Course", "All readings and media and links to discussion forums are posted in these content modules.", "Late Policies and Extension Requests", "VIF self-declarations cannot be “stacked” to extend beyond these 5 days.", "You do NOT need to make a formal extension request.", "The VIF indicates the determination by a care provider of the degree of incapacitation for a given period.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "Notice of Recording", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Do you want professors and interviewers to call you by a different first name?", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Plagiarism & Copyright Policy", "In this case, the authors decide how you can use their content.", "This course includes the independent development and practice of specific skills, such as critical reading skills, assessing the structure and quality of written arguments, making connections between different authors, and participating in unscripted seminar discussions and debates online.", "Library for research-based assignments", "Intellectual property includes items such as:"]}]