[{"course_id": 7, "course_code": "CHEM 123L", "course_name": "CHEM123L - General Chemistry Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 2 Winter 2025", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- a real life analysis", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 8, "course_code": "CHEM 237", "course_name": "CHEM237 - Introductory Biochemistry (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:20AM", "RCH 101", "10:30AM - 11:20AM RCH 101", "ESC 227", "Structure and properties of proteins and enzymes.", "develop a molecular level understanding of biological processes to achieve this the following learning outcomes will be", "in both qualitative and quantitative examples", "evaluate unknown thermodynamic parameters from given values of others.", "I equilibrium constants from standard free energy changes.", "qualitatively describe the composition of solutions of a weak acid or base as a function of pH.", "calculate the precise", "recognize the 20 amino acids that are commonly found in proteins and identify compounds derived from them", "calculate the charge on an amino acid side chain as a function of pH", "know the 4 levels of protein structure and the covalent and non covalent interactions that stabilize them", "explain how to purify proteins using the physical and chemical properties of the proteins", "determine the primary sequence of a protein given the appropriate data", "understand basic chemical kinetics and the application to biological systems", "determine the mechanism of inhibition of an enzyme using", "the structure of fatty acids and membrane lipids", "the structures of cell membranes and how the fatty acid composition of those membranes affects membrane structure and fluidity", "the structure of simple sugars and polysaccharides and the chemistry of the reactions in which they participate", "Suggested supplementary reading in \"Biochemistry Free for All\".", "Biochemistry free for all: Introduction Water and Buffers, pages 34-49", "VVP chapters 3 and 4.1", "Biochemistry free for all pages 53-70", "Appendix A.1 and A.2", "Chapter 4.2 and 4.3", "Biochemistry free for all.", "pp 74-108", "Week 6  Protein folding and Introduction to hemoglobin", "Chapter 4 - Biochemistry in focus", "Biochemistry free for all pages 128-141", "first kinetics Chapter 10 then mechanisms Chapter 9", "Biochemistry free for all pages 337-362", "Biochemistry free for all pp 190-217", "Biochemistry free for all pp 222-233", "Biochemistry free for all pp 287 - 312", "Notice of Recording"]}, {"course_id": 10, "course_code": "CHEM 333", "course_name": "CHEM333 - Metabolism 1 (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["09:30AM - 10:20AM DWE 2527", "First we will cover general principles of thermodynamics and high energy compounds ( NTPs, NAD(P)+ and fats).", "And some general principles of the energy metabolism and the regulation of metabolic pathways.", "understand the logic of the pathways by being able to draw the chemical structures of the intermediates in these pathways.", "draw the chemical mechanisms of the enzymes involved in these metabolic pathways and to use that information to apply it to new systems.", "understand the interconnection of these pathways and the basis, of the regulation and coordination of these pathways.", "week ART Reading VVP reading and practice problems MVH", "1: Introduction to metabolism, review of Energy Metabolic Energy (410-429)", "6: Electron transport and oxidative phosphorylation Energy: Electron Transport & Oxidative Phosphorylation (430-471)", "10: Integration and coordinated regulation of the pathways metabolic disorders Signalling (828-855)", "Biochemistry Free for All https://biochem.oregonstate.edu/undergraduate/educational-resources Yes", "Fundamentals of Biochemistry 5th edition by Voet, Voet and Pratt Yes", "Online quizzes   10% of final mark These will be a combination of multiple choice and written answers."]}, {"course_id": 11, "course_code": "CS 100", "course_name": "CS100 - Introduction to Computing Through Applications (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Computing Through Applications Winter 2025", "Friday -", "Friday", "10:30AM - 12:20PM MC 3005", "10:30AM - 12:20PM MC 3027", "Dave Tompkins", "E-mail: dtompkins@uwaterloo.ca", "E-mail: cs100@uwaterloo.ca", "Introduction to the Internet, World Wide Web, HTML, and XML.", "Algorithms underlying the functional components of web search engines and their influence on data access.", "CS 100: Introduction to Digital Information, Computers, the Internet and Applications", "Explain the emerging computing technologies introduced in the course.", "Digital Information", "Computer + Network organization", "Dynamic web pages and web applications", "Privacy and security", "Emerging Topics", "Distributed networking and \"big data\"", "Artificial intelligence", "ChatGPT and large language models", "Social media and monetization", "A1 released", "Laptops, Devices and Software", "Library for research-based assignments"]}, {"course_id": 14, "course_code": "ECON 221", "course_name": "ECON221 - Statistics for Economists (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["Statistics for Economists Winter 2025", "ECON 221", "ECON 221 001", "08:30AM - 09:50AM HH 334", "Email: pchausse@uwaterloo.ca", "Clinic: There is a clinic to help students with ECON 211 and ECON 221 every Tuesday and Wednesday from 3:00PM to 4:30PM in HH 235.", "ECON 221:", "This course introduces students to describing economic data and drawing inferences from features of economic data.", "Starting from fundamental axioms of probability, students will learn about the calculation of probabilities of basic events and the features of random variables, the most important tool for representing the outcomes of complex economic phenomena.", "Students will describe discrete and continuous random variables via their probability distributions and summary statistics such as means and standard deviations, as well as the relationships between two random variables in terms of covariance, correlation, and simple regression models.", "The concepts of hypothesis testing and confidence intervals, and the fundamentals of statistical inference are discussed for basic features of random variables and for comparing the features of more than one random variable.", "View requirements for ECON 221", "evaluate and conduct elementary data analysis", "use probability theory to model uncertain outcomes", "conduct basic statistical inference", "Introduction (First lecture)", "Estimators and Inference on the mean: Chapter 8 of K", "Inference on the variance and the chi-square distribution: Chapter 11 of HID", "Students will submit two files: plain-English data analysis in one text file and the associated computer code used to conduct the analysis in another text file.", "Exercises will be given and reviewed.", "Economics Department Deferred Final Exam Policy", "Applications for Accommodation", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 20, "course_code": "SCBUS 223", "course_name": "SCBUS223 - Workshop 2: Strategies Behind Technological Innovation (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["Workshop 2: Strategies Behind Technological Innovation Fall 2024", "03:30PM - 04:20PM MC 4021", "Students working in groups analyze real business ventures, their launch, and growth, synthesizing major field research to develop a term deliverable in the form of a company report and final project presentation.", "Students engage in experiential learning involving theory, case studies, scientific team debates, and critical reasoning.", "SCBUS 223 Strategies Behind Technological Innovation", "Email: kmemon@uwaterloo.ca; https://www.linkedin.com/in/kashifmemon/", "Email : djhaveri@uwaterloo.ca", "A warm welcome to everyone!", "Email: djhaveri@uwaterloo.ca", "Students will also organize an in-depth written and oral presentation of the results of the study, while working as a member of a team.", "It is important to recognize that there is no “best practice” to manage innovation and hence to understand the true meaning of innovation the course will be supplemented by case studies “Innovation Debates” from Harvard Business Review, specific case studies from the textbook, and class discussions.", "This means you will act and communicate professionally, as you will with co-workers.", "Work professionally in groups and contribute to the group objectives and product.", "Deliverables", "Participation in class discussions is required and will be graded using the criteria outlined below in table – A. Marks for contribution to class discussions will be based on how well your comments relate to key concepts in the course.", "This will be enforced, and attendance will not be recorded for late comers.", "Please ask students to complete the absence declaration form in Quest in lieu of email request to yourself or a conversation.", "Student makes regular high-quality contribution", "relates the issues under discussion to key concepts in the", "understanding of topics but does not relate the issues", "under discussion to key concepts in the course.", "name tag displayed in majority of classes.", "relate issues under discussion to key concepts in the", "Very minimal contribution to class discussions, MS TEAMS", "No contribution to class discussions, MS TEAMS group", "Submit the Summary of the assigned case to the Case Study Summary LEARN Dropbox by MONDAY Afternoon BY 1.00 pm each week before their presentation the next class.", "These Innovation Debates bring 2 groups against each other every week.", "It contains very important on responsibilities of each team member within the project.", "Panel Boards", "This will be enforced, and attendance will not be recorded for late comers.", "Excuses such as “I was not comfortable in reporting the member that did not want to work” are not acceptable and will result in poor marks for the entire group.", "It is the responsibility of each member to report non-contributing members early on.", "As individual team members, your responsibilities include serving as a team leader and being a team player.", "To help your group define a clear understanding of responsibilities, each group will prepare a group contract at the beginning of term.", "A fragmented or disjointed submission assignment created by a group working primarily in isolation will most likely be obvious and of poor quality leading to a poor grade.", "Note: Missing APA citations, in-text or full references list page, missing correspondence between in-text citations and reference section, and missing APA formatting will result in a mark of zero out of THE TOTAL MARK in the assignment.", "THE ONE AND ONLY EXCEPTION", "Please refer to in-text citation, reference list, general formatting and sample paper and other tabs as needed for 7th edition APA citation and formatting guidelines.", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline).", "Re-creating test questions and answers without the express permission of the course instructor", "2:30-4:20", "Company choice to be first come first served basis.", "For example, “the company promised us and backed out” or “we are trying to find a company in our field of interest are not acceptable.”", "Innovation Debate 1 – Group 1 vs. Group 2", "You Need an Innovation Strategy", "It’s the only way to make sound trade-off decisions and choose the right practices.", "Does every innovation need a “strategy”?", "innovation can survive without a strategy)", "Innovation Debate 2 – Group 3 vs. Group 4", "Turn Your Science into a Business", "Oliver Alexy", "Innovation Debate 3 – Group 5 vs. Group 6", "Lean business model", "Steve Blank", "MVP, minimum viable product” and “pivoting are key concepts in this.", "The lean startup is a bad and bankrupt philosophy for mediocre people with mediocre vision and ambition", "For example, “the company promised us and backed out” or “we are trying to find a company in our field of interest are not acceptable.”", "The information needs to be comprehensive and clear.", "successful innovations in emerging markets that", "are then exported as knowledge and", "each market has its own innovation needs/", "How Apple Organizes for Innovation", "[DJ1]wording a little confusing"]}, {"course_id": 22, "course_code": "SCBUS 323", "course_name": "SCBUS323 - Workshop 3: Technology Development (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "SCBUS 323 - Technology Development Fall 2024", "The major class project focuses on the development of a business plan for a product that could be commercialized.", "View requirements for SCBUS 323", "By the end of this course, you will develop the concept and business model for your own technology-based product, and demonstrate this idea using a prototype or proof of concept.", "Identify a Business Opportunity", "Market Analysis", "Industry Analysis", "Technology Analysis", "Formulate Problem", "Stakeholders", "Ideate Solution", "Technical solution", "Business Model", "Prototype Solution", "Prototyping techniques", "User Testing", "Scaling", "Persuading users", "Synthesize trends in different industries, markets and areas of technology to identify high-impact business opportunities", "Formulate a specific technical problem that can be solved based on the synthesis", "Plan a product development cycle to develop and prototype a technology-based solution to the formulated problem", "Design a technical solution and business model that could be used to benefit from the business opportunity", "Prototype and test the concepts relevant to the proposed technical solution and business model to demonstrate their feasibility, and product-market fit", "Pitch the technology-based product to various stakeholders to persuade a funder to invest in your product, and entice users to use the product", "In addition to its own Learning Outcomes, this course integrates knowledge and concepts relevant to product design and development from your other courses.", "Working in teams (team canvas, team charter, team roles and strategies, motivation, stages of team development, conflict and crisis resolution, leadership, team norms and ways of working) - SCBUS 122", "Business models - MGM 220", "Ethical decision making (utilitarian, golden means, duties-based and rights-based ethics, ethical problem solving process) - SCBUS 122, 225", "As each group selects a unique product to develop, you will also have an opportunity to develop your lifelong learning and independent self-learning capabilities.", "Introduction", "Product Lifecycle and Development", "Identify", "Problem formulation", "Requirements and User Stories", "User Need and Empathy Map", "Service Environment", "Stakeholders", "Formulate", "Creative Problem Solving and Design Thinking", "Solution Development Process", "Idea Generation and Selection", "Design", "Technology and Innovation", "Identify", "Customer Discovery Model", "Knowing Your Business Environment", "Design", "Fundraising and Incubation", "Quantified Metrics and Risks", "Detailed Design", "Prototyping and Testing", "Scaling Up and Long Term Trends", "DFX and Broader Considerations", "Business plans and pitches", "Presentation 3: SCBUS 323 Technology Development Spotlight", "Ethics of Product Design", "Design", "Exam Period", "Assignment 3: Product Design Documentation", "Ms Teams Used as a file repository and communication tool for teams Yes", "Assignment 3: Product Design and Business Model report + investment one-pager 20%", "Presentation 3: Product Demo and Interactive Pitch 10%", "In-class activities", "Participation in each question will score you one point.", "You will be graded as follows for each in-class activity:", "Team1-week1-class_activity", "Progress Meetings and Reports", "ITP Metrics will be used for Peer Assessment.", "Understanding of concepts beyond that of the typical junior student.", "4.5", "Understanding of the concepts and their importance, along with insight into how they can be used to optimize team performance.", "A strong positive force that makes a beneficial contribution to the team, in addition to bringing out the best in other team members.", "Understanding of the concepts and their importance.", "3.5", "Understanding of the concepts and their importance.", "Understanding of the concepts and their importance, and exhibit a growth trajectory at the end of the term.", "2.5", "Understanding the concepts and their importance.", "Understanding of the concepts.", "Superficial understanding of most basic concepts.", "Superficial understanding of some concepts", "Sparse understanding of the concepts.", "No understanding of the concepts.", "The professionalism of your communications with your team,  and members of the teaching team", "Negative Behaviour - Major Infraction", "Missing team meetings without valid reason or advanced notice to the team (handled on a case by case basis)", "Any minor infraction with intent to deceive or commit fraud (handled on a case by case basis)", "Negative Behaviour - Minor Infraction", "No greeting", "Positive Behaviour", "Creativity in activities (good brainstorming, use of flip charts to keep the ideas flowing, etc)", "Receives constructive feedback well", "Gives constructive feedback well", "Exhibited a pattern of self-improvement over the course of the term", "Notice of Recording", "General Information", "Students may request a meeting in person to give evidence of the error and to explain the problem.", "Misinterpretation of a course concept", "Working in Groups", "To help your group define a clear understanding of responsibilities, each group will prepare a team charter at the beginning of the term.", "The Attribution Table should be reviewed by all of the team members prior to submission to make sure that all members agree on the information given in the table.", "If the Attribution Table indicates a substantial discrepancy in contribution (i.e. a large difference in team member contributions) then the marks assigned to individual team members for the assignment may reflect this discrepancy.", "If the instructor is convinced that there was a discrepancy in contribution (as shown in the attribution table), then the instructor will decide on a reduced mark for the team member(s) who contributed substantially less.", "A team member doing a larger share of the work WILL NEVER receive a higher mark than the team mark.", "Your Instructor can help you resolve these issues and help you, as a team, develop strategies for working successfully with each other.", "Remember: most projects do NOT fail for technical reasons; they fail because of planning and team problems.", "Firing a team member is a strategy of last resort.", "The team will issue a warning E-mail to the person informing him or her of the situation, i.e. that the person will be fired from the team unless change occurs.", "The E-mail must use a professional tone and cite specific behaviours that the person must change in order to remain part of the team and deadlines for those changes to occur.", "The goal of these meetings is to:", "This is done in a E-mail copied to the instructor.", "Quitting a team is a strategy of last resort.", "You will issue a warning E-mail to your team informing them of the situation, i.e. that you are ready to quit the team unless change occurs.", "The E-mail must use a professional tone and cite specific behaviours that the team must change in order for you to stay.", "The goal of these meetings is to:", "This is done in a E-mail copied to the instructor.", "The E-mail shall briefly cite the reasons for the departure.", "If you are ever in doubt whether something constitutes plagiarism ask a member of the teaching team.", "It is best practice to reference even public domain images where possible.", "It is unethical and illegal to give away intellectual property that does not belong to you without the permission of the owner, in this case the whole team.", "Intellectual property includes items such as:", "Writing and Communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "A list of the main services provided below:", "Good2Talk, free confidential helpline for post-secondary students - 1-866-925-5454", "KW Sexual Assault Support Centre - 519-741-8633"]}, {"course_id": 28, "course_code": "AFM 231", "course_name": "AFM231 - Business Law (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["07:00PM - 09:50PM", "Students can contact the course instructor via email at rhussein@uwaterloo.ca.", "Particular attention is given to the law relating to contracts and business organizations.", "AFM 231: View requirements for AFM 231", "While the course introduces you to basic concepts in law, it is designed for, and particularly emphasizes topics that will be of specific relevance to you as future business managers, owners, or even practicing professionals.", "This includes understanding the basics of legal risk so you can make more effective business decisions.", "Business managers/owners often must engage in risk management exercises.", "Appreciate the complexity of integrating multiple private law concepts into the analysis of a business situation.", "Utilize a basic framework for legal risk management assessments and generate an inventory of possible legal risk management tools.", "Describe the common as well as contrasting relationship between legal compliance and ethical conduct.", "March 24-28", "Wrap-up", "Accordingly, if students do opt to use an older edition it would be advisable to use an edition that is as close to the 8th edition as possible and consider cross-referencing it to the current edition and noting any differences.", "Completion", "The response demonstrates a clear understanding of the relevant course concepts and effectively applies these concepts to the hypothetical scenario.", "Application to Real-World Example", "The response includes an appropriate real-world example that relates to the course material, illustrating how the concept can be applied outside the context of the hypothetical.", "Students may also include a revised answer based on a similar but different set of hypothetical facts.", "For example, a student may propose one solution based on the given facts but suggest a different solution if the facts were altered.", "Students are expected to demonstrate critical thinking and clearly articulate their reasoning.", "Each quiz covers content that relates to the current course content (the current chapters and occasionally a prior chapter as well if it has not yet been part of a quiz).", "Submission Times", "Reevaluation Request", "Requests for re-evaluation of submitted material can be done via email.", "Also, students should detail what their concern as specifically as possible.", "Artificial Intelligence Tools", "Also, some evaluation elements are structured such that it may be even quicker to do it yourself than to utilize an AI tool and then further edit/revise before submission.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 41, "course_code": "BIOL 434", "course_name": "BIOL434 - Human Molecular Genetics (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "Human Molecular Genetics Fall 2024", "Recent advances in human molecular genetics will be examined with emphasis on how human disease-causing genes are mapped, identified, isolated, and characterized.", "describe structural elements of the human genome and their uses in gene mapping", "describe molecular techniques applied to mapping the location of and determining the sequence of specific genes", "differentiate between complex and simple traits in the etiology of disease using real world examples", "describe how various molecular change contribute to human disease", "describe the role of genomics tools in the determination of disease predisposition and appreciate how pathogenicity/neutrality of a sequence variant is determined", "evaluate the current limitations in the applications of genomics to the etiology of disease", "appreciate ethical and legal issues that have developed as a result of expanding human molecular genetic technologies", "evaluate and critically read primary literature on disease (to identify rationale/hypothesis, and and assess the skills needed to critically evaluate the methods and assess the conclusions", "Pattern of inheritance", "Pattern of inheritance", "Human genome sequencing", "23-Sep-24 M", "Human genome sequencing", "The architecture and working of human genome", "The architecture and working of human genome", "Human gene regulation and epigenome", "Human gene regulation and epigenome", "Human genetic variation", "Human gene regulation and epigenome", "18-Oct-24 F", "21-Oct-24 M  Epigenome/ Comparative genomics and evolution", "Molecular pathology", "25-Oct-24 F", "28-Oct-24 M", "Mapping and identifying genes for monogenic disorders", "Mapping and identifying genes for monogenic disorders", "Complex diseases", "4-Nov-24 M  Cancer genetics and genomics", "6-Nov-24 W Cancer genetics and genomics", "Model organisms", "29-Nov-24 F", "To facilitate equal contribute from all members, it is vital to maintain open and constant communication.", "Notice of Recording", "They host in-person appointments in their offices in South Campus Hall (SCH), remote appointments via a virtual platform, drop-in appointments at the Library, and email-based appointments so you can get help without missing class."]}, {"course_id": 46, "course_code": "BIOL 447", "course_name": "BIOL447 - Environmental Microbiology (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["Environmental Microbiology Fall 2024", "10:00AM - 11:20AM MC 4064", "10:00AM - 11:20AM MC 4064", "You can!", "A study of the environmental impact of microorganisms.", "Tutorials emphasize critical analysis of primary literature.", "Relate microbe-environment interactions to core concepts in microbiology and biochemistry", "Identify appropriate experimental methods to answer specific research questions", "Evaluate experimental designs in published research", "Effectively communicate critical evaluation to peers", "Introduction to cellular respiration and redox;", "Calculating the oxidation state of a carbon;", "Sampling & analysis", "Critical evaluation of research", "Important points to consider when critically evaluating published research papers;", "critical evaluation, part 1", "Algal and cyanobacterial blooms", "Chapter 6 - Microbial primary production and phototrophy;", "(2023)   (Introduction and Methods)", "critical evaluation, part 1", "critical evaluation, part 2", "Biodegradation & bioremediation", "critical evaluation, part 2", "Hydrocarbon degradation", "Passow U & Overton EB (2021) (review paper)", "Environmental impacts of viruses", "Chapter 10 - Ecology of viruses;", "Final exam - TBA", "You can miss up to 3 classes and still achieve full participation marks.", "I have chosen settings that make the scores as transparent as possible, and students can see their in-progress scores for each assignment.", "You can self-declare an absence on Quest in certain situations.", "The dates affected and degree of incapacitation will be used to determine follow-up action."]}, {"course_id": 58, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 66, "course_code": "ECON 372", "course_name": "ECON372 - Business Finance 2 (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["Business Finance 2 Fall 2024", "ECON 372", "10:00AM - 11:20AM DWE 3517", "For your convenience, office hours will be both in person and through MS Teams on a first-come-first-serve basis.", "Email: prajsic@uwaterloo.ca", "“ECON 372” must appear in the subject line and the message must include your full name and student ID number.", "This course examines a number of topics relevant to financial practitioners.", "View requirements for ECON 372", "The purpose of this course is to provide students with advanced topics in corporate finance and their applications.", "The key concepts and topics to be covered include security valuation, risk and return, risk diversification, capital asset pricing model (CAPM), investment performance measurement, financial derivatives, and forecasting.", "Students will learn how to apply these concepts to real world problems using various examples and case studies.", "The course deepens the general framework of financial landscape offered in ECON 371 by discussing the role of financial instruments and institutions in the economy.", "The goal is to develop a deeper understanding of financial markets and investment strategies.", "understand the need for firms and individuals to make financial decisions and together work towards overcoming the universal problem of scarcity;", "appreciate the relevance of finance in a changing world;", "explain why maximizing market value is the logical financial goal of the corporation", "calculate and interpret some key measures of firm performance", "understand and apply the Capital Asset Pricing Model", "describe how options markets can be used to manage risk", "identify different types of debt financing available to a firm", "understand why investment decisions, rather than financing decisions, fundamentally determine the value and cost of capital of the firm", "create pro forma income statements and balance sheets.", "Introduction to Advanced Business Finance:", "Review of Key Concepts in Finance", "Review of Key Concepts in Finance", "Capital Markets and the Pricing of Risk", "Capital Markets and the Pricing of Risk", "Determining the Cost of Capital", "Determining the Cost of Capital", "Risk and the Pricing of Options", "Financial Planning and Forecasting:", "Financial Modeling and Pro Forma Analysis", "The purpose of the review quizzes is to help students identify and understand key concepts covered in the lectures and in the textbook.", "The persuasive essay assignment is supposed to incorporate theoretical aspects of the course that are communicated to a general audience with some basic background and interest in financial issues.", "Under the Training & Support tab, you will find helpful information including technical support.", "Midterms and Final Exam", "The format for midterms and the final exam will be a mix of multiple-choice questions, numerical calculation questions, and written problems.", "Missing a Midterm Due to Self-Isolation", "Please carefully read the Economics Department policy on deferred final exams for instructions.", "Intellectual property includes items such as:", "Do you want professors and interviewers to call you by a different first name?", "Phone: 519-884-0000 extension 213", "Full details can be found online on the Faculty of Arts website", "Cross-listed courses", "Economics Department Deferred Final Exam Policy"]}, {"course_id": 69, "course_code": "INDEV 100", "course_name": "INDEV100 - Introduction to International Development (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to International Development Fall 2023", "Students obtain an overview of the multi-dimensional and transdisciplinary nature of development.", "Themes include theories and strategies of development; history of development; relevance of context (culture, economics, and politics); the impact of law and international regulatory bodies; environmental influences; urbanization; the factors of health, literacy and violence; development agencies.", "Reference is made to particular development problems in specific developing countries.", "Discriminatory and intolerant language is unacceptable, but openness about these complicated issues is encouraged using thoughtful and respectful language.", "You can expect the instructor to respond to emails within 48 hours exclusive of weekends and holidays.", "To identify and critique the history of International Development concepts, theories, actors, and institutions.", "To explain and assess key development issues in the field of International Development.", "Is International Development legitimate?", "Tentative guest speakers are also indicated in the schedule below.", "Sep 21 Colonialism and Post-Development   Haslam et al.", "Nov 24 Tutorial: The City Water Index & the multi-facetedness of development issues.", "12 Nov 28 Democracy in Development   Haslam et al.", "Introduction to International Development: Approaches, Actors, Issues and Practices.", "Participation is defined in this course as frequent and relevant contributions to in-class discussions, in the form of either questions or comments, that provide new critical insight or knowledge and foster an environment of inclusivity and respect in the classroom.", "Each quiz has 20 multiple-choice questions which cover the main concepts and ideas of the section of the curriculum.", "Do not email the instructor until you have read and completed the following.", "Please be sure to read the rubric before starting your assignment.", "your name and student number;", "**Please note that your mark can be raised, lowered, or remain the same through a re-grade**", "*", "*", "* Please submit your paper for consideration by email to the instructor no later than one week following your receipt of the decision by the TA.", "Include a formal business letter that includes the following information:", "your name and student number;", "Anti-racism Statement: The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Mental Health: The University of Waterloo, the Faculty of Environment and our Departments/Schools consider students' well-being to be extremely important.", "The WatSAFE app provides on- and off-campus contacts for students in distress, including international students, and other information related to campus safety and security."]}, {"course_id": 72, "course_code": "STAT 231", "course_name": "STAT231 - Statistics (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "03:30PM - 04:20PM DC 1350", "02:30PM - 03:20PM", "11:30AM - 12:20PM MC 1085", "03:30PM - 04:20PM", "10:30AM - 11:20AM EIT 1015", "09:30AM - 10:20AM EIT 1015", "Email: aslynko@uwaterloo.ca", "Email: liqun.diao@uwaterloo.ca", "Email: yangjc@uwaterloo.ca", "Email: henan.xu@uwaterloo.ca", "Funmilayo Adeku", "Email: fadeku@uwaterloo.ca", "This course provides a systematic approach to empirical problem solving which will enable students to critically assess the sampling protocol and conclusions of an empirical study including the possible sources of error in the study and whether evidence of a causal relationship can be reasonably concluded.", "The connection between the attributes of a population and the parameters in the named distributions covered in STAT230 will be emphasized.", "Numerical and graphical techniques for summarizing data and checking the fit of a statistical model will be discussed.", "The method of maximum likelihood will be used to obtain point and interval estimates for the parameters of interest as well as testing hypotheses.", "The interpretation of confidence intervals and p-values will be emphasized.", "The Chi-squared and t distributions will be introduced and used to construct confidence intervals and tests of hypotheses including likelihood ratio tests.", "Contingency tables and Gaussian response models including the two sample Gaussian and simple linear regression will be used as examples.", "Course Information Webpage", "Please do not send these questions via email.", "I expect everyone to be respectful to each other, any posts that do not meet the principles in Policy 33: Ethical Behaviour will be removed.", "Email", "Please send emails from uwaterloo.ca email address and include the session number and student ID number.", "Continuity Plans", "Use numerical and graphical summaries of a data set to describe the characteristics of a variate and to check the fit of a statistical model to the data.", "Use the steps of PPDAC to identify both the objectives and possible sources of error in an empirical study, and to critically evaluate the conclusions.", "Identify the connection between attributes of a population and the parameters in the named distributions (Binomial, Poisson, Multinomial, Exponential, Normal).", "Define and use the likelihood function to obtain point estimates of the unknown parameters in a model particularly for the Binomial, Poisson, Multinomial, Exponential and Gaussian (Normal) models.", "Use a pivotal quantity to construct a confidence interval for a parameter in some specific cases, and interpret the confidence interval.", "Use the likelihood function to construct and conduct a test of hypothesis for an unknown parameter in a model.", "Interpret p-values and describe the connection with confidence intervals.", "Define the properties of the Chi-squared and t distribution.", "Define a Gaussian response model including simple linear regression; determine point and interval estimates and conduct tests of hypotheses for the parameters in a Gaussian model.", "Use a Goodness of Fit test to test the fit of a model, independence in a two-way table and equality of proportions for two or more groups", "Describe the importance of randomization and pairing in experimental design and be able to recognize whether a study design allows the researcher to conclude cause and effect.", "This learning consists of taking the time to carefully read the course notes on your own, making sure you understand the concepts and steps demonstrated in the lectures to tackle examples, and then solving the end-of-chapter problems.", "Monday", "Friday", "Welcome", "1.1 Introduction to Statistical Sciences", "1.3 Numerical Data Summaries", "1.3 Graphical Summaries", "1.4 Probability Distributions and Statistical Models", "1.5 Data Analysis and Statistical Inference", "1.6 Introduction to R and RStudio", "2.1 Choosing a Statistical Model", "2.2 Estimation of Parameters", "2.3 Method of Maximum Likelihood", "2.4 Likelihood Functions for Multinomial Models", "2.5 Invariance Property of MLE", "2.6 Checking the Model", "3.1 Planing and Conducting Empirical Studies", "3.2 Steps of PPDAC", "3.3 Case Study", "4.1 Statistical Models and Estimation", "4.2 Estimators and Sampling Distributions", "4.4 Confidence Intervals and Pivotal Quantities", "4.5 The Chi-Squared and t Distributions", "4.6 Likelihood-Based Confidence Intervals", "4.7 Confidence Intervals for Parameters in the Gaussian model", "4.7 Confidence Intervals for Parameters in the Gaussian model (Continued)", "5.1 Introduction to Hypothesis Testing", "5.2 Test of Hypotheses for Parameters in the Gaussian Model", "Relationship Between Hypothesis Testing and Confidence Intervals", "5.3 Likelihood Ratio Test of Hypothesis - One parameter", "6.1 Gaussian Response Models", "6.2 Simple Linear Regression: Maximum Likelihood and Least Squares Estimates", "Confidence Interval for Parameters in the Model", "6.3 Checking Model Assumptions and Residual Plots", "Randomization, Paring, and Experimental Design", "7.1 Likelihood Ratio Test for the Multinomial Model", "7.2 Goodness of Fit Tests", "This learning consists mostly of making sure you understand the concepts and steps that were introduced and used in class to solve examples and then solving problems from the Course Notes on your own.", "R Statistical Software", "R and the RStudio development environment can be downloaded from here.", "All assessments are proctored, in-person, and closed-book exams.", "A 2.5-hour cumulative final examination will be held during the final exam period (April 9 - 25, 2025).", "If you have a question regarding the marking of an assessment, you should first check the posted solutions on LEARN.", "First and last name", "Session number", "Please be specific and explain your rationale for a remark.", "Notice of Recording", "Short-term absence", "COVID-19-related absence", "No limits on number of submissions per term and only available during the formal lecture period", "In particular:", "Please inform us of these at the start of the course.", "This course includes the independent development and practice of specific skills.", "Library for research-based assignments"]}, {"course_id": 73, "course_code": "STAT 333", "course_name": "STAT333 - Stochastic Processes 1 (0.50)", "term_name": "Approved Courses List", "program_name": "Science and Business", "program_id": 146, "major_id": 2, "major_name": "Science and Business - Biochemistry Specialization (Bachelor of Science - Honours)", "topics": ["11:30AM - 12:20PM DC 1350", "04:00PM - 05:20PM", "Erik Hintz: Fridays, 2:00pm - 3:00pm, in M3-2106", "Requests must be emailed to: sasugradadv@uwaterloo.ca", "Topics cover generating functions, conditional probability distributions and conditional expectation, discrete-time Markov chains with a countable state space, limit distributions for ergodic and absorbing chains, applications including the random walk, the gambler's ruin problem, and the Galton-Watson branching process, an introduction to counting processes, connections between the exponential distribution and Poisson process, and non-homogeneous and compound Poisson processes.", "use moment generating functions as a tool to determine expected values and identify probability distributions of random variables;", "use the law of total expectation to calculate expected values and probabilities through the principle of conditioning;", "specify a discrete-time Markov chain (DTMC), in terms of its transition probability matrix and initial conditions, and calculate various transition probabilities;", "classify the states of a DTMC;", "define fundamental DTMC concepts including irreducibility, periodicity, and recurrence/transience;", "find limiting/stationary probability distributions for certain DTMCs through the use of the Basic Limit Theorem;", "calculate absorption probabilities and expected absorption times for DTMCs using the principle of conditioning with respect to the first transition;", "Week 11 March 24 - March 28 Chap 4: Exponential Distribution & Poisson Processes Tutorial Assignment 2", "Week 12 March 31 - April 4 Chap 4: Exponential Distribution & Poisson Processes Tutorial Test 3", "This learning consists mostly of making sure you understand the concepts and steps that were used in class to solve problems and then solving exercises from the Course Notes on your own.", "Introduction to Probability Models by Sheldon M. Ross (2019)"]}, {"course_id": 0, "course_code": "CHEM 120", "course_name": "CHEM120 - General Chemistry 1 (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry 1 Winter 2025", "RCH 101", "The stoichiometry of compounds and chemical reactions.", "Energy changes in chemical systems.", "Electronic structure of atoms and molecules; correlation with the chemical reactivity of common elements, inorganic and organic compounds.", "The second part of this course is concerned with explaining periodicity and trends in chemical reactivity in terms of the electronic structure of atoms and molecules.", "Topics covered in this part of the course include the quantum theory of the hydrogen atom; electron configurations in multi-electron atoms; ionic and covalent bonding; Lewis structures, valence shell electron repulsion theory and molecular geometry; quantum mechanical bonding theories, including valence bond theory and molecular orbital theory.", "Additional topics may include an introduction to electron-transfer reactions, including the assignment of oxidation states and the balancing of oxidation-reduction reactions.", "assess the greenness of a chemical reaction using Atom Economy and E-Factor metrics.", "describe the electronic structure of atoms in terms of quantum theory using atomic orbitals and quantum numbers.", "justify the organization of the periodic table and predict trends in the properties of the elements.", "describe bonding in molecules in terms of atomic orbitals and molecular orbitals, and explain molecular shape and stability in terms of electron count.", "describe the interactions of molecules in solids, liquids, and gases to compare physical and reactive properties.", "Course Structure and Continuity Plans", "No extensions will be granted for Participation Challenges, but each student can drop one participation challenge from their overall grade.", "Printed spiral bound copies of the course notes can be purchased online from the UW bookstore https://wstore.uwaterloo.ca/", "You are not required to hand in solutions to these problems; the responsibility to do them is yours.", "Details for each test will be posted on LEARN approximately one week in advance.", "If you miss a test for a valid reason, the weight of the missed test will be transferred to the final exam.", "Self-declare pandemic-related illnesses on Quest (Information at this link)", "Self-declare a short-term absence on Quest – Not applicable to the Final Exam Period (Information at this link)"]}, {"course_id": 1, "course_code": "CHEM 120L", "course_name": "CHEM120L - General Chemistry Laboratory 1 (0.25)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 1 Fall 2024", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "Email:  sckramer@uwaterloo.ca", "Be sure to record their name and contact information in your lab manual.", "Skillfully perform basic procedures necessary to work in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Correctly display, critically assess, and draw conclusions from experimental data", "Produce a written laboratory report which effectively communicates scientific ideas and supports them with appropriate evidence", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "1,3,5,7,9,11", "Laboratory Introduction, Locker Check-In and Skill Development Exercise", "Sept 19 - 24", "1,3,5,7,9,11", "Studying the Reactions of Copper", "- produce a variety of Cu compounds", "1,3,5,7,9,11", "- studying cis and trans isomers", "Oct 24-29", "1,3,5,7,9,11", "Titration as an Analysis Tool", "- identify an unknown solid acid", "1,3,5,7,9,11", "Introduction to Chromatography", "- quantify a cation using ion exchange", "1,3,5,7,9,11", "- identify substances using atomic spectra", "TBA"]}, {"course_id": 3, "course_code": "CHEM 123L", "course_name": "CHEM123L - General Chemistry Laboratory 2 (0.25)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["General Chemistry Laboratory 2 Winter 2025", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "02:30PM - 05:20PM", "10:00AM -", "10:00AM -", "Email:  sckramer@uwaterloo.ca", "Questions sent in the wee hours of the morning on the day your report is due may not receive a response in time!", "At that time, you should record their name and contact information in your lab manual.", "Perform all basic skills required for working in a chemistry laboratory", "Demonstrate various laboratory techniques, using standard tools and equipment", "Evaluate and follow scientific protocols, and modify them as required", "Appropriately display, critically assess and draw conclusions from experimental data", "Effectively communicate scientific ideas and support them appropriately", "Maintain a workspace that ensures a safe environment for themselves and others", "Recognize the extensive applications of chemistry in everyday life", "Sections", "Introduction, Check-In and", "Spectrophotometric Analysis", "- measuring energy changes in reactions", "- acid/base titrations and buffers", "- a real life analysis", "TBA", "Illness:  Absences due to illness must be documented by an official Verification of Illness form and are assessed on a case-by-case basis.", "In the email include the specific reason for your request and attach all relevant supporting documentation."]}, {"course_id": 4, "course_code": "CHEM 237", "course_name": "CHEM237 - Introductory Biochemistry (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "08:30AM - 09:20AM", "RCH 101", "10:30AM - 11:20AM RCH 101", "ESC 227", "Structure and properties of proteins and enzymes.", "develop a molecular level understanding of biological processes to achieve this the following learning outcomes will be", "in both qualitative and quantitative examples", "evaluate unknown thermodynamic parameters from given values of others.", "I equilibrium constants from standard free energy changes.", "qualitatively describe the composition of solutions of a weak acid or base as a function of pH.", "calculate the precise", "recognize the 20 amino acids that are commonly found in proteins and identify compounds derived from them", "calculate the charge on an amino acid side chain as a function of pH", "know the 4 levels of protein structure and the covalent and non covalent interactions that stabilize them", "explain how to purify proteins using the physical and chemical properties of the proteins", "determine the primary sequence of a protein given the appropriate data", "understand basic chemical kinetics and the application to biological systems", "determine the mechanism of inhibition of an enzyme using", "the structure of fatty acids and membrane lipids", "the structures of cell membranes and how the fatty acid composition of those membranes affects membrane structure and fluidity", "the structure of simple sugars and polysaccharides and the chemistry of the reactions in which they participate", "Suggested supplementary reading in \"Biochemistry Free for All\".", "Biochemistry free for all: Introduction Water and Buffers, pages 34-49", "VVP chapters 3 and 4.1", "Biochemistry free for all pages 53-70", "Appendix A.1 and A.2", "Chapter 4.2 and 4.3", "Biochemistry free for all.", "pp 74-108", "Week 6  Protein folding and Introduction to hemoglobin", "Chapter 4 - Biochemistry in focus", "Biochemistry free for all pages 128-141", "first kinetics Chapter 10 then mechanisms Chapter 9", "Biochemistry free for all pages 337-362", "Biochemistry free for all pp 190-217", "Biochemistry free for all pp 222-233", "Biochemistry free for all pp 287 - 312", "Notice of Recording"]}, {"course_id": 8, "course_code": "CS 100", "course_name": "CS100 - Introduction to Computing Through Applications (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Introduction to Computing Through Applications Winter 2025", "Friday -", "Friday", "10:30AM - 12:20PM MC 3005", "10:30AM - 12:20PM MC 3027", "Dave Tompkins", "E-mail: dtompkins@uwaterloo.ca", "E-mail: cs100@uwaterloo.ca", "Introduction to the Internet, World Wide Web, HTML, and XML.", "Algorithms underlying the functional components of web search engines and their influence on data access.", "CS 100: Introduction to Digital Information, Computers, the Internet and Applications", "Explain the emerging computing technologies introduced in the course.", "Digital Information", "Computer + Network organization", "Dynamic web pages and web applications", "Privacy and security", "Emerging Topics", "Distributed networking and \"big data\"", "Artificial intelligence", "ChatGPT and large language models", "Social media and monetization", "A1 released", "Laptops, Devices and Software", "Library for research-based assignments"]}, {"course_id": 11, "course_code": "ECON 221", "course_name": "ECON221 - Statistics for Economists (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Statistics for Economists Winter 2025", "ECON 221", "ECON 221 001", "08:30AM - 09:50AM HH 334", "Email: pchausse@uwaterloo.ca", "Clinic: There is a clinic to help students with ECON 211 and ECON 221 every Tuesday and Wednesday from 3:00PM to 4:30PM in HH 235.", "ECON 221:", "This course introduces students to describing economic data and drawing inferences from features of economic data.", "Starting from fundamental axioms of probability, students will learn about the calculation of probabilities of basic events and the features of random variables, the most important tool for representing the outcomes of complex economic phenomena.", "Students will describe discrete and continuous random variables via their probability distributions and summary statistics such as means and standard deviations, as well as the relationships between two random variables in terms of covariance, correlation, and simple regression models.", "The concepts of hypothesis testing and confidence intervals, and the fundamentals of statistical inference are discussed for basic features of random variables and for comparing the features of more than one random variable.", "View requirements for ECON 221", "evaluate and conduct elementary data analysis", "use probability theory to model uncertain outcomes", "conduct basic statistical inference", "Introduction (First lecture)", "Estimators and Inference on the mean: Chapter 8 of K", "Inference on the variance and the chi-square distribution: Chapter 11 of HID", "Students will submit two files: plain-English data analysis in one text file and the associated computer code used to conduct the analysis in another text file.", "Exercises will be given and reviewed.", "Economics Department Deferred Final Exam Policy", "Applications for Accommodation", "This course includes the independent development and practice of specific skills, [insert relevant course-specific Learning Outcomes].", "Library for research-based assignments", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}, {"course_id": 17, "course_code": "SCBUS 223", "course_name": "SCBUS223 - Workshop 2: Strategies Behind Technological Innovation (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Workshop 2: Strategies Behind Technological Innovation Fall 2024", "03:30PM - 04:20PM MC 4021", "Students working in groups analyze real business ventures, their launch, and growth, synthesizing major field research to develop a term deliverable in the form of a company report and final project presentation.", "Students engage in experiential learning involving theory, case studies, scientific team debates, and critical reasoning.", "SCBUS 223 Strategies Behind Technological Innovation", "Email: kmemon@uwaterloo.ca; https://www.linkedin.com/in/kashifmemon/", "Email : djhaveri@uwaterloo.ca", "A warm welcome to everyone!", "Email: djhaveri@uwaterloo.ca", "Students will also organize an in-depth written and oral presentation of the results of the study, while working as a member of a team.", "It is important to recognize that there is no “best practice” to manage innovation and hence to understand the true meaning of innovation the course will be supplemented by case studies “Innovation Debates” from Harvard Business Review, specific case studies from the textbook, and class discussions.", "This means you will act and communicate professionally, as you will with co-workers.", "Work professionally in groups and contribute to the group objectives and product.", "Deliverables", "Participation in class discussions is required and will be graded using the criteria outlined below in table – A. Marks for contribution to class discussions will be based on how well your comments relate to key concepts in the course.", "This will be enforced, and attendance will not be recorded for late comers.", "Please ask students to complete the absence declaration form in Quest in lieu of email request to yourself or a conversation.", "Student makes regular high-quality contribution", "relates the issues under discussion to key concepts in the", "understanding of topics but does not relate the issues", "under discussion to key concepts in the course.", "name tag displayed in majority of classes.", "relate issues under discussion to key concepts in the", "Very minimal contribution to class discussions, MS TEAMS", "No contribution to class discussions, MS TEAMS group", "Submit the Summary of the assigned case to the Case Study Summary LEARN Dropbox by MONDAY Afternoon BY 1.00 pm each week before their presentation the next class.", "These Innovation Debates bring 2 groups against each other every week.", "It contains very important on responsibilities of each team member within the project.", "Panel Boards", "This will be enforced, and attendance will not be recorded for late comers.", "Excuses such as “I was not comfortable in reporting the member that did not want to work” are not acceptable and will result in poor marks for the entire group.", "It is the responsibility of each member to report non-contributing members early on.", "As individual team members, your responsibilities include serving as a team leader and being a team player.", "To help your group define a clear understanding of responsibilities, each group will prepare a group contract at the beginning of term.", "A fragmented or disjointed submission assignment created by a group working primarily in isolation will most likely be obvious and of poor quality leading to a poor grade.", "Note: Missing APA citations, in-text or full references list page, missing correspondence between in-text citations and reference section, and missing APA formatting will result in a mark of zero out of THE TOTAL MARK in the assignment.", "THE ONE AND ONLY EXCEPTION", "Please refer to in-text citation, reference list, general formatting and sample paper and other tabs as needed for 7th edition APA citation and formatting guidelines.", "Failure to follow these instructions may be in contravention of Policy 71 (Student Discipline).", "Re-creating test questions and answers without the express permission of the course instructor", "2:30-4:20", "Company choice to be first come first served basis.", "For example, “the company promised us and backed out” or “we are trying to find a company in our field of interest are not acceptable.”", "Innovation Debate 1 – Group 1 vs. Group 2", "You Need an Innovation Strategy", "It’s the only way to make sound trade-off decisions and choose the right practices.", "Does every innovation need a “strategy”?", "innovation can survive without a strategy)", "Innovation Debate 2 – Group 3 vs. Group 4", "Turn Your Science into a Business", "Oliver Alexy", "Innovation Debate 3 – Group 5 vs. Group 6", "Lean business model", "Steve Blank", "MVP, minimum viable product” and “pivoting are key concepts in this.", "The lean startup is a bad and bankrupt philosophy for mediocre people with mediocre vision and ambition", "For example, “the company promised us and backed out” or “we are trying to find a company in our field of interest are not acceptable.”", "The information needs to be comprehensive and clear.", "successful innovations in emerging markets that", "are then exported as knowledge and", "each market has its own innovation needs/", "How Apple Organizes for Innovation", "[DJ1]wording a little confusing"]}, {"course_id": 19, "course_code": "SCBUS 323", "course_name": "SCBUS323 - Workshop 3: Technology Development (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Notice of Recording", "SCBUS 323 - Technology Development Fall 2024", "The major class project focuses on the development of a business plan for a product that could be commercialized.", "View requirements for SCBUS 323", "By the end of this course, you will develop the concept and business model for your own technology-based product, and demonstrate this idea using a prototype or proof of concept.", "Identify a Business Opportunity", "Market Analysis", "Industry Analysis", "Technology Analysis", "Formulate Problem", "Stakeholders", "Ideate Solution", "Technical solution", "Business Model", "Prototype Solution", "Prototyping techniques", "User Testing", "Scaling", "Persuading users", "Synthesize trends in different industries, markets and areas of technology to identify high-impact business opportunities", "Formulate a specific technical problem that can be solved based on the synthesis", "Plan a product development cycle to develop and prototype a technology-based solution to the formulated problem", "Design a technical solution and business model that could be used to benefit from the business opportunity", "Prototype and test the concepts relevant to the proposed technical solution and business model to demonstrate their feasibility, and product-market fit", "Pitch the technology-based product to various stakeholders to persuade a funder to invest in your product, and entice users to use the product", "In addition to its own Learning Outcomes, this course integrates knowledge and concepts relevant to product design and development from your other courses.", "Working in teams (team canvas, team charter, team roles and strategies, motivation, stages of team development, conflict and crisis resolution, leadership, team norms and ways of working) - SCBUS 122", "Business models - MGM 220", "Ethical decision making (utilitarian, golden means, duties-based and rights-based ethics, ethical problem solving process) - SCBUS 122, 225", "As each group selects a unique product to develop, you will also have an opportunity to develop your lifelong learning and independent self-learning capabilities.", "Introduction", "Product Lifecycle and Development", "Identify", "Problem formulation", "Requirements and User Stories", "User Need and Empathy Map", "Service Environment", "Stakeholders", "Formulate", "Creative Problem Solving and Design Thinking", "Solution Development Process", "Idea Generation and Selection", "Design", "Technology and Innovation", "Identify", "Customer Discovery Model", "Knowing Your Business Environment", "Design", "Fundraising and Incubation", "Quantified Metrics and Risks", "Detailed Design", "Prototyping and Testing", "Scaling Up and Long Term Trends", "DFX and Broader Considerations", "Business plans and pitches", "Presentation 3: SCBUS 323 Technology Development Spotlight", "Ethics of Product Design", "Design", "Exam Period", "Assignment 3: Product Design Documentation", "Ms Teams Used as a file repository and communication tool for teams Yes", "Assignment 3: Product Design and Business Model report + investment one-pager 20%", "Presentation 3: Product Demo and Interactive Pitch 10%", "In-class activities", "Participation in each question will score you one point.", "You will be graded as follows for each in-class activity:", "Team1-week1-class_activity", "Progress Meetings and Reports", "ITP Metrics will be used for Peer Assessment.", "Understanding of concepts beyond that of the typical junior student.", "4.5", "Understanding of the concepts and their importance, along with insight into how they can be used to optimize team performance.", "A strong positive force that makes a beneficial contribution to the team, in addition to bringing out the best in other team members.", "Understanding of the concepts and their importance.", "3.5", "Understanding of the concepts and their importance.", "Understanding of the concepts and their importance, and exhibit a growth trajectory at the end of the term.", "2.5", "Understanding the concepts and their importance.", "Understanding of the concepts.", "Superficial understanding of most basic concepts.", "Superficial understanding of some concepts", "Sparse understanding of the concepts.", "No understanding of the concepts.", "The professionalism of your communications with your team,  and members of the teaching team", "Negative Behaviour - Major Infraction", "Missing team meetings without valid reason or advanced notice to the team (handled on a case by case basis)", "Any minor infraction with intent to deceive or commit fraud (handled on a case by case basis)", "Negative Behaviour - Minor Infraction", "No greeting", "Positive Behaviour", "Creativity in activities (good brainstorming, use of flip charts to keep the ideas flowing, etc)", "Receives constructive feedback well", "Gives constructive feedback well", "Exhibited a pattern of self-improvement over the course of the term", "Notice of Recording", "General Information", "Students may request a meeting in person to give evidence of the error and to explain the problem.", "Misinterpretation of a course concept", "Working in Groups", "To help your group define a clear understanding of responsibilities, each group will prepare a team charter at the beginning of the term.", "The Attribution Table should be reviewed by all of the team members prior to submission to make sure that all members agree on the information given in the table.", "If the Attribution Table indicates a substantial discrepancy in contribution (i.e. a large difference in team member contributions) then the marks assigned to individual team members for the assignment may reflect this discrepancy.", "If the instructor is convinced that there was a discrepancy in contribution (as shown in the attribution table), then the instructor will decide on a reduced mark for the team member(s) who contributed substantially less.", "A team member doing a larger share of the work WILL NEVER receive a higher mark than the team mark.", "Your Instructor can help you resolve these issues and help you, as a team, develop strategies for working successfully with each other.", "Remember: most projects do NOT fail for technical reasons; they fail because of planning and team problems.", "Firing a team member is a strategy of last resort.", "The team will issue a warning E-mail to the person informing him or her of the situation, i.e. that the person will be fired from the team unless change occurs.", "The E-mail must use a professional tone and cite specific behaviours that the person must change in order to remain part of the team and deadlines for those changes to occur.", "The goal of these meetings is to:", "This is done in a E-mail copied to the instructor.", "Quitting a team is a strategy of last resort.", "You will issue a warning E-mail to your team informing them of the situation, i.e. that you are ready to quit the team unless change occurs.", "The E-mail must use a professional tone and cite specific behaviours that the team must change in order for you to stay.", "The goal of these meetings is to:", "This is done in a E-mail copied to the instructor.", "The E-mail shall briefly cite the reasons for the departure.", "If you are ever in doubt whether something constitutes plagiarism ask a member of the teaching team.", "It is best practice to reference even public domain images where possible.", "It is unethical and illegal to give away intellectual property that does not belong to you without the permission of the owner, in this case the whole team.", "Intellectual property includes items such as:", "Writing and Communication specialists offer one-on-one support in planning assignments, synthesizing and citing research, organizing papers and reports, designing presentations and e-portfolios, and revising for clarity and coherence.", "A list of the main services provided below:", "Good2Talk, free confidential helpline for post-secondary students - 1-866-925-5454", "KW Sexual Assault Support Centre - 519-741-8633"]}, {"course_id": 25, "course_code": "AFM 231", "course_name": "AFM231 - Business Law (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["07:00PM - 09:50PM", "Students can contact the course instructor via email at rhussein@uwaterloo.ca.", "Particular attention is given to the law relating to contracts and business organizations.", "AFM 231: View requirements for AFM 231", "While the course introduces you to basic concepts in law, it is designed for, and particularly emphasizes topics that will be of specific relevance to you as future business managers, owners, or even practicing professionals.", "This includes understanding the basics of legal risk so you can make more effective business decisions.", "Business managers/owners often must engage in risk management exercises.", "Appreciate the complexity of integrating multiple private law concepts into the analysis of a business situation.", "Utilize a basic framework for legal risk management assessments and generate an inventory of possible legal risk management tools.", "Describe the common as well as contrasting relationship between legal compliance and ethical conduct.", "March 24-28", "Wrap-up", "Accordingly, if students do opt to use an older edition it would be advisable to use an edition that is as close to the 8th edition as possible and consider cross-referencing it to the current edition and noting any differences.", "Completion", "The response demonstrates a clear understanding of the relevant course concepts and effectively applies these concepts to the hypothetical scenario.", "Application to Real-World Example", "The response includes an appropriate real-world example that relates to the course material, illustrating how the concept can be applied outside the context of the hypothetical.", "Students may also include a revised answer based on a similar but different set of hypothetical facts.", "For example, a student may propose one solution based on the given facts but suggest a different solution if the facts were altered.", "Students are expected to demonstrate critical thinking and clearly articulate their reasoning.", "Each quiz covers content that relates to the current course content (the current chapters and occasionally a prior chapter as well if it has not yet been part of a quiz).", "Submission Times", "Reevaluation Request", "Requests for re-evaluation of submitted material can be done via email.", "Also, students should detail what their concern as specifically as possible.", "Artificial Intelligence Tools", "Also, some evaluation elements are structured such that it may be even quicker to do it yourself than to utilize an AI tool and then further edit/revise before submission.", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "Cross-listed courses", "Intellectual property includes items such as:", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "School of Accounting and Finance Academic Integrity Expectations", "What you practice at the University of Waterloo and in SAF will inform and even define who you are as an A&F professional.", "As a student at the University of Waterloo and in SAF you are expected to know what constitutes academic integrity, avoid committing offences and take responsibility for your actions.", "Participating in the course introduction and reviewing the course syllabus are basic expectations and are helpful regarding course specific academic requirements.", "Specific considerations for SAF students:", "Students majoring in accounting and finance programs at UWaterloo should be aware that, due to the highly structured nature of the study plans and the fact that many AFM courses are offered on a limited basis, a penalty imposed because of an academic offence could result in a significant delay of the student’s degree completion and convocation dates - particularly if the penalty involves a suspension.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period.", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts."]}, {"course_id": 28, "course_code": "ENGL 193", "course_name": "ENGL193 - Communication in the Sciences (0.50)", "term_name": "Required Courses", "program_name": "Science and Business", "program_id": 146, "major_id": 3, "major_name": "Science and Business - Biology Specialization (Bachelor of Science - Honours)", "topics": ["Communication in the Sciences Winter 2025", "ENGL 193", "10:00AM - 11:20AM EV3 3406", "E. Urquhart", "Instructor: Dr. Emily Urquhart", "Email: Emily.urquhart@uwaterloo.ca", "In this course students will enhance oral and written communication competencies in contexts relevant to the life sciences and physical sciences.", "View requirements for ENGL 193", "Design, draft and persuasively deliver scientific communications to expert and non-expert audiences.", "Practice collaboration and peer review in support of iterative communication design processes, including revision.", "Describe and appraise the purposes and ethical concerns of science communication.", "Date Topic / Lesson Readings & Modules Assignments & Reminders", "Introduction to the course", "Nelson-McDermott et al., “Writing about science: A closer look.”", "Assigned", "Citation and documentation of sources and the principals of science literature review", "Read and familiarize yourself with these readings for next class", "Three-Minute-Thesis", "Hoffman, “Posters and Conference Abstracts,” on LEARN", "Visit to Earth Sciences Museum", "TBA", "Meet at the Museum in EIT!", "Talks", "Talks", "Director of Public Communications & Public Engagement", "Perimeter Institute for Theoretical Physics", "Poster Critique", "No readings STC 2002", "Science and Society: An Anthology for Readers and Writer by Catherine Nelson-McDermott (Editor), Don LePan (Editor), Laura Buzzard (Editor)s You can use any edition of this book.", "Students will share the cost of printing a scientific poster with the members of their presentation group.", "Double-spaced", "Missed in-class contributions: These cannot be made-up.", "There are many opportunities to earn these marks, but you will miss out on these if you do not come to class.", "Grade challenges: You may resubmit an assignment for re-grading only if you provide a detailed letter explaining why the concepts and the criteria of the course justify a different grade.", "EMAIL", "ATTENDANCE & TARDINESS", "Pronouns and chosen or preferred first name", "Your legal first name will always be used on certain official documents, such as diplomas and transcripts.", "On campus supports", "Other on-campus supports", "Off campus supports", "St. Mary's Hospital - 519-744-3311", "As well as short-term support for family members or friends of sexual assault survivors.", "More information about resources and supports for students can be found online in on the Faculty of Arts Student Support page.", "Intellectual property includes items such as:", "The University of Waterloo does not tolerate racism or any other form of discrimination and expects campus community members to contribute to a culture where all members feel safe and valued.", "The University of Waterloo has a number of multi-faith spaces that students can use for faith-based practices.", "No in-person course activity is permitted during the period of a self-declared COVID absence.", "Students can self-declare one short-term absence per term on Quest for any reason.", "The student has only one self-declared short-term absence per term and this absence can only be used during the formal lecture period."]}]